{
    "title": "What's the best way to discover new music? - Quora",
    "tags": [
        "Social and Online Music Startups"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ashley Buerkett",
                "href": "/profile/Ashley-Buerkett"
            },
            "answer_text": "This constantly changes for me as new bands are formed and new sites/blogs/services are started every single day. It can be really hard to keep up with. Luckily, I am a designer and I pretty much cannot work without music in the background, so IThe best thing overall is to never get complacent with one thing, ever.  Spotify The music headquarters for me right now. Totally worth the $5/$10 month to have access to it whenever I want. I use it over iTunes because I can store my mp3s in it as well as all of the streaming media and it fits in one place. I use it over Rdio simply for the amount of music that's available plus all of the apps available on here are great for music discovery. I check in with the Pitchfork one daily, wether it be on the app or the site itself. I also use Classify, Tunigo, Soundrop, Swarm.fm, and several others.Blogs like Pitchfork are nice. There are so many out there that I can't really think of general ones to recommend. Also, I can't believe I'm about to suggest this because I really don't like music \"labels\" but try to categorize the kind of music you like as best you can and google away. You're bound to find a community that is into the same thing you are and probably has a few resources and blogs to boot.Last.fm is great for keeping track of things you've heard and listen to and it's also really helpful to find people with similar tastes as well as similar artists for ones you already like.turntable.fm can be hit or miss depending on what room you find. The idea though is that you take turns with up to 5 people playing songs. You can find them in a huge database or upload your own which is nice. Rooms usually go by theme/genre and can be more social than most music sites.8tracks is pretty great for discovering playlists, it's that simple.Soundcloud is a great resource for DJs and other musicians who are just starting up. Stuff usually isn't quite as polished but it can be pretty great. Best for remixes/mashups.Bandcamp similar to Soundcloud and great for the same reasons.Vimeo/Youtube are an obvious ones but I can't leave them off the list.Wavo.me is a new one I've been messing with thats nice because it's more visual. It's essentially a youtube but with a guide attached.Record Stores Duh. There's nothing like physically sifting through records or cds if you're in a good store. It's also really important for me to get off the computer. The staff can usually be helpful if you like something but want an actual human recommendation.The New Myspace is not bad actually. You can make playlists, connect with artists and follow other users. It's also just much prettier now with the new redesign.Soundtracking is a fun little iPhone app where people attach songs with photos. It's nice one-off discoveries.Friends This can only be good advice if your friends like good music I suppose :)HypeM is good but I think the structure leaves something to be desired for me. Can't quite put my finger on it.Who Sampled is just a must! There's nothing more infuriating than hearing someone talk about how \"original\" a cover is without knowing who wrote it first. Also, artists usually cover artists they like and who knows, you might like them too.Noisey was bought by Vice and it's great for reviews of stuff that's a little under-the-radar.Metacritic is another one that I'm weary to recommend but can help provide some insight on if something is worth listening to. Though, my advice, listen to it anyway and form your own opinion.TuneGlue has a fun design and it recommends similar artists.Overall though, the trick is just taking time and having the patience to just get lost and sift through stuff. I will try to update this list as I come across more things but in the meantime, happy hunting! (Also please note I did not forget to include Pandora, I simply chose not to. I like the Spotify radio station option much better, especially since I'm already paying for it, and Pandora has never really been that great for me, but, it is an option nonetheless.) ",
            "date": "Answered April 30, 2013",
            "views": "72",
            "upvotes": " View 24 Upvoters",
            "upvoters": [
                {
                    "user_id": "B.J.",
                    "user_href": "/profile/B-J-239"
                },
                {
                    "user_id": "Alejandro Zapeta",
                    "user_href": "/profile/Alejandro-Zapeta-1"
                },
                {
                    "user_id": "Sara Tilly",
                    "user_href": "/profile/Sara-Tilly-2"
                },
                {
                    "user_id": "Jason Zigelbaum",
                    "user_href": "/profile/Jason-Zigelbaum"
                },
                {
                    "user_id": "Kareem Shams",
                    "user_href": "/profile/Kareem-Shams"
                },
                {
                    "user_id": "Subham",
                    "user_href": "/profile/Subham-72"
                },
                {
                    "user_id": "Maneesh Sharma",
                    "user_href": "/profile/Maneesh-Sharma-40"
                },
                {
                    "user_id": "Shresth Mehta",
                    "user_href": "/profile/Shresth-Mehta"
                },
                {
                    "user_id": "Pooja Dhole",
                    "user_href": "/profile/Pooja-Dhole-1"
                },
                {
                    "user_id": "Umaselvan Bharathy",
                    "user_href": "/profile/Umaselvan-Bharathy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Larsen",
                "href": "/profile/Dave-Larsen"
            },
            "answer_text": "Check out  Online Radio with CKUA Network It's a publicly supported radio from Alberta Canada, pretty much like NPR in the US. That means very few commercials, and programming that isn't driven by a corporate agenda. They play pop, rock, blues, jazz, alternative, folk, stuff from all over the world.CKUA is loaded with music geeks who program their own playlists. Their nerds were called to the Smithsonian to curate and organize the Harry Smith collection and the recordings Moe Asch, Alan Lomax and their Folkroots Collection. I discovered these bands on CKUA    I have discovered a ton of music there that I wouldn't have heard elsewhere.  College Radio is another good source, and for similar reasons Song in My Head is a Quora music blog with a steady stream of great songs, posted by numerous geeks and melophiles iTunes Genius utility makes recommendations for you based on the music you like AllMusic | Music Search, Recommendations, Videos and ReviewsAll Music Guide is a wonderful resource for cross-referenced information about artists, who they influenced, who they followed, who they worked with, the music they recorded, biographies, reviews and more Also there are Quorans you can follow who are constantly posting great music every day, such as Hunter McCord, Tracey Grady, David Durham, Nicholas Moyne, Carole Zavala, Eric Bowersox, Jesse Lashley, Martin Fox, Lavlesh Shukla, Valerie Cooper, Nancy James, Mohit Arora, Gwen Sawchuk and many more I hope that helps. Happy listening. ",
            "date": "Answered June 13, 2014",
            "views": "25",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tony Dean",
                    "user_href": "/profile/Tony-Dean-59"
                },
                {
                    "user_id": "Rakesh Yerramsetty",
                    "user_href": "/profile/Rakesh-Yerramsetty"
                },
                {
                    "user_id": "Gogul Sathyan",
                    "user_href": "/profile/Gogul-Sathyan"
                },
                {
                    "user_id": "Nikita Benjamin",
                    "user_href": "/profile/Nikita-Benjamin-2"
                },
                {
                    "user_id": "Aaron Ellis",
                    "user_href": "/profile/Aaron-Ellis"
                },
                {
                    "user_id": "Hunter McCord",
                    "user_href": "/profile/Hunter-McCord"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Johnny-Appleseed-37"
                },
                {
                    "user_id": "Nakul Dashora",
                    "user_href": "/profile/Nakul-Dashora"
                },
                {
                    "user_id": "David Durham",
                    "user_href": "/profile/David-Durham"
                },
                {
                    "user_id": "Nick Moyne",
                    "user_href": "/profile/Nick-Moyne"
                }
            ]
        }
    ]
}