{
    "title": "What makes you feel bad and why? - Quora",
    "tags": [
        "Understanding Guilt",
        "Guilt",
        "Understanding Emotions",
        "Emotions",
        "Understanding Human Behavior",
        "Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alina Malik",
                "href": "/profile/Alina-Malik-83"
            },
            "answer_text": "So I have this friend let’s call her Nora so last year sixth grade my last year of elementry there was a new student that student was Nora.There was extra seat at are table because another girl switched schools so that was Nora’s seat at first people came up and introduced themselves and talked with her asked her questions normal stuff.Nora didn’t really fit in with them I guess so she was left alone and was the loner of are class after a while I would see Nora cry during class because of things I don’t know.One day me and my friends were hanging out during recess my best friend will call her Hell (that’s her nickname don’t judge)and my other friend Hen we’re talking and the topic about Nora came up and Hell said she was a crybaby and hen loving to copy Hell agreed.I protested saying that we don’t know her and shouldn’t say bad stuff about her but they basically got mad at me for defending her.I never rlly talked to Nora after that I think we had this computer class thing for people who didn’t take chorus so during that time they would go to the computer lab and have that class.We need up sitting next to each other because there were only 4 other girls in the class and the guys were dumbasses(no hate they just are like that)and the other two were friends so we both need up talking a little and doing some projects together but I can’t remember how we became friends I guess we just ended up talking to each other more. So soon we became friends and my friend group and her started to associate with each other(Am still friends with that same group we ain’t breaking just growing lol)then Hell had to leave school for two months because of a trip so that left me without a best friend so me and Nora ended up hanging out more.She is a pretty cool person thinks very deeply is really intelligent she taught me a lot of things and was a good influence on me.We did act(mostly me)like we were better then everyone because we thought deeply and cared about real world issues and were so mature for are age thankfully am out of phase. So then comes Middle school and we only had one class together but couldn’t really talk since we always had to work with are tablemates we did have the same lunch for are odd day(are even numbered and odd numbered classes are in separate days so the scheldule is different for them)we sat together during lunch for the first part of the year until I started to sit with my other friends and Nora sat at some table in the back alone.I stopped sitting with them when the topic of Nora came and they were saying mean things about her especially this one girl let’s call her Jay.Jay is annoying as hell and pretty mean she enjoys saying shit about people but also is a huge teachers pet and still tries to act hard like what are you trying do?So I didn’t like what was happening so I left and tried talking with Nora at first she was distant and mad about me ghosting her but soon we got on good terms.Middle school so far has been hell for her she tells me about how no one talks to her and tries to avoid being near her and a couple ppl have been being mean to her.Jay also bullies her basically and says stuff about her and teases her.This makes me sad because Nora is a really nice person and always helping others and pretty selfless idk why ppl do things like this to her because she never really does anything to ppl maybe because she is distant and gets upset pretty easily sometimes idk.Soon next semester came around and Nora didn’t have my lunch so I want back to the old table it was pretty different and the ppl there seemed to have a more unfriendly energy towards me but thankfully my friends class changed to having my lunch so I just sat with them. Me and Nora became a little distant then we didn’t really talk since we didn’t see each other a lot she also told me she tried to avoid being near me because she was a loner and didn’t want people to see us together and that to effect my social life. So I haven’t spoke to Nora since a day before the pandemic got my school closed down.I feel bad for not being able to be around her and being a better friend. ",
            "date": "Answered May 27, 2020",
            "views": "385",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kara Soylular",
                "href": "/profile/Kara-Soylular-3"
            },
            "answer_text": "My spiritual counselor had asked my mother for money for me texting her 20 minutes when she had texted me first and I was explaining why I couldn’t see her cuz Sara had taken my moms phone on accident to school, I was telling her why I couldn’t see her and I wasn’t feeling well, and then she was trying to use that to milk money out of me. It makes me feel badly, because it’s a reminder no one genuinely cares about me and people who claim to just want something out of me. I was abused as a kid by my dad and others, and I just makes me emotional. A lot of therapists don’t charge money for texts and they do it for free. And in dbt therapy, the kind of therapy for the disorder I suffer from (borderline personality disorder), you are supposed to text the therapist. My former life coach never ever charged extra for me texting or calling him… He wasn’t using me. He is probably the only person who wasn’t ever in it to profit off of me, but he moved away. This all is just proving my long time conclusion that human care is impossible, because it always is impossible.. Which even means my online friend Vap doesn’t care about me.. My mom is right.. He probably wants sex out of me or something or is trying to get close to me to hurt me.. My psychic development teacher Barbara goes extra.. She doesn’t charge extra.. She is the real deal, but I cannot open up to her, because my mother knows her and made it seem like I was raised in a loving household which wasn’t the case. But trying to make $150 off of me for texting less than 20 minutes, lying to my mom and saying it was a few hours… it shows she is in it for money and is desperate for it. Money really does corrupt people and you can see that for yourself here. It makes me want to kill myself. I cannot have love for free, no matter how hard I try and get it. I sometimes don’t even try and I still don’t get it, so it’s not that I try too hard, or don’t try hard enough. It goes to further show that people aren’t what they say they are, which I already had learnt but.. People are less trustworthy than even my idealism had seen. That doesn’t mean it is impossible for humanity to learn, yet I cannot alone, teach them or by myself remove the things that cause it to corrupt.. and more and more destruction is resulting each day from this corruption by the blinded eyes that are shackled in the societal illusion to believe it is ok that it is happening. I very clearly know how to reconstruct it, but it goes and will mostly go to defeaned ears. Society needs to under go major “surgery”. It has many complications that can arise— warfare, more emotional pain, risk of the operation not being successful (officials rebel).. And just as in how a surgical team has multiple members, I by myself, cannot carry it out. I can tell how it needs to be done, but I cannot fulfill the operation myself. It will be “bloody”. It will be messy and hard to adapt to because you’ll lose what you’ve come to know, but there is pain before one recovers. You hurt after surgery, but you feel better and are healthier. You will too, be healthier once society changes.      ",
            "date": "Answered May 7, 2019",
            "views": "59",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Garrett Krouse",
                    "user_href": "/profile/Garrett-Krouse"
                },
                {
                    "user_id": "Ekavanya Utami",
                    "user_href": "/profile/Ekavanya-Utami"
                },
                {
                    "user_id": "Naomi Smith",
                    "user_href": "/profile/Naomi-Smith-190"
                },
                {
                    "user_id": "Elizabeth Benoit",
                    "user_href": "/profile/Elizabeth-Benoit-7"
                },
                {
                    "user_id": "John Craig",
                    "user_href": "/profile/John-Craig-201"
                },
                {
                    "user_id": "Zoe Kaltenbach",
                    "user_href": "/profile/Zoe-Kaltenbach"
                },
                {
                    "user_id": "Trinity Tabora",
                    "user_href": "/profile/Trinity-Tabora"
                },
                {
                    "user_id": "Khushi Dave",
                    "user_href": "/profile/Khushi-Dave-5"
                },
                {
                    "user_id": "Alex Littleton",
                    "user_href": "/profile/Alex-Littleton-3"
                },
                {
                    "user_id": "Mario Uriarte",
                    "user_href": "/profile/Mario-Uriarte"
                }
            ]
        }
    ]
}