{
    "title": "What is the meaning of the song Winter Bear by V from BTS? - Quora",
    "tags": [
        "Kim Taehyung (BTS Member)",
        "BTS Songs",
        "Song Meanings",
        "BTS (K-pop group)",
        "K-Pop",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Venus",
                "href": "/profile/Venus-375"
            },
            "answer_text": "“Winter Bear” starts off with BTS’ V addressing a romantic interest. But as the track progresses, the lyrics become increasingly symbolic and thus more challenging to break.  As many of us know, bears hibernate in the winter. They sleep for an extended period of time. And in this song, V is also observing the addressee and comments that this individual, ‘sleeps so happily’, which reminds him of a “winter bear”. And the way he uses this metaphor in the song’s singular verse can also be interpreted as being directed towards a lover.  However, in the pre-chorus the song gets heavily-metaphorical. And the prevailing theory seems to be that the “winter bear” is actually the taehyung's grandmother, with this song being intended to commemorate the third anniversary of her passing. FYI, V was actually raised by his paternal grandma, who expired on 4 September 2016. And fandom has more or less concluded that this track is dedicated to her. And the sentiment he is expressing is basically that he misses her and more specifically wishes that she rest in peace. To know more about kpop, kdramas or k-culture, follow and ask on KpopinIndia Happy Reading! ",
            "date": "Answered July 24, 2020",
            "views": "614",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Popcorn Fluffingston",
                    "user_href": "/profile/Popcorn-Fluffingston"
                },
                {
                    "user_id": "Zoe",
                    "user_href": "/profile/Zoe-1526"
                },
                {
                    "user_id": "Kim-mi-So",
                    "user_href": "/profile/Kim-mi-So-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arohi Chakravarty",
                "href": "/profile/Arohi-Chakravarty"
            },
            "answer_text": "Some say that he wrote the song to honour his grandmother's death, which he was extremely affected by. If you see the lyrics, it will make more sense. That's why he sings “Sleep like a winter bear\", because he wants his grandmother to rest in peace, just like a bear hibernates peacefully in the winter. ",
            "date": "Updated January 29, 2020",
            "views": "366",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cherry",
                    "user_href": "/profile/Cherry-866"
                },
                {
                    "user_id": "Tom Crooks",
                    "user_href": "/profile/Tom-Crooks-6"
                },
                {
                    "user_id": "Elle Johnson",
                    "user_href": "/profile/Elle-Johnson-66"
                },
                {
                    "user_id": "Nikolina Morei",
                    "user_href": "/profile/Nikolina-Morei"
                }
            ]
        }
    ]
}