{
    "title": "What will be the best way to earn money online in 2020? - Quora",
    "tags": [
        "Earn Money at Home",
        "Online",
        "2020 (year)",
        "Making Money Online",
        "E-Commerce",
        "Wanting and Making Money"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard Gendron",
                "href": "/profile/Richard-Gendron-1"
            },
            "answer_text": "Short Answer… Keep your money accessible. At first opportunity, I set up a HELOC in 1985. Then I used the equity in house to purchase new opportunities one year after each recession including 1990, 2001, 2008 and 2020. Below is how I figured this out. Yes, it’s a very long detailed article. There are 3 parts, I will add the 3rd part in a week. I do appreciate “UpVotes”… it does take many and many hours to write the details… “UpVotes” do provide me great incentive to write more. Enjoy. Depression or a recession 2020? Will there be a FOOD SHORTAGE? More unemployment? More unrest? When will get pass COvid-19? Here are some of the answers  Covid-19 - When the human population reaches \"Herd immunity\", either within the 3rd or 4th wave or a Vaccine... the disease will remain. \"Herd Immunity\" occurs when most of a population is immune to an infectious disease, this provides indirect protection—or herd immunity (also called herd protection). Check it out at Herd immunity and COVID-19 (coronavirus): What you need to know  UNREST - Unemployment and Racism.... this will continue in to 2021 and 2022. Things will worsen until the economy start to get better.Covid-19, unemployment and racism will the the normal for a while. ECONOMIC DEPRESSION - A depression is a severe and prolonged downturn in economic activity. Hundreds of millions of newly unemployed people are spending less. The hospitality industry - hotels, restaurants, Tradeshows, campgrounds, airlines, etc are all closed or reduced 50% or more. Around 30% of food in the world is consumed in Shuttered restaurants, cafés, and cafeterias .... not mentioned the packaging, sundry items and all the employed people. The export demand from those items vanished. Farmers were throwing away milk and eggs... Baby pigs were euthanized... Cabbage and tomato crops were plowed over... and potatoes were very, very cheap. It got so bad that in Belgium – the world's largest exporter of frozen potato products, where they take their frites with mayonnaise very seriously – you could buy around 500 pounds of potatoes for the price of a gallon of gas.  Prices for Food has been going down. Social-distancing requirements have hit margins... as people eat at home instead. But falling prices for the economy as a whole spells trouble... when farmers are plowing there crops, a major shortage of labor, Gov't will not allow migrate workers into the country due to Covid-19, who will pick the crops. Farmers without income down buy new trucks The first thing the factory does is reduce incentive or reduce the price. Customers see reduced price, good in the short run… but what if you knew a new fridge or car now, would be reduced in 6 months, what is the thinking of the consumer. We wait…. most of us want the savings. There’s lots of example of this… that’s why consumers buy car in December - we know the old years model will be heavily discounted. Unfortunately, when factories can't sell their cars, they reduces inventory which coincides with lower unemployment. A farmer that can’t sell potatoes, won’t produce that crop next year which created no work for farm hand labour…maybe the farmer will now grow barley which is much more mechanized. Less employment... and the economy gets worse. If the farmers plows it crops this year, It’s a safe bet he’s not buying a new trucks! If the Hospitality industry is not buying cars, if the Airlines are not buying buses, then there's massive unemployment. This is why Hertz is in bankruptcy. Gov't got into the equation with offering subsidy wages. But now this created an new problem… “why would people pick grapes or oranges or bagging potatoes when you can stay home and get a subsidy from the gov't. The food rots in the fields while labor lays unemployed waiting for the check in the mail. ECONOMIC RECESSION - Trumps answers to solving the recession --- Protectionism. I don't agree with Protectionism. It's a very short term solutions to maintain employments. It didn’t worked in the Aluminum industry (talk to Ford and GM about this), It did not function in the pulp industry or the Oil sector where we we have 27 oil supertankers on the ocean full of oil where they have no place to go and no one wants cheap oil. It's another fiasco similar to Farmers dumping crops they can't find labor. To much supply, to low demand, and too low.. low... prices. Protectionism will become a real issue when Countries like China decides it's will no longer sell Rice or accept pork product. Protectionism and Covid-19 will cause devastation in the supply management. We will see the full affects of a recession when your grocery store will be short of many products because some Country refused to ship product and want to use it only only for their only consumption. You’ll see this in this coming in winter of 2020! Expect a much higher price in beginning in 2021.... you've already seen this with beef - covid-19 closed those plants in High River and Brooks in Alberta. TECHNOLOGY -We know many of those jobs are not coming back quickly, especially for the low level jobs. I want to talk about technology and how it can affect low level jobs. We have all heard of 5G Spectrum. 4G can’t keep up with the 50 billion devices. But 5g is so much faster , it can download a movie in 6 seconds compared to 4g, which will take 7 minutes.  This new technology allows for self-driving, doctors doing operations in real times, etc. There are 3.5 million truck drives in America. Now, why pay a human driver a wage… when a self-driving a truck 24/7, with less cost, with less delivery time. How soon with this be implemented?. Look at “Presidential Memorandum 0 2518” Here’s a section of the Memorandum states…… Sec. 3. Within 180 days of the date of this memorandum, and annually thereafter, the Secretary,… on the status of existing efforts and planned near- to mid-term spectrum re-purposing initiatives. Bottom line… Trump wants to be the first country with 5G. Now this is a report… and it will take the country some time to set up a 5G network…. but it will happen. In 10 years most truck will be 5g driverless…. Is it possible in 5 years, absolutely, what about 2–3 years, absolutely,… There are currently be lots of pockets within the USA with driverless truck, yes they need improvements…. but they are functional - real today. No one wants to be unemployed… but the world will change to 5G…. Even today, I’m seeing our Internet provider building the 5G infrastructure in my area . The technology, 5G Spectrum, will not wait for anyone . You’ll need to prepare for the change. If you want to be employed… you’ll need to have the skills required for the next century. There will be less and less back-breaking jobs, replaced with AI or technology, for example driverless trucks, but there will be lots of jobs to maintain the AI equipment. If you are at home, self isolating due to the Covid-19…. put a plan together, develop some skills… learn. Even a hobby teaches skills…. those skill maybe valuable in you new employment review. Enjoy the remainder of the post…. I suggested a few ideas.. hope that helps! IT’S A NEW WORLD - It will be a very different world after Covid-19, Racism, Socialism, Riots, 5G technology. They say in 50 years human being with never have a job… it will be done by Robots. Our Grand, Grand kids will be asking “Grandpa, what’s a job”. I can’t imagine that reality - if we have no jobs then will we all be wards of the Gov’t. Well the gov’t control our lives or will we aspire to our life goals. Maybe, we will become very lazy with no ambitions and just watch a screen for entertainment all day. I’ve been in a driverless car… you either watch out the the window or a screen, is this what life will become????? MAYBE I WANT MORE OF THE WORLD - or than politicians that tell me what to do and how I should live my life. Maybe the world is a mess right now… Just like the Farmer that has plow his crop today, knowing someone in Africa is starving.. but we have been there here before. The Good in Humanity can turn Kaos into a brave new world. Maybe…. this movie does not end in Armageddon. The Mayan Calendar, predicted the end of the world for June 21, 2020. In one way, they are correct, I wrote the story back on Sunday and it’s a very bleak tale. But we are still here. Yes, there’s a lot of Kaos…. but there’s a lot of great people within humanity. We’ve seen 2 World Wars, Several Pandemics, Several Recessions and Trump. Humanity has done lot and lots of great things.  I believe the day is filled with extraordinary . With a little perseverance, we can turn that 5G technology into a much better world. With technology, we can stay on top of pandemics, feed a lot more of the world, maybe become less polluters and maybe care our environment better. We can do a lot better… maybe this pandemic is an opportunity to reset the Red Button. Maybe Calvin had the right idea, we need a Swift Kick in the Butt…. it may hurt a little, but if it’s pushes us forward, it may be the tuff love we all need! Hugs….  Remember , 60 days after your vacation you got your Visa or Master Card. Then you saw the interest charge - 24%, The Gov't bill is coming at the end of the years. Most Gov'ts have been down-graded, we know the interest will be higher and we also know we can make the payment. Businesses will not be fully functional till end 2021 or later. Ofcourse, the Gov't will not see Income tax returns till mid 2022. That's the assumption we have dealt with 2nd wave of Covid-19 and we have achieved \"heard Immunity\". Farmers have come back from recovery from possibly economic disaster. Then there's..... November 3, 2020. ... Election with Trump. This will be very divisive for the USA. Add to this all the social issues from \"Distance\", \"racism\" and \"political unrest\". We will still be dealing with unemployment and more protectionism and the debt issue. And finally, the wild card will be Hauwei - Trump - China and USA. Will there be more sanctions, protectionism, ... all we know there will be another storm ... and it will create more economic disturbances. I'm thinking of all those Colleges and University students - will there be jobs. More and more business are closing down... not just from Covid-19 but also by Amazon and Walmart. And of the business returning from Covid-19, many of the jobs are not coming back. Those students will be competing for existing jobs... and when there is to many workers and not enough job, than salary reduces. None of those jobs are coming back with similar benefit they use to have. Pensions will be limited to 10 years, $30 hours job will be $22.00/hour, etc. They may be reduce to 30 hours per week. Our standard of living will change.  It's fair to expect a Nuclear Economic Winter. If we know what is coming - like any good Captain of his ship, you start preparing much before the storm.  Here's some suggest. There are two safe havens - Gold and Assets   You could buy Gold - but that's for people with lots of money, where you have excess money or you want to park it until the deals start to show up later in the Recession. Kind of being locked down in the harbor - you weather must storm. But Gold is not without risk.  On April 5, 1933, Roosevelt ordered all gold coins and gold certificates in denominations of more than $100 turned in for other money. It required all persons to deliver all gold coin, gold bullion and gold certificates owned by them to the Federal Reserve by May 1 for the set price of $20.67 per ounce. Look at the Fine!!! USA and Canada now have a huge debt and there is no guarantee the USA will stay the World Currency. China has been saving gold for a long long time. With Hauwei, protectionism, Covid-19, and a huge deficit close to 27 Trillion. No one knows what the Gov't will do... but we do know, they can recall the gold.  Must of us can't afford gold... must of us are just floating in the ocean, with some of us quite a way from shore. , so gold is out. The good news... Cash is KING - assuming money is not devalued. There is a risk, the gov't does not disclosure the true ridiculous debt that it has funded (pensions, etc) , and the USA can start printing more and more money, but it takes years before we would see a major devaluation... This is not the situation in Germany during the war with hyperinflation first half of 1921. So cash is this KING.   But you can still lose Cash just like the gov't recall Gold. We need to turn that real investments ... real assets. You can lose you money in a bank... especially with the USA, many banks can fail.... and your money is gone. Banks love to turn your cash into mortgages... in fact banks love mortgages. The The average U.S. mortgage debt per borrower for Q1 2019 was $202,284, a 2.4% . So if the bank is giving you less than 1/2 a 1% on your investment and they pocket 2%... life is good for the bank. Bottom line Banks love mortgage. But...., banks DO NOT LOVE THINGS LIKE HOUSES, BUSINESS, OIL TANKERS, ETC... those items require maintenance, property tax,subject of insurance (Theft and environment like tornado and floods), appraisals, etc . OUR PROBLEM IS .... currently all those items are sky high right now, it’s all priced it at the top of the curve. We need to buy them are liquidation value, auction value or bankruptcy.   So here's what we can do to start preparations ........... We need do build a reserve now. We now the deals will be coming in about 1 year from now. Remember the 2008 recession... Oct 2008 that was the month... every one thought it would be all done by December. All the deals happened in 2009 and 2010. I remember houses in Las Vegas we looked .. there where 100's between $100,000 to $120,000. Many home less than3 years old. The same things will happen with 2020 recession, the deal will start to show up in 2021 and 2022. There is a couple of deals now like - Hertz is filing bankruptcy.... it will take 6 months before all those cars to come to either auction or on sale liquidation. Why by a new Buick when there will be 100's of bargains 6 months from now.  But you need perseverance. It takes time for the banks to foreclose and decided to list those assets. Even business, can take 6 month through bankruptcy before those items go Auction. But we can use that time for do our diligence... check out prices in different neighborhood, which business are failing and what is the equipment worth. Learn what things are worth.... this is your job now. SO WHERE DO WE GET MONEY- BUILD THAT RESERVE NOW If you don't have a job.... Right now there's 2.7 million jobs available for picking produce for Farmers. Yep, it's not glamorous, but you got other plans and a little pain now there will be later deal in 2021 for a a good living. With a job... now start applying with has many credit card you can get. Try if possible to get a higher limit. Some deals will be quick term and some deals will take months. If you have available cash, you can grab the opportunity. Get RID of High Cost ticket items... like car loans, travel trailers, etc. Get rid of it on Lease Buster, etc. The idea is to build a cash reserve - not making payment of depreciate toys. There will lots of deal in 2021. What one person is not able to accomplish - a group can create extraordinarily. Talk to your family about your ideas... maybe you want to buy a Duplex and rent it out. If you have only $5,000, with just 3 more members of you family, together you raise $20,000. Remember this is not the time to buy.... there are not deals in 2020.... when unemployment climbs in 2021, when the banks are holding 1000's of mortgages, that's when it's time to go shopping. Again, if you don't have all the cash... form a partnership, or setup an Investment club. The advantage of a group is the reduction of exposure to the risk. In a group if the property does not rent, then the mortgage is split between every one. But, with a large group there are more opportunities to find a renters.  HOME EQUITY LINE OF CREDIT. (HELOC) If you have equity in you House, depending on you bank, you can get a HELOC from 65% to 80% of the value of the property. For example - you house is worth $400,000..... you still have a $100,000 on the house. Most banks will allow to set up a HELOC @ 65% of value. In this case... $260,000. You pay off the original mortgage and that leave you $160,000 to buy when those bargain show up in 2021. Most use HELOC for Home Improvement, we want to use it to make Income. The advantages of a HELOC are simple…. you can easy access to all that equity just writing a check. This can used as a deposit on another rental house, a business, flipping cars, etc. You get the drift! Spend it on something that will bring in more income. Part #3... Choosing the right Investments Investments - there’s a number of rule of thumb  When buying a machine the rules are... a If a machine pays for itself in 6 month- you of bought it 6 month ago b if a machine pays for itself in 1 year - buy it c if a machine pays for itself in 2 years - make sure your customers are locked in d if a machine pays for itself in 5 years - you need a business plan and lots of research e if a machine pays for itself in 10 years - Stay Away  When buying real-state 1 You buy realty what its worth in the future. What ever few extra thousands you pay today, this will be fraction of the value 20 years down the road. You buy property what it's worth 20 years down the road, not what it worth today  2 If you can sign a 5 years rental lease - you should be buying the building. In 5 years the rent will go up, the mortgage will be smaller and the payment still the same.   3 Buy the best location you can buy.... I suggest if possible, buy near a traffic light or something that slows the traffic. No one will see your business at 80 km. Location is important when recession occur. Bad locations will move to a better location when the economy stagnates When finding investments. x It's not that the right time to buy property..... the gov't is still paying checks for unemployment, covid-19 and business. The recession has not run it's course. In 2008, it took a full year before we saw good deals. Be patience.   xx Arrange all your financing..... the better prepared you - the better chance to close a good deal  xxx DON'T ASSUME!!!. We all assume a deal is at arm length.... but we never really know why a seller is listing his property. Is it a divorce, unemployment, a bank foreclosure in 30 days, new job out of town, parent died and the kid are 1000 miles away.... Don't be afraid to make a lower offers. I have made several offers so low, the realtor refused to present the offer. A few hours later I found another realtor and within a few hours later he had a signed offer $2,000 higher than what I offered. Later we found out.... the owner was holding a new house and the current house and he was 4 month late on the mortgage. Like I've said, don't assume.... you really don't know the situation. iv Be willing to walk away from the deal - how many items I’ve seen at auctions sell items for more than similar prices at discounters. Only, to find the same item at another auction 30 days later. v Houses that show terribly, that are fine structurally can be money makers . Ugly, can easily shine up. It’s an easy great way to find fantastic value. vi Sellers that live lived out of state and didn't have a strong emotional attachment tend to be very motivated. There are plenty of properties to choose from. Don't fall in love with any of them. If you do, your emotions could take over and cause you to make a foolish mistake. We currently live in a world covid-19, unemployment, protectionism, racism, business closure.... Money will be very stressful for many families.... expect more divorces and mortgage closure.... so don't assume ",
            "date": "Updated June 30, 2020",
            "views": "22",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Paul Mangione",
                    "user_href": "/profile/Paul-Mangione-7"
                },
                {
                    "user_id": "Msg Snc",
                    "user_href": "/profile/Msg-Snc"
                },
                {
                    "user_id": "Murti Christina",
                    "user_href": "/profile/Murti-Christina"
                },
                {
                    "user_id": "Abulla Othow",
                    "user_href": "/profile/Abulla-Othow"
                },
                {
                    "user_id": "Daisy Hudson",
                    "user_href": "/profile/Daisy-Hudson-3"
                },
                {
                    "user_id": "Shreyas Mahajan",
                    "user_href": "/profile/Shreyas-Mahajan-19"
                },
                {
                    "user_id": "Rajesh Selvaraj",
                    "user_href": "/profile/Rajesh-Selvaraj-58"
                },
                {
                    "user_id": "Tanmay Bhadviya",
                    "user_href": "/profile/Tanmay-Bhadviya"
                }
            ]
        },
        {
            "author_info": {
                "name": "Travis Ross",
                "href": "/profile/Travis-Ross-79"
            },
            "answer_text": "Honestly, if you're not doing this right, now I don't know what to tell you, need to get on this and get this money right now. Keep reading because I'm going to show you guys 10 legit ways to make money online.  This is the best, time to be alive there are so many ways to get that money in 2020. Some of these suggestions are sided hustles and with some of them, you can make a full-time income. 1. Transcription Whenever you see a video, on youtube or any other media platform, and it has captions underneath it that was created by a transcriber. Whether it's in Korean, English or any language you can get paid to actually, transcribe videos.  How much can you make is up to you, as some companies pay you twelve dollars, some pay twenty and some even pay you up to a hundred, and fifty dollars per audio hour. This means for every audio hour that you transcribe you get a hundred and fifty dollars. Now you can see how this can be very lucrative because its something that can be a great additional side income. If you're not doing this right now I don't, know what to tell you you need to get on this because its something that anyone can do. 2. Freelancing  If you have a skill you can showcase it, monetize it and get paid. For example, I, oftentimes get my thumbnails made by people web service sites. Now I typically pay anywhere between five and seven, dollars for a thumbnail sometimes I buy in bulk and I pay $40. Now, if you multiply five dollars by ten thumbnails or however many clients they have a lot of these arm thumbnail makers or graphic designers on Fiverr have thousands of clients you multiply five dollars by a thousand now you can see how this work can become lucrative for you. So graphic design freelancing is a great way to earn a solid income or even a full-time income online at home just using your laptop or your cell phone I'm telling you sites like upwork are great ways to generate a little side hustle and make money online. 3. Dropshipping Dropshipping is when you have a store such as a Shopify store or on your domain. Now you buy imports mainly from China or even America and you act as the middleman a customer comes to your store, they purchased a product you pay your vendor usually a lot less than what it costs.  You pay the vendor and then the vendor ships out the product to the customer, and you keep the profit, so you never have to touch a physical product. You don't even have to buy inventory, you don't have to do anything all you do is set up your store and allow the sales to roll in, and it is that simple. It takes time to build up but I made my first sale within the first 24 hours and, it was for about fifty-seven dollars and it was all profit. Dropshipping is a great way to make money with little investment. There are people making hundreds of thousands of dollars a month just by drop shipping. 4. Playing video games Yes, there are apps out there that you can download on your phone where you get paid to play. Apps like swag bucks or inbox dollars which I use.  How much can you make? That's all up to you depending on how determined are, you can earn anywhere between $12 an hour to $15 an hour literally to play video games. I use inbox dollars online or just the ‘inbox dollars’ app. It takes a little bit more time to earn money as they usually start you off with $5. You get paid through the mail by check or you can have a direct deposit or just collect your, money through PayPal. With inbox dollars, you basically, have to watch videos and play video games and they send you money, it's that simple. It's an app I'm not affiliated with but I've used it to get swag bucks. 5. Create an online course Now if you have a special skill or educational background and something that you're passionate about like, for example, I have a bachelor's in exercise science and a lot of knowledge of the body, kinesiology, physiology and how the body moves. That's part of my expertise so if you have a skill and either communicating or software design, SEO or anything else, you can create an online course. This is where passive income starts to come in because once you put the work up front you can just sit back and collect the sales. By providing a lot of value to your clients you will boost your ratings and word of mouth will start to get out and that will bring in more people so you can make more money. You can use a sales funnel to drive traffic with Facebook ads or Instagram ads to your site where you promote your course and you can sell your course and pretty much enjoy your life. No skill is too small if you're good at something, it doesn't matter if you're good at making dolls you can monetize that and make a course on how to make dolls. 6. YouTube So YouTube is another way to make money online of course now with the recent rule changes you do have to be eligible for monetization and I believe it's one thousand subscribers and four thousand hours of watch time to. That is the current requirement to becoming partner but once you become a partner you can advertise and have ads running on your videos which will make you money. Now, this is a great way to make money online if you have a passion you can put your videos out there to add value to people, and in return, you get you to get money. You can then simply direct deposit or receive a check every few weeks. How much money can, you make on YouTube? It's up to you, how much do you want to work? I made nine thousand nine hundred and eighty-eight dollars. Now if a small YouTuber like me can do it I promise you you can do it too. YouTube, is a great way to make money online if you have a passion for something and you like talking on camera or even if you don't want to show your face on camera. I have a friend that makes twenty-three thousand dollars a month and he runs a hip hop channel and he never shows his face he just speaks and brings in twenty-three thousand dollars in Adsense per month 7. Affiliate marketing What is affiliate marketing? Affiliate marketing is advertising a product and referring customers to it. Once they buy you get a commission. Some companies offer 20% some offering 30%, and some offer as high as 75% commission so it's all up to you which company you choose to promote. One thing I will say is that when promoting a product, you don't want to steer your people wrong, so always make sure you're promoting something you believe will benefit the customer. The good thing about, affiliate marketing is that you don't, need to be a YouTuber you can just have it on Instagram you can have it on Facebook you can even text your link to somebody and if they buy something you make a commission. It's a great way to make money online so everybody wins. 8. Teaching You can teach a language online on various foreign language websites. You can teach Chinese, French or English to people.  How much can you make with this? Companies are paying $25 an hour, some are paying 30. I've even seen some paying $50 an hour for just sitting at home and talking to students in English. If you have a few more hours throughout your day then you can make $25 an hour as opposed to going to a day job. 9. Company sponsorships If you're a content creator of some sort, whether you make Pinterest stuff or YouTube or Instagram or whatever you can partner with companies that want to get their products out in front of people. It's a great way for you to network as well as introduce a product that you believe your audience will enjoy. Again, everybody wins and the keyword for this is value. How much can you make? That's a tough one because I know people personally that have made $40,000 from one post. I noticed people making $10,000 and people making $250,000. It's a very lucrative way to make money and to be honest maybe a full-time income. You can get paid per post on IG and you can also get a commission on top of that if you pair those two together you can start to see how this can be a great way to make money. Even if you have a blog you can advertise that company on your blog and make some great money. 10. Listening to music There are websites like 'play this push' where you can make $12 per song just listening to music. The way this works is that new artists want their music to be reviewed so they put it on this website and they want people to give honest feedback and to review it. If you do that you can earn up to 12 dollars per song simply listening to music. If you listen to 10 songs an hour you can make some money just by listening to music. 11. Facebook  There is a new feature or rather a feature that's not being utilized a lot. It's their version of YouTube and it's called Facebook creator studio. I have a friend that recently who has a YouTube channel he wasn't making a lot of money on Adsense from his channel he converted his footage to YouTube creator studio he made seven thousand dollars his first month he made like four thousand dollars his second month - all by transferring old content on YouTube to the Facebook creator studio. So you better hop on that cuz it's going to get harder, so you hop on that so you can make good money doing this. If you’d like to know how I personally make money online and what I recommend people get started with just check out my personal profile where I share that information in my bio. So I hope you enjoyed this, and make sure to share this with anyone who might benefit from understanding the best ways to make money online in 2020. I appreciate you! ",
            "date": "Answered January 2, 2020",
            "views": "39",
            "upvotes": " View 19 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mauricio Salinas",
                    "user_href": "/profile/Mauricio-Salinas-2-1"
                },
                {
                    "user_id": "Sree Lakshmi",
                    "user_href": "/profile/Sree-Lakshmi-1037"
                },
                {
                    "user_id": "Clever Akpoyibo",
                    "user_href": "/profile/Clever-Akpoyibo-1"
                },
                {
                    "user_id": "Jashanpreet Singh",
                    "user_href": "/profile/Jashanpreet-Singh-164"
                },
                {
                    "user_id": "AirSlate Academy",
                    "user_href": "/profile/AirSlate-Academy-1"
                },
                {
                    "user_id": "Alex Ka",
                    "user_href": "/profile/Alex-Ka-16"
                },
                {
                    "user_id": "Msg Snc",
                    "user_href": "/profile/Msg-Snc"
                },
                {
                    "user_id": "Jai Pradhap",
                    "user_href": "/profile/Jai-Pradhap-1"
                },
                {
                    "user_id": "Hiếu Nguyễn",
                    "user_href": "/profile/Hiếu-Nguyễn-310"
                },
                {
                    "user_id": "Asabe Shuaibu",
                    "user_href": "/profile/Asabe-Shuaibu-1"
                }
            ]
        }
    ]
}