{
    "title": "What country has the best singers in the world? - Quora",
    "tags": [
        "Singers",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carlton Jones",
                "href": "/profile/Carlton-Jones-59"
            },
            "answer_text": "Well, ask yourself which country has the most recognized singers.? Who has the most recognized distinguished song charts? Where do singers get paid more for hits? Michael Jackson Katie Perry Beyonce Kendrick Lamar Rhianna Justine Timberlake These are singers that have sold billions of songs when added together and will be recognized anywhere they go. You can’t say that about other countries, not even the UK can boast of that fact. Any of these singers can cause total chaos in a city or a state they are performing in. Sure other singing from different countries may cause havoc in their country but 90% of the time it is American singers that are making the most noise in other countries. Sure you may be a great singer but what power do you have or if any. The American singer has always been the leader of the music world. The only time they lost a little ground was when the British Wave was introduced. The British Wave: The Beatles The Monkees The Rolling stones But we still had great singers leading the way singers like: Elvis Pressly Aretha Franklin (Named best singer of all time on all fronts) Jimmy Hendricks the greatest guitar player ever and many more. American singers drive the country decisions they dictate trends in America. There are no other countries that can hold a candle to the American singers class. They are the best of the best and will always be the best. History has proven this. Ther will never be another Michael Jackson, Elvis Pressly, or Aretha Franklin. Another country has singers but America has icons and icons are not made overnight. The people I named are not one-hit wonders they have been appointed to greatness. Peace ",
            "date": "Answered August 7, 2019",
            "views": "85",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Madan Mohan",
                "href": "/profile/Madan-Mohan-63"
            },
            "answer_text": "The only sensible way to do this is to go by genre. There is no one country that is the best across the board. Let’s get the relatively clear ones out of the way Jazz: USA Hindustani/Carnatic music: India Ghazal/qawali: Pakistan Country music: USA R&B/soul: USA Musical theater: USA As you can see, in all of the above cases, the genres were so germane to that particular country that the best artists have also (largely) been produced there. Now, onto some tricky ones. Rock/metal: Tough, as both UK and USA have produced some of the greatest singers in this genre. And it’s a very, very broad spectrum. So…America has Jeff Buckley, Chris Cornell, Ronnie James Dio, Mike Patton, Russell Allen, Ann Wilson, Beth Hart among many others. UK has Freddie Mercury, Ian Gillian, Bruce Dickinson, Rob Halford, Annie Haslam, Kate Bush among many others again. I might give it narrowly to UK because they were generally a little ahead of the curve in the years that rock developed most while USA caught up as UK began to fall off/slow down. Pop: Again, UK gives USA a real run for its money but this time, have to give USA the clear edge. The sheer scale and size of the US market means that the best talent in pop usually flocks to this country or comes out of it. So…you have Frank Sinatra, Karen Carpenter, Whitney Houston, Michael Jackson, Mariah Carey, Beyonce and on and on it rolls. On a worldwide basis, there aren’t many HUGE popstars UK produced other than George Michael. And Adele and Amy Winehouse much later but their talents are/were greater in songwriting as opposed to just singing. UK’s biggest, most popular exports have tended to be in ROCK (Beatles, Rolling Stones, Queen, Led Zeppelin…you know the drill). Opera: Number of countries vying for the top spot here. Italy has given us Pavarotti, Caruso, Renata Tebaldi, Renata Scotto. Spain says not so fast and responds with Placido Domingo, Jose Carreras, Alfredo Kraus, Montserrat Caballe. USA was a bit late getting to battle but caught up quickly - Maria Callas, Beverly Sills, Marilyn Horne, Thomas Hampson, Renee Fleming. OK, this is how I am going to broker a truce, unsatisfactory though it may be. Male singers -Spain. Female singers - USA. Those being the genres I am at least somewhat familiar with, I will have to stop here. ",
            "date": "Answered September 22, 2019",
            "views": "81",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Usha Haldar",
                    "user_href": "/profile/Usha-Haldar-2"
                },
                {
                    "user_id": "Lingga Perkasa",
                    "user_href": "/profile/Lingga-Perkasa"
                },
                {
                    "user_id": "Daud Saeed",
                    "user_href": "/profile/Daud-Saeed-1"
                },
                {
                    "user_id": "Aparajita Madan",
                    "user_href": "/profile/Aparajita-Madan"
                },
                {
                    "user_id": "Vaishak Raveendra Kumar",
                    "user_href": "/profile/Vaishak-Raveendra-Kumar"
                }
            ]
        }
    ]
}