{
    "title": "What are the most stimulating activities for your brain? - Quora",
    "tags": [
        "Intellectual Stimulation",
        "Brain Training",
        "Cognitive Science",
        "Human Brain",
        "Neuroscience"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ned Nadima",
                "href": "/profile/Ned-Nadima-1"
            },
            "answer_text": "Here’s a list of brain exercises to condition your brain to be more plastic, adapt better and grow new connections: Brush teeth with your non-dominant hand.Using the opposite side of your brain (as in this exercise) can result in a rapid and substantial expansion of in the parts of the cortex that control and process tactile information from the hand. Shower with your eyes closed. Your hands will probably notice varied textures of your own body you don't “see,” and will send messages back to your brain. Your tactile sense will improve. Switch around your morning activities.Brain imaging studies show that novel tasks exercise large areas of the cortex, indicating increased levels of brain activity in several distinct areas. This activity declines when the task becomes routine and automatic. Switch seats at the table.Switch seats to change whose position you occupy, who you relate to, your view of the room, and even how you reach for salt and pepper. It’ll keep your brain active. Turn familiar objects upside down. Literally.When you look at things right-side up, your left “verbal” brain quickly labels it and diverts your attention elsewhere. When they're upside down, your right brain networks kick in, trying to interpret the shapes, colors, and relationships of a puzzling picture. Make more social connections during your day.Scientific research has repeatedly proved that social deprivation has severe negative effects on overall cognitive abilities. Keep talking mate! Read differentlyRead aloud with your partner or a friend, alternating roles of reader and listener. When we read aloud or listen to reading, we use very different brain circuits than when we read silently to ourselves Learn a new languagesMultilingualism has been shown to have many social, psychological and lifestyle advantages. Moreover, researchers are finding a swathe of health benefits from speaking more than one language, including faster stroke recovery and delayed onset of dementia. Bilingual people have significantly more grey matter than monolinguals in their anterior cingulate cortex, and that is because they are using it so much more often. The more you use it, the stronger, bigger and more flexible it gets. Eat unfamiliar foodsYour olfactory system can distinguish millions of odors by activating unique combinations of receptors in your nose. There's a direct link to the emotional center of your brain, so new odors may evoke unexpected feelings and associations. TravelNeural pathways are influenced by environment and habit, meaning they’re also sensitive to change: New sounds, smells, language, tastes, sensations, and sights spark different synapses in the brain and may have the potential to revitalize the mind. Try new sportsNeuroscientists have known for decades that brain-derived neurotrophic factor (BDNF) is released during aerobic exercise and stimulates neurogenesis (the growth of new neurons). Trying new sports keeps your brain awake during exercise, instead of falling into the routine. SleepLike an athlete, your brain needs rest to function at its peak. Do not forget to sleep. All the best, Ned ",
            "date": "Updated January 24, 2019",
            "views": "51",
            "upvotes": " View 37 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Idont Needis",
                    "user_href": "/profile/Idont-Needis"
                },
                {
                    "user_id": "Mike Sanchez",
                    "user_href": "/profile/Mike-Sanchez-122"
                },
                {
                    "user_id": "Kevin Chambers",
                    "user_href": "/profile/Kevin-Chambers-7"
                },
                {
                    "user_id": "Haley Christofilis",
                    "user_href": "/profile/Haley-Christofilis"
                },
                {
                    "user_id": "Ajith Vijayan",
                    "user_href": "/profile/Ajith-Vijayan-3"
                },
                {
                    "user_id": "Tristen Senn",
                    "user_href": "/profile/Tristen-Senn-1"
                },
                {
                    "user_id": "Nader Mekki",
                    "user_href": "/profile/Nader-Mekki"
                },
                {
                    "user_id": "C Anthony",
                    "user_href": "/profile/C-Anthony-19"
                },
                {
                    "user_id": "Andrea Mercadante",
                    "user_href": "/profile/Andrea-Mercadante"
                },
                {
                    "user_id": "Todd Mills",
                    "user_href": "/profile/Todd-Mills-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ron White",
                "href": "/profile/Ron-White-20"
            },
            "answer_text": "First of all a common myth these days is that playing online brain games is a great way to exercise your brain. Studies tell us it is not. Actually what exercises your brain the most is when you can get it to do things that make it think or work differently than it normally does. In a book called, 'Keep Your Brain Alive' they talk about nuerobics and this means brain exercises that gets your brain to think in new ways using all of your senses. This is a great video on brain exercises  Here is the book:Keep Your Brain Alive Book: Keep Your Brain Alive: 83 Neurobic Exercises to Help Prevent Memory Loss and Increase Mental Fitness: Manning Rubin, Lawrence Katz: 0019628110527: Amazon.com: Books Nuerobic brain exercises mentioned in the video above: 1. Search for coins in your pocket and use your sense of touch trying to figure out what the coin is. 2. Close your eyes and walk around your house trying to remember where the furniture is. You are testing your memory and making your memory work in a way it isn't used to working 3. Invent conversations when watching the tv and the volume is on mute. It's a fun brain exercise. 4. Do things that get you out of your normal thinking patterns. If you normally read magazines about motorcycles then read a magazine about gardening. Get out of your normal thinking patters.  5. A brain exercise for me is to watch political commentators that I don't think they way they do. This is a brain exercise  6. Take a new way home. Wake your brain up 7. Write with your non dominant hand as a brain exercise 8. Close your eyes and try to identify spices by their smell. You are engaging your sense of smell in a new way I think this is a great book full of brain exercises. This is not my book nor do I get anything if you buy it but I really enjoyed the book on nuerobics and brain exercises and I think you should check it out ",
            "date": "Answered April 11, 2016",
            "views": "16",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Julie Bennett",
                    "user_href": "/profile/Julie-Bennett-20"
                },
                {
                    "user_id": "Mahendra Singhvi",
                    "user_href": "/profile/Mahendra-Singhvi-2"
                },
                {
                    "user_id": "Rajiv Khurana",
                    "user_href": "/profile/Rajiv-Khurana-30"
                },
                {
                    "user_id": "Vadim Neverov",
                    "user_href": "/profile/Vadim-Neverov"
                },
                {
                    "user_id": "Alexander Koenig",
                    "user_href": "/profile/Alexander-Koenig"
                },
                {
                    "user_id": "Alessandro Cas",
                    "user_href": "/profile/Alessandro-Cas"
                },
                {
                    "user_id": "Neetu Choubey",
                    "user_href": "/profile/Neetu-Choubey"
                }
            ]
        }
    ]
}