{
    "title": "What is the path for a solo musician to make it out there with his originals? - Quora",
    "tags": [
        "Independent Music",
        "Rock Music",
        "Music Industry",
        "Musicians",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Predrag Vasić",
                "href": "/profile/Predrag-Vasić"
            },
            "answer_text": "That path is very winding and rugged, but it exists. If the music is good, and if the songs are well received in the local clubs / bars, then there’s hope. The best thing to do is record an album (12 - 15 songs). This requires a lot of skill and knowledge, plus talent (obviously), but not much in terms of hardware and gear. Commercial albums have been recorded and produced on iPhones, so technology is cheap and abundant. Once the album is properly recorded, it should be made available on Apple Music, Spotify and all other digital music platforms. For this, independent artists can use one of the popular aggregators, such as CD Baby or TuneCore. It costs around $60 to put an album up for sale (and streaming) on all the main digital music distribution services throughout the world. The most important part comes after the music is available, and it is promotion. Social media is critical, and this requires the most effort, but spreading the word about the artist and songs, sending people to Spotify or Apple Music can get people to listen. It is extremely unrealistic to expect to make a living out of revenue from digital streaming. With current payout rates, you would need over 500,000 (half a million) streams per month to earn $5,000 US per month. This means that each and every living American would have to stream at least two songs (or one song twice) from your album every month. Or 40,000 people would need to stream your entire album once per month. It isn’t impossible, but it is a very steep path. ",
            "date": "Answered July 26, 2019",
            "views": "40",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ege Tuvay",
                    "user_href": "/profile/Ege-Tuvay-1"
                }
            ]
        }
    ]
}