{
    "title": "What are some controversial topics in the Medieval and Renaissance history? - Quora",
    "tags": [
        "Medieval Art",
        "The Renaissance",
        "Controversies",
        "Middle Ages (era)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pieter Buis",
                "href": "/profile/Pieter-Buis-1"
            },
            "answer_text": "If by controversial you mean debated about by academics then there is a whole list of things. The tone of discussion on some of these topics can be extremely polemical, it’s a surprise only ink rather than actual blood has been spilled. Richard III of England - Wikipedia It boils down to whether he should be seen as the Shakespearean bad guy or not. Al-Andalus - Wikipedia Rich tolerant multicultural paradise where everyone joined hands together to sing kumbaya or oppressive hell hole where religious violence ruled the day? Crusader states - Wikipedia Rich tolerant multicultural paradise where everyone joined hands together to sing kumbaya or oppressive hell hole where religious violence ruled the day? Knights Templar - Wikipedia Can’t say I am very familiar with this topic but some reviews of books written about them were rather harsh on both sides of the debate. Medieval university - Wikipedia and European science in the Middle Ages - Wikipedia *Warning* this area of history is populated by hardcore anti religious humanists and born again Catholics A degradation of true learning in the style of the Romans and Greeks, guilty of making philosophy the handmaiden of theology, to much of an adherence to Galen and Aristotle, an innovative new model of higher education that is still with us today or science advancing above and beyond what the ancients achieved? Military Revolution - Wikipedia Short version: a four way discussion between medievalists, those who focus on the 16th and 17th century, those who focus on the 18th and 19th century and orientalists of every breed. It’s not strictly a medieval or renaissance topic but it got dragged into the whole discussion. It’s not the most heated debate but it has been going on since the 1950s. On a side note; the wikipedia page doesn’t do the scale and size of the topic justice. Great Stirrup Controversy - Wikipedia Yes! This topic and the debate surrounding it has its own wikipedia page. By now the consensus is that stirrups were a minor rather than a major change to cavalry but the last word about this hasn’t been written yet.  These are just a few of the academic debates taking place, there are many more like it and even more what you’d call amateur debates about the virtues and downsides of everything and anything. ",
            "date": "Answered January 15, 2018",
            "views": "27",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "George Trosper",
                    "user_href": "/profile/George-Trosper"
                },
                {
                    "user_id": "Nikita Barsukov",
                    "user_href": "/profile/Nikita-Barsukov"
                },
                {
                    "user_id": "Luca Fagioli",
                    "user_href": "/profile/Luca-Fagioli-1"
                },
                {
                    "user_id": "Akli Baitiche",
                    "user_href": "/profile/Akli-Baitiche"
                },
                {
                    "user_id": "Matthew Nghiem",
                    "user_href": "/profile/Matthew-Nghiem"
                },
                {
                    "user_id": "Alena Němcová",
                    "user_href": "/profile/Alena-Němcová-2"
                },
                {
                    "user_id": "Stuart Campbell",
                    "user_href": "/profile/Stuart-Campbell-46"
                },
                {
                    "user_id": "Dimitris Almyrantis",
                    "user_href": "/profile/Dimitris-Almyrantis"
                },
                {
                    "user_id": "Richard Enna",
                    "user_href": "/profile/Richard-Enna"
                },
                {
                    "user_id": "Jennie Balfour",
                    "user_href": "/profile/Jennie-Balfour-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Smith",
                "href": "/profile/William-Smith-56"
            },
            "answer_text": "I must start with the simple statement that our education system does a terrible job of presenting the Middle Ages and Renaissance, often relying on paradigms long since abandoned, like the Dark Ages, and much popular writing, to put is charitably, gets things wrong. This is an immense stretch of Western history—500 or 800 to the late 17th century. I rather like the notion to picking two dates as symbolic bookends—the coronation of Charlemagne in 800 AD as a beginning, and the publication of Newton’s Principia in 1687 at the end. In that up to 1200 year stretch of history, jammed with events that shape the modern world, there are innumerable points of controversy, and numerous popular errors. Just a few: The real causes of and results of the Crusades (here I mean specifically the Crusades aimed at Jerusalem and Palestine): Just calling them Western aggression doesn’t work. If you read any reasonably objective treatment, there was a great deal of bad behavior on all sides. Some, like Runciman, see them finally as a colossal waste; others take a more positive view. What activities to include under the rubric of the Crusades: Can we say that the Christianization of what is now Poland and the Baltic states and the Reconquista really comes from the same impulses that fueled the Crusades in the Levant? Courtly love—real or purely a literary game? This one has produced much debate. A few bits of misinformation: Europe went dark after the fall of the Western Empire in 476 AD. Dead wrong. The Church dictated everything in the Middle Ages and Renaissance. Dead wrong. Ongoing conflict between the civil and ecclesiastical powers was a reality from the early Middle Ages, with a rise in Papal power between the papacy of Gregory VII in the late 11th century to a fall in 1303 with the abduction of Boniface VIII by Philip IV of France. Many of the notable events of medieval history—the suppression of the Templars, the feud between Henry II and Thomas Becket, conflict between the papacy and Frederick II—deal with this tension. One must also remember that the Papacy controlled large portions of the central Italy, and was engaged in wars with France and various other Italian powers in the 16th century. The controversy between Henry VIII and the Pope about the divorce was considerably muddled by political considerations. There were no scientific or technological discoveries in the Middle Ages. Again very wrong. The Renaissance is the beginning of modern history. This idea has some currency. However, it ignores the simple fact that, until the collapse of the geocentric theory in the 17th century and the beginnings of modern science—a process of over a hundred years between Copernicus and Newton—the medieval hierarchical model of the universe and society survived intact. In fact, the last great statement of that view—Fludd’s History Of The Microcosm And The Macrocosm—was published between 1617 and 1621, contemporary with Galileo’s difficulties with the Inquisition, and after Bruno’s assumption of an infinity of inhabited worlds in 1584. The Renaissance is both an historical reality and a period of transition in its last century and a half. There is of course much more. ",
            "date": "Answered January 27, 2018",
            "views": "15",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "George Trosper",
                    "user_href": "/profile/George-Trosper"
                },
                {
                    "user_id": "Russell McNay",
                    "user_href": "/profile/Russell-McNay-1"
                },
                {
                    "user_id": "Nikita Barsukov",
                    "user_href": "/profile/Nikita-Barsukov"
                },
                {
                    "user_id": "Akli Baitiche",
                    "user_href": "/profile/Akli-Baitiche"
                }
            ]
        }
    ]
}