{
    "title": "What song best fits the new start in 2020? - Quora",
    "tags": [
        "Music Recommendations",
        "2020 (year)",
        "Songs",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Akagbosu",
                "href": "/profile/Alex-Akagbosu"
            },
            "answer_text": "The song that perfectly describes my 2020 so far is “70 years’, done by me about six years ago when I lost my mum. My mum and I lived together all my life until she passed on. So when she died the impact of her passing made me to realize how little the time we humans have to spend on earth and why we should live our lives in such a way that we will be able to give a positive account of it in the end. I recently shot a video of the song but the lyrics keep coming back to me each time i listen to it especially at this time of uncertainty regarding this corona virus out break. Though I love other songs and I have other songs done by me, but this particular “70 years’ is not just a song to me, but a message. please pardon me if I say that one of my songs is the song that perfectly describes my 2020. ",
            "date": "Answered March 29, 2020",
            "views": "25",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rosemary Lambin",
                    "user_href": "/profile/Rosemary-Lambin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wendy Sheridan",
                "href": "/profile/Wendy-Sheridan-2"
            },
            "answer_text": "What else? The Sex Pistol’s ‘God Save the Queen, guess I’m still a American child of the 60’s— though this was the 80’s we all still felt the same (no future):  God Save The QueenThe fascist regimeThey made you a moronA potential H bombGod save the queenShe's not a human beingand There's no futureAnd England's dreamingDon't be told what you wantDon't be told what you needThere's no futureNo futureNo future for youGod save the queenWe mean it manWe love our queenGod savesGod save the queen'Cause tourists are moneyAnd our figureheadIs not what she seemsOh God save historyGod save your mad paradeOh Lord God have mercyAll crimes are paidOh when there's no futureHow can there be sinWe're the flowersIn the dustbinWe're the poisonIn your human machineWe're the futureYour futureGod save the queenWe mean it manWe love our queenGod savesGod save the queenWe mean it manThere's no futureIn England's dreaming God save the queenNo futureNo futureNo future for youNo futureNo futureNo future for meNo futureNo futureNo future for you ",
            "date": "Answered June 19, 2020",
            "views": "13",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Stan Hanks",
                    "user_href": "/profile/Stan-Hanks"
                },
                {
                    "user_id": "Lynn Mungo",
                    "user_href": "/profile/Lynn-Mungo"
                },
                {
                    "user_id": "Robin Harville",
                    "user_href": "/profile/Robin-Harville"
                },
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                },
                {
                    "user_id": "Karen Marie Shelton",
                    "user_href": "/profile/Karen-Marie-Shelton"
                },
                {
                    "user_id": "Paul Barends",
                    "user_href": "/profile/Paul-Barends"
                },
                {
                    "user_id": "Lisa Pen",
                    "user_href": "/profile/Lisa-Pen-2"
                },
                {
                    "user_id": "Skye R. Regan",
                    "user_href": "/profile/Skye-R-Regan"
                }
            ]
        }
    ]
}