{
    "title": "What are your favorite progressive rock songs? - Quora",
    "tags": [
        "Progressive Rock (music genre)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eric Parsonage",
                "href": "/profile/Eric-Parsonage-1"
            },
            "answer_text": "This question gives me the opportunity to extol the virtues of largely ignored prog rock band, Flash, again… Whilst liking the idea of progressive rock musicians having the freedom to do almost anything, I was a big critic of the genre as it progressed through the early 70’s. Bands such as Yes quickly left behind the early promise of tight, well written songs such as Survival from their self titled debut album in favour of vast landscapes of self indulgent nonsense such as Close to the Edge and Tales from Topographic Oceans. In between they came up with stuff like Starship Trooper and Yours is no Disgrace from The Yes Album which are fine tracks and for me, where they peaked, just 3 albums in. The appearance of guitarist Steve Howe on this album meant that Peter Banks had gone and he would go on to form Flash with keyboardist Tony Kaye who was still with Yes when that 3rd album came out in 1971. Flash debuted in ’72 and with vocalist Colin Carter sounding not unlike Yes frontman Jon Anderson, they were accused of being a poor man's Yes. But if you look deeper, the songs on that album were excellent. Small Beginnings, Children of the Universe and Dreams of Heaven are superb examples of prog at its best. Yes they were complicated with unexpected changes of direction (that's what prog was all about after all…) but they were also accessible with loads of inspired ideas. They don't, however, contain long, improvised solos which should be kept for the gigs if they're played at all. They continued the good work on their 2nd album, In the Can, with Lifetime and There No More, and again with the 3rd, Out of Our Hands, which is consistently good thoughout. None the Wiser, Man of Honour and Psychosync are among my favourite tracks from the band but sadly, there was no more, just the 3 albums. Another band who I felt were more accessible than most but did actually go on to great things was Genesis. Favourite tracks were Stagnation from Trespass, The Musical Box from Nursery Cryme and the epic Supper’s Ready from Foxtrot. They were strong on melody, had some truly bizarre lyrics, and dozens of great musical ideas which provided the platform for a long career even after losing charismatic frontman Peter Gabriel and guitar virtuoso Steve Hackett. ",
            "date": "Answered August 13, 2019",
            "views": "117",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "H. A. King",
                    "user_href": "/profile/H-A-King"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anthony Vandenbosch",
                "href": "/profile/Anthony-Vandenbosch"
            },
            "answer_text": "Introitus - The hand that feeds you  Genesis - Firth of Fifth  Pink Floyd - Shine on you crazy diamond  Yes - Gates of Delirium  TransAtlantic - The Whirlwind  Jethro Tull - Thick as a brick  Mostly Autumn - Shrinking Violet  Camel - Lady Fantasy  Pendragon - Not of this world  Marillion - Neverland  The Flower Kings - Stardust we are  Phideaux - Chupacabras  King Crimson - The Court of the Crimson King  Focus - Hamburger Concerto  Earth and Fire - Song of the Marching Children  Rush - 2112  RPWL - The gentle art of swimming  The Tangent - The music that died alone  Spock's Beard - At the end of the day  Dream Theater - Six degrees of inner turbulence  Magenta - The White Witch  Renaissance - Can you hear me  IQ - Sacred sound  Beardfish - Sleeping in traffic  Ayreon - The Human Equation Ayreon - The Human Equation (FULL ALBUM STREAM) 2004 - YouTube ELP - Karn Evil 9  Mayra Orchestra - In the woods  Sky Architect - Endless roads  Magma - Mëkanïk Dëstruktïw Kömmandöh  Nightwish - The Poet and the Pendulum  Sylvan - Artificial Paradise  Eloy - Illuminations  Electric Light Orchestra - Concerto for a rainy day  Uriah Heep - The Magician's Birthday  Unitopia - The Garden  Premiata Forneria Marconi - Impressioni di settembre  iamthemorning - 5/4  The Light Year - Side  Riverside - Second life syndrome  Arena - The Hanging Tree  Kayak - Merlin  Fuseboxx - Pagbalik  Mike Oldfield - Incantations     Frank Zappa - Don't eat the yellow snow  The Beatles - A day in the life  ",
            "date": "Answered August 12, 2019",
            "views": "630",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anil Kumar",
                    "user_href": "/profile/Anil-Kumar-131"
                },
                {
                    "user_id": "Randy Godsey",
                    "user_href": "/profile/Randy-Godsey"
                },
                {
                    "user_id": "Syd Crimston",
                    "user_href": "/profile/Syd-Crimston"
                },
                {
                    "user_id": "Nathan Beard",
                    "user_href": "/profile/Nathan-Beard-6"
                },
                {
                    "user_id": "Anvit Srivastav",
                    "user_href": "/profile/Anvit-Srivastav"
                },
                {
                    "user_id": "H. A. King",
                    "user_href": "/profile/H-A-King"
                }
            ]
        }
    ]
}