{
    "title": "What's the best flight you have ever had? - Quora",
    "tags": [
        "Flights",
        "Airlines",
        "Air Travel"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeba Kingsley",
                "href": "/profile/Jeba-Kingsley"
            },
            "answer_text": "Best flight is the flight that you arrive alive so pretty much all my flights can be considered as best flight. I have had flights where delta flight attendants have given me handwritten thank you notes for flying in delta  I have also had the pleasure of writing in delta captains log on his last flight before retirement thanking him for his service   I can also mention one more incident which made my day but also made me feel very guilty This was a long haul flight from Atlanta to Seattle, close to 4–5 hours and when I checked my seating, I was in a middle seat. Usually, I do get upgraded or seated in Aisle or window but since it's from Atlanta to Seattle it's usually pretty crowded. I went up to the counter, checked if there is any option to move to window or aisle but I was told it was fully sold out and they are looking for volunteers I was resigned to my middle seat and when I scanned my boarding pass, I got a new pass stating that I was in aisle now but same row. I was pretty happy and very appreciative of delta that it took care of me. I settled down in my seat, put my bose headset on and was about to relax with my downloaded Netflix when I saw the passenger next to me pretty agitated and restless. I took a moment to introduce myself and asked him if I can help in anyway and he said - I was in aisle seat like 5 minutes ago and now I am in middle seat and I will never fly in delta again. !! ",
            "date": "Answered September 10, 2017",
            "views": "18",
            "upvotes": " View 23 Upvoters",
            "upvoters": [
                {
                    "user_id": "Freda Tomety",
                    "user_href": "/profile/Freda-Tomety"
                },
                {
                    "user_id": "Mufzaal Ahmed Quadri",
                    "user_href": "/profile/Mufzaal-Ahmed-Quadri"
                },
                {
                    "user_id": "Bharat Kumar",
                    "user_href": "/profile/Bharat-Kumar-667"
                },
                {
                    "user_id": "Ståle Sjøvoll",
                    "user_href": "/profile/Ståle-Sjøvoll"
                },
                {
                    "user_id": "Ethan Chen",
                    "user_href": "/profile/Ethan-Chen-18"
                },
                {
                    "user_id": "Alex Cucos",
                    "user_href": "/profile/Alex-Cucos-2"
                },
                {
                    "user_id": "Rylan Mendoza",
                    "user_href": "/profile/Rylan-Mendoza"
                },
                {
                    "user_id": "Rodolfo Lam",
                    "user_href": "/profile/Rodolfo-Lam"
                },
                {
                    "user_id": "Ty Ottewine",
                    "user_href": "/profile/Ty-Ottewine"
                },
                {
                    "user_id": "Neelabh Tiwari",
                    "user_href": "/profile/Neelabh-Tiwari-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Divya Shah",
                "href": "/profile/Divya-Shah-80"
            },
            "answer_text": "The best flight I have ever had was Qatar Airways QR 0725 from Doha to Chicago. It was my first ultra long haul flight with a flight time of 14:30 hours and I was pretty excited for it. I was traveling from Ahmedabad and despite multiple requests did not get a window seat for the Doha-Chicago flight . In Doha I requested a change of seat and was assigned a window seat in the huge Boeing 777–300 ER . It was an all day flight which made it even better . I captured some of the best views that I had never seen in my life .The seats were very comfortable and the IFE was just fabulous with a large choice in movies and TV shows. The meal was one of the best I had on any of my previous flights and I will never forget this memorable flight . DS ",
            "date": "Answered September 11, 2017",
            "views": "99",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sachit Vasudeva",
                    "user_href": "/profile/Sachit-Vasudeva"
                },
                {
                    "user_id": "Neil Gois",
                    "user_href": "/profile/Neil-Gois"
                },
                {
                    "user_id": "Shripad Sawant",
                    "user_href": "/profile/Shripad-Sawant-1"
                },
                {
                    "user_id": "Manoj Kagdiyal",
                    "user_href": "/profile/Manoj-Kagdiyal"
                },
                {
                    "user_id": "Aves Raggiana",
                    "user_href": "/profile/Aves-Raggiana"
                },
                {
                    "user_id": "Joeine Smarz Kriekel",
                    "user_href": "/profile/Joeine-Smarz-Kriekel"
                },
                {
                    "user_id": "Abbas Kermalli",
                    "user_href": "/profile/Abbas-Kermalli"
                },
                {
                    "user_id": "Gwen Schulte",
                    "user_href": "/profile/Gwen-Schulte"
                },
                {
                    "user_id": "Akshi Goswami",
                    "user_href": "/profile/Akshi-Goswami"
                },
                {
                    "user_id": "Raghav Acharya",
                    "user_href": "/profile/Raghav-Acharya-8"
                }
            ]
        }
    ]
}