{
    "title": "What made Eddie Van Halen so that his Frankenstrat, which was only a Stratocaster painted with Humbucker, would not be out of tune using the tremolo lever on his first album? - Quora",
    "tags": [
        "Frankenstrat",
        "Eddie Van Halen (musician)",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Owens",
                "href": "/profile/Steve-Owens-11"
            },
            "answer_text": "Edward Van Halen pieced together the original black and white frankenstrat out of the cheapest strat-style body he could find (from a “seconds” bin at Boogie Bodies), a wide maple neck with a thin profile, and hardware parts that he had laying around his parents’ garage including a stock tremolo from a ‘58 stratocaster. Contrary to popular belief, Edward did not begin experimenting with the Floyd Rose tremolo until the tail end of their first tour. A few of the songs on their first album (VH 1) featured Ed’s Destroyer which didn’t even have a tremolo system. “You Really Got Me” is one example. Ed managed to keep his guitar in tune despite his frequent and aggressive use of the tremolo by a combination of expert guitar assembly and setup, and impeccable technique. The guitar assembly and setup techniques are mostly standard practice now and can be found in countless books and online tutorials. Eddie tunes his guitars very carefully; he uses a standard tuning (usually down 1/2 step), but each string is tuned +/- a few cents depending on the key of the song and which chords will be played. This alone makes his guitar sound very much “in tune” with itself. Ed’s playing technique, however, is what really distinguished him from his peers. Ed knows how far he can push the tremolo before it impacts his tuning and he knows how to pull up on the tremolo bar to ensure the strings return to their pre-dive length and tension. Over the next several years Edward went on to help Floyd Rose perfect the tremolo. The first few prototypes that Ed tested were dissapointments because they were difficult to use and it was difficult to keep in tune. It wasn’t until after Floyd Rose incorporated Ed’s recommendation to add finger tuners to the bridge that the Floyd Rose tremolo became a success. ",
            "date": "Answered July 12, 2018",
            "views": "29",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andy Ronayne",
                    "user_href": "/profile/Andy-Ronayne"
                },
                {
                    "user_id": "James Kang",
                    "user_href": "/profile/James-Kang-52"
                },
                {
                    "user_id": "Aishik Roy",
                    "user_href": "/profile/Aishik-Roy"
                },
                {
                    "user_id": "TJ Wilson",
                    "user_href": "/profile/TJ-Wilson-23"
                },
                {
                    "user_id": "Chester Blount",
                    "user_href": "/profile/Chester-Blount"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Barnett",
                "href": "/profile/Chris-Barnett-30"
            },
            "answer_text": "He has said in interviews that he oiled the nut and string tree, opened up the nut slots, he boiled the strings so they would pre-stretch, he wound the strings up instead of down on the tuning pegs so the strings had a straight pull, and he also held the strings at the bridge end and spun them when he wound them so they wouldn't twist. Also the nut on the original boogey bodies neck he used for the white and black striped guitar, which was the same guitar later taped up and painted red, was brass which would help reduce string friction. I'm sure they still went out of tune at least a little. ",
            "date": "Updated July 6, 2018",
            "views": "1",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andy Ronayne",
                    "user_href": "/profile/Andy-Ronayne"
                },
                {
                    "user_id": "Tony Baron",
                    "user_href": "/profile/Tony-Baron-2"
                },
                {
                    "user_id": "Zack Thompson",
                    "user_href": "/profile/Zack-Thompson-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevin Lang",
                "href": "/profile/Kevin-Lang-6"
            },
            "answer_text": "Believe it or not, that isn't a strat body, just the shape. It truly is a Frankenstein guitar. As for staying in tune, I believe he used the Floyd Rose locking tremolo system, which is (and has always been) light years better than the Fender Kahler bridge system. I unscrewed my strats whammy bar first day I got a strat. Some fun trivia about that iconic and wonderful guitar… the red white and black one we all know and love is exact same guitar as his yellow and black one seen earlier.. just painted different. ",
            "date": "Answered December 27, 2017",
            "views": "865",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Andy Ronayne",
                    "user_href": "/profile/Andy-Ronayne"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rich Sackett",
                "href": "/profile/Rich-Sackett"
            },
            "answer_text": "Properly-adjusted Fender Strat bridges stay in tune just fine. I don’t understand the question. ",
            "date": "Answered December 26, 2017",
            "views": "503",
            "upvotes": "0"
        }
    ]
}