{
    "title": "What song should never have been sung, and why? - Quora",
    "tags": [
        "Song Lists",
        "Songs Recommendations",
        "Song Lyrics",
        "Rock Music",
        "Singing",
        "Song Identification",
        "Music Recommendations",
        "Musicians",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael M. Ross",
                "href": "/profile/Michael-M-Ross"
            },
            "answer_text": "The National Anthem of the United States: “The Star-Spangled Banner”.  First, it’s unsingable. Given the octave-and-a-half range, it’s usually a painful embarrassment to listen to no matter who attempts to sing it. The bigger problem is it’s all about war: O'er the ramparts we watched, were so gallantly streaming?And the rockets' red glare, the bombs bursting in air,Gave proof through the night that our flag was still there;O say does that star-spangled banner yet waveO'er the land of the free and the home of the brave? Granted, it’s about a British bombardment during the War of 1812. However, it should not be the subject of a national anthem that strives for lofty ideals of peace and brotherhood. But then it gets much worse, offensively so: Their blood has washed out their foul footsteps' pollution.No refuge could save the hireling and slaveFrom the terror of flight, or the gloom of the grave. How appalling is that? It’s little known that it was only adopted in 1931. \"My Country, 'Tis of Thee\" was commonly used before that and has, ironically, the identical melody to \"God Save the Queen\". Also, among the contenders before 1931 was \"America the Beautiful\", which is really the unofficial anthem of the United States (as “Jerusalem” is for England). It is a song that celebrates natural beauty, national pride, and humanity. ",
            "date": "Answered November 25, 2019",
            "views": "605",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sam",
                    "user_href": "/profile/Sam-10333"
                },
                {
                    "user_id": "Onnimanni Mäki",
                    "user_href": "/profile/Onnimanni-Mäki-1"
                },
                {
                    "user_id": "Chris Neuberger",
                    "user_href": "/profile/Chris-Neuberger-2"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Summer-Morales-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Patricia Edwards",
                "href": "/profile/Patricia-Edwards-102"
            },
            "answer_text": "Tiptoe through the Tulips by Tiny Tim it hurts my ears and makes my skin itch Any songs by Yoko Ono not only do they/her voice hurt my ears, they actually bleed and her screeching incites my senses to mind numbing violence preferably on her person to shut her the hell up. Maybe sew her mouth shut? Superglue? I don't know I reckon she could rent herself out to a nice Irish Noble family castle as the resident banshee? ",
            "date": "Answered November 26, 2019",
            "views": "249",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kathleen Lorenz",
                    "user_href": "/profile/Kathleen-Lorenz"
                },
                {
                    "user_id": "Autumn Gabriel",
                    "user_href": "/profile/Autumn-Gabriel-1"
                },
                {
                    "user_id": "Nancy Madura",
                    "user_href": "/profile/Nancy-Madura-2"
                },
                {
                    "user_id": "Anugna Balasubramanian",
                    "user_href": "/profile/Anugna-Balasubramanian"
                },
                {
                    "user_id": "Milo Smith",
                    "user_href": "/profile/Milo-Smith-6"
                }
            ]
        }
    ]
}