{
    "title": "What are some differences between a Stratocaster guitar and a Telecaster guitar, besides their appearance? - Quora",
    "tags": [
        "Stratocaster Guitar",
        "Telecaster Guitar",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Johnston",
                "href": "/profile/Robert-Johnston-26"
            },
            "answer_text": "That question, when unanswered well, is probably the #1 reason guitar players sense lingering frustration with guitar tone, so they have to dig deeper into what makes those two guitars tick, or they’ll live lives of smashing guitars out of immense confusion and frustration. The Tele has a maple neck, ash body and a powerful but rather trebly/high pitched and quite shallow (and often frustratingly so) tone because of the combination of scale length + wood choice + single coil pickup types + pickup placement + pot types (volume+tone controls). If owners learn about alternatives in pickups and pots and switch the fingerboard to rosewood instead of maple, they can give the Tele a huge new range of tone options, whereas the guitars right out of the factory as often the most limiting collection of options, the worst mix possible. The Tele is notorious for generating complaints about the ice-pick trebly bridge pickup and the “too weak” and shallow-toned neck pickup. Independent pickup makers have some truly SATISFACTORY alternatives, and you should look into offerings by such names as Lace, Fralin, Harmonic Design, Bill Lawrence, Rio Grande, Seymour Duncan and Dimarzio, for lower or zero-hum options with far better tone with a much wider frequency range of response, and much wider range of dynamics. And never forget to try different pickup distances from the strings, to be sure you’re getting the best option for how you want YOUR guitar to sound. The Strat: I’ll let others describe it, it’s a longer list of tonal options. It has the same scale length as the Tele, which leads to a sharper tonal focus than a Gibson, which has a shorter scale length (distance between the bridge and the nut). That’s a huge marketplace of alternative pickups, wood types. pot spec options (huge tonal influence!!!!!!!), bridge designs too. My huge and almost only complaint about the Strat is that because the body is so extremely hollowed out to make room for the three pickups and the tremolo springs on the back, that the body has lost most of its capacity for full-range resonance and leaves the guitar sounding quite “soapy”, it’s lost the high and especially, the lower frequencies in its natural resonance, leaving a mid-range focus accentuated, which I really don’t like. I much prefer the sound of a “hard-tail” Strat, where there’s no tremolo (at least of the Fender style) and therefore the back of the body hasn’t had any wood routed out between the neck and the bridge. One complaint I have against both guitars is the “string through the body” bridge design, which has the string come across the bridge post and almost immediately take a sharp bend down through the body of the guitar. This sharp angle so close to the bridge contact actually applies a negative musical force; it forces the string to vibrate less fully, constricted by tension there. and certainly constricts bass harmonics on each string. It’s a much better setup to have the string contact the bridge at a very low bend angle, enough to keep constant contact, to prevent buzzing, but no more, and the standard Gibson design of having the bridge post and bridge string contact as two separate pieces about 1.5 inches apart, allows the string angle to be minimal right at the bridge contact. Some Gibson players actually bring the string up over the top of the rear piece to keep that angle even lower, near to level, at the bridge/string contact post, IF and for those strings where running the string out from under the rear post made the string/post bend angle too high. THEREFORE, for Strats and Tele’s, I’d advise switching to a low-angle setup at the bridge, using a Gibson-style bridge, a tremolo option that does that, a Bigsby-style (whether use the tremolo or not) or rear-body string base setup. It can sometimes also help the overall tone of the guitar if the bridge is a heavy metal one like a Bigsby rather than the thin tinny metal ones from Fender, but that is a factor also sensitive to overall guitar tone from other factors. There’s no way I’d ever buy a Strat with the rear body routed out for the Fender tremolo/vibrato springs. And another thing (Fender, are you listening?), why does Fender make such HUGE routing holes for the pickups, between pickups and for the wires, instead of keeping that to a minimum to help tonal properties? Egads, folks! Then they cover that massive damage with over-sized and cheap-looking plastic “pick guards” that no matter how expensive the guitar is or how good looking the wood finish and fingerboard look, reduces the aesthetic appeal of the guitar a great deal. I’d suggest Fender reduce the size of the routed-out space and greatly reduce the size of the pick guards and then produce a new type of pick guard that matches the level of appeal of the great effort put into the wood finishes. Fender will never hire someone like me who thinks their pick guards are sub-Tonka toy level - looking junk. LOL ",
            "date": "Answered January 7, 2018",
            "views": "29",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kostas Kantounis",
                    "user_href": "/profile/Kostas-Kantounis"
                },
                {
                    "user_id": "Alex Johnston",
                    "user_href": "/profile/Alex-Johnston-39"
                },
                {
                    "user_id": "Abishai Demetrius",
                    "user_href": "/profile/Abishai-Demetrius"
                },
                {
                    "user_id": "Brianna Thomas",
                    "user_href": "/profile/Brianna-Thomas-68"
                },
                {
                    "user_id": "Larry Atchley Jr",
                    "user_href": "/profile/Larry-Atchley-Jr"
                },
                {
                    "user_id": "Dennis Komsa",
                    "user_href": "/profile/Dennis-Komsa"
                },
                {
                    "user_id": "Mike Reilly",
                    "user_href": "/profile/Mike-Reilly-60"
                },
                {
                    "user_id": "Thomas Packer",
                    "user_href": "/profile/Thomas-Packer-5"
                },
                {
                    "user_id": "Pavil",
                    "user_href": "/profile/Pavil"
                },
                {
                    "user_id": "Alex Ruuska",
                    "user_href": "/profile/Alex-Ruuska-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charl Pantaleon",
                "href": "/profile/Charl-Pantaleon"
            },
            "answer_text": "I’m gonna talk about these guitars in their standard configuration, so no SuperStrats or no Nashville Telecasters will be included in this answer.  The Fender Stratocaster has three single-coil pickups, a tremolo bridge with six saddles, two tone controls (neck and middle) and a volume control, a 3-way switch traditionally, but a 5-way switch is way more common and allows that distinct Strat neck/middle and bridge/middle tones to be achieved easier. It has a contoured body, a jack plate on the top of the body, and a “medium-size” headstock. The rear has the spring tremolo system with usually 3 springs, with space up to 5 springs, and typically a steel tremolo block. Traditionally, it’s made of alder (although the first few years, they were made with ash), and vintage spec models have a 7.25″ fingerboard radius (modern Strats are made with 9.5″ radius, with some models offering 12″ radius). One piece maple necks were standard, and rosewood fingerboards were offered starting in 1959. Pickguard screw number and placement depends on the year, but most commonly 11-screw, and thickness depends as well, but the shape has stayed pretty much the same.  The Fender Telecaster has two single-coil pickups. The neck pickup has a metal cover, and the bridge pickup is actually mounted in the bridge, and has a baseplate that gives it the famus Telecaster tone. It has an ashtray bridge (it got its name from the bridge covers that looked like an ashtray) with three brass saddles (six individual saddles are getting more common), one master tone and one master volume control, a 3-way switch, a slab body (no contours), a jack plate on the bottom of the body, and a “small-size” headstock. Traditionally, it’s made of alder (although the first few years, they were made with ash), and vintage spec models have a 7.25″ fingerboard radius (modern Telecasters are made with 9.5″ radius, with some models offering 12″ radius). One piece maple necks were standard, and rosewood fingerboards were offered later on. Pickguard screw number and placement depends on the year, and thickness depends as well, but the shape has stayed pretty much the same. Some Telecaster variations include the Telecaster Custom with a bound body, and the Telecaster Deluxe with two (highly revered and legendary) Wide-Range Humbucker pickups and the large headstock, and individual tone and volume controls. Regarding the sound, the Telecaster tone is known for its famous bridge pickup - twangy, yet beefy and powerful, compared to the Strat’s weaker sounding bridge pickup. The neck is the opposite - it’s darker and smoother, more polite, compared to the Stratocaster’s ballsy neck pickup tone (which is my favorite neck pickup tone). The Tele’s neck pickup tone blends very well with the bridge pickup, making the Telecaster an extremely versatile guitar, despite its simple looks and configuration. In fact, Ted Greene, a legend among Jazz players but never really rose to fame, used a Telecaster for jazz. The Strat’s position 2 and 4 give it its famous quack, because the neck or bridge pickup is running alongside the middle pickup. And speaking of the middle pickup, it’s quite underused alone. I personally like the middle pickup, because it’s the perfect middle between the neck and bridge. It’s not as round as Les Paul / ES-335 / Tele middle tones, but for the Strat, it works. It’s ballsy and warm, yet it cuts through like the bridge pickup. ",
            "date": "Answered November 20, 2017",
            "views": "74",
            "upvotes": " View 66 Upvoters",
            "upvoters": [
                {
                    "user_id": "Steven Petersson",
                    "user_href": "/profile/Steven-Petersson"
                },
                {
                    "user_id": "Abishai Demetrius",
                    "user_href": "/profile/Abishai-Demetrius"
                },
                {
                    "user_id": "Maciej Mołdach",
                    "user_href": "/profile/Maciej-Mołdach"
                },
                {
                    "user_id": "Bill Crimando",
                    "user_href": "/profile/Bill-Crimando"
                },
                {
                    "user_id": "Gerald Shinn",
                    "user_href": "/profile/Gerald-Shinn"
                },
                {
                    "user_id": "Les Borean",
                    "user_href": "/profile/Les-Borean"
                },
                {
                    "user_id": "Rene Howard",
                    "user_href": "/profile/Rene-Howard"
                },
                {
                    "user_id": "Tim Knowles",
                    "user_href": "/profile/Tim-Knowles-11"
                },
                {
                    "user_id": "James Rook",
                    "user_href": "/profile/James-Rook-2"
                },
                {
                    "user_id": "Lesley Diane Guitar",
                    "user_href": "/profile/Lesley-Diane-Guitar"
                }
            ]
        }
    ]
}