{
    "title": "What makes a good rap lyric? - Quora",
    "tags": [
        "What Makes a Good X?",
        "Rap Music",
        "Hip Hop Music",
        "Song Lyrics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Isaac Yums",
                "href": "/profile/Isaac-Yums"
            },
            "answer_text": "What makes a good rap lyric? Errm, this is a somewhat difficult question. With differences in listeners’ expectations and general exposure to ‘good’ music, what seems good to a listener may appear horrible, average or even extra-terrestrial to another. There are some constants, however. Before I touch on them, I’d like to say that a good lyric may have nothing to do with excellent vocabulary or edge-cutting figures of speech. Most award-winning songs come with lyrics written in everyday English devoid of vocabulary or excessive use of simile, metaphors, hyperbole, etc. A good lyric may feature the following constants: a. A vivid storyline. From bar to bar, a rap lyric worthy of being called ‘good’ develops around a story line. The unfolding of events is orderly. It becomes easy to know what the music tries to preach in say, just a verse. b. Emotions. A good lyric should be capable of indulging your emotion and interest. You should RELATE to the artist’s feelings based on how he says what; virtually stepping in the musician’s shoes whether you’ve really had such experience or not. A good lyric makes you do that c. Intelligent construct/Punchline. Imagine being in Ireland but still thinking about London. Yes! Something got to hit u real hard yet sweet enough for u to daydream about for a few seconds while he workin his way around the words to hit u again after barely recovering from the first. (Only few can relate). d. Flawless Transitioning. Some artists tend to be more careless migrating a song from its verse into the chorus, a second verse ending well and effortlessly blending with the chorus, etc. A good lyric may not be one desperately looking for out-of-context words that sort of ‘rhyme’ well in order to blend with a chorus or bridge. e. A good lyric has this crazy I'm-here-to-kill aura. U can sense it when u read the first two, three, four lines. For this, i can’t explain. Its too sensory to be written. Thanks. ",
            "date": "Answered January 31, 2017",
            "views": "37",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aaron Nikels",
                    "user_href": "/profile/Aaron-Nikels"
                },
                {
                    "user_id": "Anup Ghosh",
                    "user_href": "/profile/Anup-Ghosh-105"
                },
                {
                    "user_id": "Shayaan Patel",
                    "user_href": "/profile/Shayaan-Patel"
                },
                {
                    "user_id": "Benny Boi",
                    "user_href": "/profile/Benny-Boi-8"
                },
                {
                    "user_id": "Young Sparrow",
                    "user_href": "/profile/Young-Sparrow"
                },
                {
                    "user_id": "Deirdre Beecher",
                    "user_href": "/profile/Deirdre-Beecher"
                },
                {
                    "user_id": "Vannessa Mayne",
                    "user_href": "/profile/Vannessa-Mayne"
                },
                {
                    "user_id": "Pann Africann",
                    "user_href": "/profile/Pann-Africann"
                },
                {
                    "user_id": "Lusmas Iman",
                    "user_href": "/profile/Lusmas-Iman"
                },
                {
                    "user_id": "Drey Jay",
                    "user_href": "/profile/Drey-Jay"
                },
                {
                    "user_id": "Thomas Hammons Jr",
                    "user_href": "/profile/Thomas-Hammons-Jr"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jonathan Berry",
                "href": "/profile/Jonathan-Berry-23"
            },
            "answer_text": "That all depends on what you are looking to get out of rap. The reason lyrics in any song are good to you is because 1) you enjoy the delivery 2) you understand the message and 3) you value the message that the lyrics are trying to convey. The same thing goes with rap, as good rap lyrics depend on what you like about the song  If you value the delivery of rap music and enjoy wordplay, and don't mind the message being a little shallow at times (a sort of mindless enjoyment. Not something you dig deep into and analyze for meaning but just something you can relax to and take in) then I would point you towards fast rappers (aka \"choppers\") Their rap style and lyrics are all based around performance and sounding like badasses. (Tech N9ne, Twista, Busta Rhymes, etc). Other rappers are just like fast rappers, but slower. These \"regular\" rappers are what you generally find in the mainstream (Lil Wayne, 2 Chainz, Tyga, etc. personally my least favorite category) Then there is rap with a message.  These rappers have a delivery style of regular or fast rappers, only their lyrics have undertones, metaphors, thought out and dissectable messages. If you are looking for this type of rap, I would recommend listening to certain songs by MURS (Everything, Love And Appreciation, and No More Control are good examples). My favorite rapper with a message is hands down Watsky. I could give you probably about twenty song recommendations, but I'll narrow it down to about 5: Never Let It Die, Sloppy Seconds, Cardboard Castles, All You Can Do and Tiny Glow Screens (both parts).  So yeah, long answer. Sorry about that. If you have any questions I'd love to answer them!   ",
            "date": "Answered February 4, 2016",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Anup Ghosh",
                    "user_href": "/profile/Anup-Ghosh-105"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rachit Srivastava",
                "href": "/profile/Rachit-Srivastava-41"
            },
            "answer_text": "A rap lyric is basically poetry. You use metaphors, similes, wordplays, multis, internals, etc. The most important thing that makes a rap lyric or any lyric a good one is that IT SHOULD HAVE SOME MEANING. lolYou cant just say anything, you know! haha.Your lyric should be properly structured and it should convey some message :DMost importantly,  it should entertain people who listen to the song  ",
            "date": "Answered April 23, 2016",
            "views": "636",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anup Ghosh",
                    "user_href": "/profile/Anup-Ghosh-105"
                },
                {
                    "user_id": "Jason Murphy",
                    "user_href": "/profile/Jason-Murphy-360"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alan Raven",
                "href": "/profile/Alan-Raven"
            },
            "answer_text": "A good rap verse/song must contain: Some level of literary devices (metaphors, similes, wordplay, multisyllabic and/or internal rhymes)An above-average vocabularyA good flowSome sort of message and/or emotionA sonically pleasing soundA good instrumentalAgain, 1 or 2 of these could be non-existent in a song, yet being good, but that’s a rare case. ",
            "date": "Answered November 12, 2016",
            "views": "417",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kiara Moore",
                "href": "/profile/Kiara-Moore-5"
            },
            "answer_text": "In my opinion, I love to hear old school rap. All of those kind of rap songs have the most emotion. Like Tupac, he put his life into his music. If you listen to his song So Many Tears, you can hear how it was like growing up where he grew up. Today's music is mostly about twerking, even though I'm a 2000s kids, I act like I was born in the 1990s. I mostly listen to 90s music and early 2000s music. I've had so many people tell me that my mental age is around 17-20 years old. And I have to agree with them. But back to your question. You might just want to listen to 90s rap songs, and then get a little inspiration from them. Put some feeling into your songs. ",
            "date": "Answered March 2, 2016",
            "views": "803",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anup Ghosh",
                    "user_href": "/profile/Anup-Ghosh-105"
                },
                {
                    "user_id": "Farida Bakrin-Ottun",
                    "user_href": "/profile/Farida-Bakrin-Ottun"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ethan Martin",
                "href": "/profile/Ethan-Martin-16"
            },
            "answer_text": "The music that is enjoyed the most is music that more people can relate to. However, the only true way to judge whether or not lyrics are good is making your opinion.  Nobody else can tell you that your favorite lyrics are bad.  They can tell you that they don't like the lyrics but, if you like them, they are good to you. ",
            "date": "Answered February 17, 2016",
            "views": "419",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chloe Wang",
                    "user_href": "/profile/Chloe-Wang-50"
                }
            ]
        },
        {
            "author_info": {
                "name": "Flash Hood",
                "href": "/profile/Flash-Hood"
            },
            "answer_text": "To make a good rap lyric u need to rhyme all the words and u need to know he u should put them in the beat to go with the flow check this video     ",
            "date": "Answered February 22, 2016",
            "views": "124",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hafiz Mohammad Yawar",
                    "user_href": "/profile/Hafiz-Mohammad-Yawar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wilson H",
                "href": "/profile/Wilson-H"
            },
            "answer_text": "Make it rhyme, make it relate to your song, if your singing a song about how rough your life is, or was, then make all your lyrics relate to that. If the song is about money or women make the lyrics about that, dont mix the two genres together keep all the lyrics in the same mood. Also make it relate to the audio of the song. Hopefully this is what you wanted. ",
            "date": "Answered February 21, 2016",
            "views": "450",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Victoria Brizendine",
                "href": "/profile/Victoria-Brizendine"
            },
            "answer_text": "work work work work work ",
            "date": "Answered February 29, 2016",
            "views": "62",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lukas Kaiser",
                "href": "/profile/Lukas-Kaiser"
            },
            "answer_text": "References to Adam Sandler films -  \"Abracadabra I'm up like Viagra I just do this shit for my clique like Adam Sandler\" - Lil Wayne, 3Peat ",
            "date": "Answered February 20, 2016",
            "views": "578",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Betty Moran",
                "href": "/profile/Betty-Moran-1"
            },
            "answer_text": "yo, yo, yo, my name is Joe.  ",
            "date": "Answered March 1, 2016",
            "views": "68",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Geoff Cunningham",
                "href": "/profile/Geoff-Cunningham-3"
            },
            "answer_text": "There's no such thing ",
            "date": "Answered August 4, 2019",
            "views": "51",
            "upvotes": " Answer requested by Ben Lukacher"
        },
        {
            "author_info": {
                "name": "Sukil Luke",
                "href": "/profile/Sukil-Luke"
            },
            "answer_text": "a bad past ",
            "date": "Answered March 1, 2016",
            "views": "53",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Takarla Newell",
                "href": "/profile/Takarla-Newell"
            },
            "answer_text": "rap   ",
            "date": "Answered March 1, 2016",
            "views": "41",
            "upvotes": "0"
        }
    ]
}