{
    "title": "What is the meaning of the song Delicate by Taylor Swift? - Quora",
    "tags": [
        "Taylor Swift Songs",
        "Taylor Swift (musician)",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yashvi Maurya",
                "href": "/profile/Yashvi-Maurya"
            },
            "answer_text": "Taylor Swift's song Delicate is basically her expression of suffocation caused to her by media, hatred, trolls, etc. The lyrics of her older song Enchanted and the music video of Delicate has a lot in common. She creates a world of her own in every music video she ever makes. In the one for Delicate, she lives a time of her life away from the spying eyes of haters and media. She also gives a hint of finding a true love through the secret note passed to her by a male hand. The lyrics talk about her bad reputation created by the media and people who are either jealous of her success or just can't understand it. Also, she gives a hint of finding true love in her lyrics in the second verse. The song as a whole tells a story of her of the time when she disappeared from the industry and went invisible for a long time. :) ",
            "date": "Answered April 19, 2020",
            "views": "366",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sirisiri Samsung",
                    "user_href": "/profile/Sirisiri-Samsung"
                },
                {
                    "user_id": "Sagar Srivastava",
                    "user_href": "/profile/Sagar-Srivastava-47"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tanusree Nath",
                "href": "/profile/Tanusree-Nath"
            },
            "answer_text": "Delicate is an emotional song written about the phase when you meet someone but you're scared to approach them because you have a bad reputation. And you're afraid that your reputation will scare them away. So you just take each step delicately while wondering all the time about what the other person might think of you. And you are really attracted to them, but you can't bring yourself to be up front about it. ",
            "date": "Answered June 5, 2019",
            "views": "985",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vansh Sharma",
                    "user_href": "/profile/Vansh-Sharma-79"
                },
                {
                    "user_id": "Aastha Hingar",
                    "user_href": "/profile/Aastha-Hingar"
                },
                {
                    "user_id": "Ragini Verma",
                    "user_href": "/profile/Ragini-Verma-51"
                },
                {
                    "user_id": "Nandani",
                    "user_href": "/profile/Nandani-15"
                },
                {
                    "user_id": "Sifat Kaur",
                    "user_href": "/profile/Sifat-Kaur-7"
                }
            ]
        }
    ]
}