{
    "title": "What are the 25 best hip-hop albums of the last 10 years and why? - Quora",
    "tags": [
        "Hip Hop Music Recommendations",
        "Rap Music",
        "Hip Hop and Rap Artists",
        "Hip Hop Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "T Prez",
                "href": "/profile/T-Prez-1"
            },
            "answer_text": "Here are my top 25 hip-hop albums of the last ten years in no order. I’m not including mixtapes even though there are phenomenal ones like Friday Night Lights and Acid Rap. Tha Carter III (2008) by Lil Wayne is a phenomenal album and arguably his best. His lyricism is simply on another level.808s and Heartbreak (2008)- Although this album is a mixture of hip-hop and electropop, it is immaculately produced and Kanye’s most influential album.Only Built for Cuban Linx II (2009)- One of the most underrated albums of the year. It’s one of the best rap albums of 2009, probably the best. Raekwon is one of the best lyricists alive.Man on the Moon: The End of Day (2009) is Kid Cudi’s debut and remains his best album. It’s influence is massive.The Ecstatic (2009) by Mos Def is a brilliant piece of work and has a very eclectic sound. He raps about a plethora of issues with penetrating depth.My Beautiful Dark Twisted Fantasy (2010) by Kanye West is one of my favorite albums of all time. It’s not only the best rap album of 2010, but the best album of 2010. There’s a reason every critic worth their salt gave it a perfect or near perfect review.Teflon Don (2010) is Rick Ross’s best album and filled with great songs like Aston Martin Music, one of my favorite rap songs of the decade.Sir Lucious Left Foot: The Son of Chico Dusty (2010)- Most definitely is one of the best rap albums of 2010. Big Boi, has often been in the shadow of Andre 3000, but his solo album demonstrates his immense skill and lyricism.Take Care (2011) Drake’s second album is his best in my opinion and filled with great songs such as HYFR, Marvin’s Song, Headlines, and so many others. It’s an amazing album.Watch the Throne (2011)- This album saw too titans of the rap game, Jay Z and Kanye, come together and deliver something riveting. The lyricism, audacity, bombastic production, and social commentary on this album make it a great one.Section 80 (2011) is Kendrick Lamar’s debut album is his rawest and filled with amazing songs such as Hiipower, A.D.H.D, and Keisha’s song. It’s an underrated gem in his catalog.Good Kid M.A.A.D City (2012) is Kendrick’s second album, but the first to win him national attention and Grammy nominations. It’s a brilliant coming of age tale from an introverted, introspective youth caught up in the violence of Compton, California. It’s an amazing album.Life is Good (2012) is Nas’s best album in the last decade. Known for having both classics and duds in his catalog, this album is much closer to the first. Nas’s lyricism and emotional depth are evident on this album.Yeezus (2013) is polarizing, abrasive, obnoxious.. and brilliant. It’s one of Kanye’s greatest projects sonically and that’s saying something. It’s riveting and songs like Black Skinhead and New Slaves are shock you with their righteous anger and unmitigated gall.Doris (2013) by Earl Sweatshirt is one of the most underrated albums on the list. Yet, there are simply so many great things about this album from its gritty production to Earl’s unconventional rhyme scheme.Run the Jewels 2 (2014)- This album is also one of the most underrated on here but Killer Mike always delivers. There’s not much to say except in terms of lyricism, it’s one of the best.2014 Forest Hills Drive (2014)- Although it isn’t as critically lauded as many of these albums, it’s vulnerability, production, and positive themes make it one of my favorite.To Pimp a Butterfly (2015)- Undoubtedly the best rap album of 2015. Probably the best album of any genre of 2015. Kendrick delivered a strong social justice album, focused on issues which plague black America. Not only that, he did it brilliantly.Coloring Book (2016) Chance’s debut album is filled with dazzling production, intriguing lyricism, and catered to Christian sensibilities in the most fun way possible. It’s a very enjoyable album.DAMN (2017) not only won Best Rap Album at the Grammys, but won Kendrick a Pulitzer for good reason. Although not as good as To Pimp a Butterfly or Good Kid in my opinion, this was a phenomenal album which shows Kendrick is capable of out putting great album after great album. It’s very well-produced and radiating with depth.4:44 (2017) is Jay Z’s brilliant, most recent work besides his collab with Beyoncé. 4:44 is his best album in a very long time, probably since Americans Gangster. If ones likes mature rap and clever lyricism which often goes over one’s head, check out this album. The Story of OJ and Smile are phenomenal.Daytona (2018) by Pusha T is short, but that’s the only criticism that can be levied against it. The production is outstanding and lush (thanks to Kanye), Push is one of rap’s best lyricists which shows on here, and it’s the best rap album of 2018.Astroworld (2018) Sonically immaculate, Travis Scott’s album is the best produced album of the year. It’s fun and the vast majority of the songs are simply great to listen to.Kids See Ghosts (2018) is an album that both Kid Cudi and Kanye delivered on. It’s outstanding with its rock influences, unconventional samples, and psychedelic feel. Easily one of the best of the year.Invasion of Privacy (2010) is Cardi’s debut and shows the immense potential she had as a rapper. A mixture of pop, Latin and rap, this is an enjoyable, fun album that showcases her talent and versatility. I enjoy nearly every song on the album, especially Bodak Yellow and Be Careful.",
            "date": "Answered December 23, 2018",
            "views": "29",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joshua Weiner",
                    "user_href": "/profile/Joshua-Weiner-14"
                },
                {
                    "user_id": "Daniel De Luna",
                    "user_href": "/profile/Daniel-De-Luna-1"
                },
                {
                    "user_id": "Louis Borges",
                    "user_href": "/profile/Louis-Borges-1"
                },
                {
                    "user_id": "Logan Leatherman",
                    "user_href": "/profile/Logan-Leatherman-1"
                },
                {
                    "user_id": "Malolan Balaji",
                    "user_href": "/profile/Malolan-Balaji"
                },
                {
                    "user_id": "Mario A",
                    "user_href": "/profile/Mario-A-7"
                },
                {
                    "user_id": "Wyatt Myskow",
                    "user_href": "/profile/Wyatt-Myskow"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Harrison",
                "href": "/profile/Andrew-Harrison-101"
            },
            "answer_text": "Hi hello,i as a musician, love musicians, anyway but i am Christian musician, but Drake did a song that i love, the name of the song is God plan,anyway here are 25 good albums from the last pass ten years,I these albums did well in its time,internationally please check below 1. Raekwon - Only Built 4 Cuban Linx... Pt. II 2. Brother Ali - Us 3. Antipop Consortium - Fluorescent Black 4. Mos Def - The Ecstatic AmazoniTunesMusicSpotify 5. K'Naan - Troubadour 6. Wale - Attention Deficit 7. DJ Quik & Kurupt - Blaqkout AmazoniTunesMusicSpotify 8. J Dilla - Jay Stay Paid 9. Bike For Three! - More Heart Than Brains 10. Q-Tip - Kamaal the Abstract 11. Why? - Eskimo Snow 12. DOOM - Born Like This 13. Souls of Mischief - Montezuma's Revenge 14. P.O.S. - Never Better 15. BlakRoc - BlakRoc 16. Speech Debelle - Speech Therapy 17. Themselves - CrownsDown 18. UGK - UGK 4 Life 19. Lil Wayne - No Ceilings 20. Busdriver - Jhelli Beam 21. Kid Cudi - Man on the Moon: The End of Day 22. dälek - Gutter Tactics 23. Gucci Mane - The State vs. Radric Davis 24. Clipse - Til the Casket Drops 25. Blockhead - The Music Scene ",
            "date": "Answered June 23, 2019",
            "views": "398",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Daniel De Luna",
                    "user_href": "/profile/Daniel-De-Luna-1"
                }
            ]
        }
    ]
}