{
    "title": "What is the single greatest rock song of all time? Why? - Quora",
    "tags": [
        "Song & Album Lists",
        "Hard Rock Music",
        "Rock Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thom Harmand",
                "href": "/profile/Thom-Harmand"
            },
            "answer_text": "Well, there are many timeless classics, and there are different eras and sub-genres in rock music history ( Art-Rock, Prog -Rock, Folk-Rock, Country-Rock, etc). Here are some that I feel are significant in that they reflect social importance in terms of our ( the baby Boomer) Generation, making a statement and/or reflecting a significant moment in time. These may be considered more “Historically Significant”, as “best “ is awfully subjective. “Heartbreak Hotel” - Elvis Presley ( January, 1956) This song came on the radio and blew so many people away. No one could figure out who was singing. Was it a black man? No, it was a white man from Memphis. The significance of this song coming on the radio in 1956 is rather lost on most folks today. “Blowin’ In the Wind” - Bob Dylan ( August, 1963) - While the song was written almost a year earlier, Dylan had been working on it and continually refined it until he decided he was ready to record it. The song had huge social implications, and was Dylan’s breakthrough, becoming a theme song for the Civil Rights movement. Peter, Paul, and Mary recorded it and had a hit with it in June of 1963. This popularized the song even more for the masses, as Dylan’s voice was ( and is now) an “acquired taste”. “I Want To Hold Your Hand” - The Beatles ( November, 1963) - This song kicked off the “British Invasion” in January of 1964. It was already a hit in England, and after several refusals by Capitol records in the U.S., they finally had to release this single because of the demand. Beatlemania broke out here a few weeks later and the rest, as they say, is history. “Satisfaction” - The Rolling Stones ( June, 1965) - Said to be written by Keith Richards in his sleep, he seemed to have dozed off after coming up with the riff on his acoustic guitar. The riff is now legendary, popularizing an effect called a “fuzz box”, which put the sinister tone into the main riff. It was the Stones first #1 in the USA, and voted by the writers of Rolling Stone Magazine as the greatest song in Rock History. “My Generation” - The WHO ( October, 1965) - Perhaps the most rebellious song recorded by that point in time, The Who were working class lads form Shepherd’s Bush, London, mainly playing R&B in clubs. The title of their debut album, “My Generation” is sung by the voice of a Mod by Roger Daltrey ( in a pep pill induced stutter), voicing a great angst and frustration in being young and restless, having no control over his own life. Pete Townsend stated later on that the line “ I hope I die before I get old” meant to him, “rich”. “All You Need Is Love” - The Beatles ( July, 1967) - The Beatles contribution to the first ever live Global television link, and watched by over 400 million in 25 countries. This song was written for the occasion by John Lennon, and perfectly captures the Utopian ideal of the 1960’s. It was/is a highly influential title, and still quoted today. “Woodstock” - Crosby, Stills, Nash, and Young ( March, 1970) - Previously recorded by the song’s author, Joni Mitchell in 1969, the electrified version of this song was used as the theme for the documentary film of the same name. over 400, 000 flocked to a farm in upstate New York for a legendary festival, often imitated, never duplicated. “Stairway To Heaven” - Led Zeppelin ( November, 1971) - Someone glowingly described this song here previously. All I can say is it is probably the most requested and played song in Classic Rock radio history. Pretty huge song, definitely a classic. “Bohemian Rhapsody” - Queen ( October, 1975) - At the time of it’s released, it was sad to be the most expensive single ever made. Written by the late Freddie Mercury, it included an into, a ballad segment, and operatic segment, a hard rock segment and a “ reflective coda”. Quite a project, in 2012 The UK voted the song the nations’ “Favourite Number One” of the last 60 years of music, and Mercury’s vocal performance the greatest of all time by Rolling Stone Magazine. I am sure there are many others that folks will sight, but these again seem to be the most significant in Rock History from the 50’s-1970’s ",
            "date": "Answered October 9, 2018",
            "views": "69",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ben Gribbon",
                    "user_href": "/profile/Ben-Gribbon-1"
                },
                {
                    "user_id": "Jeff Gebhart",
                    "user_href": "/profile/Jeff-Gebhart-2"
                },
                {
                    "user_id": "David Homes",
                    "user_href": "/profile/David-Homes-3"
                },
                {
                    "user_id": "David Zarrick",
                    "user_href": "/profile/David-Zarrick"
                },
                {
                    "user_id": "Stephanie Solis",
                    "user_href": "/profile/Stephanie-Solis-95"
                },
                {
                    "user_id": "Arran Valkin",
                    "user_href": "/profile/Arran-Valkin"
                },
                {
                    "user_id": "Dan Schultz",
                    "user_href": "/profile/Dan-Schultz-17"
                },
                {
                    "user_id": "Jeff Border",
                    "user_href": "/profile/Jeff-Border-2"
                },
                {
                    "user_id": "Adriana Xidia",
                    "user_href": "/profile/Adriana-Xidia-1"
                },
                {
                    "user_id": "Gagan Shim",
                    "user_href": "/profile/Gagan-Shim"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Jordan",
                "href": "/profile/William-Jordan"
            },
            "answer_text": "I find it amusing when something so subjective creates such definitive answers....I mean really, the SINGLE greatest song of all-time? There are some songs that are considered classics that I've heard so many times I wish to never hear them ever again:- 'Stairway To Heaven'- 'Bohemian Rhapsody'- 'Money'- 'Dream On' etc.... The songs that turn me on that I never tire: - 'Can't Catch Me' - Chuck Berry.  Just a guy out on the NJ Turnpike at all hours either racing cars, escaping the highway patrol or cruisin' with a babe.  Think Bruce Springsteen listened to a little of Chuck Berry?\"I bought a brand-new air-mobileIt custom-made, 'twas a Flight De VilleWith a pow'ful motor and some hideaway wingsPush in on the button and you could hear her sing\" - 'Whole Lotta Love' - Led Zeppelin.  While Physical Graffiti is probably my favorite Zep album, I remember when 'Whole Lotta Love' first came on the radio....it just blows out of the speakers and melts the radio into a puddle.  The heaviest top 40 song ever. - 'I Want To Take You Higher' - Sly and the Family Stone. To me it's still an absolute marvel of a song...raucous, ramshackle , highly spirited and about to orgasm, it was Sly at his peak. - 'Roadrunner' - Jonathan Richman and the Modern Lovers.  A geeky anthem on the love of 'cruisin' and playin'  the radio'.  \"Roadrunner, roadrunnerGoing faster miles an hourGonna drive past the Stop 'n' ShopWith the radio onI'm in love with MassachusettsAnd the neon when it's cold outsideAnd the highway when it's late at nightGot the radio onI'm like the roadrunner\" I was cruising mildly buzzed in my '70 Chevelle by the Stop n Shop near the radio towers on rt 128 when the local FM giant debuted the first Van Halen record in it's entirety....I realized I was half way to the Cape when it ended....but that's another story. - 'Whole Lotta Shakin' Going On' - Jerry Lee Lewis. 'The Killer' at his dynamic sleaziest best. Moanin' and growlin' and squeezin' his way into some poor girl's panties......\"\"Easy now....shake it aaaah....shake it babe yeah...just shake it one time for me\". Elvis was coy, Jerry Lee was a dick. - 'Talkin' Trash' - Bette Davis.  Talk about sleaze.....the polarizing ex-wife of Miles Davis made 4 lps that were the raunchiest and grooviest slabs this side of James Brown. This song epitomizes what she was trying to convey to whomever she was bedding at the time.\"I’m yours, I’m over 21Talk a little bit of trash to meDo whatever you wanna do to meTalk trash to me, babyFeel free, I don’t careTalk trash to meTell me what gets you off?Talkin trash, talkin trashRun your fingers through my bushy hair\" - 'Brown Sugar' - The Rolling Stones. There are supposed to better Stones songs but this one from their 'Golden Period' (Beggar's Banquet, Let It Bleed, Sticky Fingers, Exile On Main Street), this ithe one I never tire of.....and there's a lot of them I love but this song epitomizes the Stones at their best for me.  Jagger actually sounds like he means it and as the main writer of it, arguably one of his top 2 or 3 songs he threw together. Richards has the riffs, Charlie and Bill Wyman have the groove, Ian Stewart on the piano and Bobby Keys blasts a great raunchy sax solo....and if you have the 45, 'Bitch' is the b-side.  Can't beat this record. - 'Ace Of Spades' - Motorhead. Lemmy and the boys literally put their amps up to '11' or '12' or '100'....this song just decimates you. This is the song I play before I go into the arena for my hockey games....motorvatin' music to say the least. - 'Search And Destroy' - Iggy and the Stooges - 'Raw Power', the record that turned this top 40 / Motown loving boy into the asshole I am today. With the best intro lyrics to an album, it was a heady experience for a 14 yr old boy struggling in puberty.\"I'm a street walking cheetahwith a heart full of napalm, I'm a runaway son of the nuclear A-bomb, I am the word's forgotten boy, The one who searches and destroys\". I never tire of this record and it always brings me back to those turmoils of my youth. I dug funk, hard rock and got turned on by the campy NY Dolls but Iggy was pure danger....just 3 years later it's the The Clash, Ramones and the Sex Pistols and I finally get off and running..... There's more, depending on what mood I'm in, (Buzzcocks, Cramps, Wire, Rods, Metallica, Little Richard, Cream, Beatles, Dave Clark Five, AC/DC, Creation, etc....), but I got to get off my ass and do something today.... ",
            "date": "Answered April 7, 2012",
            "views": "25",
            "upvotes": " View 28 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeffrey Hocking",
                    "user_href": "/profile/Jeffrey-Hocking"
                },
                {
                    "user_id": "Gordon Hewetson",
                    "user_href": "/profile/Gordon-Hewetson"
                },
                {
                    "user_id": "David Homes",
                    "user_href": "/profile/David-Homes-3"
                },
                {
                    "user_id": "David Zarrick",
                    "user_href": "/profile/David-Zarrick"
                },
                {
                    "user_id": "Divyang Brahmbhatt",
                    "user_href": "/profile/Divyang-Brahmbhatt-3"
                },
                {
                    "user_id": "Kasey Lofty",
                    "user_href": "/profile/Kasey-Lofty"
                },
                {
                    "user_id": "Gina Chiaverini",
                    "user_href": "/profile/Gina-Chiaverini-1"
                },
                {
                    "user_id": "Chris Mccarron",
                    "user_href": "/profile/Chris-Mccarron-10"
                },
                {
                    "user_id": "Laurie Levesque",
                    "user_href": "/profile/Laurie-Levesque-5"
                },
                {
                    "user_id": "Paul Matthews",
                    "user_href": "/profile/Paul-Matthews-108"
                }
            ]
        }
    ]
}