{
    "title": "What is the best version of The Wall by Pink Floyd? - Quora",
    "tags": [
        "The Wall (1979 album)",
        "Pink Floyd Albums",
        "David Gilmour",
        "Rock Singers and Musicians",
        "Pink Floyd (band)",
        "Classic Rock Music",
        "Rock Bands",
        "Rock Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "JG McLean",
                "href": "/profile/JG-McLean"
            },
            "answer_text": "I don't think the Wikipedia release sequence you reference is exactly correct for US releases.  Per the Pinkfloydarchives discography, the first CD release of The Wall in the US was on the Harvest Records label in 1985; this version his hard to find and sought after by collectors for its first-release status more than for sound quality.   CBS records released a version in 1986 and this master recording was used for all releases produced up to 1994.  These all carry Columbia stock number C2K 36183.  There is pretty good agreement among the not-inconsiderable intersection of Pink Floyd fans and audiophiles that this is the best-sounding CD version of the original album available.  Luckily it's also the easiest to find on the secondary market.  (see note 1).   Later releases including all the boxed sets are based on the Doug Sax remastering job which was done just as the Loudness war was heating up, and while it is far from the worst remaster of this era, utilizes significantly more compression and limiting than the previous master -- it sounds louder and might be better for use in a car or over a PA, but for headphones or hi-fi listening the earlier release is your best bet.   There has never been an official release of the film soundtrack; the available bootlegs are of variable quality.  Note that the film included a couple of songs not on the original set and that the music in the film was often drastically edited, re-mixed and/or re-recorded (including substituting vocals from Bob Geldof who played Pink in the film).   If you are looking for something different, may I suggest checking out Is There Anybody Out There? - The Wall Live 1980-81:    This live set was recorded at the original live performances of The Wall at the Earl's Court in London.  The recording exists in two versions; IMO the earlier (2000) master is better, excellently-recorded with great performances and dynamics that best the original in some respects.   The band had broken up by the time this was released and there was little fanfare or promotion for it; it is out of print but readily available used and is worth seeking out.  -- Note 1: the Columbia C2K disc is one of a relatively small number of Compact Discs to be produced using pre-emphasis.  I won't go into the technical details here but one implication is that while it will sound fine on your CD player, if you use an encoder to rip the disc to MP3, FLAC, or other format you will likely find that the sound is very harsh and tinny.  (I suspect that many MP3 versions of the recording floating around \"out there\" also suffer from this problem).  There are ways around this -- and iTunes ripping does not have the problem -- but if you just want a version to rip and play on an MP3 player you might be better off with one of the later remixed versions. ",
            "date": "Answered November 4, 2013",
            "views": "9",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kris Rosvold",
                    "user_href": "/profile/Kris-Rosvold-2"
                },
                {
                    "user_id": "Michael D. Mirne",
                    "user_href": "/profile/Michael-D-Mirne"
                },
                {
                    "user_id": "Dina Gilmour",
                    "user_href": "/profile/Dina-Gilmour"
                },
                {
                    "user_id": "Mike Nolan",
                    "user_href": "/profile/Mike-Nolan-91"
                },
                {
                    "user_id": "Philipp Schaefer",
                    "user_href": "/profile/Philipp-Schaefer"
                },
                {
                    "user_id": "Cindy Schoonoer",
                    "user_href": "/profile/Cindy-Schoonoer"
                },
                {
                    "user_id": "Alexei Trebunski",
                    "user_href": "/profile/Alexei-Trebunski"
                },
                {
                    "user_id": "Zili Wang",
                    "user_href": "/profile/Zili-Wang-1"
                },
                {
                    "user_id": "Huma Saeed",
                    "user_href": "/profile/Huma-Saeed-1"
                },
                {
                    "user_id": "Felipe Guerrero",
                    "user_href": "/profile/Felipe-Guerrero-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andy Diament",
                "href": "/profile/Andy-Diament"
            },
            "answer_text": "I can’t comment on 8 million re-releases, but what you really want is a very early vinyl release as it shows extra lyrics to Empty spaces and the show must go on, and that Hey You originally went at the end of side 3. Such changes were made very late before release, and my copy was bought the day it was released The original sleeve credited guest musicians but not the band members - Mason and Wright weren’t happy. Then compare with the live album/ film as these lyrics were restored Then spend the rest of your life watching youtube clips of Floyd/Waters/Gilmour to find the absolutely definitive Comfortably Numb - I’m still looking ",
            "date": "Answered March 25, 2018",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Edward Baugh",
                    "user_href": "/profile/Edward-Baugh-1"
                }
            ]
        }
    ]
}