{
    "title": "What are the alternatives to recording studios? - Quora",
    "tags": [
        "Specific Recording Studios"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Chase",
                "href": "/profile/John-Chase-26"
            },
            "answer_text": "Spending the money to buy some decent equipment to record at home, taking several years and thousands of hours of practice to learn how to create recordings and mixes that may begin to approach those of a truly great facility with a talented engineer. If you are just doing voice, and or one or two acoustic instruments, this time can be reduced, depending on your dedication. Find someone who has already made this commitment, and come up with an equitable solution that works for the two of you. If recording a full drum kit, loud guitars, horns, a real grand piano, or string sections, you will need to find a good sized home studio. One that is equipped on a more professional level. I don't know what you do in other professions however, the barter system can work in some cases. House painting, landscaping, home renovation, auto restoration, pro videography… Best wishes in your quest! ",
            "date": "Answered June 6, 2018",
            "views": "213",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eric Groch",
                    "user_href": "/profile/Eric-Groch-1"
                },
                {
                    "user_id": "Aaron Carey",
                    "user_href": "/profile/Aaron-Carey-13"
                },
                {
                    "user_id": "Cory Jackman",
                    "user_href": "/profile/Cory-Jackman"
                },
                {
                    "user_id": "John McArthur",
                    "user_href": "/profile/John-McArthur-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cory Jackman",
                "href": "/profile/Cory-Jackman"
            },
            "answer_text": "An alternative to hiring an expensive studio would be finding a good recording engineer. If you find the right engineer/producer they will either have access to spaces for quality recordings of acoustic material or techniques to achieve these without spending on expensive studio hire. I do a lot of this from my home studio which is fairly well equipped for recording and a lot more economical and relaxing for artists to use. A strong connection between the musician and the producer will yield better results than just recording in the best “sonic space”. All the best. ",
            "date": "Answered June 6, 2018",
            "views": "115",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Eric Groch",
                    "user_href": "/profile/Eric-Groch-1"
                }
            ]
        }
    ]
}