{
    "title": "What is the reason we love music so much? How come we get so indulged into it? - Quora",
    "tags": [
        "Understanding Love",
        "Love"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shubhra Mittal",
                "href": "/profile/Shubhra-Mittal-1"
            },
            "answer_text": "Music can inspire such strong feelings and bind us so tightly to other people. “Music affects deep emotional centers in the brain, “ says Valorie Salimpoor, a neuroscientist at McGill University who studies the brain on music. “A single sound tone is not really pleasurable in itself; but if these sounds are organized over time in some sort of arrangement, it’s amazingly powerful.” How music makes the brain happy How powerful? In one of her studies, she and her colleagues hooked up participants to an fMRI machine and recorded their brain activity as they listened to a favorite piece of music. During peak emotional moments in the songs identified by the listeners, dopamine was released in the nucleus accumbens, a structure deep within the older part of our human brain. “That’s a big deal, because dopamine is released with biological rewards, like eating and sex, for example,” says Salimpoor. “It’s also released with drugs that are very powerful and addictive, like cocaine or amphetamines.” There’s another part of the brain that seeps dopamine, specifically just before those peak emotional moments in a song: the caudate nucleus, which is involved in the anticipation of pleasure. Presumably, the anticipatory pleasure comes from familiarity with the song—you have a memory of the song you enjoyed in the past embedded in your brain, and you anticipate the high points that are coming. This pairing of anticipation and pleasure is a potent combination, one that suggests we are biologically-driven to listen to music we like. But what happens in our brains when we like something we haven’t heard before? To find out, Salimpoor again hooked up people to fMRI machines. But this time she had participants listen to unfamiliar songs, and she gave them some money, instructing them to spend it on any music they liked.  Valorie Salimpoor, McGill University When analyzing the brain scans of the participants, she found that when they enjoyed a new song enough to buy it, dopamine was again released in the nucleus accumbens. But, she also found increased interaction between the nucleus accumbens and higher, cortical structures of the brain involved in pattern recognition, musical memory, and emotional processing. This finding suggested to her that when people listen to unfamiliar music, their brains process the sounds through memory circuits, searching for recognizable patterns to help them make predictions about where the song is heading. If music is too foreign-sounding, it will be hard to anticipate the song’s structure, and people won’t like it—meaning, no dopamine hit. But, if the music has some recognizable features—maybe a familiar beat or melodic structure—people will more likely be able to anticipate the song’s emotional peaks and enjoy it more. The dopamine hit comes from having their predictions confirmed—or violated slightly, in intriguing ways. “It’s kind of like a roller coaster ride,” she says, “where you know what’s going to happen, but you can still be pleasantly surprised and enjoy it.” Salimpoor believes this combination of anticipation and intense emotional release may explain why people love music so much, yet have such diverse tastes in music—one’s taste in music is dependent on the variety of musical sounds and patterns heard and stored in the brain over the course of a lifetime. It’s why pop songs are, well, popular—their melodic structures and rhythms are fairly predictable, even when the song is unfamiliar—and why jazz, with its complicated melodies and rhythms, is more an acquired taste. On the other hand, people tend to tire of pop music more readily than they do of jazz, for the same reason—it can become too predictable. Her findings also explain why people can hear the same song over and over again and still enjoy it. The emotional hit off of a familiar piece of music can be so intense, in fact, that it’s easily re-stimulated even years later. “If I asked you to tell me a memory from high school, you would be able to tell me a memory,” says Salimpoor. “But, if you listened to a piece of music from high school, you would actually feel the emotions.” How music synchronizes brains Ed Large, a music psychologist at the University of Connecticut, agrees that music releases powerful emotions. His studies look at how variations in the dynamics of music—slowing down or speeding up of rhythm, or softer and louder sounds within a piece, for example—resonate in the brain, affecting one’s enjoyment and emotional response. In one study, Large and colleagues had participants listen to one of two variations on a Chopin piece: In version one, the piece was played as it normally is, with dynamic variations, while in version two, the piece was played mechanically, without these variations. When the participants listened to the two versions while hooked up to an fMRI machine, their pleasure centers lit up during dynamic moments in the version one song, but didn’t light up in version two. It was as if the song had lost its emotional resonance when it lost its dynamics, even though the “melody” was the same.  Ed Large, University of ConnecticutPeter Morenus/UConn Photo “In fact, when we debriefed the listeners after the experiment was over, they didn’t even recognize that we were playing the same piece of music,” says Large. When playing the more dynamic version, Large also observed activity in the listener’s mirror neurons —the neurons implicated in our ability to experience internally what we observe externally. The neurons fired more slowly with slower tempos, and faster with faster tempos, suggesting that mirror neurons may play an important role in processing musical dynamics and affecting how we experience music. “Musical rhythms can directly affect your brain rhythms, and brain rhythms are responsible for how you feel at any given moment,” says Large. That’s why when people get together and hear the same music—such as in a concert hall—it tends to make their brains synch up in rhythmic ways, inducing a shared emotional experience, he says. Music works in much the same way language works—using a combination of sound and dynamic variations to impart a certain understanding in the listener. “If I’m a performer and you’re a listener, and what I’m playing really moves you, I’ve basically synchronized your brain rhythm with mine,” says Large. “That’s how I communicate with you.” Source: Why We Love Music ",
            "date": "Answered September 24, 2016",
            "views": "676",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Audrey Zhang",
                    "user_href": "/profile/Audrey-Zhang-53"
                },
                {
                    "user_id": "Priya Dharshini",
                    "user_href": "/profile/Priya-Dharshini-536"
                },
                {
                    "user_id": "Ayush Alankar",
                    "user_href": "/profile/Ayush-Alankar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Urmila Shivakumar",
                "href": "/profile/Urmila-Shivakumar-1"
            },
            "answer_text": "Lying down on the terrace, looking at the stars and listening to your favorite track. You immediately get transported to another world. Without music, the world would be silent and dull. Music enfolds you in a blanket of comfort, giving you inspiration in moments of loneliness and sorrow. Music is a mixture of peoples thoughts, dreams, experiences and passion! Music embodies emotions. Music is an escape. It touches peoples life, it is an expression. Music is magical! It transports you to a happy place, a place where your emotions are intertwined with the lyrics of the song. Music touches us emotionally, where words alone can't. Music nourishes the soul, it can evoke every possible human emotion and it enhances almost any activity. Feeling blue? Lose yourself in soul music.Feeling happy? Groove to some upbeat tunes.Music has the ability to transcend our consciousness and speak to something intrinsic in us.It bonds us with other people and makes us nostalgic. It can instantly brighten up your mood! And that is the reason why we love music! I cannot imagine a life without music, can you?   ",
            "date": "Answered September 24, 2016",
            "views": "426",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Akanksha Singh",
                    "user_href": "/profile/Akanksha-Singh-543"
                },
                {
                    "user_id": "Arifullah Bangash",
                    "user_href": "/profile/Arifullah-Bangash"
                },
                {
                    "user_id": "Ayush Alankar",
                    "user_href": "/profile/Ayush-Alankar"
                },
                {
                    "user_id": "Kartik Bhargava",
                    "user_href": "/profile/Kartik-Bhargava-6"
                }
            ]
        }
    ]
}