{
    "title": "What are some good chill rap songs? - Quora",
    "tags": [
        "Hip Hop Music Recommendations",
        "Music Recommendation Lists",
        "Song Lists",
        "Rap Music",
        "Hip Hop Music",
        "Music Recommendations",
        "List Question",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Walter Loso",
                "href": "/profile/Walter-Loso"
            },
            "answer_text": "I don't know what you meant by \"chill\" . Chill good, or chill like netflix and chill. I'll assume the former. I particularly like these songs because they are not too noisy, not too fast, and you can just kick back and \"chill\" and listen to. In no particular order, Eminem Like Toy Soldiers Fine Line Stronger Than I Was Legacy Lighters  Stan Bad Guy Phenomenal (Southpaw soundtrack) Kings Never Die (Southpaw Soundtrack) Going Through Changes Seduction You're Never Over Guts Over Fear Rock Bottom Where I'm At Detroit Vs Everybody Difficult (Proof Tribute) Kanye West Heartless Runaway Amazing Only One Hold My Liquor Bound 2 Fabolous Playa Pain That's Not Love Only Life I Know Want You Back Real One Trapline Bling Doin It Well Ball Drop Young OG Young OG II J. Cole Is She Gon Pop No Role Modelz Hello Apparently Love Yours She Knows  I could go on and on, but I think I'll leave it at that, unless someone would like a more exhaustive list. :)  Also you might want to note that I haven't listed any ol' school hits. Not because i don't think they chill or anything, I just never got around to listening to those. ",
            "date": "Answered February 6, 2016",
            "views": "49",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mumbi Beauttah",
                    "user_href": "/profile/Mumbi-Beauttah"
                },
                {
                    "user_id": "Jenny Ashy",
                    "user_href": "/profile/Jenny-Ashy"
                },
                {
                    "user_id": "Chenyi Zhang",
                    "user_href": "/profile/Chenyi-Zhang-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Noah Abrahamson",
                "href": "/profile/Noah-Abrahamson-1"
            },
            "answer_text": "Here's music that I'm positive that hasn't been mentioned.  I chose these tracks because they are chill, not mainstream, and mostly not offensive.  PUTS -- The Jamboree Pt 2  Quasimoto (Madlib) -- Microphone Mathematics  Bush Babees ft Mos Def -- The Love Song   ATCQ (RIP Phife) -- Jazz (We've got)    Jonwayne -- Altitude   Dutchmassive ft. Surreal -- Life Lines   NoName Gypsy -- Mary Jane Love   Junk Science -- Really Man   Blu & Exile -- She Said It's Okay   Slum Village -- Fall In Love    ",
            "date": "Answered March 28, 2016",
            "views": "24",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jenny Ashy",
                    "user_href": "/profile/Jenny-Ashy"
                }
            ]
        }
    ]
}