{
    "title": "What could I do to better understand atheism? - Quora",
    "tags": [
        "Theism",
        "Religion and Atheism",
        "Atheist Beliefs",
        "Atheists",
        "Understanding and Comprehension",
        "Atheism",
        "Belief and Beliefs",
        "Self-Improvement",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hilary Donovan",
                "href": "/profile/Hilary-Donovan-1"
            },
            "answer_text": "You want to know how to better understand atheism. How would you explain the reasons why you came to believe in God? Maybe your parents had a religion. Maybe they even sent you to a parochial school as mine did, and maybe you were required to go to church. Maybe as time went on, you couldn’t have imagined life without religion. Now imagine someone whose parents didn’t believe in any gods, and they never saw the inside of a church. They’d heard about people having supernatural experiences, but this was like hearing ghost stories. They didn’t sound believable. Then think about how it would be looking from the outside in—seeing the way religion can divide people and wars are conducted because of religious differences. Look at the intolerance toward anyone who is different from the norm. Some people read a book on all of the different religions or take a comparative religion course, and then start to see the similarities in religion and feel, more than ever, that there can’t possible be one true religion. They might all sound a little off and unbelievable. I was an atheist for a few weeks after losing my faith, and now I believe in a supernatural force, not a person or a being, and no afterlife. This doesn’t make me that different from an atheist, since I don’t feel that my belief constitutes a religion. After I lost my faith, there was no getting it back. I prayed for weeks, but I finally concluded that it was totally gone. Then I knew exactly how all of the atheists I knew felt. Atheism isn’t a choice. You can’t help it. You can’t change it. You seem to know it from the bottom of your heart just the way theists feel that they know that God exists. Now I know why someone near and dear to me gave me a disappointed look when she came out to me as an atheist, and I told her that I’d pray for her. She might have wanted to say, “What’s wrong? Why do you think it’s so bad that I can’t believe? I see the similarities in all of the religions, and now I can’t believe in any of them.” If you feel that atheism is wrong and that non-believers will go to hell, pray for all non-believers, and then your conscience will be clear. This is what I used to do. Now I feel liberated from doubts about where certain people will end up after they die. I’m seeing the goodness in people and seeing that their characters don’t always have anything to do with being religious or not. ",
            "date": "Answered October 20, 2020",
            "views": "168",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Camryn Walker",
                    "user_href": "/profile/Camryn-Walker-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Thompson",
                "href": "/profile/David-Thompson-1660"
            },
            "answer_text": "Talk to atheists, the more the better. Atheism doesn't have a doctrine so you'll find a fair amount of diversity in how we came to atheism, how important atheism is to our worldview and how we view religions and religious faith. Some have made careers as atheist missionaries, publicly debating the merit of religious belief and attempting to get people to let go of religious faith. Some are vehemently pro-science who could care less about your personal beliefs so long as public discourse and public education focuses on the natural world and observable phenomenon. Some simply want to be left alone by the religious while some are deeply anti-religion. All that said, you almost certainly understand atheism better than you think. How do you feel about Odin or Ra or Zues? Do they impact your life? What are your opinions about the truth behind those divine claims? Do you believe they are real supernatural beings or do you believe they are superstitions, relics of ancient cultures? I imagine how you feel about those gods is very similar to how I feel about all gods. ",
            "date": "Answered October 19, 2020",
            "views": "135",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Martin Thomas Glass",
                    "user_href": "/profile/Martin-Thomas-Glass"
                }
            ]
        }
    ]
}