{
    "title": "What is the purpose of art? - Quora",
    "tags": [
        "Aesthetics",
        "Contemporary Art",
        "Art History",
        "Modern Art",
        "Purpose",
        "The Arts"
    ],
    "response": [
        {
            "author_info": {
                "name": "Angela Shogren",
                "href": "/profile/Angela-Shogren"
            },
            "answer_text": "Communication.  Art is an attempt to communicate something, pure and simply. If we're talking visual art, then it's an attempt to communicate something visually...if we're talking 'arts' in general, then I'd say it's an attempt to communicate through whichever form(s) you're using - movement, spoken word, words, sound, moving pictures, etc.  The thing being communicated can vary in a myriad of different ways (feelings, information, questions, philosophy, call to attention/action, etc), as can the intended audience (children, art lovers, mainstream public, particular community, etc). Often the artist is simply trying to understand something for themselves - their intuitive or sub-conscious is creating in an effort to communicate with their more literal side, and possibly to others.  I think that the quality can also vary in every which way. If it can be judged at all, it can only be judged on what was the message, who was it intended to reach and did they reach them...not necessarily you, or the critic.  I believe Art is the same as the word Book. Calling something a 'book' doesn't infer it's quality...it just comes from it's intention. A painting is art, a dance performance is art, a drawing is art, a movie is art...I would argue that you could even call a news program art Your child's scribblings used to illustrate something she wants to share with you, Jackson Pollock's splatterings attempt to communicate feelings and wordless ideas about whatever, or Michaelangelo's sculptures used to communicate stories from the bible...whether or not they are successful, terrible, pointless or masterpieces can be debated, but whether or not they are 'art' can't. If you're wondering if something is art, it might help to ask, \"Was the person creating this:  Trying to teach me something? About the world, myself, my community, feelings, themselves?Attempting to make me act or feel? Ask a question or understand something?Creators intent aside, does this make me feel, think, question or act?I'd say if the answer to any of those is \"Yes,\" then it's probably art. If the answer is no, the answer is less clear...after all, you may not be the intended audience...but at least you'll have a basic framework to help get you thinking about it in the correct way.  Then you can move on to the really relevant questions that everyone really want to have - \"Is it good art? Did it serve it's purpose well? Why? Why not?\"  To my thinking, that's where the more interesting debates should be. ",
            "date": "Answered April 20, 2013",
            "views": "221",
            "upvotes": " View 50 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jennybabe D. Perong",
                    "user_href": "/profile/Jennybabe-D-Perong"
                },
                {
                    "user_id": "Husam Mohammed",
                    "user_href": "/profile/Husam-Mohammed-1-1"
                },
                {
                    "user_id": "Andrea Urcia",
                    "user_href": "/profile/Andrea-Urcia"
                },
                {
                    "user_id": "Venkatesh Sunkula",
                    "user_href": "/profile/Venkatesh-Sunkula"
                },
                {
                    "user_id": "Cara Lee",
                    "user_href": "/profile/Cara-Lee-75"
                },
                {
                    "user_id": "Xiaoming Li",
                    "user_href": "/profile/Xiaoming-Li-49"
                },
                {
                    "user_id": "Ram Sundara",
                    "user_href": "/profile/Ram-Sundara"
                },
                {
                    "user_id": "Gaidy Razon",
                    "user_href": "/profile/Gaidy-Razon"
                },
                {
                    "user_id": "Shreyansh Jain",
                    "user_href": "/profile/Shreyansh-Jain-448"
                },
                {
                    "user_id": "David Worlanyo",
                    "user_href": "/profile/David-Worlanyo-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Artsome Co",
                "href": "/profile/Artsome-Co"
            },
            "answer_text": "Last year in an interview with Artsome a young artist said that the best part of making art is that you see things others don’t and the worst was again that you see things others don’t. That struck a chord as that encapsulated the purpose of art. Art is an observationof life. However this does not mean that realismis the only form considered to be art. It depicts life not only as it is but also as it should be and as it is seen by the artist. Perspective and subjectivity therefore matter a lot in art. Art in history has been put to various uses. It represents the culture of a people and comes to stand for history. For this reason it can be used for purposes of propagandajust like in Nazi Germany, as a medium of protestagainst stereotypes, oppression, racial and gender violence. As Andy Warhol said art challenges everything; it militates against accepted notions. Such a protest leads to a society that is more tolerant and accepting. Art therefore reflects the mindset of a society but also strives to challenge and change it. As humans we always feel the need to communicate. For this reason we created languages. Art is a visual language which is universal and the same time cultural. What do I mean by that? While one may not understand Spanish, yet there is something in Frieda Kahlo’s painting that one innately connects with. An artist creates a visual language that is universal. This language being universal is also cultural. That means that we all relate to art differently and so is our understanding and reaction to it. That depends on our background, culture etc. Art is also a representation. And from this comes the intention. We must also be sensitive to the idea how art through representation of a community, culture, nationality or ethnicity can demonise or exoticise it. An interesting note to end this answer would be to think that if art didn’t have a purpose why did the Islamist militants kill the cartoonists at Charlie Hebdo. And two if it weren’t important why would the entire world erupt with more cartoons to challenge terrorism with a ‘art is mightier than the sword’. Just a thought! ",
            "date": "Answered September 7, 2015",
            "views": "63",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Christian Navarrete",
                    "user_href": "/profile/Christian-Navarrete-38"
                },
                {
                    "user_id": "Joshua Saroli",
                    "user_href": "/profile/Joshua-Saroli"
                },
                {
                    "user_id": "Husam Mohammed",
                    "user_href": "/profile/Husam-Mohammed-1-1"
                },
                {
                    "user_id": "Alicia Cai",
                    "user_href": "/profile/Alicia-Cai-1"
                },
                {
                    "user_id": "Gregory Egan",
                    "user_href": "/profile/Gregory-Egan"
                }
            ]
        }
    ]
}