{
    "title": "What's up with the ending of The Long Walk? - Quora",
    "tags": [
        "The Long Walk (1979 book)",
        "Stephen King (author)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rebecca Wilova",
                "href": "/profile/Rebecca-Wilova"
            },
            "answer_text": "Have you ever forgotten what normal feels like? It seems like an impossible thing, doesn’t it. How does anyone forget? I will tell you how. Imagine this. You love food. You’d eat almost anything. Well. Except beans. Not those. Gross. But food. Sushi. Thai. Sauerbraten. Macaroni and cheese. Salad. Cake. McDonald’s. Wendy’s. Monical’s. Birthday dinners. Christmas. Pick me ups. Lunch at the mall. Breakfast before running out for the day. Midnight snacks. Friday night movies at home with pizza. This is what is normal. Then one day you notice that you repeatedly feel unwell eating pizza. So you start eating breadsticks instead. That’s okay, you tell yourself. Breadsticks are fantastic. Then you notice you can’t eat a single salad without being sick for days. That’s okay, you tell yourself. Eating all these fruits and vegetables was an expensive habit anyway. Then you can’t eat meat anymore, you get so sick. That’s okay, you tell yourself. Meat was expensive anyway. Then you notice you no longer can eat normal portions of meals. That’s okay, you tell yourself. Sharing a meal is probably better for everyone and the budget. Then you can no longer eat a few bites of regular food without severe pain. That’s okay, you tell yourself. Ice cream is fantastic. Then even that makes you really sick. That’s okay, you tell yourself. Well, there’s always boost drinks. Then you notice that you drink two bottles a day at best. You really should be having more like eight. That’s okay, you tell yourself. As long as you can still have a little of Diet Coke everything’s okay. And then what will happen when that stops being possible? The end of The Long Walk is the same. Only instead of food… It’s walking. The book and my life, we dovetail these days. Abnormal is the new normal. We rush towards it. It is all we now know. ",
            "date": "Answered February 11, 2018",
            "views": "56",
            "upvotes": " View 32 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Karen Kinsey",
                    "user_href": "/profile/Karen-Kinsey-2"
                },
                {
                    "user_id": "Rajani Kanth",
                    "user_href": "/profile/Rajani-Kanth-86"
                },
                {
                    "user_id": "Deniz Şuözer",
                    "user_href": "/profile/Deniz-Şuözer-1"
                },
                {
                    "user_id": "Angelika Mi",
                    "user_href": "/profile/Angelika-Mi"
                },
                {
                    "user_id": "Jasper Boccalatte",
                    "user_href": "/profile/Jasper-Boccalatte"
                },
                {
                    "user_id": "Jenna Faith",
                    "user_href": "/profile/Jenna-Faith-4"
                },
                {
                    "user_id": "Ty Wilson",
                    "user_href": "/profile/Ty-Wilson-66"
                },
                {
                    "user_id": "Arpit Jain",
                    "user_href": "/profile/Arpit-Jain-201"
                },
                {
                    "user_id": "Todd Edwin Van Dell",
                    "user_href": "/profile/Todd-Edwin-Van-Dell"
                },
                {
                    "user_id": "Sheena Hocking",
                    "user_href": "/profile/Sheena-Hocking"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martin Mathis",
                "href": "/profile/Martin-Mathis-2"
            },
            "answer_text": "Although the story itself was great up until the end, the ending was kind of left a cliff hanger, and I don't know if it should've been left that way or not but it was. Basically it's up to you to interpret what happened after the ending, I think that, what most likely happened, is that Garraty wins and takes the money for Himself, it's Human Nature to do this for most people, because most people are selfish. The idea that the Major was a Villain is accurate but so are the Walkers themselves, they all signed up and supported Him and only cared about getting money for themselves thinking they could beat everyone else, if they actually had overthrown the Major and rebelled against Him maybe there wouldn't be any more Long Walks. But it's not what happened, so you have to assume that the Major rewarded Garraty with the money, and he took it all for Himself. The Major and the Walkers both are Dark Representations of Humanity and Cruelty. ",
            "date": "Answered May 8, 2020",
            "views": "501",
            "upvotes": "0"
        }
    ]
}