{
    "title": "What do you think about the Kpop group GOT7? - Quora",
    "tags": [
        "GOT7 (K-pop group)",
        "K-Pop",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jhing Bautista",
                "href": "/profile/Jhing-Bautista-2"
            },
            "answer_text": "*cracks knuckles* They’re my ult group so you can expect a lengthy reply. Music-wise, I agree to the other comments saying that they aren’t the best. Most of their songs aren’t my cup of tea as well and I can’t listen to them unless I’m in a certain mood. They change styles too often, which is both a good and bad thing. Good because you can see their versatility as artists and bad because you can see the inconsistencies. Let me share some of my thoughts about some of their songs: Hard Carry - I used to hear this a lot back when I wasn’t a stan yet. It was hard-hitting but a little overplayed. A hype song, yes, but to me, nothing more. Come On - This is one of my favorite songs of all time. It’s a bop. Like literally, you would feel the urge to bop your head every time this song is played. If You Do - This is the kind of hard-hitting song that I can play on repeat for one or two days. I’m not kidding. I’ve done it before. I kinda wish they could produce another song with the same vibe. Teenager - Another fave! Love this song to bits. Miracle - I really wanted to like it but I heard Take Me To You first and JB’s part was enough to make me love it more than the title track. The great thing about GOT7 is that they can all compose and write songs. AmeriThaiKong are rappers who write their own raps. Youngjae, Yugyeom, and Jaebeom are all composers who have Soundcloud accounts where they showcase their solo songs. Jackson is a soloist in China. Jinyoung writes great sentimental songs like My Youth and Thank You. Jaebeom and Yugyeom are more into RnB. They write really sensual songs. FOCUS by JUS2 (their subunit) is one of my favorite albums to listen to. Bambam, based on some of the songs I know he composed, seemed to be more into EDM/Hiphop. Jackson too. Youngjae, I’m yet to check his Soundcloud, but I love Hesitate and Time Out is a worthy successor of Come On (which JB composed). I think that more than being idols and singers, they are also artists/composers and should be acknowledged as such. I agree that the rapline isn’t particularly great. I’ve stanned Hanbin and Zico before I became an ahgase. I’ve also listened to Flowsik, Jessi, Agust D (Yoongi), Jooheon, Soyeon, Hyuna, etc, and compared to them, AmeriThaiKong doesn’t have that stand out type of rap style or skills. Don’t get me wrong. They’re not bad, but they aren’t the best. Personally, though, I love listening to Mark’s rap. He has such a crisp voice, which is perfect for rapping. Bambam sounds more mellow and soft and I often compare his voice to honey. Jackson—I joke about this a lot, but he sounds like an old man. His voice sounds mushy. I prefer singer Jackson. He has a lovely singing voice. Surprisingly (to non-ahgase), the vocal line can also rap. WHAT. Jinyoung is a rapper in King (his duo song with Bambam). Jinyoung was originally a rapper in JJProject (with Jaebeom as the vocalist). His voice is deep and solid so when he raps, it sounds like he’s hitting a stone with a hammer. It’s impactful. Jaebeom has a sexy rap voice. Youngjae can spit words too. I love rapper Youngjae. We rarely see him, but we treasure those moments dearly. As people, GOT7 members are hilarious. They clown one another and their fans all the time. But it’s also important to note about their other qualities as individuals. Jaebeom tends to overshare (TMI diarrhea posts), but he’s also very reserved. He keeps some parts of him to himself and I think that’s commendable. I feel like idols share too much of themselves to their fans and fans sometimes feel entitled to those parts. I like that he keeps some things to himself. He draws the line when he has too. He is also the kind of leader who knows his members’ strengths and it’s evident in the part distribution of the songs. He used to be so stubborn (Hard Carry, avatar episode) and I feel like the members used to just leave him alone because he had quite a temper. He’s more open and fluffy now (although he insists he’s not cute, just sexy). I love him to bits and I need to stop right here because I also want to talk about the other members. Jackson is known as the loud one. So much so that when he’s expressionless, people will immediately think there’s something wrong with him. Jackson is human. Humans have different emotions. I feel like since he’s the atmosphere maker of the group and he always seems so loud and carefree, people sometimes disregard his passion and his hardwork. Jackson is also very loyal. Faithful, even. And I hope people will stop asking him about leaving GOT7 or why he’s promoting his solo career. People need to understand that while he is part of a KPOP boy group, he is also an individual and being one of the two does not mean the other will be sacrificed. He can be both and more, okay? Mark used to have this LA Gangster reputation because he threw a laptop at Bambam. Like Jaebeom, he used to have a temper but he’s learned from that and has improved immensely since. He is quiet, most of the time, but I don’t think he should be shamed for that. I think his quietness adds to the mystery and therefore, adds to the appeal. He’s a mature person, judging by his magazine interviews. Maybe it goes with being silent. He doesn’t talk much so he tends to think more. Jinyoung is known for being savage, but he’s not mean-spirited. He’s just being playful. He’s a sensitive person who empathizes well with people. He sees the little things people often overlook. I think this is why he’s such a good actor. Jinyoung is also smart and at times, scheming (this is merely for pranks). He’s almost always the mastermind of their pranks. But he also offers comfort by touching or hugging his members. He knows what they need when they need it, which is why I think a lot of fans dub him as the mom of GOT7 (although he literally said that in one video lol). Also, he knows himself and he knows what he wants for himself. He didn’t want to be known as Junior so he insisted on being called Jinyoung. During one press event, reporters kept taking pictures and he couldn’t understand what was being ask so he raised his hand and told them to stop and they did. I will probably never stop being amazed by that video. Youngjae is my sunshine. He’s the kind of person who has a bright aura that every time you look at him, you just have to smile. He’s not always a happy person, let’s make that clear. I’m sure he has problems too. But he’s someone who doesn’t take people’s BS, especially when he knows he doesn’t deserve them (that one VLive where a “fan” told him to lose weight and he told them, “I’m losing it. Just focus on your own life.” OWNED.) Bambam, aka the dab king. Yes, he lurks on the internet. Yes, he knows we clown him. Yes, he’s very blunt and carefree. And yes, we all love those things about him. But Bambam is not big. HAHAHAHA. Did that guesting play in your head just now? Kidding aside, Bambam is a genuine person. He’s careless sometimes so he makes mistakes. But he owns up to them. Don’t mistake him for someone who always bend down when told, though. He knows when to apologize and when he doesn’t need to. Yugyeom is such a sweetheart. Although he’s the tallest, when you look at all their personalities, he really is the maknae. I have a love-hate relationship with GOT6 pranking Yugyeom. Hate it because he doesn’t deserve the sadness and frustration they made him feel (it’s all good, I know. I’m just slightly protective). Love it because it shows his character. Yugyeom would literally say sorry for just being a bystander, if you put the blame on him. He’d rather take the blame or be scolded than see his members argue. He loves them so much. I have so much more to say but this is already boring enough (too long). In conclusion, I love GOT7 partly because I like most of their songs. As I’ve said before, not all songs are my cup of tea, but the ones I loved are enough to keep me around. I love them because they’re real and their friendship honestly needs to be protected. They have the kind of friendship that make people want to root for them to stay together for a long time. I hope they stay together for a long time. ",
            "date": "Answered May 22, 2019",
            "views": "8",
            "upvotes": " View 129 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nana Waat",
                    "user_href": "/profile/Nana-Waat"
                },
                {
                    "user_id": "SAP",
                    "user_href": "/profile/SAP-41"
                },
                {
                    "user_id": "Sushama Dhaware",
                    "user_href": "/profile/Sushama-Dhaware"
                },
                {
                    "user_id": "Dailyreader",
                    "user_href": "/profile/Dailyreader"
                },
                {
                    "user_id": "Ojkid Sity",
                    "user_href": "/profile/Ojkid-Sity"
                },
                {
                    "user_id": "Christi Naraine",
                    "user_href": "/profile/Christi-Naraine"
                },
                {
                    "user_id": "Carrie Smith",
                    "user_href": "/profile/Carrie-Smith-682"
                },
                {
                    "user_id": "Pranavi Pradeep",
                    "user_href": "/profile/Pranavi-Pradeep-1"
                },
                {
                    "user_id": "Rhea Sandra",
                    "user_href": "/profile/Rhea-Sandra"
                },
                {
                    "user_id": "Micah-Keith Freeman",
                    "user_href": "/profile/Micah-Keith-Freeman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Srinidhi",
                "href": "/profile/Srinidhi-84"
            },
            "answer_text": "I want to really put all my feelings right now. So..they are miracles that ever happened to me. Got7 Vocals: now, I know they are 4 vocalists, but let me tell you, they are 7/7 in vocals. All of them have such a great potential to sing, don't believe me? Please do listen to their switch performance where they switch their vocal and rap parts to eachother. They sang them live and you can see how amazing 7 of their vocals were. Coming to the 4 vocalists, their vocals are freaking stable (honestly all 7 vocals are stable). You can sometimes see how effortlessly each of them hit high notes while just playing around. And they are those groups whom I prefer listening to live than the studio versions.Thier Rap line: they might not be from Korea, but amerithaikong is wonderful. And I don't think it's a weak rap line, they definitely have potential and are amazing and wonderful. And again even vocalists here can rap.Dance: i don't think you can point out and say “he ain't a good dancer.\" You have hit the stage winner right in here bruh. Our maknae. And JB is a great dancer. Mark is great dancer. Bammie is great dancer. Youngjae is wonderful. Jackson is wonderful. Jinyoung is a freaking great dancer.Visuals: im not being biased or smtg, but it's not just Mark or Jackson or Jinyoung, all of them are great visuals. I ain't even kidding. They are amazing.Their friendship: its purest. It's one in a million. It's not a fan service. They don't live to impress you, they don't fake their friendship. If Yugyeom wants to tease Jackson he will, if Bam wants to annoy Mark to throw a laptop, he would. If Youngjae wants to Hit Jackson he would. Jackson would complain about Youngjae he would. Is the leader involved, yes he is. Is the leader crazy too, yes. Is Jinyoung judging, oh yes! We don't hide anything. Yes they don't. Especially their friendship. Even their parents know eachother. Remember those wonderful words Jackson said “7 or never. 7 or nothing.\" “Once a brother always a brother\" “we are not friends, we are family\" “JB isn't my hyung anymore he's my dad- oops sorry.Now very important, their lyrics: those who judge songs by title tracks, please gtfo. I'm serious, for those who always say got7 lyrics are cringy, now, the door is open. If you haven't heard their b-sides, which JB wrote, Jackson wrote, Jinyoung wrote, Mark wrote, Youngjae worte, Bambam wrote, Yugyeom wrote, I don't know which cringy lyrics are you talking about. Just listen to JJP , Mark's Outta my head, Jackson's bullet to the heart, Bambam's remember you, Youngjae's my day, JB's I want to fall asleep, Jinyoung's Run away, the end, Yugyeom from now, to me and they sang many songs together which I sadly can't remember..their side tracks, Page, thank you, confession song are they non existent? Listen to fans singing thank you, and I bet you will cry without you knowing. What is miracle? Oh we don't want to look at songs that make sence? Cool. And many many many more which you are missing out. I'm honestly fed up people saying, “Got7 doesn't have songs that make sense, they are not my taste” then the songs you hear are A and girls girls girls. I don’t understand people hate A and girls girls girls? oh my god they a bops. If you are hating cuz of their hair styles.. um (I still laugh at them, but I do consider it as a beautiful memory and iconic) Honestly, as far as I've seen, they came up with every genre songs and lyrics too. Example: songs like Hard carry, King (Bambam and Jinyoung) , jus2. There are hard snapping songs, soft songs, emotional songs, mental problems songs etc. Look up, songs other than title tracks exist. And don't jump into conclusions by only listening to title tracks and few b-sides.I feel they CAN get better support from the company. JYP is not treating them properly and that's honestly getting annoying day by day.And I don't see anything wrong with them being them. I've seen people complaining over them speaking bad words on camara, honey, what do you think? Your oppaRs never use bad words behind the camera? Since they are just 5 years old, they just expose themselves, for that matter don't overreact.Y'all should get new beds because you are sleeping on them. You just have a complete package with them. An emotional seven connection, being dorks, being humble, being crazy etc.Jackson is still with 7 and forever with 7. Yes he's working solo that doesn't mean he isn't with got7 anymore. He's still there and will be forever. For those who ask him, stop asking him. Don't hurt him.Got7 is my ult. Many of the things might've been biased, but they deserve it. Got7 helped me alot of times when I had gone through times that were hard. They are amazing family and you will never forget or regret stanning them. They are the boys that deserve world not empty seats in their concerts. Yes they love the fans and as far as I've seen, they didn't milk aghase with being very much obsessed with “ahgase” all the time they open their mouth. We tease and make fun of eachother and mostly we love 7 as 7. (Solo stans, unstan got7 right away if you are one of them. We would have fandom with less in number than bringing conflict Because of solo stans. Thank you.) (◍•ᴗ•◍)❤ ",
            "date": "Answered March 8, 2020",
            "views": "18",
            "upvotes": " View 33 Upvoters",
            "upvoters": [
                {
                    "user_id": "Margareth K",
                    "user_href": "/profile/Margareth-K"
                },
                {
                    "user_id": "Nana Waat",
                    "user_href": "/profile/Nana-Waat"
                },
                {
                    "user_id": "Halima Nasrin",
                    "user_href": "/profile/Halima-Nasrin-4"
                },
                {
                    "user_id": "Ekta Sinha",
                    "user_href": "/profile/Ekta-Sinha-76"
                },
                {
                    "user_id": "Sushama Dhaware",
                    "user_href": "/profile/Sushama-Dhaware"
                },
                {
                    "user_id": "Dailyreader",
                    "user_href": "/profile/Dailyreader"
                },
                {
                    "user_id": "Djong Shu Liu",
                    "user_href": "/profile/Djong-Shu-Liu"
                },
                {
                    "user_id": "Lavender Boom",
                    "user_href": "/profile/Lavender-Boom"
                },
                {
                    "user_id": "Jordan Elie",
                    "user_href": "/profile/Jordan-Elie-7"
                },
                {
                    "user_id": "Christi Naraine",
                    "user_href": "/profile/Christi-Naraine"
                }
            ]
        }
    ]
}