{
    "title": "What's so good about the song 'Roar' by Katy Perry? - Quora",
    "tags": [
        "Katy Perry (musician)",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nick du Plessis",
                "href": "/profile/Nick-du-Plessis"
            },
            "answer_text": "“Roar” has a big beat and like any hit song nowadays, 2–3 winning hooks. Unlike a lot of sung (not rapped) hits that you hear, it seems very singable-by-the-average-person. “Roar” fits into the canon of such Motivational Pop/Rock classics as Eye of the Tiger (Survivor), We Will Rock You, We Are the Champions, Lose Yourself, and many more. It doesn’t take a Ph.D. in literature to identify the lyrical shoutouts from “Roar” to the grizzled lineage of sports arena and workout morale booster songs, let alone the songs that get people through the mundane and the quotidian. Since it’s sung by a woman, there’s also an intersection with feminist anthems of the past - 1972’s I Am Woman comes to mind, and the oeuvres of Madonna, Janet Jackson, and many others. ",
            "date": "Updated August 12, 2018",
            "views": "527",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sarah Kaminsky",
                    "user_href": "/profile/Sarah-Kaminsky-3"
                },
                {
                    "user_id": "Adam Gerow",
                    "user_href": "/profile/Adam-Gerow"
                },
                {
                    "user_id": "Shefaly Yogendra",
                    "user_href": "/profile/Shefaly-Yogendra"
                },
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Ringgold",
                "href": "/profile/Chris-Ringgold"
            },
            "answer_text": "The Katy Perry song “Roar” is pretty good for the following reasons: A great Female-Empowerment Message.Katy’s Strong VocalsThe accompanying Music Video which featured Katy in the Jungle (also loved the “Roar” duet between Katy and a Tiger during the Bridge).Nice, Up-Lifting Instrumental Backing that perfectly matched with the Song’s Lyrical Themes.",
            "date": "Answered August 22, 2018",
            "views": "314",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Evelyn Medrano (에벨 린 메드 라노)",
                    "user_href": "/profile/Evelyn-Medrano-에벨-린-메드-라노-イヴリンメドラーノ"
                },
                {
                    "user_id": "Durga Prasad Gautam",
                    "user_href": "/profile/Durga-Prasad-Gautam"
                }
            ]
        }
    ]
}