{
    "title": "What is your favorite recording of any classical piece? - Quora",
    "tags": [
        "Ludwig van Beethoven (composer)",
        "Classical Music",
        "Musicians",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Garry Kling",
                "href": "/profile/Garry-Kling"
            },
            "answer_text": "Glenn Gould’s 1955 recording of Bach’s Goldberg Variations. I don’t like it because it is the most authentic interpretation, the most polished technique, or the best baroque-style keyboard playing. It is by prevailing wisdom the opposite of all of these. He plays the thing on a huge piano instead of a harpsichord, rhythms are uneven, the tempi too fast, and the ornamentation is, well, not right. The recording quality is not fantastic, you can hear the works of the piano, Gould groans along, and the tone of the piano is not well-adjusted (several keys whine and bark throughout). But in an age when the interpretation of Classical Music has increasingly become standardized and artists have less and less freedom to play as they wish, it is transporting. We are immersed in an extremely personal artistic vision. The record is unique and fascinating despite all its flaws. We hear a musical artist who treats Bach as his equal, and almost manages to prove his worth. Bach becomes just another artist who created the variations, which are to be used by a brother artist almost two centuries later, rather than as a God to be worshiped handing down stone tablets to be reproduced by a musical automaton. I love the album because in it irreverence, it imagines a different and wonderful Bach, in Gould’s image. It harkens to an era of interpretation where the composer’s vision of a piece could be considered one of many rather than the one to be sought by the many. A time passed when the same piece of music could sound vastly different when performed by an artist educated a few hundred miles east. National and regional styles of playing existed, and were distinct and identifiable. Classical Music was rich with variety and plenty. But even aside from all the things that make it inspiring to me as a musician, the way he plays this piece is just riveting, and watching the score reveals a witty and interesting mind at work. I cannot recommend it enough. Encountering this recording changed the way I listen to music. ",
            "date": "Answered March 24, 2019",
            "views": "119",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chris Sergeant",
                "href": "/profile/Chris-Sergeant-5"
            },
            "answer_text": "People- the question was not what is your favorite classical piece, but what was your favorite RECORDING. This is about how your “favorite” piece sounds and is reproduced on your stereo. Anybody who is serious knows there is a big difference between live and recorded music. So hard to capture such art in all its glory. I listen on a 2 channel stereo system with two tower stereo speakers. I listen through headphones as well. I listen to cds, on my computer and through satellite tv. I listen intently. I look for recordings that are alive and vibrant where you can hear the bow strike the strings and you can hear the keyboardist pump the pedal. Where you can hear the singers and woodwinds inhale before playing (singing). I look for recordings by London/Decca, Columbia Masterworks, Angel, Phillips, and especially Deutsche Grammophon, Mercury Living Presence, and RCA Living Stereo. The Mercury and RCA recordings are early stereo from the 1950′s and 60’s mastered on 35mm tape. They are gorgeous and almost three dimensional. Just like you are right there. I can’t believe they are 50–60 years old. You can never go wrong with a recording by Deutsche Grammophon. Thankfully we live in the age of the internet. I have found many wonderful live performances from European TV. I mean electrifying! Something about a live performance! It is a crime we don’t have such channels in the USA! We suck! Arte tv is one channel that comes to mind. I have heard some great concerts from the Concertgebouw in Amsterdam. Look up Rachmaninoff’s Symphonic Dances. Awesome! Look up the live performance of Gershwin’s Piano Concerto in F by the Berlin Philharmonic with Marcus Roberts Trio- made me cry! Everyone has their favorite pieces (mine Brahms 2nd Piano Concerto). Music hits you at a time, a place in your life and stays with you forever. The fusion between the art, the performance, and the reproduction equipment and the listening environment is what makes for a wonderful life experience. So a list of a few recordings that really do it for me (and my stereo!)- Deutsche Grammophon- Overtures and Preludes by Richard Wagner, conducted by James Levine and MET orchestra (probably out of print, can be found on Amazon- there are two discs of James Levine Wagner, spellbinding interpretation! also from DG- any recording conducted by Carlos Kleiber- especially his Brahms 4th Symphony and his Beethoven Mercury Living Presence Rachmaninoff’s 1st and 3rd Piano Concerto’s by Byron Janis- this recording is around sixty years old! Sounds like it was laid down yesterday! Seek out any Mercury Living Presence or RCA Living Stereo recording. One special cd I own is one of Chopin’s Polonaises by Arthur Rubinstein recorded in 1935 and 1936 on the Naxos label. It ain’t in stereo. It’s grainy with a lot of hiss. It’s really hard to find. But, the recording! The playing! The passion! The communication of art from Chopin, through Rubinstein, through the technology of the early recording equipment, through remastering, to the record, then cd, through my player and amp and speakers to me in my living room- to my heart and soul- it just knocks me out! ",
            "date": "Answered May 25, 2019",
            "views": "185",
            "upvotes": "0"
        }
    ]
}