{
    "title": "What are your least favorite lyrics? - Quora",
    "tags": [
        "Music and Lyrics",
        "Least Favorite",
        "Favorite Songs",
        "Personal Preferences",
        "Song Lyrics",
        "Songs",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alysyn Bourque",
                "href": "/profile/Alysyn-Bourque"
            },
            "answer_text": "Ugh! I love the catchy riffs and energy of the song, but these lyrics are mind-numbingly IDIOTIC! RATT - You're In Love  \"You're In Love\" You take the midnight subway trainYou're callin' all the shotsYou're struck by lightningYou're in love You take the evening one on oneYou're only livin' to have funYou want to use me, take me home tonightI'll make you wish that you were mine You're struck by lightningYou're in love It's not worth fightingYou're in love Well turn aroundRemember meI'm the oneWho's out and aimed to please You're in loveYou're in love You make your livin' lovin' hotYou spin me like a topYou take the evening one on one (On one)You're only livin' to have fun You're struck by lightningYou're in love It's not worth fightingYou're in love Well turn aroundRemember meI'm the oneWho's out and aimed to please You're in love (Yeah, yeah, yeah)You're in love Well turn around (Turn around)Remember me (Remember me)Well turn around (Turn around)I'm the oneWho's out and aimed to please You're in loveYou're in loveYou're in loveYou're in loveYou're in loveYou're in loveYou're in loveYou're in love(You take the midnight subway train)You're in love(You're callin' all the shots)You're in love(You take the evening one on one)You're in love(You're only livin' to have fun)You're in love(It's not worth fighting)You're in loveYou're in loveYou're in love  Just to be fair, I never expected genius level writing from them, and their music was always very fun to listen to, so this isn't a commentary on their overall talent as a band. ",
            "date": "Answered May 9, 2019",
            "views": "181",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Saniya",
                    "user_href": "/profile/Saniya-160"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joyce Armstead",
                "href": "/profile/Joyce-Armstead"
            },
            "answer_text": "Billy don’t be a heroDon’t be a food with your lifeBilly don’t be a heroCome back and make me your wife And as he started to goShe said Billy keep your head low-o-oBilly don’t be a heroCome back to me **************And as you probably guessed, Billy got killed. She got a letter from his commanding officer telling her that Billy died a hero. She threw the letter away. Sorry, I couldn’t remember the lyrics for this part but you can be sure they suck. ",
            "date": "Answered May 9, 2019",
            "views": "83",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Connie Phillips Insell",
                    "user_href": "/profile/Connie-Phillips-Insell"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                },
                {
                    "user_id": "Jim Miller",
                    "user_href": "/profile/Jim-Miller-139"
                }
            ]
        }
    ]
}