{
    "title": "What are your favorite punk lyrics? - Quora",
    "tags": [
        "Punk Rock",
        "Song Lyrics",
        "Songs",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Laurence Wilson",
                "href": "/profile/Laurence-Wilson-7"
            },
            "answer_text": "It has to be these ones from Bodies by the Sex Pistols. She was a girl from BirminghamShe just had an abortionShe was a case of insanityHer name was Pauline she lived in a tree She was a no-one who killed her babyShe sent her letters from the countryShe was an animalShe was a bloody disgrace Body I'm not an animalMummy I'm not an abortion Dragged on a table in a factoryIllegitimate place to beIn a packet in a lavatoryDie little baby screaming Body screaming fucking bloody messIt's not an animal it's an abortion Body I'm not an animalBody I'm not an abortion Throbbing squirm, gurgling bloody messI'm not a discharge I'm not a loss inProtein I'm not a throbbing squirm Ah! Fuck this and fuck thatFuck it all and fuck the fucking bratShe don't want to baby that looks like thatI don't want to baby that looks like that. Body I'm not an animalBody I'm not an abortion Mummy! Ugh! ",
            "date": "Answered August 29, 2018",
            "views": "59",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Ryan",
                "href": "/profile/James-Ryan-298"
            },
            "answer_text": "President's bullet ridden body in the streetRide, Johnny, rideKennedy's shattered head hits concreteRide, Johnny, rideJohnny's wife is flounderingJohnny's wife is scaredRun, Jackie, runTexas is an outrage when your husband is deadTexas is an outrage when they pick up his headTexas is the reason that the president's deadYa gotta suck, suck, Jackie, suckPresident's bullet ridden body in the streetRide, Johnny, rideKennedys shattered head hits concreteRide, Johnny, rideTexas is an outrage when your husband is deadTexas is an outrage when they pick up his headTexas is the reason that the president's deadYa gotta suck, suck, Jackie, suckArise Jackie-OJonathan F. Kennedy will rise and be shot downDint's gonna be your desertMy cum'll be your life sourceAnd the only way to get itIs to suckOr fuckOr be poor and devoid, and masturbate meMasterbate me, then slurp it from your palmsLike a dry desert soakin' up the rain, soakin' up the sunLike a dry desert soakin' up the rain, soakin' up the sun -Misfits ",
            "date": "Answered August 27, 2018",
            "views": "106",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ivy Mae",
                    "user_href": "/profile/Ivy-Mae-10"
                },
                {
                    "user_id": "Taylor Hardy",
                    "user_href": "/profile/Taylor-Hardy-31"
                }
            ]
        }
    ]
}