{
    "title": "What are K-pop stans? - Quora",
    "tags": [
        "K-Pop Stars",
        "K-Pop Fans",
        "K-Pop Idols",
        "South Korea"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniele De Rossi",
                "href": "/profile/Daniele-De-Rossi"
            },
            "answer_text": "Q: What are K-pop stans? A K-pop stan is a devoted fan of K-pop. K-pop is Korean pop. Stan is a term for an extremely devoted fan. It was popularised by Eminem. So what exactly does \"stan\" mean, really? According to Urban Dictionary, \"stan\" is a portmanteau of the words \"stalker\" and \"fan,\" and refers to someone who is overly obsessed with a celebrity. Pretty straightforward, right? \"Stan\" is no \"on fleek,\" and for that I am grateful. In addition to being easy to use, \"stan\" comes in handy all the time. A whole new world of (incorrectly) accusing people in my life of being more obsessive than me has opened up: \"Ugh, Mom, you're such a stan for Masterpiece Theater!\" \"Ugh, Dad, stop stanning for Bob Dylan already!\" Ah yes, this slang I like. Where does \"stan\" come from? Well, guys, in this case, you can thank Eminem (bet that's a sentence you never thought you'd hear). In 2000, the rapper released \"Stan\" as the third single off his award-winning album The Marshall Mathers LP. The song, about an obsessive fan named Stan who kills his pregnant girlfriend and then himself after Eminem refuses to answer his letters, topped the charts in Australia and the UK; it didn't do too badly in the U.S., either. Soon after, \"Stan\" began being used to describe people who go above and beyond the average loyalty of most fans. I think my favorite online definition thus far is, \"Basically it describes someone who is all up on their favorite artist's schlong, and can't take criticism or the slightest negative about said artist.\" Makes sense; I definitely know a few stans like this. Oh, and yes, in the official music video, Stan is played by Devon Sawa, aka Casper the Friendly Ghost, aka my first celebrity crush. I'm upset on so many levels by this revelation. So \"stan\" is, like, a bad thing, right? Well, in typical Internet-age form, \"stan\" has gone through so many iterations and usages that it no longer holds the connotation of an abusive, letter-writing creeper, so that's good. Depending on who you're talking to, \"stan\" can have sinister, pathetic, or just obsessive undertones. Similarly, it tends to be used in the same hyperbolic, slightly ironic way that a whole lot of slang is used nowadays. So when I say, for example, that I am a John Mulaney stan, I do not mean that I am sending him locks of my hair. I just think he's the smartest, most talented, handsomest, noodle-y guy ever and would definitely cry if I saw him perform live and I follow his dog Petunia on Instagram like it's really not even a big deal so relax. ...No, seriously, relax; what I'm saying is that people tend to self-identify as stans. It just means that you like something or someone a whole lot. Now leave me alone so I can watch John's standup on YouTube for the next four hours in peace. If \"stan\" originated in 2000, why am I only hearing about it now? I know — I felt the same way when I set out to uncover the secrets of \"stan.\" The foremost reason seems to be that stan has stayed tucked away inside specific fandoms, like K-Pop circles, for years; it's only now beginning to see the light of day in mainstream media (hence why it is so popular on Tumblr). As social media platforms increasingly cross-pollinate, niche slang words like these are blowing up left and right. Source: What The Heck Does \"Stan\" Mean?. ",
            "date": "Answered June 21, 2020",
            "views": "64",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Daniela Kogelnik",
                "href": "/profile/Daniela-Kogelnik"
            },
            "answer_text": "Basically, kpop stans are kpop groups whom you like, kind of like kpop biases, just in groups. If you Stan a group, people usually learn everything they can know about the people in the group. I hope this was helpful. that is all ",
            "date": "Answered June 8, 2020",
            "views": "21",
            "upvotes": " Answer requested by Daniele De Rossi"
        }
    ]
}