{
    "title": "What are some popular songs with nonsensical lyrics? - Quora",
    "tags": [
        "Music Recommendation Lists",
        "Song Lists",
        "Song Lyrics",
        "Music Recommendations",
        "Entertainment",
        "List Question",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Neil Anderson",
                "href": "/profile/Neil-Anderson-30"
            },
            "answer_text": "Don’t Look Back In Anger by Oasis is complete nonsense; even Noel Gallagher admits the words are meaningless. However, play it to a bunch of drunken brits over 30 and they’ll all join in. Slip inside the eye of your mindDon't you know you might findA better place to playYou said that you'd never beenBut all the things that you've seenWill slowly fade away So I start a revolution from my bed'Cause you said the brains I had went to my head.Step outside, summertime's in bloomStand up beside the fireplaceTake that look from off your faceYou ain't ever gonna burn my heart out And so Sally can wait, she knows it's too late as we're walking on byHer soul slides away, but don't look back in anger I heard you say Take me to the place where you goWhere nobody knows if it's night or dayBut please don't put your life in the handsOf a Rock n Roll bandWho'll throw it all away I'm gonna start a revolution from my bed'Cause you said the brains I had went to my headStep outside 'cause summertime's in bloomStand up beside the fireplaceTake that look from off your face'Cause you ain't ever gonna burn my heart out So Sally can wait, she knows it's too late as she's walking on byMy soul slides away, but don't look back in anger I heard you say So Sally can wait, she knows it's too late as we're walking on byHer soul slides away, but don't look back in anger I heard you say So Sally can waitShe knows it's too late as she's walking on byMy soul slides awayBut don't look back in angerDon't look back in angerI heard you say At least not today https://genius.com/Oasis-dont-look-back-in-anger-lyrics ",
            "date": "Answered January 28, 2019",
            "views": "35",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gyan Dissanaike",
                    "user_href": "/profile/Gyan-Dissanaike"
                },
                {
                    "user_id": "John Tearne",
                    "user_href": "/profile/John-Tearne-1"
                },
                {
                    "user_id": "Kartik Lovekar",
                    "user_href": "/profile/Kartik-Lovekar"
                },
                {
                    "user_id": "Ahmad Azhar A H",
                    "user_href": "/profile/Ahmad-Azhar-A-H"
                },
                {
                    "user_id": "Lou Coury",
                    "user_href": "/profile/Lou-Coury"
                },
                {
                    "user_id": "Paul Murray",
                    "user_href": "/profile/Paul-Murray-37"
                },
                {
                    "user_id": "John Smith",
                    "user_href": "/profile/John-Smith-9334"
                },
                {
                    "user_id": "Kelly Erickson",
                    "user_href": "/profile/Kelly-Erickson"
                },
                {
                    "user_id": "James McCallum",
                    "user_href": "/profile/James-McCallum-3"
                },
                {
                    "user_id": "Tara Nitka",
                    "user_href": "/profile/Tara-Nitka"
                }
            ]
        },
        {
            "author_info": {
                "name": "Allaiyah Weyn",
                "href": "/profile/Allaiyah-Weyn-1"
            },
            "answer_text": "1957: A-bop-bop, a-loo-mop, a-lop-bop-bop, tutti frutti, all rootie, tutti frutti, all rootie. 1958: Ooh eeh ooh ah aah, ting tang walla walla bing bang, ooh eeh ooh ah aah, ting tang walla walla bing bang. 1959: Oh Oh oh oh oh oh oh oh ah, shimmy shimmy ko-ko-bop, shimmy shimmy bop. 1962: Yeah-yeah-yeah-yeah, da-do-ron-ron, da do ron-ron-ron, da do ron-ron. 1964: Whoa-oh-oh-oh, oh yeah, do wah diddy diddy dum diddy do. 1967: Goo goo g'joob, goo goo goo g'joob, goo goo g'joob, goo goo goo g'joob, goo, joob, joob, jooba, jooba, jooba, jooba. 1968: Mahna mahna, do doo be-do-do, mahna mahna, do do-do do. 1979: Ramalam ding dong, ramalam ding dong, ramalam ding ding dong, rama lama lama lama-lama ding dong. 1994: Ski-bi dibby dib yo da dub dub, yo da dub dub, ski-bi dibby dib yo da dub dub, yo da dub dub. 1997: Mmmbop, ba duba dop, ba du bop, ba duba dop, ba du bop, ba duba dop, ba du, yeah-e-yeah 1998: Da ba dee da ba daa, da ba dee da ba daa, da ba dee da ba daa. 1998: Tunak tunak tun, tunak tunak tun, tunak tunak tun, da da da. 1999: Wha-been ab ab thin, wha-been ab been thin, wha-been-been been thin, wha-been ab-wha-two-been thin. 2001: Gitchie, gitchie, ya-ya, da-da, gitchie, gitchie, ya-ya, here, mocha chocolata, ya-ya. 2002: Ma-i-a hi, ma-i-a hu, ma-i-a ho, ma-i-a ha-ha. 2002: Aserejé, ja deje tejebe tude jebere, sebiunouba majabi an de bugui an de buididipí. 2006: Chacarron, chacarron, nini nini ron, chacarron, chacarron, nini nini ron. 2009: Ra-ra-ah-ah-ah, roma-roma-ma, gaga, ooh la-la. 2018: Skibidi wap-pa-pa, skibidi wap-pa-pa-pa-pa, skibidi wap-pa-pa-pa-pa-pa-pa-pa-pa, skibidi pa-pa. ",
            "date": "Answered May 11, 2020",
            "views": "14",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dawn Dunphy",
                    "user_href": "/profile/Dawn-Dunphy"
                },
                {
                    "user_id": "Greg Price",
                    "user_href": "/profile/Greg-Price-55"
                },
                {
                    "user_id": "Jim Roland",
                    "user_href": "/profile/Jim-Roland-4"
                },
                {
                    "user_id": "John Bateman",
                    "user_href": "/profile/John-Bateman-28"
                },
                {
                    "user_id": "Fareehah Young",
                    "user_href": "/profile/Fareehah-Young"
                }
            ]
        }
    ]
}