{
    "title": "What are examples of poems with lots of figurative language? - Quora",
    "tags": [
        "Figurative Language",
        "Poems",
        "Poetry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Chandos",
                "href": "/profile/Mark-Chandos"
            },
            "answer_text": "Example of the poet using rich figurative speech. Testing the theory that time is altered when we move at the speed of light. Aaron proposes an experiment where a camera fixes on a bright beam moving at the speed of light. This speeding beam of light contains a film of the lovers, thus freezing them in static erotic embrace, slowing time. The lovers thereby escape the decay of Eros and death itself. Yet the poet is cautious; he has made allowance for the singularity of the human emotional component.) i A. If two arrest a path of light embalmed my flash-encrusted breath – but fixed, as captive play resides in camera, - then fix my sleep at that beam all-speeding from glow emitting north, holding my eye abreast a lover’s shard of light. - There, delayed, with highest long-limbed rocketry, preserve us fresh as child, still moist and humid spouse. Our fevered bones releasing light: - our willing jointure braise a narrow optic sun, where crimson-cheeked escapers sooth appeased mortal-timed regression; two spheres of breath scouting past uncharted black-holed death. ii Yet, if - annulled of human pulse, no single-celled, no carbon stitch, survive – if faithless the device, no proof of human mass within, - then speak, returning shades stone-gray at dawn: leaching blood, broad element of high embracers – turn – your prints have left a trace. - Tell. If feet of time and love hold hands; if consciousness a condition and not a place: if desire amends to tarnished lead – cry, cry, cry - where any brittle fraction part the lip, the valves and sluices washed with spoil. I know, I know, I know. Emotion spent, once dry of marrow, - no material photon of elemental stew, no wish retrieved from couple’s wintered thaw, no reproductive kiss escap - Eros’ black-holed maw. iii So, resolved, as saints, by lovers’ fortunes’ cast, - esoteric math retains no lovers’ mass. Science collide its lost photon; laughing poets compress all kiss. New-prized inflection alters - lover’s thought – as verbal pulse – visual charged ions double-loaded with component, all thought extinguished: song, alone, cries - octaves outside of proofs. I learn. I learn. I learn. Mnemonic, let desire retain its moment’s life. Let the learned poet delight the breath. - My second sweat condense the juice loving bark, my text of human warmth on ageing cheek; my new-braise tongue all first tongues seek, my song-recovered ark my numbered kiss close-fit – my moving breath on walls, my prophetic king, my fire-blistered lips, now charred and fixed, - now smoke and rising steam. From …..Kosmoautikon.com ",
            "date": "Answered July 16, 2019",
            "views": "26",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Preston Simmons",
                    "user_href": "/profile/Preston-Simmons-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sharon Somerfeld",
                "href": "/profile/Sharon-Somerfeld"
            },
            "answer_text": "The essence of poetry is figurative language. Poetry does not necessarily rhyme, and much great writing that is considered prose verges on becoming poetry, in part due to the complex symbolic imagery it contains. That said, Keats imbues his poetry with some of the richest figurative language in English. His “Ode on a Grecian Urn” is justly famous for the magical imagery through which he gives eternally fleeting life to an ancient artifact, which then becomes a metaphor for mankind’s search for beauty and truth. ",
            "date": "Answered August 9, 2016",
            "views": "74",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Robert Hamill",
                    "user_href": "/profile/Robert-Hamill-3"
                }
            ]
        }
    ]
}