{
    "title": "What is the best free software for creating songs? - Quora",
    "tags": [
        "Remix",
        "Music Recording",
        "Music Production",
        "Music Industry",
        "Musicians",
        "Songs",
        "Software and Applications"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dan Tash",
                "href": "/profile/Dan-Tash-2"
            },
            "answer_text": "Recently, there have been more and more high-quality DAWs (Digital Audio Workstations) that have become available for free. Let me explain in a bit more detail. ** Most Powerful, Free DAWs **  Cakewalk by BandLab This is essentially a rebranded version of SONAR, a very powerful DAW that used to cost $600 and was jam-packed with professional features.This is literally one of the most powerful, free DAWs available today!Cons: Only available on Windows. If you use another operating system like Mac or Linux, you’re out of luck unless you run them on a Virtual Machine. It’s possible to create a virtual machine on Mac/Linux and install Windows, from where you can run Cakewalk. We won’t get into this here, but that’s a possible solution.** Free Compact Versions of Paid DAWs **  While Cakewalk remains my top pick for the best, free music making software, there are a few others. Some of the most popular (and expensive) DAWs out there have compact, ‘Lite’ versions of the software with fewer features. Although you can still make some awesome music in these, you won’t have the same capabilities as someone who’s using the paid version of the software. Here they are: Ableton Live LiteCubase LEPreSonus Studio One PrimeGaragebandPro Tools First** Free Highly Recognized DAWs **  And finally, the ones we all know about: AudacityIt works for Mac OS X, and it works for Window. To top it off, it works on Linux too! Audacity has been around for a while, and honestly, you can’t go wrong if you start with this DAW.Hope this answer helped you out — get out there and download the software of your choice! Remember, the hardest part is actually producing music; the tools should be secondary and under your control. You should never let the DAW you use dictate your capabilities. Good luck! ",
            "date": "Answered September 16, 2018",
            "views": "4",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Deafboy Team",
                    "user_href": "/profile/Deafboy-Team"
                },
                {
                    "user_id": "Chesca",
                    "user_href": "/profile/Chesca-7"
                },
                {
                    "user_id": "Mohith D",
                    "user_href": "/profile/Mohith-D-14"
                },
                {
                    "user_id": "Vignesh",
                    "user_href": "/profile/Vignesh-1027"
                },
                {
                    "user_id": "Louis Gil",
                    "user_href": "/profile/Louis-Gil-2"
                },
                {
                    "user_id": "Amudan Maney",
                    "user_href": "/profile/Amudan-Maney"
                },
                {
                    "user_id": "Robert Zalinsky",
                    "user_href": "/profile/Robert-Zalinsky"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Smith",
                "href": "/profile/Peter-Smith-1404"
            },
            "answer_text": "Ableton Live Since its introduction in 1999, Ableton Live has been steadily growing as a very popular DAW and for good reason. We know we’ve gotten scrutiny for listing it first, and everybody is entitled to their opinions. However, we feel this is the best digital audio workstation for most of our readers. Here’s why (and just a few reasons, considering it would take days to explain the power of this) — you’ve got the standard multi-track recording (an unlimited number of audio/MIDI tracks for songs) and cut/paste/splice features, but what’s especially great about this software is the seamless MIDI sequencing software and hardware. We’ve had so many fusses with our MIDI controllers getting mapped to our sounds through the DAW (back when we used Acid Pro in 2005-2010), but ever since the switch to Ableton it’s been extremely headache-free. Another huge plus is the included sound packages included. Although this really depends on your preferences and whether or not you have your gear and sounds up to speed, it comes with 23 sound libraries (about 50 GB of sounds), so you can make music right out-of-the-box (great for starters) and sell on e commerce websites. Propellerhead Reason Reason by Propellerhead is slightly less known in the music software community but is one of the most stable as far as we’ve learned. Pretty nifty since you can drag and drop among the interface (such as synth patches and effects straight into the sequencer), has a relatively fast system as many have stated, and most importantly, the workflow is exceptional for those within the middle to the semi-pro range. It’s not too complex but not that simple either — in our opinion right in the middle. However, I’ve heard that some of the plug-ins offered by Reason is a bit out-of-date as compared to other DAWs like Fruity Loops ",
            "date": "Answered May 20, 2019",
            "views": "401",
            "upvotes": "0"
        }
    ]
}