{
    "title": "What is the meaning of the song 'Hurdy Gurdy Man'? - Quora",
    "tags": [
        "Hurdy-Gurdy",
        "Song Meanings",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark L. Levinson",
                "href": "/profile/Mark-L-Levinson"
            },
            "answer_text": "Although more than one kind of instrument is popularly known as a hurdy-gurdy, Wikipedia tells us that \"The hurdy gurdy or hurdy-gurdy is a stringed instrument that produces sound by a crank-turned, rosined wheel rubbing against the strings.\"  The sound is the kind of drone you hear on Donovan's recording.   For Donovan, to be \"by the sea, gazing with tranquility\" is to feel pleasantly at home with himself.  The water was important to him as a child, and his rapid burst of creativity grew out of a season in a seaside town. Donovan himself claims in his autobiography to have a political purpose behind his oeuvre.  His father wanted to change the world by directly fomenting political action, but Donovan believed he could change political attitudes with his songs.  The hurdy-gurdy man singing songs of love is a sort of role model, the benign cultural leader.  More than once, Donovan has used the song as a kind of salute, with specific lyrics such as \"a Beatle is a hurdy-gurdy man.\"  In addition, Donovan has embraced a verse written by George Harrison: When truth gets buried deepBeneath a thousand years of sleepTime demands a turn aroundAnd once again the truth is found ",
            "date": "Answered December 9, 2014",
            "views": "363",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gopi Krishnan",
                    "user_href": "/profile/Gopi-Krishnan-205"
                },
                {
                    "user_id": "Jamie Ritter LeBlanc",
                    "user_href": "/profile/Jamie-Ritter-LeBlanc"
                },
                {
                    "user_id": "Nori Fanto",
                    "user_href": "/profile/Nori-Fanto"
                },
                {
                    "user_id": "Mark Groen",
                    "user_href": "/profile/Mark-Groen"
                },
                {
                    "user_id": "Aditya Panda",
                    "user_href": "/profile/Aditya-Panda-63"
                },
                {
                    "user_id": "John Caporaso",
                    "user_href": "/profile/John-Caporaso-1"
                },
                {
                    "user_id": "Izzy Bauer",
                    "user_href": "/profile/Izzy-Bauer"
                },
                {
                    "user_id": "Cherrie Shupp",
                    "user_href": "/profile/Cherrie-Shupp"
                },
                {
                    "user_id": "Dann LaGratta",
                    "user_href": "/profile/Dann-LaGratta"
                },
                {
                    "user_id": "Homayoun",
                    "user_href": "/profile/Homayoun-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Randall Peede",
                "href": "/profile/Randall-Peede"
            },
            "answer_text": "I will start by assuming that you've already looked up this answer on the web. In the bad old days, when dinosaurs roamed the earth and I was a child, I seem to recall hearing several types of street performers. These people were hold-overs from pre-vaudeville and didn't have enough of an act to actually work vaudeville.There were organ-grinders who were sometimes known to have a monkey on a leash with a cup who would go into the assembled listeners. When you placed a coin into the cup, the monkey would lift it's hat as a thank you gesture. I'm sure that you can find an old black and white movie depiction.The hurdy-gurdy man's instrument had a greater range of music that he could play and sounds that his instrument could make.In post-colonial times, there were lamp-lighters and town criers. A town crier might walk through the town and let the people know that it was OK to relax. The standard phrase might be \"eight o'clock and all is well\". This was before radio, and printed material was not exactly rare, but not yet printed as daily news.The practice of street performances and town criers was intended as a comfort to the populace.Donovan's dream seems to recall the roly-poly, hurdy-gurdy man as a symbol of on-going comfort and safety. ",
            "date": "Answered May 4, 2016",
            "views": "322",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/ShadeRunner"
                },
                {
                    "user_id": "Aslak Kuldvere",
                    "user_href": "/profile/Aslak-Kuldvere"
                },
                {
                    "user_id": "Ed Bolf",
                    "user_href": "/profile/Ed-Bolf"
                },
                {
                    "user_id": "Stina Orsenmark",
                    "user_href": "/profile/Stina-Orsenmark"
                },
                {
                    "user_id": "Kush Srivastava",
                    "user_href": "/profile/Kush-Srivastava-19"
                },
                {
                    "user_id": "Deanna Crownover",
                    "user_href": "/profile/Deanna-Crownover"
                },
                {
                    "user_id": "Julian Grodzicky",
                    "user_href": "/profile/Julian-Grodzicky"
                },
                {
                    "user_id": "Darwin Minnis",
                    "user_href": "/profile/Darwin-Minnis"
                },
                {
                    "user_id": "Susan Burg",
                    "user_href": "/profile/Susan-Burg"
                },
                {
                    "user_id": "Lori McCabe",
                    "user_href": "/profile/Lori-McCabe-1"
                }
            ]
        }
    ]
}