{
    "title": "What is the best birthday song in Tamil? - Quora",
    "tags": [
        "Birthday Gifts",
        "Tamil (language)",
        "Birthdays",
        "Gifts"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lavanya Rajasekaran",
                "href": "/profile/Lavanya-Rajasekaran-3"
            },
            "answer_text": "ஏன் என்றால், உன் பிறந்தநாள்.உலக பூக்களின் வாசம், உனக்கு சிறைபிடிப்பேன்,உலர்ந்த மேகத்தை கொண்டு நிலாவின் தரை துடைப்பேன். ஏன் என்றால் உன் பிறந்த நாள்,ஏன் என்றால் உன் பிறந்த நாள். கிளை ஒன்றில் மேடை அமைத்து,ஒளி வாங்கி கையில் கொடுத்து,பறவைகளை பாட செய்வேன்,இலை எல்லாம் கைகள் கட்ட,அதில் மெல்லும் பறவை ஒன்றை nகாதில் கூவ செய்வேன். உன் அறையில் கூடு கட்டிட கட்டளை இடுவேன்.அதிகாலை உன்னை எழுப்பிட உத்தரவிடுவேன். ஏன் என்றால் உன் பிறந்த நாள்,ஏன் என்றால் உன் பிறந்த நாள். மலையூச்சி எட்டி, பணி கட்டி வெட்டி,உன் குளியல் தொட்டியில் கொட்டி சூரியனை வடிகட்டி.பனியெல்லாம் முறுக்கிடுவேன், உன்னை அதில் குளிக்கத்தான். இடம் பார்த்து இறக்கிடுவேன், எ எஹே எஆஹ்.கண் இல்ல கண்மீன்கள் பிடித்து, ஓஹோ ஓஹோஉன்னோடு நான் நீந்த விடுவேன். பனி குழித்து முடித்து துவட்டததான்.என் காதல் மதித்து தந்திடுவேன். ஏன் என்றால் உன் பிறந்த நாள்,ஏன் என்றால் உன் பிறந்த நாள். நெஞ்சத்தை வெதுபகம் ஆகி, அணைச்சசல் செய்திடுவேன்.மெழுகு பூக்களின் மேலே,என் காதல் எஅதிரிடுவேன்.பனி ஊதினால் ஆணையதடி. பனி வெட்டவே முடியாதடி. உன் கண்களை பனி ஊதடி.என்ன வேண்டுமோ அதை கேளடி. என் என்றால் உன் பிறந்த நாள்,யென் என்றால் உன் பிறந்த நாள். ஓஹோ ஓஹோ... _______________________________________________தேவதை வம்சம் நீயோ தேணிலா அம்சம் நீயோபூமிக்கு ஊர்வலம் வந்தவானவில் நீயோபூக்களின் வாசம் நீயோபூங்குயில் பாஷை நீயோசூரியன் போனதும் அங்கேவருவதும் நீயோ நட்சத்திர புள்ளி வானம் எங்கும் வைத்துநிலவுன்னை கோலம் போட அழைத்திடும்நீ இருக்கும் இடம் வேடந்தாங்கல் என்றுபறவைகள் மனதுக்குள் மகிழ்ந்திடும்என்னோடு நீயும் ஓட முகில்கள் ஊஞ்சல் போடும்உலவும் தென்றல் வந்து உன் ஊஞ்சலை அசைதே போகும்பகலினில் முழுவதும் வெயிலினிலேஉனை சுட்டு வருத்திய வானம் அதுஇரவினில் முழுவதும் அதை எண்ணியேபனித்துளி சிந்திய அழுகிறது(தேவதை வம்சம்..) வாழ்வின் திசை மாறும் பாதைகளும் மாறும்நட்பு அது மாற்றம் இன்றி தொடருமேசொந்தம் நூறு வரும் வந்து வந்து போகும்என்றும் உந்தன் நட்பு மட்டும் வேண்டுமேஉன் பாதம் போகும் பாதை மண்ணுக்கு சந்தோஷங்கள்உன்னோடு ஓர் ஓர் நிமிஷம் உயிருக்கு ஆனந்தங்கள்பூக்கள் எல்லாம் உன்னை தொட தவமிருக்கும்நீயும் தொட சருகுக்கு உயிர் பிறக்கும்வானவில்லும் வந்துனக்கு குடை பிடிக்கும்எங்களுக்கும் அதற்குள்ளே இடம் இருக்கும்(தேவதை வம்சம்..) ",
            "date": "Updated September 16, 2016",
            "views": "247",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sudhanthira",
                    "user_href": "/profile/Sudhanthira"
                },
                {
                    "user_id": "Vignesh Vittal",
                    "user_href": "/profile/Vignesh-Vittal"
                },
                {
                    "user_id": "Sadam Hussain",
                    "user_href": "/profile/Sadam-Hussain-6"
                },
                {
                    "user_id": "Karthick",
                    "user_href": "/profile/Karthick-175"
                },
                {
                    "user_id": "Kousalya Mariappan",
                    "user_href": "/profile/Kousalya-Mariappan-1"
                },
                {
                    "user_id": "Raghuram Prabhu",
                    "user_href": "/profile/Raghuram-Prabhu-2"
                },
                {
                    "user_id": "Rathna Kannan",
                    "user_href": "/profile/Rathna-Kannan"
                },
                {
                    "user_id": "Kannan",
                    "user_href": "/profile/Kannan-120"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nambirajan Confi",
                "href": "/profile/Nambirajan-Confi"
            },
            "answer_text": "Overall best birthday song in Tamil :  From Daddy to his baby boy:  Appan Mavane vaada - Poda Podi From Mom to her Baby girl:  Chithira Chittukkal - Bommukutty Ammaavukku From Dad to his Baby girl:  Va va En Devathaiye - Abiyum Naanum From Son to his mom:  Neeye Neeye - M.Kumaran S/O Mahalakshmi For his Girlfriend:  Azhage Indrun Pirandha Naal, Un Kangal Kandu Mei Marandha Naal For Boyfriend :  Senthoora - Bogan (Not a BD song. Still, A girl can dedicate this one for his BD) ",
            "date": "Answered June 10, 2018",
            "views": "361",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Annush Sairaj",
                    "user_href": "/profile/Annush-Sairaj"
                },
                {
                    "user_id": "Ramesh Tvl",
                    "user_href": "/profile/Ramesh-Tvl"
                },
                {
                    "user_id": "Dharshini Pazhanivel",
                    "user_href": "/profile/Dharshini-Pazhanivel"
                }
            ]
        }
    ]
}