{
    "title": "What are the best ROBLOX mini games? - Quora",
    "tags": [
        "Adult Games",
        "ROBLOX (online game)",
        "Games"
    ],
    "response": [
        {
            "author_info": {
                "name": "Atharv",
                "href": "/profile/Atharv-25"
            },
            "answer_text": " NATURAL DISASTER SURVIVAL Natural Disaster Survival has a hint of PlayerUnknown’s Battlegrounds to it. Get ready to desperately cower for dear life against the elements in whatever shelter you can find. That’s how we play PUBG, anyway. You might not be fighting each other in this Roblox game, but, you will be trying to grab cover from various natural disasters explicitly designed to kill you dead. In our first round, we had to scamper to the top of a glass tower to escape a flash flood. Then, during another round in the same map, we shot up to the top again, only to find that an earthquake necessitated our distance from all tall buildings. Cue our avatar’s disintegration into many, many pieces.  SCUBA DIVING AT QUILL LAKE If our mums saw us playing this little gem when we were younger, they might beg a little less for us to get real jobs. Scuba Diving at Quill Lake is everything Doom 2016 wasn’t: relaxing, wholesome, and chilled out. Being transported to this picturesque lake feels like a half-decent holiday as you rapaciously scour the seabed for treasure. You won’t be able to access everything immediately, however: dingy caves need a flashlight and deeper, more open water will require extra training and better gear. Amassing underwater cash and collectables to sell and upgrade your avatar keeps you exploring wider and farther. And, since this is a Roblox game, the MMO aspect of the platform gives you a ready-made team to mutually share tips and support. We did say it was wholesome.  THEME PARK TYCOON 2 Many Roblox games are ‘Tycoon’ sims, but Theme Park Tycoon 2 is one of the best. After a short, simple tutorial you get your sizeable slab of land with which to create your own attempt at Disneyland. The user interface is streamlined and has a good choice of options, but not too many as to be overwhelming. Predictably, the aim is to create a theme park that pleases your attendees as their numbers swell and, by extension, your budget. There’s attention to detail here: you’ve got to make sure you have enough bins and other amenities to keep your guests happy and your park spick and span. If you renege on your sanitary obligations then prepare for a lot of rubbish to cover the floor. It’s not all fun and rollercoasters being a theme park designer after all. The leaderboards common to all Roblox games encourage some light competition to keep you going. With your online rivals’ money and guest tallies constantly haunting the corner of your screen, you’ll be driven to keep you chasing the theme park of your dreams. You might not be able to create the wacky parks you can find in games like Planet Coaster, but Theme Park Tycoon is a Roblox game that’s worth your time.  WORK AT A PIZZA PLACE If working for a pizza company was this much fun we’d dump our desktops for our nearest branch of Pizza Hut in a flash. Work at a Pizza Place is a Roblox game that invites you to join Builder Brothers’ Pizza to live out your understandable dream of a being a cashier, cook, boxer (not that kind), and the delivery mule. Playing around with the first three jobs is amusing enough, but you’ll have the most fun as a rude cashier, chuckling at the humorously-written indignance of your customers. Once you’re done annoying the pizza-loving populace you can test out the surprisingly sound driving mechanics by delivering customer’s orders to their door, a few houses down from your own property. Which brings us to the other half of Work at a Pizza Place: not working at a pizza place. Like The Sims, outside of working hours, you use your hard-earned wages to spruce up your house. Track down a certain portal, however, and you’re teleported to ‘Party Island’, a parallel environment where you can let your grease-stained hair down to Justin Bieber’s ‘Despacito’ and other songs. Who knew pizza workers had it so good?  MURDER MYSTERY 2 This Roblox game is a very addictive arena battler with a murder mystery twist. After players have voted on which of a variety of imaginatively designed and nuanced maps they’d like to play on, they’re given one of three roles: innocent, sheriff, and murderer. The murderer and sheriff are the only armed characters, but, at the beginning of each round, both classes start with their weapons holstered and just as anonymous as the innocents. They, therefore, choose when to make their move, and a thrilling level of strategy ensues as you desperately study and suspect each member of the group to see who’s looking the shiftiest. As you’d expect, it’s up to the sheriff to protect the innocents from their unknown assailant, and they’ll get bonus points for each innocent they save. Chances are you’ll be one of this unfortunate number; the only class without any weaponry, innocents are forced to flee. It’s simple but well-balanced. The murderer has a knife rather than a gun to prevent them from being overpowered when a scrap breaks out, which creates seriously frenetic fun. As rounds will only take a couple of minutes at most, the just-one-more-go appeal of Murder Mystery 2 can be quite the timesink.  JAILBREAK Jailbreak is as close as Roblox games are going to get to Grand Theft Auto V. You start by picking one of two roles: Police Officer or Criminal. If you pick the latter, you’ll be living out your Michael Schofield dream as you make your escape from Her Majesty’s Pleasure. Or you could spend the remainder of your days in the cafeteria and jumping on the trampolines in the yard, which is also fun. To escape, you’ll need a keycard which, predictably, your cop captors would rather you didn’t have. Anyone familiar with Fallout and The Elder Scrolls V: Skyrim will be familiar with how the pickpocketing mechanic works in this Roblox game. Meanwhile, as a policeman, you’ll be armed with a pistol, taser, and a set of cuffs to foil the attempts of your restive prisoners. However, if they do escape, the game explodes in scale to become an open world. At which point a massive game of hide-and-seek ensues for the most persistent of police pursuers. Despite Jailbreak still only being in beta, this a very strong Roblox game, with plenty more updates in the pipeline.  SUPER BOMB SURVIVAL!! Rarely do we play games in which the pre-game lobby is about as much fun as the actual game. But we’ll get onto that in a moment. Like Natural Disaster Survival, you’ll need to evade various physics-based threats spilling from the heavens if you fancy remaining in one piece in Super Bomb Survival!!. Airborne threats come in many guises; from dynamite that explodes on a timer to spreading fires. Bombsites then reveal the verticality and destructibility of each environment – explosions leave permanent structural damage that constantly shifts throughout each two-and-a-half minute round. The real thrill of this Roblox game emerges as you scramble to find a new escape route after having just evaded another hazard through the skin of your teeth. As previously mentioned, falling prey to a bomb isn’t the end of the world (so to speak) either. Instead, you’re teleported to the spectator area surrounding the chaos to watch the remaining survivors in their desperate efforts. And if that’s not exciting enough, the spectator area is the lobbying equivalent of PlayZone: there are piano keys to jump on, cannons to fire yourself from, and even a football to kick around.  SPEED RUN 4 Speed Run 4 is a classic quick-fire platformer that’s perfect to play in short, lunchtime bursts. Once you cross the start line, you’re automatically placed in sprint mode and your goal is to, unsurprisingly, race through each of the 31 levels as quickly as possible. It’s simple, yes, but the level design is as eclectic as the soundtrack. One map might have you drifting across bright purple platforms to psychedelic trance, while the next might be plain white with, er, Coldplay’s Speed of Sound as your backing track – because why not? Don’t let this put you off, however: as is true with many Roblox games, Speed Run 4 comes into its own with friends. Storming through each level on your lonesome is fun enough, but racing against your fellow Roblox pals adds another dimension to this fast-paced platformer.  HIDE AND SEEK EXTREME Hide-and-seek is a rite of passage for all schoolchildren. But, where once we risked rain, stinging nettles, and more than our fair share of scraped knees, now we can enjoy the thrill of the finest playground game of them all from our desktop with Hiding and Seek Extreme. In case you’re stuck in perennial detention and aren’t aware of the premise – firstly, you should think about making a change – one player is randomly selected as ‘It’ and has to find their chums after they’ve been given a short time to hide in the game’s imaginatively designed maps. ",
            "date": "Answered February 7, 2019",
            "views": "25",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aarav Gupta",
                    "user_href": "/profile/Aarav-Gupta-173"
                },
                {
                    "user_id": "Shaswat Dash",
                    "user_href": "/profile/Shaswat-Dash-6"
                },
                {
                    "user_id": "Eli Kranz",
                    "user_href": "/profile/Eli-Kranz-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lucas Sennett",
                "href": "/profile/Lucas-Sennett"
            },
            "answer_text": "If you’re looking for Minigames, there are multiple games such as Epic Minigames or Ripull Minigames where it takes you into a ton of different small, short games where people have to work as a team or fend off other people on their own. As for games in roblox, some of my favorites are Icebreaker!, Epic Minigames (as stated above), Natural Disaster Survival, Survivor, Roblox High School 2, and Roblox Dodgeball. Hope this helps! ",
            "date": "Answered July 27, 2019",
            "views": "979",
            "upvotes": "0"
        }
    ]
}