{
    "title": "What are the world's best power ballads? - Quora",
    "tags": [
        "Power Ballads",
        "Ballads",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Audun Bie",
                "href": "/profile/Audun-Bie"
            },
            "answer_text": "I see a lot of fancy hairstyles and half-assed attempts at delivering raw passion, but missing is the entire trinity of all-out-tremble-with-ecstasy-and-holy-dread power ballads. The following order implies nothing about their respective quality, as they are all fully perfect. First, I'm going to ignore that this one strictly has been mentioned, because what a travesty it is to post the song with the greatest music video ever made without actually including said video. One third of our holy trinity is, of course, Whitesnake's Is This Love? (And may I add: yes, yes it is!):  Now that you have listened to and watched that video six or seven times and your heart rate may or may not have been normalised, let us proceed to the second third. I have to acknowledge the presence in the other answers here of Bonnie Tyler's Total Eclipse of the Heart, which is an honest attempt and pretty close. But Total Eclipse... was one of a pair of songs, and cruel faith has determined that the best, most shamelessly unhinged and awe-inspiring of those has disappeared into relative obscurity. I'm talking, obviously, of Air Supply's Making Love out of Nothing at All:  And then, finally, I have to protest the implication that power ballads must be performed by fluffy-haired eighties heroes. I get that in terms of production, the last selection is a bit of an outlier, but what it lacks in overdubbing and massive snares, it more than makes up for with the rawest, most ambitious delivery in the history of music. Chillun', they don't call him The King for nut'n'. Last, but not by any measure least, Elvis Presley's immaculate 'Viva Las Vegas' recording of You've Lost that Loving Feeling (and it's a damn shame if you haven't found it by the end of this song). You might think this is a song that is supposed to build up for a while—an honest mistake many talented performers have made. But Elvis knew that the only solution was to go full-on ape-brain crazy already from the first chorus.  I feel honourable mention should be made of a-Ha, Chicago, Elton John, and a host of others, but let's keep it at 66 % curly hair for now. Actually, 75 %.  Outside of Norway, Ylvis is mostly known for their purposefully godawful 'The Fox', but they have also written this sublime tribute to one of our greatest heroes. You don't have to know who Jan Egeland is, he's exactly as portrayed in this video:  ",
            "date": "Updated January 23, 2015",
            "views": "1",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pavel Fomitchov",
                    "user_href": "/profile/Pavel-Fomitchov"
                },
                {
                    "user_id": "Leigh Quimbo",
                    "user_href": "/profile/Leigh-Quimbo"
                },
                {
                    "user_id": "Piyush Patil",
                    "user_href": "/profile/Piyush-Patil-19"
                },
                {
                    "user_id": "Melissa Hoy",
                    "user_href": "/profile/Melissa-Hoy-2"
                },
                {
                    "user_id": "Lisa Groeneweg",
                    "user_href": "/profile/Lisa-Groeneweg"
                },
                {
                    "user_id": "Kyle Murao",
                    "user_href": "/profile/Kyle-Murao"
                },
                {
                    "user_id": "Bianca N. Diesel",
                    "user_href": "/profile/Bianca-N-Diesel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Binfield",
                "href": "/profile/Mark-Binfield"
            },
            "answer_text": "Oh dear... I'm woefully unqualified to answer this.  Not only am I not clear on what counts as a power ballad, but based on other peoples' nominations here and various lists I found elsewhere on the internet, most of the classic power ballads are songs I don't know.  Of all the periods in the history of rock, I'm probably least familiar with the early 80s.   But since I was asked to answer (thanks Kyle...), I'll throw in my two cents by nominating a few songs that meet two criteria:a) I like them, andb) they seem vaguely similar to other songs people consider power ballads. I make no claim that a music critic would consider all of these to be power ballads, or that these are in any way the best power ballads out there.  But if you like power ballads... maybe you'd like these?  Or more likely you'll just wish you could throw tomatoes at me.  Which you can't, because this is the internet, which means I can safely nominate... Green Day: Boulevard of Broken Dreams   I like Green Day.  There, I said it.  Boulevard of Broken Dreams clearly qualifies as a power ballad: it's a band known for being loud and stupid writing a song that's slower and more contemplative, but still has enough rock that it isn't just a ballad.  I love the feel of the song.  Honorable mention goes to Good Riddance (Time of Your Life) and Wake Me When September Ends. Something Corporate: I Woke Up In A Car   I sort of doubt this song is usually labeled a power ballad, but I see similarities, at least in the fact that it mixes heavy rock with very lyrical sections and wistful lyrics.  I like Something Corporate and this is my favorite of their songs. Pink Floyd: Comfortably Numb  I covered this with my band last year, and while I was never satisfied with our version, I gained a strong appreciation for how great this song is.  I found it on at least one list of power ballads, so I guess it counts... Metallica: Nothing Else Matters   Look, it's a question about power ballads.  Ask me about the most awesome metal bands, and I can start talking about Lacuna Coil or Odd Project or Black Sabbath or Nightwish or the granddaddy of them all, Iron Butterfly.  But if you're going to ask about power ballads, then yeah, you get Metallica. ",
            "date": "Answered January 22, 2015",
            "views": "558",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ameen Abou-Rjaily",
                    "user_href": "/profile/Ameen-Abou-Rjaily"
                },
                {
                    "user_id": "Veronica Seo",
                    "user_href": "/profile/Veronica-Seo-1"
                },
                {
                    "user_id": "Melissa Hoy",
                    "user_href": "/profile/Melissa-Hoy-2"
                },
                {
                    "user_id": "Lisa Groeneweg",
                    "user_href": "/profile/Lisa-Groeneweg"
                },
                {
                    "user_id": "Kyle Murao",
                    "user_href": "/profile/Kyle-Murao"
                }
            ]
        }
    ]
}