{
    "title": "What do singers do if they forget the lyrics on stage? - Quora",
    "tags": [
        "Singers",
        "Song Lyrics",
        "Singing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christl Meff",
                "href": "/profile/Christl-Meff"
            },
            "answer_text": "One way to deal with this is to simply sing some gibberish. Anthony Kidies of the Red Hot Chili Peppers did it quite a few times, here’s an example:  Another way to deal with it, is just to repeat the lyrics of a previous/upcoming verse. And last but not least, you just sing something like “oh I just forgot the lyrics to my own damn song, on stage, how embarrising is that? Why do we even practice, what is the meaning of life anyway”. This obviously wouldn’t work on a sad, deep, ballad-like song, but will probably be even well received in an uplifting song. The most important thing is to stay cool and the crowd will always go with it, if they even notice. It’s no big deal. One last way to deal with it just came to my mind: if it’s the beginning of the song, you could just say something like “no no no no, stop it, this doesn’t work, I forgot the lyrics” until the band stops (and everybody laughs) and restart the song or just play the next song, since you’ll probably remember the lyrics a few minutes later. If you praticed and it’s just a blackout, of course. If you didn’t rehearse, then there’s probably nothing to you can do… ",
            "date": "Answered January 26, 2018",
            "views": "23",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Franklin Bryant",
                    "user_href": "/profile/Franklin-Bryant-1"
                },
                {
                    "user_id": "Reyhan Ramzy Respati",
                    "user_href": "/profile/Reyhan-Ramzy-Respati"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard E. Davies",
                "href": "/profile/Richard-E-Davies"
            },
            "answer_text": "I read that Barbra Streisand, in her comeback concerts, uses a monitor for the words. She’s not really a touring singer. She did it for a few concerts because she didn’t have confidence in her ability to remember under the pressure of a live performance. One axiom is Amateurs practice until they get it right. Professionals practice till they can’t get it wrong. That’s not a great consolation. If you lose your concentration because of some unusual event happening while you are on stage it is possible for even the most professional to go blank or lose their place. I can recall that experience on stage a couple of times. Once I repeated the first verse (after all it was a great verse). Most people never know unless they are very familiar with the song. If you are innovative you can do just about anything like launch into a story that the song reminds you of. Or while you direct the band to keep going you can do a analysis of what the words mean. ",
            "date": "Answered March 24, 2019",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Reyhan Ramzy Respati",
                    "user_href": "/profile/Reyhan-Ramzy-Respati"
                },
                {
                    "user_id": "Nazanin Shayesteh",
                    "user_href": "/profile/Nazanin-Shayesteh"
                }
            ]
        }
    ]
}