{
    "title": "What second instrument should I play if I already play the trumpet? Also, I don’t want to play a brass, low brass instrument, or percussion. - Quora",
    "tags": [
        "Learning to Play Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jaden Sumakud",
                "href": "/profile/Jaden-Sumakud"
            },
            "answer_text": "This question has a very broad answer. I wouldn’t recommend a string instrument because the transition would be difficult, as string instruments use different terminology than aerophone instruments. So I would recommend a woodwind instrument, but probably not one of the low instruments. So that leaves us with piccolo, flute, oboe, clarinet, and the saxophone family. Now this is all personal preference. Oboe, clarinet, and the saxophones are all very high-maintenance instruments, so if you can handle it, go for it. Flute and piccolo, on the other hand, are very easy to handle, yet playing piccolo before flute is not a good idea. So if it were my choice, I would choose to play the flute. ",
            "date": "Answered April 5, 2018",
            "views": "316",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jacob Rammens",
                    "user_href": "/profile/Jacob-Rammens"
                },
                {
                    "user_id": "Ryan Burnette",
                    "user_href": "/profile/Ryan-Burnette"
                },
                {
                    "user_id": "Will Simpson",
                    "user_href": "/profile/Will-Simpson-33"
                }
            ]
        },
        {
            "author_info": {
                "name": "Juanita Proffitt",
                "href": "/profile/Juanita-Proffitt"
            },
            "answer_text": "Depending on your goals, the piano or keyboard might be a logical choice. If you plan to pursue a musical career, piano skills are always a plus. In addition, the piano would not cause embouchure issues which might affect your trumpet playing. ",
            "date": "Answered April 8, 2018",
            "views": "96",
            "upvotes": "0"
        }
    ]
}