{
    "title": "What DAW is the best to use for creating mixtapes? - Quora",
    "tags": [
        "Mixtapes",
        "Music Production Software and Apps",
        "Digital Audio Workstations",
        "Digital Audio",
        "Music Production",
        "Hip Hop Music",
        "Music Industry",
        "Songs",
        "Software and Applications"
    ],
    "response": [
        {
            "author_info": {
                "name": "Manish Sehgal",
                "href": "/profile/Manish-Sehgal-3"
            },
            "answer_text": "I have Ableton, Logic, FL Studio, Garage Band, and Bitwig. I also have Traktor. Flow and Deckadance and have tried Serato. I’m more of a producer and not really a DJ. From a DJ perspective for DJ software, Deckadance is my favorite — but it’s not owned by image line anymore so I don’t know how well supported it will be going forward. I found Traktor to be a bit tedious but that may be because I don’t know how to use it. I have recently, however, built a pretty massive DJ set in Ableton. There are disadvantages and advantages. The main disadvantage is you have to warp each of the tracks so it stays locked to the clock, which can also be tedious (however there are ways to lock a track with only 2 warp markers / faster ways to do this). The second disadvantage is you basically have to load up all of your tracks in your project, there’s no concept of “crates” like in the proper DJ software. The third disadvantage is Ableton doesn’t play MP3s — when you drop MP3 files into a project it converts them to WAV and stores them separately. That said, Ableton is AWESOME to DJ with. This is b/c it’s a DAW and a powerhouse, with tons of effects, and of course you can do all kinds of awesome things with it. You can bring in as many samples as you want, overlay stuff, do all of everything people do with Ableton Live live. Mixtapes are less realtime. Ableton, in my opinion, is the best DAW for dealing with audio. Therefore you’d put all the tracks for your mixtape into it, warp them so they lock to tempo, then lay them out in arrange view, and go as crazy as you want. I don’t think you can do any of this stuff as easily in the other DAWs. Long rant summarized in 1 word: Ableton! ",
            "date": "Answered February 28, 2019",
            "views": "308",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Taylor Hardy",
                    "user_href": "/profile/Taylor-Hardy-31"
                }
            ]
        }
    ]
}