{
    "title": "What are some surprisingly well-written books? - Quora",
    "tags": [
        "Book Recommendations About Writing",
        "Book Lists",
        "Surprise",
        "Book Writing",
        "Writers and Authors",
        "Literature",
        "Reading",
        "Writing",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Akshat Mahajan",
                "href": "/profile/Akshat-Mahajan-1"
            },
            "answer_text": "My library is full of books I no longer possess. Between the ages of six and eighteen, I amassed a small but sizable personal collection of fifteen hundred-odd books, now languishing in cupboards in my parent’s home. In college, I spent the majority of my waking hours in one library or the other, finding unparalleled joy in stack and stack and blissful quiet. In the years since, I’ve thrived on used book sales, finding gem after gem rummaging through boxes of once-beloved yellowed tomes. Some I’ve sold. Some I’ve donated. Some I’ve kept. Nearly all of them occupy a shelf in my head, if no longer in my actual home. Amidst all this reading, the one universal truth I’ve found is that the most incredible books (the ones most bewitching, the ones where every page is electric and every word sparks your soul) are also the most obscure. Obscurity is the surprising factor in all that follows. Everyone expects Steinbeck or Vonnegut to arrest us in our tracks. No one expects the little-known or the non-famous to do it too. But the price we pay for the simplicity of bestseller’s lists and recommendation engines is the relative anonymity of the best of the English language. It’s my honour — and perhaps your delight — to share just three of them with you.  “Years ago, he shaved off his beard, without telling her, just appeared at the breakfast table one morning with half his face missing, or so it seemed to her in the first, shocked moment of seeing him. If she had met him in the street she would not have recognised him, except for his eyes. How strange he looked, grotesque, almost, with those indecently naked cheeks and the chin flat and square like the blunt edge of a stone axe. It was as if the top part of his head had been taken off and carved and trimmed and jammed down into the scooped-out jaws of a stranger. She almost wept, but he went on eating his toast as if nothing had happened. He had bought a cut-throat razor with an ivory handle, an antique thing from the last century; he showed it to her in its black velvet box lined with scarlet satin. She could not look at it without a shiver. He liked to show off his skill with it, and would leave the bathroom door open so she could admire the deft way he wielded the dangerous, gleaming thing, holding it at an elegant angle between fingertips and thumb, his little finger fastidiously crooked, and sweeping the blade raspingly through the snow-like foam. Harsh light above the bath and the steely shine of the mirror and one dark, humorously cocked eye glancing at her sideways from the glass. Where is it now, she wonders, that razor? In a week or two he got tired of using it and let his beard grow back.” — John Banville, The Infinities The Infinities is ostensibly a book about the old Greek gods descending to witness the passing of a great physicist, amusing themselves as they while away the time by following the lives of his fractured family. I don’t recommend this book to anyone. If you’re in it for thoughtful characterisation or a plot that challenges Campbell, you have lost the battle you set out for. I would likely never have the courage to read it again — yes, no matter how magnificent the prose, no matter how natural every sentence, no matter how crooning the siren call of Banville’s speech is — because, under the most masterful use of language since Shakespeare I have been fortunate to read, lies a story I cannot parse. In twenty years, I might not begin to be able to explain what happens. But I would be remiss if I did not include this as the top position on a list of the best written books on the planet.  It is hot in the Zambezi Valley. In the spring it is pregnantly hot, feverish, and the loins of all the valley’s creatures itch for the new season. In the spring the bull elephants trumpet and seek out and mount their cows again, the lions rumble over their slinky lionesses, indeed all living things snort and chase their willing womenfolk. In the springtime, more than other times of the year, the young men of the Batonka tribe woo their bare-breasted black maidens and, according to the custom, drag them off into the bush and rape them, so that their fathers may claim both damages and bridal price. In the spring the Sikatonga witch-doctors begin their ritual to make the rain come, and the tribesmen watch the sky and wait for the Sikatongas’ orders to begin to hoe the hot dry soil. Then comes the summer with thunder like cannon, and the rain rushes warm and fat and straight down upon the valley, the great Zambezi river swells and roars and the valley is full of steam and slush and sog, the valley jungle turns a reckless riotous green, and the Sikatongas know they have done their work well and that the ancestral spiritshave not deserted them. But this springtime the tribesmen of the Zambezi Valley were uncertain whether they should plough their clearings in the jungle, although the Sikatongas hadbegun their ritual to summon the rain. There was gloom in the valley. For the past year the Native Commissioner had been warning them of a great flood that was to come to the valley, a flood which would stay forever and drown the whole valley and its huts and animals and jungle gardens. The white men, the Native Commissioner had explained over and over again, were building a great wall across the river where it flowed through a great gorge called Kariba. The wall would stop the mighty river and cause it to flood the valley and turn it into a sea two hundred miles long and twenty miles wide. And all the people would be moved to new lands which the Government was providing for them above the escarpment of the valley. The Batonka people were unconvinced. They trusted the Native Commissioner and called him Elder Father, but how could the white men build a wall across the mighty river? Every man knew that the mighty river was the home of Nyamayimini, and the gorge called Kariba was his den. No man could stop the river. — Hold My Hand, I’m Dying, by John Gordon Davis. I found this book on a trawl through UCLA’s Powell library. I began reading it on at 9 pm on a laundry run in the hustle-bustle of Hedrick Hall, and it was only at 3 am — well after my laundry had been hurled and tumbled and dried and had collected lint in the base of the dryer — that I tore myself away from it long enough to return my clothes to the basement of my cupboard. Then I proceeded to return to reading. How do you even begin to describe this book? In one sentence, I might say it’s about the casual self-destruction of a white lawyer in Rhodesia — but, oh God, it is so much more than that. Hold My Hand, I’m Dying is about the death of an entire continent — the death of an entire way of life, rooted and ferreted out by the worst that humanity can offer, pummelled to death by corruption, run down in thousands by party officials, mourned only by those who remembered a perfect life. This novel is about grief, grief over the demise of good men and solid hearts, about an affinity with the natural world that grows to feel out of place in a country populated by cars and urban sprawls. This is a sad book. If you find yourself unable to weep after you read it, it is likely because your tears have all been run dry. Despite the seeming backdrop of renounced imperialism, the book does not advocate imperialism — it merely charts the effects of its sudden absence. It is a beautiful, well-written book.  Tongues wagged about her, of course, as they will in a small place. One fellow said he saw her pop out of a cleft in the rock in broad day, and when he looked for a passage or cave had found nothing but the smooth black stone. Another said she had seen her walking with the shy roe deer often and once with an enormous brown bear, chatting away and pausing as if to listen, as if she were conversing about the weather or the year's chestnuts. The local boys dared each other to go down the path to her cottage and peer in the windows at night. None ever did, although they lied a good deal about it. Some of the older women brought little baskets of fruit or crocks of cream or preserves and left them in the hollow tree by the head of her path, where today someone had left a more strange and less welcome gift. They made up stories about the woman to pass the evenings and frighten the children into bed: how she could change her shape, becoming a raven or a red fox, how she could sour milk with a glance or spoil traps, what she did in her cottage to little boys and girls who did not mind their elders. These tales grew richer with the years; in the end, they called her a witch. Such things used to happen often to women living alone and mostly no harm done, although when some old goose is treated as a witch and given little presents, she may get it into her head that she really has the power to make rain drop from the sky or two people fall in love, and then she might find herself in trouble. But this particular woman was a real witch. — Michael Gruber, The Witch's Boy No one collection of paragraphs in The Witch’s Boy does it justice — the whole of it, about a malformed boy who yearns so much to master the magic of his adopted witch-mother that he bargains everything he loves to trickster demons, comes just close enough. The Witch’s Boy is an original book. Every fairy tale we grew up hearing is repackaged and revisited in here. We have all of Jung’s archetypes jostling for display — the magician, the great mother, the hero, the jokester, the child. It is often impossible to predict where any one page will take you. Try as I might, I cannot find a similar tale by anyone (except perhaps by Faust, and even then just barely).  These three gems were the first ones that leapt out at me when Mo Nastri asked me to answer this question. Hopefully, you’ll like them too. ",
            "date": "Answered January 16, 2019",
            "views": "21",
            "upvotes": " View 18 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dan Rhodes",
                    "user_href": "/profile/Dan-Rhodes-31"
                },
                {
                    "user_id": "Remus Khalil",
                    "user_href": "/profile/Remus-Khalil"
                },
                {
                    "user_id": "Alexander Fortier",
                    "user_href": "/profile/Alexander-Fortier"
                },
                {
                    "user_id": "Angel Mary Alex",
                    "user_href": "/profile/Angel-Mary-Alex"
                },
                {
                    "user_id": "Hariom Kumar",
                    "user_href": "/profile/Hariom-Kumar-23"
                },
                {
                    "user_id": "Harikrishnan Venugopal",
                    "user_href": "/profile/Harikrishnan-Venugopal-12"
                },
                {
                    "user_id": "Sanjay Negi",
                    "user_href": "/profile/Sanjay-Negi-88"
                },
                {
                    "user_id": "Daniel Kirby",
                    "user_href": "/profile/Daniel-Kirby-34"
                },
                {
                    "user_id": "Ilias Gioldasis",
                    "user_href": "/profile/Ilias-Gioldasis"
                },
                {
                    "user_id": "Robin Harville",
                    "user_href": "/profile/Robin-Harville"
                }
            ]
        }
    ]
}