{
    "title": "What are the characteristics of sacred music? - Quora",
    "tags": [
        "Soul Music",
        "Sacred",
        "Characteristics",
        "Classical Music",
        "Spirituality",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thomas Ruddick",
                "href": "/profile/Thomas-Ruddick-1"
            },
            "answer_text": "There are no objectively correct answers. It depends on the religion. Each religion will develop its own type of sacred music. In the Medieval, the Catholic church decreed that plainchant was the only acceptable form, and so church music then had to be monophonic and modal in scale and rhythm. Protestants, when they came along, tended to enjoy harmonious homophonic hymns with four vocal lines and good voice-leading. But in ancient Greece, Dionysians enjoyed vigorous dancing and singing to the sound of the Aulos, a double-reed pipe that would have sounded, as best we can tell, like two zurnas played at once. Only maybe louder.  In Bali, the music of the gamelan orchestra is used for rituals—you can find rexamples of that music easily enough on youtube. Among African tribes, lots of drums would have been associated with religion. Among native Americans, drums also—but played with less aggression. It’s whatever the particular religion decides is proper. ",
            "date": "Answered January 13, 2020",
            "views": "947",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Thomas L. Johnson",
                    "user_href": "/profile/Thomas-L-Johnson-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Laurence Boorer",
                "href": "/profile/Laurence-Boorer"
            },
            "answer_text": "If it's a Gregorian Chant you can virtually guarantee it is \"Sacred Music\"  \"Tantum Ergo Sacramentum\". As is most \"native\" music, whatever nation or tribe it originates in  \"Ly O Lay Ale Loya\" (Circle Dance) If it's a classical instrumental or choral piece , the title will usually tell you it is. Consider  \"Benedictus\" from \"Mass in G major\" (DV167) by Schubert,  \"The Adhan\" Islamic \"Call to Prayer\",  \"Jesu, Joy Of Man's Desiring\" by Bach, and  the conclusion of \"Lamb of God\" followed by \"All My Hope\" from \"To Hope!\" the Jazz Mass by Dave Brubeck as examples. Then there are pieces specifically listed as Psalms  \"The Lord is My Shepherd (Psalm 23)\" (available in several tunes), or hymns  \"Amazing Grace\"  \"Jerusalem\" or  \"Battle Hymn of the Republic\". Carols too qualify  \"The Holly and The Ivy\" by Maddy Prior and Steeleye Span, and  \"Little Town\" by Cliff Richard (both to lesser used tunes), or  “God Rest Ye Merry Gentlemen”, (in a medievalised version) by Annie Lennox. But then we get into things like  \"Open Secret\" by The Joystrings (one of the first \"Christian beat bands\" from 1964) and  \"Magnify\" by We Are Messengers, a Christian Rock band. And we hit a problem with songs like this.  Is \"Joybringer\" as recorded by Manfred Mann`s Earth Band still a piece of sacred music, it's based on one and the lyrics sort of are. The only thing I can suggest is that \"Sacred Music\" is whatever you, or the leader of whichever religious group you are a member of, say it is. If you want to rock out to  “In A Gadda De Vida”, build up a sweat as you  “Dance Yourself Dizzy”, or trance out to  “Rubycon”, it makes no difference to me, so have fun. ",
            "date": "Answered July 17, 2019",
            "views": "230",
            "upvotes": " Answer requested by Shreya Sachdeva"
        }
    ]
}