{
    "title": "What is your favorite multi-track recording program? - Quora",
    "tags": [
        "Music Production Software and Apps",
        "Music Recording",
        "Audio Recording",
        "Music Production",
        "Audio",
        "Software and Applications",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard Kuschel",
                "href": "/profile/Richard-Kuschel"
            },
            "answer_text": "ProTools by far. I have used many others and ProTools has proven to be the most reliable. It provides non-destructive editing and automatic backup. A little daunting for about three days, but once you understand how it works it can be amazing. I use it to exchange files with other studios for collaborative work and it never lets me down. I use it for adding sound to video when the video programs need more extensive audio manuliption than can be easily accomplished within those applications. Multiple mixes can be saved without taking up much hard drive space. I have been using it since it’s infancy in the early 90’s. There are inexpensive (maybe free) ways to get ProTools and the system can be expanded beyond belief. They are the 800lb gorilla of the audio world. ",
            "date": "Answered February 28, 2019",
            "views": "229",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Marina D Samoylovich",
                    "user_href": "/profile/Marina-D-Samoylovich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Menzies",
                "href": "/profile/Dave-Menzies-4"
            },
            "answer_text": "I've only been using computer based DAWs for a year or so having sold my Roland 24 track console which I used for many years. Since my partner and I work now as a duo rather than a full band we don't need to record loads of tracks simultaneously. Since GarageBand came with my MacBook Pro that's what I started using. I love it and so far have not needed to upgrade to Logic - I will at some point but so far GarageBand and my Focusrite interface has been superb. ",
            "date": "Answered February 28, 2019",
            "views": "37",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Richard Ashmore",
                    "user_href": "/profile/Richard-Ashmore"
                }
            ]
        }
    ]
}