{
    "title": "What mantras to chant during Navratri? - Quora",
    "tags": [
        "Navratri (festival)",
        "Mantras",
        "Hinduism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vishal Bhardwaj",
                "href": "/profile/Vishal-Bhardwaj-478"
            },
            "answer_text": "Navratri bhajans and Durga mantras: Make the festive atmosphere of Navratri even more blissful by listening to some of Goddess Durga's popular bhajans/songs and chanting some of her powerful mantras. The mantras to chant during navaratri are : Sarva Mangala Mangalye, Shive Sarvartha Sadhika Sharanye Trayambake Gauri, Narayani Namostute Meaning: The one who bestows auspiciousness on one and all, the one who accomplishes all objectives, to the mother of the three worlds, O Gauri, I bow again and again to you. Benefits: By regularly chanting this mantra, one can accomplish all the four objectives of life - Dharma (dutybound living), Artha (wealth), Kama (desires) and Moksha (liberation). Sarva Swarupe Sarveshe, Sarva Shakti Samanvite Bhaye Bhyastraahi No Devi, Durge Devi Namostute Meaning: OM. You exist in everything, you possess infinite powers. Devi, please protect us from all fears, we salute to you O Durga Devi. Benefit: Chanting this powerful mantra that will help us eliminate fear, our most dreaded enemy. Etatte vadanam saumyam lochana trayabhushitam Paatu nah sarvabhiitibhyah kaatyaayani namostute Meaning: O mother with a beautiful face, adorned with three eyes, protect me from all that exists, Maa Katyayani I bow to you. Benefits: One can derive strength and courage by chanting this mantra regularly. Shanti karmani sarvatra tatha duh swapna darshane| Grah pidaasu chograsu maahaatmyam srinu yaanmam Benefits: Eliminate fear and nightmares from your life by chanting this mantra. The Mantra also has the power to overpower harmful or dangerous planetary positions that may have ill-effects on you. Sarva badhavinirmukto dhan dhanya sutanvitah Manushyo matprasaden bhavishyati na sanshayam Benefits: This Mantra will remove obstacles and roadblocks on your road to success and growth. Also, if you wish you conceive, regularly chanting this mantra can bless you with an offspring. For more information related to navratri visit : Home - Predictions For Success  ",
            "date": "Answered October 27, 2020",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rajendra Reddy",
                "href": "/profile/Rajendra-Reddy-7"
            },
            "answer_text": "Shri Shailaputri Devi Om Hreem Shri Shailaputri Durgaaye Namaha Om Devi Shailputryai Swaha Vande Vanchhit Laabhaay, Chandrardhkritshekharaam | Vrisharudham Shooldharaam Shailputriim Yashaswinim ||  Shri Brahamacharini Devi Om Hreem Shri Brahamacharini Durgaaye Namaha Om Devi Brahmcharinyai Namah Dadhaanaa Kar Padmaabhyaamakshmala Kamandaloo | Devi Prasidatu Mayi Brahmcharinyanuttamaa  Shri ChandraGhanta Devi Om Hreem Shri Chandra Ghanta Durgaaye Namaha Om Devi Chandraghantayayi Namah Pindaj Pravaarudh chandkopastrkairyuta | Prasadam Tanute Madhyam Chandraghanteti vishrutaa ||  Shri Kushmanda Devi Om Hreem Shri Kushmanda Durgaaye Namaha Om Devi Kushmandayayi Namah Suraasampoorna Kalasham Rudhiraaplutamev Cha | Dadhaanaa Hastpadmaabhyaam Kushmanda Shubhdaastu Me ||  Shri Skanda Mata Devi Om Hreem Shri Skanda Mata Durgaaye Namaha Om Devi Skandmatayayi Namah Sinhaasangataam Nityam Padmaanchit Kardwayaa | Shubhdaastu Sadaa Devi Skandmata Yashaswini ||  Shri Katyayani Devi Om Hreem Shri Katyayani Durgaaye Namaha Om Devi Katyayanyayi Namah Chandrahaasojjval Karaa Shaardoolvarvaahanaa | Katyayani Shubham Dadyaad Devi Daanavghatini ||  Shri kaalaratri Devi Om Hreem Shri Kaala Ratri Durgaaye Namaha Om Devi Kalratryayi Namah Ekveni Japakarnpoora Nagna Kharaasthita | Lamboshthi Karnika karni Tailaabhyaktshariirini ||Vaam Paadollasallohlata Kantakbhushanaa | Bardhan Moordham Dhwajaa Krishnaa Kalratrirbhayankari ||  Shri Maha Gauri Devi Om Hreem Shri Maha Gauri Durgaaye Namaha Om Devi Mahagauryayi Namah Shwete Vrishesamarudha Shwetaambardhara Shuchih | Mahagauri Shubham Dadyanmahadev Pramodadaa || Sarava Mangala Mangalye Shive Sarvartha SadhikeSharanyei Trymbake Gauri Narayani Namosthute  Siddhidatri Devi Om Hreem Shri Ram Navmi Durgaaye Namaha Om Devi Siddhidatryayi Namah Siddha Gandharva Yakshdyairasurairamarairapi | Sevyamaanaa Sadabhuyaat Siddhida Siddhidayini ||  Mantras Dedicated To Goddess Durga For The First Three Nights Of Navratri Om Dum Durgayaia Namaha  ",
            "date": "Answered September 25, 2017",
            "views": "95",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sumith Raja",
                    "user_href": "/profile/Sumith-Raja-3"
                },
                {
                    "user_id": "Priyanka Sahitya SD",
                    "user_href": "/profile/Priyanka-Sahitya-SD"
                },
                {
                    "user_id": "Matthew Abrahim",
                    "user_href": "/profile/Matthew-Abrahim-1"
                },
                {
                    "user_id": "Sarthak Pal",
                    "user_href": "/profile/Sarthak-Pal-24"
                },
                {
                    "user_id": "Chandan Sahu",
                    "user_href": "/profile/Chandan-Sahu-16"
                },
                {
                    "user_id": "RK SANTOSH",
                    "user_href": "/profile/RK-SANTOSH"
                },
                {
                    "user_id": "Kostov Borah",
                    "user_href": "/profile/Kostov-Borah"
                },
                {
                    "user_id": "Krishna Mohan",
                    "user_href": "/profile/Krishna-Mohan-12"
                },
                {
                    "user_id": "Ramit Chakraborty",
                    "user_href": "/profile/Ramit-Chakraborty-2"
                },
                {
                    "user_id": "CHHAVI CHOUDHARY",
                    "user_href": "/profile/CHHAVI-CHOUDHARY-11"
                }
            ]
        }
    ]
}