{
    "title": "What is the most sold song according to money? - Quora",
    "tags": [
        "Songs",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Hurst",
                "href": "/profile/Robert-Hurst-2"
            },
            "answer_text": "That must be Happy Birthday\" which has the same melody as \"Good Morning to You,\" a folk song dating to the 19th Century. But despite “Good Morning to You” being out of cooyright, music publisher Warner Chappel claimed that the lyrics to the song “Happy Birthdays” were actually resulted in the song being rewritten and copyrighted in 1935, and a royalty had to be paid for any public use of Happy Birthday A court case in 2013 resulted in $14m of royalties being repaid to filmmakers and other users who the court concluded had overpaid royalties in prior years It was even claimed the daughter of the song lyrics writer was a co-writer on the song thereby potentially extending the copyright from the 70 years after the date of the death of the songwriter that would otherwise have applied In 2008 the song was reported to be earning Warner’s $2m per annum. Extrapolating that back to 1935 and forward that’s a lot of money from one song ",
            "date": "Answered January 25, 2018",
            "views": "24",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jay Michael",
                    "user_href": "/profile/Jay-Michael-98"
                }
            ]
        },
        {
            "author_info": {
                "name": "Earl Burton",
                "href": "/profile/Earl-Burton-3"
            },
            "answer_text": "Strangely enough, the song “Happy Birthday” has made approximately $60 million in its lifetime, the most money that any song has ever earned. Technically, you were supposed to pay $25,000 for every performance of the song in a non-familial setting (like an office party), which is why you hear places do their own “birthday song.” But it has since moved into public domain. The Top Five are pretty interesting (as of 2017): 1. “White Christmas”2. “You’ve Lost That Lovin’ Feeling”3. “Yesterday” 4. “Unchained Melody”5. “Stand By Me” “Yesterday” is the song that has been “covered” (rerecorded) the most times, with over 2200 artists having done the song. ",
            "date": "Answered February 2, 2020",
            "views": "21",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jay Michael",
                    "user_href": "/profile/Jay-Michael-98"
                }
            ]
        }
    ]
}