{
    "title": "What are the strongest skills to have to be successful in Music Information Retrieval? - Quora",
    "tags": [
        "Music Skills",
        "Music Information Retrieval"
    ],
    "response": [
        {
            "author_info": {
                "name": "Erik Werner",
                "href": "/profile/Erik-Werner-10"
            },
            "answer_text": "Knowledge in digital signal processing is fundamental to MIR. Most important for example is to know is how Fourier Transformations works and things like correlation. Also filters are very important, though most times you don’t need to implement your own, but it’s important to know when to use FIR or IIR filters and a basic understand how they work. Machine learning gets more and more important in MIR. Though basic machine learning technics played always a role in MIR, neural networks will be the key to future developments in this field (and I personally need to catch up here). You mentioned sound engineering. Though I make music myself and record some tunes from time to time, my skills in sound engineering are very basic. Though it can be pretty handy I don’t think you need to be a good sound engineer to be a good engineer in MIR. Though music theory seems like a topic, which is essentially, I think you can pick up the essential parts as you advance in MIR-techniques. You don’t need to be able to read notes or compose own peaces, but still basic knowledge is good. As you can probably already guess, the most important skill is math. ",
            "date": "Answered March 22, 2017",
            "views": "254",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Zhuoyuan Wang",
                    "user_href": "/profile/Zhuoyuan-Wang-3"
                },
                {
                    "user_id": "Arya Mihir Singh",
                    "user_href": "/profile/Arya-Mihir-Singh"
                },
                {
                    "user_id": "Igor Alvarez",
                    "user_href": "/profile/Igor-Alvarez"
                }
            ]
        }
    ]
}