{
    "title": "What are the best BTS songs? - Quora",
    "tags": [
        "BTS Songs",
        "BTS (K-pop group)",
        "Music Recommendations",
        "K-Pop",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shuffle Dare",
                "href": "/profile/Shuffle-Dare"
            },
            "answer_text": "I have a lot but also not a lot of that makes sense. There are a lot of bts songs so this is a small fraction of them but in terms of amount, I think it's quite a lot. Mikrokosmos: This is one of their newerish songs but it never gets old, I used to play it on repeat and I still wouldn't get tired of itTrivia Seesaw: out of all the ot7 (like no solo work) albums, this is my favorite solo song.Let Go: this is one of my favorite Japanese releases and it's such a sad songLights: this is my other favorite Japanese releases.Outro: Propose: such an underated song and Jin's verse is amazingFake Love: one of my fav title tracks and I love the danceSave Me: one of my first favorite songs by btsI'm fine: before I even knew it was connected to save me, save me and I'm fine were my favorites for a while.Butterfly: such a chill song and it gives me chillsSpring Day: this song never fails to make me cryNot today: such a huge song and the dance is just stuck in my mindOutro: Wings: I don't really know what to say for this song I just really like itYou Never Walk Alone: I remember the first time I asked for this song on my Amazon alexa, i said the full name and it was a mouthful134340: I love the meaning of this songBest of Me: I believe it's the bridge of this song(jimin and jungkooks part near the end) lives in my mind rent free.Boy With Luv: I heard this song a few times and I pretended like I didn't like it but I secretly liked it. (This was when I didn't like kpop)On: this song made me become an avid listener of bts.Agust D2: I actually like Agust D2 better than Agust D. If I were to pick one song on the album, I would pick moonlightMono: this entire mixtape is a masterpiece. My fav would be seoulHope World: I'm so sad that this mixtape isn't on amazon music and I can't listen to it on my Amazon alexa. My fav would be bluesidePromise: I love love love love love this song. It's so pretty and catchy.",
            "date": "Answered October 6, 2020",
            "views": "404",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vy Nguyen",
                    "user_href": "/profile/Vy-Nguyen-747"
                },
                {
                    "user_id": "Destiny Jones",
                    "user_href": "/profile/Destiny-Jones-451"
                }
            ]
        },
        {
            "author_info": {
                "name": "C. Miller",
                "href": "/profile/C-Miller-99"
            },
            "answer_text": "I have so many favorite BTS songs, but I have a few in particular that I really love. 1.) Tomorrow This song really spoke to me in ways I can’t describe. I love everything about this song; the lyrics, beat, lyrics, rap, etc. Life isn’t about living along but living throughAs you live through, you’ll disappear some dayIf you keep spacing out, you’ll be swept away,if you ain’t no got the guts, trustIt’ll all become yesterdayanyway so what’s the use?I wanted to become happy and strongbut why am I getting weaker?Where am I going? I’m going here andthere but I always come back hereYeah, I’ll probably flow somewhere,is there an end to this maze? I’m sure this song has multiple meanings, but what I think this song is really about is that there’s always a better tomorrow, and that life may seem bleak now, but you shouldn’t give up because tomorrow, or the future, will always be better. It’s a song that youth can relate to, and I feel overwhelmed when listening to it. I have a long way to go butwhy am I running in place?I scream out of frustrationbut the empty air echoesI hope tomorrow willbe different from todayI’m just wishing This song has a hopeless feeling to it, which makes it more emotional and makes me want to keep listening to it. 2.) Outro: Tear This song talks about heartbreak- about losing someone that you love. Fear, and tearing apart a relationship; sadness and anger. The rapline all had different ideas on heartbreak and breakups. Tears that people shed… “Without knowing, blood comes into my eyesThings I can’t say flow through” Tearing apart love… “My heart’s shredded into pieces, just set it on fire” And fear…“You were my everything, keep going forward fear” I love that each one took a different approach with different meanings. The fact that the beginning of the song had some of the OST from BTS’ Highlight Reel added something special and unique to it. I think it brought more meaning to the song, and I was in awe. The way that the rapline put so much emotion into this song made me feel how miserable heartbreak is and how much agony and pain it puts people through. It’s a goddamn masterpiece. 3.) The Truth Untold The original story, La Città Di Smeraldo, is about a man who hides himself in a castle because he thinks of himself to be ugly. The only joy he finds in life is gardening. One day, a woman goes to his castle to pick flowers that he planted which enrages him. Later, he learns that the woman sells his flowers for a living, and begins to grow curious. Curiosity then turns into love, as he soon falls in love with the woman. He decides to grow a flower that doesn’t exist so that she’ll be able to make a fortune out of selling that flower. After many tries, he is finally successful. The woman never came back, and he later learned that the woman had died. A flower that resembles youBlossomed in this garden of lonelinessI wanted to give it to youAs I take off this stupid mask But I knowThis can’t go on foreverI must hideBecause I’m ugly I’m afraidSo patheticI’m so afraidIn the end, will you leave me too?So I’m putting on a mask to go see you What I can do isTo make a pretty flowerThat resembles youBlossom in this garden, in this worldThen breathe as the person you knowBut I still want youI still want you The song constantly refers to the original story. The main message is to not hide yourself or change yourself for other people, ‘les you lose them. It really touched me, and made me feel very emotional after reading the translations. You can hear the emotion that the vocal line put into this song, which helps deliver the message. 4.) Hip Hop Lover This song is about how much they love hip hop, and music in general. Music has impacted them, and is now permanently part of their lives. Regardless of who held them down, who discouraged them, etc., they always kept music part of their lives. They sacrificed a lot and left their old lives behind to follow their dreams. …I had so much to say that itwasn’t enough with what other people told meFirst, I forced it,layer after layer, calling it lyricsAnd that was it! uh that was it,when I became me… …The best musicians that affixedmy life’s borders that went crazy every dayEndless diction, all right, my instincts chooseWhatever rap it is, whatever dance it is,my response is sensualNow my life melts with hip hop… …Then I confidently answer, my everythingAs a result, my life has buried itself into musicIf loving this culture is a sin,I’ll die over a hundred times Besides the message, this song is a whole ass bop. This is what I look for in a rap song. I love the rap parts, and the vocal line’s part in singing the chorus. The beat and melody are amazing. 5.) Wings Solo Songs I love all of the wings solo songs, and I couldn’t choose just one. So, although it’s probably cheating, I put all of the Wings solo songs on here. Each of the songs have a deep and meaningful message to them, which I can relate to a few. First off… Begin (Jungkook)The fifteen year old me who didn’t have anythingThe world was so big, I was so smallNow I can’t even imagine itNow I can’t even imagine myselfwho used to have no scent, who used to be emptyLove you my brother, thanks to my brothersI now have emotions I became meSo I’m meNow I’m meYou make me beginLie (Jimin)Caught in a lieFind the me that was innocentI can’t free myself from this lieGive me back my laughterCaught in a lieTake me out of his hellI can’t free myself from this painSave the me who’s being punishedStigma (V)That light, that light, please illuminate my sinsWhere I can’t turn back the red blood is flowing downDeeper, I feel like dying every dayPlease let me be punishedPlease forgive me for my sinsPleaseFirst Love (Suga)I remember back thenWhen I was fed up and lostBack then when I fell into a pit of despairEven when I pushed you awayEven when I resented meeting youYou were firmly by my sideYou didn’t have to say anythingSo don’t ever let go of my handI won’t let you go ever again eitherMy birth and the end of my lifeYou will be there to watch over it allReflection (RM)But you know, sometimes I really really hate myselfTo be honest, quite often, I really hate myselfWhen I really hate myself, I go to DduksumI just stand there with the familiar darknessWith the people that are smiling and beer,Which makes me smileComing to me softly, fear, which holds my handIt’s okay because everyone is in twos or threesIt’d be nice if I had friends tooThe world is just another name for despairMy height is just another diameter for the earthI am all of my joy and anxietyMama (J-Hope)Over the phoneMy mom’s voiceThat I hear is clearWhat I remember isMy mom’s strength back then was my curve ballFor realI was determined to be successfulWith that one promiseI became the son I am nowAwake (Jin)Maybe I, I can never flyI can’t fly like the flower petals over thereOr as though I have wingsMaybe I, I can’t touch the skyStill, I want to stretch my hand outI want to run, just a bit moreAs you can tell, each song has a very deep meaning to it. I won’t describe each one because that’ll be way too long, but they all are held close in my heart. Their meanings and each members way of performing these songs really delivers a message to you; some clear, and others indescribable. Also, they’re all bops. 6.) Spine Breaker Wow, it feels good, putting on your dirty clothesYou’re something different, rockin, rollin,swaggin, swagger, wrong!What is wrong with you? You’re crazy babyThat is what will suffocate your heart, dirty clothes This song talks about how some people are willing to spend all of their parents money and “break their parents spines” just to fit in and follow the trends. I have seen a few people at my school act like this, and it isn’t pretty. It describes how selfish and ungrateful some people can be. I think that this song did a great job of describing “spine breakers” and gave a really good message that I hope people will live by. Don’t break your parent’s spines! Plus, this song is extremely catchy and is a goddamn B O P. I think that V did an amazing job with this song, and everyone else, too. 7.) Blue Side This song is one of J-Hope’s songs that was on his solo album. Though this song is very short and doesn’t have many lyrics, I really feel emotional while listening to it. Inside my blue dreamI want to contain youEven if you say noInside my eyes Inside my blue dreamI want to hold youEven if you say we can'tInside my embrace Blue sideBack to blue side I can feel the sadness and hopelessness that was portrayed in the song. The way that he sung/rapped this song made me feel a wave of emotions. It sort of has a melancholic and desolate feel to it. Inconsolable, lonely, bleak, and dismal. Dismal. Back to dismal. IsHobiokaythough- 8.) Dead Leaves This song also has multiple meanings. For example, youth. Youth is beginning to fall apart, and they’re trying to hold onto it an keep it together. I want you who makes eye contact with meI want you who wants me againPlease don’t fallPlease don’t collapseNever never fallDon’t go far far away Once youth passes, bitter or sweet, you feel reminiscence. In this case, they don’t want their youth to fall apart. Another meaning could be love. If you replace the word youth with the word love in every sentence, then it’ll still make sense. It gives me a sad and a feeling of trying to recollect what is lost. Along with that, the vocals are absolutely beautiful, and this song is a masterpiece. 9.) Intro: The Most Beautiful Moments In Life Part. 1 When the night comes again, reality gets destroyedWhen I snap out of it, I’m just a scared idiot againI keep getting scaredat the looming sense of realityOthers are running ahead but why am I still here? Breathe or dreamRow the oars along with your heartbeatIf you are trapped in the other’s thin judgementsThen the sun will set on your life like a court What am I doin’ with my lifeThis moment won’t ever come againI’m asking myself again, am I happy right now?The answer is already there, I’m happy This is one of Yoongi’s solo songs. The way he delivered this song just shows us how meaningful it really is. I believe it’s about reaching for a goal, but that goal distracts us from our real selves and dreams. It’s about fighting, but fearing an uncertain future, and that you can’t meet others standards, making you feel hopeless and worthless. But then, embracing your future and taking it into your own hands. Don’t let others define you, or let them control YOUR future and YOUR happiness. Don’t let others get in the way of pursuing your dreams. 10.) Rain This song has a few meanings, I think. One meaning in particular, is what I’m about to explain. The thick color of a rainy day in SeoulI still can’t fall asleep as I fade awayThe rain stops and the reflection in the puddleI see myself looking more miserable today I think it’s about not being motivated and feeling hopeless and the lack of willpower...I keep opening and closing the innocent refrigeratorWith the unknown empty feeling that washes over me Wondering if you’ve ever impacted anyone…Am I someone who engraved, like the rain,my existence to you? Being unhappy with a continuous cycle of the same routine every day, but eventually embracing it and doing something about it. If you do nothing about it, then you’ll continue to live the same boring and bleak life. You need to confront yourself, or take initiative, if you want your life to change. HONORABLE MENTIONS It Doesn’t Matter (An underrated and catchy masterpiece with meaning… Suga did so well with this song!)Converse High (Very nice sound to listen to. It has a unique feel to it that I can’t describe.)Second Grade (I love the upbeat-ness to this song.)Young Forever (I love the message and the sound.)Boy Meets Evil (The first “solo” song I listened to. This was what made me look at the Wings album- I’m glad I listened to this masterpiece!)Blood Sweat & Tears (One of the first BTS title tracks I listened to. I love the hidden messages in the MV.)I Need U (I song that I can relate to with a deep meaning.)Spring Day (Another song that I can relate to.)Look Here (This song is so goddamn catchy! I love listening to it.)I Like It (Also underrated. I love the slow beat to it.)Butterfly (They did amazing with this beautiful ballad!)Pied Piper (It’s catchy, and it’s meant for us ARMYs. It’s special!)Dope (This was the first BTS song I listened to, and I’m so glad I saw it!)Cypher PT. 3 AND 4 (Both of these songs are bad ass with bad ass meanings. Love them.)ALL Trivias (The Trivias are special to the rapline and have deep meanings, which I really like.)",
            "date": "Answered September 29, 2018",
            "views": "159",
            "upvotes": " View 82 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Paulina Cruz García",
                    "user_href": "/profile/Paulina-Cruz-García"
                },
                {
                    "user_id": "Satyendra Singh",
                    "user_href": "/profile/Satyendra-Singh-1368"
                },
                {
                    "user_id": "Dev Rodrigo",
                    "user_href": "/profile/Dev-Rodrigo"
                },
                {
                    "user_id": "Hobi Water",
                    "user_href": "/profile/Hobi-Water-15"
                },
                {
                    "user_id": "Isabel Koh",
                    "user_href": "/profile/Isabel-Koh-1"
                },
                {
                    "user_id": "Rutuja Hunari",
                    "user_href": "/profile/Rutuja-Hunari"
                },
                {
                    "user_id": "Charlie Alpha",
                    "user_href": "/profile/Charlie-Alpha-11"
                },
                {
                    "user_id": "Simran Assi",
                    "user_href": "/profile/Simran-Assi-1"
                },
                {
                    "user_id": "Meghna Kaligotla",
                    "user_href": "/profile/Meghna-Kaligotla"
                },
                {
                    "user_id": "Sua V",
                    "user_href": "/profile/Sua-V"
                }
            ]
        }
    ]
}