{
    "title": "What's the most beautiful theory you know? - Quora",
    "tags": [
        "Theory and Theories"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lucy Thomas",
                "href": "/profile/Lucy-Thomas-60"
            },
            "answer_text": "Since you don’t say what type of theory, I’ll throw out my favorite theory. Systems theory. It says that everyone, no matter how small, no matter how seemingly insignificant can affect the larger systems. I call it the wind chime theory. Even the tiniest rod that moves hits and causes other rods to move and creates sound. Systems do fight for homeostasis (going back to a state of rest or what others think is normal for the system). But the smallest and tiniest rod can affect even the largest and noisiest rod. What is a system? A family, a group of people who gather regularly, a neighborhood, a town, a city, a county, a state, a nation, the global community. These are all systems. I like this theory because it means no one is really hopeless or helpless if are willing to fight and make a little noise in the system. Making noise in the tiniest system can reverberate to the global community. One person can make a difference, for good or for bad. It only takes one person committed to make noise about an issue to make change. All revolutions started with one person who held an idea and made noise about it. All political ideas and political theories of what is best, started with one person or a few people who held an idea and made noise about it. One person can make a difference in the world for good or for ill, it only takes one person willing to make noise and jostle the system. ",
            "date": "Answered January 29, 2018",
            "views": "156",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Avieshek Rajkhowa",
                    "user_href": "/profile/Avieshek-Rajkhowa"
                },
                {
                    "user_id": "Rick DeHaven",
                    "user_href": "/profile/Rick-DeHaven"
                },
                {
                    "user_id": "Fabian Bożyszkowski",
                    "user_href": "/profile/Fabian-Bożyszkowski"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vijay Samuel",
                "href": "/profile/Vijay-Samuel-32"
            },
            "answer_text": "My theory on life: Whatever good deeds we do in life, will be credited into our account with God, who will return it to us with interest, at the exact time we need it! I believe in this theory, having experienced it many times in my life. ",
            "date": "Answered November 7, 2019",
            "views": "23",
            "upvotes": "0"
        }
    ]
}