{
    "title": "What type of music are teenagers listening to in 2020? - Quora",
    "tags": [
        "Listening to Music",
        "Music Recommendations",
        "2020 (year)",
        "Teenagers and Teenage Years"
    ],
    "response": [
        {
            "author_info": {
                "name": "Emory Lewis",
                "href": "/profile/Emory-Lewis-4"
            },
            "answer_text": "Hmm. A variety of genres but it really depends like always. With main stream culture embracing dance music more you find that in pop music more and more. Beyond that some of those dance culture DJs are actually making rock music of a slight variation that’s being classified as alternative. For the most part mumble rap is still dominating most of the mainstream hip hop charts and that’s a lot of what younger gens get exposed to on their journey to find what sound agrees with them. In dance/party cultures genres are blending for sure and lines are almost impossible to find but for the past decade or so bass music has dominated in the USA. I have no complaints to that since it’s my bread and butter. Dubstep has evolved to the point where it’s no just a tiny piece of its own genre. Deathstep is pretty popular, as well as Vomitstep (created and made popular by Snails). Riddim is dominating for sure. All of those sub genres are much much harder and darker than the original dubstep. Bass music isn’t the only genre getting darker. We’ve seen the birth of Dark Disco and what I call Death House. Bass house has completely taken over most things. A small small sub genre called speed house is struggling to make a place for itself. Rock is almost stagnant. It’s not progressing very far but in almost all it’s variations it carries a slight emo vibe with it in my opinion. Hope that helps. Ask if you’d like some artists of any genre for examples ",
            "date": "Answered August 3, 2020",
            "views": "930",
            "upvotes": " Answer requested by Michael Trivedi",
            "upvoters": [
                {
                    "user_id": "Scutu Mix",
                    "user_href": "/profile/Scutu-Mix-1"
                },
                {
                    "user_id": "Sam",
                    "user_href": "/profile/Sam-6033"
                },
                {
                    "user_id": "Alexis Eason",
                    "user_href": "/profile/Alexis-Eason-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Orfeas Loizou",
                "href": "/profile/Orfeas-Loizou"
            },
            "answer_text": "Hmm most of my classmates usually listen to mumble rap or some sort of rap in general I think it's called trap(rap where they talk about money and girls) I think it's called trap anyways Most of the girls in my class listen to popular pop songs and tiktok songs like savage love and some rap from Carti B or someone like her And lastly there are the minorities who have explored they're music horizons and found out about all the other quality music there is Myself a teenager I'm a big rock fan and my favourite group is Pink Floyd. Aside from Rock I listen to some metal and New wave . I like some electronica/trance songs as well ",
            "date": "Answered October 7, 2020",
            "views": "153",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hayden White",
                "href": "/profile/Hayden-White-55"
            },
            "answer_text": "This is what my friends and I listen to, The boxMo BambaYummyWhat if I told you I loved youHow do you sleepMy typeAll to myselfPlease me",
            "date": "Answered February 25, 2020",
            "views": "846",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daniel Palmer",
                    "user_href": "/profile/Daniel-Palmer-168"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anja Krusell",
                "href": "/profile/Anja-Krusell"
            },
            "answer_text": "It’s different for everyone. My sister (F14 nearly 15) likes chill, lofi and tiktok songs. I like alternative, indie, old pop and new pop. Some of my friends just like basic pop, some like rap from xxx, etc. It depends. ",
            "date": "Answered February 25, 2020",
            "views": "380",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Adalbert Vantas",
                "href": "/profile/Adalbert-Vantas"
            },
            "answer_text": "I'm speaking from the perspective of the they/thems of the world but we like uhhhhh Mother Mother Lemon Demon Jack Stauber Mindless Self Indulgence ",
            "date": "Answered October 23, 2020",
            "views": "42",
            "upvotes": "0"
        }
    ]
}