{
    "title": "What’s your view on Stray Kids’ Woojin? Do you think the other members have done the same? - Quora",
    "tags": [
        "Personal Views",
        "Stray Kids",
        "Boy Bands",
        "BLACKPINK",
        "K-Pop Idols",
        "BTS (K-pop group)",
        "South Korea",
        "K-Pop",
        "Children"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kriss Lee",
                "href": "/profile/Kriss-Lee-9"
            },
            "answer_text": "I don't know if people know who Kim Hyun-joong is (Boys over flowers actor). But a few years ago he was accused by his ex girlfriend of a bunch of things including getting her pregnant and telling horrible things and causing an abortion or something like that. The public shunned him and it ruined his career. It was later proven she lied and she even had to pay a ton of money for defamation and almost went to jail. People are very quick to jump on cancelation trains without really looking into things or trying to see things objectively. They want to find a bad guy and bury them. Maybe Woojin is guilty of one or some offenses, but then others want to make it worse and bury him deeper so they make up stuff, making it harder for the actual victim to prove what happened.. Why do y'all think people sometimes don't come forward when powerful people do things? Because other people make it more difficult. Either fans trying to defend or haters trying to make it worse. People need to wait until there's an investigation if there's any, and stop getting involved. If no one comes forward then that's that. There's nothing anyone can do but take it as someone spreading false information. His company was created in July. More than one company can have the same name. The logo they took from random place, they definitely lack creativity. He did not register the company, someone else did, months before this whole mess. He is probably not apologizing because he feels he doesn't have to. The second post accusing him was proven to be fake with a picture stolen from another person's post, who's to say the first one is real? If it is, that person should go to the authorities and have it all sorted out. I'm not pro Woojin and I'm not his fan. I actually like Stray Kids more without him, but stop making things worse by throwing fuel to the fire. Let's wait until the actual truth comes out. Things you can actually prove, before we start acting like he is guilt of anything. End of rant 🥴🙈 ",
            "date": "Answered October 1, 2020",
            "views": "222",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maris Leong",
                    "user_href": "/profile/Maris-Leong-3"
                },
                {
                    "user_id": "Ren Nora",
                    "user_href": "/profile/Ren-Nora"
                },
                {
                    "user_id": "Bored Channel",
                    "user_href": "/profile/Bored-Channel"
                },
                {
                    "user_id": "Serenity Adair",
                    "user_href": "/profile/Serenity-Adair"
                },
                {
                    "user_id": "Atiana Hernandez",
                    "user_href": "/profile/Atiana-Hernandez"
                },
                {
                    "user_id": "Lumiere Belle",
                    "user_href": "/profile/Lumiere-Belle"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yeona Kim",
                "href": "/profile/Yeona-Kim-5"
            },
            "answer_text": "Well as a young victim of online s***** harrassment, you can imagine what I felt when I found out that a member of a group I really looked up to was a perpetrator. He’s horrible, and to be honest, when I first got into Stray Kids, I felt a strange vibe coming from him. Something about him, I just didn’t like. But seeing that he had a lot of fans, I kept quiet and continued being an ot9 stan. I think the other members are innocent, no I’m sure they are. I don’t feel a negative or bad vibe from them, after the Woojin incident, I’ve been paying more attention to the idols and capturing every moment the other members feel uncomfortable around them. So far, Stray Kids seem like a group to really look up to, how the dealed with this incident and other problems. ",
            "date": "Answered October 1, 2020",
            "views": "73",
            "upvotes": " Answer requested by Jessie Lin"
        }
    ]
}