{
    "title": "What are some tips to sing better in a K-pop audition? What are some songs that I can sing in an audition? - Quora",
    "tags": [
        "Auditions",
        "Singing",
        "K-Pop",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bobby Bob",
                "href": "/profile/Bobby-Bob-331"
            },
            "answer_text": "I’m not an expert at singing but I think I can analyze a singing technique well, so here we go- TIPS: Watch as many survival shows as you can and incorporate every single piece of advice you can get from them. (Survival shows: YG treasure box, Sixteen, Stray Kids, WIN: who is next, Mix and Match)https://www.youtube.com/watch?v=TyoSWJwKOc0 For example, From the video you can conclude that Mashiho (the person with dark hair in the video) has a very unique voice, he’s enjoying his performance and is talented at doing falsettos and changing the notes fast yet, in a subtle way. Also that, Seunghun (the person with blonde hair) has a strong vocal technique that allows him to do high notes and when he sings normally, his voice blends exceptionally well with the instrumental causing a soothing effect to the song. If your age is near a teenager’s or younger than that, don’t stress your voice too much, it can have a negative impact on your singing later on. Include loads of honey in your diet and a lot of water. Moreover, try to exclude something overly spicy, salty, or sour in your diet. Preferably, try to drink slightly warm water to relax your throat. Try to assess yourself frequently rather than asking others to do it.Try doing some breathing exercises to increase your lung capacity.Have a strong foundation; I believe that all the companies expect you to hit the correct key and understand the flow and the melody of the song. If you have time before the audition, try your hands at least one instrument (piano, keyboard or guitar, commonly) it might increase your chances of passing in.Know your weakness; The people judging you would be observant, they’ll know your negatives almost immediately. It’s a good idea to work on them.SONGS: It’s honestly just dependant on the type of voice you have got. Go with: A ballad when your voice is: smooth, not very high-pitched (slightly deeper or normal range is a good option). It would be awesome to go for a ballad when your voice can deliver emotions well.Songs {Ballad} (and other song suiting the type of voice mentioned above): Pinwheel by SVT vocal unit, Love Yourself by Justin Bieber, The Truth Untold by BTS, Dandelion by AB6IX An upbeat song (slightly, not the roaring upbeat) when your voice is: well describing this is a bit tricky, common vocal range, when you can adjust the pitch of your voice according to a note. Dancing a bit with these songs is a plus.Songs: Feel special (Twice), Playing with fire (BLACKPINK), Very Very(IOI), Bad Boy (Red Velvet), Love Scenario (iKON) A vocal X rap song; Hard to put into words, but when you have a good flow and rhythm along with confidence and determination.Songs: My type by iKON A pop song: when your voice is extremely versatile, any vocal range would do.Songs; Eclipse by GOT7, Peek a boo by Red Velvet, Love Shot by EXO A roaring Upbeat song: when your voice is bold and powerful. This also requires strong vocalsSongs; Boombayah by BLACKPINK, Voices by Stray Kids (not exactly a roaring upbeat song), Latata by G-(IDLE). Do tell me if this was of any help! :) And also if u pass! ",
            "date": "Answered June 10, 2020",
            "views": "50",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Maria Ryoush",
                    "user_href": "/profile/Maria-Ryoush"
                },
                {
                    "user_id": "Eva Domazetovska",
                    "user_href": "/profile/Eva-Domazetovska"
                },
                {
                    "user_id": "Hanshikabisht",
                    "user_href": "/profile/Hanshikabisht"
                }
            ]
        },
        {
            "author_info": {
                "name": "Varsha Vartika",
                "href": "/profile/Varsha-Vartika"
            },
            "answer_text": "I think you can go with a Twice song if you have a cutely powerful voice. Fancy and Feel Special are my all time fav songs and they are easy to sing and pull the High note. If you can rap, you can try BlackPink as well. If you have a powerful voice and goot control on your notes, then only will I suggest SNSD, Mamamoo or Red Velvet. Also drink lots and lots of water. Don't keep your throat dry or you won't be able to sing properly. Hope that helps. FIGHTING!! ",
            "date": "Answered June 9, 2020",
            "views": "44",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hanshikabisht",
                    "user_href": "/profile/Hanshikabisht"
                }
            ]
        }
    ]
}