{
    "title": "When will BTS perform a live stage with the army? - Quora",
    "tags": [
        "Concert Tours",
        "The BTS Fandom",
        "Live Music",
        "Concerts",
        "BTS (K-pop group)",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rahimaa Syed",
                "href": "/profile/Rahimaa-Syed"
            },
            "answer_text": "This is the second question that I’m answering with you as the author. I did a little background search and now I know that you’re new here. BTS is a K-pop group that is successful worldwide. Their fans are called ARMY ARMY is abbreviated to Adorable Representatives and MCs for Youth. Army is any fan of BTS. ARMY IS THIS  NOT THIS  ARMY is a group of beautiful-hearted people who spread happiness and positivity all over the world and do whatever it takes to save BTS from any harm, not physical harm like gunshots but mental harm like cyber hating, bad people who spread hate and toxic people who call themselves “ARMY” And the army that you’re probably asking about is a group of people who do whatever it takes to save their country from harm. See the connection with the words and roles. Okay, okay, now back to your question. NO, BTS WILL NOT PERFORM A CONCERT WITH EITHER THEIR FANS OR THE REAL ARMY. Because there is a risk there, what if the fan they choose to perform with does any harm to them? And the real army would probably be too busy meeting their families and saving their country. Let’s end this on a good note, with this gif.  Make sure to search for DYNAMITE on YouTube! ",
            "date": "Answered August 23, 2020",
            "views": "37",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Noor Mohamed",
                    "user_href": "/profile/Noor-Mohamed-50"
                },
                {
                    "user_id": "Harold F. Callahan",
                    "user_href": "/profile/Harold-F-Callahan"
                },
                {
                    "user_id": "Yoona Chen",
                    "user_href": "/profile/Yoona-Chen-1"
                },
                {
                    "user_id": "Esha Nagi",
                    "user_href": "/profile/Esha-Nagi-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "IiĆóĺďBíśhiI",
                "href": "/profile/IiĆóĺďBíśhiI"
            },
            "answer_text": "BTS will perform a live stage with the army only when Corona starts to fade away little by little until they become no more.. I don't really know when that's going to happen.. but this is my opinion… Corona is still spreading and it is said that Vaccine for it has also been found and it is being tested on people of different countries to see whether it's working or not… They are still working on it. Until then, we ARMY(s) should wait to see how and when BTS will perform live with ARMY(s) on stage. It hasn't been declared that they'd perform or not… ",
            "date": "Answered August 23, 2020",
            "views": "8",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Noor Mohamed",
                    "user_href": "/profile/Noor-Mohamed-50"
                }
            ]
        },
        {
            "author_info": {
                "name": "Luísa Cardoso Monroe",
                "href": "/profile/Luísa-Cardoso-Monroe"
            },
            "answer_text": "October, I think? They'll have a concert between September and December, I'm almost sure it'll be in October. It'll follow the guidelines for health and security and it'll be available for stream, like Bang Bang Con. All if, of course, the number of covid-19 don't rise again in South Korea. ",
            "date": "Answered August 23, 2020",
            "views": "30",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Noor Mohamed",
                    "user_href": "/profile/Noor-Mohamed-50"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robin Wells",
                "href": "/profile/Robin-Wells-90"
            },
            "answer_text": "The band currently lives at THE HILL, a swanky apartment complex located in Yongsan-gu, Seoul, which is in the center of the city in a wealthy neighborhood. The complex is largely filled with actors, music executives, and wealthy business people. It consists of 600 units sprawled across 32 buildings. BTS' label, Big Hit Entertainment, later told Billboard that the tickets sold out in 20 minutes. The show is advertised to have had 40,000 tickets available. Go to my Profile and you can find all about BTS and ARMY material there... ",
            "date": "Answered October 5, 2020",
            "views": "19",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hazel Austin",
                    "user_href": "/profile/Hazel-Austin-5"
                },
                {
                    "user_id": "Carla Reid",
                    "user_href": "/profile/Carla-Reid-31"
                },
                {
                    "user_id": "Kerry Grant",
                    "user_href": "/profile/Kerry-Grant-50"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mukta Kuvalekar",
                "href": "/profile/Mukta-Kuvalekar"
            },
            "answer_text": "Wait a minute. Have you read what you have asked carefully? Because ARMY is the name of BTS's fanbase, and not any artist. How are they supposed to perform with their fans on stage? Please read your question carefully, you may want to ask a different question. ",
            "date": "Answered August 28, 2020",
            "views": "10",
            "upvotes": " Answer requested by Noor Mohamed"
        }
    ]
}