{
    "title": "When can Vietnamese pop music overtake Thai pop music? - Quora",
    "tags": [
        "Thailand",
        "Pop Music",
        "Asia",
        "Vietnam",
        "Music Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pachara Wattana",
                "href": "/profile/Pachara-Wattana"
            },
            "answer_text": "I’ve been wondering for a long time what T-POP really is. I’ve seen someone counts non-pop song to be T-POP, so T-POP in his/her understanding means Thai music. In the real meaning of POP, T-POP is dead many many years ago, maybe around 2011-2012. OK, it’s back, but with different styles from the past and it’s so different from V-POP style. For example, we don’t have solo artist that similar to Son Tung MTP. I mean like good looking, having fanbase. Visual and plot of the MV are also different. Thais love 2 things, Sad story and Funny stuff. You can see it from Thai commercial, it only has 2 type of commercials, Sad or Funny. lol V-POP has no needs to overtake T-POP because the marketing target is different. IMO, V-POP is trying to sell their songs oversea (according to the subtitles in many languages in CC). But T-POP isn’t. Most of Thai artists just make song for Thais. If there is foreigner who listen to it, it’s because 1. They just love Thai things 2. They heard it from Thai movie/drama. But hey, T-POP or Thai music isn’t that popular across oversea to compete with. Just keep doing your own way. But if you want V-POP or Vietnamese music become more popular, i think Vietnam needs to make Vietnamese movie and drama industry bigger. If it can be sold oversea, the foreigners will follow other entertainments immediately. It’s worked for Thai entertainment. For example, a song which is theme song of BL dramas, it got so many English comments in comment section. Anyway, Thais don’t listen to T-POP that much, mostly we listen to the song from bands (but if they play pop-rock or pop-whatever, we also listen). I mean in the sense of POP like K/J-POP that sells the artist’s looks, Most Thais don’t listen to T-POP like that. For example, these are T-POP in the past. IMO, Kamikaze is like fallen ancient civilization of Thai music industry. lol    (Don’t know why so many foreigner listen to this song. lol) T-POP now with Thai characteristic    (I’m not sure this is pop or not, but really like the MV. haha)  T-POP now with J/K styles that most Thais don’t listen much    What most Thais really listen to    ",
            "date": "Answered September 18, 2019",
            "views": "19",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Carolina Costa",
                    "user_href": "/profile/Carolina-Costa-75"
                },
                {
                    "user_id": "Chris Nguyen",
                    "user_href": "/profile/Chris-Nguyen-464"
                },
                {
                    "user_id": "The Minimalist House",
                    "user_href": "/profile/The-Minimalist-House"
                },
                {
                    "user_id": "Hoang Cong",
                    "user_href": "/profile/Hoang-Cong-3"
                },
                {
                    "user_id": "Tofu Tofu",
                    "user_href": "/profile/Tofu-Tofu-14"
                },
                {
                    "user_id": "Banyaphol Saengnak",
                    "user_href": "/profile/Banyaphol-Saengnak"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anh Lam",
                "href": "/profile/Anh-Lam-20"
            },
            "answer_text": "“When can”. You’re assuming that Vietnamese music industry is behind Thailand. It is not! And hasn’t been for a while now. I’m not sure when this question was asked, but Vietnamese pop music is now quite good and is getting better and better with very high production quality, catchy music, good, meaningful lyrics and many different styles of music. This is the latest hit of Son Tung MTP featuring Snoop Dogg. It is fresh, catchy and has a Latin vibe together with EDM style music. It now has 33 million views in just 1 day  This is another song he released 2 years ago, featuring traditional Vietnamese instrument, costumes, temple and EDM music:  To the above poster who said Vietnamese pop is like Kpop. Do those 2 videos look and sound like KPOP to you? I think many people just think any high quality Asian music must be a copy of Kpop. This is what ballad sound like in Vpop, if you translate these ballads into Korean, it would sound funny and out of place  Minorities influenced music such as this song is now also featuring more and more and Vietnamese pop and is mixed with modern elements to create something very unique:  Overseas Vietnamese also add a unique flavour to Vietnamese music such as this Vietnamese German guy in his song Say ah  This is his new music video he released 2 days ago:  What about hippie reggae music? Here you go  Even a middle aged singer like My Tam is able to innovate and come up with up to date and fresh hits with very trendy fashion, on point camera angles and video quality  I can list so many more. Maybe you are not very up to date with Vietnamese music. ",
            "date": "Answered July 3, 2019",
            "views": "16",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "ML Le - 黎明倫",
                    "user_href": "/profile/ML-Le-黎明倫"
                },
                {
                    "user_id": "Lexus Hypercar",
                    "user_href": "/profile/Lexus-Hypercar"
                },
                {
                    "user_id": "Duy Nguyễn",
                    "user_href": "/profile/Duy-Nguyễn-77"
                },
                {
                    "user_id": "Minh Tri Joseph Pham",
                    "user_href": "/profile/Minh-Tri-Joseph-Pham"
                },
                {
                    "user_id": "Chris Nguyen",
                    "user_href": "/profile/Chris-Nguyen-464"
                },
                {
                    "user_id": "The Minimalist House",
                    "user_href": "/profile/The-Minimalist-House"
                },
                {
                    "user_id": "Duc Luong",
                    "user_href": "/profile/Duc-Luong-11"
                },
                {
                    "user_id": "Ngoc Ng",
                    "user_href": "/profile/Ngoc-Ng-2"
                },
                {
                    "user_id": "Thanh Tuong",
                    "user_href": "/profile/Thanh-Tuong-3"
                },
                {
                    "user_id": "Dzung Do",
                    "user_href": "/profile/Dzung-Do"
                }
            ]
        }
    ]
}