{
    "title": "When looking at a chord triad, how do you know which note is the root? - Quora",
    "tags": [
        "Guitar Chords",
        "Guitarists"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michele Loria",
                "href": "/profile/Michele-Loria"
            },
            "answer_text": "You have three practical ways of doing it: Try the obvious: if you're looking at simple major or minor triads like C-E-G or A-C-E where the relationship between intervals is quite straightforward, then you're pretty much done already!Look for Inversion: if you happen to have whatever permutation of notes that form a simple triad, that's often called an inversion of the original triad. If we take the C major triad as an example and we start “rotating” its notes, we get E-G-C as first inversion and G-C-E as second inversion. You could then say that the key for all the inversions of a triad is the key of the triad itself.Call a spade a spade: if you happen to be unable to find any inversion that matches a “simple” triad, then just name the intervals! As an example, if you take C-Eb-G#, you could say that the interval C-Eb is a minor third, hence we have a C minor, and if you add the C-G# interval, which is a sharp (or augmented) 5th, you get a Cm#5. There are also online tools that help you with this, as well as some DAWs that “detect” names automagically when receiving input from midi sources! Those are super helpful to get started but might also be inaccurate at times, so be careful when using them.One thing worth mentioning is that, even though the third method can be almost universal, it may lead to naming chords in a more complex way than to just finding out their possible inversion. As a matter of fact, the example I chose in the third point was to actually prove this, since that chord can also be the first inversion of G# :) Also, keep in mind that all of this is out of context, so if for instance you're analysing a chord progression, you might find it easier to stick to the whole progression key/scale to name chords more appropriately. PS: happy practicing! ",
            "date": "Answered February 19, 2020",
            "views": "140",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Valerie Quinn",
                "href": "/profile/Valerie-Quinn-14"
            },
            "answer_text": "The anatomy of all triads is the same; Root at the bottom. Third two notes above. Fifth two notes above the third. Example C E G If the spacing of a chord is wider than that, rearrange the names until they are close, as above. Example: F A D re-arranges to D F A So D is the root. If the chord you see cannot re-arrange to that shape, it isn't a triad. Example: F A E isn't an inversion of a triad. ",
            "date": "Answered February 19, 2020",
            "views": "64",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Greg Knittel",
                "href": "/profile/Greg-Knittel-3"
            },
            "answer_text": "I use my knowledge of the key signature. c e g is the one chord in key of c it is still a c chord when the root is placed on top e g c learn the key signatures sharps and flats and you will identify the proper tone in each chord it is easier to see this on a keyboard ",
            "date": "Answered February 19, 2020",
            "views": "73",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joseph Baldassarre",
                "href": "/profile/Joseph-Baldassarre-1"
            },
            "answer_text": "In a triad there are 3 notes each a 3rd apart, so if the notes are not spelled in order (with the root first or on the bottom) the note that is a 4th apart is the root. ",
            "date": "Answered February 19, 2020",
            "views": "15",
            "upvotes": "0"
        }
    ]
}