{
    "title": "When will an Indian song reach 1 billion views in YouTube? - Quora",
    "tags": [
        "YouTube Views",
        "YouTube Videos",
        "YouTube",
        "Songs",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lucky",
                "href": "/profile/Lucky-1273"
            },
            "answer_text": "An Indian YouTube Video has garnered over billion views. The animated kids’ video was made by the ChuChu TV by redoing the nursery rhyme “Johny Johny Yes Papa.” ChuChu TV  If anyone said that an Indian video has been watched on YouTube for over a billion times, we would not believe it or think maybe the video would be a Hollywood trailer. But, guess what? The first video from India that got a billion hits on YouTube is neither a romcom, action nor a tech video, but a video compilation of nursery rhymes by ChuChu TV from Chennai. ChuChu TV “Johny Johny Yes Papa” The “Johny Johny Yes Papa” nursery rhymes compilation video was the first Indian video to hit one billion views. This is mainly because ChuChu TV added a new side to the classic rhyme. ChuChu TV has recently also signed a deal with Amazon Prime. In a recent interview regarding the remarkable achievements by the channel, ChuChu TV founder, and CEO Vinoth Chandar expressed how it all started and what they do at present. It All Began At Home ChuChu TV founder said that he always showed nursery YouTube videos to his then 2-year old daughter, which she enjoyed the most. His daughter’s excitement inspired him to create a 2D image of her and animate it. Chandar said that, when he first created a 2D image of his chubby daughter and made the ‘Chubby Cheeks’ animation from it, she liked it a lot. This led to the idea of uploading the animation to YouTube. The video received three lakh views in two weeks, something that he had never expected. Hence, began the journey of ChuChu TV.  ChuChu TV’s Giant Growth After “Chubby Cheeks”, CEO Vinoth Chandar made the second video on “Twinkle Twinkle Little Star” that had a better reach compared to the first one. When the channel reached over 5K subscribers, Chander and his partners at Buddies Infotech founded ChuChu TV that made animated videos for kids between age one and seven. Today, ChuChu TV is proudly the top ranking channel in Asia Pacific ahead of all the other genres and holds global second rank in education genre in YouTube. In four years of its existence, ChuChu TV has made great progress. It is worth noting that the Channel holds global 15th Rank in the all-genre category. THANKS FOR READING ALSO, YOU CAN READ HERE https://gadgetgarrio.com/this-is-first-indian-video-chuchu-tv/ ",
            "date": "Answered May 15, 2019",
            "views": "1",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dharaneshvar",
                    "user_href": "/profile/Dharaneshvar"
                },
                {
                    "user_id": "Vaibhav Kumar",
                    "user_href": "/profile/Vaibhav-Kumar-329"
                },
                {
                    "user_id": "Abhilash Bhat",
                    "user_href": "/profile/Abhilash-Bhat-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ishan Gadekar",
                "href": "/profile/Ishan-Gadekar-2"
            },
            "answer_text": "We're pretty close. Guru Randhawa has reached 725 Million + views. Just wait for our music to become more trash than it's current state. Probably anytime between the next ten years. Even probably in the next three. And this will only be achieved by songs made by Honey Singh or Guru Randhawa ft. Badshah, Anu Mallik with Ladki/ kudi ke nakhre / rape/ nashe/ swag wag/ Daru/ Bewafai/ Tere baap se zyaada kamata hoon/ Aunty police bulayegi type of lyrics. This is the ‘Gandugiri ka Gobar’ Modern day India listens to. Especially people in rural India. Yes and the song should have American models or one of the shit foreign Bollywood actresses who cant speak anything in Hindi dancing half nude. This will also be the day when greats like Gulzar or Javed Akhtar will shoot themselves in the head. This is what is happening to India my friend. Yes and I know America and developed countries are going through the same, but I wanted to see my country being recognized as creating some of the world's best music and cinema. *Song will start with Anu Mallik dancing and saying Aag Laga Dega* ",
            "date": "Answered May 17, 2019",
            "views": "206",
            "upvotes": " Answer requested by Dharaneshvar"
        },
        {
            "author_info": {
                "name": "Pranjal Chaubey",
                "href": "/profile/Pranjal-Chaubey-1"
            },
            "answer_text": "We are still waiting for 1 billion views for any Indian song, it will take some time to get that much of views.Top 3 Most Viewed Indian Songs On YouTube : Here.1.Swag Se Swagat Song | Tiger Zinda Hai | Salman Khan | Katrina Kaif.2.Guru Randhawa: Lahore (Official Video) Bhushan Kumar.3.Mile Ho Tum - Reprise Version | Neha Kakkar | Tony Kakkar.",
            "date": "Answered May 17, 2019",
            "views": "105",
            "upvotes": " Answer requested by Dharaneshvar"
        },
        {
            "author_info": {
                "name": "Visu Vilangadi",
                "href": "/profile/Visu-Vilangadi"
            },
            "answer_text": "Sorry first of all why it will happen? If it’s happened Will rain comingWill farmers happyWill rapists shameWill unemployed get jobWill politicians be goodWill government employees be on timeWill corruption dies",
            "date": "Answered May 17, 2019",
            "views": "72",
            "upvotes": " Answer requested by Dharaneshvar"
        }
    ]
}