{
    "title": "When is God moved by music? - Quora",
    "tags": [
        "Theology",
        "God"
    ],
    "response": [
        {
            "author_info": {
                "name": "Clif Williams",
                "href": "/profile/Clif-Williams-2"
            },
            "answer_text": "Just like your beloveth children who sing a song to you their loving parents it moves your heart sometime close to tears of love. That’s how our heavenly father feels when we use his gift of song and music he gave us. Music is one of the gifts of God by which man can render praise and thanksgiving to his Creator as well as give expression to his emotions, his sorrows and joys. Especially has singing been prominent in the worship of Jehovah God, but instrumental music, too, has played a vital role. It has served not only to accompany the vocalists but also to complement their singing. So it is not surprising that references to both vocal and instrumental music abound in the Bible from beginning to end, in association with true worship and otherwise.​—Ge 4:21; 31:27; 1Ch 25:1; Re 18:22. ",
            "date": "Answered August 23, 2020",
            "views": "49",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Harada Yoshihiro",
                    "user_href": "/profile/Harada-Yoshihiro"
                }
            ]
        },
        {
            "author_info": {
                "name": "Terry Ferguson",
                "href": "/profile/Terry-Ferguson-51"
            },
            "answer_text": "God is always moved by music,but the right kind.Story in the old Testament.Where an army was coming for Israel,and the KIng had singers to sing songs of praise to God,and God diverted the army.I have to try and find what book and verse it is in,but,The Psalms were songs,in hebrew.When the bible says,make a joyful noise to the Lord,what instruments does it call for?Cain`s line invented many musical instruments,(Drums for one).They summon demons. ",
            "date": "Answered August 23, 2020",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sheldon Drake",
                "href": "/profile/Sheldon-Drake"
            },
            "answer_text": "Usually right after he takes his bath every night, and puts on his brand new plush cotton bathrobe, and slips his perfect pretty perfectly manicured toes into his solid gold slippers size 82 because he has super big feet. This is a question for stupid children. ",
            "date": "Answered August 23, 2020",
            "views": "17",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Herman Monk",
                "href": "/profile/Herman-Monk"
            },
            "answer_text": "Blessings. God is moved by music when music proceeds like spirit from the heart, when both composition and performance are expressions of the inner movement that produces both music and prayer. Music and prayer are discoveries that proceed from intent inner silence. In performance arts, the creative process is inaugurated by an initial intuition or thought that a creator nourishes and nurses into a fully developed form. This process also has the effect of developing the author. The recreative process re-submits the developed material to an additional discovery and nurturing process that simultaneo Continue Reading",
            "date": "Answered August 25, 2020",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Howard Lehrman",
                "href": "/profile/Howard-Lehrman-1"
            },
            "answer_text": "Music cannot have any effect on a non-existant being…only REAL LIFE HUMAN BEINGS can be “moved” by classical, romantic, or the “doo-wop” oldies/dance music that was so popular on the American Bandstand of the 50’s and 60’s…. ",
            "date": "Answered August 23, 2020",
            "views": "7",
            "upvotes": " View 1 Upvoter "
        }
    ]
}