{
    "title": "When was the first guitar made and who invented it? - Quora",
    "tags": [
        "History of Inventions",
        "Innovation",
        "Guitars",
        "Invention and Inventions",
        "Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jose Tormo",
                "href": "/profile/Jose-Tormo-1"
            },
            "answer_text": "Original question: Who created the first guitar patent? Probably William B. Tilton. The standard acoustic guitar design has been around for centuries, long before the first patent laws were written to protect inventors’ rights. There have been a huge number of innovations that improved on the original guitar - bracing, tuners, saddles, bridges, truss rods, etc. - and then there are innovations in amplification from the first use of steel strings to resonator cones and then onboard pickups and full electric guitars. C.F. Martin & His Guitars, 1796-1873, a book by Philip Gura, discusses a US patent #8,338 by William Tilton from 1851 for bracing techniques for violins, guitars, and other stringed instruments to increase the strength of the top, Patent #10,380 from 1854 for the innovation of a guitar tailpiece that further improved string tension. Tilton also received Patent #14,378 from 1856 for a circular metal disc in the soundhole, plus another patent that covered slanted alignment of the wood grain for improved tone. These are probably the first patents that specifically call out guitar applications. Walter Carter’s The Martin Book: A Complete History of Martin Guitars discusses the early days of the C.F. Martin Company, describing the earliest instruments with an option for “patent screws” used on 2 instruments sold in 1836 when Martin was a merchant in New York rather than a producer. These are elaborate scrolled tuners similar to those found on violins, raising the value of the guitar by 50% compared to wooden pegs. ",
            "date": "Answered January 4, 2019",
            "views": "31",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gyan Dissanaike",
                    "user_href": "/profile/Gyan-Dissanaike"
                },
                {
                    "user_id": "Sayantan Mukherjee (সায়ন্তন মুখার্জী)",
                    "user_href": "/profile/सायंतन-मुखर्जी-Sayantan-Mukherjee-সায়ন্তন-মুখার্জী"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ed Durbrow",
                "href": "/profile/Ed-Durbrow"
            },
            "answer_text": "It was not so much invented as evolved. If you think of the mythical dead tortoise with sinews story (Ancient Narrative) you can imagine the roots go back to antiquity. You just have to decide at what point did an instrument with strings and a neck sticking out becomes a “guitar”. In Portuguese, guitar is called viola still today. Over 500 years ago you had the viola da mano and the viola da gamba. One was for plucking and one was for bowing. You can see/hear a viola da mano here:  Note the waist which gave room for a bow to play at an angle and gives a guitar its characteristic hourglass shape. The first instrument to be called guitar had four pairs of strings and was small. You can here one here:  By the 17th century, the guitar had five pairs of strings. You can hear a Baroque guitars all over Youtube. If I may be so bold, you can hear me playing one here:  If you want to hear a professional, there are many, but check this out, a real Stradivari guitar:  Single strung 6 string guitars appeared in the second half of the 18th century. Evolution of the 19th Century Guitar ",
            "date": "Answered December 2, 2017",
            "views": "46",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chetan Soni",
                    "user_href": "/profile/Chetan-Soni-62"
                },
                {
                    "user_id": "Jason Gassman",
                    "user_href": "/profile/Jason-Gassman-1"
                },
                {
                    "user_id": "Thomas Hinde",
                    "user_href": "/profile/Thomas-Hinde"
                },
                {
                    "user_id": "Gunjan Mehta",
                    "user_href": "/profile/Gunjan-Mehta-25"
                },
                {
                    "user_id": "Steve Cookson",
                    "user_href": "/profile/Steve-Cookson-1"
                },
                {
                    "user_id": "Pete Jackson",
                    "user_href": "/profile/Pete-Jackson-38"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Austin",
                "href": "/profile/Chris-Austin-83"
            },
            "answer_text": "Hmm, that’s a very good question. If you search on google then these two men come, Adolph Rickenbacker and George Beauchamp  But they invented electrified guitar. Now as for acoustic guitar, it has a long history, See this art from 17th century,  An oil painting created by Johannes Vermeer in 1672. That’s mean this old guitar still existed in the 17th century. There have been a lot of stringed instruments, which were precursor to guitar. Such as these these old Babylonian guitar,  But I have always heard that modern guitar was invented by Spanish muslims in the medieval age. I dug up and found this, 8 Great Modern Innovations We Can Thank Muslims For Some Arabic poets such as Ziryab, customized the oud  But this man deserves a lot of credit, Antonio de Torres Jurado  He designed modern classical guitar. So, as you could see there is no particular inventor of guitar. It has been developed since the invention of old string instruments. ",
            "date": "Answered September 28, 2017",
            "views": "16",
            "upvotes": " View 22 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Edward Banning",
                    "user_href": "/profile/Edward-Banning"
                },
                {
                    "user_id": "Christian Diehl",
                    "user_href": "/profile/Christian-Diehl-5"
                },
                {
                    "user_id": "W Izzy Rand",
                    "user_href": "/profile/W-Izzy-Rand"
                },
                {
                    "user_id": "Shashank Verma",
                    "user_href": "/profile/Shashank-Verma-259"
                },
                {
                    "user_id": "Hicham Soulaimani",
                    "user_href": "/profile/Hicham-Soulaimani"
                },
                {
                    "user_id": "Hedy Li",
                    "user_href": "/profile/Hedy-Li-3"
                },
                {
                    "user_id": "Michael Joe",
                    "user_href": "/profile/Michael-Joe-16"
                },
                {
                    "user_id": "Mohammed Aleem",
                    "user_href": "/profile/Mohammed-Aleem"
                },
                {
                    "user_id": "Steven Peters",
                    "user_href": "/profile/Steven-Peters-69"
                },
                {
                    "user_id": "Emmanuel Benson",
                    "user_href": "/profile/Emmanuel-Benson-3"
                },
                {
                    "user_id": "Tyler McGuee",
                    "user_href": "/profile/Tyler-McGuee"
                },
                {
                    "user_id": "Ameen Abou-Rjaily",
                    "user_href": "/profile/Ameen-Abou-Rjaily"
                },
                {
                    "user_id": "Teboho Mafereka",
                    "user_href": "/profile/Teboho-Mafereka"
                },
                {
                    "user_id": "Luis Angel",
                    "user_href": "/profile/Luis-Angel-69"
                },
                {
                    "user_id": "Rachel Rodman",
                    "user_href": "/profile/Rachel-Rodman-8"
                },
                {
                    "user_id": "Nothing So Serious",
                    "user_href": "/profile/Nothing-So-Serious"
                },
                {
                    "user_id": "Sahil Raghav",
                    "user_href": "/profile/Sahil-Raghav"
                },
                {
                    "user_id": "Rahmanda Wibowo",
                    "user_href": "/profile/Rahmanda-Wibowo"
                },
                {
                    "user_id": "Rituraj Bhattacharya",
                    "user_href": "/profile/Rituraj-Bhattacharya-2"
                },
                {
                    "user_id": "Sushovan Shakya",
                    "user_href": "/profile/सुशोभन-शाक्य-Sushovan-Shakya"
                },
                {
                    "user_id": "André Pereira",
                    "user_href": "/profile/André-Pereira-55"
                },
                {
                    "user_id": "James Bond",
                    "user_href": "/profile/James-Bond-1352"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Rook",
                "href": "/profile/James-Rook-5"
            },
            "answer_text": "I’m assuming you mean a patent on an electric guitar since guitars and guitar-like instruments go back a long way in history. According to a quick google search, “The electric guitar was invented in the United States in the 1930s. The first patent for the electric guitar was awarded to George Beauchamp for a guitar he made with partner Adolph Rickenbacker in 1931. A lot of other inventors and guitar makers were working on electric guitars at the same time. Famous electric guitar makers included Les Paul who pioneered the solid body guitar made by Gibson Guitars. In 1951 Leo Fender invented the Fender Telecaster. This guitar, together with the Gibson Les Paul, the Fender Telecaster, and the Gibson SG would make solid-body electric guitars hugely popular. These are still the most popular styles and models made today.” Google is your friend. History of the Guitar ",
            "date": "Answered January 4, 2019",
            "views": "659",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tom Serb",
                "href": "/profile/Tom-Serb"
            },
            "answer_text": "The modern guitar?  Antonio Torres Jurado in Sevilla, Spain in 1852.  He changed the dimensions of the body, making it larger, and made the top thinner, developing a system of fan bracing to keep it stiff.  These two changes radically improved the sound of the instrument, and all luthiers after him incorporated elements of his design. The guitar as an instrument?  No one knows.  Guitar like instruments have been around for thousands of years.  Here's a stone carving that dates back about 3500 years that's in a museum in Istanbul - you can clearly see both the 'hourglass' body shape and the presence of frets:   ",
            "date": "Answered November 9, 2015",
            "views": "55",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jason Gassman",
                    "user_href": "/profile/Jason-Gassman-1"
                },
                {
                    "user_id": "Dean Castle",
                    "user_href": "/profile/Dean-Castle-4"
                },
                {
                    "user_id": "Omar Al-Qawasmi",
                    "user_href": "/profile/Omar-Al-Qawasmi"
                },
                {
                    "user_id": "Nick Higton",
                    "user_href": "/profile/Nick-Higton"
                },
                {
                    "user_id": "Luis García-Pimentel Ruiz",
                    "user_href": "/profile/Luis-García-Pimentel-Ruiz"
                },
                {
                    "user_id": "Kate McKowen",
                    "user_href": "/profile/Kate-McKowen"
                },
                {
                    "user_id": "Holly Root-Gutteridge",
                    "user_href": "/profile/Holly-Root-Gutteridge"
                },
                {
                    "user_id": "Andrés Parzanese",
                    "user_href": "/profile/Andrés-Parzanese"
                },
                {
                    "user_id": "Philip Sutanto",
                    "user_href": "/profile/Philip-Sutanto"
                },
                {
                    "user_id": "William Halmeck",
                    "user_href": "/profile/William-Halmeck"
                },
                {
                    "user_id": "Tucker Kaul",
                    "user_href": "/profile/Tucker-Kaul"
                },
                {
                    "user_id": "Vaikunt Ramaswamy",
                    "user_href": "/profile/Vaikunt-Ramaswamy"
                },
                {
                    "user_id": "Sam Vonderahe",
                    "user_href": "/profile/Sam-Vonderahe"
                },
                {
                    "user_id": "Fatih Turan",
                    "user_href": "/profile/Fatih-Turan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Juan Espinosa",
                "href": "/profile/Juan-Espinosa-29"
            },
            "answer_text": "There is really no inventor of the guitar. Luthiers made modification to existing instruments to test new ideas and concepts. What we know is that, with the exception of the nylon-strings, (it had gut strings back then) the first guitar resembling the guitars we have today, is the classical Spanish guitar. Original from Spain, the guitar evolved from the guitarra latina of the 16th century, that had a slim, waisted figure, 4 courses/7 strings, viola tuning pegs, and round soundhole. By the 18th century the guitar had evolved to having 6 single strings, a broader body design, and back tuners replaced the pegs. Antonio Torres is known to have done many of the body changes that led to todays modern guitar. ",
            "date": "Answered January 15, 2018",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jason Gassman",
                    "user_href": "/profile/Jason-Gassman-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Guernsey",
                "href": "/profile/Richard-Guernsey-1"
            },
            "answer_text": "Another vague question easily googled. (sigh) I’m gonna go with Adolph and George. (electric guitar) “Adolph Rickenbacker was a Swiss-American electrical engineer who co-founded the Rickenbacker guitar company along with George Beauchamp and Paul Barth. Rickenbacker was born in Basel, Switzerland as Adolf Rickenbacher. George Delmetia Beauchamp was an American inventor of musical instruments and a founder of National Stringed Instrument Corporation and Rickenbacker guitars.” - Wikipedia “His most famous guitar was popularly named “Frying Pan” guitar, which was the first electric guitar ever to be made and sold commercially. Over 2700 of them were produced and sold.” - guitarhistoryfacts  ",
            "date": "Answered September 28, 2017",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Smith",
                "href": "/profile/Robert-Smith-1969"
            },
            "answer_text": "The electric guitar is much easier to do the history of than the acoustic: Rickenbacker Frying Pan Gibson (and other) hollow bodies with pickups on the top Bigsby’s Telecaster like guitar Telecaster Les Paul ACoustic is much harder because the transition from things like Lutes to guitars is kind of lost back in the mists of time. Certainly by Stradivarius time luthiers were building guitars as well as violins. ",
            "date": "Answered January 16, 2019",
            "views": "457",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Larry Atchley Jr",
                    "user_href": "/profile/Larry-Atchley-Jr"
                }
            ]
        },
        {
            "author_info": {
                "name": "Warren Kramer",
                "href": "/profile/Warren-Kramer"
            },
            "answer_text": "The guitar was not so much \"invented\" as evolved. Likely from the Middle Eastern oud and/or from the medieval lute or vihuela. Moors brought the oud to Andalusia, modern Spain. Lutes and vihuelas were common elsewhere in medieval Europe. Early guitars had fewer than six strings, but eventually, six became the standard. Pictured below are some of the precursors to the modern guitar:         ",
            "date": "Answered August 10, 2015",
            "views": "25",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jason Gassman",
                    "user_href": "/profile/Jason-Gassman-1"
                },
                {
                    "user_id": "Arvind Balasubramaniam (அரவிந்த்)",
                    "user_href": "/profile/Arvind-Balasubramaniam-அரவிந்த்"
                },
                {
                    "user_id": "Joe Lee Henderson",
                    "user_href": "/profile/Joe-Lee-Henderson"
                },
                {
                    "user_id": "Rishabh Medhi",
                    "user_href": "/profile/Rishabh-Medhi"
                },
                {
                    "user_id": "Suman Roy",
                    "user_href": "/profile/জ্যোতিষ-শ্রী-সুমন-রায়-Suman-Roy"
                },
                {
                    "user_id": "Nathaniel Dalgleish",
                    "user_href": "/profile/Nathaniel-Dalgleish"
                }
            ]
        },
        {
            "author_info": {
                "name": "Halil Kesiktas",
                "href": "/profile/Halil-Kesiktas"
            },
            "answer_text": "The Spanish people have invented the guitar… I know, that is broad answer but who put frets on her who added the sixth string seems to be unknown…So a little bit of history:The ancestor of the guitar is the oud. An Arabic fretless instrument with 5 strings. It was brought to Europe by the people of Caliphate of Cordoba (1017–1024). The first guitars had also five strings, and the low E was added afterwards. Unlike the oud, the guitars were fitted with frets. The eastern music uses scales which involve intervals smaller than semi-tones, so fretless instruments are needed. The western music uses semitones as the smallest interval so frets of semitones were the standart for stringed instruments. ",
            "date": "Answered April 5, 2017",
            "views": "43",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arvind Balasubramaniam (அரவிந்த்)",
                    "user_href": "/profile/Arvind-Balasubramaniam-அரவிந்த்"
                },
                {
                    "user_id": "Sourjadip Hati",
                    "user_href": "/profile/Sourjadip-Hati"
                },
                {
                    "user_id": "Richard Farnsworth",
                    "user_href": "/profile/Richard-Farnsworth"
                },
                {
                    "user_id": "Serim Paker",
                    "user_href": "/profile/Serim-Paker"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Hardy",
                "href": "/profile/Bob-Hardy-19"
            },
            "answer_text": "It kind of depends on how you define what a guitar is. There have been related and somewhat similar instruments for many centuries. One often-cited candidate for father of the modern guitar would be Antonio de Torres Jurado (born 1817, died 1892). Antonio de Torres Jurado - Wikipedia ",
            "date": "Answered October 4, 2018",
            "views": "362",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kenton Adler",
                "href": "/profile/Kenton-Adler"
            },
            "answer_text": "It depends on what kind of guitar you’re talking about. If electric, myth has it that Charlie Christian stuck a record player needle into the wood of his archtop and amplified it to be louder in the Benny Goodman Orchestra. Then Les Paul created The Log, which was the first true solid-body electric guitar. Then Leo Fender made them sexy. ",
            "date": "Answered June 18, 2019",
            "views": "84",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Riju Chatterjee",
                "href": "/profile/Riju-Chatterjee-4"
            },
            "answer_text": "My understanding is that the guitar evolved from instruments brought into Europe from Africa. I’ve heard that the origin of the word guitar is “kithara”, which was, I believe, an ancient Greek lyre with a tremolo. But then again there are may other words that claim to be the origin of “guitar”. I think the thing to realize is that the guitar is really a very simple instrument. It’s multiple strings strung across a fingerboard fretted at half steps. Most cultures in the world came up with something like this independently, and more likely than not in most cases it comes down to parallel evolution rather than common ancestry. ",
            "date": "Answered March 23, 2017",
            "views": "912",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hanns merie",
                    "user_href": "/profile/Hanns-merie"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gregg North",
                "href": "/profile/Gregg-North-1"
            },
            "answer_text": "Nobody “invented” the guitar. It evolved over several centuries, with instruments resembling modern guitars appearing in Spain 14th century. However the modern steel string guitar was born in factories, mostly in America around 1900. C.F. Martin and come. Did more to develop the guitar than any other company. ",
            "date": "Answered January 15, 2018",
            "views": "610",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chad Davis",
                    "user_href": "/profile/Chad-Davis-124"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frank Zingarelli",
                "href": "/profile/Frank-Zingarelli"
            },
            "answer_text": "Thanks history of the guitar is extremely complicated. The first electronic guitar, I believe, was the fender telecast (at least to be mad produced). But stringed instruments leading up to the now know 6 string guitar have been around for a long time taking on many different styles. ",
            "date": "Answered January 16, 2019",
            "views": "88",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Rock",
                "href": "/profile/M-Rock-13"
            },
            "answer_text": "Antonio De Torres. He had two periods of building called ‘Epochs’ he built guitars in the 1850s. Yes, guitars existed before this time, but the Torres model is the modern template. The further development moves fast in the 20th century. ",
            "date": "Answered November 13, 2019",
            "views": "92",
            "upvotes": " Answer requested by Veronica Thornton"
        },
        {
            "author_info": {
                "name": "Teboho Mafereka",
                "href": "/profile/Teboho-Mafereka"
            },
            "answer_text": "Nobody knows. You can read all the info you like but the correct answer is the one above. ",
            "date": "Answered June 11, 2018",
            "views": "99",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Derren Rodriguez",
                "href": "/profile/Derren-Rodriguez"
            },
            "answer_text": "George Beauchamp ",
            "date": "Answered November 3, 2015",
            "views": "87",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anshul Bathri",
                "href": "/profile/Anshul-Bathri"
            },
            "answer_text": "GO GOOGLE IT ",
            "date": "Answered June 7, 2018",
            "views": "124",
            "upvotes": "0"
        }
    ]
}