{
    "title": "When does it start to show that Naruto likes Hinata? (If it ever happens) - Quora",
    "tags": [
        "Naruto Shippūden (2007 movie)",
        "Anime and Manga",
        "Naruto (creative franchise)",
        "Manga"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jay Vien Mark Dulosa",
                "href": "/profile/Jay-Vien-Mark-Dulosa"
            },
            "answer_text": "Their connection actually starts in a flashback in The Last: Naruto the Movie. Hinata was being bullied by a bunch of kids when Naruto stepped in and defended her, getting beaten up instead in the process. This moment was the reason why Hinata started to admire Naruto. He got his red scarf torn up in the scuffle but shrugged it off. Hinata, however, wanted to repay his kindness and from then on, she started watching him from afar. In an episode near the end of the Part 2, we get to see a similar scene of Hinata getting bullied with Naruto saving the day, this time he had no scarf because it was already torn in the earlier scuffle. There were also scenes in flashback episodes near the end of Part 2 that showed them in the academy. In a sparring match between Sasuke and Naruto, all the girls were cheering for the former. Only one person was cheering for Naruto albeit discreetly: Hinata. In Part 1, specifically the written portion of the Chunin Exams, Hinata wanted to let Naruto copy answers from her, to which he declined because he would never take advantage of her. After his victory against Kiba, Hinata mustered the courage to offer Naruto some healing ointment. Naruto being thick-headed that he is, accepted the offer since he knows Hinata is always sincere. In the battle between Neji and Hinata, Naruto was amazed with her for not backing down despite clearly being outclassed. When Hinata was beaten to near death by her cousin and was mocked for being weak, Naruto swore a blood oath to Hinata that he will beat Neji. This lead to training under Jiraiya and Ebisu. The day before the match, Hinata encouraged Naruto that although he may stumble and fall, he will always find a way to get back up, calling him her “proud failure” (one way of saying he is her inspiration). Naruto replied that although she may be a bit weird, he really likes her (at least people like her). After defeating Neji and the crowd started cheering for him, the first person he looked for recognition was none other than Hinata, whom he made a promise. There were filler episodes that involved Naruto and Team 8, and the dynamic between him and Hinata. One such was the Bikochu Beetle arc. In one episode, Naruto saw Hinata practicing on the water. Naruto called her beautiful, although he didn't know that it was Hinata that he saw. All in all, Part 1 laid a somewhat decent foundation for the pair despite being very subtle. It is in part two that their relationship has some very interesting interactions. Naruto and Hinata's relationship in Part 2 was pretty much the same in Part 1 until we reached the Konoha Invasion Arc. Pain destroyed the village and fought Naruto, nearly defeating him. Hinata stepped in and fought Pain regardless of the fact that she was powerless against him. She focused on freeing Naruto from the metal rods that pinned him down but ultimately, she was beaten and stabbed. This happened in Episode 166 (I think?) and was titled Confessions. Seeing Hinata cut down like that and “killed” caused him to snap. This unleashed his tailed-beast cloak, nearly reaching the full form of the Nine-tailed fox. After Pain's defeat, he was come with grief that he lost control again and that he thought he killed Hinata and destroyed the village. When he used Sage mode to sense everyone's chakra, he was relieved that Hinata was still alive and that he didn't kill her by accident (it was shown in the manga that he was gripping his chest and nearly crying for her safety). Their interaction was put on hold because of some important events (Danzo Shimura seizing power and the Fourth Great Shinobi War, etc.) During his meeting with the Great Toad Sage at Mount Miyoboku, he was apprehensive about using the Nine-tail's power because he might lose control again. We won't see any development in their relationship again during the events of the war until Neji's sacrifice. With his beliefs broken by Obito's remarks on how he wasn't able to save Neji, Hinata was the one who slapped some sense into him. She reminded Naruto of her cousin's sacrifice, that his life is no longer his, and also of their shared ninja creed. Kurama agreed with Hinata, saying that Naruto owes his life also to his parent's sacrifice. Now encouraged, Naruto held Hinata's hand and stood together side by side and activated his tailed-beast form, empowering Hinata with the same chakra as seem in the anime and the cover of Vol. 64. Now, after that scene, the events that followed focused more on the battle between the Allied Shinobi Forces vs Madara and Obito Uchiha using the Ten-tails. There was a key event that showed they had a subtle yet strong bond between them. When the Infinite Tsukuyomi was activated and the world's population was beginning to be trapped in genjutsu, Hinata called out Naruto's name subconsciously. Naruto was able to sense this and immediately rushed to her but was stopped by Sasuke. After that arc, we didn't see anything else between the two of them before the events of The Last, which we no longer need to discuss since the main premise of the movie was the two of them. Personally, I believe that Naruto already had feelings for Hinata albeit subconsciously. Even so, he was too dense to realize this. Psychologically, Naruto was never able to experience actual love. To him, loving someone romantically can just be the same as loving ramen. Teuchi and Iruka Umino were the first people to accept Naruto, but it was Hinata who actually loved him the first which is apparent. Naruto on the other hand, developed his feelings subconsciously for Hinata in what I would guess was when he was encouraged by Hinata before his fight with Neji. He heard from Hinata herself that despite his flaws, she was proud of him. This might've formed the foundation for Naruto and Hinata's relationship. For the first time, someone besides Iruka acknowledged him for who he is. This event might've engrained itself in his psyche since the other people only see him as an annoyance. For me, this was the spark that lit Naruto's love for Hinata. In this same scene, we actually hear Naruto say that he likes people similar to Hinata. It might not be much, but Naruto has already acknowledged Hinata for who she is too. We have observed from previous parts throughout the anime and manga that Naruto loses control if angered. He has shown this when Sasuke betrayed the Hidden Leaf Village. The same condition can also be said to his fight with Orochimaru. Sasuke was treated as property by the villain and Naruto just lost it. The only other person that caused him to snap was Hinata. Her supposed death is what triggered the near perfect transformation to the Nine-tails. She was stabbed right in front of him, and he witnessed blood gushing out of her body. Compared to other transformations, we've never seen Naruto become so enraged and powerful in this scale. It simply shows that deep down, Hinata is the most important person in his life, he just doesn't realize it yet. And after the rampage, the first person he looked for was Hinata. He was afraid that she might've died by his hands during his rampage. When he was reassured of her safety, he almost cried while clutching his chest. Had she actually died, Naruto wouldn't just kill Pain, but turn the Hidden Leaf Village into a chakra irradiated hole. Finally we have the scene when the Infinite Tsukuyomi was activated. When Hinata called for Naruto, it was subconsciously, and Naruto heard it. It's as if they are connected together. This might just be because out of all the characters during the war, Hinata received the most chakra since she held the hand of the actual Naruto for the longest time and not just a shadow clone, although this is just my speculation. I would love to hear your comments on my analysis and idea behind Naruto and Hinata's relationship. If you have any other things to share or correct, feel free to do so. Here is a picture I'd like to share. I'd like to give the credits to the owner though I don't know who. So please, if anyone knows the owner of the image, give him/her the credits.  ",
            "date": "Answered July 23, 2020",
            "views": "32",
            "upvotes": " View 120 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Zeynep Demir",
                    "user_href": "/profile/Zeynep-Demir-6"
                },
                {
                    "user_id": "Valkiery Ginniefaye Williams",
                    "user_href": "/profile/Valkiery-Ginniefaye-Williams"
                },
                {
                    "user_id": "Rae",
                    "user_href": "/profile/Rae-727"
                },
                {
                    "user_id": "Prakhar",
                    "user_href": "/profile/Prakhar-161"
                },
                {
                    "user_id": "Ankita Aryan",
                    "user_href": "/profile/Ankita-Aryan-2"
                },
                {
                    "user_id": "Ryan Chen",
                    "user_href": "/profile/Ryan-Chen-394"
                },
                {
                    "user_id": "Mr.toast .",
                    "user_href": "/profile/Mr-toast"
                },
                {
                    "user_id": "Tania Kalombo",
                    "user_href": "/profile/Tania-Kalombo"
                },
                {
                    "user_id": "Muhtasim Mubashshir",
                    "user_href": "/profile/Muhtasim-Mubashshir"
                },
                {
                    "user_id": "Ruddy Alvarez",
                    "user_href": "/profile/Ruddy-Alvarez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Smarty Boy",
                "href": "/profile/Smarty-Boy-56"
            },
            "answer_text": "naruto always loved hinata because if we watch naruto from the start there were only plenty of people who accepted naruto as a friend or a classmates and other peoples look at him like they are watching a monster, and because of the nine tail fox inside naruto he can easily sense other people's feeling towards him, the only people who didn't watch him as a monster from the start was only shikamaru, choji, hinata and third hokage, naruto sense so much hatred in sasuke but it was not for him it was meant for someone else. anyway accept these five people everyone outcasted naruto even sakura and iruka. After sometime they become close, but before that naruto’s other personality (what was shown at waterfall of truth later) also growing deep inside him who hated every villagers accepts this five people who never outcasted naruto from the start. So naruto always had more connection from the inside with these five people which includes hinata of course.Naruto always claimed that he likes sakura but he never was he just wanted to defeat sasuke by taking sakura, because sakura claimed she loves sasuke more than anyone but really he doesn't give a shit about sakura’s love and what sakura thinks(this is also claimed in the last movie), and he even enjoys claiming sakura his girlfriend, during the chunin exam fight between sakura and ino he didn't care what ino was saying to sakura and it seems wierd to him, but when it comes to hinata when neji was bullying hinata naruto gets super angry and cheered for her, then after neji defeated hinata naruto attaked neji recklessly and pledged to defeat him, and before the fight with neji naruto shared his true feelings with hinata although he never shares his true feelings of him to anyone that easily even to the closest people of him, he always hides his sad feelings with his big smiles even when he was learning rasengan with jiraiya he wanted to tell jiraiya to spend little time but he didn't, when it comes to hinata he shared his feelings without hesitating.Naruto always loved hinata and respected her during the mission of bekochu beatle he seen hinata at waterfall and didn't realise it, but later he said he seen amazing girl, and when hinata saved him from honeybees and magnetman he praised hinata and naruto always thaught see is amazing, naruto usually never praised anyone on their face, if we compare it with sakura he didn't tell her a word about her monstrous strength,and when in early episodes he was sparring with lee he transformed all of his clones into sakura for stand up against lee, he doesn't care about other people's feeling who loves sakura,if he really loves sakura he didn't play this kind of lame games.Hinata always loved naruto since she was child naruto was always hero for her since naruto saved her from bullies, and for sakura she loved sasuke without even reason and even she broke friendship with the girl who supported her just because sasuke was handsom and she doesn't had any particular reason for why she liked him,and when sasuke was leaving village sakura started crying for stopping him instead of doing something like fight him or call someone etc, and i was like what the f**k when i watch the episode when sakura gets upset on naruto because he never get back sasuke, i mean she doesn't care naruto give it his all and rapped up with bandages all on his body and he and his friends almost died for making sasuke back,instead of thanking him she gets upset with him,and naruto instead of giving her one or two he said his promise is for lifetime,on the other hand hinata she tried to get died with enemy(magnet man) for protecting naruto when she was also a kid, and even lee who comes up with the surgery gone for the mission for get sasuke back and sakura didn't did anything accept crying on the gate of the village what kind of love is this.and at that time shikamaru was allowed to take any genin available at that time.When naruto comes back to village sakura asked him is she changed naruto said she didn't change a bit because he never ever noticed her that much or even he didn't try to look the differences, and naruto didn't recognise shino even after watching a bug, but when it comes to hinata naruto heard just a little voice of hinata and without even watching her he realised she was hinata.Naruto always had very strong connection with some character he also always transformed into nine tailed cloack because of them or when naruto’s life on danger, like he fighted with tsunade when she badmouthed about third hokage naruto fighted her without even care she was legendary sanin, and for saving sasuke and gaara, those all people were connected with naruto’s other side,naruto had even stronger connection with hinata because during the bekochu Beatle mission when he heard hinata has drawn into the water he started to transform but because hinata cameback he didn't,. when we compare it to naruto’s fight with gaara for saving sakura he didn't transform into nine tails for a second,when naruto was in nine tailed cloak he tried to kill jiraiya and hit sakura aside, but when he battled sasuke he didn't try to kill him he just wanted to brake his bones because naruto’s other side also had connection with him, so possibly even when was naruto transform into monster he was never going to hit hinata or shikamaru but for sakura she deserves to take hit, and when jiraiya and kakashi died naruto didn't transform into the ninetail or gets angery because shikamaru, hinata and choji were alive but when hinata got stabed by pain naruto didn't care about anything because his connection with hinata was that much strong he started his transformation usually he goes by one to four,but at that time he started with four and gone upto nine, he willingly broke the seal and given his body to the ninetail,when he come into his original form he first checked hinata’s chakra,because they were always connected at that time hinata risked her life fighted onesided battle with enemy even shikamaru tried to go for battle and what sakura did was sitting and crying as usual even konohamaru defeted one pain, even when naruto was using rashen shuriken she was shouting don't do it, i mean atleast if you are not going to help a person what you call a best friend at least just have a faith in him, even if you don't have a faith in him just shut your mouth or get lost, why are you telling him what he should do or do not.Naruto and hinata always were connected by feelings they can see eachothers feelings simply watching in eyes, during the fighting with pain naruto has seen weakness in hinata’s eyes, and during the war kiba and neji didn't recognise naruto but hinata just tell in seconds he was naruto by looking into his eyes, and during the infinite sukuyomi when hinata get caught she said naruto’s name and naruto just moved and tried to to get out of susaano,even in the naruto the last movie naruto when toneri first time appeared he tried to kidnap hinata but naruto angrily fighted him and saved her when it comes to hinata he always gets angry compared to his other fights, and after the genjutsu he finds out that hinata loves him but actually he was the one who always loved hinata, when hinata went with toneri to infiltrat the castle naruto was in sleep for three days and he was only saying hinata’s name,and he became extremely sad even he didn't want to try to save the whole world, it can't be happen in love of one or two days, inshort naruto always loved hinata he just didn't know about it. And sakura helps naruto a little bit at last so maybe that's why movie name is a the last just kidding but still i can less hate her now because what she did previously.",
            "date": "Answered December 14, 2019",
            "views": "524",
            "upvotes": " View 75 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vamshi Krishna",
                    "user_href": "/profile/Vamshi-Krishna-2303"
                },
                {
                    "user_id": "The Nooberator",
                    "user_href": "/profile/The-Nooberator"
                },
                {
                    "user_id": "Natalie Bessey",
                    "user_href": "/profile/Natalie-Bessey"
                },
                {
                    "user_id": "Rae",
                    "user_href": "/profile/Rae-727"
                },
                {
                    "user_id": "Kyla Nacionales",
                    "user_href": "/profile/Kyla-Nacionales"
                },
                {
                    "user_id": "Aiden Landeros",
                    "user_href": "/profile/Aiden-Landeros"
                },
                {
                    "user_id": "M Shafiq",
                    "user_href": "/profile/M-Shafiq-43"
                },
                {
                    "user_id": "Sumukh Bhagwat",
                    "user_href": "/profile/Sumukh-Bhagwat"
                },
                {
                    "user_id": "Agnijo Dutta",
                    "user_href": "/profile/Agnijo-Dutta"
                },
                {
                    "user_id": "Ayesha Naweed",
                    "user_href": "/profile/Ayesha-Naweed"
                }
            ]
        }
    ]
}