{
    "title": "When was the technology for audio recording first invented, and how was audio initially recorded? - Quora",
    "tags": [
        "History of Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dave Haynie",
                "href": "/profile/Dave-Haynie"
            },
            "answer_text": "Thomas Edison made one of the first recordings, back in 1877, as part of the process of inventing the phonograph. There had been a few other inventors messing with sound recording at the time, but Edison's could also play the sound back. He coated a cylinder with tinfoil, and used a stylus connected to a diaphragm. Sound was recorded into the diaphragm to etch the cylinder, later played back using the same stylus and cylinder. That wasn't a very stable arrangement, and once these were made commercial, the cylinder was recorded first, then duplicated in more robust materials. Other inventors came up with the flat disc rather than cylinder, which proved more robust in production and storage.  The magnetic recording gear used wire. Inventor Valdemar Poulsen worked on this between 1898 and 1900. He used spools of steel wire, which took a magnetic imprint of the output of a microphone, and could play this back with the same transducer, using a lower energy magnetic field. Wire recorders were eventually made smaller, but the need to deal with stiff steel wire made them relatively heavy, kept recording times short, and quality low.  In the late 1920s, inventor Fritz Pfleumer coated paper strips with iron filings and created the first tape recorder. This worked pretty much like Poulsen's wire recorder, but the tape was lighter and easier to manage. Over the years, the tape was switched to stronger materials like mylar, and the magnetic material to various formulations of iron oxide.  Around 1955, guitar innovate Les Paul and recording machine designer Ross Snyder came up with the first multi-track tape recorder. This allowed more than one track to be recorded, and allowed for one thing to be recorded in sync with another. Eventually 4, 8, 24, and more track recorders were created. ",
            "date": "Answered May 20, 2014",
            "views": "286",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "William Anders",
                    "user_href": "/profile/William-Anders-4"
                },
                {
                    "user_id": "Yury Semikhatsky",
                    "user_href": "/profile/Yury-Semikhatsky-1"
                }
            ]
        }
    ]
}