{
    "title": "When you hear the word 'Meditation' what comes in mind first? - Quora",
    "tags": [
        "Word Associations",
        "Meditation",
        "The Mind",
        "Spirituality",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Radhika Devi",
                "href": "/profile/Radhika-Devi-20"
            },
            "answer_text": "The word ‘meditation’ brings to mind construction of an inner space for oneself in the outer world. If the outer is compared to a sharp—thorned - petalled rose, always in the phase of drop-bloomed despair, the inner is compared to a fresh-blooming Lotus, ever fragrant in the joys’ breeze of Compasionate Care! By polishing the jewel (the mani) within the lotus, lo and behold! …it appears as if the white lotus has taken on a red blush, generally associated with romantic roses! And soon I see that that outer gena rosa now bends toward the-lotus nelumbo almost as if they wished to pair! Thus Now in the second phase of mediation, the celebratory Dhyana, I continue to polish the jewel within the bloom and again, looking through half-close eyes- I see that the shape of my lotus has taken the roundness of a crusted rose and indeed emits a fragrance resembling the latter when in fact it blooms for the lovers of Song of Songs-radiant joy! In the end, when exiting from the samadhi I check the thorns of the rosa-wood- homologized with the outer world of the senses - and behold, the thorns previous piercimg like bloodying spears of despair, now seemed like triumphed gold-laden stamens, announcimg the victory of wine over water , heaven over earth, sukha over dukha and- almost blinding!- resembling but unearthly mirth as the petalls,revived and jubilant mixed with the leaves of the lotus and both (I now see to my great astonishment!) appeared to dance to the Music of the Spheres! After such nights of epiphanies I now see the Outer-World’ but as a Theophany of the Inner! Whether ‘in ‘ meditation’ or ‘out’ all reality carries the fragrance of the Purnam, the Whole, viz. Adha-cum- idam..the systole! Should I reveal more or simple remain dumb, dancing the phalka of joy and allowing the sun -strokes of the many, bringing the moon -coma of Bliss, reading but one love note, written in the hand of Kvan Yin, the compasionate Goddess of love, waving the medicine -herbs of Hers and His, adinfinitum! ",
            "date": "Answered August 15, 2019",
            "views": "251",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Abhishek",
                    "user_href": "/profile/Abhishek-1423"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nagarajan Ramachandran",
                "href": "/profile/Nagarajan-Ramachandran-3"
            },
            "answer_text": "My honest belief about meditation is that most people are faking meditation. I have never meditated in my life ever, in the traditional sense of the word. I have done a lot of pondering and deep introspection to look at my own psyche and to learn about it. By understanding my own psyche and looking at others’ behavior, I have learned about mind in general. I really do not believe in trying to control the thought process forcibly. I do not believe that, that will ever work, nor is it even possible. There are about 500 different schools of meditation and if they can measure their success by how many out of 100 practitioners achieves enlightenment, I would say that the success rate is low. ",
            "date": "Answered May 12, 2019",
            "views": "128",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sriya K",
                "href": "/profile/Sriya-K-1"
            },
            "answer_text": "Monkey mind.. Our monkey mind keeps on thinking and giving us opinions.. it's up to us to listen to it or not.. Keeping your mind busy with bring aware of breath is meditation anywhere anytime. This perception is well explained in this video..  ",
            "date": "Answered December 5, 2017",
            "views": "510",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Swarnim Bhardwaj",
                    "user_href": "/profile/Swarnim-Bhardwaj"
                },
                {
                    "user_id": "Nikhil Narayanasa",
                    "user_href": "/profile/Nikhil-Narayanasa"
                },
                {
                    "user_id": "Lakshmi Varanasi",
                    "user_href": "/profile/Lakshmi-Varanasi-3"
                },
                {
                    "user_id": "Harish Varma",
                    "user_href": "/profile/Harish-Varma-25"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shaili Dewangan",
                "href": "/profile/Shaili-Dewangan-1"
            },
            "answer_text": "Upon hearing the word \"Meditation\", this image comes to mind: Sitting with your legs loosely crossed, and both feet resting below the opposite thighs. The feeling of peace. The chillness and somehow, strangely....LOVE. Just the image of meditation brings some peace. ",
            "date": "Answered December 7, 2015",
            "views": "212",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Abhishek Kaginkar",
                    "user_href": "/profile/Abhishek-Kaginkar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Duraiswamy Vaidyanathan Chandrasekar",
                "href": "/profile/Duraiswamy-Vaidyanathan-Chandrasekar"
            },
            "answer_text": "Someone sitting alone or in a group with eyes closed and concentrating inward shutting out outside distractions. That is the image that comes to mind immediately when hearing the word 'meditation'. ",
            "date": "Answered December 7, 2015",
            "views": "142",
            "upvotes": " Answer requested by Yoga With Amit"
        },
        {
            "author_info": {
                "name": "Ravi Srinivas",
                "href": "/profile/Ravi-Srinivas-9"
            },
            "answer_text": "Meditation is switching from doing to being mode and it is about connecting with the authentic you ,the animating presence within this form.It is the greatest act of SELF LOVE ",
            "date": "Answered December 31, 2016",
            "views": "81",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Harsh Manral",
                "href": "/profile/Harsh-Manral-6"
            },
            "answer_text": "That of Lord Buddha Meditating under the Banyan Tree at Bodh Gaya where he Got The Enlightenment! ",
            "date": "Answered May 12, 2019",
            "views": "22",
            "upvotes": "0"
        }
    ]
}