{
    "title": "When rappers record their songs, do they actually say their entire verses in one take, or do they have multiple takes and combine them afterwards so that it sounds like they rapped it in one take? - Quora",
    "tags": [
        "Music Recording",
        "Audio Recording",
        "Music Production",
        "Rap Music",
        "Hip Hop and Rap Artists",
        "Hip Hop Music",
        "Music Industry",
        "Musicians",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ethan Hein",
                "href": "/profile/Ethan-Hein"
            },
            "answer_text": "Jay-Z is famous for being able to get his verses down in a single take. I don’t know how consistently he is able to do this; I’m sure he doesn’t manage to do it every single time. Most rappers will need a few takes, or will have to redo a line or two here and there. Sometimes it’s obvious when a splice occurs. There’s a particularly interesting example in Chance the Rapper’s verse on Kanye West’s “Ultralight Beam.” On the fourth time through the form, Chance sings the line, “This is my part, nobody else speak” on the same C minor pentatonic scale he used at the beginning of his verse. Then he sings the same line again on the same melody, but with noticeably different voice quality. I’m certain that the two lines come from two different takes. So why are they both in there? Here’s my guess: in one take, Chance tumbled through the lines leading up to that line and ran out of breath after “nobody else speak.” So he had to stop, back up, and punch in another take starting at the top of the section. Maybe while listening back in the studio and deciding where to cross over from one take to another, Kanye and his co-producers heard both passes through the line, liked the effect, and decided to use both of them instead of whatever phrase was supposed to come next. I can’t be sure that’s what happened, but it’s the likeliest explanation. Read an in-depth analysis of the entire verse: Chance the Rapper’s verse on “Ultralight Beam” ",
            "date": "Answered August 17, 2019",
            "views": "34",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alejandro Garcia",
                    "user_href": "/profile/Alejandro-Garcia-671"
                },
                {
                    "user_id": "Pablo Civera",
                    "user_href": "/profile/Pablo-Civera"
                },
                {
                    "user_id": "Matthias Klampfl",
                    "user_href": "/profile/Matthias-Klampfl"
                },
                {
                    "user_id": "Murilo Cadete",
                    "user_href": "/profile/Murilo-Cadete"
                },
                {
                    "user_id": "David Toomey",
                    "user_href": "/profile/David-Toomey"
                },
                {
                    "user_id": "Gerrit Bernard",
                    "user_href": "/profile/Gerrit-Bernard"
                },
                {
                    "user_id": "Carol Chappell",
                    "user_href": "/profile/Carol-Chappell-1"
                },
                {
                    "user_id": "Joe Ospalla",
                    "user_href": "/profile/Joe-Ospalla"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roran Zacharias",
                "href": "/profile/Roran-Zacharias"
            },
            "answer_text": "It depends on who they are, how hard their verse is, their recording style, and the engineer's preference. Personally I like to rap my whole verse in one take, and if necessary sometimes I’ll use two clips, one for each half of the verse, although I do that only rarely. Some people like to go in four-bar chunks. Some record their verses a few dozen times, and then their engineer hand-picks each individual word. Four bars or one take is more prevalent in rap, while each individual word is more prevalent in pop music. If you wanna hear a super crazy one-take/first-try verse listen to Joyner Lucas’ fast flow in his Suge remix.  Now, this is one hell of an impressive one-take. ",
            "date": "Answered January 24, 2020",
            "views": "11",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Saarthak Saran",
                    "user_href": "/profile/Saarthak-Saran"
                }
            ]
        },
        {
            "author_info": {
                "name": "L.B Rai",
                "href": "/profile/L-B-Rai"
            },
            "answer_text": "Artists in general have different preferences on how they record their music. As a rapper myself, I record my entire full verse in several takes and then choose the full take I like best, rather than chop and piece together best pieces of each full verse takes. It works for me, because I always recite how I deliver my verses before I head to the studio to record them. I've also engineered and coached other rappers in the past as well as singers. Some are able to control their breathing enough to go through their entire verse while others only like to record their verses piece by piece. ",
            "date": "Answered August 31, 2019",
            "views": "581",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nancy Shuster",
                    "user_href": "/profile/Nancy-Shuster-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aspry Wright",
                "href": "/profile/Aspry-Wright"
            },
            "answer_text": "All songs are made by recording “multiple takes and combine them afterwards so that it sounds like they rapped it in one take.” Even rap, by one rapper. Sometimes songs by whole groups are recorded with only one member in the sound room singing their parts. They leave and another member enters for their turn. Repeat. When they need harmony, all members/backup singers, etc. are there together. The best take is used for the album. There have been times when listening to a rap song that I could tell exactly where the edit took place. Any group or singer that does it any other way is an exception. ",
            "date": "Answered August 17, 2019",
            "views": "15",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stephen Jones",
                    "user_href": "/profile/Stephen-Jones-1253"
                },
                {
                    "user_id": "Koushik Kotagiri",
                    "user_href": "/profile/Koushik-Kotagiri"
                },
                {
                    "user_id": "Ayotunde Odejayi",
                    "user_href": "/profile/Ayotunde-Odejayi"
                },
                {
                    "user_id": "Esh Park",
                    "user_href": "/profile/Esh-Park"
                },
                {
                    "user_id": "Eni Kati",
                    "user_href": "/profile/Eni-Kati"
                },
                {
                    "user_id": "Gerrit Bernard",
                    "user_href": "/profile/Gerrit-Bernard"
                },
                {
                    "user_id": "Danel Fentone",
                    "user_href": "/profile/Danel-Fentone"
                },
                {
                    "user_id": "Sandhya Suresh",
                    "user_href": "/profile/Sandhya-Suresh-59"
                },
                {
                    "user_id": "Fareen Qazii",
                    "user_href": "/profile/Fareen-Qazii"
                },
                {
                    "user_id": "Selma Finn",
                    "user_href": "/profile/Selma-Finn"
                },
                {
                    "user_id": "Jordan Lubus",
                    "user_href": "/profile/Jordan-Lubus"
                },
                {
                    "user_id": "Sophie Miller",
                    "user_href": "/profile/Sophie-Miller-131"
                },
                {
                    "user_id": "Miriam Fabrick",
                    "user_href": "/profile/Miriam-Fabrick"
                },
                {
                    "user_id": "Favor Mulalira",
                    "user_href": "/profile/Favor-Mulalira"
                },
                {
                    "user_id": "Del shaf",
                    "user_href": "/profile/Del-shaf"
                },
                {
                    "user_id": "Chris Wilson",
                    "user_href": "/profile/Chris-Wilson-1554"
                },
                {
                    "user_id": "Evelyn Medrano (에벨 린 메드 라노)",
                    "user_href": "/profile/Evelyn-Medrano-에벨-린-메드-라노-イヴリンメドラーノ"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Ognan",
                "href": "/profile/John-Ognan"
            },
            "answer_text": "Depending on the artist. I myself record my verses in one take. Then record the strengths on the rhyme parts. Then the ad-libs. Some artists punch in and out. ",
            "date": "Answered January 27, 2020",
            "views": "184",
            "upvotes": " Answer requested by Gerrit Bernard"
        },
        {
            "author_info": {
                "name": "Doug Washington",
                "href": "/profile/Doug-Washington-4"
            },
            "answer_text": "Thats a very good question! Simple answer though “both happens” You have some rappers so seasoned in their craft and stage ready they could do it in one take. But then you have some that are perfectionists and wants more takes and effects. Then you have the intermediate, those that needs the live takes to see which fits best for them. ",
            "date": "Answered January 24, 2020",
            "views": "288",
            "upvotes": " Answer requested by Gerrit Bernard"
        },
        {
            "author_info": {
                "name": "Stephen Jones",
                "href": "/profile/Stephen-Jones-1253"
            },
            "answer_text": "Well imma rapper I usually record verse chorus verse chorus verse chorus then I record background vocals in the same order but it takes me multiple takes just to get a verse down ",
            "date": "Answered October 23, 2020",
            "views": "49",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Angel Vega",
                "href": "/profile/Angel-Vega-24"
            },
            "answer_text": "It would depend on the artist how they want to record and the producers. Generally its all pieced together fragments. ",
            "date": "Answered August 31, 2019",
            "views": "154",
            "upvotes": " Answer requested by Gerrit Bernard"
        },
        {
            "author_info": {
                "name": "Randy Kemp",
                "href": "/profile/Randy-Kemp-14"
            },
            "answer_text": "It depends on their preferences. Both methods are acceptable. Typically though almost any non-live studio performance will use punch ins. ",
            "date": "Answered August 22, 2019",
            "views": "286",
            "upvotes": " Answer requested by Gerrit Bernard"
        }
    ]
}