{
    "title": "When you are asked about what kind of music you like, how would you respond? - Quora",
    "tags": [
        "Manners and Etiquette",
        "Social Advice",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Trent Hopkinson",
                "href": "/profile/Trent-Hopkinson"
            },
            "answer_text": "My dad loved Frank Sinatra, Tom Jones, and several other similar artists and was seeking new tunes to add to his collection of vinyl records. One of the oddities he acquired off a friend of his was a record by Jean-Michel André Jarre. It was very different to the kind of music that was normally played in our house, and captured my 4 year old imagination very well. I was permitted to play with the radio in our house, but the Vinyl collection was off limits. One night, my mum and dad were hosting a bunch of visiting family, and were having a barbecue outside in the back yard. Around the time the sun started setting, I got bored and went inside and started playing with the radio. The boring pop/rock music channels held no interest for me anymore. No, I was on a quest to find more music like Jean-Michel Jarre. So I started twisting the tuning knob, running through various channels, scanning past various rock & pop music that didn’t interest me, some talk channels which didn’t interest me, some foreign language channels that didn’t interest me, and then I heard the odd sound of a very large audience in a very big hall, applauding politely. What stuck with me was how big the hall was. How echoey the sound was, and how easily I could imagine the large space the room was where this sound was happening. A man quietly, almost whispering, said something, and I almost began scanning again, but then the sound in the hall dropped to quietness. Not silence, no. I could hear the sound of something large and metallic being dragged along a wooden floor. Some people coughing. and then a single note. That note continued for a second, before almost organically, this strange complex chord grew out of that sound. The tambre of the sound was very rich. I liked that. Lots of different sounding instruments, all very vibrant in this large space. Another applause. Another quiet, hushed announcement, and silence. Quieter silence this time. nobody moving around, no coughing. And then the softest, richest, mysterious sound emanated from those speakers. It was so intensely beautiful and different from anything I had ever heard in my life, that I almost felt guilty about it. I kept an eye on the back door, incase my parents walked in. Surely something as amazing as this would be bad. This felt like that excitement you might feel if you found a box of biscuits and cake in the drawer and started gorging yourself. I was gorging myself on the sweet sticky taste of sound. I kept turning the volume up, bit by bit, worried that at any moment, mum or dad might come bursting through the door, to see the telltale sign of chocolate smeared over my… um.. ears. Surely you would get in trouble for discovering this much pleasure out of a radio. Dad’s speakers were big expensive things. They delivered a powerful loud sound. But here they were, delivering detail. and quietness. There were ripples of colour throughout the sound. The single note was moving around and it was a tune now, but then something would pop out into the foreground. Cuckoos? Birds? Silver! a single ray of golden light splashing down and disappearing as quick as it began. I wanted that Golden Silvery sparkly sound back, but understood that it’s rarity and quiet was what made it that much more special. A chocolate morsel in a sea of cookie dough. Many years later, when I joined the Sydney Youth Orchestra, I got to play that very same piece of music from the position of 3rd Trumpet.  Gustav Mahler’s Symphony number #1 “The Titan” Cl̶a̶s̶s̶i̶c̶a̶l̶ Orchestral Art music still captures my imagination the most of any genre. My favourite being Romantic, neo-Romantic, non-serial 20th Century, and even Minimalist music for large ensemble like the works of Reich (Desert Music), Adams (Harmonelehre) etc. The more textured, the better. I also have a bit of a soft spot for EDM such as Dubstep, Electro House, Synth-Pop, Trance. But my first true love is Gustav Mahler Symphonies. I was rocking that stuff at the age of 4. ",
            "date": "Updated March 20, 2019",
            "views": "98",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dominic Stewart",
                    "user_href": "/profile/Dominic-Stewart-29"
                },
                {
                    "user_id": "Shrey R",
                    "user_href": "/profile/Shrey-R"
                },
                {
                    "user_id": "Juarez Fredrickson",
                    "user_href": "/profile/Juarez-Fredrickson"
                },
                {
                    "user_id": "Georgia Shore",
                    "user_href": "/profile/Georgia-Shore-1"
                },
                {
                    "user_id": "Tooto Aln",
                    "user_href": "/profile/Tooto-Aln"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sheri Tanner",
                "href": "/profile/Sheri-Tanner-1"
            },
            "answer_text": "When you are asked about what kind of music you like, how would you respond? I like everything except 70’s druggie, hippie or disco music. My only exception is Pink Floyd (and it’s up for debate as to whether they are drug influenced). I like at least one band or musician or composer from every genre of music. But hippie music or disco music? Ugh! Don’t go there with me. Sometimes my husband will play 70’s disco while he has me trapped in his SUV. I contemplate whether I could survive jumping out of the vehicle while he is driving at 60 miles an hour. It’s torture to my ears and he knows it. It seems my answer has always gotten me into unprovoked debates and arguments. ",
            "date": "Answered September 13, 2018",
            "views": "122",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Juarez Fredrickson",
                    "user_href": "/profile/Juarez-Fredrickson"
                },
                {
                    "user_id": "Lynn Patra",
                    "user_href": "/profile/Lynn-Patra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Natalie Price",
                "href": "/profile/Natalie-Price-22"
            },
            "answer_text": "I almost never get asked what type of music I listen to. Maybe its because our culture leans towards the norm of the mainstream radio hits and I’m situated in a bubble with the rest of the teenage society, so its already assumed I like to play the latest pop and rap songs. In the rare occasion when I am asked, I respond with a brief “ Everything, I like to listen to everything”, because I do not have taste for just one perfect genre of music. It depends what mood I’m in. I will listen to anything from classical string arrangements to trance to oldies. It all depends on what my ear feels like listening into that moment. ",
            "date": "Answered May 28, 2017",
            "views": "97",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lea Tamayo",
                    "user_href": "/profile/Lea-Tamayo-2"
                },
                {
                    "user_id": "Sakshyam Sakil",
                    "user_href": "/profile/Sakshyam-Sakil"
                },
                {
                    "user_id": "Anonym Ous",
                    "user_href": "/profile/Anonym-Ous-42"
                },
                {
                    "user_id": "Ashley Ruiz",
                    "user_href": "/profile/Ashley-Ruiz-162"
                },
                {
                    "user_id": "A Random Civilian",
                    "user_href": "/profile/A-Random-Civilian"
                },
                {
                    "user_id": "Greg Dahlen",
                    "user_href": "/profile/Greg-Dahlen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eta Wardana",
                "href": "/profile/Eta-Wardana"
            },
            "answer_text": "I like music with meaning. I listen to all kinds of genre. Pop is a must. Ballad always comes and goes. Country, well, it’s enchanting! I listen to rock when I have bad day. I go over my hip hop songs list whenever I want something exciting. When studying, I always play classsics or jazz. And there are many other genres that I can’t mention one by one because first, I don’t know their name, and two, sometimes it’s too difficult to categorize. But one thing that my favourite songs have in common: they are always meaningful to me. There is always reason why I download or buy them in the first place. ",
            "date": "Answered June 1, 2017",
            "views": "175",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yvone Sai",
                    "user_href": "/profile/Yvone-Sai"
                },
                {
                    "user_id": "Dominic Stewart",
                    "user_href": "/profile/Dominic-Stewart-29"
                },
                {
                    "user_id": "Siti Shafini Kadri",
                    "user_href": "/profile/Siti-Shafini-Kadri-1"
                },
                {
                    "user_id": "Híràk Gögøi",
                    "user_href": "/profile/Híràk-Gögøi"
                },
                {
                    "user_id": "Juarez Fredrickson",
                    "user_href": "/profile/Juarez-Fredrickson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lucca",
                "href": "/profile/Lucca-12"
            },
            "answer_text": "I don’t think I’ve ever actually been asked this question before, but if someone asked me I would definitely say punk pop and indie without hesitation, however I my music taste is quite erratic really. My iPod has got everything from old Taylor Swift albums to Twenty One Pilots, AC/DC, Elvis Presley, Bowling For Soup and Imagine Dragons on it. So really, I suppose that my answer is that I like most types of music. ",
            "date": "Answered May 30, 2017",
            "views": "95",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Christin Alipe",
                    "user_href": "/profile/Christin-Alipe"
                },
                {
                    "user_id": "Callum Sutherland",
                    "user_href": "/profile/Callum-Sutherland-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Atharv Shah",
                "href": "/profile/Atharv-Shah-5"
            },
            "answer_text": "I usually don’t really know how to answer because everything I listen to is different mostly from each other. But I would say I prefer kind of indie and alt sounds more than most. I also love gospel music a lot and anything with any kind of brass is good for me. But there are still so many artists that I love that I can’t write down all of them in a limited space ever. ",
            "date": "Answered September 17, 2020",
            "views": "275",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dan Burge",
                "href": "/profile/Dan-Burge-1"
            },
            "answer_text": "I respond to people quickly, everything accept rap and top 40 list xD However, if you go into detail i like rock,indie, heavy rock,electro rock,classic rock, heavy metal, nu metal, screamo, avante garde, electronic, cyberpunk, edm, house, dance, trance, phsycadellic, disco, funk,ska, blues hip hop! ",
            "date": "Answered May 28, 2017",
            "views": "41",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Danielle Marigold",
                    "user_href": "/profile/Danielle-Marigold"
                },
                {
                    "user_id": "Aryaman Jai",
                    "user_href": "/profile/Aryaman-Jai"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kristin Leitner",
                "href": "/profile/Kristin-Leitner"
            },
            "answer_text": "I usually respond with something along the lines of, “Obscure alternative electronic rock.” To which the usual reply is, “Oh. Uh, okay.” ",
            "date": "Answered May 28, 2017",
            "views": "17",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Adma4Real"
                },
                {
                    "user_id": "Travis Seel",
                    "user_href": "/profile/Travis-Seel"
                }
            ]
        },
        {
            "author_info": {
                "name": "McKenna Christensen",
                "href": "/profile/McKenna-Christensen"
            },
            "answer_text": "I like pretty much all music except for country and most rap. Unless the rap is Hamilton or Twenty One Pilots. ",
            "date": "Answered May 28, 2017",
            "views": "490",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ava Williams",
                "href": "/profile/Ava-Williams-62"
            },
            "answer_text": "Usually I'd say rock music just in general, but to be more specific I say new wave, post hardcore, post punk, art pop, art punk, indie folk, indie rock and singer songwriter 🐻 ",
            "date": "Answered October 10, 2020",
            "views": "104",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "BreAnna Massey",
                "href": "/profile/BreAnna-Massey-2"
            },
            "answer_text": "Tupac, Dr.Dre, Bone Thugs & Harmony ",
            "date": "Answered June 26, 2018",
            "views": "24",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Noah Topping",
                    "user_href": "/profile/Noah-Topping"
                }
            ]
        },
        {
            "author_info": {
                "name": "Victory Vee",
                "href": "/profile/Victory-Vee"
            },
            "answer_text": "Korean. Music. KPOP:) ",
            "date": "Answered May 28, 2017",
            "views": "44",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sarah Tubon",
                "href": "/profile/Sarah-Tubon"
            },
            "answer_text": "I don’t. ",
            "date": "Answered May 28, 2017",
            "views": "397",
            "upvotes": "0"
        }
    ]
}