{
    "title": "When musicians release recordings of live performances, how is the recording quality or anything good enough for listening to? - Quora",
    "tags": [
        "Recording",
        "Music Recording",
        "Live Music",
        "Audio Recording",
        "Music Production",
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "James O'Toole",
                "href": "/profile/James-OToole-14"
            },
            "answer_text": "I’m currently mixing a live performance by a band and it has been an interesting experience. The live tracks were recorded directly from the monitor desk, a digital desk that allows the signals from the stage microphones on each instrument to be routed to a MADI interface. This interface can then send the separate tracks to a USB connection, which can be recorded with a computer, by selecting the MADI interface as the audio interface and then assigning the inputs to separate tracks. I then recorded the separate tracks simultaneously into Logic Pro X so they could be mixed later to create a good quality recording. With this particular three piece band there were 15 tracks including vocals, nine drum mics, two bass tracks (one mic, one direct in from the amp), two guitar mics and a spare stage mic. I also recorded crowd noise with a portable digital recorder separately to blend in with the performance later. There some limitations and problems to solve when mixing a live recording. There is a lot of bleed in many of the microphones from other instruments, like guitar being picked up by the vocal mic, which need to be dealt with to make everything blend together well. However, this bleed also helps give the recording energy and a live feeling once treated appropriately. ",
            "date": "Answered November 8, 2019",
            "views": "83",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Franklin Nwora",
                    "user_href": "/profile/Franklin-Nwora"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Davis",
                "href": "/profile/Steve-Davis-774"
            },
            "answer_text": "Not certain what you mean, the question is unclear but as an example, Jackie Evancho has among many other superb performances released three PBS Great Performaces concerts which are available on DVD and also CD as both studio and live recordings. She is so damned good that the only difference is the applause on the live performances. Just one example and no, she will absolutely not, under any circumstances, permit autotune or lipsynch. She just doesn’t need it.  ",
            "date": "Answered November 8, 2019",
            "views": "75",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Sandoz",
                    "user_href": "/profile/David-Sandoz-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Virgil",
                "href": "/profile/David-Virgil-1"
            },
            "answer_text": "Listen to the Bob Seger and the Silver Bullet Band Live Bullet album and that will give you an idea just how good a live album can sound. The songs he did live sound better than the studio versions.  ",
            "date": "Answered November 14, 2019",
            "views": "20",
            "upvotes": " Answer requested by Franklin Nwora"
        },
        {
            "author_info": {
                "name": "Richard Scherer",
                "href": "/profile/Richard-Scherer-2"
            },
            "answer_text": "Many big time hit records were recorded live. For small time cut gigs the recording sounds better when the input signal is output from the mixing board by a competent engineer. ",
            "date": "Answered November 11, 2019",
            "views": "6",
            "upvotes": " Answer requested by Franklin Nwora"
        }
    ]
}