{
    "title": "When we're playing piano, do we really need to follow the fingering as written on the piece? - Quora",
    "tags": [
        "Learning Piano"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mohab Sameh",
                "href": "/profile/Mohab-Sameh"
            },
            "answer_text": "Yes and no. Fingerings are supposed to help you but if you find them difficult (and sometimes even ridiculous!) then simply don't and devise your own. But always bear in mind certain considerations regarding fingering: In general, the easiest and most efficient fingering is the most desirableIn technical exercises or etudes, it is important to follow the notated fingering since it's probably devised to train certain fingers.In more advanced piano playing, each finger can be employed for certain effects. For example: The left thumb is often employed to emulate a singing effect in the bass. The right pinky controls voicing etc..",
            "date": "Answered August 7, 2015",
            "views": "535",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tracey Edgar",
                "href": "/profile/Tracey-Edgar"
            },
            "answer_text": "Basically, no. You can choose whatever works for you. However, there are some standards which are advisable to follow, especially in an exam situation. For example, the expectation is that repeated notes use different fingers. This is to enable control over each notes and to prevent tightening up. Scales and arpeggios also have standard fingerings. ",
            "date": "Answered August 7, 2015",
            "views": "388",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lily Aleksey",
                "href": "/profile/Lily-Aleksey"
            },
            "answer_text": "Absolutely not. The written fingerings are suggestions only. You are free to use whatever fingering works best for you. Sometimes the written ones are excellent and sometimes they are terrible. ",
            "date": "Answered May 22, 2015",
            "views": "212",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tracey Edgar",
                    "user_href": "/profile/Tracey-Edgar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emmanuel Gofer",
                "href": "/profile/Emmanuel-Gofer"
            },
            "answer_text": "That's just a guide to the piece on how you should play. It's usually for beginners. Learn your own fingering(use all fingers, don't leave one out, let them all feel the ivories). Everyone and his/her style. ",
            "date": "Answered May 26, 2015",
            "views": "215",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tracey Edgar",
                    "user_href": "/profile/Tracey-Edgar"
                }
            ]
        }
    ]
}