{
    "title": "When I play high notes on trumpet, they just come out as air, how do I fix this? - Quora",
    "tags": [
        "Trumpet (instrument)",
        "Trumpet Playing",
        "Trumpets",
        "Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jack Pantaleo",
                "href": "/profile/Jack-Pantaleo-1"
            },
            "answer_text": "Air velocity creates lip vibration which creates a pitch in the harmonic series. Considering the amount of time you have put into trumpet I wouldn't just assume that a d or an e is as easy as you'd think. If you went out onto a stage in front of a symphony crowd, would you be able to confidently hit an E that the public would approve of? If no, then you aren't fully capable of that range. If after only two years of practice your range is SOLID to an E, get in touch with Wayne Bergeron or some other lead player. Now to address your problem. There are multiple possibilities: -You could be blowing so hard that it's blowing your embochure open and the lips are too far apart to strike a tone with the volume of air you are using. -If you tense up the lip muscles too much, it prohibits them from vibrating freely -You could actually be under shooting the note. If you know you're set for the note well from an embochure perspective, then the air can signal not enough of it to strike the tone you're trying for. This is kind of a hard concept to understand. To play a loud high note you need a big volume of air moving very fast. To play a quiet high note you need less commune to move at the same speed. This happens a lot in bigband. If you are set to play a high note really loud, you're going to have the lips farther apart than if you were to play it quietly. Due to this, you need a ton of air to get the note to speak. Any quantity less than the quota that is needed will just cause air to go between the lips because the formula is not being satisfied. ",
            "date": "Answered November 3, 2016",
            "views": "56",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dan Vincent-Schaub",
                    "user_href": "/profile/Dan-Vincent-Schaub"
                },
                {
                    "user_id": "Nzmaster",
                    "user_href": "/profile/Nzmaster"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gabriel Greiling",
                "href": "/profile/Gabriel-Greiling"
            },
            "answer_text": "Warm up properly. Start with low notes, long and slow. After this, start to play notes with different fingerings quickly, staying in the low range. Move up to the middle range, continuing to alter fingerings. Start to do lip slurs in the middle and low ranges. End your warm up with a scale or two. Do NOT warm up in the very high ranges. Stay at least a half-octave below the highest note you can play. Know your limits. If you have to squeeze your trumpet against your lips to play high, then don’t play high. Continue to practice at the highest range that you can play without squeezing. In about a month or so (depending on how high the note is), you should be able to reach that high note without squeezing your trumpet against your lips. Use more air. I’m sure you’ve become very irritated by this answer before, but it really does help. If you use more air, then the tone will come out a lot more clear. If you have to take extra breaths during a song because of this, that’s okay. Tone quality comes before anything else. If you have any more questions, just ask! ",
            "date": "Answered December 7, 2017",
            "views": "18",
            "upvotes": "0"
        }
    ]
}