{
    "title": "Where can I buy old and obsolete gramophone LP records for some other purpose? - Quora",
    "tags": [
        "Gramophone",
        "Obsolete Technologies",
        "Vinyl Records",
        "Records",
        "Obsolescence",
        "Collector's Items "
    ],
    "response": [
        {
            "author_info": {
                "name": "Eric Johnson",
                "href": "/profile/Eric-Johnson-774"
            },
            "answer_text": "Well I don't know where you're at, but out here in California where I am I've seen a lot of them being sold in antique stores but not so much for themselves but as something to play on the old Gramophone record players their selling. I know I've got around a hundred or so of them. Some are recordings I know, others…. not so much. But unless you're looking for specific pieces I expect you should find the. Without much trouble. I would warn you off of one thing though. Even if you've got a regular turn table that plays 78rpms, be careful about what you play those platters in. Spinning some of them on the old Gerrard, RCA or whatever turntable you might be tempted to use. You can really tear up your stylus, needle…. whatever you're using in those things. They're fine on those old players that are meant for them they use a stylus that's pretty much a carpet nail but just be careful otherwise.  ",
            "date": "Answered August 24, 2020",
            "views": "39",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Patrick Rehbine",
                "href": "/profile/Patrick-Rehbine"
            },
            "answer_text": "those suburban flea markets/country corner stores have them often and will also have the edison diamond play disc as well. check to see if you have vintage radio shows in your area as they have fun stuff like that as well. ebay is also a great place too. ",
            "date": "Answered August 24, 2020",
            "views": "4",
            "upvotes": "0"
        }
    ]
}