{
    "title": "Where do I start if I want to produce music? - Quora",
    "tags": [
        "Music Production",
        "Music Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Montgomery Moore",
                "href": "/profile/Montgomery-Moore-1"
            },
            "answer_text": "In my opinion, the term producer gets thrown around way to much now. A true producer is someone who has a lot of knowledge in the full “production” of music. From general musical composition knowledge to songwriting and most importantly, know what sounds go together that serves the song. So to become a producer, you would need to start with composing songs and music. Have a knack for how to build a composition where the spectrum of sound is complete. Have a great ear for eq and how to make the music complete from the lows to kids to highs. Think of songs like buildings. Start with a good foundation of a beat and bass and build up. Probably the biggest mistake amateurs make is over complicating or not having an ear for eq. Even if it is beatmaking or completely tracking and mixing… it’s a producer who makes the music sound the best it can. Where to start… there are a lot of great DAWs out there. FL studio- great beat maker platform Ableton- great workflow and integration with cool controllers such as push Logic Pro- my personal preference. Great overall array of editing tools as well as a great sound library. Protools- a beast of a program with great 3rd party add ons. Industry standard. Although I would say not a great choice for a beatmaker type. Reason- I have no personal experience but have heard great things.. You get what you pay for! If you want high quality sound, a lot of times you need the gear or hardware to achieve that. Universal Audio….must have for the latest technology for quality production. But you will soon find yourself going down a rabbit hole of spending a lot of money to chase a dream sound. Also, do t forget to consult with good mixing and mastering engineers. They can make something go from blah to exciting and a lot of times can be the best money you spend in production. It also can be a way to make average recording equipment sound really good by using some high quality mixing hardware, plugins, that you won’t have to buy. regardless, a Producer takes the right sounds to make the music or song pop. A friend of mine is a great musician and someone I would call a real producer. He listened to one of my songs I wrote and stopped me in the middle of it… the hook went from a long line to a single word… and he couldn’t have been more dead on. Sometimes less=more. And a producer knows that. Rick Ruben said he was not a music producer but a music reducer! However you get it done that works for you is the best way. A good producer is someone who knows how to make music sound good and what it takes to do that. ",
            "date": "Answered April 13, 2018",
            "views": "17",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Dhruva Malekar",
                    "user_href": "/profile/Dhruva-Malekar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrae Palmer",
                "href": "/profile/Andrae-Palmer"
            },
            "answer_text": "It all depends on the type of music production you want to do. If its edm production ladeback luke has a video on youtube that outlines the process which makes it easier to develop your skills. just to go over it here: Start by doing edits to tracksThen move on to making bootlegsThen move on to doing mashupsthen start making your own original tracksalong the way get a better understanding of arrangement and sound design and mixing and all the things needed to make a release ready track. Once you have a track that is ready for the public send it to friends and get feedback about your music and build a fan base overtime. This will help you build demand for your work and give you leverage when you start shopping tracks to labels. If its pop music production or you want to produce a band and vocalist and so forth the process is a bit different. First you’ll need a space to do recording, you can pay for studio time or you can build your own studio.Next thing you need to understand what makes a good song and the basic arrangement structures for your genre. This will help you make decisions about an artist song and what it needs to take it to the next level so it can work for its indented listeners. This involves cutting or adding stuff to the song or even changing the order of lyrics etc.Then the final bit is project management to ensure that things get done on time on budget as well as hiring the right people to do the right job.You don’t have to be a musician to be a producer you just have to know what you want and get the right people to get it done. Because in essence you are producing a piece of music. The early producers had a good ear and know good music they didn’t know how to play anything. So in conclusion to start your career you’ll need to do: Find and artist who has a songGet a beat produced for the songWork on the song so its good and the artist knows the lyrics by heartRecord it whether at your own studio or someone elsesGet the song mixed and masteredWhen you have the final master you essentially just produced your first song.Do it long enough to build a portfolio and eventually a career. PS. It wont hurt hanging around local studios to get a foot in and meet people, the key is to be helpful and bring something to the table because you never know. ",
            "date": "Answered August 16, 2017",
            "views": "697",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Colleen Middlebrooks",
                    "user_href": "/profile/Colleen-Middlebrooks"
                },
                {
                    "user_id": "Moshe Klein",
                    "user_href": "/profile/Moshe-Klein-2"
                },
                {
                    "user_id": "Chris Roy",
                    "user_href": "/profile/Chris-Roy-87"
                }
            ]
        }
    ]
}