{
    "title": "Where do I find music producers? - Quora",
    "tags": [
        "Music Producers",
        "Music Production"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arjun Asthana",
                "href": "/profile/Arjun-Asthana"
            },
            "answer_text": "Where do you find music producers? Okay I will break this down into finding someone you can work with locally and someone you can work with online. Local Area: You could find and approach recording studios in your area; they would probably be able to offer services like beat-making, recording, mixing and mastering. Alternatively you go to concerts and events and network with the people doing the sound. They may be able to get you in touch with a music producer.Social Media: Instagram hashtags like musicproductionstudio, musicproductioncompany, beatmakers, musicproducers, etc can be used to find music producers. Facebook, Twitter, Linkedin can also help find people.SoundBetter: SoundBetter is an amazing pool of professionals and studios that work remotely from their location and deliver work online. Here you can hear work by various producers, send them your rough scratch and mutually figure out who to work with. This is our SoundBetter profile in case you’d like to work with us: Mystic Alankar on SoundBetterAirGigs: Airgigs is also similar to SoundBetter but the work ecosystem and the kind of clients and service providers is a little different. This is also a great way to work with someone online. There are various other websites like the ones I mentioned above if you’re okay with working with a music producer online.Its important to have a plan for what you’re going to do with the music, i.e how you’re going to use it and what your marketing and promotional plans are. Terms like copyright, song ownership, licensing, side artists, session musicians, royalty splits, work for hire, credited work, ghost production and so on will often need to be discussed beforehand so its good to have an idea of what these things really mean before you get started. Good Luck! ",
            "date": "Answered September 20, 2018",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paddy Hunt",
                "href": "/profile/Paddy-Hunt"
            },
            "answer_text": "I would suggest finding out who has produced songs of some local artists you like. You could then more than likely find them on Twitter or Instagram and send them a message to open up contact. If you’re not pushed on finding a local producer and you have the ability to send a producer stems of audio for them to produce a track around then you can think international! A lot of great producers are based in the major music cities such as LA, New York and London. So for example, google ‘music producers in London’ and then try and contact some of the people that appear in the search. There are also a lot of great music producers answering questions here on Quora. Click on their profiles and there might be a link to their website where there would be their contact details and examples of the music they produced. For example I have my own website Paddy Hunt | Music Producer | London (UK) where I have my email visible as well as a Spotify playlist of my work. Best of luck in your search! ",
            "date": "Answered November 21, 2017",
            "views": "18",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sri Aditya Devaguptapu",
                    "user_href": "/profile/Sri-Aditya-Devaguptapu"
                }
            ]
        }
    ]
}