{
    "title": "Where can I find gear that'll turn my passive pickups into active? - Quora",
    "tags": [
        "Guitar Pickups",
        "Electric Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Subhankar Das",
                "href": "/profile/Subhankar-Das-12"
            },
            "answer_text": "You’ll need to wire an active preamp with your pickups in order to make them work like active pickups. Guitar Fetish (GFS) makes active preamp named Neovin PRE-1 Active preamp. However there’s are limitations to this approach. Limtation 1: In order to work properly you guitar should have only one master volume for both pickups. This master volume needs to be replaced with the Neovin PRE-1 Active preamp unit containing its own master volume. So it ain’t gonna work on guitars with separate volumes for each pickup, like a Les Paul. On such guitars you would need to rewire the whole guitar to have only one master volume.You’ll also need to replace the tone knob with a lower impedance tone knob.Limitation 2: It doesn’t work with pickups that have an impedance value above 10kΩ. On high impedance pickups the whole preamp clips and makes the sound muddy, noisy and unclear. Unfortunately most passive pickups barring a few low-output ones tend to have an impedance value of 12kΩ or above.Limitation 3: It won’t reduce the noise of your pickup. Low noise active humbuckers like Fishman Fluence and EMG RetroActive pickups have their impedance around 2kΩ to 3.5kΩ. No passive pickups, not even the lowest output passive pickups have such ridiculously low impedance. Even low output P.A.F. humbuckers have an impedance around 7kΩ to 8kΩ. Adding the active preamp to your passive pickup won’t reduce its noise. On the contrary it’ll add even more noise because after adding it you’ll have the preamp noise add up to your pickup noise.Limitation 4: It isn’t exactly a high quality preamp. Compared to the preamps found on Fishman Fluence, EMG and Seymour Duncan Blackout pickups these sound utterly mediocre.Limitation 5: It won’t enhance your sustain. Active pickups offer more sustain purely because they use extremely weak magnets. Even among active pickups the pickups with highest sustain are the ones with ridiculously low impedance like Fishman Fluence and EMG RetroActive pickups because they have the weakest magnets among all pickups. Normal active pickups aren’t anything stellar in terms of sustain though.The thing is that all passive pickups barring a few use strong magnets that have substantially more string pull than active pickups. So no matter what you do your sustain won’t be enhanced.Instead of going for that mediocre quality preamp I’ll suggest you the following solutions: Solution 1: If you want to do this mod just for better high gain tone then forget it. Get the DiMarzio D-Activator set and put them in you guitar. They are specially voiced to perfectly replicate the tonality of the EMG 81 (bridge) and 85 (neck) set. They also feature tight wound precision matched coils which keeps their noise level same as the EMG 81 and 85 set. Even their output is same as the EMG 81 and 85 set but since they are passive pickups they have way better dynamics than the 81 and 85 set. With impedance ratings of 11.41kΩ for the bridge pickup even its string pull is actually pretty close to an EMG 81 pickup. So they even have pretty similar sustain. The neck pickup on other hand uses a weaker magnet than the EMG 85 and has an impedance of just 7.22kΩ. Hence it has lesser string pull than the EMG 85 pickup and offers better sustain.They can do everything that the EMG 81 and 85 set can do but the 81 and 85 set can’t do the stuffs that the D-Activator set can do. The D-Activator can be coil split and it cleans up nicely when you roll back the guitar volume. Those are things that the EMG 81 and 85 set can never do.They even cost lesser than the EMG 81 and 85 pickups.Solution 2: If you want everything, i.e., high gain tone, low noise, and high sustain then forget normal pickups and get the Lace Alumitone Deathbucker (bridge) and Alumitone Humbucker (neck) set. They are passive pickups but they use a completely different design from traditional pickups. The Alumitone Deathbucker has a impedance of 5kΩ while the Alumitone Humbucker has a impedance of 3.4kΩ.Although the bridge pickup measures around 5kΩ but due to its unique construction its string pull is even lesser than a Fishman Fluence pickup. Truth be told they have almost zero string pull. As far as noise is considered it’s a one of a kind zero noise pickup. That’s a feat that haven't been achieved even by active pickups. Right now the Alumitone pickups are the only pickups that have achieved that feat.Not only their tone is way beefier than EMG 81 and 85 set and Seymour Duncan Blackout set but they also belong to a league of their own in terms of articulation and tightness. The level of articulation and tightness they achieve is impossible to achieve on traditional passive and even active pickup designs. They look really odd though and they also cost more than EMG and Seymour Duncan Blackout pickups.Solution 3: Take your guitar to an experienced luthier. Get it routed to put the battery compartment for active pickups and get active pickups installed on your guitar.",
            "date": "Updated August 5, 2020",
            "views": "145",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Edward Banning",
                    "user_href": "/profile/Edward-Banning"
                },
                {
                    "user_id": "Torbjorn Arntsen",
                    "user_href": "/profile/Torbjorn-Arntsen"
                },
                {
                    "user_id": "Ebenezer Meclaren Palli",
                    "user_href": "/profile/Ebenezer-Meclaren-Palli"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Gobat",
                "href": "/profile/Paul-Gobat"
            },
            "answer_text": "Active pickups are made VERY differently than passive models so you can’t “make” passive pickups into active. No matter what you do they will never sound the same. You COULD add an active eq/preamp to your guitar without too much problem… be well aware that I have removed almost every one of these that I installed for customers because they make the guitar sound like shit.  ",
            "date": "Answered February 12, 2020",
            "views": "97",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amrit Janardhanan",
                    "user_href": "/profile/Amrit-Janardhanan-1"
                },
                {
                    "user_id": "Subhankar Das",
                    "user_href": "/profile/Subhankar-Das-12"
                },
                {
                    "user_id": "Dennis Walter",
                    "user_href": "/profile/Dennis-Walter"
                },
                {
                    "user_id": "Michael Vincent",
                    "user_href": "/profile/Michael-ONial"
                },
                {
                    "user_id": "Luis Doriocourt",
                    "user_href": "/profile/Luis-Doriocourt"
                },
                {
                    "user_id": "Ebenezer Meclaren Palli",
                    "user_href": "/profile/Ebenezer-Meclaren-Palli"
                }
            ]
        }
    ]
}