{
    "title": "Where is the best place to buy K-Pop albums online? - Quora",
    "tags": [
        "K-Pop Albums",
        "Online Shopping Recommendations",
        "K-Pop",
        "Online Shopping"
    ],
    "response": [
        {
            "author_info": {
                "name": "ᜐ᜔ᜆᜒᜉᜒ / Stephie",
                "href": "/profile/ᜐ᜔ᜆᜒᜉᜒ-Stephie"
            },
            "answer_text": "I have used a total of five websites. YesAsia, Kpoptown, Mwave, eBay, and ChoiceMusicLa. YesAsia is a good website to use if you want to order multiple albums because of your order reaches the limit you could get your shipping for free. However the albums take almost three months to arrive. I haven’t ordered from them in years so I’m not sure if they managed to offer faster shipping. Kpoptown offers cheap album prices and they often offer freebies with your purchase. Their shipping is reasonable for the price of the albums that they have offered. Mwave is the website I rely on when I want to buy signed albums. The shipping on this website varies since they need to wait until all albums that were ordered get signed by the artists. They also offer albums that aren’t signed. ChoiceMusicLA is my favourite shop to use and I really like their customer engagement. They also offer freebies when they can, however they are America based and only ship within the country. That being said, their shipping is the cheapest. eBay is is a hit or miss. I’d say use it as a comparison to the websites I’ve listed above. I would recommend looking at the reliability of the shop in their reviews. They are generally good. Other websites I’ve seen but haven’t tried are: ktown4u, catchopcd. Good luck with your purchases :) ",
            "date": "Answered December 6, 2018",
            "views": "2",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ananya Nair",
                "href": "/profile/Ananya-Nair-3"
            },
            "answer_text": "From what I've seen, KTOWN4U (previously known as DVDheaven) by far. I sat down with my computer one day and did calculations for buying a few albums separately and together from Amazon, Ebay, YesAsia, CDJapan, KpopMart, KpopTown and KTOWN4U and the last was consistently the cheapest in both product price and shipping. Personally I've only ordered from Amazon and KTOWN4U and both provide great packaging (Amazon less so, however) and fast shipping. The amount of things I've heard about slow shipment, damaged products and some people not even getting half the things they've ordered from YesAsia, KpopMart and KpopTown is ridiculous! As far as I know KTOWN4U customers have never had a problem like that, and I definitely haven't. They also (albeit very rarely) allow you to choose what photocard you get in your album before you purchase, as long as stocks last, which I think is great. In addition, there's also competitions and giveaways once in a while so that's something you can participate in. Hope that helps! ",
            "date": "Answered August 14, 2015",
            "views": "6",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Isis Flores Lechuga",
                    "user_href": "/profile/Isis-Flores-Lechuga"
                },
                {
                    "user_id": "Tina Nguyen",
                    "user_href": "/profile/Tina-Nguyen-639"
                },
                {
                    "user_id": "Isabel Li",
                    "user_href": "/profile/Isabel-Li-22"
                },
                {
                    "user_id": "Amia Delaney",
                    "user_href": "/profile/Amia-Delaney"
                },
                {
                    "user_id": "Maryam",
                    "user_href": "/profile/Maryam-305"
                },
                {
                    "user_id": "Kyomie Kapper",
                    "user_href": "/profile/Kyomie-Kapper-2"
                },
                {
                    "user_id": "Joeila Baduria",
                    "user_href": "/profile/Joeila-Baduria"
                },
                {
                    "user_id": "Cara Chen",
                    "user_href": "/profile/Cara-Chen-27"
                },
                {
                    "user_id": "Cassy King",
                    "user_href": "/profile/Cassy-King-4"
                },
                {
                    "user_id": "Idil .A.",
                    "user_href": "/profile/Idil-A-4"
                },
                {
                    "user_id": "HINA PARVEEN",
                    "user_href": "/profile/HINA-PARVEEN-50"
                },
                {
                    "user_id": "Tsuki Moon",
                    "user_href": "/profile/Tsuki-Moon-4"
                },
                {
                    "user_id": "Ioana Maddie",
                    "user_href": "/profile/Ioana-Maddie"
                },
                {
                    "user_id": "Amalia Aisyah",
                    "user_href": "/profile/Amalia-Aisyah"
                },
                {
                    "user_id": "Sharanya",
                    "user_href": "/profile/Sharanya-52"
                }
            ]
        }
    ]
}