{
    "title": "Where can I learn Carnatic style violin in Bangalore? - Quora",
    "tags": [
        "Carnatic Classical Music",
        "Learning Violin",
        "Violins"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ramdas Mozhikunnath",
                "href": "/profile/Ramdas-Mozhikunnath"
            },
            "answer_text": "Indiranagar Sangeetha Sabha conducts carnatic violin classes for group of students- has separate weekend and weekdays (evenings) with 2 classes per week. Interested students (kids and adults) can take admission twice a year - in March/April and Oct/Nov. I spend about 6 years at this music school and was fun. You also get to hear monthly concerts and other music programs from famous artists - all free as being students !If you are in South of Bangalore - there is also Vijaya school of music - run by famous violinist - H K VenkatramAnd if you are part of North Bangalore , there is Subramaniam Academy of Performing Arts - founded by Dr L Subramaniam. This is a school in high demand and have several batches and teachers. As far as I know admissions need advanced reservations.And then there are several other individual performers and teachers who would conduct individual/small group classes which are highly recommended after a few years of basic lessons. ",
            "date": "Answered November 21, 2016",
            "views": "25",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shreesha PG",
                    "user_href": "/profile/Shreesha-PG"
                },
                {
                    "user_id": "Deepika Nithin",
                    "user_href": "/profile/Deepika-Nithin"
                },
                {
                    "user_id": "Bharathwaj Muralidharan",
                    "user_href": "/profile/Bharathwaj-Muralidharan"
                },
                {
                    "user_id": "Vanya Kashyap",
                    "user_href": "/profile/Vanya-Kashyap"
                },
                {
                    "user_id": "Suresh Kumar Meesala",
                    "user_href": "/profile/Suresh-Kumar-Meesala-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "WeGotGuru",
                "href": "/profile/WeGotGuru-1"
            },
            "answer_text": "Hi there, As Violin is known as a difficult instrument to master, it is always advisable to learn it directly from a teacher in a music school than take online/skype classes. In South Bangalore, we have WeGotGuru located on the Haralur road. We have some efficient and effective teachers who take classes for both Carnatic as well as western Violin. We have separate batches for kids and adults and some superior quality Violins to practice on. There are mostly 3 students present in a batch so that the teacher could focus on each individual. In case you miss a class, compensation classes would be provided. We have a peaceful ambiance around with many rooms for students to come and practice even outside their regular sessions. If you want to make sure we deliver what we promise, just come and take a demo class before making the final decision to join our school. ",
            "date": "Answered June 15, 2019",
            "views": "528",
            "upvotes": "0"
        }
    ]
}