{
    "title": "Where can I find datasets for machine learning? - Quora",
    "tags": [
        "Datasets",
        "Big Data Analysis",
        "Data Mining",
        "Data Analysis",
        "Big Data"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Nguyen",
                "href": "/profile/Alex-Nguyen-264"
            },
            "answer_text": "You can look into online sources where you can find publicly available datasets (Kaggle, for example). A lot of research groups also share labeled datasets with the community to further machine learning research. However, every dataset is unique in terms of its content. The trouble with public datasets is finding ones that are useful or suitable for your model. If you have the resources, or custom requirements for your data, outsourcing dataset creation or annotation to a crowdsourcing website is probably your best bet. That way, you can get large volumes custom training data quickly and at scale. At my company, Lionbridge AI, our mission is to make it easy to generate labeled data for machine learning algorithms. We cover a wide range of use cases including translation, data categorization, sentiment analysis, content moderation and more. Lionbridge manages the whole process from start to finish, from designing the workflow to sourcing the right workers. ",
            "date": "Updated October 18, 2019",
            "views": "11",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lara Fernández",
                    "user_href": "/profile/Lara-Fernández"
                },
                {
                    "user_id": "Chikara Shimizu",
                    "user_href": "/profile/Chikara-Shimizu-1"
                },
                {
                    "user_id": "James Hirodo",
                    "user_href": "/profile/James-Hirodo"
                },
                {
                    "user_id": "Matthew Skyrm",
                    "user_href": "/profile/Matthew-Skyrm"
                },
                {
                    "user_id": "Emma Ziker",
                    "user_href": "/profile/Emma-Ziker"
                },
                {
                    "user_id": "Rhea Tagami",
                    "user_href": "/profile/Rhea-Tagami"
                },
                {
                    "user_id": "Wolfcastle Rainie",
                    "user_href": "/profile/Wolfcastle-Rainie"
                },
                {
                    "user_id": "Matthew Romaine",
                    "user_href": "/profile/Matthew-Romaine"
                },
                {
                    "user_id": "Olga Kuchuk",
                    "user_href": "/profile/Olga-Kuchuk"
                },
                {
                    "user_id": "Gábor Beján",
                    "user_href": "/profile/Gábor-Beján-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Soumyadeep Roy",
                "href": "/profile/Soumyadeep-Roy-4"
            },
            "answer_text": "Google has developed an awesome search tool for this very purpose. List of databases that are recently published ICLR OpenReview 2019 web pages [Link1]FIRE -Forum of Information Retrieval India involving multi-lingual languages [Link]UCI Machine Learning Repositoryhttps://archive.ics.uci.edu/ml/d...Carnegie Mellon University – Machine Learning Course Projects, Spring 2015 http://www.cs.cmu.edu/~ninamf/co..., Fall 2010, http://www.cs.cmu.edu/afs/cs/aca...Awesome-public-datasets and Awesome-machine-learning in GithubACL Knowledge datasets and collectionsLinguistic Data Consortium CatalogThe Dryad Digital Data RepositoryKaggleGoogle: Machine Learning Student projects based on Natural Language Processing.Avocado Research Email Collection and Enron Email DatasetFiveThirtyEight DataThis blog post gives links to many available datasetsSource: My Blog article Note: I have also given this same answer to a similar Quora question. ",
            "date": "Answered January 6, 2019",
            "views": "564",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kamar Hamzah",
                    "user_href": "/profile/Kamar-Hamzah"
                },
                {
                    "user_id": "Rishabh Soni",
                    "user_href": "/profile/Rishabh-Soni"
                }
            ]
        }
    ]
}