{
    "title": "Where do I buy a BTS merchandise? - Quora",
    "tags": [
        "Merchandise"
    ],
    "response": [
        {
            "author_info": {
                "name": "Terrie Oja",
                "href": "/profile/Terrie-Oja"
            },
            "answer_text": "Due to their immense popularity getting true merchandise with their official label, is like getting your hand on priceless gems. But it ultimately comes down to what you are looking for and how you want to get it. If you like to order things online, here’s a few ways to do that: • The official BigHit website is a good place to watch for items (because this is one of the few trusted sources for BTS merch since it’s their official company , items sell out VERY quickly so make sure to keep watching and following social media for updates) Big Hit Shop | 빅히트샵 EDIT( BIGHIT SHOP NO LONGER EXISTS, BUT NOW THEY USE AN APP CALLED WEPLY FOR ALL THEIR MERCHANDISE) •You can use other websites that specialize in kpop merch and albums but do your research before you buy from them so you know their a trusted source and won’t get ripped off. I myself haven’t had any issues so far luckily. A few options I use are Cokodive (my most trusted website for getting authentic BTS merch… I bought my army bomb from them that I used for the concert… can be a bit pricey but shipping is included), Kpopmart, Ktown4u, btsmaniashop( now this is more for collecting if you just want BTS merch in general. If your looking for completely authenticity I’m not sure how much of their items are real or not, but I’ve bought lomo cards and and other merch from them and I love them… but just keep that in mind when shopping from them), and Hallyumart. Those are a few I shop from! •Make sure to follow fellow Army’s as well on social media like Instagram and Twitter as I’ve met some incredible artists who have created enamel pins, paintings, photo cards, shirts, etc and they do little pop up shops and some of the items are soo cool. Plus you have the ability to say you have a one of a kind item because not many people make them. A lot of people go CRAZY for this kind of merch ( myself included lol). Etsy is another cool website to find these items. It’s one of my favourites to check out for custom pieces. •Amazon is another good source for merch, especially BT21 merch, but as I’m sure you know you have to be careful when shopping on their to make sure it’s real. If your gonna spend the money on BT21, you want to make sure you have the authentic plushies and items ( make sure the plushies come in its own drawstring bag with the character and BTS member’s signature on the front and it has the tag with the Line Friends seal on it) that’s the important part. All real BT21 items will have/ come in packaging with that seal! • If your looking more in person shopping, where I’m from there’s not many options but I’ve been to/ know of a few places. Hot Topic carrries BT21 items, Barnes and Nobles has their own kpop section, FYE also has its own Kpop section, Target carries the albums, Walmart carries some albums (not a lot though) , Sunrise records has a little bit ( that one is kind a hit or miss kind of deals), and of course if your blessed enough to travel to/ live near a Line Friends store, that’s the BEST place to get BT21 items cause they literally have it all when it’s in stock… I know there’s plenty others but those are the ones I can think of right now lol I hope this helped ! Like I said before due to how big they have become, finding merch isn’t too difficult depending on what you want ! Just do your research and join group chats and meet Army’s. Most Army’s don’t mind helping each other out by answering questions and offering advice! Doing that helped me ALOT when I first got involved into kpop way back when lol! Good luck!!! ",
            "date": "Updated December 4, 2019",
            "views": "361",
            "upvotes": " View 47 Upvoters",
            "upvoters": [
                {
                    "user_id": "Frederika Chovancová",
                    "user_href": "/profile/Frederika-Chovancová"
                },
                {
                    "user_id": "Crystal Chen",
                    "user_href": "/profile/Crystal-Chen-9"
                },
                {
                    "user_id": "Donna McMurdo",
                    "user_href": "/profile/Donna-McMurdo"
                },
                {
                    "user_id": "Saoirse Akoi",
                    "user_href": "/profile/Saoirse-Akoi"
                },
                {
                    "user_id": "Ashmita Das",
                    "user_href": "/profile/Ashmita-Das-48"
                },
                {
                    "user_id": "Monalisa Tovar",
                    "user_href": "/profile/Monalisa-Tovar"
                },
                {
                    "user_id": "Tamima Islam",
                    "user_href": "/profile/Tamima-Islam-4"
                },
                {
                    "user_id": "Luna Alzubaidi",
                    "user_href": "/profile/Luna-Alzubaidi"
                },
                {
                    "user_id": "PikaJyu (Judy)",
                    "user_href": "/profile/PikaJyu-Judy"
                },
                {
                    "user_id": "Luna Myst",
                    "user_href": "/profile/Luna-Myst-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leah. Piew",
                "href": "/profile/Leah-Piew-1"
            },
            "answer_text": "There is a bunch of korean websites where you can buy kpop merchandise. I tried kpoptown, ktown4u and gmarket. They’re all pretty good. I had a problem with kpoptown forgetting to write down my zip code so there was a mix up at the post office :/ so I never ordered there after that, but the packaging was good and the prices were pretty affordable. Ktown4u was okay too, never had any problem with them. I would not buy on sites like yesasia where shipping is free because they add the price of shipping on the product itself so it’s not worth it, you’re paying the same or even more than you would on other websites. MY FAVE KPOP SHOP: Gmarket! It’s kinda like the korean amazon so you have the same products offered by different shops. I always buy from the shop called synnara on gmarket because: trustworthyVery good prices.Lowest shipping costs I personally foundalways have the posters available during preorder period. ( free if I remember correctly)shipping cost is especially good if you buy in bulk, it gets lower and lower the more you buy compared to other stores where they don’t seem to take into account you’re buying a lot and that it’ll be shipped in the same box.Very good packaging, lot of bubble wrap, posters in a tubeYou can pay using paypal ( they’re not the only one, but ¯\\_(ツ)_/¯ I like the option :P)They have other stuff from korea too, clothes, food… and you can buy from multiple stores and pay all at once. Usually the shops will ship every item to a warehouse and then the warehouse package it and ship it to you.Only downside is that the shipping is not that fast, but I personally don’t mind.",
            "date": "Answered September 4, 2019",
            "views": "183",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ale Marie",
                    "user_href": "/profile/Ale-Marie-11"
                },
                {
                    "user_id": "Jennifer Nguyen",
                    "user_href": "/profile/Jennifer-Nguyen-835"
                },
                {
                    "user_id": "Aisha Khan",
                    "user_href": "/profile/Aisha-Khan-771"
                },
                {
                    "user_id": "Zurisky",
                    "user_href": "/profile/Zurisky"
                },
                {
                    "user_id": "Rainbow Cat",
                    "user_href": "/profile/Rainbow-Cat-25"
                },
                {
                    "user_id": "Lara Vasvari",
                    "user_href": "/profile/Lara-Vasvari-1"
                },
                {
                    "user_id": "Jahnabi Sharma",
                    "user_href": "/profile/Jahnabi-Sharma-4"
                },
                {
                    "user_id": "Cam Elise",
                    "user_href": "/profile/Cam-Elise"
                },
                {
                    "user_id": "Amaya Blackrose",
                    "user_href": "/profile/Amaya-Blackrose"
                },
                {
                    "user_id": "Judy Mcgee",
                    "user_href": "/profile/Judy-Mcgee-11"
                }
            ]
        }
    ]
}