{
    "title": "Where did yo yo honey singh disappear? - Quora",
    "tags": [
        "Yo Yo Honey Singh",
        "Indian Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bharat Raj",
                "href": "/profile/Bharat-Raj"
            },
            "answer_text": "Hi Rachit Patel,Thanks for A2A! Hirdesh Singh (born 15 March 1983), better known by his stage name Yo Yo Honey Singh or Honey Singh, is an Indian music producer, Pop singer ,film actor and former rapper. At the peak of his carrer he was one of the highest-paid music producers in Bollywood. Then he suddenly disappeared from limelight for almost 2 years only to return to sing at a film awards ceremony. Finally he opened up about his bipolar disorder and revealed that for 18 months he was in his house in Noida seeking medical help. He had changed 4 doctors in a year as medicines prescribed were not having the required effect. His condition aggravated due alcohol consumption and was afraid of even meeting people. Nevertheless he has made an amazing full recovery and will be back soon doing what he does best - create awesome songs! We have danced to his beats, hummed his songs and were captivated by his stage performances, Lets hope he reaches that peak again. What Honey singh did by revealing the truth is really brave of him and as a true fan; I stand by him and hope everyone does too. May god bless him and his family! Thanks,Bharat.Raj ",
            "date": "Answered February 10, 2017",
            "views": "366",
            "upvotes": " View 74 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Pearl Arora",
                    "user_href": "/profile/Pearl-Arora-12"
                },
                {
                    "user_id": "Sahil Ray",
                    "user_href": "/profile/Sahil-Ray-25"
                },
                {
                    "user_id": "Adarsh Pany",
                    "user_href": "/profile/Adarsh-Pany"
                },
                {
                    "user_id": "Sauhard Bhinge",
                    "user_href": "/profile/Sauhard-Bhinge"
                },
                {
                    "user_id": "Dipesh Kewalramani",
                    "user_href": "/profile/Dipesh-Kewalramani"
                },
                {
                    "user_id": "Pallavi Singh",
                    "user_href": "/profile/Pallavi-Singh-1563"
                },
                {
                    "user_id": "Kanika N",
                    "user_href": "/profile/Kanika-N-5"
                },
                {
                    "user_id": "Lost Boi",
                    "user_href": "/profile/Lost-Boi-3"
                },
                {
                    "user_id": "Rohan Jaiswal",
                    "user_href": "/profile/Rohan-Jaiswal-54"
                },
                {
                    "user_id": "Bikram Bhatia",
                    "user_href": "/profile/Bikram-Bhatia-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashutosh Raina",
                "href": "/profile/Ashutosh-Raina-16"
            },
            "answer_text": "Honey Singh did not disappear.He was in a rehab for a long period of time battling Bipolar disorder which was caused due to stress and use of drugs(The type of drugs used is still a mystery).This caused him to gain a lot of weight.He was advised complete bed rest and during this time he made a song just on his laptop called Dheere Dheere. He has now recovered completely and Recently he has been working on his body and trying to get into good shape. According to Yo Yo he had been writing poetry all this time and will soon release his music,He would be back with the single called Rise and Shine(which will release soon) ",
            "date": "Answered June 10, 2017",
            "views": "4",
            "upvotes": " Answer requested by Narayan Ghorpade and Ravinder Arora"
        }
    ]
}