{
    "title": "Which song would you prefer to listen to start your day and the song to end your day? - Quora",
    "tags": [
        "Songs Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lou Coury",
                "href": "/profile/Lou-Coury"
            },
            "answer_text": "Which song would you prefer to listen to start your day and the song to end your day? To get the day off on the right foot and to get ready to take on the world, I would play (loudly) “Cut the Cord” by Shinedown:  Lyrics: Freedom, la la la la)(Freedom, follow me)(Freedom, la la la la)(Freedom) cut it(Freedom, la la la la)(Freedom, follow me)(Freedom, la la la la)(Freedom) Let me tell you, I'm viciousNot pass-aggressiveI got my finger on my pulse, staring straight into a hole and I'ma get itAnd I'm a savageIt's automaticI got a way of making noise, the power to destroy with no static Now victory is all you needSo cultivate and plant the seedHold your breath and count to ten, just count to ten I'm gonna make it rain, so ring the bellI know it all too wellSwitchblade on the edge of your wristCan I get a witness? (witness)'Cause agony brings no rewardFor one more hit and one last scoreDon't be a casualty, cut the cord (Freedom, la la la la)(Freedom, follow me) cut the cord(Freedom, la la la la)(Freedom) You gotta feel courageEmbrace possessionIf it was easier to shatter everything that ever matteredBut it's not, because it's your obsessionBe a fighter, backbone, desireComplicated and it stings, (but we both know what it means)And it's time to get real and inspired Now victory is all you needSo cultivate and plant the seedHold your breath and count to ten, just count to ten, just count to ten I'm gonna make it rain, so ring the bellI know it all too wellSwitchblade on the edge of your wristCan you witness (witness)'Cause agony brings no rewardFor one more hit and one last scoreDon't be a casualty, cut the cord Cut itCut it 'Cause victory is all you needSo cultivate and plant the seedHold your breath and count to ten, just count to ten I'm gonna make it rain, so ring the bellI know it all too wellSwitchblade on the edge of your wristCan you witness? (witness)'Cause agony brings no rewardFor one more hit and one last scoreDon't be a casualty, cut the cordDon't be a casualty, cut the cord (Freedom, la la la la)(Freedom, follow me) cut the cord(Freedom, la la la la)(Freedom, follow me, me, me)  To wind down the day on a soothing and positive note, I would play “All Day All Night” by Moon Taxi  Lyrics: All Day and All Night,My Eyes Are Open,All Day and All Night,I've Been Goin,All Day and All Night,We Stay Up, We Stay On,All Day and All Night,Oh Yeah... Well I don't know just where I've been,Same clothes on my back again,And if you see me in the morning,You're bound to see me hanging by a thread,One more time before I go,One more night before I know,And if you see me in the evening,You're bound to see me out of my head,And I'll Be Going, All Day and All Night,Eyes Are Open,All Day and All Night,Keep Me Goin’,All Day and All Night,We Stay Up, We Stay On,All Day and All Night, Whisper words into my ear,Tell me what I need to hear,But I won't close my eyes without you,Even if I have to make it one more day, Never know when to say when,The sun is setting once again,And underneath the stars behind us,’til the morning comes and washes us away,Then I'll be going, All Day and All Night,Eyes Are Open,All Day and All Night,Keep Me Goin’,All Day and All Night,We Stay Up, We Stay On,All Day and All Night, Keep GoingKeep going through the day,over and over,Keep going through the night, All Day and All Night,All Day and All Night,All Day and All Night,All Day and All Night, All Day and All Night,Eyes Are Open,All Day and All Night,Keep Me Goin’,All Day and All NightWe Stay Up, We Stay On,All Day and All Night,Oh Yeah... ",
            "date": "Answered April 19, 2018",
            "views": "130",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dwight Ropp",
                "href": "/profile/Dwight-Ropp"
            },
            "answer_text": "For me, it’s just got to be “Let The Day Begin” (by The Call, 1989) to let the day get on its way! Musically, it’s rousing and stimulating with punchy rhythms, just the prime vehicle for carrying a moving and passionate lyric that gratefully cheers us all on our way while also paying tribute to those who gave their best out there in the past. And it hasn’t lost any of its power these many years later!  And to end the day off I would have to go with “Shut Down Turn Off” (by The Little River Band, 1978) to do just that, and you’ll hear just why…  ",
            "date": "Answered September 18, 2017",
            "views": "116",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chandan Kr",
                    "user_href": "/profile/Chandan-Kr-36"
                }
            ]
        }
    ]
}