{
    "title": "Which songs have the deepest lyrics, either emotionally, philosophically, or any other manner? - Quora",
    "tags": [
        "Song Lyrics",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joe Penson",
                "href": "/profile/Joe-Penson"
            },
            "answer_text": "In my opinion almost all of Black Veil Brides songs mean the most to me. Whilst most artists mainly write about love and loss of love, and why not? everyone experiences it, heartbreak will happen to EVERYONE and so everyone can relate to the lyrics. Think back to the last time you broke up with someone, I guarantee if you listened to the radio, most lyrics in songs you could have heard before, will now seem more poignant and meaningful to you. Even songs where its about a happy relationship, will make you relate to it as you look back on your relationship through rose tinted glasses. Now Black Veil Brides have written songs about love, namely, The Morticians Daughter, Rebel Love Song (More about rebellion than love.), Done for you, Walk Away. There is usually one on each record. But the other songs have a meaning to me because it teaches you to be yourself and forget what everyone else says, throughout a lot of the albums they oppose religion, this contributes to people thinking they worship the devil, which they don't. It is because the lead singer grew up in a very Christian environment, he went to a catholic school. His parents/family are Catholic and though he has chosen to be Atheist he still is very respectful of Religion and the idea of it. He wears a black rosary in honour of his Grandmother who was very religious and wore it until she died, and I believe he once said that he likes to read the Bible. He doesn’t believe in God, but he isn’t your typical arrogant Atheist and Religion is still an interest of his. However he doesn't like how religion has become a stick to beat people with. It is now \"Worship God or burn in hell!\" and how extreme it has gotten, so as a way of getting back at religion he writes the songs.After that explanation here are some of the songs that mean most to me.Sweet BlasphemyThrough sadness you have taught us to be one with the crowd Unveil the sacred order, hymns of falling down You told the greatest stories, of love and bleeding crowns But to the sick and hungry, you cannot be found We are young and we are strong Through strength in self we become Something more than they can be I raise my heart and sing! That I won't believe this lie I know there's something more inside When darkness is all you'll see This is our Sweet Blasphemy Silence the crooked holy, unchain the tied and bound No time for allegory, one true reigning sound Unite the lonely mourning, a simple servant now We are the only glory, hear us screaming loud We are young and we are strong I raise my heart and sing! That I won't believe this lie I know there's something more inside When darkness is all you'll see This is our Sweet Blasphemy We are young and we are strong Through strength in self we become Something more than they can be This is our Sweet Blasphemy That I won't believe this lie I know there's something more inside When darkness is all you'll see This is our Sweet Blasphemy That I won't believe this lie I know there's something more inside When darkness is all you see This is our Sweet Blasphemy This is clearly a stab at religion and every one who tries to force you to be something you are not, there are usually more than just one meaning in all of their songs, depending on how you listen, you may understand the lyrics if you look deeper into them or completely misunderstand and think he's telling you to be suicidal, even though the band has saved thousands of lives.And there is also Perfect WeaponRrrraaaaaaa! Awake at night you focus On everyone who's hurt you, Then write a list of targets, Your violent lack of virtue. Leave us alone! You're on your own! Watch out! We are breathin' While you're sleepin'. Go (go!) And leave us alone. The liars cheatin', Our hearts beatin'. Go (go!) And now you're on your own. Here's to your perfect weapon, Crack bones with blind aggression, Like birds whose wings are broken, You live without direction. Leave us alone! You're on your own! We are breathin' While you're sleepin'. Go (go!) And leave us alone. The liars cheatin', Our hearts beatin'. Go (go!) And now you're on your own. Go! Go! Go! Go! And now you're on your own! Go! Go! And leave us alone! [Guitar Solo][Laughing in background] We are breathin' While you're sleepin'. Go (go!) And leave us alone. The liars cheatin', Our hearts beatin'. Go (go!) And now you're on your own. It's about bullying and people who beat you down just because you're different. Other songs are Lost it all, The Legacy, We Stitch These Wounds, In The End, I am Bulletproof. Just listen to all of their songs, and Andy Black's too (the lead singers solo project which is a different sound to BVB), particularly Break Your Halo and We Don't Have To Dance. If you watch interviews with him online he explains the meanings behind them well. ",
            "date": "Answered November 10, 2016",
            "views": "133",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Lev",
                    "user_href": "/profile/Michael-Lev-11"
                },
                {
                    "user_id": "Liam Brady",
                    "user_href": "/profile/Liam-Brady-34"
                },
                {
                    "user_id": "Reece Lindsay",
                    "user_href": "/profile/Reece-Lindsay-1"
                },
                {
                    "user_id": "Gayathri M",
                    "user_href": "/profile/Gayathri-M-247"
                },
                {
                    "user_id": "Renee Harrell",
                    "user_href": "/profile/Renee-Harrell-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chirag Pachori",
                "href": "/profile/Chirag-Pachori-1"
            },
            "answer_text": "Californication - Red Hot Chili Peppers, A song of album named Californication released 17 years ago. This is the only song which hit me when I read the question and going through answers there was no mention of this beauty. And it feels so good to mention this song. I couldn't find an official video so I'm adding the lyrical video. Red Hot Chili Peppers - Californication (Lyrics) It's not a sexual reference. \"Californication\" is really just the act of the world being affected and saturated by the art and the culture being born and raised in California. Traveling around the world, no matter how far I go, I see the affect that California has on the world. It's about that good and bad, beautiful and ugly. Psychic spies from ChinaTry to steal your mind’s elationLittle girls from SwedenDream of silver screen quotationsAnd if you want these kinds of dreamsIt’s Californication Here we already have a contrast between internal and external. The first half of the verse \"Psychic Spies...\" though \"elation\" represent a general paranoia people have of something beyond their control attempting to mess with their lives. The crackpot theories generally can be found in California. The rest of the verse, \"Little girls from Sweden...” is how external people see something part of California is famous for (movie making) and how they dream of being able to enter into this dream world, totally naive and ignorant of the problems those within deal with. Last two lines let you know. Right off the bat, he's told you what Californication is. It’s the edge of the worldAnd all of western civilizationThe sun may rise in the EastAt least it settles in the final locationIt’s understood that Hollywoodsells Californication Here he's at first talking about how California is the \"edge of the world in all of western civilization.\" Whether or not you find any deeper meaning in or not, it's a powerful enough line. Perhaps, when you link the term \"civilization\" with a description of the sun rising and setting, you get a metaphor saying that this is where the sun will set; this is the decline of civilization. This theme is again referenced later in the song. He ends the verse with the phrase, \"It’s understood that Hollywood sells Californication\" which is simple and obvious enough. Californication as defined above is a paradox between innocent desire for fame and recognition with a culture of irrational fears. This is what Hollywood sells. Everything out of that place will either be entirely self promoting and wrapped in a gaudy brilliance, or will play off your fears in some most unusual ways. Pay your surgeon very wellTo break the spell of agingCelebrity skin is this your chin?Or is that war your waging Simple enough. Here it's talking about how some people are consumed in a war against age, devoting so much of their time, energy, and life into combating it as to nullify any victory they have. Ultimate futility revealed in the form of a question at the end. First born unicornHard core soft pornDream of CalifornicationDream of Californication First born Unicorn, is a nice rhyming phrase that holds a major symbol in it. What that symbol is can be confusing, depending on what your take for the general mythological meaning of a Unicorn is. Some say strength and independence, which would then mean perhaps a glimmer of hope in the song talking about defiance to the force of Californication. Others say a fearful, dreadfully powerful creature. It would then be talking about Californication itself, being a firstborn unicorn, our society's first and most dreadful force to effect change upon our world. Also in mythology, the Unicorn represents virginity, and you’re first born a virgin, and because of hardcore and soft porn, you get ideas of sex, have sex, and lose it. Phrase Hard Core Soft Porn is obviously a contradictory, and I would guess is meant as a jab for the other major marketing technique/aspect of Californication... They sell as much sex as possible, promote it as much as possible, but are never willing to outright go all the way with it, still attempting to uphold that innocent polished image. Marry me girl be my fairy to the worldBe my very own constellationA teenage bride with a baby insideGetting high on informationAnd buy me a star on the boulevardIt’s Californication Because he is addressing directly someone in this verse, many people take this as evidence that the song is about a single person who he had a relationship with, perhaps a person who represented this whole culture. I'm still shaky on the grounds, but I think he's just addressing another archetype here, as symbol of the TYPE of person who gets caught up on the whole society, but not an actual person. And seeing how constellations can also determine your fate, he could be saying to this girl to marry him, be the one to take him around the world, and be the one to be his fate. And have you noticed that when young teenage girls get pregnant, they finally wake up and realize they need to get their act and life together. So they start working harder in school, keeping their face in the books, “getting high on information”, so they can make a better living form them and their future family. And who doesn’t want or get a star on the Hollywood Boulevard? A few non Hollywood actors have done so. Space may be the final frontierBut it’s made in a Hollywood basementCobain can you hear the spheresSinging songs off station to stationAnd Alderon’s not far awayIt’s Californication In this verse he does three things.1) He points out the fakeness of our attempts to explore \"the final frontier\" as we instead do it in a studio as opposed to spending that money to actually do any real exploration. It's also a Star Trek reference, of course, with that phrase. He referenced Hollywood again. He does it one more time in this verse, proving how he is a true geek at heart.2) a) He directly addresses Cobain, more likely than not Kurt Cobain, the man who kicked off a trend that was consumed, distorted, and then discarded by the force of Californication. He asks if he sees what has happened. b) Foo Fighters lead singer is the former drummer of Cobain’s Nirvana…..Foo Fighters, not the band, but real foo fighters fly in what looks like alien space crafts; the flying saucer type kind that in early days were called “spheres”……Station to Station is an album by David Bowie, and on that album you’ll find the track “The Man Who Sold The World”. During one of Nirvana’s final performances on MTV Unplugged, they performed that same song. After Cobain’s death and Dave Grohl started the Foo Fighters, they also played “The Man Who Sold The World” at their concerts in memory of Curt Cobain, which then got a lot of air play on the radio, I mean all the time when it first came out. So, do you kind of see the connection? He’s telling Kurt if he can hear how Dave Grohl and his band is still carrying the torch, and how they miss him and still live on his name.3) And finally, he says, \"And Alderon's not far away, It's Californication.\" This line is actually a Star Wars reference as is apparent in more knowledgeable circles. Sure the spelling is different, but maybe Anthony thought he spelled it right, but I do believe this is what he’s talking about….Planet Alderaan was the pristine home of Princess Leia, the first planet destroyed by the Death Star in the first Star Wars film. This is a major symbol because he is pretty much saying \"our perfect world will be destroyed soon, it's Californication\" by saying that Alderaan is no far away. Again he's touching upon the destructive nature of this force, a theme I poked earlier on. Born and raised by those who praiseControl of population everybody’s been thereand I don’t mean on vacation Everybody's been to this state of control, of being swept up by the force of Californication. As opposed to having gone to California on vacation. Destruction leads to a very rough roadBut it also breeds creationAnd earthquakes are to a girl’s guitarThey’re just another good vibrationAnd tidal waves couldn’t save the worldFrom Californication Here he's taking the destructive foreshadowing from before, and saying \"Yeah, but if you look at it in a certain way, it can be used as a creative energy. You cannot wipe out this force, even if California was wiped off the map.\" So then, find a way to transform the destructive earthquake of this force into a good vibration. (Also, there's a touch of irony in talking about earthquakes, seeing how California is rocked by them pretty constantly.) The earthquake to a guitar, as much damage as it may cause, to a guitar, is only another vibration... vibration on a guitat makes music. Creation from destruction. Californication is destructive, as he's shown, but again the hope glimmers through; it can be creative. Pay your surgeon very wellTo break the spell of agingSicker than the restThere is no testBut this is what you’re craving He returns to the waste of energy in the battle against the age, saying that perhaps there is something sick about it. The last line would be by far too ambiguous for me to really throw my opinion on. Are you craving Californication, or are you craving to escape it? We strive to be good people but we always fall back to the ways of evil. We come to the point that that is what we're craving. . P.S.: I heard this song almost an year ago and while searching for some ideas to decode it's meaning for this answer, I came across a post updated 11 years ago which was also sourced from somewhere else, and it had no mention of the one who wrote this. And I have posted the same here coz this interpretation is amazing!! All credits goes to the genius mind behind this interpretation. ",
            "date": "Answered November 30, 2016",
            "views": "73",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daniel Dharanee Kannan",
                    "user_href": "/profile/Daniel-Dharanee-Kannan"
                },
                {
                    "user_id": "Nikhila Rao",
                    "user_href": "/profile/Nikhila-Rao-1"
                },
                {
                    "user_id": "Gayathri M",
                    "user_href": "/profile/Gayathri-M-247"
                },
                {
                    "user_id": "Raj Birewar",
                    "user_href": "/profile/Raj-Birewar"
                },
                {
                    "user_id": "Shreya Taneja",
                    "user_href": "/profile/Shreya-Taneja-4"
                },
                {
                    "user_id": "Olivia Lawrence",
                    "user_href": "/profile/Olivia-Lawrence-36"
                },
                {
                    "user_id": "Karan",
                    "user_href": "/profile/Karan-458"
                },
                {
                    "user_id": "Soumyajyoti Nandy",
                    "user_href": "/profile/Soumyajyoti-Nandy"
                },
                {
                    "user_id": "Harpreet Singh",
                    "user_href": "/profile/Harpreet-Singh-650"
                }
            ]
        }
    ]
}