{
    "title": "Which Hebrew songs have the most poetic lyrics? - Quora",
    "tags": [
        "Hebrew Songs",
        "Hebrew (language)",
        "Poetry",
        "Israel"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yoni Friedman",
                "href": "/profile/Yoni-Friedman-2"
            },
            "answer_text": "I'm a huge fan of this particular masterpiece by Roni Dalumi, called ‘Hold Her’. The powerful lyrics, coupled with the grandiose music and her angelic voice, really manage to hit me in the feels every time. Are they the most poetic lyrics out there? Probably not. But since I've gone ahead and translated the lyrics anyways (someone on YouTube asked nicely), I might as well share it here. This is the song, and the lyrics are down below. Enjoy!  Hold Her She's slightly losing her balance She's signaling to me that it isn't easy She's slightly shaking Slightly unstable Hold her * She's slowly rebuilding walls of silence While still trying to unload her burden She's a little confused Her head is spinning Stop it * She will search every dark corridor In every box, in every pocket of frayed dresses She'll know how to pass the nights By caressing the wounds, by climbing the walls She'll find everything she lost along the way It'll burn a bit, then be forgotten * She's finding it slightly difficult to hold on Gets slightly angry, and once more declares: \"I'm not being wild\" But she's still all mixed up Hold her * She will search every dark corridor In every box, in every pocket of frayed dresses She'll know how to pass the nights By caressing the wounds, by climbing the walls She'll find everything she lost along the way It'll burn a bit... * She will search every dark corridor In every box, in every pocket of frayed dresses She'll touch, and know How it feels to drown in hidden puddles And to reopen wounds left untouched for a while She'll find everything she lost along the way It'll burn a bit, then be forgotten ",
            "date": "Answered April 2, 2017",
            "views": "626",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chaim Handler",
                    "user_href": "/profile/Chaim-Handler"
                },
                {
                    "user_id": "Asa Aravindh",
                    "user_href": "/profile/Asa-Aravindh"
                },
                {
                    "user_id": "Claire Reilly-Smith",
                    "user_href": "/profile/Claire-Reilly-Smith"
                },
                {
                    "user_id": "Shai Preter",
                    "user_href": "/profile/Shai-Preter"
                },
                {
                    "user_id": "Asher Reich",
                    "user_href": "/profile/Asher-Reich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexander Rusinov",
                "href": "/profile/Alexander-Rusinov-1"
            },
            "answer_text": "Definition of “most poetic” is quite tricky, but speaking of songs with remarkable lyrics - those adopting Nathan Alterman’s poetry are probably most frequently mentioned. Here’re several songs (I’m adding some translations to English I’ve found… many not very successful on my opinion and some are just literal but poetry translation is almost impossible task anyway) “עוד חוזר הניגון” “Still the music returns” Music: Naftali Alter  Music: Nachum Heiman  Still the music returns you abandoned in vain Still the path stretches on, long and wide And a cloud in its sky and a tree in its rain Are expecting you still, passerby. The wind will rise and like swings in their flight Bolts of lightning will flash overhead The lamb and the she-deer will both testify That you stroked them and pressed on ahead, That your hands are quite empty, your city remote And you’ve bent your knee many a time To a green grove, a woman’s glad throat And a treetop with raindrop-lashed eyes. פגישה לאין קץ Unending Meeting Music: Naomi Shemer  (literal translation) Because you have stormed upon me I shall forever sing youIn vain will I surround you with walls, in vain erect gatesMy desire is to you and to me - your gardenAnd towards me my handless body swoons You alone are the sin and the judge of citiesForever sudden, my eyes are concussed upon youWhile in a warring street, bleeding raspberry sunsets,You will bind me in sheaves Do not plead to those who retreat from approachingIn your lands I alone will be wandererMy prayer asks for nothing at allMy prayer is one and it says - take Until the ends of sorrow, until the ends of nightIn streets of iron, empty and longMy God commanded me to carry to your infantsAlmonds and raisins from my great impoverishment It is good that your hand still captures our heartDo not pity it when it tires of runningDo not allow it to darken like the roomLeft without the stars that have remained outside There the moon blazes as the cook’s kissThere a damp sky thunders its coughThere a tree lowers its branch for me as a handkerchiefAnd I will pick it up and bowAnd I know that, to the beating of the drumIn commerce cities, deaf and pained,One day I will yet fall with wounded head to pluckThis smile of ours from among the chariots אליפלט Elifelet Music: Sasha Argov  Let us sing a Song of Elifelet. Let’s recite it together out loud. How when he was a tyke, a young fellow — A real klutz, a schlimazel, avowed. All the neighbors and folks they would prattle, “He’s plain hopeless,” upon him they’d pounce. “Elifelet’s a boy without mettle, Without character, even an ounce.” If you grab from his hands a new plaything, He just sits there agape with a grin. Yes he’s smiles, not knowing the reason What a smile’s for or when to begin. And the neighbors they all looked askance, That a pin drop would cause him to dance, Without questioning “why’ or “wherefore”, No “ifs”, or “buts”, or “maybe”, No “when to begin” or “what for?” No “how much” or “no, that’s crazy.” As if lost in a musical score With a melody clear as a bell hit. If we ask you “What good is that for? What a child you are, Elifelet!” One night battle erupted, a firefight And the men of the company heard That the forward position was cut off, Ammunition all gone, not a word. Elifelet, he felt some compulsion To replenish his comrades’ supply. Not an ounce of much character in him, He crawled straight toward the firing line. When he made it back, addled and injured, He collapsed to the floor, with a grin. Yes he smiled, not knowing the reason What a smile’s for or when to begin. And his friends in their hearts cast a glance – Yes a pin drop would cause him to dance, Without questioning “why’ or “wherefore”, No “ifs”, or “buts”, or “maybe”, No “when to begin” or “what for?” No “how much” or “no, that’s crazy.” As if lost in a musical score With a melody clear as a bell hit. If we ask you “What good is that for? What a child you are, Elifelet!” Yes that night in a battlefield helmet Gabriel, the Archangel, came down, Near the resting head of Elifelet, In the outpost, on top of a mound. He said: “Have no more fear, Elifelet, Take thee courage, for I do pronounce In the Heavens we’re proud and we’re jealous, Of your character, less than an ounce.” It’s a simple song, yet quite astounding, Without middle, beginning, or end, Let us sing it, not knowing the reason What a song’s for or where to begin. —————————————————————————————————- From several other Israeli poets: Nathan Zach “עץ השדה” “Because the man is the tree of the field”  Music: Shalom Hanoch Because the man is the tree of the field;  Like the tree the man grows up. Like the man, the tree also gets uprooted, And I surely do not know where I have been and where I will be, like the tree of the field. Because the man is the tree of the field; Like the tree he aspires upwards. Like the man, he gets burnt in fire, And I surely do not know where I have been and where will I be, like the tree of the field. Because the man is the tree of the field; Like the tree he is thirsty to water. Like the man, thirsty he remains, And I surely do not know where I have been and where will I be, like the tree of the field. I've loved, and I've hated; I've tasted both this and that; I was buried in a plot of land; And it's bitter, it's bitter in my mouth, Like the tree of the field; Like the tree of the field. Alexander Penn “לא אני הוא האיש” “I’m not the man” Music: Zvika Pik  Avraham Halfi \"עטור מצחך\" “Adorned is your forehead” Music: Yoni Rechter  Adorned is your forehead with black gold  (I can't remember if it was written in a song)  Your forehead rhymes with eyes and light  (I can't remember if it was rhymed in a song)  But for whoever you'll be  His life is filled with song   Your pink robe is fluffy and soft  You always wrap yourself in it before night  I wouldn't want to be your brother  Not a monk praying to the image of an angel  And see grim dreams of sanctity  And in front of him - you, a woman...   You like to be  Sad and silent  To listen to a story about a something close, something far,  And I, that not once I'll be watching you silently,  no sound or words  Forgetting everything about other people.  My soul resides within the walls of your home  Captive between your walls, set apart from me,  As I in my body apart from you.   Stretched out is my dream as a rug to your feet,  Pace, beloved on its flowers of your paces  Wear your pink robe before night,  In a short while I will come to you.   And your black gold adorned forehead  will come close to my lips like a rhyme to a song,  when I whisper to your ear till the morning, till dawn Lea Goldberg משירי ארץ אהבתי From songs of my love land Music: Dafna Eilat  (literal translation) My homeland, a poor flower land -The queen has no house, the king got no crown And the spring comes only for seven days a year And the rest of it - darkness, clouds and rain But for seven days the roses are blumming And for seven days the dew shines And for seven days the windows stay open And all your baggers are standing out by the street And endure their pale faces towards the carrying light And all your baggers are merry My homeland, a poor flower land - The queen has no house, the king got no crown Only seven days there are holidays, in the all year long And the rest of it - labor and starvation But seven days the candles are blessed And for seven days tables ready for fest And for seven days the hearts are wide open And all your baggers stands in pray And your sons and daughters being bridge and bridegroom And all your baggers are being brothers My miserable, my poor and bitterThe queen has no house, the king got no crown - Only one in the all world spoked praise on you And the rest - on your disgrace and shame And therefor I will go to any street and corner, To every market and yard and alleyway and garden, And from your demolished walls, every little stone - I will pick up and save as a souvenir. And from city to city, from country to countryI will wander around with a song, and a music-boxTo mourn your glowing poverty. And therefor I will go to any street and corner, To every market and yard and alleyway and garden, And from your demolished walls, every little stone - I will pick up and save as a souvenir. And from city to city, from country to countryI will wander around with a song, and a music-boxTo mourn your glowing poverty. Natan Yonatan חופים Seashores Music: Nachum Heiman  ",
            "date": "Updated January 16, 2018",
            "views": "699",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chaim Handler",
                    "user_href": "/profile/Chaim-Handler"
                },
                {
                    "user_id": "Daniel Alfon",
                    "user_href": "/profile/Daniel-Alfon"
                },
                {
                    "user_id": "Ilana Halupovich",
                    "user_href": "/profile/Ilana-Halupovich"
                },
                {
                    "user_id": "Ori Gurel-Gurevich",
                    "user_href": "/profile/Ori-Gurel-Gurevich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shmuel Ross",
                "href": "/profile/Shmuel-Ross-1"
            },
            "answer_text": "I nominate בדד - Badad (Alone), by זוהר ארגוב (Zohar Argov). Badad, bamish'ol el ha'ayin badad, banativ lelo chlumbadad, im hazman habore'ach vehazman lo shoche'ach lehatziv et hagvul Alone, on the way to the nothingnessAlone, on the path to nothingAlone, as the time fliestime does not forgetto set the limits. Badad, bli kaf yad melatefet badad, lelo shechem yadid badad, kama tov lo lada'at sheyadech kvar noga'atbeyado shel acher Alone, without a carressing handalone, without a friend's shoulder Alone, how good it is not to know that your hand is already touching the hand of some other man. Chorus x2:Badad elech - gam t'filah ein li badad bli atid bli tikva bli chalom Chorus x2: Alone I will walk - with no prayer, alone, without a future, hope or dream Badad, kmo hashemesh endoda badad, bamidbar halohet badad, gam dma'ot hen rak hevel shir mizmor ein lasevelshir mizmor shel ilmim (imi). Alone, I will wander like the sun, alone, in the hot desert Alone, even tears are vanity; suffering has no song to it a song of the mute (of my mother). The song itself is also rather good. ",
            "date": "Answered April 6, 2017",
            "views": "160",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pierrick (ព្យែរិក) Jaouen",
                    "user_href": "/profile/Pierrick-ព្យែរិក-Jaouen"
                },
                {
                    "user_id": "Peter Filipovic",
                    "user_href": "/profile/Peter-Filipovic"
                },
                {
                    "user_id": "Barak Diba",
                    "user_href": "/profile/Barak-Diba"
                },
                {
                    "user_id": "Miriam",
                    "user_href": "/profile/Miriam-99"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark L. Levinson",
                "href": "/profile/Mark-L-Levinson"
            },
            "answer_text": "For decades, Israeli songwriters set pre-existing poems to music. They haven’t really stopped doing so, although the singer-songwriter mystique has somewhat gained hold, as has the baby-baby-baby school of lyrics. At one point “Zemer Nugeh” was voted the most popular Israeli song of all time. It is based on a pre-existing poem by Rachel the Poet (Rachel Bluwstein).  ",
            "date": "Updated October 5, 2017",
            "views": "358",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vivian Schul",
                    "user_href": "/profile/Vivian-Schul"
                },
                {
                    "user_id": "Amit Rubin",
                    "user_href": "/profile/Amit-Rubin-1"
                },
                {
                    "user_id": "Ori Gurel-Gurevich",
                    "user_href": "/profile/Ori-Gurel-Gurevich"
                },
                {
                    "user_id": "Caroline Ben-Ari",
                    "user_href": "/profile/Caroline-Ben-Ari"
                },
                {
                    "user_id": "Eli Adler",
                    "user_href": "/profile/Eli-Adler-6"
                },
                {
                    "user_id": "Pierrick (ព្យែរិក) Jaouen",
                    "user_href": "/profile/Pierrick-ព្យែរិក-Jaouen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neel Lex Lumi",
                "href": "/profile/Neel-Lex-Lumi"
            },
            "answer_text": "As mentioned below, it’s customary in Israel to set poetry to music and make it into hit music. Personally I think the title of ‘most poetic’ (and oh boy are there others that put up a fight) goes to the poems by my favourite poet, Natan Alterman, featured in his first book, Stars Outside. ‘Still Returns the Tune’  ‘A Meeting to No End’  ‘Moon’  ",
            "date": "Answered April 3, 2017",
            "views": "273",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vivian Schul",
                    "user_href": "/profile/Vivian-Schul"
                },
                {
                    "user_id": "Chaim Handler",
                    "user_href": "/profile/Chaim-Handler"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Josef",
                "href": "/profile/Mike-Josef-2"
            },
            "answer_text": "Lots of good selections here, but many of these songs are adaptations of poems that weren’t originally set to music, as far as I know. So I’m really surprised that nobody mentioned the songs of Meir Ariel, which he wrote and performed himself (and many of which he wrote for other artists or which were covered by other artists, including some of them who were mentioned here). Meir Ariel - Wikipedia מאיר אריאל ",
            "date": "Answered April 5, 2017",
            "views": "132",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chaim Handler",
                    "user_href": "/profile/Chaim-Handler"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Pavlik",
                "href": "/profile/Michael-Pavlik-10"
            },
            "answer_text": "It is virtually impossible to answer, there are so many songs, so many varieties, so much history, it is not possible to pass judgement on which songs are 'most poetic.’ Can you say which English song is the best song ever? Probably not. ",
            "date": "Answered April 2, 2017",
            "views": "106",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ed Averbukh",
                "href": "/profile/Ed-Averbukh"
            },
            "answer_text": "I am not sure about poetic. But I definitely like it.    ",
            "date": "Answered April 2, 2017",
            "views": "133",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vivian Schul",
                    "user_href": "/profile/Vivian-Schul"
                }
            ]
        }
    ]
}