{
    "title": "Which instrument is more impressive to perform in, a violin or piano? - Quora",
    "tags": [
        "Violins"
    ],
    "response": [
        {
            "author_info": {
                "name": "Natalie Smith",
                "href": "/profile/Natalie-Smith-349"
            },
            "answer_text": "Being both violinist and pianist, I would say the technical abilities require to master the violin is harder. However, for the audience that has no knowledge in both instrument would think that the piano is more impressive to perform in, because of the wider range of arm and hand movements on the piano. A typical person would enjoy the sound of the piano more than the violin in my opinion, as the string sound can sound very harsh even with great control, the dynamics contrast is also harder to control on the violin. The piano has the una corda and the sustaining pedal which makes a greater dynamic control than the violin. The sustaining pedal also helps to merge the notes to produce legatos, but the violin does not have this ability and have to play chords with fast and pressed down bowing, which is hard to produce a legato sound. Moreover, the piano plays both the melody and the harmony whereas the violin can only play the main melody in a piece of music, therefore it seems that a pianist has a more impressive performance than a violinist. ",
            "date": "Answered January 26, 2018",
            "views": "722",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Enoch Wiley",
                    "user_href": "/profile/Enoch-Wiley"
                },
                {
                    "user_id": "Cynthia Coleman",
                    "user_href": "/profile/Cynthia-Coleman-40"
                },
                {
                    "user_id": "Manfred Kramer",
                    "user_href": "/profile/Manfred-Kramer"
                },
                {
                    "user_id": "Venetia Jayamanne",
                    "user_href": "/profile/Venetia-Jayamanne"
                },
                {
                    "user_id": "Azure James",
                    "user_href": "/profile/Azure-James-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Faith Leung",
                "href": "/profile/Faith-Leung-1"
            },
            "answer_text": "They’re both pretty impressive to perform in with solos. The violin has the advantage of creating much more different colours of the music, while the piano is a bit limited in this area. However, the piano sounds as if it has a duet going on between the two hands and that’s an advantage. The violin can only do chords one at a time, not exactly a duet. This can also be a subjective thing because what you see as impressive may not be the same as someone else. So, in my opinion, the violin is more impressive because it is way harder to master. When a violinist executes a piece with perfect intonation and lots of emotions, I think this is way better than when the piano is played. (but it’s still only my opinion) Thanks for the A2A and I hope my answer helped you! ",
            "date": "Answered January 26, 2018",
            "views": "257",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Azure James",
                    "user_href": "/profile/Azure-James-1"
                }
            ]
        }
    ]
}