{
    "title": "Which is best, a Honda or Yamaha? - Quora",
    "tags": [
        "Motorcycle Recommendations",
        "Yamaha Corporation",
        "Honda (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tim Rumbinas",
                "href": "/profile/Tim-Rumbinas"
            },
            "answer_text": "I have owned both, as well as every other Japanese brand at one time or another. While Honda has legendary reliability, it all comes down to how the bike is or has been maintained, as well as the design. To be fair, Honda made some real dogs, which quietly disappeared from the pages of history. My money is on Honda, but some people like Coke, others Pepsi. My brother is an enthusiast of the Yamaha XS650, which is a seemingly unkillable classic. Many are likely to outlast their riders. The early models had vibration issues that made a 300 mile day a manly prospect. The XS650 is more or less a perfected Triumph twin, without the oil leaks. I own a 25 year-old Honda PC800 that I would not hesitate to take anywhere. It has certain features that make it a reliable bike, including shaft drive and hydraulic (never need adjusting) valves, along with a lightly stressed liquid-cooled motor. It also has very low miles for its age, yet was regularly maintained. It was previously owned by an engineer who gave it up after having hip surgery. It is so smooth that one risks falling asleep at times. On the other hand, I have seen much newer bikes that have been thrashed. One can significantly injure a bike simply by using the wrong oil. As many motorcycles have multi-plate wet clutches, using automotive oil with “high mileage” wear additives can rapidly ruin them. Not a cheap thing to fix. Some people cannot resist hacking into the wiring harness of a bike to mount various accessories. This can lead to nightmares, particularly in the rain. A friend of mine spent all winter sorting out the wiring of a classic dual-sport. And lastly, many used bikes have been maimed by owners who believe that one can magically improve performance by gouging apart mufflers, cutting holes in air boxes, and maiming carbs. The most reliable bike I have ever seen? Our family’s 1960 Vespa 150 scooter. It was given to my parents as a wedding present. It has not always been used gently through the generations. It’s probably doing better than I am. ",
            "date": "Answered May 22, 2020",
            "views": "91",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Nandha Gopal",
                    "user_href": "/profile/Nandha-Gopal-266"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Garney",
                "href": "/profile/Tom-Garney"
            },
            "answer_text": "I have ridden and owned many Honda and Yamaha motorcycles. Which is best depends on what you value in a motorcycle. As many have mentioned both brands are exceptional. I find that there is only one main difference between Honda and Yamaha, but its not easy to see. Honda builds very competent bikes that give the owner many dependable miles. But I find that Hondas are so perfect they tend to be bland and soulless. I sold my Gold wing for just this reason. It was a great bike but riding it was about as exciting as riding a refrigerator. Basically, Honda builds “riding appliances.” Stone ax reliable, but little excitement. On the other hand Yamaha is an engineers bike, equally reliable to Honda, technically cutting edge, and they have pizzazz. We used to say that when Triumph, BSA, and Norton went belly up in the 70s all the British riders moved to Yamaha. I think if you look carefully at what is setting on the Honda and Yamaha showroom today you will see this subtle difference. Although to be fair Honda is making a concerted effort to increase the excitement factor in their lineup. So which brand is best? If you want stone ax reliability and can live with a riding appliance approach to design, then Honda is the best. If on the other hand you are looking for a bike designed by engineers to give a large dose of performance and excitement, then Yamaha is the best. I am sure plenty of riders will disagree with my viewpoint, and I’m OK with that. Just ride safe and have fun, cause that is what motorcycling is really all about. ",
            "date": "Answered December 14, 2018",
            "views": "819",
            "upvotes": " View 176 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Adrian Lumabas Castro",
                    "user_href": "/profile/Adrian-Lumabas-Castro"
                },
                {
                    "user_id": "Dijin Das",
                    "user_href": "/profile/Dijin-Das-4"
                },
                {
                    "user_id": "K V S Charan",
                    "user_href": "/profile/K-V-S-Charan"
                },
                {
                    "user_id": "V Lenin",
                    "user_href": "/profile/V-Lenin-1"
                },
                {
                    "user_id": "Hari Kishore Thota",
                    "user_href": "/profile/Hari-Kishore-Thota-2"
                },
                {
                    "user_id": "Ahmed Omara",
                    "user_href": "/profile/Ahmed-Omara-8"
                },
                {
                    "user_id": "Anubhav Singh",
                    "user_href": "/profile/Anubhav-Singh-582"
                },
                {
                    "user_id": "Azharu Dheen",
                    "user_href": "/profile/Azharu-Dheen-2"
                },
                {
                    "user_id": "Ajayy Kumar Mahato",
                    "user_href": "/profile/Ajayy-Kumar-Mahato"
                },
                {
                    "user_id": "Prasun Chatterjee",
                    "user_href": "/profile/Prasun-Chatterjee-28"
                }
            ]
        }
    ]
}