{
    "title": "Which musical instruments are allowed (or not allowed) in the “acoustic version” of a pop song? - Quora",
    "tags": [
        "Acoustic Cover"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Jones",
                "href": "/profile/Mark-Jones-733"
            },
            "answer_text": "there are no rules. and if there were, the ones who broke the rules would end up the most notorious and successful. remember when “unplugged” was all the rage? well, how did they amplify the sound for the audience to hear? seriously, any more than 50 in the audience would really suffer to hear a truly un-amplified performance. was the microphone unplugged? and how was the performance mixed or recorded? how was the recording duplicated? let’s say you want to keep a performance / recording restricted to only acoustic instruments. would you use a MIDI keyboard for the piano? how about a sampler or other replica? or would you insist on an acoustic piano? who could tell the difference (on a recording)? rather than worrying about “authenticity”, recommend focusing on the arrangement and performance. ",
            "date": "Updated December 18, 2017",
            "views": "164",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Smith",
                    "user_href": "/profile/John-Smith-13549"
                },
                {
                    "user_id": "Leonid S. Knyshov",
                    "user_href": "/profile/Leonid-S.-Knyshov"
                },
                {
                    "user_id": "Tony Singh",
                    "user_href": "/profile/Tony-Singh-207"
                },
                {
                    "user_id": "Jonathan Ankin Dranoff",
                    "user_href": "/profile/Jonathan-Ankin-Dranoff"
                },
                {
                    "user_id": "Ryan Burnette",
                    "user_href": "/profile/Ryan-Burnette"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leonid S. Knyshov",
                "href": "/profile/Leonid-S.-Knyshov"
            },
            "answer_text": "Acoustic version will replace the electric guitar with an acoustic. It will also use an acoustic drum set rather than electric. It will use an acoustic piano. There will be fewer effects on the vocals. The idea is to convey the feeling of an informal performance in someone's living room. The biggest audible difference is the use of acoustic guitar. The use of an electro-acoustic guitar in traditional shape is acceptable since the pickup's role is to only make the sound engineer's life easier without modifying the sound. This is mostly applicable to live performances. There are countless tricks to produce an “acoustic” track in the recording studio using computers and sample libraries. Prohibited instruments - electric guitar, synthesizers, guitar effects, electric drums. I do not know how they handled bass. Other answers suggest the bass stays electric. Bass effects get turned off. MTV had a show called MTV Unplugged that it's a great demonstration of how that format should work. MTV Unplugged - Wikipedia ",
            "date": "Answered December 13, 2017",
            "views": "133",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Smith",
                    "user_href": "/profile/John-Smith-13549"
                },
                {
                    "user_id": "Ruthie Cole",
                    "user_href": "/profile/Ruthie-Cole"
                },
                {
                    "user_id": "Ismail Rashed",
                    "user_href": "/profile/Ismail-Rashed"
                }
            ]
        }
    ]
}