{
    "title": "Which song will you dedicate yourself? - Quora",
    "tags": [
        "Song Dedications",
        "Singer-Songwriters",
        "Songwriters",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Varunika Rawat",
                "href": "/profile/Varunika-Rawat-1"
            },
            "answer_text": "When it comes to dedicating a song for myself(which literally no one does.……like, ever!), i guess I'd dedicate either Halsey’s ‘sorry’ or Shawn Mendes' ‘life of the party’. ‘Sorry’, because i feel our generation can get really confused and a bit overwhelmed when it comes to love. It's not a simple logic like it was for our parents, now a days finding love is like finding a unicorn. So even when you do encounter love you just don't have time for it or you don't even recognize it. ‘Life of the party’ one the other hand is the type of song that tells you that it's fine to be human, to be you. As the lyrics read, “We don’t have to be ordinaryMake your best mistakes‘Cause we don’t have the time to be sorrySo baby be the life of the party”,the song allows you to be stupid, nervous, weird and impulsive, which is in my opinion somthing every one needs to be told once in a while. So yeah, those are my dedications to myself (still a creepy idea)  ",
            "date": "Answered September 20, 2018",
            "views": "857",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kishor Rohra",
                "href": "/profile/Kishor-Rohra"
            },
            "answer_text": "One song to dedicate on my life, it has to be Ben E king's , stand by me… it's because when I was down and out, my better half stood by me in every adversity and we together came through all the life's storm, if it wasn't for her, I would have given up, so yes, Stand by me, beautiful song though… When the night has comeAnd the land is darkAnd the moon is the only light we'll seeNo I won't be afraid, no I won't be afraidJust as long as you stand, stand by me So darlin', darlin', stand by me, oh stand by meOh stand by me, stand by me If the sky that we look uponShould tumble and fallOr the mountains should crumble to the seaI won't cry, I won't cry, no I won't shed a tearJust as long as you stand, stand by me And darlin', darlin', stand by me, oh stand by meOh stand now by me, stand by me, stand by me-e, yeah ",
            "date": "Answered October 16, 2018",
            "views": "668",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Saloni Garg",
                    "user_href": "/profile/Saloni-Garg-28"
                },
                {
                    "user_id": "Sharath Iyer",
                    "user_href": "/profile/Sharath-Iyer-7"
                }
            ]
        }
    ]
}