{
    "title": "Which OS is better for video editing, Windows or macOS (previously Mac OS X)? - Quora",
    "tags": [
        "Windows Vs. MacOS",
        "Video Editing and Production",
        "Video Editing Software",
        "Video Production",
        "macOS (operating system)",
        "Video Editing",
        "Apple (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Gerulaitis",
                "href": "/profile/Alex-Gerulaitis"
            },
            "answer_text": "Like James McInnes said, it depends on your definition of \"better\". There is no universally true answer, no matter what die-hard Mac - or PC fans say. While Quora and other resources can help to a degree, ultimately you'll have to figure that answer for yourself, based on your preferences, experience, needs. Performance per dollar, Windows PCs usually win due to sheer variety of configuration choices: from budget sub-$1K workstations to very powerful $4K gaming-style systems, to enterprise-class 36-core workstations like HP Z840.  2013 Mac Pro on the other hand is a miracle of engineering and value - if it meets your requirements and needs.  Yet the answer is not in the OS, it's in the editing application. With FCPX you only have one choice. Adobe Premiere Pro runs on either OS, and the choice depends on a number of factors: Which one do you like better and are more experienced with?Do you collaborate with other editors and creative artists and if so, what OS are they mostly on? (Hint: for interoperability, you might want to stick to what they use.)What is your budget? How often do you refresh your systems?What are your performance and reliability requirements?When you are in the middle of a project, what is the maximum downtime you can afford?What are your support expectations and requirements?Once you have at least some answers to these bullet points, the choice will be easier to make, your question easier to answer. So I would choose the editing application first, platform (OS and hardware) - second: Comparing Final Cut Pro X, Media Composer and Premiere Pro CC. Good luck. (My current job is supporting a number of editors working on Mac Pros with FCP7, soon to switch to Premiere Pro. Before that, my job was configuring editing systems on both Windows and Mac systems, for about 18 years.) ",
            "date": "Updated October 22, 2014",
            "views": "102",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Just a Random Otaku",
                    "user_href": "/profile/Just-a-Random-Otaku-3"
                },
                {
                    "user_id": "Ajith Narayanan H",
                    "user_href": "/profile/Ajith-Narayanan-H"
                },
                {
                    "user_id": "Nick Serpa",
                    "user_href": "/profile/Nick-Serpa"
                },
                {
                    "user_id": "Dharsan Baskar",
                    "user_href": "/profile/Dharsan-Baskar"
                },
                {
                    "user_id": "Raja Khairulanwar",
                    "user_href": "/profile/Raja-Khairulanwar"
                },
                {
                    "user_id": "Vasily Smith",
                    "user_href": "/profile/Vasily-Smith"
                },
                {
                    "user_id": "Raj Mehta (राज मेेहता) (ﺭﺃﺝﻣﺣﺗﺎ)",
                    "user_href": "/profile/Raj-Mehta-राज-मेेहता-ﺭﺃﺝﻣﺣﺗﺎ"
                },
                {
                    "user_id": "Antony Monteiro",
                    "user_href": "/profile/Antony-Monteiro"
                },
                {
                    "user_id": "Greg Wyatt",
                    "user_href": "/profile/Greg-Wyatt-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "James McInnes",
                "href": "/profile/James-McInnes-1"
            },
            "answer_text": "You don't mention the criteria by which you'd judge that something is \"better\". The advantage of Mac and OS X are the better GPU-acceleration support (Windows systems have a wide variety of GPUs and require vendors to provide GPU-specific support; if a vendor doesn't support your particular graphics card, the software performs poorly, so choose carefully). Outside of that, the differences are in the range of software packages available for video work (Windows tend to have more low-end, Apple more high-end; but the pro or \"pro-sumer\" stuff, save for Apple's own software, is generally available for both platforms). Things such as Adobe's software operate more or less identically on both platforms. Beyond that, the difference then boils down to personal preferences and feature differences between the operating systems themselves. ",
            "date": "Answered August 13, 2014",
            "views": "49",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Richard Hoffman",
                    "user_href": "/profile/Richard-Hoffman"
                }
            ]
        }
    ]
}