{
    "title": "Which music instrument sounds the best to you? - Quora",
    "tags": [
        "Audiophiles",
        "Musical Instruments",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matthew T. Waterhouse",
                "href": "/profile/Matthew-T-Waterhouse"
            },
            "answer_text": "A silver-plated Yamaha Euphonium with a gold Schilke 59 mouthpiece. I only got to play it for a few minutes. I was a high school student who ran into a professional Euphonium player. He was generous and let me give it a toot. …yeah, that was amazing. The sound felt warm, sensual, and majestic. The vibration was just on. …that moment taught me a ton about mouthpieces.  For the uninitiated, this is the Euphonium.  It’s the Cello of the brass family…compared to the sax family, it’d be a tenor sax — but classier. It’s kinda like a baby tuba or a giant trumpet. Same tonal range as a trombone — but, oh, so much more silky, smooth, and nowhere near so nasal sounding. (I always thought my trombone sounding like somebody’s annoying uncle.) She’s the confident, soft-spoken person in the party, that’s often ignored, and doesn’t care. But when she speaks everybody listens. She sings marvelously with an open throat. The Euphonium is by far the best sounding instrument I’ve played.  …Oh, the good ‘ole days — and how I’d make that pile of pipe hum and sing. Spent a good deal of my youth with arms wrapped around that thing. Ah, nostalgia… …seriously. I’ve been looking at that picture like it was a high school sweetheart. Oh, the music we made together… *sigh. …I wonder what she’s doing these days…probably has some young dude with his lips all over her or something…I hope she’s not as dinged up as I am…  But really, an instrument crafted by a skilled craftsman played by someone who’s married to the instrument is just — flabbergastingly beautiful. ",
            "date": "Updated June 28, 2018",
            "views": "19",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Linda Kay",
                    "user_href": "/profile/Linda-Kay-6"
                },
                {
                    "user_id": "Tom Grennon",
                    "user_href": "/profile/Tom-Grennon"
                },
                {
                    "user_id": "Zoë Furlong",
                    "user_href": "/profile/Zoë-Furlong"
                },
                {
                    "user_id": "Lawrence de Martin",
                    "user_href": "/profile/Lawrence-de-Martin-1"
                },
                {
                    "user_id": "James Kuczero",
                    "user_href": "/profile/James-Kuczero"
                },
                {
                    "user_id": "Julia Doherty",
                    "user_href": "/profile/Julia-Doherty-6"
                },
                {
                    "user_id": "James Marx",
                    "user_href": "/profile/James-Marx-3"
                },
                {
                    "user_id": "Mary Nelson",
                    "user_href": "/profile/Mary-Nelson-4"
                },
                {
                    "user_id": "Joshua P. Schubert",
                    "user_href": "/profile/Joshua-P-Schubert"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matt Szlaga",
                "href": "/profile/Matt-Szlaga"
            },
            "answer_text": "The well-trained, female vocal chords can envoke tears, and we all can probably agree not many might surpass that found in the real human pitch. However, I believe the most beautiful-sounding actual made musical instrument is ‘the harp’. The long, fading resonances found in this instrument are not only mesmorizing; They are beautiful. If I didn’t choose the harp for those reasons alone, then I also chose it because in my experience seeing a well-played harp is fairly rare. I’ve only seen and heard them played live maybe three or four times, and mostly at expensive orchestrated events. Honestly, each time I heard it played in the right setting, it was easy to fade away into the sound. My first live experience included dual harpists playing both individually and together. Watching their fingers I thought, “this just really breeches impossibility”. It also seems, amusingly, most of the time I’ve only seen them played by longhaired angelic women (like they were handpicked or predestined from the time they were cherubs or something)! To me, there are few comparisons found to both the complexity in this instrument, and the pure tones it creates. One must really “take it in” if ever they get the chance. It is truly a difficult instrument. I have loads of respect for anyone who can play it… Takes a lifetime. The harp is really “on the next level”. Beauty is very rare, and a well made harp in tune is even rarer. I don’t even see them in our supposed high-end music stores, more or less know where to find a good harpist - They are even rarer. So, the harp has got to be #1 in my book. ",
            "date": "Updated November 21, 2018",
            "views": "25",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "PIERCE HAND",
                    "user_href": "/profile/PIERCE-HAND"
                },
                {
                    "user_id": "Sevastian Popov",
                    "user_href": "/profile/Sevastian-Popov"
                }
            ]
        }
    ]
}