{
    "title": "Which English songs are best to listen to while travelling? - Quora",
    "tags": [
        "English Songs",
        "Music Recommendations",
        "Songs",
        "Visiting and Travel"
    ],
    "response": [
        {
            "author_info": {
                "name": "Parul Chaudhari",
                "href": "/profile/Parul-Chaudhari"
            },
            "answer_text": "Travel with words, meet the world. Here’s the playlist to listen while travelling - 1. Fast car -It is about change and wanting to escape. Road trips tend to do that, don’t they?  “You got a fast carIs it fast enough so we can fly away?We gotta make a decisionLeave tonight or live and die this way So remember when we were driving driving in your carSpeed so fast I felt like I was drunkCity lights lay out before usAnd your arm felt nice wrapped 'round my shoulderAnd I had a feeling that I belongedI had a feeling I could be someone, be someone, be someone” 2. Life is a highway -  “Life is a highway, I wanna ride it all night long / If you’re going my way, I wanna drive it all night long.” That’s how the song begins. You gonna love the song, one of my favorite. 3. Paradise -  “When she was just a girlShe expected the worldBut it flew away from her reachAnd the bullets catch in her teethLife goes on, it gets so heavyThe wheel breaks the butterflyEvery tear a waterfallIn the night the stormy night she'll close her eyesIn the night the stormy night away she'd fly” 4. Home -  “Settle down, it'll all be clearDon't pay no mind to the demonsThey fill you with fearThe trouble—it might drag you downIf you get lost, you can always be found Just know you're not alone'Cause I'm gonna make this place your home” 5. Lucy in the sky with diamonds -  Picture yourself in a boat on a riverWith tangerine trees and marmalade skiesSomebody calls you, you answer quite slowlyA girl with kaleidoscope eyes 6. Hotel California -  \"This could be Heaven or this could be Hell\"Then she lit up a candle and she showed me the wayThere were voices down the corridor,I thought I heard them say... 7. Wanted dead or alive -  I walk these streetsA loaded six-string on my backI play for keeps 'cause I might not make it backI been everywhere, still, I'm standing tallI've seen a million facesAnd I've rocked them all 8. All summer long -  Now nothing seems as strange as when the leaves began to changeOr how we thought those days would never endSometimes I'll hear that song and I'll start to sing alongAnd think man I'd love to see that girl again 9. Boulevard of broken dreams -  “I walk a lonely roadThe only one that I have ever knownDon't know where it goesBut it's home to me and I walk alone” “My shadow's the only one that walks beside meMy shallow heart's the only thing that's beatingSometimes I wish someone out there will find me'Til then I walk alone.” 10. The Nights -  “He said, \"One day you'll leave this world behindSo live a life you will remember.\"My father told me when I was just a childThese are the nights that never die” “When thunder clouds start pouring downLight a fire they can't put outCarve your name into those shining starsHe said, \"Go venture far beyond these shores.Don't forsake this life of yours.I'll guide you home no matter where you are.\" If you like my music recommendations, follow me on my blog “Music Devotee”. ",
            "date": "Answered June 5, 2016",
            "views": "2",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rajen Chhetry",
                    "user_href": "/profile/Rajen-Chhetry"
                },
                {
                    "user_id": "Sachin Shetty",
                    "user_href": "/profile/Sachin-Shetty-48"
                },
                {
                    "user_id": "Aayushi Jain",
                    "user_href": "/profile/Aayushi-Jain-9"
                },
                {
                    "user_id": "Niraj Patel",
                    "user_href": "/profile/Niraj-Patel-129"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shreya Mudgil",
                "href": "/profile/Shreya-Mudgil-2"
            },
            "answer_text": "Cat Stevens- Father and Son David Bowie- Move On, and Space Oddity Queen- Bohemian Rhapsody (the best sing-along song out there) John Denver- Leaving on a Jetplane Fleet Foxes- Mykonos The Beatles- Day Tripper, Octopuses Garden, Yellow Submarine, Rocky Racoon Bob Marley- No Woman No Cry, Three Little Birds Bruce Springsteen- I’m On Fire Keb Mo- Am I Wrong Klak Tik- Reborn KT Tunstall- Suddenly I See Led Zeppelin- When the Levee Breaks Bon Jovi- Livin’ on a Prayer Marilyn Manson- While My Guitar Gently Weeps (cover) Metallica- Turn the Page Moody Blues- Nights in White Satin Pink Floyd- Hey You, Shine On You Crazy Diamond, High Hopes Paolo Nutini- New Shoes, Pencil Full of Lead Poets of the Fall- Carnival of Rust (must.song.along) Tenacious D- Tribute Tracy Chapman- Fast Car Nina Simone- Sinnerman Joan Osborne- Spooky (originally by Dusty Springfield, but I prefer this one) Johnny Cash- Ring of Fire Journey- Don’t Stop Believing Tex Williams- Smoke Smoke Smoke Wolfmother- New Moon Rising, Joker and the Thief ",
            "date": "Answered October 22, 2016",
            "views": "870",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Upasana Pradhan",
                    "user_href": "/profile/Upasana-Pradhan"
                },
                {
                    "user_id": "Richard McCarthy",
                    "user_href": "/profile/Richard-McCarthy-72"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gurpreet Singh",
                "href": "/profile/Gurpreet-Singh-767"
            },
            "answer_text": "I will make two separate lists one for proper songs and another for electronic music just in case you are not interested in electronic music. Here’s my first list I’ll try to write as many songs I can remember both old and new and will update the list when I remember more. Paradise - ColdplayImagine - John LennonI lived - One RepublicStairway to Heaven - Led ZeppelinBeautiful Day - U2A Sky Full Of Stars - ColdplayCouch Surfing - Darren HanlonThree Little Birds - Bob MarleyThere’s never A Forever Thing - A-HaYou Raise Me Up - Josh GrabonI gotta feeling - The Black Eyed PeasMoves Like Jagger - Maroon 5Come and Get It - Selena GomezHymn for the weekend - ColdplayGood Feeling - Flo RidaPayphone - Maroon 5Magic - RudeAm I wrong - Nico & VinzChandelier - SiaLoose Yourself - EminemLove Generation - Bob SinclairAll of me - John LegendWhere the streets have no name - U2What Goes Around - Justin TimberlakeGrenade - Bruno MarsBurn It Down - Linkin ParkBlurry Face - Twenty One PilotsI’ve been everywhere - Johnny CashElectronic Music Don’t You Worry Child - Swedish House MafiaRunaway - GalantisI Took A Pill In Ibiza(Seeb Remix) - Mike PosnerAstronomia - Tony IgyThis Is What It Feels Like - Armin Van BuurenFirestone - KygoStanding - Hansel ThornSpaceman - HardwellLevels - AviciiThe Way We See The World - Dimitri Vegas, Like Mike, AfrojackCloser - The ChainsmokersSing Me To Sleep - Alan WalkerFaded - Alan WalkerYou Know You Like It - DJ SnakeOcean Drive - Ocean DriveStole The Show - KygoSummer - Calvin HarrisTen Feet Tall - AfrojackWaiting For Love - AviciiWake Me Up - AviciiStarboy - The WeekndTitanium - David GuettaBreakn’ A Sweat - SkrillexInvincible - BorgeousWizard - Martin Garrix & Jay Hardway",
            "date": "Answered January 3, 2017",
            "views": "42",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Volga Seriyosha",
                    "user_href": "/profile/Volga-Seriyosha"
                },
                {
                    "user_id": "Patel Het",
                    "user_href": "/profile/Patel-Het-5"
                },
                {
                    "user_id": "Raushan Kumar",
                    "user_href": "/profile/Raushan-Kumar-242"
                },
                {
                    "user_id": "Navdeep Jha (नवदीप झा)",
                    "user_href": "/profile/Navdeep-Jha-नवदीप-झा"
                },
                {
                    "user_id": "Harban Singh",
                    "user_href": "/profile/Harban-Singh"
                },
                {
                    "user_id": "Shalini Sinha",
                    "user_href": "/profile/Shalini-Sinha-109"
                },
                {
                    "user_id": "Sakshi Pareek",
                    "user_href": "/profile/Sakshi-Pareek-21"
                },
                {
                    "user_id": "Shumaila Mujawar",
                    "user_href": "/profile/Shumaila-Mujawar"
                },
                {
                    "user_id": "Violet Jones",
                    "user_href": "/profile/Violet-Jones-5"
                },
                {
                    "user_id": "Connor McCordick",
                    "user_href": "/profile/Connor-McCordick"
                },
                {
                    "user_id": "Ketan Parmar",
                    "user_href": "/profile/Ketan-Parmar-81"
                },
                {
                    "user_id": "Kr. Saurav",
                    "user_href": "/profile/Kr-Saurav-2"
                },
                {
                    "user_id": "Omkar Patil",
                    "user_href": "/profile/Omkar-Patil-141"
                },
                {
                    "user_id": "Arpit Beri",
                    "user_href": "/profile/Arpit-Beri-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Panchali Das",
                "href": "/profile/Panchali-Das"
            },
            "answer_text": "Here’s my list - You’re Beautiful - James BluntCall Me Maybe - Carly Rae JepsenLa La La - Naughty Boy ft. Sam SmithShake It Off - Taylor SwiftOnly One - Alex BandSomewhere With You - Kenney ChesneyYou And I - One DirectionOne Love - BlueOn My Mind - Ellie GouldingI Took a Pill in Ibiza (Seeb Remix) - Mike PosnerPocketful of Sunshine - Natasha BedingfieldLean On - Mazor Lazor & DJ SnakeTaste The Feeling - Conrad Sewell (The Coke Song :D )Naked - Dev ft. Enrique IglesiasBest Song Ever - One DirectionBest Night - Taylor SwiftWake Me Up - AviciiSummit - SkrillexYou Were My Everything - AviationWe Don’t Talk Anymore - Charlie Puth ft. Selena GomezThe Reason - HoobastankUnfaithful - RihannaStressed Out -Twenty One PilotsLeaving On A Jet Plane - Jhon DenverFaded - Alan WalkerP.S - You need not follow this order while listening. ;) ",
            "date": "Answered January 3, 2017",
            "views": "33",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mrityunjay Sharma",
                    "user_href": "/profile/Mrityunjay-Sharma-70"
                },
                {
                    "user_id": "Satish Boby",
                    "user_href": "/profile/Satish-Boby"
                },
                {
                    "user_id": "Devdatta Patil",
                    "user_href": "/profile/Devdatta-Patil"
                },
                {
                    "user_id": "Gargee Das",
                    "user_href": "/profile/Gargee-Das-7"
                },
                {
                    "user_id": "Abhishek Singh",
                    "user_href": "/profile/Abhishek-Singh-236"
                },
                {
                    "user_id": "Sudhanshu Shekhar",
                    "user_href": "/profile/Sudhanshu-Shekhar-198"
                },
                {
                    "user_id": "Manish Pandey",
                    "user_href": "/profile/Manish-Pandey-386"
                },
                {
                    "user_id": "Muskaan Walia",
                    "user_href": "/profile/Muskaan-Walia-2"
                },
                {
                    "user_id": "Arshit Bhargava",
                    "user_href": "/profile/Arshit-Bhargava"
                },
                {
                    "user_id": "Manish Mudhliyar",
                    "user_href": "/profile/Manish-Mudhliyar"
                },
                {
                    "user_id": "Shashank Shetty",
                    "user_href": "/profile/Shashank-Shetty-29"
                },
                {
                    "user_id": "Arpit Beri",
                    "user_href": "/profile/Arpit-Beri-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Veera Manikandan",
                "href": "/profile/Veera-Manikandan-10"
            },
            "answer_text": "Home movie- all songs Style-Taylor Swift See you again-Wiz Khalifa Kenji Girac-Andalouse Gingha-Pele-Birth of a legend Pray for me brother-A.R.Rahman Train- Angel in blue jeans American authors- Believer Let it go-Frozen Bailando-Enrique Iglesias Tonight-Enrique Iglesias We own it- Chainz Love me like you do-Ellie Goulding Steal my girl - One direction Burn -Ellie Goulding All of me-John legend Favorite girl-Justin Bieber Break free-Ariana Grande I need your love-Calvin Harris Fancy-Iggy Azalea B.O.B so good Mammoth-Dimitri Vegas Poker face-Lady Gaga The heart wants what it wants-Selena Gomez Lavender Lily- from Cinderella movie Wavin’ flag-K'naan Up-jessie McCartney Right round-Flo rida Whistle-Flo rida Never say never-Justin Bieber Danza kuduro-Don Omar A Thousand years-Christina Perri Blank space-Taylor swift Gone gone gone-Philips These songs are the one's I love to hear when I on a travelling…that's long travel one …They always rock ..and move whenever you come across those songs ….i like those songs…so give it Try …. ",
            "date": "Answered January 3, 2017",
            "views": "523",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rajen Chhetry",
                    "user_href": "/profile/Rajen-Chhetry"
                },
                {
                    "user_id": "Vikas Kapoor",
                    "user_href": "/profile/Vikas-Kapoor-54"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rashi Goyal",
                "href": "/profile/Rashi-Goyal-9"
            },
            "answer_text": "Music while traveling is as necessary as your travel kit of essentials. You can check this out If you are interested in Hollywood music:- Closer-The ChainsmokersDon't let me down-The ChainsmokersLean On(ft. DJ Snake &M0)Last Friday night (T.G.I.F)Troyboi-Afterhours(feat Diplo & Nina Sky)Let me love you (DJ Snake ft. Justin Beiber )Faded(Alan Walker)Club can't handle me (Flo-Rida Prod. David Guetta)Bailando(Enrique Iglesias ft. Sean Paul)Work from home (Fifth Harmony)Habits(Stay High)-The ChainsmokersIko Iko-SiaIf you are very much into Bollywood songs:- Illahi(Yeh Jawani hai Deewani)Dil Chahta h(Title track)Yunhi chala chal rahi(Swades)Khwabon K parindey(ZNMD)Patakha Guddi(Highway)Kabira (Yeh Jawani hai Deewani)Oh Gujaria(Queen)Ambarsariya(Fukrey)Chull(ft.Badshah)Masti ki Paathshaala(Rang De Basanti)",
            "date": "Answered January 3, 2017",
            "views": "29",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rudolf Virjo",
                    "user_href": "/profile/Rudolf-Virjo"
                },
                {
                    "user_id": "Mukund Movaliya",
                    "user_href": "/profile/Mukund-Movaliya-1"
                },
                {
                    "user_id": "Sonali Alwani",
                    "user_href": "/profile/Sonali-Alwani"
                },
                {
                    "user_id": "Honnesh Pallaki",
                    "user_href": "/profile/Honnesh-Pallaki"
                },
                {
                    "user_id": "Sarita Goyal",
                    "user_href": "/profile/Sarita-Goyal-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Advancelyric",
                "href": "/profile/Advancelyric"
            },
            "answer_text": "The best English song to listen while travelling is Comfortable Numb by Linkin Park.  Comfortable Numb lyrics “Comfortably Numb Lyrics” is a song by the English rock band Pink Floyd, released on their eleventh album, The Wall (1979). It was released as a single in 1980 with “Hey You” as the B-side. The chorus progression and guitar solos were written by guitarist David Gilmour, while the lyrics and verse progression were written by bassist Roger Waters. Singer: Linkin Floyd Singer: David Galmour, Roger Waters Song Writer: David Galmour, Roger Waters Comfortable Numb lyrics, Numb With Lyrics Hello? Hello? Hello?Is there anybody in there?Just nod if you can hear meIs there anyone at home?Come on nowI hear you’re feeling downWell I can ease your painGet you on your feet againRelaxI’ll need some information firstJust the basic factsCan you show me where it hurts?There is no pain you are recedingA distant ship smoke on the horizonYou are only coming through in wavesYour lips move but I can’t hear what you’re sayingWhen I was a child I had a feverMy hands felt just like two balloonsNow I’ve got that feeling once againI can’t explain you would not understandThis is not how I amI have become comfortably numbOkayJust a little pinprickThere’ll be no more, ahBut you may feel a little sickCan you stand up?I do believe it’s working, goodThat’ll keep you going through the showCome on it’s time to goThere is no pain you are recedingA distant ship, smoke on the horizonYou are only coming through in wavesYour lips move but I can’t hear what you’re sayingWhen I was a childI caught a fleeting glimpseOut of the corner of my eyeI turned to look but it was goneI cannot put my finger on it nowThe child is grownThe dream is goneI have become comfortably numb ",
            "date": "Answered February 23, 2020",
            "views": "143",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Manpreet Kaur",
                "href": "/profile/Manpreet-Kaur-1158"
            },
            "answer_text": "Journeys are incomplete without good music. Here's a list of songs that I enjoy listening to while travelling: Fast Cars by Tracy Chapman Careless Whisper by George Michael I Will Always Love You by Whitney Houston Nothing’s Gonna Change My Love for You by George Benson When a Man Loves a Woman by Michael Bolten Aicha and Calling You by Outlandish Boulevard of Broken Dreams by Greenday Who Cares by John Mayer Hello by Adele as well as by Lionel Richie Take Me to Church and Someone New by Hozier Let Her Go by Passenger Shooting Stars Take your Time by Sam Hunt ",
            "date": "Answered January 3, 2017",
            "views": "342",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Coral Jain",
                    "user_href": "/profile/Coral-Jain-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rishav Jain",
                "href": "/profile/Rishav-Jain-64"
            },
            "answer_text": "Well in case you want to try some old songs, you can pick up any of the albums of the Beatles. Most of their songs are comforting and relaxing, especially I saw her standing there. In case of some other quick references, you could try In case you feel angry or tired and need a boost of spirit NumbIn the endBoulevard of broken dreamsI'm coming homeA few great festive spirit songs Euro 16 themeCheap thrillsLean On(with the video)Nothing else matters by metallicaSome more songs that might catch your attention are SorryCloserHomecoming by green dayYou and IAddicted",
            "date": "Answered January 3, 2017",
            "views": "695",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hargun Kular",
                    "user_href": "/profile/Hargun-Kular"
                }
            ]
        },
        {
            "author_info": {
                "name": "Srushti Mahendra",
                "href": "/profile/Srushti-Mahendra"
            },
            "answer_text": "“The moon song” from “Her” I don't know it's singer but the songs music and the lyrics is really soothing. The first time I listened to this song was on a December morning at like 6 o’ clock , I was in Nargol (Gujrat). As I recall it was the last day of a meditation camp, the realization that it's time say good bye to a loved one & time to go back home struck me. As I listen to this song it takes me back to that time, the chilled winds and waves of sea, the silence & the noice of the trees, everything. I don't know if it's about the lyrics or the music of this song but whenever I listen to this song while travelling it reminds me to let go, to be in each passing moment, a witness, a watcher. This is the photo I clicked that morning. I could attach a video but there's no option.  ",
            "date": "Answered August 29, 2017",
            "views": "571",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Md Asiq",
                    "user_href": "/profile/Md-Asiq-2"
                },
                {
                    "user_id": "Sunil Sharma",
                    "user_href": "/profile/Sunil-Sharma-207"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vishal",
                "href": "/profile/Vishal-1387"
            },
            "answer_text": "The Story Never Ends - - Lauv  All of Me - - John Legend  If I Go, I'm Goin - - Gregory Alan Isakov  Lose My Mind - - Dean Lewis  Collapsed - - Natalie Taylor  God Knows I Tried - - Lana Del Rey  King - - Lauren Aquilina  ",
            "date": "Answered June 29, 2019",
            "views": "67",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gaurav Zawar",
                "href": "/profile/Gaurav-Zawar-1"
            },
            "answer_text": "Closer - The Chainsmokers Love the way you lie 1 & 2 - Eminem and Rihhana Just the way you are - Bruno Mars No Promises - Shayne ward Somebody's Me - Enrique My Life - Bruno Mars Say you won't let go - James Arthur Who Says - Selena Gomez So Good - B.O.B. Not Afraid - Eminem Lose yourself - Eminem When I'm gone - Eminem Edit: Blank Space - Katy Perry Radioactive - Imagine Dragons Shape of you - Ed Sheeran Despacito - Louis Fonsi Can't stop this feeling - Justin Timberlake Pumped up kicks - Foster the peoples ",
            "date": "Updated July 21, 2017",
            "views": "651",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hargun Kular",
                    "user_href": "/profile/Hargun-Kular"
                },
                {
                    "user_id": "Sumit Dongardive",
                    "user_href": "/profile/Sumit-Dongardive"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Adams",
                "href": "/profile/Jeff-Adams-148"
            },
            "answer_text": "In English, or by English bands? For travelling, I prefer songs I can fall asleep to. I also prefer whole albums, so that I know what’s coming and there are no surprises while I’m trying to sleep. Two good ones sung in English are Cat Power, “The Greatest” and Bonobo, “Days to Come,” but it’s up to you and your own personal tastes to find what works for you. I also like the French band Volo for good travelling/sleeping music, mais d’accord, they sing in French. ",
            "date": "Answered June 4, 2019",
            "views": "71",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vidhi Mehta",
                "href": "/profile/Vidhi-Mehta-64"
            },
            "answer_text": "i dont wanna live forever by zayn mali and taylor swift but the heart wants what it wants by selena gomez closer by the chain smokers cheap thrills by sia what makes you beautiful by one direction live while we’re young by one direction best song ever by one direction don’t let me down by the chain smokers and daya…:) ",
            "date": "Answered January 3, 2017",
            "views": "100",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Greeshma B Nandakumar",
                "href": "/profile/Greeshma-B-Nandakumar"
            },
            "answer_text": "Songs of the band Runrig2. All songs in 1983 by Taylor Swift 3. What do you mean by JB 4. Songs from the band Aqua 5. Somewhere in my car by Kieth 6. Apologise by One republic 7. Closer by Chainsmokers 8. Let me love you by JB 9. Just to see you smile by Tim McGraw 10. Lush life by Zara Larson 11. Bacon by Nick Jonas 12. Yes to love by Stefano Langone 13. Secrets by One republic ",
            "date": "Answered January 3, 2017",
            "views": "205",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mohit Kabra",
                "href": "/profile/Mohit-Kabra-13"
            },
            "answer_text": "It may depend on Your taste of music but i will suggest u some of my favourites : 1.Closer-Chainsmokers 2.Starboy-The Weekend 3. In the name of love 4.Thousand Years- Christina Perri 5.Lean on 6. Cheap Thrills by Sia 7. Let me love you 8. Ain't my fault-Zara Larsson I would suggest you to go with soothing music while you are travelling so that you can enjoy your travel without getting distracted with loud music. ",
            "date": "Answered January 3, 2017",
            "views": "347",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tangudu Neelakantha",
                    "user_href": "/profile/Tangudu-Neelakantha"
                }
            ]
        },
        {
            "author_info": {
                "name": "Priyanka Gupta",
                "href": "/profile/Priyanka-Gupta-378"
            },
            "answer_text": "It depends upon your taste in music. But some of my favorite are listed below: Chandelier by SiaElastic Heart by SiaRemember the Name by Fort MinorDiamonds by RihannaLose Yourself & Not Afraid by EminemSomeone like you, Hello & Rolling in the deep by AdeleAjib Dastan hai ye (old Hindi song from movie “Dil Apna Aur Preet Parai”)Madhosh dil ki dhadkan (hindi Movie “Jab pyar kisi se hota hai”)Ikk Kudi (Hindi Movie “Udta punjab”)Bahon k darmiyan (hindi movie Khamoshi)",
            "date": "Answered January 3, 2017",
            "views": "16",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arpit Gupta",
                    "user_href": "/profile/Arpit-Gupta-207"
                },
                {
                    "user_id": "Ashish Khandelwal",
                    "user_href": "/profile/Ashish-Khandelwal-45"
                },
                {
                    "user_id": "Aryan Malhotra",
                    "user_href": "/profile/Aryan-Malhotra-18"
                },
                {
                    "user_id": "Sweta Ghosh",
                    "user_href": "/profile/Sweta-Ghosh-4"
                },
                {
                    "user_id": "Manish Dhall",
                    "user_href": "/profile/Manish-Dhall"
                },
                {
                    "user_id": "Irene Maria Saji",
                    "user_href": "/profile/Irene-Maria-Saji"
                },
                {
                    "user_id": "Sheetal Sharma",
                    "user_href": "/profile/Sheetal-Sharma-170"
                },
                {
                    "user_id": "Sudama Kumar",
                    "user_href": "/profile/Sudama-Kumar-सुदामा-कुमार"
                }
            ]
        },
        {
            "author_info": {
                "name": "Srihari Sudeendran",
                "href": "/profile/Srihari-Sudeendran"
            },
            "answer_text": "Some of the songs that are really good while travelling, there are millions but below are the few that come to the mind now: Perfect strangers - Deep purpleNovember Rain - Guns and rosesBlaze of Glory - Bon JoviBabe I am gonna Leave you - Led ZepellinThe four horsemen - MetallicaSins of Omission - TestamentDrag the Waters - PanteraSeason in the Abyss - SlayerTerritory - SepulturaHoly wars - Megadeth",
            "date": "Answered January 3, 2017",
            "views": "315",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Manish Pandey",
                "href": "/profile/Manish-Pandey-386"
            },
            "answer_text": "Couch Surfing - DARREN HANLONLife 's for the Living - PASSENGERSWake me up - AVICIII like it - ENRIQUE IGLESIASStay the night - JAMES BLUNTJust breathe - PEARLThe final countdown - EUROPEKeep on walking - PASSENGERSSky full of stars - COLDPLAYAnimals - MAROON 5Best I ever had - GAVIN DEGRAWBleeding LOVE - LEONA LEWISLego House - ED SHEERANNumb - LINKIN PARKBurn it down - LINKIN PARK",
            "date": "Answered January 3, 2017",
            "views": "931",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Panchali Das",
                    "user_href": "/profile/Panchali-Das"
                },
                {
                    "user_id": "Anil Chandla",
                    "user_href": "/profile/Anil-Chandla"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arijeet Roy",
                "href": "/profile/Arijeet-Roy-8"
            },
            "answer_text": "Personally , I prefer these : 1. Tunnel of love - Dire Straits2.Wonderwall - Oasis3.Don't stop believin - Journey4.Hotel California (especially if I'm travelling alone) - Eagles5.Waiting for the end - Linkin Park! :) ",
            "date": "Answered January 3, 2017",
            "views": "465",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Muskaan Walia",
                    "user_href": "/profile/Muskaan-Walia-2"
                },
                {
                    "user_id": "Milloni Jasani",
                    "user_href": "/profile/Milloni-Jasani"
                },
                {
                    "user_id": "Suraj Kumar",
                    "user_href": "/profile/Suraj-Kumar-1073"
                },
                {
                    "user_id": "Anil Chandla",
                    "user_href": "/profile/Anil-Chandla"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhigyan Ghosh",
                "href": "/profile/Abhigyan-Ghosh"
            },
            "answer_text": "Depends on how you're traveling If you're in a car on a long drive or on a long journey then a collection of classical English bands and Highway Blues will certainly not fail to please you If you're in a bus or a metro then Bass and electronic Music would be better ",
            "date": "Answered January 3, 2017",
            "views": "224",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nehaal Rao",
                "href": "/profile/Nehaal-Rao"
            },
            "answer_text": "Rock songs like Green day’s Boulevard Of Broken Dreams. EDM like Red Lights by Tiesto Songs of which you know the whole lyrics and can sing along with the singer. ",
            "date": "Answered January 3, 2017",
            "views": "213",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Darsh Segal",
                    "user_href": "/profile/Darsh-Segal"
                },
                {
                    "user_id": "Sudama Kumar",
                    "user_href": "/profile/Sudama-Kumar-सुदामा-कुमार"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhishek Dwivedi",
                "href": "/profile/Abhishek-Dwivedi-255"
            },
            "answer_text": "I took a pill in Ibiza. Coldplay, hymn for weekend, paradise. Ride, heathens. Imagination, treat you better, life of the party. Mirrors. I'm yours. Impossible. Highway don't care. All of the stars, photograph, I see fire. Lovers on the son. A thousand years. ",
            "date": "Answered January 3, 2017",
            "views": "554",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Panchali Das",
                    "user_href": "/profile/Panchali-Das"
                },
                {
                    "user_id": "Hitesh Verma",
                    "user_href": "/profile/Hitesh-Verma-68"
                },
                {
                    "user_id": "Megha Shirodkar",
                    "user_href": "/profile/Megha-Shirodkar"
                },
                {
                    "user_id": "Sudama Kumar",
                    "user_href": "/profile/Sudama-Kumar-सुदामा-कुमार"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deeksha Joshi",
                "href": "/profile/Deeksha-Joshi-15"
            },
            "answer_text": "although , we cannot capture or copy music from other’s choice . everyone present here in this world has different levels and choices of thinking . but my some of the favorite songs are as :- let me love u closure elastic heart diamonds last friday night don’t let me down lean on mirrors impossible bleeding love wake me up if u listen bollywood, then :- kar gayi chull breakup song kala chashma bulleyaa badtameez di balam pichkari masti ki pathshala khwabo ke parinde ",
            "date": "Answered January 3, 2017",
            "views": "227",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kishan Solanki",
                "href": "/profile/Kishan-Solanki-5"
            },
            "answer_text": "Black Beatles, Justin Bieber’s Songs, Selena Gomez’ latest songs, Justin Timberlake, Maroon 5, Cold Water, Miley Cyrus’ Will Mike It, Uptown Funk, Michael Jackson, Ellie’s all songs, Sia’s songs. ",
            "date": "Answered January 3, 2017",
            "views": "150",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "D'vil Pathak",
                "href": "/profile/Dvil-Pathak"
            },
            "answer_text": "Cheap Thrills by SiaRockabye by Clean Bandit Ft. Sean Paul, AnneTreat You Better by Shawn MendesChanna Mereya by Arijit SinghFaded by Alan Walker",
            "date": "Answered January 3, 2017",
            "views": "156",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Disha Patel",
                    "user_href": "/profile/Disha-Patel-68"
                },
                {
                    "user_id": "Megha Shirodkar",
                    "user_href": "/profile/Megha-Shirodkar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Debaditya Saha",
                "href": "/profile/Debaditya-Saha-3"
            },
            "answer_text": "It depends upon your taste in music, but here is my playlist.. ET by Katy PerryStarboy by The WEEkndLiquor store blues by Bruno MarsFaded by Alan WalkerFallen Angel by Backstreet BoysOne love by BlueCheap thrills by SiaTaste the feeling by Avicii & Conrad Sewell",
            "date": "Answered January 3, 2017",
            "views": "210",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hrishikesh Barad",
                "href": "/profile/Hrishikesh-Barad"
            },
            "answer_text": "Ocean - John Butler trioChildren of the wild - AngelloGood riddance - Green DayDream on - AerosmithNothing else matters - MetallicaBlood - Middle EastA Sky full of stars - ColdplayRude - Magic",
            "date": "Answered January 3, 2017",
            "views": "252",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gurpreet Singh",
                    "user_href": "/profile/Gurpreet-Singh-767"
                },
                {
                    "user_id": "Anil Chandla",
                    "user_href": "/profile/Anil-Chandla"
                },
                {
                    "user_id": "Coral Jain",
                    "user_href": "/profile/Coral-Jain-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anurag Jain",
                "href": "/profile/Anurag-Jain-122"
            },
            "answer_text": "It's better to listen some electronica,hip hop,rock songs .you may have instant adrenaline rush which pump your mood and you feel more energetic while travelling. ",
            "date": "Answered January 3, 2017",
            "views": "84",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "AakashR",
                "href": "/profile/AakashR"
            },
            "answer_text": "The following are best whilst travelling: John Mayer — XO2. AakashRandhave - Destiny-in-your-hands (http://SoundCloud.com/AakashRandhave/destiny ",
            "date": "Answered January 3, 2017",
            "views": "163",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aarushi Kashyap",
                "href": "/profile/Aarushi-Kashyap"
            },
            "answer_text": "Pumped Up Kicks - Foster the People Somebody - Goyte Ho Hey - The Lumineers The Greatest - Sia Renegades - Vicetone Safarnama - Lucky Ali Ilahi - Arijit Singh ",
            "date": "Answered January 3, 2017",
            "views": "159",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sandeep Konduru",
                "href": "/profile/Sandeep-Konduru-1"
            },
            "answer_text": "#edm songs are best capable songs in travelling which produces boost up your energy and no polluted sound allowed in your Brain http://edm.com ",
            "date": "Answered January 3, 2017",
            "views": "109",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aravind",
                "href": "/profile/Aravind-255"
            },
            "answer_text": "Try everything (Gazelle) Charlie puth's fast and furious song Dana kuduro Radioactive Let it rain over me Florida sun paradise ",
            "date": "Answered January 3, 2017",
            "views": "58",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pradeep Soori",
                "href": "/profile/Pradeep-Soori"
            },
            "answer_text": "Kandisa Songs & Boney M ",
            "date": "Answered January 3, 2017",
            "views": "45",
            "upvotes": "0"
        }
    ]
}