{
    "title": "Which K-pop girl group has the best concept in your opinion? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Melissa Ko",
                "href": "/profile/Melissa-Ko-8"
            },
            "answer_text": "hands down twice’s feel special!! more elegant and mature. specifically i LOVED the feel special music video and it’s concept,, it was such a cultural reset. everything was so good, chaeyoung’s makeup, tzuyu’s dress and crown, momo’s forehead, sana’s pink hair, nayeon’s gorgeous dress, mina being there(!!), jihyo’s outfit and hairstyle, the return of jeongyeon’s short hair, and dahyun’s iconic rap. another thing is the storyline of the music video. it was so clear (i’m not a huge theory person but i could understand it). basically all the girls had someone that made them feel special, and they all met their special person in the music video. momo sees tzuyu in her dollhouse. chaeyoung and mina meet through two worlds. sana and dahyun find each other through a crowd. jihyo sees nayeon through a tv screen. and of course our jeongyeon has herself and the 8 other girls. this storyline is so easy to understand, but is so deep and meaningful. i’m not gonna go into it too much but i’m sure you could find extensive explanations somewhere else. feel special kind of continued fancy’s concept, not exactly cutesy but not girl crush, and it maintained that twice flavor that we all know and love. here are some of my favorite gorgeous shots from the music video!!        feel special era was PERFECTION and nothing will ever top it for me. the only bad thing tbh was the styling in some live stages bc wtf is this  anyway that’s it, remember to stan twice and listen to more&more english version dropping on friday!! ",
            "date": "Answered August 15, 2020",
            "views": "88",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lia Olivé",
                    "user_href": "/profile/Lia-Olivé"
                },
                {
                    "user_id": "Lalisa Manoban",
                    "user_href": "/profile/Lalisa-Manoban-256"
                },
                {
                    "user_id": "Samuel McCredie",
                    "user_href": "/profile/Samuel-McCredie"
                },
                {
                    "user_id": "Hana Lee",
                    "user_href": "/profile/Hana-Lee-223"
                }
            ]
        },
        {
            "author_info": {
                "name": "United Korea",
                "href": "/profile/United-Korea-1"
            },
            "answer_text": "I like k-pop group(girl) Momoland. If you listen to Momoland's song, you'll lovr it too. ",
            "date": "Answered August 15, 2020",
            "views": "55",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hana Lee",
                    "user_href": "/profile/Hana-Lee-223"
                }
            ]
        }
    ]
}