{
    "title": "Which great songs, surprisingly never paid royalties to the artist that made the song a hit? - Quora",
    "tags": [
        "Hit Songs",
        "Music Royalties",
        "Royalties",
        "Songwriting",
        "Artists and Creative Professions",
        "Music Industry",
        "Musicians",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sam Steiger",
                "href": "/profile/Sam-Steiger-2"
            },
            "answer_text": "The famous one, for my generation at least, is ‘House of the Rising Sun’, As popularised by ‘the Animals’. It was a traditional folk song, born in the mists of time. Bob Dylan, amongst countless others, had done interminable variations of it. A tale of misery and dissolution commonplace in the blues tradition. A constantly evolving, hand to mouth evergreen. The Animals, at a loss for anything else to record, settled on what was effectively a standard. They each contributed to the best of their abilities. Hilton Valentine’s arrpegiated guitar work and Eric Burdon’s eloquent rendition on vocals are standout. Alan Price, the Animal’s keyboarder arranged a version for the purposes of a single release. Very successfully, as it turned out. As the story goes, put on the spot, all members of the band, in good faith, agreed that Alan’s name would go on the credits. So guess who reaped the dividends? In millions. No doubt the band members, to a man, regretted their decision at leisure. ",
            "date": "Updated July 7, 2019",
            "views": "472",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gerald Bachand",
                    "user_href": "/profile/Gerald-Bachand"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harry Hawblitzel",
                "href": "/profile/Harry-Hawblitzel"
            },
            "answer_text": "The Happy Birthday song, no doubt the most popular song of all time. Since it had never been copyrighted, one company glommed onto it and tried to collect royalties on it; of course that eventually failed and it’s now officially in the public domain. \"Happy Birthday\" song officially recognized in public domain ",
            "date": "Answered July 5, 2019",
            "views": "167",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Gerald Bachand",
                    "user_href": "/profile/Gerald-Bachand"
                }
            ]
        }
    ]
}