{
    "title": "Which musician relies the most heavily on autotune? - Quora",
    "tags": [
        "Autotune",
        "Electronic Music",
        "Music Production",
        "Pop Music",
        "Bands (music)",
        "Singers",
        "Music Recommendations",
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Victor Vike Vallency",
                "href": "/profile/Victor-Vike-Vallency"
            },
            "answer_text": "×  5 Examples of Artists Tastefully Using Auto-Tune  Disclaimer: Before all you purists out there start typing up angry comments about how Auto-Tune is killing music, just hear us out. By now, I think we can all agree that technology has taken the front seat in driving most of contemporary music’s major innovations, whether in pop, jazz, hip-hop, or modern instrumental. You could point just as easily to the Edge turning his guitar into an organ with effects pedals as you can to Skrillex making a (pretty darn good) living without ever learning to play an actual instrument. But there will always be one instrument that people will have a hard time accepting technology’s ability to augment or alter: vocals. Perhaps it was that awful pre-chorus in Cher‘s 1998 hit “Believe” that sullied it, but as soon as an artist corrects his or her pitch using Auto-Tune and his or her voice starts to digitally wander, critics immediately point to it as evidence of a lack of vocal talent. And, for sure, untalented pop artists do tend to hide behind this life-saving software, but is it always used for that purpose? Are artists really incapable of using Auto-Tune stylistically, even when they’ve got the chops to back it up? T-Pain‘s heartfelt, stripped-down performance on NPR’s Tiny Desk Concerts series in 2014 proves, triumphantly, otherwise. I would challenge critics to evaluate why vocals need to remain so pure and unaffected, especially when there’s a long-accepted history of guitarists, synthesists, drummers, etc. who drown their instruments in effects? Hint: They don’t. If Dr. Dre had made all of his classic beats on an acoustic drum kit, the world would be a different place. Then again, if he hadn’t programmed them digitally, someone else would have. Auto-Tune can certainly sound tacky and unpleasant at times, and, in some situations, it’s utterly superfluous. Yet, like anything, when it’s used with subtlety and ingenuity, it can imbue a track with a compelling, unique, and undefinable sound. Here are a few examples of artists tastefully using Auto-Tune and why it works. 1. Frank Ocean – “Chanel” The majority of this song features Ocean’s voice au naturel with just a little bit of reverb. After a powerful vocal run where he reaches for the some of the highest notes in his chest voice, Ocean finally settles into an Auto-Tuned hook at 2:11 with the lyric, “I see both sides like Chanel.” There’s no question that he could have sung that small bit without Auto-Tune, but it adds a robotic, almost melismatic, effect to his voice. The way his voice oscillates between notes with Auto-Tune is subtle and inhuman, and he only includes it in this one small part of the song. It’s creative and minimal, and no matter why he chose to expose the effect in that moment, nobody could argue this wasn’t a deliberate artistic decision. 2. Beyoncé – “711” If you don’t think Beyoncé can sing, watch this. She’s provided powerful vocal performances to her fans for years and years. No one has to wonder whether or not Beyoncé has a gorgeous, dynamic voice, yet, on occasion, when the song calls for it, she leans on Auto-Tune to create a more electronic feel. On “711,” the Houston singer raps her way through the banger, and she uses a small dose of Auto-Tune to give her vocals that extra trappy effect to match the rapid flutter of the drum machine‘s snare hits. In this way, the effect provides a way in for her vocals to fit the song’s electronic, simulated context so they can shine within it. 3. Chance The Rapper – “Smoke Break” (feat. Future) Chance The Rapper is an incredibly gifted rapper and vocalist. His smoky timbre and powerful voice yield soulful, honest performances whether he’s rapping or singing. Just watch him perform live. Prior to breaking his third mixtape, Coloring Book, Chance had never tried Auto-Tune, despite some of his peers using it religiously. When the mixtape finally dropped, fans were surprised to hear the contentious effect. But what Chance did was smart; rather than depending on it in order to hit the right notes, he uses it for stylistic purposes, like on the song above, “Smoke Break,” with Future. It elevates his sound to fit in more with the Top 40 radio pop mold, which could’ve been a strategic move to gain more national airplay. And because it’s one of only a few instances on the album that he uses it, the effect doesn’t tire us out. 4. James Blake – “Put That Away and Talk to Me” James Blake is famous for his falsetto crooning. His cover of Feist’s “Limit to Your Love” features his voice front and center with nothing but a little bit of reverb and compression affecting it. Blake is no stranger to affecting his voice, and, on his last album, he embraced Auto-Tune on “Put That Away and Talk to Me,” above. The way he uses the effect makes his voice sound tiny, small, and robotic. But his emotions are still there in full color — they’re just under the spell of electronic manipulation. He’s a heartbroken cyborg. 5. Kanye West – “Runaway” Everyone knows Kanye West put out an entire album full of Auto-Tuned songs — the polarizing and essential hip-hop release 808s & Heartbreak. The song we’re going to focus on, however, isn’t from that album. In fact, it’s a song where he doesn’t even rap or sing with Auto-Tune (that you can clearly hear) at all. At the 6:05 mark, it sounds as if a distorted guitar begins to rip a very low-tuned solo. That isn’t a guitar, though. It’s not a synthesizer either. It’s West’s voice. He puts an ocean of distortion on his vocal track, then turns the Auto-Tune up to 11, and basically creates his own guitar solo but with his voice. It’s an innovative way to craft a solo, and while, to some, it might sound like distorted mumbling, others may passively hear it as a long guitar solo. Auto-Tune doesn’t just have to be a mask that bad singers wear — it also can be a tool for unique creative expression in addition to crafting interesting production. ",
            "date": "Answered June 1, 2019",
            "views": "15",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Elliott Ododo",
                    "user_href": "/profile/Elliott-Ododo"
                },
                {
                    "user_id": "Jesse Burch",
                    "user_href": "/profile/Jesse-Burch-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Toomey",
                "href": "/profile/David-Toomey"
            },
            "answer_text": "Probably T Pain. He uses that autotune to the max, for vocal effects. You can also check out his singing without autotune. He's an excellent singer. ",
            "date": "Answered May 29, 2019",
            "views": "131",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Toni Frank",
                    "user_href": "/profile/Toni-Frank-2"
                },
                {
                    "user_id": "Daisy Hudson",
                    "user_href": "/profile/Daisy-Hudson-3"
                },
                {
                    "user_id": "Gary Daniels",
                    "user_href": "/profile/Gary-Daniels-59"
                },
                {
                    "user_id": "Emma Cole",
                    "user_href": "/profile/Emma-Cole-78"
                }
            ]
        }
    ]
}