{
    "title": "Which is the best keyboard synthesizer available in India for a mid level user? - Quora",
    "tags": [
        "Synthesizers",
        "Keyboards (instrument)",
        "Pianos",
        "Computer Keyboards",
        "Musical Instruments",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shankhajit Das",
                "href": "/profile/Shankhajit-Das"
            },
            "answer_text": "I agree with Shriram on the choices he wrote about. I’ll just provide my opinion on this. Beginner - Yamaha E-363 or higher. I’m extremely biased towards Yamaha as a beginners’ keyboard, although I’ve heard that Casio is good too. Intermediate - By now, you would have already decided if you want a workstation (Korg Kross / Krome) or an arranger (Yamaha higher PSR series / Korg PA series), or a digital piano, if you want to go that way, or a MIDI board and VST. If not, drop me a note, will help you figure it out. Workstation - Understand your requirements well. Go for Korg Krome, or Roland Juno DS 61 or 88, or Yamaha Motif series, depending upon what you like. Arranger - Yamaha higher PSR series is good. Digital Piano - Roland FP 30, Yamaha P45 or P115. Expert - Sorry, no clue. :) Haven’t gotten there. ",
            "date": "Answered December 19, 2018",
            "views": "573",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "ABHISHEK RAY",
                    "user_href": "/profile/ABHISHEK-RAY-100"
                },
                {
                    "user_id": "Nidhi",
                    "user_href": "/profile/Nidhi-169"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shriram Bhide",
                "href": "/profile/Shriram-Bhide-2"
            },
            "answer_text": "I am not aware of the expertise level of the user. so a mid level is difficult to specify. The ideal person who can guide is the keyboard teacher himself. He / she would know the level of the pupil and suggest a 1 or 2 stage higher keyboard that will suffice for 2–3 levels above. Here I would state that relation of the music instrument with the player is the same as the magic wand and witch/wizard as described in Harry Potter books. One learns the nuances of the instrument over years of playing and forms a strong affilation. I would suggest a few keyboards though. Yamaha PSRI1455 61 key may be one just above entry level, neverthaless is a good equipment for most uses. Casio CTK7300 series is also equivalent. Higher than these are Roland XPS10. Roland E09IN is more suited for Indian instruments and sounds. You may alos take online help from Wikiguide on “How to Buy a Keyboard” ",
            "date": "Answered December 18, 2018",
            "views": "468",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ajay Kumar Prasad",
                    "user_href": "/profile/Ajay-Kumar-Prasad-6"
                },
                {
                    "user_id": "Shankhajit Das",
                    "user_href": "/profile/Shankhajit-Das"
                },
                {
                    "user_id": "Nidhi",
                    "user_href": "/profile/Nidhi-169"
                }
            ]
        }
    ]
}