{
    "title": "Which is the most complete music theory book? - Quora",
    "tags": [
        "Music Theory",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Glory St. Germain",
                "href": "/profile/Glory-St-Germain"
            },
            "answer_text": "The Ultimate Music Theory Complete Workbook! Complete Workbook & Answers The UMT Workbook (coil bound) 9 X 12 size includes: 12 COMPREHENSIVE LESSONS - Simplify complex conceptsGUIDE and CHART - Memory Joggers for fast and easy reference12 REVIEW TESTS - Accumulative study including final examIf you are interested in learning on your own, or you are a teacher, the matching answer book is perfect for you! It is matched exactly to your workbook and is super easy to mark your own work or to mark your students work! Additionally, to comply with the new RCM syllabus you can also add on the Complete Supplemental book! UMT COMPLETE Supplemental Workbook The COMPLETE Supplemental Workbook features these concepts and more! PITCH - Transposition up or down any interval, Major or minor key (Treble, Alto, Tenor or Bass Clefs)SCALES - Major, relative minors, Parallel, Enharmonic, Chromatic, Whole Tone, Ocatatonic, Blues, ModesCHORDS - Maj, min & Dom 7th (root pos & inv), dim 7th (root pos), Authentic, Plagal & Half Cadences, Chord SymbolsINTERVALS - Simple and Compound Intervals & Inversions, above or below a given noteMELODY WRITING - Contrasting Period - Melody Writing (Major/minor key), Non-Chord Tones (unaccented)ANALYSIS - Identification of concepts from this and previous levels in music examples, Texture, TermsMUSIC HISTORY - Medieval, Renaissance, Baroque, Classical, Romantic and Modern Eras and Global Music Styles - Composers & their music",
            "date": "Answered May 2, 2019",
            "views": "428",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brady Whittington",
                "href": "/profile/Brady-Whittington"
            },
            "answer_text": "Here i have book that you looking for maybe can help you The Everything Music Theory Book with CD: Take your understanding of music to the next level Second Edition  Perfect for everyone from the intermediate musician to the collegiate music major, this book is a complete guide to mastering musical understanding! It's a total educational package, with a helpful audio CD, hundreds of illustrations, and challenging practice exercises. You'll learn: How chords and scales are constructedHow rhythm works and how to understand complex time signaturesHow composers and musicians think about songwritingEach clear, easy-to-understand chapter includes several Etudes. These focused practice exercises test and reinforce your newfound understanding of music theory. With this hands-on practice, you'll become a true musician in no time! ",
            "date": "Answered November 4, 2018",
            "views": "394",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Winston Harris",
                    "user_href": "/profile/Winston-Harris-8"
                },
                {
                    "user_id": "Delaney Sullivan",
                    "user_href": "/profile/Delaney-Sullivan-8"
                }
            ]
        }
    ]
}