{
    "title": "Which is better quality, WAV or FLAC? - Quora",
    "tags": [
        ".WAV (file format)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Francis Austin",
                "href": "/profile/Francis-Austin-3"
            },
            "answer_text": "There seems to be confusion between the format as a storage medium and the playback of the file. Both wav and flac are lossless formats and it is therefore possible to create a perfect replica of the original sound file. However, for sound quality what needs to be done to achieve that file matters. It is often argued that digital cables can make no difference to sound reproduction as digital is all just 1s and 0s. What that ignores is when those numbers reach the DAC and whether any get lost and thus error correction is applied. Jitter and the application of error correction affect sound quality adversely, hence anything that minimises these should improve the ultimate fidelity. In the case of wav vs flac, the wav file is already in a format that can be decoded by the DAC. The flac file is compressed and requires decompressing. In other words there is more processing with the flac file than the wav and that gives more opportunity for timing and other issues to creep in. High end manufacturers like Naim advocate wav as superior to flac for this reason. Indeed Naim’s first cd ripper would only store to wav as they felt flac was inferior. Let’s be clear, I am not saying that there is a huge difference. Indeed on most consumer audio systems, there is likely to be no perceived difference. However, on high end systems, there will be a marginal difference that some people may not perceive. ",
            "date": "Answered February 12, 2019",
            "views": "166",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arunkumar Saravanan",
                    "user_href": "/profile/Arunkumar-Saravanan-4"
                },
                {
                    "user_id": "Ajay Sonawane",
                    "user_href": "/profile/Ajay-Sonawane-68"
                },
                {
                    "user_id": "Zak Tomo",
                    "user_href": "/profile/Zak-Tomo"
                },
                {
                    "user_id": "Bijaya Ug",
                    "user_href": "/profile/Bijaya-Ug"
                },
                {
                    "user_id": "Gavin Christopher Patterson",
                    "user_href": "/profile/Gavin-Christopher-Patterson"
                },
                {
                    "user_id": "Selvadurai Nayagam",
                    "user_href": "/profile/Selvadurai-Nayagam"
                },
                {
                    "user_id": "Cole Schrader",
                    "user_href": "/profile/Cole-Schrader-2"
                },
                {
                    "user_id": "Ai Mac",
                    "user_href": "/profile/Ai-Mac-2"
                },
                {
                    "user_id": "Adrian Smith",
                    "user_href": "/profile/Adrian-Smith-591"
                },
                {
                    "user_id": "David Holtan",
                    "user_href": "/profile/David-Holtan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Graham Auger",
                "href": "/profile/Graham-Auger"
            },
            "answer_text": "They’re both good and more or less will work. As others have pointed out, wav files are raw audio files while FLACs are losslessly compressed audio files. You can convert back and forth between wav and flac as much as you want and get the same exact audio each time. FLAC isn’t as widely supported as WAV, but this is becoming less and less of an issue and is nowhere near as bad as it used to be. WAV files can’t have metadata. So if you want the file to have the track number, album cover, lyrics, etc. embedded into it, then it can’t be a standard wav. It really comes down to what you’re doing with it/want it for. If you’re making a master archive of your audio files or are storing them on a high-end audiophile media distribution device, I’d suggest going with wav. If you’re uploading them to be stored in the cloud, have limited storage space, and/or want metadata included with the files, then I’d suggest going with FLACs. I use both myself. On my personal NAS and external drives, I have all my audio backed up as WAV files. On my paid cloud accounts I use FLACs. On my computers I currently use MP3s and stream or download my uncompressed audio as necessary (once I build a new rig with more internal storage I’ll probably keep FLACs or WAVs internally stored instead of MP3) ",
            "date": "Answered August 2, 2017",
            "views": "432",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "ElectRave",
                    "user_href": "/profile/ElectRave"
                },
                {
                    "user_id": "Arnold M Xavier",
                    "user_href": "/profile/Arnold-M-Xavier"
                },
                {
                    "user_id": "Jay Lee",
                    "user_href": "/profile/Jay-Lee-404"
                },
                {
                    "user_id": "Ashutosh Abhijeet Nanda",
                    "user_href": "/profile/Ashutosh-Abhijeet-Nanda"
                },
                {
                    "user_id": "Vidall Williams",
                    "user_href": "/profile/Vidall-Williams"
                },
                {
                    "user_id": "Marcus Escalera",
                    "user_href": "/profile/Marcus-Escalera"
                },
                {
                    "user_id": "David Holtan",
                    "user_href": "/profile/David-Holtan"
                },
                {
                    "user_id": "Jeremy Miller",
                    "user_href": "/profile/Jeremy-Miller-283"
                },
                {
                    "user_id": "Daniel S. del Puerto",
                    "user_href": "/profile/Daniel-S-del-Puerto"
                },
                {
                    "user_id": "Annat Koren",
                    "user_href": "/profile/Annat-Koren-1"
                }
            ]
        }
    ]
}