{
    "title": "Which YouTube channels are the best for beginners to learn to play the guitar? - Quora",
    "tags": [
        "Guitar Lessons",
        "Guitars",
        "YouTube Channels"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kelly Erickson",
                "href": "/profile/Kelly-Erickson"
            },
            "answer_text": "Bookmark these and you can learn guitar without a teacher... if you have the discipline. These youtube channels are run by great players, generous and wildly knowledegable, keeping you constantly interested, and starting you from beginning or anywhere on the skill spectrum:  Justin Guitar: http://www.youtube.com/user/JustinSandercoe  This channel along with his (free) website is really all you need as a beginner. Really. The dude is incredible. Donations keep him going, and he sells videos of intricate aspects of the guitar, but you can go from \"I don't even know how to change my strings\" to very complex techniques if you start at the first lessons and make your way through. Could take you years. I still revisit him all the time.Rock on Good People: http://www.youtube.com/user/rockongoodpeople  They are fabulously fun, they have an large roster of expert players teaching different genres, and they too are great for beginners all the way through upper-intermediates, but a little more difficult to figure out on their youtube channel what's right for you. I love dipping in to their lessons here and there  when I just want to try something new or unexpected. I adore them. (They also have a website, but it's mainly not free.)Marty Schwartz, who got his youtube start (or at least became known) on rockongoodpeople, has two channels: http://www.youtube.com/user/guitarjamzdotcom and http://www.youtube.com/user/martyzsongs . If you've gotten just past the basic-basics and you're interested in the blues, Marty is a patient teacher and insanely good. He has guest-teachers sometimes as well, but his blues  (and teaching) proficiency is the real draw. (He also has paid stuff available at his own site). He's the man for me b/c I love trying out bluesy bits.If the initials \"SRV\" are tattooed on your heart, then StevieSnacks http://www.youtube.com/user/gr8bluesgtr is for you—great blues lessons, almost exclusively in the style of Stevie Ray Vaughan. Talk about a small niche! The channel's fans are very devoted, and there's a StevieSnacks site with premium materials as well. My favorite thing about the site is his \"spider\" exercises\": http://www.youtube.com/watch?v=B_o-tG09Bj8&feature=related I'm probably personally responsible for 500 of the views on that page, because watching him do spiders while I was following along was like having a teacher in the room with me.   :)Last, Guitar101Ramstein http://www.youtube.com/user/Guitar101Ramstein  has a smaller, but very useful bunch of lessons. Again, my fave is some finger exercises: http://www.youtube.com/watch?v=RkezJz_ibuk&feature=player_embedded  I used that one tons when I was a total newbie, as well.",
            "date": "Updated June 10, 2011",
            "views": "1343",
            "upvotes": " View 175 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Włodzimierz Goleń",
                    "user_href": "/profile/Włodzimierz-Goleń"
                },
                {
                    "user_id": "Zohar Muskat-Arndt",
                    "user_href": "/profile/Zohar-Muskat-Arndt"
                },
                {
                    "user_id": "Manisha Rajpurohit",
                    "user_href": "/profile/Manisha-Rajpurohit-45"
                },
                {
                    "user_id": "Viraj Soni",
                    "user_href": "/profile/Viraj-Soni-2"
                },
                {
                    "user_id": "Debrup Datta",
                    "user_href": "/profile/Debrup-Datta"
                },
                {
                    "user_id": "Agraz Adam",
                    "user_href": "/profile/Agraz-Adam"
                },
                {
                    "user_id": "Gouse Rizvi",
                    "user_href": "/profile/Gouse-Rizvi-1"
                },
                {
                    "user_id": "Sahda Vania",
                    "user_href": "/profile/Sahda-Vania-1"
                },
                {
                    "user_id": "Marc Caro",
                    "user_href": "/profile/Marc-Caro-1"
                },
                {
                    "user_id": "Suzie D",
                    "user_href": "/profile/Suzie-D-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Manaruchi Mohapatra",
                "href": "/profile/Manaruchi-Mohapatra"
            },
            "answer_text": "Hey there, There are a myriad of channels which may help you to be better at playing guitar. I am listing my favourite channels which helped me. I am a acoustic-kind-of-guy. So this list has the channels which primarily teaches acoustic, fingerstyle arrangements etc. Heronymusic - This channel is basically filled with beautiful acoustic fingerstyle lessons along with some beautiful covers. This channel helped me to discover new songs which are progressively difficult or requires specific techniques. Marco Cirillo - Marco is a great gutarist and he uploads videos daily. His channel has videos which contains videos like best emotional melody, spanish melodies and many more interesting ones. It will help you to develop your playing style. You will be able to find your own style of playing after experiencing all these various playing styles. Worth a try.. Paul Davids - The guy for my Music Theory requirements. Paul is an amazing guitarist and he plays all his arrangements flawlessly. If you are into blues or country or rock n roll, do visit his channel. Justin Guitars - Undoubtedly the best among the list. He plays various styles of music and is a good teacher. His channel has lots of videos and they are of high quality (not video resolution; the teaching style). One may easily get lost in the vast library of videos. But if you know what you are looking for, this channel will be a great way to learn your favourite songs. Note - This list contains channels which teach acoustic and classical guitar. If you are more into the metal and progressive musics, you should try “Gemini Guitar”. He teaches ambient guitar, dark metal and many more. ",
            "date": "Answered April 3, 2018",
            "views": "16",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Akbar Ratha Behera",
                    "user_href": "/profile/Akbar-Ratha-Behera"
                }
            ]
        }
    ]
}