{
    "title": "Which is better, Frank Sinatra or Tony Bennett? - Quora",
    "tags": [
        "Frank Sinatra (musician)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Stone",
                "href": "/profile/Steve-Stone-131"
            },
            "answer_text": "i always found this a strange comparison, i guess i find myself seeing things in a different light. so many people think frank sinatra is such a great singer-i don t. i think he s a good singer, but i don t think he is good as tony bennett. maybe i have a different way of viewing things when it comes to vocalists, and music in general. people talk about technique, and i hear a lot of people who have praised frank sinatra for his technique and timing. frank sinatra has excellent timing. i think he s somewhat boring as a singer, and thats what maybe it comes down to. i find him redundant, despite his good technique. i find tony bennett tends to put more emotion in his singing and has more variety in his emotion. i think this is important. despite people tend to think frank sinatra is so good. i find he sings every song with similar emotion. i find tony bennet sings with more variance,emotion and excitement. and frank sings with good technique and is singular in emotion. but i m a musician that put emotion,expression, above technique, and so called training. ie music is to be felt.] ",
            "date": "Answered February 18, 2019",
            "views": "914",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alexandra Eldin-Taylor",
                    "user_href": "/profile/Alexandra-Eldin-Taylor"
                }
            ]
        },
        {
            "author_info": {
                "name": "David J. Young",
                "href": "/profile/David-J-Young"
            },
            "answer_text": "OK……I’ve been waiting for this for years!. Both are superb singers and admired each other. It’s how they interpret a tune that counts. I believe Sinatra was the better of the two at interpreting a tune, but Bennett is (was) a belter who can kick the crap out of a tune, but has a tendency to get a bit off-key. Sinatra would never allow himself to sing off-key as he was a perfectionist. Both singers draw crowds, but I personally enjoy Sinatra as I am a musician and Frank sings like a musician. ",
            "date": "Answered March 1, 2018",
            "views": "17",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gene Popa",
                    "user_href": "/profile/Gene-Popa"
                },
                {
                    "user_id": "Pablo Menacho",
                    "user_href": "/profile/Pablo-Menacho-1"
                },
                {
                    "user_id": "Barbara Rainone",
                    "user_href": "/profile/Barbara-Rainone"
                }
            ]
        }
    ]
}