{
    "title": "Which is a better DAW, Logic Pro or Pro Tools? - Quora",
    "tags": [
        "Pro Tools (audio software)",
        "Logic Studio",
        "Music Software",
        "Logic Pro (OS X app)",
        "Specific Recording Studios",
        "Audio Software",
        "Music Production Software and Apps",
        "Digital Audio Workstations",
        "Music Recording",
        "Audio Recording"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sam Wu",
                "href": "/profile/Sam-Wu-54"
            },
            "answer_text": "I suppose it’s not a matter of better or worse, more so how much you desire certain functionalities. For example, for most things Pro Tools is bad. Why? It’s MIDI capabilities are rather limited and composition is just a pain. Not to mention, the price is pretty annoying. The only thing it has for it is the title of “industry standard”. But having an open mindset, anyone will realise it’s a petty title and can change over the years. What we need to ask ourselves is, why is it standard and does it still stand out all that much? I don’t think it’s a big deal, but people say Logic sounds better than Ableton. However, what is true is probably: Logic is easier to mix with than Ableton. The mixer on Ableton is simply ugly. Additionally, people having a bit of difficulty with differentiating colours may enjoy Logic’s (Pro X) interface more, as there is greater contrast (compared to Ableton), thus making navigation easier. Not to mention, Logic’s default sampled instruments are amazing! Also, you can access a score editor and print out the score (if you intend to hire a session musician to play a section). On the note of composition, Logic is amazing for lazy songwriters! It has a step input keyboard and also scale quantisation (so you’ll never be out of key, and you also don’t have to learn scales). For film scoring, Logic can also import videos (meaning your video plays when your music starts as well) and has ‘decent’ integration with iMovie or Final Cut Pro. Finally, the software optimisation on Logic is superb. Because it’s Apple software and only runs on Macintosh, the CPU load is noticeably lower than other DAWs when using software instruments. Logic is a versatile DAW for many genres. Ableton’s pitch shifting and sample manipulation is renowned in the industry. Logic’s pitch shifting, to this day, is utter garbage and certainly puts off many producers and restricts the creative flow (and possibilities). Your options when manipulating pitch is therefore limited very much (in Logic). I’ve only ever trialled Ableton, but I’ve heard of their sampler and drum rack being insanely good. I suppose the same can’t be said about Logic’s EXS24 Sampler. Live performance is something I don’t talk about, because for electronic music, many people perform with NI’s Traktor Pro, or Serato DJ. As such, it really depends on which style of performance you choose. Ableton is a DAW more tailored for electronic music, with an emphasis on audio samples. As for FL Studio… HAVE YOU EVER SEEN THAT PIANO ROLL? Goodness!!!! FL Studio is legendary for the functionality of the piano roll and MIDI editing. The step sequencer is fun for laying down beats (Logic’s Ultrabeat is a pain, and Ableton just isn’t as fun). The pitch shifting and editing workflow is also amazing. However, I don’t like the fact that you have to create a new track just for automation. It really clutters up the DAW and makes navigation difficult. Because everyone has different computers, FL Studio is known to be a nightmare on bad computers and a thoroughbred on good setups. Learning FL Studio is a joy. Because of the majority of Youtube tutorials being on FL Studio, with free project file downloads, simply download the project and start reverse engineering! FL Studio possess some amazing default software instruments (some are expensive expansions). Many commercial producers still use the ones Image Line have made… the same can’t be said about Ableton (operator… what a joke) and Logic (Logic users might use Alchemy). FL Studio also has a good mixer. I’ve only trialled FL Studio; however, I still think Logic’s mixer is the best. FL Studio is a versatile DAW for electronic music, with its roots in looped samples and making beats. The natural response of Logic’s mixer is amazing (being able to click and swipe the on/off toggle of the plug-ins in one channel is great)! Seeing the busses and grouping them is good as well. Finding your side-chain input is a joy and generally, the mixing and routing process is smooth. So at the end of the day, if budget isn’t a problem, find the software that runs best on your computer (optimisation). Find something with functionality you value and will take advantage of most (mixing, audio samples, MIDI and digital composition). Then with all that considered, ask yourself if integration is a big deal. Because if you liked the loop library from Garageband and want more similar stuff, using Logic is a joy; not to mention, if you edit videos using Apple software, Logic is probably for you. If you’re broke and don’t want to pay & sound like a user of NI’s Kontakt sampler, Logic is also for you. If you perform with MIDI controllers and grid based gear, than Ableton may be what you want. If you like to play with samples, than Ableton is probably what you want. If you want to make yourself miserable with how difficult navigation is… Ableton is what you want. But seriously, if you want to collaborate with the top names in EDM, using Ableton is the way to go. If you want the most versatile piece of gear in one piano roll, look no further than FL Studio! If you want a software that’s versatile for electronic music, FL Studio is the way to go. If you want to be like a Dutch (European for that matter), teenage producer (Avicii, Martin Garrix, Jay Hardway, Curbi, Madeon etc.), FL Studio is where you want to go. If you want to create tutorial videos with an easy to see piano roll, once more, look no further than FL Studio. Finally, if you want to have a great sounding set of exclusive plugins, FL Studio has you covered! The only thing Pro Tools has going for it is probably its legacy. Especially with that price tag, you might as well buy Logic and Ableton (one for mixing and another for sample editing). ",
            "date": "Answered August 7, 2017",
            "views": "45",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daisy Hudson",
                    "user_href": "/profile/Daisy-Hudson-3"
                },
                {
                    "user_id": "David Willis",
                    "user_href": "/profile/David-Willis-181"
                },
                {
                    "user_id": "Ron Coy",
                    "user_href": "/profile/Ron-Coy-2"
                },
                {
                    "user_id": "Tom Rijnberg",
                    "user_href": "/profile/Tom-Rijnberg"
                },
                {
                    "user_id": "Nicolas Fert",
                    "user_href": "/profile/Nicolas-Fert"
                },
                {
                    "user_id": "Getachew Birhanu",
                    "user_href": "/profile/Getachew-Birhanu-1"
                },
                {
                    "user_id": "Sumit Bhagat",
                    "user_href": "/profile/Sumit-Bhagat-8"
                },
                {
                    "user_id": "Yudi Brito",
                    "user_href": "/profile/Yudi-Brito"
                },
                {
                    "user_id": "Morten Arndt",
                    "user_href": "/profile/Morten-Arndt"
                },
                {
                    "user_id": "Emma Cole",
                    "user_href": "/profile/Emma-Cole-78"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ben Bowen",
                "href": "/profile/Ben-Bowen-16"
            },
            "answer_text": "It just depends on what you mean by better, as they are all different and for me there is not one answer. It's more about what you want to create, and now we’re in 2017, you can achieve pretty much the same thing with either of these DAWs. (Add to that Cubase and of course Reason, I'm sure there are more too.) It also depends on what type of producer workflow you have, which layout you prefer, processes, aesthetic etc. So here's a very brief breakdown of the four you mentioned. FL Studio has its roots in hip-hop, was one of the earlier DAWs and was very, very popular about ten or so years ago and many producers now still swear by it or at least use it in some capacity. Great for looping and mostly midi based production. Logic Pro is a very versatile DAW, is cheap, comes with heap (seriously a heap) of presets, and can easily be a host for a full on rock production all the way to trap / EDM / house etc. It's probably the most beginner friendly, but just like a good video game there's plenty there for the newcomer but a whole world of possibility for the experienced gamer! Kygo uses Logic for example, so EDM is not restricted to ableton by any means. Pro Tools you will find in every recording studio in the world (well, you know, basically). It's the industry standard, and has been for a while. Perfect for live tracking, mixing, and more traditional styles of music. It's not cheap, but it's a great place to start. Ableton Live is the biggest DAW in electronic music. Everyone (again, basically) swears by its workflow, versatility, accessibility, ability, layout… it's expensive. But you'll be able to do anything, record instruments, vocals, pitch them up and down easily etc etc. Never said it'd a comprehensive answer but that may give you at least something to think about! ",
            "date": "Answered July 16, 2017",
            "views": "97",
            "upvotes": " View 42 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ruben De Luna",
                    "user_href": "/profile/Ruben-De-Luna-1"
                },
                {
                    "user_id": "Marco Galasso",
                    "user_href": "/profile/Marco-Galasso"
                },
                {
                    "user_id": "Amit Choudhary",
                    "user_href": "/profile/Amit-Choudhary-403"
                },
                {
                    "user_id": "Tim Moore",
                    "user_href": "/profile/Tim-Moore-261"
                },
                {
                    "user_id": "Paige Simmons",
                    "user_href": "/profile/Paige-Simmons-23"
                },
                {
                    "user_id": "Andre Poon",
                    "user_href": "/profile/Andre-Poon-4"
                },
                {
                    "user_id": "Adam Grohman",
                    "user_href": "/profile/Adam-Grohman"
                },
                {
                    "user_id": "Behnoud",
                    "user_href": "/profile/Behnoud"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/SAMEER-NAYAK-9"
                },
                {
                    "user_id": "Djakson Cleber Gonçalves Filho",
                    "user_href": "/profile/Djakson-Cleber-Gonçalves-Filho"
                }
            ]
        }
    ]
}