{
    "title": "Which is your favourite K-pop girl band? - Quora",
    "tags": [
        "K-Pop Bands"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ha-Neul Lee",
                "href": "/profile/Ha-Neul-Lee-1"
            },
            "answer_text": "I’ve been waiting for a question like this for ages, thank you, this took me ages to answer because I had so much to say and I’m sad to say that I don’t regret it one bit. Hope you search up some of these groups if you don’t know them. My top 10 girl groups in no particular order: Oh My Girl: the sweetest, cutest little group you’ll ever see. They’re all so damn adorable and they have the cutest group dynamics while also being awesomely talented and having some of the best vocals. They’re all pretty much good at singing and also they have the best fun (mostly thanks to Seunghee, that girl is wild, she seems like such a hilarious and crazy person to be friends with). They’re all so sweet-hearted as well, they get so thrilled every time they win and they’re so grateful. Irrelevant but also relevant sidenote: YooA is so goddamn gorgeous, I cry every time I look at her because I swear she’s the prettiest K-pop female visual I’ve ever seen and also, she has such honey-like, sweet vocals with powerful dance moves but also is so humble like? It’s just not fair, she has everything.SNSD: One of the funniest girl groups I’ve ever had the misfortune of stanning. Honest-to-goodness, every time they are on a variety show I clutch my stomach while struggling to breathe because they’re so crazy, even at the beginning of their career which is difficult because most girl groups tend to think they have an image to uphold. Musically, they’re very versatile, they’ve tried so many different concepts and they actually suit them all. You’re guaranteed to like at least one song from them. Powerful females dominating a frequently misogynistic and sexist industry is what I live for and it’s impossible to like K-pop and not know of them, plus they’re like the K-pop representative of what a girl group is… stage presence and charisma all rolled into the group that is SNSD.(G)i-dle: truly, rookie monsters. They have such amazing stage presence (in particular, Soojin and Soyeon??) and they’re so in love with each other and appreciative of each other that it’s reassuring to see that they have each other’s backs. Also, I find their group dynamic so interesting - onstage you barely see Shuhua (thanks Cube) but offstage, she dominates the group lol she is hilarious on variety shows and even on their YouTube channel. The Korean members are so quiet and sweet (particularly Miyeon who just smiles all the time and everyone makes fun of her naiveness, she’s such a sweetheart) and then the foreign members are loud and enthusiastic, normally you’d think it’s the other way around because they might not be that confident in the Korean language. Also, can we just appreciate God Soyeon because she’s honestly so talented musically even though she’s so goddamn young and she slayed on Unpretty Rapstar.IZ*One: People will fight me on this and I know it, but they’ve honestly got such potential and also the hate on Wonyoung from international fans have got to stop. It’s so hypocritical of people to argue that she was only picked for visuals and compare them to the people who got 1st place in the other seasons like… they weren’t exactly picked because they’re the most talented either, and she’s so young so has time to properly develop her talents because she’s not even finished growing yet. As a rookie group, they worked so goddamn hard and I’m glad Chaeyeon, Eunbi and Nako in particular got the opportunity to debut because they’ve had such a difficult time making it big over the years. Also, they have some of the funniest characters because they’re so goddamn LOUD I swear, every time I watch a video with them they’re always bursting my eardrums thanks to Yena, Yuri and Yujin. The thing is, I’m glad IZ*One debuted the way they did because otherwise I would never have heard of half the members (especially Chaewon, who got 0 screentime and it was only after debut that I realised she’s so fucking talented, Mnet really has to stop being so biased oh my god).E.X.I.D: Everyone, say thank you to Hani because she truly saved a group of diamonds. It’s terrifying to think how close we were to losing them before we even knew we’d miss them. Hyelin and Solji are some of the best vocalists I’ve ever seen in a K-pop group and makes their songs sound amazing but also Hani’s husky, deep voice is sexy as fuck and so charismatic? Junghwa is a character and a half, she knows how to dance and she’s a monster onstage, her solo part in L.I.E kills me. L.E., some of the best female K-pop rappers and she always guides them so well with their songs and it’s thanks to her that E.X.I.D always has high quality music.AOA: Let me say this: when it comes to AOA, I don’t know how I feel. I truly loved AOA when they were there as a full group and I know people are gonna think I’m a fake stan or something for not liking them as much anymore but hear me out, because I do still like them but not as much. They were one of my bias groups but Bingle Bangle was the wrong song choice for their first comeback after ChoA left and this is why: I’m Korean, which means I understand the lyrics. Let’s not lie, AOA never had amazing lyrics but their songs were bops so I didn’t mind. The lyrics for Bingle Bangle were cringy and a little childish, even for K-pop, especially the chorus. They were all such an amazing group anyway but I just think FNC chose the wrong song for them, if it was any other song I’d be hyped as fuck and showering them with love because they’re honest to goodness so talented? I still love them as a group (my biases have always been the AOA Cream members, they’re so fucking talented mate) and I feel like Jimin gets so much flack for her voice when she’s actually a pretty decent rapper? She made it quite far on Unpretty Rapstar and I think she showcased her lyricism really well, so I don’t get all that “her voice is so annoying” (like Soyeon from (G)i-dle gets) just because she has a high voice. I think the good thing about ChoA leaving is that we get to see other people singing more, in particular Hyejeong (Yuna does get more lines but everyone knew she was the second best after ChoA but Hyejeong didn’t get as much appreciation) and Chanmi, who has always been the underdog of the group and always overlooked. The choreography they gave her with Seolhyun was such a good idea I think, because she’s finally getting some attention.Apink: I’m so bitter when it comes to Apink because people only gave them attention when they came out with I’m So Sick just because it wasn’t a cute concept and whenever people say “cute K-pop girl groups aren’t talented” it makes me cry because Eunji, Namjoo and Bomi are such good singers? Eunji has always been great, she’s been doing solo projects and OSTs forever but Bomi has always gotten the chorus/killing parts despite the face of the group being Naeun, because she has such a sweet vocal tone, which is why they based their concept around cute. It’s not that they can’t execute it, but when they have people like Bomi and Namjoo (My Darling is such a cute, relaxing yet angsty song when you listen to the lyrics, their voice makes the song so confusing to listen to because you expect it to be this loving romance song). Chorong always gets flack for her weak voice but I really like that whisper tone she has, her parts tend to be my favourite parts of the songs because it’s quite a unique voice, in my humble opinion. I honestly think Apink has never had a weak title track and they have such a tight bond with each other, I don’t think I’ve seen a girl group so loyal to each other and last so long without losing a member before.Bolbbalgan4: I know that they’re not technically a K-pop group, but if you’ve read this far then you need to branch out to other forms of Korean music, please, I beg of you. People like Heize, Suran, Baek Yerin and Davichi are so underrated and yet have such unique vocal tones yet you call Korean music industrialised… these artists (or even K-pop artists) don’t deserve the slander. Bolbbalgan4 falls into this category. Jiyoung has such a relaxing, lovely voice to listen to and her voice is great if you want to just close your eyes and think about how lovely (or depressing, Bolbbalgan4 has quite angsty songs too) life is while listening to Jiyoon’s quiet background vocals. But they’re also such two lovely characters? They’re too sweet for this world, honestly, Jiyoung has a sweet personality just like her voice, but Jiyoon’s a complete surprise lol, she’s very quiet that you’d think she’s shy and introverted but she’s so confident and quite good at dancing for someone that’s never been trained, she just saves her voice for some very truthful and savage comments. Everyone thinks Jiyoon doesn’t do much which is such a shame, because without her I don’t think Jiyoung would get the same enjoyment of singing.Miss A: Listen, JYP could’ve literally saved Miss A had he cared a little more about Jia, Fei and Min. I’m not even kidding. They could’ve done what Apink and EXID did when they had one member that was more popular and regularly give them comebacks and also equal lines, right? Sure Naeun and Hani are in the middle a lot, but Bomi gets the killing parts and the main chorus, while in EXID, a lot of the choreography is based around Junghwa and she’s in the centre a lot too plus they let them each do their own thing. The rest of the members literally had to wait around for whenever Suzy wasn’t busy doing her solo stuff to do a group comeback because clearly JYP didn’t care about the rest of them enough, no wonder it destroyed the girls’ relationships later down the line, it wasn’t any of their faults. Suzy was still dedicated to the group and always gave her all, she was never cocky about her success even though she was probably exhausted going back and forth, Jia, Fei and Min were tired from having to wait for Suzy all the time. It’s almost like JYP wanted to make them want Suzy to fail in her solo opportunities by only giving the other three work when Suzy wasn’t doing anything in her solo career. Sure, the other three may have done gigs here and there but virtually nothing compared to what Suzy was getting - and I get it, supply and demand, people wanted Suzy more but they didn’t even bother trying to do anything. And to add insult to injury, Suzy gets 50% of the line distribution in their final comeback even though, although she’s insanely talented, Min and Fei were as good (and maybe even better) than her and gets way less solo opportunities so he might as well have let them get more lines and Jia got literally nothing. Nothing. I am so frustrated because Miss A were truly the feminist icons of their generation and they were all about female empowerment and making ladies feel confident both with a man and without and it sucks because they were all so talented :(Last one: Girl’s Day. Their peak was honestly the best and I’m sad that although they haven’t disbanded, they probably won’t get together and make music again. They all had amazing stage presence and they were so charismatic onstage and I liked that we had 4 different ladies like Sojin who was more mature and liked their concept which was more mature and age-fitting, to Yura who is basically an overgrown puppy who just smiles and laughs all the time and is basically a child. All the work they did for children’s rights and equality for girls was also so admirable to see, they were and are truly the greatest role models. Sometimes people think women are forced to dress up for men and in the case of some other K-pop groups, this may be true, but Girl’s Day has always owned their sexuality and I think that’s admirable to see, especially considering how conservative Korea is whilst also showing that embracing your sexuality doesn’t mean that you are insecure with yourself by helping others, especially vulnerable children and investing time and money. I honestly think we should all turn back time because I feel like their peak was so short and they could’ve gone onto great things as a group, although I do think they’re happy now too because they’re pursuing the careers they want to pursue.",
            "date": "Answered May 17, 2019",
            "views": "15",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Blue Dude",
                    "user_href": "/profile/Blue-Dude-15"
                },
                {
                    "user_id": "Park Haru",
                    "user_href": "/profile/Park-Haru"
                },
                {
                    "user_id": "Diya Bommala",
                    "user_href": "/profile/Diya-Bommala"
                },
                {
                    "user_id": "Joe Bowman",
                    "user_href": "/profile/Joe-Bowman-46"
                },
                {
                    "user_id": "Ernest Shelton",
                    "user_href": "/profile/Ernest-Shelton-1"
                },
                {
                    "user_id": "Hanaa Hameed",
                    "user_href": "/profile/Hanaa-Hameed-2"
                },
                {
                    "user_id": "Wendy Yeol",
                    "user_href": "/profile/Wendy-Yeol"
                },
                {
                    "user_id": "Woo Chung",
                    "user_href": "/profile/Woo-Chung-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kenny Cho",
                "href": "/profile/Kenny-Cho-17"
            },
            "answer_text": " I don’t think there is one specific way in which we can measure ‘best’ since everyone’s definition is different. Some of the common criteria will include: No. of hits (or duration their hits have been on charts)Social media followingRevenue earnedHow well the members dance / sing / rapAs well as many others. But my criteria for K-Pop groups is rather different from a lot of other people. It deals with longevity. In the world of today where fads come and go in a blink of an eye, I feel that the longer someone is able to sustain themselves in the industry, the better they are.  It is important to acknowledge that since trends are constantly moving, there will be times when your songs are hits, and other times when your songs don’t make it to the charts. You win some, and you lose some, but most importantly, you are still in the game (the industry), as compared to those one hit wonders that disappear as fast as they made it to the top.  So with that in mind, here are some of what I’d consider top tier female K-Pop groups that have been around for quite some time[1]: < APink > (9 years)  < Davichi > (12 years)  < Girls’ Generation > (13 years)  < Brown Eyed Girls > (14 years)  They may not be top in the commonly expected areas but know that they are still active. As long as you are in the game, you still have a chance to make it to the top (if you haven’t yet achieved so). Whereas if you are out of the game, you go down in history and that’s it. You no longer get a chance to set new records or make it bigger. Footnotes[1] Here Are 15 Of The Longest Lasting K-Pop Groups",
            "date": "Updated September 3, 2020",
            "views": "422",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sakshi Wadekar",
                    "user_href": "/profile/Sakshi-Wadekar-5"
                }
            ]
        }
    ]
}