{
    "title": "Which bands are not often called one of the greatest bands of all time, but they should be? - Quora",
    "tags": [
        "Music History",
        "Rock Bands",
        "Bands (music)",
        "Rock Music",
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eric Johnson",
                "href": "/profile/Eric-Johnson-774"
            },
            "answer_text": "I can think of a few off the top of my head. The first being \"Humble Pie\". With Steve Marriott as the singer and front man for one ot the tightest bands that I've ever heard…. just listing to anything by them 'live' should make it clear to anyone. The funny part is how many musicians consider them to be one of their inspirations. Then there's \"Jethro Tull\"…. ranging from their own blues based rock to Rock to their own early British Isles inspired Prog Rock. Whatever one may choose to label them, they've been around, entertaining and huge for decades and certainly had enough radio hits that are instantly recognizable to make the grade. Aqualung, Locomotive Breath, Bungle in the Jungle, Cross Eyed Mary, Minstrel in the Gallery, Song From the Wood, Thick as a Brick, Too,Old to Rock and Roll (but too Young to Die), etc.. I think \"Deep Purple\" should be seen in that light as well. Richie Blackmore, Ian Gillan, Ian Paice, Jon Lord, Steve Morse, RogerGlover…that's one hell of a roster for a band. To some of us they are already but to others it's difficult to tell people just how big and important they were in the 70s. And they still have a sound that's instantly recognizable…. their 'Made in Japan' is still one of the greatest live albums 'ever!' Hell what more need I say than 'Smoke on the Water'? And finally I'd add UFO. A lot of people don't recognize or remember the name but there are a number of songs that when they're heard people automatically say \"Oh yea, I loved this tune!\". Doctor Doctor, Lights Out, Only You Can Rock Me, Natural Thing, Too Hot to Handle, etc., ring any bells? Personally I'd also add \"Golden Earring\". They've remained big in Europe through the years and had a few well known hits here in the states with 'Twilight Zone', 'The Devil Made Me Do It'….. but I'll just say 'Radar Love' and stop. ",
            "date": "Answered October 20, 2020",
            "views": "670",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Joe Guzman",
                    "user_href": "/profile/Joe-Guzman-28"
                },
                {
                    "user_id": "Glen Beers",
                    "user_href": "/profile/Glen-Beers"
                },
                {
                    "user_id": "Alan Harris",
                    "user_href": "/profile/Alan-Harris-142"
                },
                {
                    "user_id": "Richard Read",
                    "user_href": "/profile/Richard-Read-30"
                },
                {
                    "user_id": "Tony Baron",
                    "user_href": "/profile/Tony-Baron-2"
                },
                {
                    "user_id": "Paul Johnson",
                    "user_href": "/profile/Paul-Johnson-847"
                },
                {
                    "user_id": "David Clark",
                    "user_href": "/profile/David-Clark-109"
                },
                {
                    "user_id": "Jeff Jensen",
                    "user_href": "/profile/Jeff-Jensen-30"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Letourneux",
                "href": "/profile/Robert-Letourneux"
            },
            "answer_text": "Tom Petty and the Heartbreakers. I play bass in a Petty tribute, and I’m familiar with almost all the songs he’s ever written. In my opinion Petty is almost criminally underrated as far as songwriting goes. He is easily in the top ten as far as the great American singer-songwriters go, on a par with Bob Dylan, Brian Wilson, Johnny Cash, Carole King, Billy Joel, Irving Berlin, Stevie Wonder, and Bruce Springsteen. His backing band, the Heartbreakers, complemented him perfectly in everything he did, and he even got to record a couple of albums with his old band, Mudcrutch. His live shows were a spectacle of energy and great musicianship, and it’s very unfortunate that Petty chose to keep going with his 2017 tour despite being wracked with physical ailments, out of love and respect for his fans. I think that if he has stopped touring early in 2017 and gotten medical treatment then he’d probably still be with us. ",
            "date": "Answered October 20, 2020",
            "views": "355",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kevin Hunt",
                    "user_href": "/profile/Kevin-Hunt-96"
                },
                {
                    "user_id": "Tom Tobin",
                    "user_href": "/profile/Tom-Tobin-8"
                },
                {
                    "user_id": "Paul Murray",
                    "user_href": "/profile/Paul-Murray-37"
                }
            ]
        }
    ]
}