{
    "title": "Which is the best song of Neha Kakkar and why? - Quora",
    "tags": [
        "Neha Kakkar (musician)",
        "Music Recommendations",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Muktadir Khan",
                "href": "/profile/Muktadir-Khan-7"
            },
            "answer_text": "Neha Kakkar (Born 6 June 1988) is an Indian singer. She competed on season 2 of the television reality show Indian Idol in 2006 and now she is judge of this show i.e. Indian Idol 10. She also appeared in Comedy Circus Ke Taansen in 2014 on Sony TV. She had judged a singing reality show on Zee TV named Sa Re Ga Ma Pa Lil Champs. In 2008, she launched her first album, Neha-The Rock Star, whose music was composed by Meet Bros. Her other work includes the songs \"Sunny Sunny\" from movie Yaariyan, \"Manali Trance\" from movie The Shaukeens, \"Aao Raja\" with singer Honey Singh from movie Gabbar is Back, \"Dhating Naach\" from movie Phata Poster Nikala Hero, \"London Thumakda\" from movie Queen, \"Dilbar\" from movie Satyameva Jayate, \"Hanju\" (Album) with singer Meiyang Chang, and \"Patt Lainge\" (Album) with singer Gippy Grewal. The best music vlogs of Neha Kakkar are: Neha Kakkar Rain MashupPapa - Father's Day Special Song By Neha Kakkar & Tony KakkarFor all best Neha Kakkar music vlogs, visit: https://huntsends.com/neha-kakkar-music ",
            "date": "Answered October 9, 2018",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dhanishtha De",
                    "user_href": "/profile/Dhanishtha-De-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aakanksha Dhawan",
                "href": "/profile/Aakanksha-Dhawan-4"
            },
            "answer_text": "My all time favourite songs from the Neha Kakkar songs collection is “Kala Chasma” song from Sidharth Malhotra and Katrina Kaif starrer ‘Baar Baar Dekho’ have become an instantaneous chartbuster. It's far a remixed version of a famous song from Prem Hardeep and is sung by means of Neha Kakkar, Amar Arshi, and Badshah. Neha again takes the tune via its horns with a flirty, light tone to her voice and is brilliantly complemented with the aid of Amar and rap verses from Badshah. general, at the same time as the video version of the track is a whole eye grabber, it is just as catchy all via itself. The music video of 'Kala Chashma' has crossed over 20 million views in just a week and was trending video on Youtube.I always use Saavn app to listen this song in Neha kakkar songs collection on Saavn artist page. ",
            "date": "Answered February 12, 2018",
            "views": "15",
            "upvotes": "0"
        }
    ]
}