{
    "title": "Which Paul McCartney song is the worst? - Quora",
    "tags": [
        "Paul McCartney",
        "The Beatles (band)",
        "Musicians",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Clark",
                "href": "/profile/David-Clark-109"
            },
            "answer_text": "Someone’s Knocking at the Door Dumbest song I’ve ever heard. Someone's knockin' at the doorSomebody's ringin' the bellSomeone's knockin' at the doorSomebody's ringin' the bellDo me a favorOpen the door and let 'em in Someone's knockin' at the doorSomebody's ringin' the bellSomeone's knockin' at the doorSomebody's ringin' the bellDo me a favorOpen the door and let 'em in, yeah, let 'em in Sister Suzie, brother JohnMartin Luther, Phil and DonBrother Michael, auntie GinOpen the door and let 'em in, yeah Sister Suzie, brother JohnMartin Luther, Phil and DonUncle Ernie, auntie GinOpen the door and let 'em in, yeah Someone's knockin' at the doorSomebody's ringin' the bellSomeone's knockin' at the doorSomebody's ringin' the bellDo me a favorOpen the door and let 'em in, ooh yeah, let 'em in Sister Suzie, brother JohnMartin Luther, Phil and DonUncle Earnie, uncle LinOpen the door and let 'em in, yeah Someone's knockin' at the doorSomebody's ringin' the bellSomeone's knockin' at the doorSomebody's ringin' the bellDo me a favorOpen the door and let 'em in, yeah, yeah, yeah, yeah, yeah ",
            "date": "Answered April 7, 2020",
            "views": "426",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kevin Barrett",
                    "user_href": "/profile/Kevin-Barrett-9"
                },
                {
                    "user_id": "Jon Michael Marcos",
                    "user_href": "/profile/Jon-Michael-Marcos"
                },
                {
                    "user_id": "Garry Stripling",
                    "user_href": "/profile/Garry-Stripling"
                },
                {
                    "user_id": "Janet Fesler",
                    "user_href": "/profile/Janet-Fesler"
                },
                {
                    "user_id": "Bill Nagle",
                    "user_href": "/profile/Bill-Nagle-2"
                },
                {
                    "user_id": "Jim Busbin",
                    "user_href": "/profile/Jim-Busbin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harold Philip Benson",
                "href": "/profile/Harold-Philip-Benson"
            },
            "answer_text": "Unless you’re into ‘experimental’ music, “Wild Honey Pie” from the White Album is pretty bad as music. It’s dissonant and scratchy sounding, with no real melody, just a climb down the scale with ugly guitar scratches or something that sounds like steel wires being scraped on a blackboard. Paul’s voices are very shrill as well. In other words, there’s no sensual pleasure from this bit of noise for me. ",
            "date": "Answered April 8, 2020",
            "views": "331",
            "upvotes": "0"
        }
    ]
}