{
    "title": "Which engineer will work on electric vehicles? Can a vehicle or automotive engineering or vehicle engineering work on electric cars? - Quora",
    "tags": [
        "Vehicle Engineering",
        "Automotive Engineering",
        "Engineers",
        "Electric Vehicles"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mohan Reddy",
                "href": "/profile/Mohan-Reddy-38"
            },
            "answer_text": "Being in an EV company I can share some information on this. We have Electrical engineers : for fast and on board charger, motor controller, motor design, simulation and development Chemical engineers: battery pack and cell design, modeling and testing Thermal engineers: thermal modeling and thermal management of different vehicle components Mechanical engineers : for designing every individual component and vehicle Embedded engineers : for hardware, software and testing Including all we have CAE engineers, thermal engineers, embedded engineers, vehicle simulation engineers, design engineers, software and hardware design engineers, power electronic engineers, quality control, proto development engineers, emi/emc engineers, system architect and integration engineers, harness development engineers, testing engineers etc. All these people are from basic engineering branches mentioned above with specialized skills in specific areas. With my experience I can say that one doesn't have to be from a specific engineering branch to work in EV industry, if you have the right expertise and knowledge your engineering branch doesn't matter much. ",
            "date": "Answered December 19, 2017",
            "views": "136",
            "upvotes": " View 55 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Asutosh Mishra",
                    "user_href": "/profile/Asutosh-Mishra-72"
                },
                {
                    "user_id": "Mayan Kansal",
                    "user_href": "/profile/Mayan-Kansal"
                },
                {
                    "user_id": "Jesús García Gutiérrez",
                    "user_href": "/profile/Jesús-García-Gutiérrez"
                },
                {
                    "user_id": "Abhijit Moitra",
                    "user_href": "/profile/Abhijit-Moitra-1"
                },
                {
                    "user_id": "Navita Kukreti",
                    "user_href": "/profile/Navita-Kukreti-2"
                },
                {
                    "user_id": "Md Naseer",
                    "user_href": "/profile/Md-Naseer-11"
                },
                {
                    "user_id": "Deepak Bind",
                    "user_href": "/profile/Deepak-Bind-5"
                },
                {
                    "user_id": "Ayush Raj Shah",
                    "user_href": "/profile/Ayush-Raj-Shah"
                },
                {
                    "user_id": "Ravikant Sharma",
                    "user_href": "/profile/Ravikant-Sharma-47"
                },
                {
                    "user_id": "Himanshu Harsh",
                    "user_href": "/profile/Himanshu-Harsh-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joshua Gross",
                "href": "/profile/Joshua-Gross-8"
            },
            "answer_text": "I’d follow Tim Kulogo’s advice, or go for chemistry or chemical engineering if batteries interest you. The electrical aspects of a vehicle like a Tesla aren’t really very radical, other than the batteries. That’s where innovation is. John Corey is correct that in many (but not all) engineering programs, you just take engineering core classes in your first year. It’s more important to succeed than to be in a particular major; a high level of mastery (and good GPA) trumps a low level of mastery in the “right” field; there’s no form of engineering that doesn’t touch the automotive world. Note that you may not begin in the automotive world. It’s competitive. That doesn’t mean you can’t end up there later. Good luck! ",
            "date": "Answered October 22, 2020",
            "views": "313",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gerry Surette",
                    "user_href": "/profile/Gerry-Surette-1"
                },
                {
                    "user_id": "Vishwam Khapre",
                    "user_href": "/profile/Vishwam-Khapre"
                },
                {
                    "user_id": "Sebastian Müller",
                    "user_href": "/profile/Sebastian-Müller-9-1"
                },
                {
                    "user_id": "Ankita Krishnan",
                    "user_href": "/profile/Ankita-Krishnan-5"
                },
                {
                    "user_id": "James Lacey",
                    "user_href": "/profile/James-Lacey"
                }
            ]
        }
    ]
}