{
    "title": "Which idol industry do you believe is worse overall, J-pop or K-pop? - Quora",
    "tags": [
        "Music in Japan",
        "J-Pop",
        "K-Pop Idols"
    ],
    "response": [
        {
            "author_info": {
                "name": "Terra Bogard",
                "href": "/profile/Terra-Bogard"
            },
            "answer_text": "I think both countries are equally fucked up when it comes to the idol industry. Japan’s biggest idol agencies include Johnny’s Entertainment ( all-boys), HP! Project ( All-girls), and that AKB48 producer who created countless of female idols ( extremely famous in Japan, but unknown in the rest of Asia). In South Korea, we have the big 3, who dominated Kpop idol scenes for years. There are SM Ent, JYP Ent, and also YG ent. One of the advantages of Kpop idol agencies is that they’re always trying to push their idols popularity all over Asia or precisely, around the world, which is good for the idols’ exposure and influences. Then we have Japanese idols, whose producers or agencies literally giving zero fuck internationally ( except AKB48 producer whom giving all out to promote his talents but I find it rather pathetic since their popularity in Asia is still not that impressive despite all the trials and exposures). Take another example from a different agency which is Johnny’s Entertainment, whose idols are all boys, the company previously only gives a damn about domestic markets and makes it extremely hard for international fans to support their talents. Now, with Kpop being dominant all over Asia and even in Japan, the company now feels threatened by the rapid competition that they need to face and most of the fans that I knew already left Jpop and moved to Kpop fandom. Jpop idols now have becoming the things of the past and this is the fault of their management for being a snob. Kpop idols still dominating Asia / and about to send their influence to the west ( e.g BTS). However, their management often treats their talents mercilessly ( though not all the time). ",
            "date": "Answered September 14, 2018",
            "views": "88",
            "upvotes": " View 40 Upvoters",
            "upvoters": [
                {
                    "user_id": "Era White",
                    "user_href": "/profile/Era-White-2"
                },
                {
                    "user_id": "Scarlett E. Peach",
                    "user_href": "/profile/Scarlett-E-Peach"
                },
                {
                    "user_id": "Kim See Eul",
                    "user_href": "/profile/Kim-See-Eul"
                },
                {
                    "user_id": "Love Jeju",
                    "user_href": "/profile/Love-Jeju"
                },
                {
                    "user_id": "Kevin Lin",
                    "user_href": "/profile/Kevin-Lin-252"
                },
                {
                    "user_id": "Jingyi Pan",
                    "user_href": "/profile/Jingyi-Pan-4"
                },
                {
                    "user_id": "Park Dae Yang",
                    "user_href": "/profile/Park-Dae-Yang"
                },
                {
                    "user_id": "Yanna Lim",
                    "user_href": "/profile/Yanna-Lim"
                },
                {
                    "user_id": "Sherry Yohn",
                    "user_href": "/profile/Sherry-Yohn"
                },
                {
                    "user_id": "Deepshikha Bora",
                    "user_href": "/profile/Deepshikha-Bora"
                }
            ]
        }
    ]
}