{
    "title": "Which music is used in australian masterchef? - Quora",
    "tags": [
        "MasterChef (1990 TV series)",
        "Reality Television",
        "Song Identification",
        "Australia"
    ],
    "response": [
        {
            "author_info": {
                "name": "Larry John Page",
                "href": "/profile/Larry-John-Page"
            },
            "answer_text": "I thought to add here because the masterchef playlist is quite good. The Music of MasterChef by meemalee, a playlist by meemalee on Spotify Masterchef fans have one major complaint about this year's season. But not everyone is happy with the music played. The idea is to overshadow amateur cooks I think. People are inundated with cooking shows so the competitive edge is a mentality of comforting the viewer. Classical music modernised is a comtemporism that seems to work better than any commentary as the boring dialogue can be just that boring. The music does take the edge out of any emotional problems which could be nerves, which is a good idea by the judges. Fairness must prevail. The diversity of the playlist is very interesting, it does compliment a cooking show, imagining playing this music as you prepare your own meals. Award high note for The DA's Office duo behind MasterChef music The music probably is mostly for when they are away from the studio. The thing is you do not feel to sing along, you just watch with a more serious thoughtfulness So well done! ",
            "date": "Answered October 7, 2018",
            "views": "106",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Neil Randell",
                "href": "/profile/Neil-Randell-2"
            },
            "answer_text": "Theme tune is Hot N Cold by Katy Perry  ",
            "date": "Answered July 19, 2018",
            "views": "49",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Avani Nadkarni",
                    "user_href": "/profile/Avani-Nadkarni"
                },
                {
                    "user_id": "Deborah Eden",
                    "user_href": "/profile/Deborah-Eden-2"
                },
                {
                    "user_id": "Aditi P",
                    "user_href": "/profile/Aditi-P-6"
                },
                {
                    "user_id": "Vishal Benhur",
                    "user_href": "/profile/Vishal-Benhur"
                },
                {
                    "user_id": "Ari",
                    "user_href": "/profile/Ari-934"
                }
            ]
        }
    ]
}