{
    "title": "Which female singer has the highest vocal range? - Quora",
    "tags": [
        "Vocal Range",
        "Singers",
        "Voice",
        "Singing",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kenneth Jaffe",
                "href": "/profile/Kenneth-Jaffe-1"
            },
            "answer_text": "Aside from the pop singers already mentioned, there are a number of coloratura soprani or soprani WITH coloratura extensions who are renowned for their stable, high voices. Edita Gruberova comes to mind. In 2017, Audrey Luna sang the highest note EVER sung at the Metropolitan Opera history, an A natural above high C: Hitting the highest note in New York Here are some other examples of this ASTONISHING voice:  Other coloratura soprani whose ranges are probably comperable are Rachele Gillmore:  I would not be surprised if Edita Gruberova had a high, high A in her, as well:  Natalie Dessay is also up there:  Are these coloraturas once a decade flukes? Seems not!!!!:  after some digging, it seems like the Queen of all high notes can be arguably given to French 20th C coloratura, Mado Robin:  But wait! Don’t count out Erna Sack and the infamous Yma Sumac!  Don’t these ladies make Maria Carey and Ariana Grande sound downright BORING???? This was a journey for me to discover some of these vocal treasures! I hope you enjoyed them, too! ",
            "date": "Answered September 7, 2020",
            "views": "341",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Veronica Ribeiro-Accouche",
                "href": "/profile/Veronica-Ribeiro-Accouche"
            },
            "answer_text": "Soprano. The soprano's vocal range (using scientific pitch notation) is from approximately middle C (C4) = 261 Hz to \"high A\" (A5) = 880 Hz in choral music, or to \"soprano C\" (C6, two octaves above middle C) = 1046 Hz or higher in operatic music. Roles: Alto; Tenor Soprano - Wikipedia https://en.wikipedia.org › wiki › Soprano  ",
            "date": "Answered December 27, 2019",
            "views": "301",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shahnaz Fathirrizky",
                    "user_href": "/profile/Shahnaz-Fathirrizky"
                },
                {
                    "user_id": "Ninette Dismon",
                    "user_href": "/profile/Ninette-Dismon-1"
                }
            ]
        }
    ]
}