{
    "title": "Which K-pop company should I audition for? - Quora",
    "tags": [
        "Auditions",
        "K-Pop",
        "Companies"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dakota",
                "href": "/profile/Dakota-74"
            },
            "answer_text": "Well based on your description, you kind of are being picky (no hate) So I did some research and found a smaller company like you are asking for. It seems like a pretty good company to me….. Woollim Entertainment Something interesting I found about this entertainment is they used to be merged with SM Entertainment, but now they are an independent entertainment, so they separated. Back in 2016, a group called INFINITE, their comeback was a big hit (haha no pun intended) it’s been a success all up to this point. There is another group called Golden Child and when they debuted in August 2017, their song called ‘DamDadi’ there was lots of talking about them from their high energy and youthfulness. Heres the website if you want to take a look Top 10 K-Pop Entertainment Companies in 2017 - Startup Radar SM Entertainment Yes, hear me out. I know you said you don’t really wanna go to SM because it’s a little racist. BUT, there are some artists that are foreigners and are still under SM. They are still successful too! Yes, there may be some racism here and there but if you want to be an idol, you HAVE to go through struggles once and a while…. There are some other companies out there, but some of them are pretty small ( like really small ). You can keep looking for other entertainments but if I were you I would try SM, Starship, FNC, or Woollim. ",
            "date": "Answered December 15, 2018",
            "views": "559",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ur Cutie",
                    "user_href": "/profile/Ur-Cutie"
                },
                {
                    "user_id": "Sofia Lily",
                    "user_href": "/profile/Sofia-Lily-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Genevieve Mei",
                "href": "/profile/Genevieve-Mei"
            },
            "answer_text": "This is not an answer. This is just a description for the question. I’m not trying to be picky or anything, but I would rather not have the Big 3, Cube or Pledis. BigHit doesn’t accept female trainees, so that’s out of the question. I actually want to go to a smaller company, not saying that I want a better chance of getting debuted but… YG is now more looks than talent. And I don’t want to be in some shitty dungeon. SM has plastic surgery and is strict. I also heard they’re a little bit racist (to foreign trainees, I’m a Malaysian Chinese, and their treatment to Chinese idols are…). Anyways, I’m not saying that I’m not choosing SM because of plastic surgery, but I would rather not be forced to go, like “if you don’t get plastic surgery, you won’t get to debut,” but personally I think I don’t need plastic surgery, I have the V-shaped jaw, my eyes aren’t doll-like big but they suit my face, my nose isn’t big, and my lips are quite pretty. I don’t mind minor enhancements, but I sure as Hell don’t need Yuta’s surgery. JYP’s great and all, but he lets go of so many trainees, like Jeon Somi. And besides, JYP will have a new girl group, if I audition now, I’ll have to wait even longer. Cube has Pentagon, CLC and HyunA’s problem. I don’t want to be part of that mess. I heard Pledis silences idols that leave Pledis, and I heard it’s really bad, so… no. I was gonna try Starship and FNC, but are there any alternatives? Just in case I don’t manage to get in both. ",
            "date": "Answered December 2, 2018",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Morgan",
                "href": "/profile/John-Morgan-11"
            },
            "answer_text": "You should go for agencies that match your style. It sounds like you like Blackpink, so YG would be a good first option. But as always, tens of thousands apply for every trainee slot available in the big 3. So you may want to apply to several agencies if you’re really serious about getting in somewhere. You haven’t really given us much to go on for recommendations as “good singer, average dancer” fits just about every agency’s profile. Be aware that k-pop is heavily dependent on looks, even at supposedly talent-focused agencies like YG. Also the beauty standard in Korea is pale skin, not tanned, so you might want to go heavy on the sunscreen while you’re auditioning. ",
            "date": "Answered July 5, 2017",
            "views": "476",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ada Shen",
                    "user_href": "/profile/Ada-Shen-3"
                },
                {
                    "user_id": "Maggie Sun",
                    "user_href": "/profile/Maggie-Sun-23"
                },
                {
                    "user_id": "Rebecca Hua",
                    "user_href": "/profile/Rebecca-Hua"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lorraine Min",
                "href": "/profile/Lorraine-Min"
            },
            "answer_text": "Based on the fact that you prefer Blackpink’s style - my immediate answer would be that audition for YG. YG is the only one (that I can think of right now) that hasn’t made his girl group do a cute concept. He does fun concpets, but not cute. All the other companies like to start of cute and the gradually mature over time as they gain popularity. ",
            "date": "Answered June 28, 2017",
            "views": "157",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Matt Guang",
                    "user_href": "/profile/Matt-Guang"
                }
            ]
        },
        {
            "author_info": {
                "name": "Moon Roses",
                "href": "/profile/Moon-Roses-1"
            },
            "answer_text": "If you're a male/non-binary/other gender except female then Big Hit Entertainment is the best company to audition for. If you're a female then Woollim Entertainment is the best company to audition for. I know a lot about other companys and I can expose most of them and how they treat their trainees and idols but Big Hit and Woollim seem to be the best so far. ",
            "date": "Answered December 18, 2018",
            "views": "68",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Charlie Chippendale",
                "href": "/profile/Charlie-Chippendale"
            },
            "answer_text": "Personally, I like the company JYP. But of course JYP is one of the big three groups so its extremely hard to get in. I’m not an expert or any thing but smaller companies are also not bad. Do your research before auditioning. But also addition to as many places as possible. Pick what suits you best. (Also if/when you addition good luck!) ~Sage ",
            "date": "Answered March 23, 2019",
            "views": "93",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Upasana Arora",
                    "user_href": "/profile/Upasana-Arora-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Naura Whsf",
                "href": "/profile/Naura-Whsf"
            },
            "answer_text": "if you a foreigner, i recommend you choose JYP entertaiment, how about SM? may be. but you should trainees most hard than other agency. or pledis entertaiment, other than that. they have online audition that you can follow anywhere, anytime. they are also good to foreigner. ",
            "date": "Answered December 9, 2018",
            "views": "43",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brandon Back",
                "href": "/profile/Brandon-Back-7"
            },
            "answer_text": "A2A. Thanks. Sorry, but you are being picky. You basically eliminated all the good companies. Other than those, there are only WM and DSP left. They also have their own problems. ",
            "date": "Answered December 2, 2018",
            "views": "78",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Say-32"
                }
            ]
        }
    ]
}