{
    "title": "Which sound better, Cantonese songs or Mandarin songs? - Quora",
    "tags": [
        "Mandarin Songs",
        "Cantonese Song",
        "Cantonese (language)",
        "Sound"
    ],
    "response": [
        {
            "author_info": {
                "name": "Meng Vang Xiong",
                "href": "/profile/Meng-Vang-Xiong"
            },
            "answer_text": "For me as a Asian-American who majored in Chinese and now working and living in China (and who also loves to sing at KTV), it was never about whether the song is in Cantonese or Mandarin (because there are also many Hokkien songs that are often sung at karaoke bars here in China by those who don’t even speak Hokkien), but more importantly does the song have good lyrics, how is the medley, does the song sing to your heart and soul, is the singer good, the instrumentation, the mixing etc. However, there are some times where one version is probably preferred more. Often this is the case where a particular Chinese song, especially many pop songs in the 90s from Hong Kong, will have both a Cantonese and Mandarin version. Although Cantonese and Mandarin are more or the less the same when written in standard Chinese (disregarding Cantonese songs that were intentionally written in colloquial Cantonese such as many Sam Hui’s songs), it’s uncommon that the Cantonese and Mandarin version of one song will share the exact lyrics. Sometimes, they’re not even the same lyrics yet the medley is still the same. Theoretically, you could sing the Cantonese version of the song in Mandarin and vice versa but it would sound strange, even though the meaning is still understandable across. Especially in Cantonese, certain words in the lyrics rhyme however will not rhyme in Mandarin. Another reason why many HK pop songs will have Mandarin lyrics added is to allow for a broader audience to have access to the song who may not be able to understand, let alone, sing in Cantonese. One of my good friends is a die hard Jackie Cheung fan who is from Ningxia, and even though he doesn’t speak Cantonese, he will always sing the Cantonese versions of Jackie Cheung’s songs. He says, they sound better in Cantonese where the Mandarin lyrics are sometimes quite strange. On the other hand, one of my wife’s favorite singers is Wong Faye and she has several songs that were originally written in Mandarin with Cantonese lyrics added later. Are the Cantonese lyrics bad? No, but compared to the original Mandarin lyrics, there is a certain feeling of the original song that has been lost because the lyrics are totally different. That reminds me. There was one song many years ago that became very popular because Mandarin lyrics were added yet it had existed originally as a Cantonese song. The Mandarin version is “爱情转移” from Eason Chan (not to confuse with Edison Chen, the famous photographer - LOL) and the original Cantonese version is “富士山下” (also sung by Eason Chan). The song was used as a theme song for a Mainland Chinese film called “爱情呼叫转移” (Call For Love) and was a popular film back in 2007. ",
            "date": "Answered February 21, 2019",
            "views": "411",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Finn Yeung",
                    "user_href": "/profile/Finn-Yeung-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deepak Assudani",
                "href": "/profile/Deepak-Assudani"
            },
            "answer_text": "There are 9 maximum tones for a lot of words in Cantonese, whereas in Mandarin there are only 4. So it is definitely easier for Cantonese lyrics to sound just as they would in normal conversations (because it is more likely for the lyricist to find words that fit the corresponding musical note). IMO Cantonese lyrics have a larger effect to its audience, because it’s as if they are “spoken” to you (aaaaaaahh, saw that pun? lol) Mandarin songs on the other hand are also really nice, but for me it’s more to do with the level of talent they have in mainland China…Afterall, there are 1.3bn people in mainland China, and only 7m in Hong Kong. As for me, I am from Hong Kong, but I am also what I call “auditory lyrically dislexic”, so I like Mandarin songs for their range of singers, and I like Canto songs for familiarity; lyrics don’t get factored in for me, unfortunatley. Some guy @_= ",
            "date": "Answered February 28, 2018",
            "views": "941",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Darren Yuen",
                    "user_href": "/profile/Darren-Yuen-1"
                },
                {
                    "user_id": "Pierrick (ព្យែរិក) Jaouen",
                    "user_href": "/profile/Pierrick-ព្យែរិក-Jaouen"
                }
            ]
        }
    ]
}