{
    "title": "Which song makes you feel better right away and why? - Quora",
    "tags": [
        "Mood",
        "Songs",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Philip Jones",
                "href": "/profile/Philip-Jones-285"
            },
            "answer_text": "“If there's a hell below, we're all gonna go” by Curtis Mayfield. It conjures up memories of Blaxploitation films from the 70s. Films like Shaft, Superfly and Foxy Brown. It evokes scenes of crumbling dilapidated tenements in wastelands like the South Bronx, and groups of African American bums singing a capella around a fiery trash can on a cold Wintery night. I love it. It makes me want to be black and to be a twenty six year old street criminal in 1970s New York City. Fact is, I want to be the main character in Across 110th Street, hunted by the Mafia and the Police, and getting chased across the rooftops of the Bronx by Detectives Yaphet Kotto and Anthony Quinn in the final five minutes of the film, and dying to the sound of Bobby Womack singing Across 110th Street; just another doomed black American, with a name like John Youngblood, who went up against The Man … and lost.   ",
            "date": "Answered March 2, 2019",
            "views": "127",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Melia Janssen",
                "href": "/profile/Melia-Janssen"
            },
            "answer_text": "Any upbeat uplifting song, one which you could preferably dance to. 500 miles by The Proclaimers   You Spin Me Round by Dead or Alive   Our House by Madness   My Sharona by The Knack   Got My Mind Set On You by George Harrison   Back to Life by Soul II Soul   Unfinished Sympathy by Massive Attack   Weapon of Choice by Fatboy Slim   Whatever you want by Pink  ",
            "date": "Answered March 2, 2019",
            "views": "279",
            "upvotes": "0"
        }
    ]
}