{
    "title": "Which music groups from the 1960s are still remembered and enjoyed in today's world? - Quora",
    "tags": [
        "1960s Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Darrell Spencer",
                "href": "/profile/Darrell-Spencer-5"
            },
            "answer_text": "For one, The Beatles. The greatest, most influential and beloved rock band of all time. The Fab Four set the bar so high that it would be impossible for anyone else to approach it. The Rolling Stones. This fabulous band is the Energizer Bunny of rock 'n' roll. They just keep going and going. Gotta love 'em. The Beach Boys. The most influential American group of all time, this band was serious competition for The Beatles during the '60s. The Kinks. Sort of a cross between The Beatles and the Rolling Stones, this band has had an enormous influence on everyone from Oasis to the Pretenders to The Who. Speaking of… The Who. This band may have been the Big Bang which led to punk rock. The Monkees. Perhaps the first “boy band”, this group is beloved by millions despite their origins as made-for-TV Beatles clones. They released some of the finest pop tunes of the '60s. ",
            "date": "Answered October 16, 2020",
            "views": "21",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andy Roper",
                    "user_href": "/profile/Andy-Roper-6"
                },
                {
                    "user_id": "Michael Fisher",
                    "user_href": "/profile/Michael-Fisher-147"
                },
                {
                    "user_id": "Alex Davies",
                    "user_href": "/profile/Alex-Davies-137"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Knowler",
                "href": "/profile/Mike-Knowler"
            },
            "answer_text": "The Beatles, The Turtles, The Beach Boys, Crosby Stills & Nash, The Byrds, Them, The Pretty Things, The Rolling Stones, The Monkees, The Yardbirds, The Hollies, The Dave Clarke Five, Herman’s Hermits, Buffalo Springfield, Cream, Led Zeppelin, The Who, The Small Faces, The Mothers of Invention, Captain Beefheart & the Magic Band,The Doors, Love, Sam Gopal, The Grateful Dead, ",
            "date": "Answered October 15, 2020",
            "views": "41",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Louis Weltzer",
                    "user_href": "/profile/Louis-Weltzer"
                },
                {
                    "user_id": "Lowell Brams",
                    "user_href": "/profile/Lowell-Brams"
                },
                {
                    "user_id": "Duayne Koltowicz",
                    "user_href": "/profile/Duayne-Koltowicz"
                }
            ]
        }
    ]
}