{
    "title": "Which are the cheap and best electric guitar under 10k? - Quora",
    "tags": [
        "Electric Guitars",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sameer Prabhu",
                "href": "/profile/Sameer-Prabhu"
            },
            "answer_text": "Highly recommend the Java EG11, the first electric guitar i ever bought, back in 2004. Made in Indonesia. Paid INR 4500 for it back then. Was a fantastic guitar from a beginner perspective. Paired with a Marshall MG10CD amp, also costing INR 4500. There has been no change in the tonal quality or physical alterations over the years. It sounds and plays just as well as it did 12 years ago. Gave it to a friend a few years ago when i bought my current guitar (Cort X6 SM) and a Digitech RP355 processor. He is a beginner and is quite happy with the action and tone. Is making steady progress as well. So no issues there. Another friend looking for an entry level electric guitar bought the Japanese Aria STG 004 based on my suggestion and is also quite happy with the purchase. The tone and action is just as good as the Java in my opinion. Hence if you are looking for strat style guitars these are two good options. Yamaha Pacifica Series is also a good choice though slightly over your budget. But if you can stretch that far, you can also opt for a Fender Squier Bullet strat. If you are looking for Les Paul style designs Cort CR (Classic Rock) series is a really good choice in my opinion. **If you are a beginner and looking for your first guitar please take the time to go and physically try out the guitar you want to buy. Listening to the instrument is as important as experiencing it in your hands. How it feels and how it sounds may not be the same as how it looks. See what gear your favorite guitarists use to get an idea of the hardware you’d need. Don’t just buy for looks if you are serious about playing and learning.** Good Luck!! God Speed! :) ",
            "date": "Answered December 16, 2016",
            "views": "956",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Binoy Mishra",
                "href": "/profile/Binoy-Mishra"
            },
            "answer_text": "I bought a Vault Guitar (model RG1RW) from Bajaao.com for 8.5k. I am quite happy as my copy came set up pretty well. Although its cheap, it holds tune well and also the pick ups are very decent. The negatives are the fit and finish. The paint job is not as good as a Fender or a Epiphone but its more than enough for a beginner like me. However do keep in mind that buying guitar online is not a very good idea, especially for a beginner. I would suggest go to your nearest musical shop and get a feel of the guitars before buying. And please don't go for the cheap local brands like Givson (not Gibson), Juarez(not Ibanez), Yemaha(not Yamaha). Apart from the obvious plagiarism issues, such guitars seldom turn out to be fine. I would suggest Cort X1 and Squier Bullet. These two are very nice guitar for beginners. Best of luck. ",
            "date": "Answered June 24, 2017",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "G.N. Jaiswal",
                    "user_href": "/profile/G-N-Jaiswal"
                },
                {
                    "user_id": "Arpan Mukherjee",
                    "user_href": "/profile/Arpan-Mukherjee-61"
                }
            ]
        }
    ]
}