{
    "title": "Which guitar do you prefer: Gibson, Les Paul, or Fender Stratocaster? Why? - Quora",
    "tags": [
        "Gibson",
        "Les Paul",
        "Fender Stratocaster",
        "Fender Guitars",
        "Electric Guitars",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Curci",
                "href": "/profile/Jeff-Curci"
            },
            "answer_text": "This question will be answered based on personal taste and have pros and cons from both sides..like fans of a particular sports franchise, the LP vs Strat debate is personal. That said I am a Les Paul man. I've been playing for over 40 years now..I have owned quite a few of both, they both have their place and are useful in whatever situation the music you're creating needs. I would say a huge part of my original desire to own and play an LP was based on the bands I was listening to and the players I so wanted to emulate. Guys like Jimmy Page, Ace Frehley and Gary Moore where always seen playing Les Pauls and I wanted one so bad. When I was 10 my father bought my brother and me each a cheap copy guitar and one amp..my brother got the strat copy and I got the Montoya LP. Mostly because I kicked and screamed bloody murder for it. Heroes aside, the style of music I play (Metal, Rock, heavy blues) just sounds better with humbucker pickups. Back then Strats were all single coil pickups and always sounded \"thin\" to me. I found myself trying to play harder and turning the gain to max trying to get my brothers strat copy to sound like my LP whenever I tried his guitar. Now on the flip side, a strat sounds better to me when I play soulful bluesy stuff. Stuff like Pink Floyd type solos just sound better when played on a single coiled strat. Country styled music sounds better on a single coiled guitar and so does some of the Pop music of today (albeit hard pressed to actually hear the guitar in the mix). Now days Strats are available with both simgle coil and humbuckers, so you can get the best of both worlds...but then you have other factors. Body, neck and fretboard woods, thickness of the body, routing pattern or weight relief of the body. Here again the Les Paul adds so much to the tones needed for the style of music I play. The bigger, heavier body give a deeper tone. Less of that \"thin\" strat sound. My current Gibson Les Paul has coil tapping, so I can split the humbuckers and use them like a single coil if I want...suffice to say the strat is collecting dust. ",
            "date": "Answered August 7, 2017",
            "views": "598",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amrit Janardhanan",
                    "user_href": "/profile/Amrit-Janardhanan-1"
                },
                {
                    "user_id": "David Eugene Wilson",
                    "user_href": "/profile/David-Eugene-Wilson-1"
                },
                {
                    "user_id": "Federico Lymon",
                    "user_href": "/profile/Federico-Lymon"
                }
            ]
        },
        {
            "author_info": {
                "name": "D.C. Daley",
                "href": "/profile/D-C-Daley"
            },
            "answer_text": "I’ve always been a strat guy. When I was 15 my father bought me a strat, and that has always been my main guitar. A couple of years ago I bought a 57′ reissue custom shop black beauty. Really beautiful guitar, but to me it seems “rigid”. I own a few Gibson’s and they don’t all feel that way to me. I have a beautiful Howard Roberts fusion guitar, and a 120th anniversary melody maker, and a really nice Epiphone SG. To me, a strat feels more ““personal”. I like the way it “fits” me. Although I have to admit, the most comfortable guitar to play so far for me is a Fender jazzmaster. It just rests in just the right play when i play it. Has nice balance. Hard to explain. My Les Paul is heavy as with all Les Paul's, which is what gives it so much sustain. I have an American tele with 2 Seymour Duncan humbuckers with coil taps, and that guitar has lots of sustain also. A strat has some unexplainable ““glassy softness” to it. It all comes down to personal preference. I know jazz guys prefer Gibsons. Jimi Hendrix likes strats. I’m going with Jimi. ",
            "date": "Answered April 27, 2020",
            "views": "84",
            "upvotes": "0"
        }
    ]
}