{
    "title": "Which electronic drum kit should a beginner buy? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Michael Coffman",
                "href": "/profile/Michael-Coffman-1"
            },
            "answer_text": "If it's well-used in your city, keep an eye on Craigslist. I have an acoustic kit, but with young kids, I can't use it in the evenings or early in the morning.  I kept my eyes open and eventually found a used Yamaha DTXIIIs kit with a bunch of extras and upgrades in good shape for about 2/3 of the average Craigslist price.  There are deals out there when you take your time looking - just start searching to get a feel for the market, and be ready to make a purchase when you find a deal. A couple of observations: 1.  The mesh heads do feel good (my kit has a Roland kick pad instead of the original Yamaha), but they're a lot more expensive.  I haven't found the regular Yamaha pads to be that much of a pain. 2.  Spend some time testing the cymbals and snare (if they're multi-zone heads) to make sure they all trigger well. 3.  Yamaha kits have a set of fairly cheesy MIDI loops built in that you can practice along with (I assume Roland has something similar).  I didn't expect to use these at all, but I was surprised to find that I use them a ton.  It's a quick way to get a bunch of different feels over a steady groove. 4.  If you can find one that has a separate speaker system, make sure it has a decent amount of power.  I lucked into an upgraded set of speakers and sub (I think it's 150w) that I can use to play along with other people in my basement.  If it was the lower-end 50w practice set, the levels would be too low to get a realistic feel. 5.  Make sure the head has a 1/8\" line-in whose volume can be controlled independently of, and mixed with, the drum kit.  Then patch a phone or laptop into it, and you can play along with Spotify, Pandora, YouTube, etc.  Both Spotify and YouTube have a lot of \"minus the drums\" jam tracks that you can play along with.  There are also a ton of lessons on YouTube, and it's great to be able to set an iPad next to the kit and hear the audio coming in over the headphones with the drums while you watch the video. 6. Gorilla Snot (available from Amazon) is great if you have problems holding the sticks when it's really dry in the winter.  It works wonders on guitar picks, too. Good luck with your search! ",
            "date": "Answered February 7, 2013",
            "views": "32",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Xavier Ramirez",
                    "user_href": "/profile/Xavier-Ramirez-23"
                },
                {
                    "user_id": "Alvaro Beleza",
                    "user_href": "/profile/Alvaro-Beleza-2"
                },
                {
                    "user_id": "Lorenzo Peroni",
                    "user_href": "/profile/Lorenzo-Peroni"
                },
                {
                    "user_id": "Amol Verma",
                    "user_href": "/profile/Amol-Verma"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nick Cesarz",
                "href": "/profile/Nick-Cesarz-2"
            },
            "answer_text": "For beginners, the entry-level lines from Alesis are a pretty solid start. They have quite a few options that are rather affordable. When I was learning, e drums were far more expensive, so be thankful they exist. Alesis Surge MeshAlesis Nitro MeshAlesis Turbo Mesh (most affordable)Alesis Strike (most expensive)I own the Alesis Strike[1] — it’s got its quirks, but overall, it does contend with the more expensive options from Roland and Yamaha. If you’re just looking for a kit to practice on, stay cheap. I think the Nitro Mesh retails just under $400, which is super affordable for an electronic drum kit. It even includes mesh heads, which was a pipedream for cheap e-kits just a few years ago. The sounds aren’t the greatest, and the size is smaller in comparison to an acoustic drum set, but it does get the job done for practicing and keeping the noise down. I’ve gone rather in-depth in my electronic drum set roundup, so be sure to have a read if you’re looking for more information on e-kits. Footnotes[1] Alesis Strike Pro Review: Does It Stand Up To The Competition?",
            "date": "Answered October 22, 2019",
            "views": "125",
            "upvotes": "0"
        }
    ]
}