{
    "title": "Which song are these lyrics taken from: “Once bitten and twice shy, I keep my distance But you still catch my eye”? - Quora",
    "tags": [
        "1980s Music",
        "Song Meanings",
        "Facts and Trivia",
        "Song Lyrics",
        "Rock Music",
        "Song Identification",
        "Music Recommendations",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jean Laurent",
                "href": "/profile/Jean-Laurent-5"
            },
            "answer_text": "Last Christmas by Wham! and George Michael (1984).  Lyrics Last Christmas, I gave you my heartBut the very next day you gave it awayThis year, to save me from tearsI'll give it to someone special Last Christmas, I gave you my heartBut the very next day you gave it awayThis year, to save me from tearsI'll give it to someone special Once bitten and twice shyI keep my distanceBut you still catch my eyeTell me, babyDo you recognize me?Well, it's been a yearIt doesn't surprise me(Merry Christmas!) I wrapped it up and sent itWith a note saying, \"I love you, \" I meant itNow, I know what a fool I've beenBut if you kissed me nowI know you'd fool me again Last Christmas, I gave you my heartBut the very next day you gave it awayThis year, to save me from tearsI'll give it to someone special Last Christmas, I gave you my heartBut the very next day you gave it awayThis year, to save me from tearsI'll give it to someone special A crowded room, friends with tired eyesI'm hiding from you, and your soul of iceMy god, I thought you were someone to rely onMe? I guess I was a shoulder to cry on A face on a lover with a fire in his heartA man under cover but you tore me apartNow, I've found a real love you'll never fool me again Last Christmas, I gave you my heartBut the very next day you gave it awayThis year, to save me from tearsI'll give it to someone special Last Christmas, I gave you my heartBut the very next day you gave it awayThis year, to save me from tearsI'll give it to someone special A face on a lover with a fire in his heartA man under cover but you tore him apartMaybe next year I'll give it to someoneI'll give it to someone special Songwriters: George Michael Last Christmas lyrics © Warner/Chappell Music, Inc ",
            "date": "Answered May 12, 2019",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Linda Hewitt",
                    "user_href": "/profile/Linda-Hewitt-32"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kacie McIntyre",
                "href": "/profile/Kacie-McIntyre"
            },
            "answer_text": "If this song is continued by… “I keep my distanceBut you still catch my eyeTell me, babyDo you recognize me?Well, it's been a yearIt doesn't surprise me… Last Christmas, I gave you my heartBut the very next day you gave it awayThis year, to save me from tearsI'll give it to someone special” I know I skipped a verse but I love this Christmas song titled “Last Christmas” which can also fall into the breakup song category. I believe it was originally sung by Wham! but has been covered by various artists such as Taylor Swift and Ariana Grande. ",
            "date": "Answered March 31, 2019",
            "views": "322",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Josiah Landrom",
                    "user_href": "/profile/Josiah-Landrom-1"
                },
                {
                    "user_id": "Elizabeth Hanley",
                    "user_href": "/profile/Elizabeth-Hanley-3"
                },
                {
                    "user_id": "Linda Hallenbeck",
                    "user_href": "/profile/Linda-Hallenbeck"
                },
                {
                    "user_id": "Jean Laurent",
                    "user_href": "/profile/Jean-Laurent-5"
                }
            ]
        }
    ]
}