{
    "title": "Which, if any, K-Pop artists are openly gay? - Quora",
    "tags": [
        "LGBTQ Cultures",
        "Homosexuality",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Karrington Tazanna",
                "href": "/profile/Karrington-Tazanna"
            },
            "answer_text": "DISCLAIMER: THIS IS ALL SPECULATION, I'M NOT TRYING TO OFFEND OR START ANYTHING BY THIS. THIS IS JUST MY INKLINGS WITH CERTAIN PEOPLE. THIS IS ADMITTEDLY A LITTLE STEREOTYPICAL AND HAS POORLY CROPPED PHOTOS. YOU'VE BEEN WARNED. The most obvious one is JoKwon, formerly from 2AM. I feel like his is more of an open secret in the industry because of many, admittedly stereotypical and vain, reasons. But reasons nonetheless. Not only does he seem to throroughly enjoy constantly doing drag, he is also quite good and extremely natural at it. His new musical where he plays a drag queen, helps my case more, cause he seems very invested and interested in LGBT-leaning styles of stuff. Plus I believe he even has a tattoo that says, “Born this way”. Also he had gotten into probably his biggest scandal years ago dealing with another former member of Ukiss, allegeding that they were gay and in a relationship, sending texts discussing how they wanted to “live and lay” etc. With each other. Plus I believe I heard something about them also being seen at a gay club (but don't quote me on that). They tried hard to convince everybody they were just friends joking around, but I highly doubt that. I know feminity isn't a true indicator of someone being gay, especially in Korea, but in addition to all of this, Jokwon has always been extra feminine, like sterotypically gay, feminine. Always having female friends, loves dancing provocatively in high-high heels, just the general *hair flip* sassiness he gives off a lot, etc.    Some honorable mentions are Ren from Nu'est, who is also with Jokwon in the new drag musical, he may not exactly be gay, but he doesn't seem to even kind of care for traditional gender roles, he seems to be comfortable wearing lots of makeup and dresses, etc. I think rather than being straight up gay, I think he falls more on the gender neutral, non binary side. Maybe he's bisexual, I don't know, but he's definitely not 100% a cishet.  I don't follow BTS like that, but I've heard that Suga straight up admitted he didn't care about gender when it came to preference, so he's definitely on the bi/pansexual side.  Ten, as attractive as he is, has always struck me as gay. I remember he wrote something back in their SM Rookies days and put it on the door of someone's room (can't remember which member it was) and it was something like “I want to have sex with you” or just something highkey lude and suggestive. I know he did it as a joke, but you know, jokes come from the heart. Plus he just seems completely uninterested in women romantically so I'd put him on the straight up gay side.  Moonbyul, I don't know, ever since I first saw her in the Um Oh Ah Yeah video, I always got some slight downlow lesbian vibes from her.  Key from Shinee. I've ALWAYS thought he had some bisexuality in him. He too, seems like it's an open secret, because he acts very similar to Jokwon in that sense. He's shown some slight attraction to women before I believe, so I won't say he's 100% gay, but I've just always felt like he was either bisexual or pan.  Also Wonpil from Day6, I can't really give a good answer for this aside from just general vibes. He played a gay character in one of their music videos, but that's not that indicative. Really I just noticed the way he acted towards the fans at their concert was the same way Ten acted, very nice, as usual, but there's just like something there that just feels like he didn't care for girls like that.  ",
            "date": "Answered July 14, 2020",
            "views": "203",
            "upvotes": " View 33 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jessica Silverman",
                    "user_href": "/profile/Jessica-Silverman-6"
                },
                {
                    "user_id": "Ammaarah Noor",
                    "user_href": "/profile/Ammaarah-Noor-1"
                },
                {
                    "user_id": "Rogemel Manito",
                    "user_href": "/profile/Rogemel-Manito"
                },
                {
                    "user_id": "Wayne Thiele",
                    "user_href": "/profile/Wayne-Thiele"
                },
                {
                    "user_id": "Catie Donahue",
                    "user_href": "/profile/Catie-Donahue-3"
                },
                {
                    "user_id": "Carolin Funke",
                    "user_href": "/profile/Carolin-Funke"
                },
                {
                    "user_id": "Tamara Hadzic",
                    "user_href": "/profile/Tamara-Hadzic"
                },
                {
                    "user_id": "Amelia Le",
                    "user_href": "/profile/Amelia-Le-2"
                },
                {
                    "user_id": "Lala Love",
                    "user_href": "/profile/Lala-Love-81"
                },
                {
                    "user_id": "Khurshida Davronova",
                    "user_href": "/profile/Khurshida-Davronova"
                }
            ]
        },
        {
            "author_info": {
                "name": "Miso",
                "href": "/profile/Miso-26"
            },
            "answer_text": "Last updated on: Sep 15 2020 I am not going to be mentioning idols that I think belong to lgbtq+ community. That is not a right thing to do, if they ever come out of the closet -let's act surprised. This answer will be divided into two sections containing 10 idols that are openly lgbtq+ and 16 idols that told/revealed themselves to be interested in the same sex (etc). If there are any homophobic or transphobic people here to spread hate: You're not welcome, leave. ● OPENLY LGBTQ+ There are a few openly lgbtq+ actors and models in korea but I'm not going to be mentioning them. Also I don't stan anyone in this first list other than holland so idk much about them but let's go- Harisu  She is a kpop singer who was assigned male at birth. She is also an actress and model. Lady  They are the first kpop group with all four members transgenders. maman  She is a solo artist who got fired from her first company for coming out as lesbian, and was hired by another label. Marshall bang  He is a gay music artist from Orange county. He goes by the name MRSHLL Choi hanbit  She is a trans woman who is an actress model and singer. She was a part of the girl group mercury that disbanded. Holland  Go tae seob, he is a 22 year old gay idol who made his debut on 22nd January 2018 with his song ‘neverland’. Oof stop this- lemme keep the formalities aside I love this boy, he's so hardworking and the sweetest and most adorable boy in this world. The fact that he's learning English (and is pretty good at it) to communicate with his international fans is so sweet Hansol  He does not belong to the lgbtq+ community but he's the first kpop idol to officially come out as asexual. He did this through a instagram live back in 2017. He was a former member of the group toppdogg. [I wanna apologise with my whole heart for making such a hurtful and ignorant mistake, when I made this answer 1 and a half year ago I thought I typed just lgbtq without the + or a, I was answering a couple of questions along similar lines and it went unnoticed, I really cannot explain how sorry I am, I'm myself hurt, I'm really really sorry] ● NOT OFFICIALLY CONFIRMED I will not be assuming anybody's sexuality based off their mannerisms or actions. I'm simply gathering stuff they've themselves said. Please take it lightheartedly. No matter how sure we are of their sexuality idt it's right for us to force them to come out. Whether as a joke or not, the idols said it themselves so don't come at me. And if they are comfortable and open enough to joke about it in a nice way, I'm sure they wouldn't be offended with this either. Oh Sehun (EXO)  The following conversation was made in the EXO’rDIUM:- S: there were really many male fans, they were cheering and waving at me and I actually felt my heart flutter. It's okay to say it right? Baek: yes Xiumin: of course it can happen, of course S: to have male fans liking us - I feel very honoured Xiumin: so now are you saying you like male fans? S: I like…men (immediately changes topic) anyways is everyone having fun Wonho /Lee Hoseok/ (MONSTA X)  Read *kaboom* yoss he is bi (for ramen) But for real thou - his pronunciation of ramen and his lisp is so cute. Whoever is gonna be his boyfriend in the future is so lucky cuz he's such a nice human being ♡. Stan monsta x btw. Hyeongseong (D.I.P)  In his old Facebook acc he had mentioned that he's romantically interested in both male and female HANI /Ahn Hee Yeon/ (EXID)  When a fellow member Solji said “Hani likes girls” She coolly replied that she does indeed like girls. Queen is always whipped for girls too. Lee Felix (Stray Kids)  Well this ⬇️  Happy birthday to sunshine lixie ♡ Seungho and B.nish (D.I.P)  The members Seungho and b.nish have been dating for years (as revealed on an instagram live). Seohyun (SNSD)  Self explanatory  She has also played a lesbian role so she's supportive of the community if not a part of it. Noh Kangmin (ROMEO)  uwu dish ish my favorite boy uwu He's like my baby (I'm only 15 whatever nvm) again just read through the images  He said all these lines literally twice so it was not a mistake. Also he specifically said “namja”(man) Hyun kyun says: “ah yeoja(woman)”? he replies with no and then further this was said.  He doesn't change it into girl and instead just says person. Gay bravery award goes to noh kangmin. This is from an interview in 2015. And whatever this is - I don't understand I don't speak gAy⬇   Kyle (ROMEO) (Not really though)  Now that I mentioned romeo - just read the next.   Reading this you might think he said this in a over dramatic funny way or something - but no he was deadass serious. This is prolly just a joke thou Kim Yoohyeon (DREAMCATCHER)  Something similar to the kangmin  Na Ungjae (IMFACT)  This⬇ (Uhm I accidentally deleted the ss while editing so I'll try finding it) The8 /Xu Minghao/ (Seventeen)  Myungho is cute bye.   Ten /Chittaphon Leechaiyapornkul/ (NCT U, WAYV)  This is something ten wrote to Johnny on a sticky note (The vid is in english and there's no cc so I didn't take an ss but here's what it said-) “I wanna have xxx with you” Honestly it sounds like something I'd tell my best friend 😂 Also, his teacher revealed that he was never interested in girls- this could just mean he was more focused and passionate about other things so I'm not including the ss here but you can find it if you search it Yeri / Kim Yerim/ (Red Velvet)  The infamous “I like girls” clip Whether she is a part or not she's definitely one of the idols who support the community rather loudly so ♡   Before this answer was edited on Sep 15 2020 Min Yoongi was a part of this list, idk if it's true that the whole statement about his interest not being limited to just women was mistranslated, if it is I'm sorry, if it isn't idc cuz Idw armys to comment the same thing again and again so i removed him. I'm again apologising for the very hurtful accidental mistake I made regarding hansol, sorry I left quora when I was 15 and I'm returning only now so I never came across my answer and your comments until now. I'm really sorry, I've never indifferently thought about people of any orientation, I'm don't think I can explain how sorry I am for that mistake, I'm sorry. ",
            "date": "Updated September 15, 2020",
            "views": "678",
            "upvotes": " View 245 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Leah Zukowsky",
                    "user_href": "/profile/Leah-Zukowsky"
                },
                {
                    "user_id": "Jessica Silverman",
                    "user_href": "/profile/Jessica-Silverman-6"
                },
                {
                    "user_id": "Alex Lee",
                    "user_href": "/profile/Alex-Lee-1612"
                },
                {
                    "user_id": "Alexia 알렉시아",
                    "user_href": "/profile/Alexia-알렉시아-1"
                },
                {
                    "user_id": "Ammaarah Noor",
                    "user_href": "/profile/Ammaarah-Noor-1"
                },
                {
                    "user_id": "Jenna Sjaklif",
                    "user_href": "/profile/Jenna-Sjaklif-1"
                },
                {
                    "user_id": "Lily Hernandez",
                    "user_href": "/profile/Lily-Hernandez-35"
                },
                {
                    "user_id": "Michael Bryan Desiongco",
                    "user_href": "/profile/Michael-Bryan-Desiongco"
                },
                {
                    "user_id": "Lua Lua",
                    "user_href": "/profile/Lua-Lua-17"
                },
                {
                    "user_id": "Rye Strawberry",
                    "user_href": "/profile/Rye-Strawberry"
                }
            ]
        }
    ]
}