{
    "title": "Which countries celebrate Halloween? - Quora",
    "tags": [
        "Halloween",
        "Traditions",
        "Celebrations",
        "National Holidays and Common Celebrations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sue Bell",
                "href": "/profile/Sue-Bell-58"
            },
            "answer_text": "Halloween, one of the world’s oldest holidays, is still celebrated today in a number of countries around the globe. In Mexico and other Latin American countries, Día de los Muertos—the Day of the Dead—honors deceased loved ones and ancestors. In countries such as Ireland, Canada and the United States, adults and children alike revel in the popular Halloween holiday, which derived from ancient festivals and religious rituals. Traditions include costume parties, trick-or-treating, pranks and games. China - the Chinese celebrate the \"Hungry Ghost Festival\" in mid-July, when it is customary to float river lanterns to remember those who have died. Hong Kong - traditional in many buildings catering to expatriates, Halloween parties and limited trick or treating is arranged by the management. Instances of street-level trick or treating in Hong Kong occur in ultra-exclusive gated housing communities such as The Beverly Hills populated by Hong Kong's super-rich and in expatriate areas like Discovery Bay and the Red Hill Peninsula.  SOURCE:https://midnightpapers.com/blog/halloween-essay Japan - Halloween arrived in Japan mainly as a result of American pop culture. As recently as 2009, it was not appreciated and only celebrated by expats.f Philippines - the period from 31 October through 2 November is a time for remembering dead family members and friends. Singapore - around mid-July Singapore Chinese celebrate \"Zhong Yuan Jie / Yu Lan Jie\" (Hungry Ghosts Festival), a time when it is believed that the spirits of the dead come back to visit their families. Australia - while not traditionally a part of Australian culture, non-religious celebrations of Halloween modeled on North American festivities are growing increasingly popular in Australia. In New Zealand, as in neighbouring Australia, Halloween is not celebrated to the same extent as in North America, although in recent years the non-religious celebrations have been achieving some popularity especially among young children. Sweden - On All Hallow's Eve, a Requiem Mass is widely attended every year at Uppsala Cathedral, part of the Lutheran Church of Sweden. Bosnia and Herzegovina - Halloween is a work day in Bosnia and Herzegovina, and not celebrated until recently. For the past few years, it has been popular among younger generations. Germany - Halloween was not generally observed in Germany prior to the 1990s, but has been increasing in popularity. It has been associated with the influence of United States culture, and \"Trick or Treating\" (in German, \"Süßes sonst gibt's Saures\") has been occurring in various German cities, especially in areas such as the Dahlem neighborhood in Berlin.  SOURCE:Do you know what countries celebrate Halloween? Greece - Halloween has been increasing in popularity in Greece during the 2010s, as a commercial and secular celebration. Ireland - A traditional Irish turnip (rutabaga) jack-o'-lantern, c. early 20th century, on display in the Museum of Country Life, Ireland. Italy - In Italy All Saints' Day is a public holiday. On 1 November, Tutti i Morti or All Souls' Day, families remember loved ones who have died. Romania - Romanians observe the Feast of St. Andrew, patron saint of Romania, on 30 November. On St. Andrew's Eve ghosts are said to be about. Russia - In Russia most Christians are Orthodox, and in the Orthodox Church Halloween is on the Saturday after Pentecost and therefore 4-5 months before western Halloween. Poland & Czech Republic - Since the fall of Communism in 1989, Halloween has become increasingly popular in Poland and the Czech Republic. Particularly, it is celebrated among younger people. Switzerland - In Switzerland, Halloween, after first becoming popular in 1999 is on the wane, and is most popular with young adults who attend parties. England - In the past, on All Souls' Eve families would stay up late, and little \"soul cakes\" were eaten. Scotland - the name Halloween is first attested in the 16th century as a Scottish shortening of the fuller All-Hallows-Even, that is, the night before All Hallows Day. ",
            "date": "Answered November 1, 2018",
            "views": "273",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kay Sykes",
                    "user_href": "/profile/Kay-Sykes-9"
                },
                {
                    "user_id": "Jayden Enyart",
                    "user_href": "/profile/Jayden-Enyart"
                },
                {
                    "user_id": "Coman Mircea",
                    "user_href": "/profile/Coman-Mircea"
                }
            ]
        },
        {
            "author_info": {
                "name": "Diya Kamboj",
                "href": "/profile/Diya-Kamboj-3"
            },
            "answer_text": "Halloween celebrated around the whole world but with different names but all relate to the Festival of the Dead or Feast of Ancestor. It generally occurs after the harvest in August, September, October, or November. India Many Hindus on the Indian subcontinent celebrate Pitru Paksha, meaning “fortnight of the ancestors” in Hindi. Also known as Mahalaya, the celebration lasts for 16 lunar days sometime in September or October. America, Canada As one of the world’s oldest holidays, Halloween is still celebrated today in several countries around the globe, but it is in North America and Canada that it maintains its highest level of popularity. Ireland Many familiar Halloween traditions around the world came about because of Oíche Shamhna (pronounced “ee-hah how-nah”), meaning “November Night” in the Gaelic language. England The British celebrate All Souls’ Day on November 2. The name comes from the legend that dead souls come back to visit their former homes the night before. Mexico, Latin America, and Spain Many Mexican children celebrate Halloween traditions from around the world like trick-or-treating. Children say, “¡Noche de Brujas, Halloween!” (‘Witches’ Night, Halloween!’) and, “¡Queremos Halloween!” (We want Halloween!). France Unlike most nations of the world, Halloween is not celebrated by the French in order to honor the dead and departed ancestors. Germany In Germany, the people put away their knives on Halloween night. The reason for this is because they do not want to risk harm befalling the returning spirits. China In China, the Halloween festival is known as Teng Chieh. Food and water are placed in front of photographs of family members who have departed while bonfires and lanterns are lit in order to light the paths of the spirits as they travel the earth on Haloween night. Lebanon Some Lebanese celebrate the Christian holiday St. Barbara’s Day, or Eid-il-Burbara in Arabic. On December 4, children wear costumes and collect food in exchange for a song, like in many versions of Halloween around the world. Japan The Japanese celebrate the “Obon Festival” (also known as “Matsuri” or “Urabon”) which is similar to Halloween festivities in that it is dedicated to the spirits of ancestors. Korea In Korea, the festival similar to Halloween is known as “Chusok.” It is at this time that families thank their ancestors for the fruits of their labor. Sweden In Sweden, Halloween is known as “Alla Helgons Dag” and is celebrated from October 31 until November 6. Halloween celebrated with different names around the world  ",
            "date": "Answered October 30, 2020",
            "views": "389",
            "upvotes": "0"
        }
    ]
}