{
    "title": "Which guitar tips do beginners mostly ignore? - Quora",
    "tags": [
        "Playing Guitar"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Grason",
                "href": "/profile/David-Grason"
            },
            "answer_text": "When I was teaching, I was noticing that most students fell into two basic categories. The first and most common were the students whose parents bought them guitars and were paying for the lessons. The students in this category didn’t really have a lot of choice and so, they went through the motions very begrudgingly. The second category had the students that really WANTED to play. The only time they were not playing was when they were using the bathroom or sleeping. But invariably, those students wanted to cut straight to the chase and learn to solo. They all had dreams of being the next rock and roll god! Thus, they completely skipped learning how to play chords and rhythms. Then, when they went out to try out for a band, they had to compete against all the other solo players that were trying out. The band would often end up with two lead players and no one to play rhythm. Then, of course, the two lead players would get into ego hassles and those bands would fall apart. A really excellent example of this was the great, late B.B. King. BB was a superb blues man. He could make Lucille really sing sweetly like no other blues man. But he didn’t know the first thing about chords. He didn’t even know what key the band was in because he never learned theory. He didn’t know the first thing about rhythm either. And he told people that he wasn’t about to start learning those things because he didn’t have to. And he was right but only because He was B.B.King! Not just any guitarist is good enough to get away with that sort of arrogance. The second biggest thing that beginners ignore is that they refuse to learn anything that is not in their own favorite genre. And most of the young guns all wanted to play grunge metal and absolutely nothing else! I’m from Nashville and I have to tell you that, if you want to play guitar in this town, you had damn well better learn to play it all. You will need to play rock and roll, hip hop, new age country and the crying in your beer old country. Throw in some bluegrass and gospel just to be sure. Then, when you’re not working, you can play your grunge metal with your own band. But even then, your grunge metal band will have a difficult time booking jobs without being able to play other styles too. This then brings up the old joke where the rock and roll god was being interviewed by the local radio DJ. The DJ asked, “When you’re not touring what do you do?” The R&R god says; “We prostitute ourselves to keep food on the table.” DJ: “WHAT?” R&R god: “Yeah, we play weddings.” DJ: “REALLY? Say it aint so!” R&R god: “I’m not kidding. We play Proud Mary and everything.” ",
            "date": "Answered March 13, 2019",
            "views": "965",
            "upvotes": " View 341 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bin Wang",
                    "user_href": "/profile/Bin-Wang-89"
                },
                {
                    "user_id": "George Dean",
                    "user_href": "/profile/George-Dean-61"
                },
                {
                    "user_id": "Melanio Reyes",
                    "user_href": "/profile/Melanio-Reyes"
                },
                {
                    "user_id": "Tom Polk",
                    "user_href": "/profile/Tom-Polk-1"
                },
                {
                    "user_id": "Sandy Mackenzie",
                    "user_href": "/profile/Sandy-Mackenzie-19"
                },
                {
                    "user_id": "Shishir Lohar",
                    "user_href": "/profile/Shishir-Lohar-1"
                },
                {
                    "user_id": "Tatsuya Ikeda",
                    "user_href": "/profile/Tatsuya-Ikeda-1"
                },
                {
                    "user_id": "Aditya Gandhi",
                    "user_href": "/profile/Aditya-Gandhi-109"
                },
                {
                    "user_id": "Patrick May",
                    "user_href": "/profile/Patrick-May-27"
                },
                {
                    "user_id": "Cade Madeira",
                    "user_href": "/profile/Cade-Madeira"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Hardy",
                "href": "/profile/Bob-Hardy-19"
            },
            "answer_text": "I’m not sure I would call these tips: they’re really part of the training that a good teacher would provide, not a short-cut or a “cheat”. But they could be helpful. Perhaps the biggest one: don’t overreach. If you have to stretch farther than one fret per finger from where your hand is, you’re not playing it well. Stretching for an extra fret or two is a bad habit that will slow you down and prevent you from learning to play better, a double whammy of bad news. You can practice your way into better playing technique by playing one fret with your pinkie, and then playing the next fret up by moving your hand up 4 frets and playing it with your index finger. Now slide your hand back down the neck and fret that next lower note with your pinkie again. This will help you move faster and more surely up and down the neck, instead of using this bad technique and holding yourself back by failing to develop superior skills. Second most common mistake: wrapping your thumb around the edge of the fretboard. This is another bad habit that will slow you down and make your fretting hand less facile. Your thumb should always be almost straight, and on the back of the neck, not hanging from the fretboard like a monkey from a tree. You may already know that it’s enabling you to avoid learning how to play barre chords correctly. Whether you know it or not, it is holding you back, even though you see guitarists doing it too often. Obviously, they didn’t listen to their teacher either! But they should, and you can avoid this pitfall if you’re aware of it. It’s a lot easier to avoid developing this bad habit than it is to stop doing it. ",
            "date": "Answered April 2, 2019",
            "views": "565",
            "upvotes": " Answer requested by Pooria Arab"
        }
    ]
}