{
    "title": "Which Queen songs did Freddie Mercury not like? - Quora",
    "tags": [
        "Freddie Mercury",
        "Queen (band)",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Madison Koda",
                "href": "/profile/Madison-Koda"
            },
            "answer_text": "I feel like Freddie didn’t like heavy metal type of music, and I think this sometimes caused friction between Freddie and Brian when in the studio. There is an interview with a journalist named Lisa Robinson, where he flippantly says that he doesn’t like the songs Brian writes, which is somewhat of a joke. I think Freddie did like the majority of Brian’s songs just like Brian liked the majority of Freddie's songs. It was a band, so of course there was a lot of compromising because everyone’s input mattered. In the same interview, Freddie talks about how he doesn’t socialize with the band too much because they have different interests. He says that Brian, Roger, and John just go to Rock ‘n Roll shows and he likes ballet and opera. During this time, the band was also going through a lot of turmoil, and I think it weighed on their friendship. However, I think Freddie liked more melodic music. He obviously liked to rock music, but I feel like he didn’t like super heavy stuff. It is famously known that Freddie was not a fan of I’m in Love with My Car. The story goes that Roger locked himself in a cabinet until Freddie agreed to let it be the B side to Bohemian Rhapsody. ",
            "date": "Answered October 9, 2020",
            "views": "154",
            "upvotes": " View 42 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Pam Whitehouse",
                    "user_href": "/profile/Pam-Whitehouse-2"
                },
                {
                    "user_id": "Melodee Herrera",
                    "user_href": "/profile/Melodee-Herrera"
                },
                {
                    "user_id": "Phyllis Pena",
                    "user_href": "/profile/Phyllis-Pena-1"
                },
                {
                    "user_id": "Renee Willett",
                    "user_href": "/profile/Renee-Willett-1"
                },
                {
                    "user_id": "Colleen Burtard",
                    "user_href": "/profile/Colleen-Burtard"
                },
                {
                    "user_id": "Barbara Kirk",
                    "user_href": "/profile/Barbara-Kirk-22"
                },
                {
                    "user_id": "Maria Jose Maranon",
                    "user_href": "/profile/Maria-Jose-Maranon-1"
                },
                {
                    "user_id": "Marie Angele Barelier",
                    "user_href": "/profile/Marie-Angele-Barelier"
                },
                {
                    "user_id": "Tintor Smith",
                    "user_href": "/profile/Tintor-Smith"
                },
                {
                    "user_id": "Muhammad Irfan",
                    "user_href": "/profile/Muhammad-Irfan-1728"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Lewis",
                "href": "/profile/David-Lewis-268"
            },
            "answer_text": "He claimed not to like Brian’s ‘heavy metal’ stuff, far preferring the soul stuff that both he and John were writing. Freddie doesn’t write any ‘heavy stuff’ after ‘New of the World’ I think, but he certainly sings it. It’s worth noting he said that type of thing when he and Brian were fighting, so it’s not necessarily accurate. But given he goes from things like ‘March of hte Black Queen’, ‘Bohemian Rhapsody’ and ‘The Millionaire’s Waltz’ to ‘WATC’, ‘CLTCL’ and others I think it possible he grew away from ‘heavy’ music. ",
            "date": "Answered October 12, 2020",
            "views": "456",
            "upvotes": " Answer requested by Tom Branagan"
        }
    ]
}