{
    "title": "Which songs are perfect for listening and have meaningful lyrics? - Quora",
    "tags": [
        "Song Lyrics",
        "Music Recommendations",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Laurel Johnson",
                "href": "/profile/Laurel-Johnson-57"
            },
            "answer_text": "Well right now it's both my favorite and least favorite song because APPARENTLY listening to something repeatedly for five hours straight and crying makes you begin to absolutely despise it. Huh, who woulda thought? Anywho, the song (which I'm sure many of you know) is called Someone You Loved by Lewis Capaldi and here are the lyrics: I'm going under and this time I fear there's no one to save me This all or nothing really got a way of driving me crazyI need somebody to healSomebody to knowSomebody to haveSomebody to holdIt's easy to sayBut it's never the sameI guess I kinda liked the way you numbed all the pain Now the day bleedsInto nightfallAnd you're not hereTo get me through it allI let my guard downAnd then you pulled the rugI was getting kinda used to being someone you loved I'm going under and this time I fear there's no one to turn toThis all or nothing way of loving got me sleeping without youNow, I need somebody to knowSomebody to healSomebody to haveJust to know how it feelsIt's easy to say but it's never the sameI guess I kinda liked the way you helped me escape Now the day bleedsInto nightfallAnd you're not hereTo get me through it allI let my guard downAnd then you pulled the rugI was getting kinda used to being someone you loved And I tend to close my eyes when it hurts sometimesI fall into your armsI'll be safe in your sound 'til I come back around For now the day bleedsInto nightfallAnd you're not hereTo get me through it allI let my guard downAnd then you pulled the rugI was getting kinda used to being someone you loved But now the day bleedsInto nightfallAnd you're not hereTo get me through it allI let my guard downAnd then you pulled the rugI was getting kinda used to being someone you love I let my guard downAnd then you pulled the rugI was getting kinda used to being someone you loved It's rather sad of course, but if you've been paying attention then you ought to know that everything I write or say is usually somehow sad. Anyway, it really is a good song and the lyrics are pretty amazing/meaningful in my opinion. ",
            "date": "Answered September 22, 2019",
            "views": "36",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "John O Plumer Jr",
                    "user_href": "/profile/John-O-Plumer-Jr"
                },
                {
                    "user_id": "Emily Dinah",
                    "user_href": "/profile/Emily-Dinah"
                },
                {
                    "user_id": "Amanda Lazarus",
                    "user_href": "/profile/Amanda-Lazarus-2"
                },
                {
                    "user_id": "Laurena Lord",
                    "user_href": "/profile/Laurena-Lord"
                },
                {
                    "user_id": "Eileen Richards",
                    "user_href": "/profile/Eileen-Richards-2"
                },
                {
                    "user_id": "Ashley Avallone",
                    "user_href": "/profile/Ashley-Avallone-1"
                },
                {
                    "user_id": "Jason Wang",
                    "user_href": "/profile/Jason-Wang-860"
                },
                {
                    "user_id": "June Kale",
                    "user_href": "/profile/June-Kale-2"
                },
                {
                    "user_id": "Kanashi Moryashi",
                    "user_href": "/profile/Kanashi-Moryashi"
                },
                {
                    "user_id": "Dayton Siebert",
                    "user_href": "/profile/Dayton-Siebert-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Burden",
                "href": "/profile/Michael-Burden-6"
            },
            "answer_text": "\"Send in the Clowns\" is a song written by Stephen Sondheim for the 1973 musical A Little Night Music, an adaptation of Ingmar Bergman’s film Smiles of a Summer Night. It is a ballad from Act Two, in which the character Desirée reflects on the ironies and disappointments of her life. Among other things, she looks back on an affair years earlier with the lawyer Fredrik. Meeting him after so long, she finds that he is now in an unconsummated marriage with a much younger woman. Desirée proposes marriage to rescue him from this situation, but he declines, citing his dedication to his bride. Reacting to his rejection, Desirée sings this song. The song is later reprised as a coda after Fredrik's young wife runs away with his son, and Fredrik is finally free to accept Desirée's offer. Sondheim wrote the song specifically for the actress Glynis Johns, who created the role of Desirée on Broadway. It became Sondheim's most popular song after Frank Sinatra recorded it in 1973 and Judy Collins’ version charted in 1975 and 1977. I have always been intrigued by the lyrics of the song :- Isn't it rich? Are we a pair? Me here, at last, on the ground You in mid-air Send in the clowns Isn't it bliss? Don't you approve? One who keeps tearing around One who can't move Where are the clowns? Send in the clowns Just when I'd stopped opening doors Finally knowing the one that I wanted was yours Making my entrance again with my usual flair Sure of my lines No one is there Don't you love farce? My fault, I fear I thought that you'd want what I want Sorry, my dear But where are the clowns? There ought to be clowns Quick, send in the clowns What a surprise! Who could foresee? I'd come to feel about you What you felt about me Why only now, when I see That you've drifted away? What a surprise What a cliche Isn't it rich? Isn't it queer? Losing my timing this late in my career And where are the clowns? Quick, send in the clowns Don't bother They're here Although the song, being a show from a stage production, was written specifically for a particular storyline and for a particular actress to sing, I think the song so eloquently speaks about so many relationships in general, and this probably explains why so many people have sung it and why it has been recorded in so many different versions by more than 20 different artists. The song is really saying that when you are in a relationship or marriage, you may think that you and your partner or spouse are “on the same wavelength” and everything is fine between you, but you should never take it for granted that this is the case. They may be looking at things in a completely different light, and may not be in the same place at all in the relationship. The song voices in an understated way how you feel when you realise or discover this. ",
            "date": "Answered July 23, 2017",
            "views": "48",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cindy Zheng",
                    "user_href": "/profile/Cindy-Zheng-30"
                },
                {
                    "user_id": "John French",
                    "user_href": "/profile/John-French-55"
                },
                {
                    "user_id": "Ron Gutman",
                    "user_href": "/profile/Ron-Gutman-3"
                }
            ]
        }
    ]
}