{
    "title": "Which album is better, “The Doors” or “Strange Days”? Why? - Quora",
    "tags": [
        "The Doors (band)",
        "Doors",
        "Rock Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kaiser Tarafdar",
                "href": "/profile/Kaiser-Tarafdar"
            },
            "answer_text": "Both are brilliant albums with so many classic rock songs. I like the flow of “Strange days” more due to a remarkable consistency that holds it together with one track literally blending into the subsequent one with a cohesion that is brilliant in and of itself. Both albums have some of their greatest songs. “The Doors” has the all time sensational “Break on through”, “Crystal ship”, “Soul kitchen”, “Backdoor man”, and the two masterpieces, namely “Light my fire”, and “The end”. Their second album ““Strange days” has the following classics : “Strange days”, “People are strange”, “Love me two times”, “My eyes have seen you”, “Horse latitudes”, “Moonlight drive” the melodramatic rare and underappreciated masterpiece “I can’t see your face in my mind” and the incomparable psychedelic rock masterpiece “When the music’s over”. Both albums are timeless in their appeal… KT ",
            "date": "Answered July 21, 2020",
            "views": "113",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nelson Webb",
                    "user_href": "/profile/Nelson-Webb-4"
                },
                {
                    "user_id": "Camden Rafftery",
                    "user_href": "/profile/Camden-Rafftery"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michel Wilms",
                "href": "/profile/Michel-Wilms"
            },
            "answer_text": "Thanks for asking Camden. I suppose “The Doors” is higher ranked. Simply because it's a magnificent debut and have some great classic tunes on it. Over the years i like Strange Days a bit better. The producing is better than the debut and for me the songs sounds more natural in a way. In popmusic there's always such a thing about “ The Diffecult Second Album\" and always a bit pressure to do it better than the first one. Strange Days is a great follow up and it seemed like The Doors had lots of inspiration for the years after this. It's maybe a piece that is not full of highlights, but as a total piece it works amazing. I can't really tell what's the best album is. The later Doors years, when the group go forward in a blues rock direction, is also very good. But Strange Days is my favorite. ",
            "date": "Answered July 21, 2020",
            "views": "35",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Camden Rafftery",
                    "user_href": "/profile/Camden-Rafftery"
                }
            ]
        }
    ]
}