{
    "title": "Which are the pros and cons of a Fender Telecaster and a Fender Stratocaster if both guitars are compared? - Quora",
    "tags": [
        "Fender Stratocaster",
        "Fender Guitars",
        "Electric Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Cox",
                "href": "/profile/Andrew-Cox-83"
            },
            "answer_text": "Telecaster PROS Simple, intuitive layoutMore positive feeling controls (heavily knurled metal knobs vs ribbed plastic knobs on Strat)More heavily wound bridge pickup for a stronger, more distinct lead toneBetter tuning stability due to lack of a tremolo bridgeCONS Fewer tonal options, making the guitar less versatile (2 pickups vs 3 on a Strat)Neck pickup isn’t as strong as a Strat’sLess comfortable to play due to lack of body contoursLess comfortable upper fret access due to only one cutawayno option for a tremolo if desiredStratocaster PROS More comfortable to play due to body contoursMore tonal options (3 pickups instead of 2 on Tele, 5-way switch instead of 3-way switch on Tele, two tone knobs instead of one).Equipped with a tremoloSecond body cutaway allows for more comfortable upper fret access.Less wound bridge pickup has more treble response.Is the most produced guitar design in the world; has been used in every genre of music you care to name.Volume knob closer to the strings, making volume manipulation while playing possible, and swell effects easy.Usually slightly lighter due to second body cutaway and tremolo cutout on back.CONS Is the most produced guitar design in the world; sounds EXACTLY like EVERY other recording in any genre of music you care to name. Not as good if you want a sound that makes you stand out from the crowd.Volume knob closer to the the strings; can get in the way while playing.Less tuning stability and sustain if tremolo bridge is set up to float, as many are.Bridge single coil pickup is weaker than a Telecaster’s, as well as more trebly. “Glassy” is a common adjective used to describe the sound. Not unusable, but also not to everyone’s taste.Middle pickup can get in the way when picking.Neck + bridge pickup combination not available in stock configuration, unlike TeleIn the end, it all comes down to personal choice. Dozens of great players have used both models, and great sounds can be achieved with either. ",
            "date": "Updated April 8, 2019",
            "views": "10",
            "upvotes": " View 39 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tom Cripps",
                    "user_href": "/profile/Tom-Cripps-6"
                },
                {
                    "user_id": "Olli Perttula",
                    "user_href": "/profile/Olli-Perttula"
                },
                {
                    "user_id": "Jameson Kirk",
                    "user_href": "/profile/Jameson-Kirk"
                },
                {
                    "user_id": "Marcos Passini",
                    "user_href": "/profile/Marcos-Passini"
                },
                {
                    "user_id": "Gregory Domurat",
                    "user_href": "/profile/Gregory-Domurat"
                },
                {
                    "user_id": "Dave Wilson",
                    "user_href": "/profile/Dave-Wilson-299"
                },
                {
                    "user_id": "Rick Kint",
                    "user_href": "/profile/Rick-Kint"
                },
                {
                    "user_id": "Kevin Miller",
                    "user_href": "/profile/Kevin-Miller-141"
                },
                {
                    "user_id": "Rob McCarthy",
                    "user_href": "/profile/Rob-McCarthy-11"
                },
                {
                    "user_id": "Ron Collins",
                    "user_href": "/profile/Ron-Collins"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vesa Peltonen",
                "href": "/profile/Vesa-Peltonen-1"
            },
            "answer_text": " Models of ~Fender Stratocaster [top] & Fender Telecaster [bottom] To answer this, we need to look at two things about guitars, as with these top Fender makes. One is the quality of them that makes both so great to play, and also a guitar musician's preference as to why they chose the Fender, and for that matter, how & why we as musicians decide to choose any guitar over another. So there's the ‘technical reasons’ for which guitar suits one’s taste, and the individual’s 'emotive’ influence reasoning; the feeling a musician gets out of it. I’ll get into first the individual reasoning, that I like to refer to as, a guitarist having an 'instant chemistry' - an unexpected psychological relationship, when trying out any guitar, as The Fender, maybe one’s tried out for the first time. It's a fascinating wondrous experience, which I have felt many times, being selective in a music store to a 2nd hand shop, going through trying out various electric guitars, and I've had this kind of 'serendipity' moment, a part intuitive feeling, taking a unique looking guitar off the shelf and plugging it in. Then suddenly, I'm playing some 'melodic phrase' or 'riff' that surely seemed I never really did before, so there's this relationship, to keep on playing it and then feeling sure it's the guitar you want. I recall this ‘emotive touch’ occurred awhile ago, with a white Stratocaster, I enjoyed right away, bought it, then later sold as I have bought & sold many guitars. I was onto a Gibson that I still have, that felt great for furthering my jazz/blues playing. I still retain a ‘Telecaster’, ‘Gibson’ , electric as well as an acoustic ‘Gretsch’ dark wood dobro, [especially for slide guitar playing] & a ‘Beaver Creek’ acoustic.  [above] Eric Clapton playing one of his fave blue Stratocasters, [seems he’s liked the blue colours, since around 1989] As Eric Clapton put it, in 1999, while discussing auctioning off much of his large collection of guitars for his cause, ‘the CrossRoads’ Rehab Center’ [in Antigua] ~ \"I watched that Christie’s auction sale 'live' on computer while in a recording studio. It was “Brownie”, my favourite '1956 Fender Stratocaster',[that sold for the highest price ever for any auctioned guitar], that chokes me up still. They all meant a lot to me and still do, so seeing the sale, was traumatic, but, it’s ‘the cause’ that made the difference, because I wouldn’t have parted it for anything else.\"  [above]‘Brownie’ -Eric Clapton’s most expensive auctioned guitar - Clapton recorded ’Layla’ with it & was his first Fender Stratocaster with ‘Cream’. Eric Clapton mentions about how he selected his guitars; \"Sometimes I might not know what I want and then I'll play it, and it’s like I never heard something like that before. That first sound is very inspiring; a lot of songs are born out of that. Making the transition from one guitar to the next can come from any direction. It can be triggered by a need to hear another sound, or I’ve seen or heard somebody playing a guitar that I want to emulate. The musical side coupled with the image governs it. The image, the colour maybe, is always a big part, and even, if the guitar is from a certain period. I'll start out with a broad view of what I’m looking for, narrow it down to the one I think as most useful to me and what I’m most comfortable with.\"  ”Cause We've Ended as Lovers”- Jeff Beck, at ‘Crossroads Festival’, playing his off-white Stratocaster. E.C. & the others are using Strats. incl. the bassist. Beck uses his Fender in unique ways, utilizing the ‘tremolo bar’ & other techniques, as he infers, “having the guitar resonate, to challenge the limits of its sound, not just the ‘usual guitar sound’.” Back to what Clapton conveyed, I've had this intuitive ‘feeling’ occur, quite a few times, also;- picking out a guitar that felt was special to me over the other ones I tried out. It's knowing which are good guitars first, and I'm sure I'm like many guitarists, who can be also initially impressed by the colour and form of a guitar to want to try it out. But, yes, it's also technical things to adjust with once highly interested, like the tone, the sound, the guitar neck providing an ease for the hand and finger motion, when playing up and down the fingerboard to chording, intonation, solid tuning pegs, and other elements. I've gone through many guitars, being Gibsons, Fenders, Gretsch, Peavy, Aria to Ibanez electric guitars, all having been made in different years. I fell in love with and bought a ‘1956 Gibson ES-225T hollowbody’. [below]>  Later I sold it, to buy another guitar that took my interest, which has been the case off and on with both my electric and acoustic guitar buying. Each time I've bought a new guitar, I was immersed into playing more and better, thus learning new techniques to practicing new songs or guitar styles. That’s part of the chemistry in trying out a new guitar that you take to, or vice -versa. Fender guitars are very much the best and most popular guitars to have and play outside, of the Gibson guitars. The Fender Telecaster and Stratocaster are of course the top Fender makes. While there are many similarities between these two solid-body Fender electrics, they also share a few key differences, which have made them especially popular with different types of players from ‘country music’, ‘pop’ and ‘blues’, and ‘rock’ and many other genres.  Buddy Guy - great Blues guitarist/singer & Fender user Jazz guitarists tend to use varied widths of hollow-bodied electric guitars, as Gibson, Gretsch, Ibanez, to Godin and so on, much due to their tone and preference for being not solid-body. This genre does not discount the Fender, as many of the modern Jazz guitarists have used it, as Pat Metheny, Johnny Smith,Michael Landau and others.  Wes Montgomery [famous jazz guitarist] with a GibsonL5 semi-acoustic electric Before I get into the specifics of the differences between the two Fender models, it really helps put things into perspective when you know how each guitar came to be, because they are definitely closely tied to each other even within the Fender family of guitars. To the unknowing person, it seems as though the Stratocaster is the natural evolution of Telecaster, as how it came out later, featured an extra pickup, a “better” body shape and an added tremolo bridge. Those who have played the two are more likely to akin it to a little brother, big brother relationship, as the two are similar but uniquely their own, with players on both sides of the argument. As mentioned above, while the added 'tremolo' bar bridge seems like an extra, but when used a lot, it detuned guitar quicker, so those who had no interest in the tremolo effect saw it as a negative. The added pickup also didn’t necessarily make the Stratocaster superior, as many still preferred the sound of the Telecaster [and nowadays you can get a three pickup ‘Tele’, nullifying that argument]. I think I’m making my point that what works for some doesn’t for others and that doesn’t necessarily make either guitar “better.”  The ‘Tremolo bar’ bridge, [an added feature] guitarists as Jeff Beck to David Gilmore use to it’s fullest extent, while others don’t feel the need for it So now, on to the deeper differences and what they mean to those trying to decide between them. The main differences that matter as far as 'tone' & 'timbre' are a bit harder for those unfamiliar with electric guitars to comprehend, so newcomers might have a hard time deciding which sound they prefer from simply reading about it. The best way to compare the sound of two guitars is to play both CLEAN [I can’t stress that enough, as any two guitars will sound similar enough, if you give it enough distortion]. So tone & timbre are terms often confused and misunderstood. They are related, but are quite different things.  ‘EQ’ Knobs: Knobs labeled on guitar amplifier. [Fender also makes great amps.] Without getting too technical, just think of ‘tone’ as the type of changes you can make with the 'EQ knobs' [bass, middle, treble, etc. on your amp.], while ‘timbre’ is the \"character\" of the different sounds you can get with different pickups. This will allow you to be able to hear the natural timbre of the instrument.  Jimmy Vaughn & Eric Clapton, both with Strats Eric Clapton’s take on the 'Stratocaster' vs the 'Telecaster', he's described the sound of the Strat, \"as more compressed, while the ‘Tele’ has more highs and lows\". Eric prefers the Stratocaster much for that reason, but also for tone to the weight/fit on stage, of the guitar which suits him well. [Below] is like the Fender Telecaster I had, I later sold, which is closest to what Keith Richards has many of.  Fender Telecaster with fine‘wood-grain’ finish. Looks much like what I once had. Now, for Keith Richards’ preference being the ‘Telecaster’, which he has quite a few of, most with the wood or off-white finish that's he uses often. \"It's not a complicated guitar to have to think about, it does the job for me\", he has said.  [above]Keith Richards’ array of guitars in a custom built trolley, on stage, while on tour. He has 5 Telecasters shown. He also has a tech guy tune/fix them & a person to make sure he gets the ‘right guitar’ on stage to use for particular songs Keith's had several customized so they have only 5 strings, simply a convenience, partly since he so often plays using open tuning, thus not requiring the low 6th string.  Keith Richards talks about the Telecaster As to which sound is preferable is up to what kind of music you will be looking to play. Those searching for a twangy and bright sound like that prized in country or rockabilly, to rock, gravitate more towards the Telecaster, as players looking for a bit more simple with greater gain control such as that found in several types of genres -blues, blues/rock, punk to metal, more often head towards a Stratocaster.  Vince Gill is a fabulous guitarist & as more of a Rock-a-billy/Country music style player he prefers the Telecaster  “Don't Let Me down” ~ John Mayer & Keith Urban - I had to add this fab song, done ‘live’, as it has Mayer using a ‘Strat’ while Urban is using a ‘Tele’. Which would be right for you? In the end, the differences between the Telecaster and the Stratocaster may not seem apparent at first, but once you spend time with the two, they are truly and uniquely their own. Those looking to exploit the tremolo effect and don’t mind a bit more frequent tuning along with a slight growl would be wise to pick up a Stratocaster while those more prone to playing bright and clean with a nice versatile set of pickups will love the sound of the Telecaster. Of course, one could customize, to alter the guitar to be innovative. Ultimately, these two Fenders are both great guitars that have lived on strong ever since they were both introduced in the ‘50s’. Whichever side of the fence you end up leaning on, just know that there are plenty of greats at your side, to attest to, how fabulous a guitar each one is. I’ve enjoyed both. This ‘demo’ video [below] you'll get a kick out of, and certainly helps you to visualize how he plays them, with subtle simple techniques, like changing the sound by using the guitar’s tone to volume knobs at times. But it’s hearing the similarities and differences in these two top Fender guitars that’s exciting. I find this demo very good, as he plays tastefully with both of them. This video is well edited, as the 'studio guitarist' is shown first playing the ‘red’ Fender Telecaster, then onto playing the ‘green’ Fender Stratocaster, and thus, back & forth as both Fenders are nicely synced, with the same backup rhythm for each model, without using any 'distorted' pedal efx.  I’ve enjoyed playing these top 2 Fenders, which will be around a long time. My colour preference has been red, blue to the wood grain finish. Play on! :) ",
            "date": "Updated August 27, 2018",
            "views": "55",
            "upvotes": " View 26 Upvoters",
            "upvoters": [
                {
                    "user_id": "Olli Perttula",
                    "user_href": "/profile/Olli-Perttula"
                },
                {
                    "user_id": "Derek Martin",
                    "user_href": "/profile/Derek-Martin-19"
                },
                {
                    "user_id": "Dave Wilson",
                    "user_href": "/profile/Dave-Wilson-299"
                },
                {
                    "user_id": "Ang Yu Hui",
                    "user_href": "/profile/Ang-Yu-Hui"
                },
                {
                    "user_id": "David Eugene Wilson",
                    "user_href": "/profile/David-Eugene-Wilson-1"
                },
                {
                    "user_id": "Mark MacAulay",
                    "user_href": "/profile/Mark-MacAulay-5"
                },
                {
                    "user_id": "Steve Monroe",
                    "user_href": "/profile/Steve-Monroe-9"
                },
                {
                    "user_id": "Baukeron Magnetron",
                    "user_href": "/profile/Baukeron-Magnetron"
                },
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                },
                {
                    "user_id": "Dane Clarke",
                    "user_href": "/profile/Dane-Clarke-1"
                }
            ]
        }
    ]
}