{
    "title": "Which Mata is worshipped on 2nd day of Navratri? - Quora",
    "tags": [
        "Navratri (festival)",
        "Hinduism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pragat Dutt",
                "href": "/profile/Pragat-Dutt"
            },
            "answer_text": "NAVRATRI MINIMAL SERIES Today is second day of Navratri . We offer our prayers to Maa Brahmacharini .  The second form of nine Durga's powers is that of Goddess Brahmacharini. Here the word Brahm means penance. Brahmacharini means one who conducts the penance. The form of Goddess Brahmacharini is fully lit and extremely magnificent. There are chanting beads in her right hand and Kamandal in her left hand.  The seeker receives the grace of the mother on this day. Their worship leads to the attainment of infinite success and increase in qualities like tenacity, sacrifice, patience, virtue and self-control. Even in the difficult struggles of life, one does not deviate from his duty. With the grace of Brahmacharini Devi, person attains perfection and victory everywhere. It is good to meditate on the mother Brahmacharini for liberation from desires.  Origin In her former birth, she was born as a daughter in the Himalayan house. By the preaching of Narada, she did extremely difficult penance to get Lord Shankar as her husband. Due to this difficult austerity, she was named as Brahmacharini. She spent a thousand years eating only fruits. Keeping fast for a few days, the goddess endured terrible sufferings of rain and sunlight under the open sky. Due to this difficult austerity of several thousand years, the body of Brahmacharini Devi became very weak, seeing her condition, her mother Mena was very sad. His austerity created a chaos in all the world. All began to praise austerity of Goddess Brahmacharini, calling it an unprecedented virtuous act.   In the end, Pitamah Brahma Ji said - 'O Goddess! Till date no one has done such hard penance as you have done. Your act is being appreciated all around'. And,finally she was married of to Shiva . Rest story is for some another time.  Thanks for reading. Pragat Dutt ",
            "date": "Updated October 1, 2019",
            "views": "786",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vedhanth Rathod",
                    "user_href": "/profile/Vedhanth-Rathod-2"
                },
                {
                    "user_id": "Arka Mitra",
                    "user_href": "/profile/Arka-Mitra-26"
                },
                {
                    "user_id": "Uddeshya Sharma",
                    "user_href": "/profile/Uddeshya-Sharma-7"
                },
                {
                    "user_id": "Harendra Kumar Dey",
                    "user_href": "/profile/Harendra-Kumar-Dey"
                },
                {
                    "user_id": "Abhishek",
                    "user_href": "/profile/Abhishek-2740"
                },
                {
                    "user_id": "Hardik Vagadia",
                    "user_href": "/profile/Hardik-Vagadia-2"
                },
                {
                    "user_id": "Harsh",
                    "user_href": "/profile/Harsh-748"
                },
                {
                    "user_id": "Uddhav Yadav",
                    "user_href": "/profile/उद्धव-यादव-Uddhav-Yadav"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jai Shree",
                "href": "/profile/Jai-Shree-20"
            },
            "answer_text": "Generally, first 3 days are devoted for god Parvathi.  http://www.astrojyotishi.com/Articles/navratri/navratri_navratra_navdurga_puja.html Second day of navratri is especially for Maa Bhramacharini who is incarnation of god Parvathi http://blog.onlineprasad.com/navratri-puja-mantra-day-2-maa-brahmacharini/ ",
            "date": "Answered April 9, 2016",
            "views": "734",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Manoj Kumar",
                    "user_href": "/profile/Manoj-Kumar-1067"
                },
                {
                    "user_id": "Priya Anand",
                    "user_href": "/profile/Priya-Anand-7"
                }
            ]
        }
    ]
}