{
    "title": "Which instrument sounds prettier, the violin or the piano? - Quora",
    "tags": [
        "Learning Violin",
        "Violins",
        "Pianos"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jerry Whalen",
                "href": "/profile/Jerry-Whalen-1"
            },
            "answer_text": "The piano versus the violin seems to be a one sided decision. The piano has grater range and many more tonal combinations than the violin. The violin has one voice with excursions into double stops and other unique features. I can’t accurately judge an instrument by its sound. There are so many nuances for the differences in instruments that to marginalize a specific instrument in a beauty contest might not cover the bases. I really like the piano because of its beautiful sounds and the range of both delicacy and power. The piano can bring thunder and rain or sense of springtime to the ear. Each player has their own universe of tonality and empathy. Moods change from moment to moment and day by day. The art is in the moment of performance. The violin being an instrument with range and harmony limitations would seem to be the second fiddle (sorry about that) of the two choices. I like the violin for its main properties of being a solo instrument or group instrument. I used to listen to bits and pieces of violin music because I liked the tone and depth of empathy. When searching Youtube for something to listen to, I discovered a version of Mozart’s Requiem for a Dream performed by Kate Chruschicka that twisted my head around. The intensity of the music and presentation was both eerie and haunting. I had to listen to it many times. From that episode I would seek out other violinists to hear the variations in style and presentation. Such performances as Black Violins were great and unique for their playing ability and the infusion of hip hop touches in their music. This is an apples and oranges decision. I like both and can’t choose which the best. Like a good glass of wine shared with good companionship, things are perfect just as they are. Judgement not required. I tried my best but alas, no contest! ",
            "date": "Answered July 26, 2018",
            "views": "754",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amy Andalib",
                    "user_href": "/profile/Amy-Andalib"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Lola-Lulú"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Merkley",
                "href": "/profile/Robert-Merkley"
            },
            "answer_text": "As others have said, this is a very subjective question. I like Bryan’s answer. What do you mean by “prettier”? The violin is very expressive. It is the closest thing to the human voice - which, in my opinion, is the most expressive instrument of all. But it is limited (by it’s 4 strings) to not be much of an instrument for rich harmony. It is mainly a melodic instrument. It shines best when combined with piano in a sonata or an orchestra in a concerto, or with other instruments in chamber music. The piano is limited by the keys being tuned to 1/2 steps which doesn’t allow slides or pitches in between. That said, the piano is a very expressive instrument with many harmonic possibilities, dynamic shading, and a huge range of notes. It is a great instrument to play solo - all by itself. ",
            "date": "Answered June 21, 2018",
            "views": "353",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amy Andalib",
                    "user_href": "/profile/Amy-Andalib"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Lola-Lulú"
                }
            ]
        }
    ]
}