{
    "title": "Which ones are the most interesting facts about The Rolling Stones, and why is that? - Quora",
    "tags": [
        "The Rolling Stones (band)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael VanBibber",
                "href": "/profile/Michael-VanBibber"
            },
            "answer_text": "Usually, vendor ticket prices start around $30 for seats no where near the stage. Again, vendor (ticket master, venue box office,) $100 or more. These tickets usually sell out within hours of being announced they are available for purchase. Now, for the majority of concert goers, ticket5s only available third person resale sites, and/or individual scalpers, or business that resale tickets at rather inflated prices. I have paid less then $30 a ticket, and over $1000 a ticket. I have seen people pay over $5000 a ticket. For me, as an obsessed Stones fan, what ever price I paid, was well worth it. I have been to many concerts, starting 1976. I caught most bands when they where in their prime. ( VanHalen Motley Crue, Metallica, Guns-N-Roses), they all where great concerts. The Stones, are in an entirely different league. I have yet to meet someone that has seen the stones in concert, say they did not enjoy it. Most people I know, that have been, say the same thing “best fucking concert they have ever attended. I know people attend same concert and see things from their own perspective, but all of them found it to be the best concert they ever seen for what ever their reasoning. I Will end with this, if you can afford to go see the Rolling Stones, and never have, snatch up them tickets as fast as you can. ",
            "date": "Answered July 2, 2020",
            "views": "348",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Timothy Sasscer",
                    "user_href": "/profile/Timothy-Sasscer"
                },
                {
                    "user_id": "Randy Stanley",
                    "user_href": "/profile/Randy-Stanley-4"
                },
                {
                    "user_id": "Ethan Wing",
                    "user_href": "/profile/Ethan-Wing-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Rosenberg",
                "href": "/profile/Dan-Rosenberg-8"
            },
            "answer_text": "Three: Mick Jagger, Charlie Watts and Keith Richards. Those who were full members and aren’t in the band any longer: -Guitarist Brian Jones (was found dead at the bottom of his pool in 1969 soon after being fired by Richards and Jagger) -Bassist Bill Wyman (retired in the 1990s) -Guitarist Mick Taylor (left the band in 1974, was a full member from 1969–1974). ",
            "date": "Answered June 13, 2020",
            "views": "307",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Raymond Russ Kroll",
                    "user_href": "/profile/Raymond-Russ-Kroll"
                },
                {
                    "user_id": "Muiris Mac Cartaine",
                    "user_href": "/profile/Muiris-Mac-Cartaine"
                }
            ]
        }
    ]
}