{
    "title": "Which are Bob Dylan's best love songs? - Quora",
    "tags": [
        "Bob Dylan (musician)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eduardo Ramos",
                "href": "/profile/Eduardo-Ramos-96"
            },
            "answer_text": "If you don’t consider his breakup songs, like “Dirge”, “Don’t Think Twice, It’s All Right”, and pretty much Blood on the Tracks in its entirety, there are still a lot of great ones. Dylan’s progression in love songs is very easy to be noticed. His few early love songs from The Freewheelin’ are pretty simple and straight-forward, and they get better with time, specially 1964 (coincidentally when he met Sara Lownds), when we talk about one of my favorites of his: “To Ramona”. Your cracked country lips I still wish to kiss As to be by the strength of your skin Also from 1964, “Ballad in Plain D” isn’t a love song, but a breakup song, and I feel like it’s very underrated among Dylan fans. “Spanish Harlem Incident” is also a highlight. In 1965, almost marrying Lownds, he recorded other two I absolutely adore: “Love Minus Zero/No Limit” and “She Belongs to Me”. The cloak and dagger dangles Madams light their candles In ceremonies of the horsemen, even the pawn must hold a grudge Statues made of matchstick crumble into one another My love, she does not bother She knows too much to argue or to judge The latter, while not as good of a poem, still is a great love song, with a few great lines. My personal favorite is this: She wears an Egyptian ring that sparkles before she speaks She’s a hypnotist collector, you are a walking antique Later, in 1966 and now married, Dylan wrote probably his best love songs in Blonde on Blonde. It’s just a sequence of massive love songs with the peak sound of his career. I’d say “I Want You”, “Sad-Eyed Lady of the Lowlands” (a clear homage to his then wife), “One of Us Must Know (Sooner or Later)” and “Just Like a Woman”. Even though it’s a pop song, “I Want You” has great lines, like the opening one: The guilty undertaker sighs The lonesome organ grinder cries The silver saxophones say I should refuse you The cracked bells and the washed-out horns Blow into my face with scorn But it’s not that way, I wasn’t born to lose you And my favorite from those, “Sad-Eyed Lady of the Lowlands”, which is an 11-minute epic with perfect instrumental and perfect vocals. The kings of Tyrus with their convict list Are waiting in line for their geranium kiss And you wouldn’t know it would happen like this But who among them really wants just to kiss you? With your childhood flames on your midnight rug And your Spanish manners and your mother’s drugs And your cowboy mouth and your curfew plugs Who among them do you think could resist you? With your sheets like metal and your belt like lace And your deck of cards missing the jack and the ace And your basement clothes and your hollow face Who among them can think he could outguess you? With your silhouette when the sunlight dims Into your eyes where the moonlight swims And your matchbook songs and your gypsy hymns WHo among them would try to impress you? From then on, he continued to write some great love songs, but I think he peaked in this category around this time. Having said that, I still have to mention a few. In 1974, he released Planet Waves and even though the album is kind of childish with a dad-like Dylan, there are two deep love-related songs, the heartbroken “Dirge” and “Wedding Song”. The latter is again to his then wife, Sara Lownds, and even though it isn’t as poetic as any other of the mentioned before, it’s still powerful for being so personal and so touching. In 1975 The Basement Tapes were out and, with it, “You Ain’t Going Nowhere”, another good Dylan love song. 1976’s Desire also had a single great love song: “Sara”, another personal favorite of mine without such a poetic bless that Dylan’s early love songs used to have. After that, there were more good songs with some theme of love (“Love Sick”, “Is Your Love in Vain?”, etc.) but they weren’t as focused on love or were breakup songs. Or they just weren’t good enough (“Make You Feel My Love”). ",
            "date": "Answered August 16, 2018",
            "views": "74",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dylan Rodriguez",
                    "user_href": "/profile/Dylan-Rodriguez-73"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Sheward",
                "href": "/profile/Mike-Sheward-1"
            },
            "answer_text": "BOB DYLAN’S LOVE SONGS ?.  There are loads of them to choose from, and many different types… A QUICK SHORT LIST… “Baby let me follow you down”… “It ain’t me babe”… “One too many mornings”… “Girl from the North country”… “Don't think twice it’s alright”… “Corrina, Corrina”… “She belongs to me”… “Love minus zero, no limit”… “It’s all over now, Baby Blue”… “Lay lady lay”… “Just like a woman”… “Visions of Johanna”… EYES DOWN FOR THE FULLER LIST… I HAVE PLACED A STAR IN FRONT OF THE BEST ONES… I have also included the most popular songs of each album.  LOVE SONGS… From… “Bob Dylan”. *Baby let me follow you down”… MOST POPULAR ALBUM SONGS… She’s no good, Man of constant sorrow, Pretty Peggy-O, Baby let me follow you down, House of the Risin’ Sun, & Freight train blues,  LOVE SONGS… From… “Another Side Of Bob Dylan”. *All I really want to do, Spanish Harlem incident, *To Ramona & *It ain’t me babe… MOST POPULAR ALBUM SONGS… House of the rising sun, Man of constant sorrow, Freight train blues, & Baby let me follow you down.  LOVE SONGS… From… “The Times They Are A-Changing”. *Boots of Spanish Leather, & *One too many mornings… MOST POPULAR ALBUM SONGS… The times they are A-changin’, With God on our side, When the ship come in, & One too many mornings.  LOVE SONGS… From… “The Freewheelin’ Bob Dylan”. *Girl from the North country, *Don't think twice it’s alright, *Corrina, Corrina, & Honey just allow me one more chance… MOST POPULAR ALBUM SONGS… Blowin’ in the wind, Don't think twice, it’s alright, Oxford Town, Masters of war, A hard rain’s a-gonna fall. & Girl from the North Country.  LOVE SONGS… From… “Bringing It All Back Home”. *She belongs to me, *Love minus zero, & *It’s all over now, Baby Blue… MOST POPULAR ALBUM SONGS… Subterranean homesick blues, Maggie’s Farm, Mr Tambourine man, It’s alright Ma (I’m only bleeding), Gates of Eden, & It’s all over now Baby Blue,  LOVE SONGS… From… “Blonde On Blonde”. *Just like a woman, *Visions of Johanna, *I want you, One of us must know (sooner or later), Absolutely Sweet Marie, *4th time around, Most likely you go your way and I’ll go mine, & Sad eyed lady of the lowlands… MOST POPULAR ALBUM SONGS… Rainy day woman Nos 12 & 35, I want you, Stuck inside of Mobile with the Memphis blues again, Leopard skin pillbox hat, Just like a woman, & Sad eyed lady of the lowlands.  LOVE SONGS… From… “Nashville Skyline”. *Lay lady lay, *I threw it all away, *Tonight I’ll be staying here with you, I threw it all away & To be alone with you… MOST POPULAR ALBUM SONGS… Lay lady lay, Girl from the North Country, I threw it all away, & Tonight I’ll be staying here with you.  LOVE SONGS… From… “Highway 61 Revisited”. *Desolation Row”… The most dramatic love song of the lot. MOST POPULAR ALBUM SONGS… Like a rolling Stone, Tombstone blues, Highway 61, & Desolation Row.  LOVE SONGS… From… “Self Portrait”. I forgot more than you’ll ever know, Let it be me, *Early morning rain, Take me as I am (Or let me go), Take a message to Mary, It hurts me too & *Alberta… MOST POPULAR ALBUM SONGS… Days of 49, Early morning rain, Copper kettle, Wigwam, Alberta, In search of Little Sadie, Let it be me, & All the tired horses in the sun.  LOVE SONGS… From… “Planet Waves”. *Wedding song, Something there is about you, *Forever young, You angel you, Tough Mama, & Never say goodbye… MOST POPULAR ALBUM SONGS… Forever young, Wedding song, & On a night like this.  LOVE SONGS… From… “John Wesley Harding”. *Down along the cove, & *I’ll be your baby tonight… MOST POPULAR ALBUM SONGS… All along the Watchtower, I’ll be your baby tonight, Drifters escape, The wicked messenger. John Wesley Harding, & down along the cove.  LOVE SONGS… From… Pat Garrett & Billy The Kid. “Knockin’ on Heavens Door”… In the film the song plays as one of the main lawmen characters, dies in his wife’s arms, from gun shot wounds. Making it the sadist of all love songs. MOST POPULAR ALBUM SONGS… *Knockin’ on Heavens Door, Main title theme, & Final theme.  LOVE SONGS… From… “New Morning”. *If not for you, & Sign in the window… MOST POPULAR ALBUM SONGS… New morning, If not for you, Three Angels, & Father of night.  LOVE SONGS… From… “Street legal”. *True love tends to forget, *We Better talk this over, *Where are you tonight, Baby, stop crying, & *Is your love in vane ?, MOST POPULAR ALBUM SONGS… Changing of the guards, New pony, No time to think, Señor, & Is your love in vain.  LOVE SONGS… From… “Blood On The Tracks”. *Tangled up in blue, *Simple twist of fate, your a big girl now, *You’re gonna make me lonesome when yo go, If you see her say hello, *Shelter from the storm, & *Buckets of rain… MOST POPULAR ALBUM SONGS… Lily, Rosemary and the Jack of hearts, Tangled up in blue, Simple twist of fate, Shelter from the storm, You’re gonna make me lonesome when you go, & Idiot wind.  LOVE SONGS… From… “Empire Burlesque”. Tight connection to my heart, Seeing the real you at last, I’ll remember you, & Emotionally yours… MOST POPULAR ALBUM SONGS… Dark Eyes, When the night comes falling from the sky, & Tight connection to my heart,  LOVE SONGS… From… “Down in The Groove”. When did you leave Heaven, Had a dream about you baby, & *Sally Sue Brown, & something’s burning baby… MOST POPULAR ALBUM SONGS… Lets stick together, Sally Sue Brown, Death is not the end, Silvio, & Rank strangers to me.  LOVE SONGS… From… “Desire”. *Isis, Romance in Durango, & *Sara… MOST POPULAR ALBUM SONGS… Black Diamond Bay, Hurricane, Isis, Joey, Mozambique, & Romance in Durango.  LOVE SONGS… From… “Infidels”. Sweetheart like you, & Don't fall apart on me tonight… MOST POPULAR ALBUM SONGS… Jokerman, Union Sundown, Neighbourhood bully, & Licence to kill.  LOVE SONGS… From… “Oh Mercy”. *Shooting Star, & When Teardrops fall, & *Most of the time. MOST POPULAR ALBUM SONGS… Man in the long black coat, What was it you wanted, Political World, Most of the time, & Everything is broken.  MOST POPULAR ALBUM SONGS… Under the red sky, Cat in the well, Unbelievable, God knows, 10,000 men, & T.V Talkin’ song  LOVE SONGS… From… Slow Train Coming. *Precious Angel, I believe in you, & Do right by me baby. MOST POPULAR ALBUM SONGS… Gotta serve somebody, Slow Train, When you gonna wake up, & Man gave names to all the animals  LOVE SONGS… From… Knocked Out Loaded. Maybe someday, *Brownsville girl, & Under your spell… MOST POPULAR ALBUM SONGS… Brownsville girl, They killed him, & Precious Memories,  LOVE SONGS… From… Time out of mind. *Not Dark Yet, *Love Sick, *Standing in the doorway, Dirt road blues, Till I fell in love with you, & *Make you feel my love… This album is drenched in love, and the effects of it. MOST POPULAR ALBUM SONGS… Not dark yet, Tryin’ to get to Heaven, Cold Irons bound, & Highlands,(16 minutes long).  LOVE SONGS… From… The Bootleg Series. 1,2,3. *Mama, you been on my mind, *Farewell Angelina, *If you gotta go, go now, She’s your lover now, You changed my life, Need a woman, & Angelina… MOST POPULAR ALBUM SONGS… He was a friend of mine, Let me die in my footsteps, When the ship comes in, Farewell Angelina, if you gotta go, go now, It takes a lot to laugh, it takes a train to cry, Seven curses, Eternal Circle, Tangled up in blue, Idiot wind, Catfish, every grain of sand, Angelina, Every grain of sand, Foot of pride, Blind Willie McTell, Series of dreams, Talkin’ Bear Mountain picknick, & Talkin’ John Birch paranoid blues.  Bob Dylan’s love songs… The soft, caring, loving side of Bob Dylan. People only tend to think of him as a Protest, Folk, Abstract, or Rock singer… It’s such a change to be in touch with his soft, and tender, side. ",
            "date": "Updated January 10, 2020",
            "views": "4",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Annette Bouharb",
                    "user_href": "/profile/Annette-Bouharb-1"
                }
            ]
        }
    ]
}