{
    "title": "Which lyricist really contributed to Bollywood? - Quora",
    "tags": [
        "Bollywood Music",
        "Song Lyrics",
        "Writers and Authors",
        "Bollywood"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mayur Puri",
                "href": "/profile/Mayur-Puri"
            },
            "answer_text": "I will give the answer which most lyrics including myself, currently working in the Hindi Film Industry will give you. I'm not kidding, when it comes to one person who has contributed most to the art and craft of writing lyrics, whose words have made the biggest significance in the lives of billions of Indians, over 4 generations - there is just one unambiguous and unanimous choice - Anand Bakshi.  I can list his songs, give you links of wikis about him or IMDb links and million webpages which will astound you with information supporting this claim, but the easiest way to determine his greatness is this: Get your family and / or friends together and play Antakshri. Just see how many of his songs pop up. I swear every third song will be his. If that is not the biggest contribution, what is?  And thank you for asking this question. It gave me an opportunity to talk about my idol! Cheers! ",
            "date": "Answered July 7, 2015",
            "views": "560",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sripad Joshi",
                    "user_href": "/profile/Sripad-Joshi-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gopal Sinha",
                "href": "/profile/Gopal-Sinha"
            },
            "answer_text": "Out of at least a dozen such names, it is rather difficult to name one, but let it be Shailendra, who used to write beautiful and meaningful lyrics with simple and sweet words easily identifiable with common man, for different moods and situations and many of them became unforgettable under the music composition of Music Directors like S.D.Burman, Shankar-Jaykishan, Salil Chaudhary, R.D.Burman etc. Some of his beautiful songs are as follows--- 1. O sajna barkha bahar aayi--Parakh--Lata, 2. Ghar aaja re ghir aayi badara saanwariya---Chhote Nawab--Lata, 3. Aa ja re pardesi--Madhumati--Lata, 4. Zulmi sang aankh ladi---Madhumati---Lata, 5. Suhana safar aur ye mausam haseen---do---Mukesh, 6. Sajan re jhoothe mat bolo---Teesari kasam---Mukesh, 7. Aawara hun--Aawara--do, 8. Mera joota hai Japani---Shri 420---do, 9. Kisi ki muskurahaton pe ho nisaar---Anari--do, 10. Sab kuchh sikha hamne--do--do--etc., randomly. ",
            "date": "Answered July 1, 2015",
            "views": "258",
            "upvotes": "0"
        }
    ]
}