{
    "title": "Which violin sonata piece has a piano accompaniment that is technically more challenging than the violin part? - Quora",
    "tags": [
        "Learning Violin",
        "Violins",
        "Pianos",
        "Classical Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "John B Dick",
                "href": "/profile/John-B-Dick"
            },
            "answer_text": "There was a brief fashion for Piano Sonatas “with an accompaniment for a violin” I have seen one, not catalogued but attributed to “Mozart” [Leopold, I think]. I gave up piano in 1950, wrongly believing that I was not making progress, because of family pressure to do more practice and make faster progress. I have recently learned that I was playing a Grade 3 piece. Since then I have played all the orchestral wind including recorder, renaissance wind, serpent and saxophone, 3-valve brass, the lower strings, timpani and untuned percussion, baroque guitar and viols. In the years that are left to me I hope to take up the piano again and my two pianos will be delivered to our almost completed self-build house in the next weeks. The piano part is not virtuosic and the full chords with thirds in the bass would sound well on my 1810 model square. The harpsichord/piano repertoire marketed with the ladies of the Edinburgh enlightenment as the target purchasers is extensive and almost never heard. On an appropriate instrument, there is good stuff there which is within the technical reach of many amateurs. ",
            "date": "Answered August 18, 2017",
            "views": "559",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Maurice Wong YF",
                "href": "/profile/Maurice-Wong-YF"
            },
            "answer_text": "Plenty. You might want to look at the fourth movement of the Franck in A major, or even the throughout the Beethoven kreutzer. Those pieces have piano parts that in my opinion, harder than violin parts. This is not saying that the violin parts are easy; you need to be yourself an accomplished violinist to play those pieces. ",
            "date": "Answered August 16, 2017",
            "views": "421",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jas Wang",
                    "user_href": "/profile/Jas-Wang-2"
                },
                {
                    "user_id": "Frederic Rachford",
                    "user_href": "/profile/Frederic-Rachford"
                }
            ]
        }
    ]
}