{
    "title": "Which music production software would you recommend to work with? - Quora",
    "tags": [
        "Music Production Software and Apps",
        "Survey Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Edwards",
                "href": "/profile/Mike-Edwards-173"
            },
            "answer_text": "I can answer you with confidence…I use the following: Cubase 10 Pro, Studio One 4 Professional, Reaper, Samplitude, and Cakewalk by Bandlab. Many of my associates use ProTools. I have friends who swear by Logic and FL. I recommend all of these. They are all great, and based on what day of the week it is, and what the project is, one of them will be better than the others. Each one has things it does better than the others, but they are all robust and powerful. I you are fleshing out structure and arrangement for a new composition - Cubase 10 Pro and Studio One 4 have their own ways of letting you restructure the tune. They all have great pluggins and instruments . I’m trying to remember what Reaper has in the way of instruments — it may not. But like others said, there are great free instruments you can download. Meanwhile, it doesn’t really matter as long as you chose any of the above, expend at least 30 hours to learn what it does and how to do it. If you use one, you can usually figure out how to do the same on the others. Specializing on one will optimize your work flow which means speed. If you are new - I would recommend downloading Cakewalk by Bandlab. It is free and the current included pluggins are exceptional. It is every bit as powerful as the others listed, and it supports sound on sound recording in a single track that none of the others support. The current version is as stable as any of the others. What I also like about Cakewalk is that there are 4 ways to do everything, so if you guess, you will likely be right. On the other end of the spectrum is Cubase 10 Pro - which is a technical monster designed for professionals who work on a DAW all day. Cubase 10 Pro and Cakewalk are my two favorite. I use 3rd party pluggins by Waves, Izotope, PSP Audio, Native Instruments, XLN, and Overloud. I made a conscious effort not to use the included pluggins so that my work is basically DAW independent even though I mainly use Cubase 10 Pro. If you plan on working in a big shop - learn ProTools - that’s pretty much all the big production companies use. If you are going to independent, choose anything. ",
            "date": "Answered May 18, 2019",
            "views": "121",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William Shepherd",
                "href": "/profile/William-Shepherd-3"
            },
            "answer_text": "\"The best software' is highly subjective, so any answer will be right. As others before me have stated, the best software is the software that fits your needs.  For me, the best software is Pro Tools. Why? Because it's industry standard, I have never stepped foot or even heard of professional studios not having Pro Tools. So, if you are concerned with being able to step into any studio and open your session, Pro Tools may be the best option.  Are you more concerned with your DAW being cross-platform (OS X/Windows)? If that's your primary concern, then that rules out Logic, Garage Band (is that still a thing?) and FL Studio.  Do you want to have practically unlimited tracks in a session? If so, something like Pro Tools may not be the option for you since it has audio track limitations on non Pro Tools HD systems: typically audio track count is a function of the number of DSP chips you have available. If you are into performing live, Ableton Live may be for you. It's awesome for experimenting with your music's arrangement and programming automation. It's also great if you like prefer loop-based production. I haven't use Ableton since version 5, but I imagine it has only gotten better and more fully featured since then. I hope my point is clear with all of the question I've asked. The best is a personal matter and highly dependent on your needs. But, I will humor your actual question with my opinion of the best followed by my two top choices.  Pro Tools - amazing audio recording/editing workflowReason - very cool workflow and tons of instruments; can be used as an external instrument in Pro Tools via ReWireFL Studio - for sample based production it is my standard: it's incredible simple to use and programming drums via the sequencer is coolLogic isn't in my list although I own it. Logic's library of loops is phenomenal and bus routing could potentially be better than Pro Tools, but I just don't like Logic's workflow. ",
            "date": "Answered September 17, 2015",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dipan Karmacharya",
                    "user_href": "/profile/Dipan-Karmacharya"
                }
            ]
        }
    ]
}