{
    "title": "Which K-pop group do you think needs to be recognized, and why? - Quora",
    "tags": [
        "K-Pop Bands",
        "K-Pop Idols",
        "K-Pop",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dumbie Learning Korean",
                "href": "/profile/Dumbie-Learning-Korean"
            },
            "answer_text": "That really does depend, because some people tend to base off whether they pay attention to the group by popularity, looks, talent and even company. But even with all of this, there are some groups that need to be recognized or should be more popular. -Stray Kids. I know they’re a popular group with lots of STAYS, but personally, I believe that they need more recognition because I feel that some people don’t consider them a group and more just a group that’s gonna leave soon. -Loona. Again, they’re popular, but some people don’t see them as a group and are just looking at them for their music and looks. Like, that’s cruel, don’t just look at them because you can. -TXT aka Tomorrow By Together. They are widely known and popular, but everyone sees them as copies of BTS. As an MOA, I would personally know, and I feel like MOAs have to be protective or else they might get overwhelmed with threats or stuff. -BTS. Even though they’re the most popular boy group in the world right now, everyone treats them like they’re not important, oh they’re music’s so good but we don’t care about the members. It really is angering. -Twice. I personally do not like Twice all that much, but I know them enough to know that they deserve more than they get, and that they should have more promotions and more concepts than the ones JYP and others choose. I hope this answered your question! ",
            "date": "Answered September 22, 2020",
            "views": "66",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Clara Jones",
                    "user_href": "/profile/Clara-Jones-88"
                }
            ]
        },
        {
            "author_info": {
                "name": "Choi Ye Seo",
                "href": "/profile/Choi-Ye-Seo"
            },
            "answer_text": "DIA   Originally a 7 membered group (different lineup from the photo above!), DIA debuted in September 17, 2015 with the full album “Do It Amazing”, the members back then were: Cho Seunghee - Leader, Main Vocalist, Face of the Group (former member of F-ve Dolls, a sub-unit of Coed School under Core Contents Media or better known as MBK Entertainment)Heo Sooyeon (Eunice) - Main Vocalist, Lead DancerKi Huihyeon - Main RapperLee Soyul (Jenny) - Vocalist, VisualBaek Yebin - Lead VocalistAhn Eunjin - Lead Rapper, Main DancerJung Chaeyeon - Vocalist, Visual, MaknaeAround 2016, they announced that they're going to add Kwon Chaewon (Eunchae), a few months later Seunghee left the group because her contract expired (she was under CCM/MBK longer, she actually said she never wanted to debut in DIA because her contract was already expiring and didn't want to renew, her departure greatly affected DIA as she was the most popular member at the time). Before their first comeback members Jung Chaeyeon and Ki Huihyeon along with trainee Kim Dani competed in Produce 101, Chaeyeon absolutely blew up and was now DIA's most famous member and an I.O.I member, and this is where things would go downhill for DIA. Since Chaeyein is the most famous member, MBK pushed her A LOT, she was often at the center and got a lot of lines, even more than the original main vocal Eunice, because of this DIA was sadly more known as “Jung Chaeyeon's Group” rather than DIA. In 2017 two new members were added, Lee Jueun and Ahn Somyi, of course with another lineuo change a lot of fans would be confused and sometimes lose interest because of the group being inconsistent, but 2017 was DIA's best year, their album Love Generation sold well with more than 30k sales (their highest). Members Yebin and Somyi competed in The Unit, here we saw how the girls were negatively affected because of Chaeyeon's popularity (MBK and the Media's fault), they were UNKNOWN while one of their member was SKYROCKETING, they said they wanted to be as successful as Chaeyeon which is heartbreaking. Fortunately Yebin made it to the debuting group and her popularity rose a lot. Now into 2018 we saw ANOTHER member change, Eunjin left the group, this member change negatively affected the group because she was one of DIA's popular members (not as popular as Chaeyeon, but she was popular in the fandom and kpop scene for her dance skills). 2018 was when they got their first (and currently the only) win with Woowoo, this was a very memorable moment for DIA and AID, I can clearly remember how hard the girls have cried. 2019 and yet again we saw ANOTHER member change, this time it was Jenny who left, she was also quite known in Korea for her visuals. They were getting lesser and lesser comebacks, and for their 2019 comeback MBK managed to mess it up by releasing the album late, VERY LATE. Also months later after Jenny's departure, Somyi went on hiatus, with no announcements from MBK everyone was worried. Then suddenly she went live while breaking down and crying, after that nothing has been heard from her (until her instagram return last month, we'll get into that later). 2020 and after 14 long months of waiting, WE ARE FINALLY GETTING A COMEBACK!! But it wasn't what we were expecting, this time 2 members were missing, it's Chaeyeon and Somyi. The comeback sadly tanked and was their lowest charting one, because Chaeyeon was absent. Nobody knew where the 2 members were and we were mad at MBK for being unprofessional and not releasing a statement that Chaeyeon and Somyi would be absent for the comeback, they hid behind the girls. Now September 2020, Chaeyeon has returned to the group while Somyi is active on Insta, but was not present in DIA's 5th anniversary, nor greet the members on their birtbdays. Right now their future is uncertain since their recent comebacks are not performing well especially Hug U, I really hope MBK does shit right and let DIA have another comeback. PLEASE, SUPPORT DIA. THEY DESERVED TO BE RECOGNIZED. ",
            "date": "Answered September 27, 2020",
            "views": "126",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Choi Ye Seo",
                    "user_href": "/profile/Choi-Ye-Seo"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Teniola-S-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Xan Hwa",
                "href": "/profile/Xan-Hwa"
            },
            "answer_text": "i will be mentioning an UNDERRATED group. so when i read this question, i immediately thought of one group : onf.  onf was originally a seven-member group. they debuted on august third 2017 under wm entertainment (wm is different from woolim!!) as we all know, wm handles oh my girl and b1a4.. that's just that. it's as if onf is the black horse ; they barely get recognition unlike their seniors. of course they're new, and they've been doing great! all was going well, until a member left the group. laun, the group's youngest, terminated his contract and left the group due to ‘personal reasons’ on august twenty third, 2019. it confused fuses (fandom name) a lot because laun posted four days before his departure, and the members celebrated his birthday on the eleventh, showing off their friendship. there's also a vlive taken by the group one hour before the departure was announced, and none of them mentioned or even hinted on laun’s departure. what shocked us the most though, is j-us’ statement on the matter. j-us is the group’s leader! We’re also surprised by the sudden departure of Laun. We don’t understand what we should be doing, but we did realize our fans must be more shocked and worried. So we decided to write this. As a team, we have been striving to repay our fans who have been so patient with us. But we know today’s news broke the fans’ hearts. As a leader, I feel responsible. More than half of ONF members have trained for such a long time to accomplish our dreams of debuting as idols. We thought once we make our dream come true, there will be only good and happy times. But sometimes it was hard and exhausting. Today, we learn again that life can’t always go the way we want it to. (translation credits to koreaboo) it's really weird because laun has been very active within the group. posting selcas, being part of isac, acting in a drama n all that.. the thing is, the agency also posted their comeback’s teasers a day before laun’s departure. the thing is, aren't contracts talked over for days, if not, weeks, or even months? i'm not blame anybody, but.. did laun keep it a secret from his members? or did the company kick him out? if so, what's the reason? this was all just fishy. after that, the group didn't come back for eight months. imagine what happened behind the scenes. losing a member was hard, everybody would know that the pain is like that of a family member leaving you. it hurts. the group then came back on october seventh, 2019 with the album ‘go live,’ ‘why’ being their title track.  and then, they participated in road to kingdom on the early half of 2020! they competed with other established names, namely the boyz, oneus, pentagon, and verivery. it was like a spark of new hope for everyone in the group and in the fandom.  that's ‘new world,’ a song that they released and performed in road to kingdom. this got them trending in korea, standing on the top five trending groups with really big names such as bangtan, nct, exo, and seventeen, with onf on fourth place. the song itself placed fifth on ‘bug music awards’. honestly this song makes me want to cry. it's like, they've moved on from the sudden departure of laun and are ready to take on the ‘new world’. here's also their collab with pentagon on road to kingdom, a remix of kill this love (original : blackpink ) because i'll never shut up about it 😳  they might have not won road to kingdom (ahhh congrats tbz <3) but then went back home with some fame on their back. after ten months, TEN MONTHS after their comeback ‘why’, they came back just recently on august tenth, 2020 with the album ‘spin off’ and their title track ‘sukhumvit swimming’. honestly the mv teasers were so serious n all that, making it seem like a serious song n look like a movie trailer but the mv itself was all :DD n that escalated quiCKLY. no complains though.  and they seem to be doing well at the moment, coming from a small company and being a rookie! but please, if you can spare some time, please check them out!! <3 i hope they get recognized more internationally, they deserve it. here, have a hwa (´｡• ᵕ •｡`)  ",
            "date": "Answered September 22, 2020",
            "views": "219",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "GAYforGAhYeon",
                    "user_href": "/profile/GAYforGAhYeon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jaide Ng",
                "href": "/profile/Jaide-Ng"
            },
            "answer_text": "Oh there are so many but my favorite underrated groups are Dreamcatcher - I swear they have such bop songs. I love all of their songs! And Siyeon, don’t get me started, she’s one of my top 10 female singers!ONF - they have unique songs and they are very talented, RTK is the witness. Hyojin too is one of my top 10 male singersBTOB - though they are popular in Korea, everyone in the world deserves to know BTOB and how great they are!Pentagon - such talented group too! And their songs are amazing! And they are very versatile! Jinho is in my top 10 too, and he’s on the upper half.They are just few of the groups that should be recognized, listening to their songs might answer your why ;) ",
            "date": "Answered September 29, 2020",
            "views": "45",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Taeho Kim",
                    "user_href": "/profile/Taeho-Kim-6"
                },
                {
                    "user_id": "Choi Ye Seo",
                    "user_href": "/profile/Choi-Ye-Seo"
                },
                {
                    "user_id": "Antonia Barbul",
                    "user_href": "/profile/Antonia-Barbul"
                }
            ]
        },
        {
            "author_info": {
                "name": "Divya Anindya",
                "href": "/profile/Divya-Anindya"
            },
            "answer_text": "Hi! in my opinion, it'd be apink. They debuted back in 2011, and yet they still doesn't get much attention or not much people recognize them. I've been a fan since 2014 and they're super talented though. Eunji's vocal is on fleek, Bomi too, Namjoo too, i literally listens to them eversince i was like 11 years old :”) Namjoo recently just released a new song called “Bird” and it's a BOP. Also check out the other Members solo. They're super talented and I'm in love :) Their debut song is a bop too idk why their earlier song (before they change concepts) is amazing too. I miss them. They've also broke the 7 years curse! Its their 9th years together! Please stan Apink for clear skin. ",
            "date": "Answered September 22, 2020",
            "views": "54",
            "upvotes": " Answer requested by Quora User",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Teniola-S-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nikki Ram",
                "href": "/profile/Nikki-Ram-3"
            },
            "answer_text": "Maka’MakaThey debuted in August of 2020, and their song is a BOP. They get only 5k views on their stage performances and are the definition of underrated. It is so sad. They all have main vocalist positions too. Their mv is very nice and refreshing, and its like a summer boardwalk. I absolutely stan, and you should too! I will link some performances, their bio, and their AMAZING MV below. Enjoy!-Nikki Maka Maka Members Profile (Updated!)       P.S Stream Burning Power ",
            "date": "Answered September 22, 2020",
            "views": "46",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Starr Vasquez",
                    "user_href": "/profile/Starr-Vasquez-4"
                },
                {
                    "user_id": "Melody Han",
                    "user_href": "/profile/Melody-Han-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joy Richards",
                "href": "/profile/Joy-Richards-21"
            },
            "answer_text": "Fromis_9 They seriously give me TWICE vibes I just became a fan a few days ago, their music is good… vocals are good and choreography looks fun. I checked the views in their ‘MV feel good’ to see how popular they were. It didn’t have up to a million by then (to be precise 900k views)… idk about rn. But they are really good and in my opinion they deserve a lot of recognition. ",
            "date": "Answered September 25, 2020",
            "views": "85",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Peace Richard",
                    "user_href": "/profile/Peace-Richard-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Johnny Minaj",
                "href": "/profile/Johnny-Minaj-2"
            },
            "answer_text": "I know they’re somewhat recognized now, especially after releasing their new song ‘BOCA’, but I still think Dreamcatcher deserves to be more acknowledged in the K-pop industry. They have so much talent and their music genre is unlike that of typical girl groups which what makes their songs unique. They at least deserve their first win on a music show. ",
            "date": "Answered September 20, 2020",
            "views": "100",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Teniola-S-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adrea Marie",
                "href": "/profile/Adrea-Marie-1"
            },
            "answer_text": "C H E C K M A T E They are a new group who actually just debuted yesterday. So they are a co-ed group, like Kard. There are three guys and two ladies. (Yongseok, Sieun, Suri, Nason & Noah) Check out their song called ‘Drum’ it’s a cute debut song. You can tell they took some Kard influences (respectfully), it kind of gives me Red Moon vibes. I think what kind of makes them unique about their debut is that they are all singing. No one is rapping in that song, you’re used to hearing at least one rap but no one was rapping this time.  ",
            "date": "Answered September 22, 2020",
            "views": "125",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jamila Francis",
                    "user_href": "/profile/Jamila-Francis-10"
                },
                {
                    "user_id": "Melody Han",
                    "user_href": "/profile/Melody-Han-12"
                },
                {
                    "user_id": "Amir Aviv",
                    "user_href": "/profile/Amir-Aviv"
                },
                {
                    "user_id": "Sophia Grace",
                    "user_href": "/profile/Sophia-Grace-149"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aishwarya Ravi Kumar",
                "href": "/profile/Aishwarya-Ravi-Kumar-2"
            },
            "answer_text": "I think dreamcatcher needs to be recognised they are an amazing group but very underrated because most of their songs are like anime opening or j-pop.They have amazing vocals and visuals and they’re rapper Dami is my TOP 5 favourite rapper(you can check it in my other answers)she is amazing, her raps are very strong yet clear. go Stan dreamcatcher ",
            "date": "Answered September 26, 2020",
            "views": "55",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Clara Jones",
                    "user_href": "/profile/Clara-Jones-88"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zoi Vanchhawng",
                "href": "/profile/Zoi-Vanchhawng"
            },
            "answer_text": "Seventeen because they're super talented ",
            "date": "Answered September 20, 2020",
            "views": "89",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Clara Jones",
                    "user_href": "/profile/Clara-Jones-88"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Teniola-S-1"
                },
                {
                    "user_id": "Akerra Jackson",
                    "user_href": "/profile/Akerra-Jackson"
                },
                {
                    "user_id": "Marlene Erazo",
                    "user_href": "/profile/Marlene-Erazo-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elyssya Pretty",
                "href": "/profile/Elyssya-Pretty"
            },
            "answer_text": "we in the zone idk why bit they are sweet talented boys 🥺 ",
            "date": "Answered September 20, 2020",
            "views": "114",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Melody Han",
                    "user_href": "/profile/Melody-Han-12"
                },
                {
                    "user_id": "Akerra Jackson",
                    "user_href": "/profile/Akerra-Jackson"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Teniola-S-1"
                }
            ]
        }
    ]
}