{
    "title": "Which is your favorite part in The Hobbit? - Quora",
    "tags": [
        "The Hobbit (movie series)",
        "The Hobbit (1937 book)",
        "The Hobbit (creative franchise)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Puneet Gautam",
                "href": "/profile/Puneet-Gautam-4"
            },
            "answer_text": "Ah! What is my favourite part about the Hobbit? It is the fact that the book has a fairy-tale, action-adventure feel to it that reminds of reading stories in childhood. The fact that the Hobbit is a children’s book is hard to digest considering the epic scope of not only the Hobbit but of all the books in Tolkien’s Legendarium. Yet, The Hobbit is the simplest published book of Tolkien and it has an old world charm that took me to many places of my childhood reading books like Robin Hood, Snow White and the Seven Dwarves etc. The book has all the elements of the a classical fantasy tale – A cute, adorable character in Bilbo, an immensely likable Wizard in Gandalf, hard and quircky Dwarves, a Dragon, a villainous imp of a character in Smeagol and, of course, epic battles. The books are simple and hold interest throughout. The writing is not too serious and is actually quite funny to read in parts where Bilbo and Dwarves are travelling to the Lonely Mountains before they get embroiled in various fights and unsavory situations. All this has an old world charm that I felt drawn to immediately, and that is the best part about the books. The pure, innocent and charming story telling that captures everybody’s heart who reads this book. Oh! How I wish Peter Jackson had understood this fact about the Hobbit before turning it into that over-ambitious, bloated piece of cinematic trilogy. ",
            "date": "Answered July 22, 2016",
            "views": "897",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Fraser MacWilliams",
                    "user_href": "/profile/Fraser-MacWilliams"
                }
            ]
        },
        {
            "author_info": {
                "name": "Magesh Sivasankaran",
                "href": "/profile/Magesh-Sivasankaran"
            },
            "answer_text": "There are many but the one that in my opinion captures the linguistic awesomeness of Tolkien is this. Good Morning!\" said Bilbo, and he meant it. The sun was shining, and the grass was very green. But Gandalf looked at him from under long bushy eyebrows that stuck out further than the brim of his shady hat. \"What do you mean?\" he said. \"Do you wish me a good morning, or mean that it is a good morning whether I want it or not; or that you feel good this morning; or that it is a morning to be good on?\" \"All of them at once,\" said Bilbo. \"And a very fine morning for a pipe of tobacco out of doors, into the bargain. If you have a pipe about you, sit down and have a fill of mine! There's no hurry, we have all the day before us. Gamdalf then tells Bilbo that he is looking for someone to share in an adventure. Bilbo is flustered by the idea of adventures and ignores the old man. But the old man did not move. He stood leaning on his stick and gazing at the hobbit without saying anything, till Bilbo got quite unconformable and even a little cross. \"Good morning!\" he said at last. \"We don't want any adventures here, thank you! You might try over The Hill or across The Water.\" By this he meant that the conversation was at an end. \"What a lot of things you do use Good morning for!\" said Gandalf. \"Now you mean that you want to get rid of me, and that it won't be good till I move off. Not at all, not at all, my dear sir! Let me see, I don't think I know your name? Yes, yes, my dear sir and I do know your name, Mr. Bilbo Baggins. And you do know my name, though you don't remember that I belong to it. I am Gandalf, and Gandalf means me! To think that I should have lived to be good-morninged by Belladonna Took's son, as if I was selling buttons at the door!  Wizards are after all wizards. ",
            "date": "Answered September 15, 2016",
            "views": "958",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Santhana Krishnan",
                    "user_href": "/profile/Santhana-Krishnan-32"
                }
            ]
        }
    ]
}