{
    "title": "Which genre of music sounds like noise to you? - Quora",
    "tags": [
        "Noise (music)",
        "Sounds",
        "Genres",
        "Music Genres",
        "Noise",
        "Classical Music",
        "Sound",
        "Music Recommendations",
        "Music Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lawrence de Martin",
                "href": "/profile/Lawrence-de-Martin-1"
            },
            "answer_text": "In the extreme case, literally noise music. This is a sub-genre of Electronica which uses noise generators for synthesizer tone generators, and then filters and modulates the noise signals. Music is patterned sound, and noise music works to eliminate nearly all patterns leaving only slight negative patterns and/or beats in the deliberately random frequencies and amplitudes. An interesting analog is Dr.Manfred Schroeder’s Phase Synthesizer, which he built as an experiment at Bell Labs. This was a bank of 500 sine wave oscillators with tightly spaced frequencies in the “speech band” (~300Hz - ~4KHz) and constant amplitude, but individual phase modulation inputs. He extracted the phase information from speech and used it to drive the 500 phase inputs, and the result was recognizable sentences! This works because humans grow up hearing coherent acoustic speech in reverberant acoustics and learn to separate the direct sound and reflections of multiple conversations through the directional phase encoding of the external ears (cocktail party effect). OTOH, humans learn to hear music through the ubiquitous phase scrambling of audio production and reproduction. According to the last 80 years of audiology and acoustic research humans are phase deaf - but that does not apply to people who learned to hear music acoustically. I have re-trained my ears to the acoustic music of my youth by a strict regimen of listening to more hours per week of acoustic music than to audio reproduction. By now this results in my hearing the phase distortion of every knob in recording, mixing and mastering studios, so conventional studio productions all sound like noise to me. I only listen to live music, or to recordings made with a single pair of microphones in an audience at a live concert and neither case using a PA system. All the rest is noise! ",
            "date": "Answered March 13, 2020",
            "views": "63",
            "upvotes": " Answer requested by Jasmine Little",
            "upvoters": [
                {
                    "user_id": "Elsa Kristian",
                    "user_href": "/profile/Elsa-Kristian"
                },
                {
                    "user_id": "Curt Hedges",
                    "user_href": "/profile/Curt-Hedges"
                },
                {
                    "user_id": "Jasmine Little",
                    "user_href": "/profile/Jasmine-Little-26"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lara Gray",
                "href": "/profile/Lara-Gray-6"
            },
            "answer_text": "Sound collages. Sound collages are made up of different pieces of audio that are layered together to create a unique “auditory art piece.” One of the most famous examples of this is ‘Revolution 9’ by the Beatles, influenced by Yoko Ono’s avant-garde art-style and the idea of revolution. According to Lennon: \"Once I heard her stuff – not just the screeching and howling but her sort of word pieces and talking and breathing and all this strange stuff.. I got intrigued, so I wanted to do one.\" That sums it up pretty well. It’s really hard to describe the pure chaos, anxiety, discomfort, and discordancy of this piece so I’d recommend you listen to it yourself.  Yeah. I understand the artistic intention behind it and I respect its intricacy, but it sounds like a lot of noise to me. Which is pretty much what they were going for, anyway. ",
            "date": "Answered February 19, 2020",
            "views": "233",
            "upvotes": " View 3 Upvoters"
        }
    ]
}