{
    "title": "Which is the most famous BTS X Blackpink ship? - Quora",
    "tags": [
        "BLACKPINK",
        "BTS (K-pop group)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shreya Singh",
                "href": "/profile/Shreya-Singh-3520"
            },
            "answer_text": "Okay So, I will be clear that I don't ship them and this edits are fan made.  (This is not real; just an edit) LizKook (Lisa X Kookie ) So they have looked at each other for like 2 seconds, are both Maknaes, and are both attractive + Talented. Thats it. No reason to ship then lmao. I feel like this ship is a self insert for female fans of JK (cuz hes the most popular BTS member) and self insert thru Lisa bc she is the most biased BP member. God y’all are pathetic. 2. Rosékook People ship them cuz of this : Rosé is main vocalist of Black Pink. Jungkook is Main Vocalist of BTS. Rosé is the Lead Dancer in Black Pink. Jungkook is the Lead Dancer in BTS. Also about Jungkook fav food being “ Rosé Pasta “ and the fact that JK avoids girls & Rosie avoids guys. I don't think that having the same position in the group mean you like each other- it doesn't even make sense. JK x Rosie was super popular until Lizkook dominated, but it’s still there. Like really people, come on??!!  From when they MCed on a show together.  ITS AN EDIT NOT REAL 3. Taesoo & Taennie. I see a lot of both of these everywhere I go. People ship Taennie because before Jennie became an ambassador for Chanel, she wore a lot of Gucci. Apparently them having a similar style means they are dating? Okay sis😅 Taesoo blew up when V & Jisoo MCed together on an award show. Apparently they had “chemistry” or some shit. No, hun, they were reading from a script. 😂 Tae did look at Jisoo a lot but she is really pretty, especially to Koreans, so can you blame him? This doesn’t mean they are together or dating, stop making a mountain out of a mole hill. Delulus.  AGAIN REMINDER ITS NOT REAL 4. Jirose They are shipped cuz their face are similar. This logic is like what- they look like siblings tho but I don't think there is any “ special “ reason to ship them. Like WHAT? Oki Felicia baii.  I’ve said it before and ima say it again. ITS JUST AN EDIT CALM THY SELVES. 5. Jinsoo (Jin X Jisoo)—-So people ship them bc they have similar visuals (Uh shouldn’t this make them siblings rather than lovers? Lmao) and like a lot of the same things. I can see WHY you ship them, but that doesn’t mean it’s real. Just because two people COULD be good together doesn’t mean they automatically are or even want to be. Stop projecting onto idols cringey humans. Alrighty. So those are the most popular BlackTan ships. However, fanbases for any BP member X any BTS Member exist. Trust me, I’ve checked. Just search up “Jennie” X “RM” and a thousand edits and fanfics will flood ur screen. Like there’s JK x Soo, Rosie X Suga, JK x Jennie, RM x Soo, Hobi X Lisa, etc. Shipping in general is toxic and dumb. On the very unlikely chance that any of these ships are real, okay, good for the people involved. BUT it’s none of your business and you do not and should not know anything about these idols’ personal lives. Imagine a BTS or BP member is dating someone, and that person is bombarded with these edits of their GF/BF kissing someone who isn’t them everyday! Imagine how uncomfortable BTS/BP feel! These edits have probably made it awkward and ruined chances of friendship between the members!! The wonders of Technology are at the tip of our fingers and THIS is what y’all choose to do? Lmao I’m ashamed to be the same species as you.   ",
            "date": "Updated September 19, 2020",
            "views": "88",
            "upvotes": " View 73 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mayu's Euphoria",
                    "user_href": "/profile/Mayus-Euphoria"
                },
                {
                    "user_id": "Jasmine Kour",
                    "user_href": "/profile/Jasmine-Kour-23"
                },
                {
                    "user_id": "Nightmoon114",
                    "user_href": "/profile/Nightmoon114"
                },
                {
                    "user_id": "Sharda Tiwari",
                    "user_href": "/profile/Sharda-Tiwari-23"
                },
                {
                    "user_id": "Pedro Miguel Castillo Juárez",
                    "user_href": "/profile/Pedro-Miguel-Castillo-Juárez"
                },
                {
                    "user_id": "Aleena Shibi",
                    "user_href": "/profile/Aleena-Shibi"
                },
                {
                    "user_id": "Leana Goldie Krystel Bautista",
                    "user_href": "/profile/Leana-Goldie-Krystel-Bautista"
                },
                {
                    "user_id": "Aarushi Shinde",
                    "user_href": "/profile/Aarushi-Shinde-3"
                },
                {
                    "user_id": "Lindsey Lee",
                    "user_href": "/profile/Lindsey-Lee-144"
                },
                {
                    "user_id": "Masarat Ali",
                    "user_href": "/profile/Masarat-Ali-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Helena Rachel",
                "href": "/profile/Helena-Rachel"
            },
            "answer_text": "Ahhhh, Stupid Ships. Lisa X JungkookThey have been shipped since BLACKPINK’s debut and are one of the Original Ships between BTS X BLACKPINK. They have 14,600,000 Google Results when you search their name on Google. Rosie X JungkookRose and Jungkook are other ones, Jungkook seems to have a crush on Rose since he can’t take his eyes off her, Rose occasionally looks back at him. Results on Google: 17,600,000. But It’s not my business anyway. Jennie X VThey are shipped because they are both the “Fashionable” ones in their groups. Results on Google: 12,300,000 Jisoo X VThey are shipped because they got to kinda work with each other during an Inkigayo Episode in 2017 along with GOT7’s Jinyoung. Results on Google: 9,390,000 ",
            "date": "Updated September 20, 2019",
            "views": "122",
            "upvotes": " View 36 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tsoyoku Ria",
                    "user_href": "/profile/Tsoyoku-Ria-1"
                },
                {
                    "user_id": "Katelyn Productions",
                    "user_href": "/profile/Katelyn-Productions"
                },
                {
                    "user_id": "Rachel 라첼",
                    "user_href": "/profile/Rachel-라첼"
                },
                {
                    "user_id": "Lina Mishra",
                    "user_href": "/profile/Lina-Mishra-1"
                },
                {
                    "user_id": "Neona Lay",
                    "user_href": "/profile/Neona-Lay-1"
                },
                {
                    "user_id": "Mariam Ibrahim",
                    "user_href": "/profile/Mariam-Ibrahim-228"
                },
                {
                    "user_id": "Lalallala Lalala",
                    "user_href": "/profile/Lalallala-Lalala"
                },
                {
                    "user_id": "Sidhi Mandoliya",
                    "user_href": "/profile/Sidhi-Mandoliya"
                },
                {
                    "user_id": "Komal Chaukikar",
                    "user_href": "/profile/Komal-Chaukikar"
                },
                {
                    "user_id": "Arul Raj",
                    "user_href": "/profile/Arul-Raj-530"
                }
            ]
        }
    ]
}