{
    "title": "Which Indian songs are copied from foreign songs? - Quora",
    "tags": [
        "Bollywood Copied Songs",
        "Indian Songs",
        "Indian Music",
        "Bollywood Music",
        "Bollywood",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chetan Mehta",
                "href": "/profile/Chetan-Mehta-60"
            },
            "answer_text": "There are a lot of hindi songs that are copied from foreign songs. The list is long but a few that I could remember off head are given below: Itna na mujhse Tu pyaar badha was copied from Symphony no 40 by Mozart.Na bole tum Na Maine Kuch Kaha from the movie baaton baaton mein was copied from the track American Salute.Kaisi paheli zindagani from Parineeta was copied from Never on a Sunday by the Charlotte's.Mere rang mein rangane wali from Maine Pyar Kiya was copied from the song Final Countdown by Europe.Akele hai toh kya gham hai from QSQT was copied from return to the Alamo by ShadowsTumse mil ke from Parinda was copied from the song When I need you by Leo SayerHaseena gori gori from taraazu was copied from the song the the summertime by ShaggyNazre Mili Dil dhadka from the movie Raja was copied from the song Come September.Tirchi topiwale from the movie Tridev was copied from the song Rhythm is gonna get you by Gloria EstefanAate jaate from Maine Pyar Kiya was copied from the song I just called to say I love you by Stevie Wonder",
            "date": "Answered September 3, 2019",
            "views": "251",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Abhay",
                    "user_href": "/profile/Abhay-366"
                },
                {
                    "user_id": "Shubhojit Thakur",
                    "user_href": "/profile/Shubhojit-Thakur"
                },
                {
                    "user_id": "Naveen Dalal",
                    "user_href": "/profile/Naveen-Dalal-52"
                }
            ]
        },
        {
            "author_info": {
                "name": "MP Madan",
                "href": "/profile/MP-Madan"
            },
            "answer_text": "Bollywood has always been SUPREME in making songs from Hollywood music. In the Bollywood movie, “Raja”, there was a song, “नज़रें मिली दिल धड़का” which was copied from a Hollywood movie title music, “Come September”. Another song from the Bollywood movie, “Chhaya” (1961), “इतना ना मुझसे तू प्यार बढ़ा कि मैं इक बादल आवारा\" had been copied from Mozzart Symphony No. 40 (I think, an Italian raag). Another song, “Barkha rani zara jum ke barso” from the Bollywood movie, “Sabak” (1973) was copied from a song of Pakistani film “Naseeb Apna Apna”, “Ae abre karam………..itna baras ke wo jaa na sakay” ",
            "date": "Answered September 15, 2019",
            "views": "109",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Abhay",
                    "user_href": "/profile/Abhay-366"
                },
                {
                    "user_id": "Shubhojit Thakur",
                    "user_href": "/profile/Shubhojit-Thakur"
                }
            ]
        },
        {
            "author_info": {
                "name": "G L Brownett",
                "href": "/profile/G-L-Brownett"
            },
            "answer_text": "28 Songs Copied 28 Bollywood Songs That You Didn't Know Were Copied Or 'Inspired' ",
            "date": "Answered September 2, 2019",
            "views": "92",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Luigi Mario",
                    "user_href": "/profile/Luigi-Mario-33"
                },
                {
                    "user_id": "Shubhojit Thakur",
                    "user_href": "/profile/Shubhojit-Thakur"
                }
            ]
        },
        {
            "author_info": {
                "name": "Devashish Jangid",
                "href": "/profile/Devashish-Jangid"
            },
            "answer_text": "its a long list, you can visit following linkhttps://sites.google.com/site/storewellclub/knowledge/hindi-songs-copied-or-influenced-from-some-other-song ",
            "date": "Answered September 20, 2019",
            "views": "53",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Aryan Soni",
                    "user_href": "/profile/Aryan-Soni-29"
                }
            ]
        }
    ]
}