{
    "title": "Which Indian traditional instrument is your favorite and why? - Quora",
    "tags": [
        "Indian Traditional Instruments",
        "Instruments",
        "Indian Music",
        "Musical Instruments",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sean McAleavy",
                "href": "/profile/Sean-McAleavy"
            },
            "answer_text": "Although I love both the sitar and the tabla I am going to have to say that my favorite is the shanai. I don’t know if I spelled that right, but I don’t really care. Because your question got me thinking about that beautiful sound. So right now I have to go listen to The Inner Light. It was written by George and it’s beautiful. ",
            "date": "Answered May 29, 2016",
            "views": "71",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/R-C-98"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Andrews",
                "href": "/profile/Mark-Andrews-56"
            },
            "answer_text": "I am no expert on indian instruments, and I’m sure that a genuine expert will correct me if this is wrong; but isn’t one of the most versatile among indian instruments the sitar, because my understanding is that it has moveable frets making microtonal scales possible? I believe it is a close relative of the veena, but this latter instrument may be somewhat less versatile (but experts please correct me if this is not so). On the grounds of POTENTIAL, therefore, I will suggest the sitar, and this is certainly the instrument best known in the West. ",
            "date": "Answered May 26, 2016",
            "views": "144",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Chang Liu",
                    "user_href": "/profile/Chang-Liu-362"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suhas Tambe",
                "href": "/profile/Suhas-Tambe"
            },
            "answer_text": "Santoor. Its natural tone is vibrational as it is produced by a stroke on the string. The stroke itself is made by a special stick that is balanced on three fingers. The strings are many allowing some intermediate notes easily possible. Thus the sound produced has three variables distance of the strike, pressure applied by the fingers (which can vary within a single note) and which string (and where on its whole length) is struck. It traditionally comes from Kashmir, India and reportedly very difficult to tune as well as to play. ",
            "date": "Answered May 26, 2016",
            "views": "224",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/R-C-98"
                }
            ]
        }
    ]
}