{
    "title": "Which is better, guitar or ukulele? - Quora",
    "tags": [
        "Ukuleles",
        "Playing Guitar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Baisakhi Chatterjee",
                "href": "/profile/Baisakhi-Chatterjee-9"
            },
            "answer_text": "I prefer Guitar. Not only me most of the people prefer guitar over ukulele. Have you ever thought about why guitar is most popular among all other musical instruments? Because it is adaptable to any musical setting, highly portable and relatively affordable, the guitar has inserted itself into every musical culture in the world. From the music of Bach and Mozart to K-Pop and Afro-Cuban music, the guitar can both lead and accompany any style.Research suggests that brains of the musicians work differently than that of normal people. Mastering the art of playing chords and melodies, reading music, keeping a steady beat and understanding the harmonic progression of music develops areas of the brain associated with spatial reasoning, language and attention according to researchers at the NSF Science Center. The guitar is a great instrument for building social skills as well. The central instrument in any band it is a great way of making friends. While it sounds beautiful as a solo instrument, when combined with piano, violin, drums or other guitars the harmonies soar. At Orpheus Academy of Music in Austin, TX, one of the most popular events is something called the “Friendship Concert” (held twice a year) wherein students play songs with their friends on other instruments. If you aspire to take lessons in guitar, in Austin, Orpheus Academy has the most highly trained guitar teachers in the world. The instructors not only have impressive solo careers, but also have spent years studying how to teach and even developing fun, innovative approaches to guitar not available anywhere else. ",
            "date": "Answered March 16, 2018",
            "views": "16",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aditi Kulkarni",
                    "user_href": "/profile/Aditi-Kulkarni-52"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Robinson",
                "href": "/profile/Tom-Robinson-110"
            },
            "answer_text": "This question cannot be answered in any kind of serious way without defining the parameters on which judgment should be based. With that being said, guitar is better. Don’t get me wrong, I love me some ukulele. The guitar is just a far more versatile instrument. It is like asking which is better between bugle and trumpet. Not to mention that guitar can kick ukulele’s ass, smash its glasses, steal its shoes and metrocard, and leave it blubbering in the piss-stained alley any day. But now I’m getting too technical… ",
            "date": "Answered October 13, 2017",
            "views": "16",
            "upvotes": " View 31 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Glen Muthoka",
                    "user_href": "/profile/Glen-Muthoka"
                },
                {
                    "user_id": "Nadine Nadela",
                    "user_href": "/profile/Nadine-Nadela"
                },
                {
                    "user_id": "Dave Glennie",
                    "user_href": "/profile/Dave-Glennie-2"
                },
                {
                    "user_id": "Joshua Mondejar",
                    "user_href": "/profile/Joshua-Mondejar-2"
                },
                {
                    "user_id": "Flying Potato",
                    "user_href": "/profile/Flying-Potato-26"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Shadd-Rojas"
                },
                {
                    "user_id": "Dane Clarke",
                    "user_href": "/profile/Dane-Clarke-1"
                },
                {
                    "user_id": "Devasheesh Gupta",
                    "user_href": "/profile/Devasheesh-Gupta"
                },
                {
                    "user_id": "Syarafana Reslan",
                    "user_href": "/profile/Syarafana-Reslan-1"
                },
                {
                    "user_id": "Eduardo Fernandez",
                    "user_href": "/profile/Eduardo-Fernandez-12"
                }
            ]
        }
    ]
}