{
    "title": "Which NCT members know how to cook? - Quora",
    "tags": [
        "NCT (KPop)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Janis Ho",
                "href": "/profile/Janis-Ho-8"
            },
            "answer_text": "I would think that every member has at least some basic culinary knowledge but the members that seem to be good at cooking, from what I’ve seen on variety shows and interviews are Taeyong and Doyoung. It seemed like Taeyong was previously known as the “chef” of the group but now that position seems to be taken by Doyoung because on recent interviews the members have named him as the best cook in the group. Imo I would say Kun and Yuta seem to be good at cooking too (variety shows, v-live) but maybe not as good as Taeyong and Doyoung. ",
            "date": "Answered September 4, 2019",
            "views": "17",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tamara Sartelli",
                    "user_href": "/profile/Tamara-Sartelli"
                },
                {
                    "user_id": "Covenant Adegbami",
                    "user_href": "/profile/Covenant-Adegbami"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emma",
                "href": "/profile/Emma-3788"
            },
            "answer_text": "I’d say most of the 127 members have experience in cooking. On Vlive, they had an NCT Life Cooking Season and it included Jaehyun, Taeyong, Doyoung, WinWin, Yuta, Taeil, and Ten. Taeyong is known for his great cooking but Jaehyun and Ten did best in the show, with Jaehyun winning in the end. However, I know Doyoung also has some pretty good skills and Taeil has cooked with Taeyong before. ",
            "date": "Answered February 20, 2020",
            "views": "712",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Myatnoe Wai",
                    "user_href": "/profile/Myatnoe-Wai-4"
                },
                {
                    "user_id": "Tamara Sartelli",
                    "user_href": "/profile/Tamara-Sartelli"
                },
                {
                    "user_id": "Kage Thigh",
                    "user_href": "/profile/Kage-Thigh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lara Tayo",
                "href": "/profile/Lara-Tayo-2"
            },
            "answer_text": "Doyoung: He likes to cook for other members.This is one of the reasons other members call him “mom”   ",
            "date": "Answered July 19, 2019",
            "views": "887",
            "upvotes": " Answer requested by Simon Hart"
        }
    ]
}