{
    "title": "Which saxophone neckstrap is the best in your opinion? - Quora",
    "tags": [
        "Saxophone Performance",
        "Classical Saxophone",
        "Play Saxophone",
        "Playing Saxophone",
        "Baritone Saxophone",
        "Soprano Saxophone",
        "Tenor Saxophone",
        "Jazz Saxophone",
        "Alto Saxophone",
        "Saxophone Players",
        "Saxophones",
        "Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Landis",
                "href": "/profile/Daniel-Landis-3"
            },
            "answer_text": "Allan is right when he says that the best strap is the one that works for you. There is going to be a certain amount of subjectivity to this answer for anyone who decides to weigh in. I can only tell you what works for me and why. First, I have no real physical limitations or obvious weaknesses (like a bad back). Second, I have often practiced for many hours at a time. Third, I am mostly a tenor player. Having noted these things, I have had great success with this strap:  It is made by Oleg Products and is very expensive on their website ($90; it was much less when I bought mine years ago), but I think it’s worth it. It is just so comfortable. It is also very well-made and, though it’s difficult to tell this from the picture, it is extremely durable. The neck pad is a high-grade leather and the cords are some sort of high quality synthetic. The “buckle” is metal and the hook is a very strong, high-impact plastic. I’ve had two for many years (I swap them out if I sweat through them) and they’ve never broken or worn out. ",
            "date": "Answered January 17, 2020",
            "views": "105",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Xenia Holmes",
                    "user_href": "/profile/Xenia-Holmes-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dustin Kreidler",
                "href": "/profile/Dustin-Kreidler"
            },
            "answer_text": "I used to swear by the Neo-Tec straps, until I played in a ska band and started to pogo playing bari sax and nearly died when the horn bounced and the mouthpiece tried to stab right between my mouth and nose. I used their shoulder harness through college, just because I was playing bari for upwards of 5–6 hours a day between various ensembles and practicing. Having learned that a stretchy neck-strap is a quick visit to the orthodontist, I moved over to one that’s all nylon with a sheep-skin(fur?) lining. Comfortable, sweat absorbent, and the latch is super-fast to unlock and slap onto another horn for a quick change. Not sure if this is the exact one, but if not, its really similar. I also have an old Vandoren V16-branded neck-strap that I don’t hate… but I find it much harder to adjust and it doesn’t have the extra padding. As I get into my mid-40s, I’m considering going back to the shoulder harness for longer bari-only gigs. I don’t love it for any of the other horns, because it keeps them too high up and in the way, but it was good for bari… at least, 20 years ago. No idea if I’d still like it all that much now. ",
            "date": "Answered January 24, 2020",
            "views": "97",
            "upvotes": " Answer requested by Bo Hugh"
        }
    ]
}