{
    "title": "Which Stray Kids member do you think resembles each twice member, and why? - Quora",
    "tags": [
        "Stray Kids",
        "Boy Bands",
        "TWICE (K-Pop Group)",
        "K-Pop Idols",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Celestina Hollister",
                "href": "/profile/Celestina-Hollister"
            },
            "answer_text": "Okay so I will do OT9 since then every member will have a counterpart. This will be based off their positions, vibes and personalities. Chan resembles..  Jihyo!  They’re both leaders and trained for the longest at JYP entertainment. Both of them are air signs and their blood type is O. Kind of short. Also they get fed up with their members foolishness from time to time. Woojin resembles..  Jeongyeon!  The secondary mom/dad of the group who is also underrated and unappreciated by fans. Quite tall. They’re both amazing vocalists with quite unique voices. Also they also tend to look quite similar in some angles, like their face structure is similar. Minho/Lee Know resembles..  Momo!  Okay so when I first saw Minho, he just really had the Momo vibe, like their faces reminded me a lot of each other (maybe it’s their smirk?). Both are main dancers, sub vocalists and sub rappers. The sexy scorpios to are also very much gay for their members. Another thing is that they were both eliminated by JYP on survival shows. Changbin resembles..  Chaeyoung!  Main rappers who can also sing. They’re both the shortest members of each group and gets teased for it. Also they like to seem “dark” and badass even though we all know they’re babies on the inside. They’re also quite underrated in each group. Hyunjin resembles..  Mina!  Both of these members are the secondary main dancers of each group. They’re both elegant and beautiful. They have a really soft singing voice. Their visuals are superior. Both are born in late March. Can be kind of aggressive and competitive sometimes too. Jisung/Han resembles..  Sana!  Another pair which I thought looked similar at first. Both are the energetic squirrels of each group and they’re also really weird. Have a really cute aura to them and are also pretty gay for their members. Both are earth signs and their blood type is B. Felix resembles..  Dahyun!  Their crackhead energy is what they’re known for. Both members have an interesting aura to them. Lead rappers and also pretty flexible(?). Likes to follow trends like dabbing and fortnite dances. Seem crazy and weird but they’re actually kind of quiet in real life. Seungmin resembles..  Nayeon!  They actually have the same birthday! Both are A blood type and virgos. Lead vocalists (update: Seungmin is the main vocalist now, but nevertheless) of each group. Also I noticed that these two love pulling pranks on their members for fun. Extremely cute but can also be serious when they should. Can be pretty sassy sometimes too. Jeongin/I.N resembles..  Tzuyu!  The maknaes and babies of the groups! They are both air signs with blood type A, and vocalists. Kind of known as the filler member because people overlook their talents. Savage sometimes and done with their hyungs/unnies. Also I noticed that they have a similar face- they even have the same dimple. Please keep in mind that I did this list based off the members roles in each respective group. Thank you for reading this! ",
            "date": "Updated July 31, 2020",
            "views": "23",
            "upvotes": " View 42 Upvoters",
            "upvoters": [
                {
                    "user_id": "Summer Zhao",
                    "user_href": "/profile/Summer-Zhao-18"
                },
                {
                    "user_id": "Lee Know",
                    "user_href": "/profile/Lee-Know-26"
                },
                {
                    "user_id": "Nadine Heffley",
                    "user_href": "/profile/Nadine-Heffley"
                },
                {
                    "user_id": "Bailey Lm",
                    "user_href": "/profile/Bailey-Lm"
                },
                {
                    "user_id": "Arielle Hooker",
                    "user_href": "/profile/Arielle-Hooker"
                },
                {
                    "user_id": "Kei Yeo",
                    "user_href": "/profile/Kei-Yeo"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Edgie-Stan"
                },
                {
                    "user_id": "Aino Kanerva",
                    "user_href": "/profile/Aino-Kanerva"
                },
                {
                    "user_id": "Purple Regina",
                    "user_href": "/profile/Purple-Regina"
                },
                {
                    "user_id": "Lisa Junjuvili",
                    "user_href": "/profile/Lisa-Junjuvili-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lola Jester",
                "href": "/profile/Lola-Jester"
            },
            "answer_text": "Not really sure of it but here we go Jihyo - Seungmin (that sense of innocence with a hint of evil) Nayeon - Hyunjin (the played out ‘self-obsession’ vibe. Also both are really just ‘out there’) Dahyun - Felix (can be really cute and awkward at the same time. They both have ‘weird’ charms to them that make them stand out) Chaeyoung - Chan (can be both loving and caring but also quirky and strange. Chan does tend to speak more about common social issues as well as Chaeyoung does being evident in recent interviews and her actions portraying her strong attitude) Jeongyeon - Changbin (contributes to the groups odd aura but are not too heavily delved into the craziness of it all. Pretty much the normal ones in the group) Tzuyu - Jeongin (two words, blank expressions. Maknaes that deals with the shiz their bandmates puts them in but nevertheless, they have an outgoing side too that pops out from time to time) Sana - Jisung (honestly, it just happened. Really. Sana is known to be the most flirtatious member and Jisung holds that role in the group *ahem* his weird dances with Minho) Momo - Minho (common victims of Sana and Jisung respectively. That was the main reason. Maybe also they have their own sense of humour that stands out the most in their groups. Also they’re AMAZING DANCERS) Mina - Woojin (very precious and must be protected at all costs. Everybody loves them whether it would be the people surrounding them or their fans or just generally people. There’s honestly no reason to hate them) I apologise for the excessive use of ‘also’ and for the lack of information behind the reasons of each pairing. Can’t be bothered full on analysing or even fixing up the members and their counterpart :P ",
            "date": "Answered October 10, 2019",
            "views": "14",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "Summer Zhao",
                    "user_href": "/profile/Summer-Zhao-18"
                },
                {
                    "user_id": "Lee Know",
                    "user_href": "/profile/Lee-Know-26"
                },
                {
                    "user_id": "Twitzy Bangtanist",
                    "user_href": "/profile/Twitzy-Bangtanist"
                },
                {
                    "user_id": "Sejal Desai",
                    "user_href": "/profile/Sejal-Desai-53"
                },
                {
                    "user_id": "Celestina Hollister",
                    "user_href": "/profile/Celestina-Hollister"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/YUNYI-ZHANG-14"
                },
                {
                    "user_id": "Maddie Ledger",
                    "user_href": "/profile/Maddie-Ledger"
                },
                {
                    "user_id": "Melissa Ko",
                    "user_href": "/profile/Melissa-Ko-8"
                },
                {
                    "user_id": "Divine Adeniyi",
                    "user_href": "/profile/Divine-Adeniyi"
                },
                {
                    "user_id": "Pami Loly",
                    "user_href": "/profile/Pami-Loly"
                }
            ]
        }
    ]
}