{
    "title": "Who is the most underrated singer? - Quora",
    "tags": [
        "Underrated Things or People",
        "Singers",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nolan Jacques",
                "href": "/profile/Nolan-Jacques-2"
            },
            "answer_text": "Emily Kinney is a vastly underrated singer and in my holy opinion stands well above most if not all modern pop artists or singers.  Why? For starters from what I can tell, Kinney doesn’t go out of her way to sexualize herself which definitely seems to be the primary appeal of other artists. Kinney is equally or more attractive than most other female pop stars despite being older than them. For example, Ariana Grande seems to be eye candy for her audience with autotune and catchy lyrics making up the rest of her success.  I’ve seen videos where Grande flat out forgets the lyrics to the songs she’s written on stage. From what I can tell her body is her main selling point, which isn’t a criticism. She clearly did something right because she’s world renown. Personally I’d prefer talent over image but that’s just me. Kinney relies on her talent with her attractiveness. Kinney’s music lyrics seem much more poignant. When you hear lines such as this pish from Nicki Menaj.  It really makes you appreciate more meaningful and thought provoking lyrics.  Nicki Minaj is rapping about getting piped while Emily Kinney is singing about wishing for an idylic relationship but being confronted by the harsh realities of life. If you ask me I’d say Kinney’s lyrics resonate a bit deeper and are easier to relate to. I will say that I find some of her songs overly effeminate\\lovesick but that is far more superior to the garbage I’ve heard about screwing hookers and snorting coke. Unlike some artists, Kinney hasn’t disfigured her body or inked 99% of herself which seems to be a popular trend. I can’t understand the appeal of body self destruction and it seems highly questionable.  I personally have a difficult time respecting anyone who clearly has little no care for their long term personal appearance. Again my argument of talent versus physical appeal comes into play. Having garish hair or incomprehensible tattoos on unconventional body location seems to be just a plea for attention, like a toddler demanding his parents look at him. Kinney stands on her own with simple yet effective body appeal and an equally impressive voice.  To each their own I suppose. ",
            "date": "Answered September 2, 2020",
            "views": "186",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Teghbir Sandhu",
                "href": "/profile/Teghbir-Sandhu"
            },
            "answer_text": "Jack Johnson   The first line in his wikipedia page sums him up : 'Hawaiian-born folk rock singer-songwriter, surfer, filmmaker, musician known for his work in the soft rock and acoustic genres'. To cover so many genres producing strings of hit singles along the way and still remaining underrated is a mystery to me. Jack Johnson started as a Hawaii-based surfer and filmmaker who picked up songwriting to provide music for his films. He began writing songs during his college years, having played the guitar since age fourteen. In general, Jack's music is laid-back, soothing, and fun to listen to. This style of music is a very diverse, entertaining and beloved sub-genre of music, and definitely warrants further study. Performance is the area in which Jack Johnson’s true skill shines through most clearly.  He is one of very few artists who sounds better live than on recording; his voice and performance are flawless the entire time. As the headlining act in the show, he typically plays a set that lasts anywhere from an hour and a half to two hours.  The songs are played from memory without any sheet music, which is an impressive feat considering that he has a backlog of over a hundred songs to remember.  He has obviously had many years of vocal and guitar lessons and practices regularly, as it is a rare occurrence for him to miss a single note in the entire set. He demonstrates his skill and mastery of his instruments mainly through his flawless performance rather than through solos, which are utilized by some of his peers such as John Mayer.  He is a wonderful human being, married to his college sweetheart, totally shuns limelight( which may have a hand in his relative obscurity), and runs a charity called Johnson Ohana Charitable Foundation, a non-profit  supporting environmental, art, and music education worldwide.  Trust me, this man is a genius and you would definitely thank me while searching him on youtube. Below are two songs of Jack's that I personally like the most. If I had eyes :  Times Like these :  Enjoy :) ",
            "date": "Answered July 4, 2013",
            "views": "33",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nirupama Singh",
                    "user_href": "/profile/Nirupama-Singh-25"
                },
                {
                    "user_id": "Aditi Paul",
                    "user_href": "/profile/Aditi-Paul-25"
                },
                {
                    "user_id": "Israel James Cullett",
                    "user_href": "/profile/Israel-James-Cullett"
                },
                {
                    "user_id": "Jashmine Khora",
                    "user_href": "/profile/Jashmine-Khora"
                },
                {
                    "user_id": "Abdul Ahad M",
                    "user_href": "/profile/Abdul-Ahad-M-1"
                },
                {
                    "user_id": "Krishna Singh",
                    "user_href": "/profile/Krishna-Singh-132"
                },
                {
                    "user_id": "Hare Krsna",
                    "user_href": "/profile/Hare-Krsna-22"
                },
                {
                    "user_id": "Siddharth Ganguly",
                    "user_href": "/profile/Siddharth-Ganguly-3"
                },
                {
                    "user_id": "Pranav",
                    "user_href": "/profile/Pranav-199"
                }
            ]
        }
    ]
}