{
    "title": "Who made the first ever rock 'n' roll? - Quora",
    "tags": [
        "Records",
        "Music History",
        "Classic Rock Music",
        "Rock and Roll Music",
        "World Records",
        "Audio Recording",
        "Rock Music",
        "Music Industry",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rafael Cavacchini",
                "href": "/profile/Rafael-Cavacchini"
            },
            "answer_text": "Some people consider Bill Haley's Rock Around the Clock and the recording of Elvis Presley's That's Alright Mama to be the first two rock n’ roll songs ever recorded, in 1954. But, the truth is: It wasn't Bill Haley’s Rock Around The Clock. It wasn't Elvis That’s Alright Mama. And it didn't happen in 1954.  The truth is: neither Rock Around the Clock or That's Alright Mama can genuinely claim to be the first rock'n'roll record. They were simply the first white artists' interpretations of a sound already well-established by black musicians almost a decade before. It was a raucous, driving, unnamed variant of rhythm and blues that came complete with lyrics that talked about \"rocking\" - a term that previously had been used by gospel singers to denote spiritual rapture, but developed more earthy connotations in the postwar world. Considering this, the most widely held belief is that the first rock'n'roll single was 1951's Rocket 88, written by Ike Turner, sung by Jackie Brenston (the saxophone player from Turner's backing band The Kings of Rhythm), and recorded by Sam Phillips, who later went on to found Sun records and discover Elvis Presley.  And it’s wonderful. But can we go further back? Some people claim the title belongs to Rock and Roll, a particularly raucous R&B track recorded in 1948 by a Detroit boxer-turned-saxophonist called Wild Bill Moore.  We’re gonna rock, we’re gonna roll. But how and when Rock n’ Roll was officially recognized? Billboard started charting songs in 1940. By 1949, it was publishing charts in three categories: pop, country-and-Western, and (a new term, replacing “race music”) rhythm and blues. Every week, in each category, there were lists of the songs most frequently sold in record shops, most frequently requested in jukeboxes, and most frequently played by disk jockeys. (These rankings were all relative; actual sales figures were proprietary.) The charting system was predicated on a segregated market. How did Billboard know when a song was a rhythm-and-blues hit, and not a pop hit? Because its sales were reported by stores that catered to an African-American clientele. Rock and roll became possible when it started to dawn on people that not everyone buying R. & B. records or listening to R. & B. songs on the radio was African-American. In 1952, the year Phillips launched Sun, forty per cent of R. & B. record buyers at the Dolphin Record Store, in L.A., were white. The year before, a classical-music d.j. in Cleveland, Alan Freed, had been astonished to see white teenagers eagerly buying R. & B. records at a local record shop, and he started following his “quality music” program with a show devoted to R. & B.  Jim Jackson - Kansas City Blues. One of the first baby steps of Rock n’ Roll. 1927. Thus, Rock n’ Roll music was born long before it was officially recognized as a unique style of music. It was black music, which underwent many mutations over the years, until it was officially given a name.  1936: Feels So Good, by Hartman’s Heart Breakers. It wasn’t a music style made by blacks only anymore. But one can argue that this is country music, and not rock n’ roll. I’ll let you readers decide. ",
            "date": "Updated October 20, 2020",
            "views": "341",
            "upvotes": " View 338 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Paul Clifford",
                    "user_href": "/profile/Paul-Clifford-27"
                },
                {
                    "user_id": "Al Waldman",
                    "user_href": "/profile/Al-Waldman"
                },
                {
                    "user_id": "Lar Bjorum",
                    "user_href": "/profile/Lar-Bjorum"
                },
                {
                    "user_id": "C. Neal Rutledge",
                    "user_href": "/profile/C-Neal-Rutledge"
                },
                {
                    "user_id": "Jan Krusat",
                    "user_href": "/profile/Jan-Krusat"
                },
                {
                    "user_id": "Jeffrey Weaver",
                    "user_href": "/profile/Jeffrey-Weaver-5"
                },
                {
                    "user_id": "Will Seiler",
                    "user_href": "/profile/Will-Seiler"
                },
                {
                    "user_id": "Nick Mastro",
                    "user_href": "/profile/Nick-Mastro-8"
                },
                {
                    "user_id": "Jeffrey L Toomer",
                    "user_href": "/profile/Jeffrey-L-Toomer"
                },
                {
                    "user_id": "Frank Malitz",
                    "user_href": "/profile/Frank-Malitz-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ernie Black",
                "href": "/profile/Ernie-Black-3"
            },
            "answer_text": "Hello Rafael. I was about to answer by saying Rafael answered far more extensively than I could, when I noted that you also requested my answer. Really I think you hit the high notes and I would probably pick “Rocket 88” as the transition from r&b to r&r. Another early transitional artist was Big Mama Thornton was the first to record Leiber and Stoller's \"Hound Dog\", in 1952, which sold two million copies in 1953, and her own classic, “Ball and Chain\". Other contenders include Goree Carter's1949 song \"Rock Awhile\", Roy Brown's 1946 \"Good Rocking Tonight\", Sister Rosetta Tharpe's 1944 song \"Strange Things Happening Every Day\", and Illinois Jacquet's 1944 \"Blues, Part 2\". Both rhythm and blues and rock and roll share DNA with the 1940's jump blues which features a faster blues style. ",
            "date": "Answered October 13, 2020",
            "views": "94",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Karadjis",
                    "user_href": "/profile/Michael-Karadjis"
                },
                {
                    "user_id": "Bob Garey",
                    "user_href": "/profile/Bob-Garey-2"
                }
            ]
        }
    ]
}