{
    "title": "Who is the most protective member of BTS? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Neush Sharma",
                "href": "/profile/Neush-Sharma"
            },
            "answer_text": "In the light of certain recent events, I would say its Kim Taehyung. Here is why- Recently Bighit launched Weverse app, on which all bts memebers have individual accounts and are able to interact with armys directly. Some armys started posting unflattering images of bts. It was funny until it became to much. Only taehyung came forward and asked armys directly to not to post bad pictures of members. It was a J hope picture , and we all know how insecure he was about his looks. He took a stand for his member instead of ignoring and bearing.In the past aswell he appealed armys to love all 7 members repeatedly (and we can see fans generally skip him in fan meets)He is the biggest OT7 I have ever seen and ignores and addresses the negativity directly. He is not scared of being himself anymore and not that people pleasing kid who would act goofy for fans just like jin.But this doesn't mean other members are not protective of each other. Jimin is always the first one to be there when a memeber is hurt. Jungkook literally became Taehyung’s bodyguard on airport to protect him. Jin makes joonie and yoonie feel calm and also personally cares for jungkook. And hoseok is literally the designated strict caretaker. And all of them collectively raised jungkook like his parents and brothers.These 7 dorks are each others family and cares alot for each other.My answer is totally based on their persona and whatever I see onscreen. I wouldn't know how are they behind the cams though.",
            "date": "Answered August 16, 2019",
            "views": "667",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lavender Lilac",
                    "user_href": "/profile/Lavender-Lilac-2"
                },
                {
                    "user_id": "WL Lim",
                    "user_href": "/profile/WL-Lim-4"
                },
                {
                    "user_id": "Mingyun Seo-Bang",
                    "user_href": "/profile/Mingyun-Seo-Bang"
                },
                {
                    "user_id": "Nessy Tungpalan",
                    "user_href": "/profile/Nessy-Tungpalan"
                },
                {
                    "user_id": "Wendy Espinoza",
                    "user_href": "/profile/Wendy-Espinoza-28"
                }
            ]
        }
    ]
}