{
    "title": "Who was the earliest known composer? - Quora",
    "tags": [
        "Music History",
        "Composers",
        "Music Composition"
    ],
    "response": [
        {
            "author_info": {
                "name": "David A. Lee",
                "href": "/profile/David-A-Lee-2"
            },
            "answer_text": "Her name was Enheduanna, a high priestess who lived in the city-state of Ur during the 23rd century BCE.  Although in modern history we tend to think of great figures as specialists in one particular area, history remembers Enheduanna not simply for her musical compositions, but also for her work as a composer of words and reputation amongst her Sumerian contemporaries as a respected political and divine authority. You can read translations of Enheduanna's hymns through the Electronic Text Corpus of Sumerian Literature at the University of Oxford. Typically, these texts would be accompanied by a string instrument to music that Enheduanna was likely to have composed and written down on clay tablets (implying that the Sumerians would indeed have had a musical notation system within their Cuneiform script). Ancient Songs of Enheduanna  I am not sure how faithful a modern reproduction of this music could even be (that is, if there is one). But as a side note, the fact that these works were composed thousands of years before the Seikilos epitaph is really such a fascinating thought:  The Seikilos epitaph, believed to have been composed in the 1st century AD, is known for being the earliest complete music composition we know of today. If you have ever played the computer game Civilization V, you will recognize this as the peace theme when engaging in diplomacy with Alexander the Great.  ",
            "date": "Answered January 26, 2016",
            "views": "28",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mina Yannaki",
                    "user_href": "/profile/Mina-Yannaki"
                },
                {
                    "user_id": "Cayden Taylor",
                    "user_href": "/profile/Cayden-Taylor-7"
                },
                {
                    "user_id": "Santiago Villegas-Ceballos",
                    "user_href": "/profile/Santiago-Villegas-Ceballos"
                },
                {
                    "user_id": "Andrew Bromage",
                    "user_href": "/profile/Andrew-Bromage"
                },
                {
                    "user_id": "Alexander Rose",
                    "user_href": "/profile/Alexander-Rose-6"
                },
                {
                    "user_id": "Adam Gerow",
                    "user_href": "/profile/Adam-Gerow"
                },
                {
                    "user_id": "Wade Spencer",
                    "user_href": "/profile/Wade-Spencer"
                },
                {
                    "user_id": "Mike Walker",
                    "user_href": "/profile/Mike-Walker-101"
                },
                {
                    "user_id": "Sam Mayerhofer",
                    "user_href": "/profile/Sam-Mayerhofer"
                },
                {
                    "user_id": "Alex Johnston",
                    "user_href": "/profile/Alex-Johnston-39"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joe Anslevich",
                "href": "/profile/Joe-Anslevich"
            },
            "answer_text": "The earliest composer for whom we have both a name and surviving compositions is … probably … Hildegard of Bingen. She lived in the 12th century in what is now Germany. There’s a lot of information about her on the internet and you can also hear her music. She’s probably the first “composer” in the modern sense of the word whose music we can actually get at, hear, think about, enjoy. There are other composers we know of, a lot earlier than that - but we don’t really know what the music sounded like. ",
            "date": "Answered January 2, 2020",
            "views": "269",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joseph Ingram",
                    "user_href": "/profile/Joseph-Ingram-11"
                },
                {
                    "user_id": "Mina Yannaki",
                    "user_href": "/profile/Mina-Yannaki"
                },
                {
                    "user_id": "Elspeth Cowie",
                    "user_href": "/profile/Elspeth-Cowie"
                },
                {
                    "user_id": "Gill Bullen",
                    "user_href": "/profile/Gill-Bullen"
                }
            ]
        }
    ]
}