{
    "title": "Who are the best EDM artists? - Quora",
    "tags": [
        "Techno Music",
        "Dance Music",
        "Electronic Dance Music",
        "Electronic Music",
        "Music Production",
        "Music Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Eisenmack",
                "href": "/profile/Chris-Eisenmack"
            },
            "answer_text": "Best in what way? It's impossible to decide by talent. But by popularity, maybe Martin Garrix or Skrillex. Historically, deadmau5 is the “founder” of modern EDM (according to the media) but he's not current as of now. His music is not appealing to me either. I wouldn't regard him as the founder since it wouldn't be right to put an artist of a certain EDM style as the founder of EDM in general. Each EDM artist has their own style. There are sub-genres and fusion genres. It's not fair to say that the popularizers of each sub-genre are the founders of EDM. IMO, Tiesto, deadmau5, Skrillex, Daft Punk, Swedish House Mafia, Armin van Buuren, etc, collectively started and developed the dance music scene we have today. The flag is now passed on to younger artists like Martin Garrix, Flume, artists of trap (Getter, Jauz, Valentino), future bass (Marshmello, San Holo, Flux), deep house (Lost Freq, Petit Biscuit, Alex Schulz), tropical house (Kygo, Matoma, Thomas Jack), and many others. The ones I named are my favorites, however, new artists come up everyday from all around the world so there's never going be a fixed list of the greatest EDM artists of all-time. Even if someone does come up with such list, it wouldn't be legitimate or credible and no one would take it seriously. Even if important people in EDM collaborate to curate an accurate list, it wouldn't be the ultimate. For me — Martin Garrix is the most popular. Alex Schulz is the most talented. Tiesto is the most historic. Marshmello is the most current. Overall, I'd choose Tiesto because he's a legend. ",
            "date": "Answered October 6, 2017",
            "views": "65",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Wan Yuopth",
                    "user_href": "/profile/Wan-Yuopth"
                },
                {
                    "user_id": "Mats",
                    "user_href": "/profile/Mats-12"
                },
                {
                    "user_id": "Rumrada Mint",
                    "user_href": "/profile/Rumrada-Mint"
                },
                {
                    "user_id": "Shreya Agrawal",
                    "user_href": "/profile/Shreya-Agrawal-131"
                },
                {
                    "user_id": "Haik Safaryan",
                    "user_href": "/profile/Haik-Safaryan"
                },
                {
                    "user_id": "Praveen",
                    "user_href": "/profile/Praveen-637"
                },
                {
                    "user_id": "Neo Recurdz",
                    "user_href": "/profile/Neo-Recurdz"
                },
                {
                    "user_id": "Beasley Andrea Lynne",
                    "user_href": "/profile/Beasley-Andrea-Lynne"
                },
                {
                    "user_id": "Tanishque Kumar",
                    "user_href": "/profile/Tanishque-Kumar"
                },
                {
                    "user_id": "Theodore Kim",
                    "user_href": "/profile/Theodore-Kim-24"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wayne Smith",
                "href": "/profile/Wayne-Smith-109"
            },
            "answer_text": "Such a hard question to answer as how does one measure “best” when it comes to something as subjective as music. Also if your referring to the more pop based music that the term edm has come to represent I'm not qualified to answer cause I don't like that “genre” at all. If your question is about the entire set of genres and sub-genres: house, techno, trance, drum and bass, etc. one name consistently comes to mind Carl Cox. My reasons are as an artist I've seen him do things other artist just can't do. I've seen him at lease 10+ in several different settings: 4 hour club set, dirty warehouse rave, main festival stage, side stage, hosted stage, and he's consistently delivered amazing sets that have me dancing nonstop. I've never heard him repeat a set even though I've seen him 2 days in a row several times. He has fans that range from young to old (there very few 60 year old Hardwell fans). He's been at the top of his game for 25 years and has not taken a step backwards (Paul Oakenfold anyone). Close second would probably be Armin Van Buuren. Anyway just my 10 cents. ",
            "date": "Answered December 19, 2016",
            "views": "35",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Roy Arogyasami",
                    "user_href": "/profile/Roy-Arogyasami"
                },
                {
                    "user_id": "Dustin Eimer",
                    "user_href": "/profile/Dustin-Eimer"
                },
                {
                    "user_id": "Sidharth Dewan",
                    "user_href": "/profile/Sidharth-Dewan-3"
                },
                {
                    "user_id": "Santiago Hoffman",
                    "user_href": "/profile/Santiago-Hoffman-1"
                }
            ]
        }
    ]
}