{
    "title": "Who was a more skilled general, Julius Caesar or Napoleon? - Quora",
    "tags": [
        "Julius Caesar (historical figure)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kyle Smith-Laird",
                "href": "/profile/Kyle-Smith-Laird"
            },
            "answer_text": "While it’s hard to compare the two since they come from different time periods with different tactics, my vote is for Caesar. True, Napoleon was an incredibly skilled general during a time when warfare was becoming more modern, which demonstrated his ability to adapt. Like Caesar, he was a bit of an outsider as he hailed from Corsica, not France. Caesar, the son of an impoverished aristocratic family, grew up in the Subura, or ghetto of Rome. They both accomplished many amazing feats in battle (Austerlitz for Napoleon; Alesia for Caesar) that are still studied today. They both seized the opportunity to take control of their respective governments using the army as leverage. Caesar, however, never lost a battle (some may argue that he lost at Gergovia, or that he was assassinated), nor was he captured by the enemy (he had been kidnapped by pirates as a young man, but he wasn’t at the head of an army at the time, but after his release, he rounded up a platoon of soldiers and killed all his former captors mercilessly). Napoleon’s Waterloo will forever be a source of infamy attached to the memory of France’s former emperor, whereas Caesar was killed by political opponents. I would also add that in sheer numbers, Caesar won far more battles than Napoleon. Feel free to leave your comments about why I’m wrong in the comments box. Hope you found my arguments cogent and interesting. ",
            "date": "Answered March 12, 2018",
            "views": "21",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Angus Stead",
                    "user_href": "/profile/Angus-Stead-1"
                },
                {
                    "user_id": "Warren Kings",
                    "user_href": "/profile/Warren-Kings-3"
                },
                {
                    "user_id": "Doug Duggerson",
                    "user_href": "/profile/Doug-Duggerson"
                },
                {
                    "user_id": "Ed Caruthers",
                    "user_href": "/profile/Ed-Caruthers"
                },
                {
                    "user_id": "Justin L P Lowans",
                    "user_href": "/profile/Justin-L-P-Lowans"
                },
                {
                    "user_id": "Thekra Alali",
                    "user_href": "/profile/Thekra-Alali"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gawaine Ross",
                "href": "/profile/Gawaine-Ross-1"
            },
            "answer_text": "As Kyle says it’s difficult to compare them. Both men were quick on their feet and knew how to inspire troops. Caesar was more of a populist, but I do think they would have admired each other had they met. It’s been said that amateurs talk tactics, whereas professionals talk logistics. In that regard Caesar was more realistic than Napoleon, who didn’t mind feeding his army on the stores of the peasants whose lands he tramped through. It’s cheaper to steal (ahem, requisition) food and supplies from locals, but when your opponent is willing to burn all his crops to prevent you from getting them, you’re in trouble. That’s exactly what Napoleon ran into in Russia. Caesar didn’t have that degree of hubris, partly because he was restrained by the Senate, but also because Roman armies brought their supplies with them. ",
            "date": "Answered March 27, 2020",
            "views": "506",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Angus Stead",
                    "user_href": "/profile/Angus-Stead-1"
                }
            ]
        }
    ]
}