{
    "title": "Who is the most underrated band of all time? - Quora",
    "tags": [
        "Bands (music)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mauricio-José Schwarz",
                "href": "/profile/Mauricio-José-Schwarz"
            },
            "answer_text": "I would definitely say Oysterband. 40 years going strong, more than 20 albums (the last one from 2014), amazing lyrics, pertinent melodies, strong vocal harmonies, great musical lineup and three members that have been there all along. It is really sad to see all that creativity, all that punch onstage, all that joy in making relevant music, all that much-missed-most-of-the-time brutal sincerity being missed by the mainstream musical scene.  An amazing example is their \"Oxford Girl\", a reelaboration of the most famous murder ballad in Great Britain (the killing of a young woman by her man for being pregnant) hailing from the 17th century. Oysterband turns the story on its head so it is her who tells her story: she says: I never had a chanceto prove them wrong my time was short, the story long no I never had a chance to prove them wrong it's always them that write the song  Oysterband is much more than electric folk or punk folk. The band has spanned everything from traditional music to audacious compositions, political statements, social statements and wonderful ballads of love and friendship, and has earned recognition as Best Band in the BBC Radio 2 Folk Awards in 2012, but it has mostly made its career playing small venues and festivals, surviving many other bands that were created more or less at the same time (including the amazing Chumbawamba, who would be my second choice as most underrated band), and remaining as the best in the genre along its only real competitor, Steeleye Span, but with an acid, rebellious edge that Steeleye lacks (not that they need it, their style is solid and 47 years of music attest to it).  I haven't prayed since God knows whenmy teeth are un-Americansocialism's orphan childunimpressed, unreconciledsome people think I'm crazy but I'm nothere comes the flood  The band has also one of the finest fishermen's songs, \"The Story\", plus a number of anthems for their (our) generation. The last one I will impose on you is the eerie \"Walking Down the Road With You\": you wrestle with your conscience because you think it's realit's my dreams that lead you on, my schemes that turn the wheelyou cannot change direction, it's bred into your bonewherever you are going, well you'll never walk alone 'cause I, oh I, oh I, I am the ghost of things to comeand I'm walking down the road with youwalking down the road with you  ",
            "date": "Updated March 6, 2016",
            "views": "25",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jessica Pin",
                    "user_href": "/profile/Jessica-Pin-2"
                },
                {
                    "user_id": "Tim Keeley",
                    "user_href": "/profile/Tim-Keeley-3"
                },
                {
                    "user_id": "David Durham",
                    "user_href": "/profile/David-Durham"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mert-Han Harry",
                "href": "/profile/Mert-Han-Harry"
            },
            "answer_text": "In my opinion, I think the most underrated band has to be Yellow Magic Orchestra. You’ve probably heard Kraftwerk get thrown around a lot in discussions of important bands, but it’s less likely you’ve heard of YMO- yet it was YMO who really changed electronic music. It’s strange really. I’ve heard them cited as the equivalent of The Beatles in Japan many, many times, yet I hear almost nothing about them other than the articles I’ve read. And it’s not like their success was limited to Japan either- their song Computer Games made it to 17 on the UK Singles Chart in 1980. And yet, as of writing this, they only have just over 100,000 listeners on Spotify- impressive, to be sure, but not nearly as much as they deserve- especially so when you consider the fact that Spotify is popular in Japan as well. Their concerts in Japan, from what I’ve seen were very popular- but it’s a shame that they aren’t remembered so well overseas.  Image source: FACT Magazine It’s easy to fall into the trap of viewing early electronic music as primitive- composers at the time didn’t have the type of software or range of technology we have available now, after all. But really, it was anything but. If I had to compare them, I’d say that YMO’s impact was perhaps on par with that of Kraftwerk- they had a large influence, and it’s sad they aren’t as remembered.  Hailing from Japan, all three members of YMO were seasoned members of the industry. Haroumi Hosono, Ryuichi Sakamoto and Yukihiro Takashi had all played with each other before, appearing on Hosono’s album Paraiso as the ‘Yellow Magic Band’. It was in 1978 they came together under the name Yellow Magic Orchestra. The funny thing is, they only ever planned on releasing one album, with the main aim of their music to riff off the West’s version of Asian music (think Les Baxter and Martin Denny). \"The thing was to take these western ideas of the exotic, but to subvert them. With Martin Denny, the exotica is kind of fake. But I am real! I am the target of that western exotica. So what I wanted to make was exotica from an oriental perspective.\" -Haroumi Hosono Yellow Magic Orchestra combined the exotica of Hosono’s earlier works with the sound of arcades and electronics- things Hosono were fascinated by (Hosono later went on to record an entire album centred on video game themes by himself). This influence can best be heard in their song Computer Games/ Firecracker, which starts of with a series of blips, sound effects and quirky motifs before fleshing itself out into a lush and lighthearted take on Martin Denny’s song of the same name. One of the most interesting things about YMO was the creative ways in which they used the technology they had available. Take, for example, the Roland MC-8. A technological marvel at the time, it was the first sequencer (a machine that stores notes) to contain a microprocessor, meaning it was able to store 5200 notes. It had a simple calculator-like interface and relied on a series of numerical inputs which told it when to play certain notes.  Image source: Wikipedia What YMO realised was that if they entered a number that was slightly lower or higher than the value of a ‘normal’ note, they were able to create swing. It is worth noting this fact in itself did not solidify YMO as the greatest band of all time. Yet it was YMO’s subtle yet constant pushing of boundaries that helped propel the genre forward. Another example would be how they blended drum machines with live drumming, or their use of the famous Roland 808, or simply there integration of arcade sound effects into their music. YMO’s largest selling album, Solid State Survivor, sold more units than any other record in Japan in 1980. Their 1981 album, BGM, crafted large soundscapes from the sawtooth sounds that influenced The Human League and Eurythmics. Technodelic, released in the same year, contains a lot of the basic elements that would later make up the wildly popular house genre. YMO were, simply, ahead of their time.  All three members have gone on to have successful careers, not least of which Sakamoto, who has done the soundtracks for many famous movies, such as The Revenant or The Last Emperor. Hosono has made and collaborated on a fair few popular Japanese albums, as has Takashi. If only their earlier work together was more widely recognised. ",
            "date": "Answered December 15, 2019",
            "views": "16",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Josh Shuman",
                    "user_href": "/profile/Josh-Shuman"
                },
                {
                    "user_id": "Leonard Parker",
                    "user_href": "/profile/Leonard-Parker-13"
                },
                {
                    "user_id": "Tanisha Joshi",
                    "user_href": "/profile/Tanisha-Joshi-15"
                }
            ]
        }
    ]
}