{
    "title": "Who is a better singer, Amy Winehouse or Whitney Houston? - Quora",
    "tags": [
        "American Musicians",
        "Marvin Gaye",
        "Amy Winehouse (musician)",
        "Whitney Houston (musician)",
        "Soul Music",
        "Singers",
        "Singing",
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Malayang",
                "href": "/profile/James-Malayang"
            },
            "answer_text": "By almost every measure, it’s Whitney Houston, hands down. Her range, power, and ability to interpret lyrics was superlative. She could be a pop diva, an R&B chanteuse, or a sweaty gospel shouter (my favorite). Although Houston died much to soon, she left an impressive body of work, number one hits, and several Grammy awards. Amy Winehouse was a special, special talent. She was different in many ways from her peers and her style was unique. But as she was just starting her career, we don’t have evidence that she was going to build upon her style. So as a singer, there is an insufficient body of work. But judging by their output, it’s Whitney. ",
            "date": "Answered November 25, 2019",
            "views": "136",
            "upvotes": " Answer requested by Daniel Noor"
        },
        {
            "author_info": {
                "name": "Ralph Huisman",
                "href": "/profile/Ralph-Huisman-1"
            },
            "answer_text": "I won't make this a lengthy answer- Whitney Houston is the better vocalist by a country mile. Her vocal range was immense, she delivered her songs with clarity and precision, and she was a consulate performer. On the other hand, Amy had undeniable talent, but her range was limited, her delivery was haphazard, and her professional manner was awkward and disturbed. Line the two of them up on a stage, give them each a microphone, and draw your own conclusions. Although I liked them both, Whitney was obviously the better singer of the two. ",
            "date": "Answered November 25, 2019",
            "views": "97",
            "upvotes": " Answer requested by Daniel Noor"
        }
    ]
}