{
    "title": "Who has the worst lyrics in K-Pop: BLACKPINK or EXO? - Quora",
    "tags": [
        "EXO (K-pop group)",
        "BLACKPINK",
        "Song Lyrics",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mariam Khaled",
                "href": "/profile/Mariam-Khaled-89"
            },
            "answer_text": "The worst lyrics? Well, every group have shitty and deep lyrics, no group have a perfect discography with no cringy lyrics, Blackpink and EXO are not an exception. Blackpink have great lyrics like you never know, stay, lovesick girls, kill this love, playing with fire, and maybe other songs, I am not a fan of them. For EXO, they have a diverse discography when it comes to lyrics actually but people like to judge before even listening to their songs or whatever, they have a song like Mama that talk about how society turned to a robotic system, and how people are hating on eachother to the point that they forgot what love is, that was their debut song. They have a song like miracles in December that explains the regret of a person after their beloved ones are gone, and how they wish for a miracle to happen and the person will be alive again so they can treat them better. The universe album has really deep lyrics, all the tracks are really good especially lights out. They have a song like can't bring me down that talks about how people hate on a person even though we are all the same, and sometimes the person you hate on can be really higher than you, and at the end, you will be left with the ashes of your hate and nothing more. Smile on my face talks about how it's better to leave when the person you love lost interest in you but can't tell you so you just left without asking in order to to save everyone the hurt but even you decided to leave you still have hopes that they will ask you to stay but this never happened so you will just walk with a smile on your face. Power talks about how we should enjoy our lives and know that the power in us to do anything. Eldorado talk about their journey in chasing their dreams and they will never stop till they get it. Oasis have the same vibes as Eldorado with more mature vibes, the song explain that the journey of success is like a thirsty person who is lost in the desert and trying to find an oasis but there is fear that the oasis could be an illusion at times. What if talks about how we don't know the value of our loved ones except when they leave and find their happiness with other people. Promise is really beautiful song, they gave it to their fans to apologize for the leaving of the three members with the promise that no matter what they will perform and stay together no matter what. These were really samples of their deep songs they have alot other than that but I don't want to make the answer longer than that, just don't judge a group discography if you didn't listen to it and stop listening to stupid people who just shit on other groups to make their favourites look better and yes, just because the song talks about love or relationship doesn't mean that it's not deep, the same with the songs that don't talk about love, alot of them aren't deep and pretty shallow but we like to act like we know better, there are songs that talks about love and really touching more than alot of songs that don't talk about love take an example of Fine by Taeyeon, tell me that you weren't moved by the song or a song like eyes, nose, lips by Taeyang or missing you by BTOB or universe by EXO or one of these nights by red velvet, and alot more, and not all people need songs about self love or depression and so on, alot of people don't like listening to these type of songs like there are people who don't like listening to love songs, overall both groups have good lyrics but since I don't really give blackpink that much attention I didn't talk much about them. ",
            "date": "Answered October 8, 2020",
            "views": "497",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Desya Syasha",
                    "user_href": "/profile/Desya-Syasha"
                },
                {
                    "user_id": "Hayden Trill",
                    "user_href": "/profile/Hayden-Trill"
                },
                {
                    "user_id": "Haidy Haidy",
                    "user_href": "/profile/Haidy-Haidy"
                },
                {
                    "user_id": "Redd Belbet",
                    "user_href": "/profile/Redd-Belbet"
                },
                {
                    "user_id": "Kim Asuncion",
                    "user_href": "/profile/Kim-Asuncion-6"
                },
                {
                    "user_id": "Ari Wakes",
                    "user_href": "/profile/Ari-Wakes"
                },
                {
                    "user_id": "Aliyah Lee",
                    "user_href": "/profile/Aliyah-Lee-17"
                },
                {
                    "user_id": "Anamaria Borlan",
                    "user_href": "/profile/Anamaria-Borlan"
                },
                {
                    "user_id": "Kim Yuki",
                    "user_href": "/profile/Kim-Yuki-9"
                },
                {
                    "user_id": "Isabella Pierce",
                    "user_href": "/profile/Isabella-Pierce-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "A. Malaluan",
                "href": "/profile/A-Malaluan"
            },
            "answer_text": "Between the two? I’d go for BlackPink. Not sure why a lot of BlackPinks songs have gibberish lyrics, but I sure got fed up with “click clack bada bim bada boom” lyrics. One or two songs, sure. But to have a lot of songs with lyrics that seem like fillers to me, it can get a bit annoying. Boombayah: “Click clack bada bim bada boom” HYLT: “How you like that, that that that, that, dararatdat” Kill This Love: “Rum pa pam pa pam” DDDD: “Hit you with that ddu-du-ddu-du” It’s just the lyrics for those songs that I’m not satisfied with. I don’t mind the melody, tho, they’re pretty catchy and danceable. I’d still go back to As If It’s Your Last and Playing With Fire; from then till now, those two will be my favorites. ",
            "date": "Answered October 10, 2020",
            "views": "316",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nia",
                    "user_href": "/profile/Nia-573"
                },
                {
                    "user_id": "Haidy Haidy",
                    "user_href": "/profile/Haidy-Haidy"
                },
                {
                    "user_id": "Liudvikas Parker-Jones",
                    "user_href": "/profile/Liudvikas-Parker-Jones"
                }
            ]
        }
    ]
}