{
    "title": "Who is Chester Bennington? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Atul Kumar",
                "href": "/profile/Atul-Kumar-328"
            },
            "answer_text": "Who ever asked this question must be living under an rock or else might be from generation of edm and trance music . Chester charles bennington was the lead singer of linkin park . But besides that ,he was more than an lead singer of an international band , to many people he was an voice who expressed their feelings and also give them relief in there hardest time (I’m sure today’s musicians do that as well) . To me his songs was inspiration to me whenever i felt low , he was that voice that kept telling me to never give up and keep on going.Today’s generation might not understand this but he was more than just a vocalist of an band he was great human being and real good person who connected with his fans ad like all the great things must come to an end his end came but he still live in his fan’s heart . So who is Chester charles bennington ? i guess you got my answer Regards, Atul kumar singh hth another Linkin park fan ",
            "date": "Answered November 13, 2017",
            "views": "314",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ivy Cervesa",
                    "user_href": "/profile/Ivy-Cervesa"
                },
                {
                    "user_id": "Afk Afk",
                    "user_href": "/profile/Afk-Afk-10"
                },
                {
                    "user_id": "Sonam Mishra",
                    "user_href": "/profile/Sonam-Mishra-29"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gurmeet Kaur",
                "href": "/profile/Gurmeet-Kaur-245"
            },
            "answer_text": "Chester Charles Bennington was an American singer and songwriter best known as the front man for the rock band Lin kin Park. He was also the lead singer for Dead by Sunrise and fronted Stone Temple Pilots from 2013 to 2015. His voice carried the angst, rage and sorrow of Linkin Park's music .Some of his best performance can be observed in : One Step CloserA Place for My HeadNumbGiven UpBreaking the HabitHe committed the suicide today and my dream of listening him live also died today. Source : Chester Bennington: five of his best Linkin Park performances Chester Bennington: five of his best Linkin Park performances Chester Bennington - Wikipedia ",
            "date": "Answered July 21, 2017",
            "views": "485",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Denise Denise",
                    "user_href": "/profile/Denise-Denise-64"
                },
                {
                    "user_id": "Kartikey Rai",
                    "user_href": "/profile/Kartikey-Rai-4"
                },
                {
                    "user_id": "Nikhil Anil",
                    "user_href": "/profile/Nikhil-Anil-6"
                }
            ]
        }
    ]
}