{
    "title": "Who are the biggest jerks in music? - Quora",
    "tags": [
        "Jerks",
        "Contemptible People",
        "Celebrity and Music",
        "Bands (music)",
        "Music Industry",
        "Entertainment",
        "Musicians",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eric Stallard",
                "href": "/profile/Eric-Stallard"
            },
            "answer_text": "Here’s the biggest thing about the musicians: The fans see one side, the folks behind the scene see another. I’ve worked with a large amphitheater in southern AZ for over a decade and have seen a large number of acts come through the venue. Country, metal, RB, hip hop, soul, classic rock, alt rock, pop, Tejano/Norteno, Mexican superstars and the list goes on. A good number of the talent don’t/won’t interact with anybody at all, without their manager. Most hide in their bus or the dressing room, come out to do their sound check and then hide again. They tend to be a lot of the problem children in one way or another. Cindy Lauper stopped her sound check and screamed at us to “Get the fuck out of here!” while we were setting up the cameras, projectors, cables, etc. We weren’t making noise, we weren’t being distracting, but still. We dropped everything and went inside. Rihanna wanted Popeye’s chicken and there was only one in the city at the time, which was all the way across town. A driver had to go all the way over there (45 minute or so drive each way), get about $200 worth of food and bring it back. When it got here, she threw it against the wall of the dressing room and screamed at anyone she could. Jenni Rivera (deceased Mexican singer) was scheduled to be the opener for a well respected, older, female Mexican singer. She refused to go out and demanded to be the headliner, then started to drink. The other lady had to rush her preparation, went on early (although 45 minutes after the show was supposed to start) and the crowd loved her for it. Jenni finally came on, sloppy drunk, couldn’t perform worth a damn and started talking about random men from the crowd and how big she thought their manhood was. Luis Miguel, mega Mexican star, HUGE diva. Backstage, nobody is allowed to look at him, you have to look at his feet. He has TVs all over the stage, to make sure none of the cameras got his bald spot (he’s since had it taken care of). When he leaves the facility, there are 4–5 identical vehicles that all leave in different directions, so nobody knows which he’s in (this is also so the cartels don’t know, since he pissed them off). Marilyn Manson insists that the entire dressing room is draped in black, doesn’t allow anyone outside of his management to talk to him and throws a fit if the camera isn’t on him at all times, while on stage (he spat on one of our cameramen for shooting a guitar solo). Many other stories like this. On the flip side, many of the acts are honestly thankful for what they get to do. Comedians seem to be on the high end of it. Cheech and Chong and Gabriel Iglesias will sit down in the green room and just chat with anyone around. Larry the Cable Guy as well. Alice Cooper always hangs out after the show and BS’s with fans, once his stage persona is washed off. I was talking with Ozomatli for a while backstage, thinking they were the roadies, because they never once had an air of superiority. Felt a little bad when they were called onstage, since the rule is we don’t talk to the talent, unless they talk to us first. Sugar Ray and many others enjoy what they do and you can genuinely see it with everyone they talk to. Vanilla Ice (VI) made a kids night on one of his times here. Boy with a cochlear implant, about 12 years old. VI had been walking back and forth behind the stage barrier, taking pictures, signing everything, hugs, etc for about 20 minutes after the show ended. Boy couldn’t get through the crowd to get his picture signed (I believe it was a print from VI in Teenage Mutant Ninja Turtles). VI had to get going, in order to clean up and head to the next city, so he left the stage. One of the stage crew was asked by the mother, if the boy’s picture could be taken back for a quick signature. Crew called back and was told to have the boy come back. They pulled him up onstage, took him back and he came out about 5 minutes later, with a signed picture and tears of joy. The mother then started to cry as well. Rick Springfield was notorious for being a jerk back in the day, but seems to have matured. ",
            "date": "Updated July 8, 2019",
            "views": "988",
            "upvotes": " View 595 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Thiwin (तिविन इम)",
                    "user_href": "/profile/Thiwin-तिविन-इम"
                },
                {
                    "user_id": "Stephanie McKenna",
                    "user_href": "/profile/Stephanie-McKenna-27"
                },
                {
                    "user_id": "Arnav Rathee",
                    "user_href": "/profile/Arnav-Rathee"
                },
                {
                    "user_id": "Kevin Fong",
                    "user_href": "/profile/Kevin-Fong-40"
                },
                {
                    "user_id": "Jen Diaz",
                    "user_href": "/profile/Jen-Diaz-4"
                },
                {
                    "user_id": "Cassandra Moodie",
                    "user_href": "/profile/Cassandra-Moodie"
                },
                {
                    "user_id": "Terry Cantrell",
                    "user_href": "/profile/Terry-Cantrell-2"
                },
                {
                    "user_id": "Kaylee Becker",
                    "user_href": "/profile/Kaylee-Becker-11"
                },
                {
                    "user_id": "Bruce Bryan",
                    "user_href": "/profile/Bruce-Bryan-9"
                },
                {
                    "user_id": "LC ThatsMe",
                    "user_href": "/profile/LC-ThatsMe"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Fuchs",
                "href": "/profile/Jon-Fuchs-2"
            },
            "answer_text": "Easy, Bob Dylan. There are a number of performers I’ve seen in person on numerous occasions that I would consider jerks, but Bob tops the list by a landslide. There have always been little indications that Bob is kind of a jerk, but nothing like his 2017 concert at Lakeview Ampitheater in Syracuse, NY. The little stuff that lends to his being a jerk is just that, little stuff. Like the fact that he never addresses the crowd, not once… EVER. You’ll never hear him say, “Good evening (enter town here), thanks for coming out to enjoy this beautiful evening” or “I know you could have been anywhere else tonight, so thanks for spending it with me”. No, nothing close to that will ever be uttered from his mouth. He’s too good to thank you, his ego much too large, he considers you lucky to be graced by his presence. There are a number of other little things that drive me nuts, but the big one I’m about to mention is why I wouldn't waste the time going to see a free Dylan concert. If there ever was such a thing… Syracuse 2017. First of all, ego boy couldn’t sell 3,000 tickets in a venue that holds 18,500. No exaggeration, there were 11 (eleven) people in the lawn section of the entire amphitheater (lawn holds 15,000), and only half the seats filled under the covered pavilion. It’s the emptiest I’ve ever seen it for anyone. Kidz bop sells more tickets. My wife and I were probably the youngest people there at 35 years old. Average age was probably 60–65. I’ve never seen so many wheel chairs or handicap seat positions being used at a concert, even a sold out one. Never seen so much gray hair at a concert. I’m not mentioning all the older people to be a jerk. I worked in nursing homes as a kid and love old people. I’m pointing it out because it’s part of the reason why I was so offended at what took place. Back track quickly to the entrance scene. As we approach the entrance, we see the normal “no cell phone photography, videos” notice posted at the checkpoint. This is pretty normal for almost all shows except the coolest performers who don’t care. Fast forward… Our seats are front row in the third section. Nice unobstructed view. 1 hour into the show, a large security guard comes to me and says, “My boss just told me to throw you out”. I’m literally dumbfounded. I’ve been to dozens if not hundreds of concerts and never been spoken to before. In shock, I ask, “Me? What did I do?”. He points down to my cellphone that is clipped onto my shorts. Now I’m a big guy, and if I left it on my hip I would have busted the holster when I sat down. Therefore I took it off my hip, sat down, and then clipped it to my shorts so the cell phone is in the belt holster clipped to my shorts, and sitting on top of my knee essentially, where it won’t get busted. I inform the guard that I haven’t looked at my phone once during the entire performance, whats the issue? He said, “It can’t be visible…” This guy being bigger than I, I quickly point out that I had to take it off so I didn’t bust it, etc.. He agrees that he has to do the same thing when he goes to concerts. As he’s telling me this, right in front of us I watch two guards escort out a grown man that would remind me of my harmless father (65 years old maybe, normal nice looking gentleman). They physically have him by the arms purshing him out while he is yelling, “Are you f*cking kidding me! this is bullshit” Apparently his cell was phone visible too. I look to the gray hair couple at my left, and I can see that both the man and woman (mid 60’s) are visibly shaken by the fact guards are man-handling grown adults as they kick them out of the concert. I look back at the guard and he tells me that although his boss told him to boot me, he told his boss that i hadn’t been warned yet, so if I behaved I could stay at that moment. I ask, “what am I supposed to do with my phone?” His answer, “Can’t be visible”. We put my phone in my wife’s purse. Apparently the sign meant to read, “No Cell Phones Allowed” Also, “No photography or videos”. Not, “No cell phone photography, videos”. Slight difference there. Moral of the story, we watched a couple other grown adults get man handled and thrown out before we along with half the extremely small audience got up and left the show early. The irony is what killed me. Here we are to see someone that was credited with playing a large part or at least being a social icon in the freedom movement of the 60’s and 70’s. He’s credited with helping spread the word of peace and the fight against oppression. Yet here he is enforcing gestapo like policing tactics on his peers, people my parents and grandparents age. And not kicking them out over taping or recording of the show, just owning a cell phone. Who doesn’t own a cell phone in the USA in 2017… I’ll never go see another Dylan concert. Couldn’t pay me enough. Is Bob Dylan onto something with his militant no-phones policy? - Golf Digest ____________________________________________________________________________________ UPDATE 4–18–2019 All I’ll say is, “Am I wrong?” Bob Dylan Is Not a Fan of You Taking His Photo Onstage “We can either play or pose,” he barked into the microphone according to multiple reports. “It’s your decision!” “The incident marked the first time that Dylan had spoken to the crowd in some time. Audiences used to only hear his speaking voice when he introduced the band, but he stopped doing even that about two years ago.” ",
            "date": "Updated April 18, 2019",
            "views": "1211",
            "upvotes": " View 727 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Stephanie McKenna",
                    "user_href": "/profile/Stephanie-McKenna-27"
                },
                {
                    "user_id": "Elaine McCarty",
                    "user_href": "/profile/Elaine-McCarty-7"
                },
                {
                    "user_id": "Kevin Fong",
                    "user_href": "/profile/Kevin-Fong-40"
                },
                {
                    "user_id": "Erin",
                    "user_href": "/profile/Erin-1036"
                },
                {
                    "user_id": "David Bradley",
                    "user_href": "/profile/David-Bradley-56"
                },
                {
                    "user_id": "Aahana Kulkarni",
                    "user_href": "/profile/Aahana-Kulkarni-2"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/BLACK-COTTON-Allen"
                },
                {
                    "user_id": "Matt Taylor",
                    "user_href": "/profile/Matt-Taylor-537"
                },
                {
                    "user_id": "D. Kip Trumpulis",
                    "user_href": "/profile/D-Kip-Trumpulis"
                },
                {
                    "user_id": "Jakob Terp",
                    "user_href": "/profile/Jakob-Terp"
                }
            ]
        }
    ]
}