{
    "title": "Who is your bias in BlackPink? - Quora",
    "tags": [
        "Media Bias",
        "BLACKPINK"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aspry Wright",
                "href": "/profile/Aspry-Wright"
            },
            "answer_text": "Who's the best member in Blackpink? I wouldn't say Jennie is the “best\" member because it's a group effort. They all contribute effectively. But she's easily the MVP.  She's had to deal with backlashes in the last 12 months that didn't have to happen. She was dating while working for a company with a dating ban. That's her fault. She was lazy onstage those times. That's her fault. But there were some questionable things that didn't add up and they weren't her fault.  While BP fans were thirsty as hell for another comeback, YG thought it would be a good idea to give Jennie a “Solo\" run instead. That shouldn't have happened. Jennie got dissed all over the internet for that. But don't forget that Lisa was also sent off on her own to do a reality show while fans continued to twiddle their thumbs, waiting for new group material. Nobody hated Lisa.  YG thought it was a good idea to profile Jennie as the fashionista with the hottest clothes and ad contracts. It made Jennie seem privileged and nobody liked that. So Jennie got dissed again. But let's not forget that G-Dragon enjoyed the same leisures for a decade and nobody hated him. In truth, YG is just a badly run company. But he's richer than me so whatever.  So…all that out of the way. Why do I say Jennie is the MVP? Because she's the strongest singer in the group. Her voice is powerful and inflective. Moreover, she's the strongest rapper. All of her beats hit, she sounds hard, she's got more swag than Lisa. Even though I prefer Lisa. Jennie speaks English. That's important for American promotions. She's valuable as hell right there because YG is hitting the U.S. hard with them. That's important when only two members are fluent. But Lisa speaks it okay enough.  “I speak a little bit English.” ~ Lisa And Jennie speaks great Korean. Even though Jisoo normally takes the lead in Korea, Jennie's very good in interviews while Lisa mostly clams up no matter what country they're in (except Thailand.) Jennie isn't the best dancer but she's very good. She's not the best looking but she's pretty. She's super short, but they hide it with fake height claims and give her high-rise shoes.  She's said to be aloof and rude, but I don't see it. In closing, I see Jennie as the MVP because of her commanding performing talents, she speaks English and she's proven to be incredibly marketable.  And she's YG's personal ace. She's preferred, simple as that. That also counts. Thanks for reading. ",
            "date": "Answered July 20, 2019",
            "views": "52",
            "upvotes": " View 104 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amina Niazi",
                    "user_href": "/profile/Amina-Niazi-2"
                },
                {
                    "user_id": "Kym Ladell",
                    "user_href": "/profile/Kym-Ladell"
                },
                {
                    "user_id": "Mahan Talai",
                    "user_href": "/profile/Mahan-Talai"
                },
                {
                    "user_id": "Chou Tzuyu¹²⁷",
                    "user_href": "/profile/Chou-Tzuyu¹²⁷"
                },
                {
                    "user_id": "Puja Singh",
                    "user_href": "/profile/Puja-Singh-1675"
                },
                {
                    "user_id": "Skylar Glen",
                    "user_href": "/profile/Skylar-Glen"
                },
                {
                    "user_id": "Aratrika Das",
                    "user_href": "/profile/Aratrika-Das-27"
                },
                {
                    "user_id": "Emily Maya",
                    "user_href": "/profile/Emily-Maya-9"
                },
                {
                    "user_id": "Ava Lily",
                    "user_href": "/profile/Ava-Lily-17"
                },
                {
                    "user_id": "Tanisha K",
                    "user_href": "/profile/Tanisha-K-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emily Maya",
                "href": "/profile/Emily-Maya-9"
            },
            "answer_text": "It’s really close to being Jennie but I thinks it’s the lead vocalist, the visual, the one and only  Kim jisoo!  I started stanning blackpink because I would hear about them a lot in school. I listened to kill this love and my jaw dropped at the “blackpink in your area”. I remember everyone on the internet saying that song was bad but it was easily my favorites song at the first 30 seconds of listening. I rewatched in 20 times. I thought Lisa was really cool and jisoo was really pretty. I also really like rosés scene in the car. I don’t remember what I thought of Jennie though. I decided to watch weekly idol. My bias was Lisa before knowing much about them. I only knew they were popular and I listened to one song. I just thought Lisa was really cool. Than when I watched them on weekly idol I was blown away by jisoo’s visuals and 4D personality. She seemed genuine, bright, bubbly, funny, and very social. I watched weekly idol, blackpink diary’s, and all shows blacklink were on. My bias was jisoo and my bias wrecker was Lisa. Than I started watching shows Jennie was on only and I fell in love with her. Now jisoo is my bias and Jennies my bias wrecker.  I love jisoo because of a few aspects. first, her visuals       She has the brightest eyes, her smile seems genuine and heart warming, she has perfect skin, she has perfect eyebrows, she has heart shaped lips, and so many other aspects that makes her Miss Korea. her beauty is simply undeniable. Everyone, even non blinks love her beauty. She’s not nicknamed miss Korea for nothing. Koreans love her and some argue she’s the most beautiful person in Korea. 2. Her personality Jisoo is known for having a 4D personality. A 4D personality is “A Korean slang used to describe someone who has a weird or unique personality. It's more of a compliment and isn't an insult. This can also be used for someone who has a strong personality and tends to think outside the box and tends to be creative (usually in a weird sort of way).” Jisoo definitely has a 4D personality. She’s always speaking in interviews, making friendly jokes, and smiling. She’s always known for balancing bottles on her shoulders which fits into the the “weird category”. 3. How she treats her members Jisoo said since she’s the oldest member she has to spread positivity and encouragement to the other members. Because of this she doesn’t cry I. Front of her members. Blackpink were on a live stream and Lisa said “I don’t think I’ve ever seen you cry, we lived together for 6 years” (talking to jisoo) rosé said “ah! That time when Jennie hurt her ankle on stage you cried. That was the only time you’ve cried” she only had cried when her member got hurt. That’s so sweet. We don’t deserve jisoo.  I have many other reasons but I’ll leave it at that. Jisoo is the sweetest thing ever. Stan Kim Jisoo 💖 ",
            "date": "Answered August 3, 2020",
            "views": "14",
            "upvotes": " View 37 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Novelyn Doldol",
                    "user_href": "/profile/Novelyn-Doldol"
                },
                {
                    "user_id": "Amanda Conneh",
                    "user_href": "/profile/Amanda-Conneh"
                },
                {
                    "user_id": "Nicole Emerson",
                    "user_href": "/profile/Nicole-Emerson-21"
                },
                {
                    "user_id": "Neelam Kumari",
                    "user_href": "/profile/Neelam-Kumari-685"
                },
                {
                    "user_id": "Ree",
                    "user_href": "/profile/Ree-244"
                },
                {
                    "user_id": "Maria Eduarda",
                    "user_href": "/profile/Maria-Eduarda-495"
                },
                {
                    "user_id": "Kpop Blink Army",
                    "user_href": "/profile/Kpop-Blink-Army"
                },
                {
                    "user_id": "Bby Sana",
                    "user_href": "/profile/Bby-Sana"
                },
                {
                    "user_id": "Lisa Karris",
                    "user_href": "/profile/Lisa-Karris"
                },
                {
                    "user_id": "Serena Ma",
                    "user_href": "/profile/Serena-Ma-25"
                }
            ]
        }
    ]
}