{
    "title": "Who are some guitarists that don't hold the pick in the traditional way? - Quora",
    "tags": [
        "Guitarists",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Diego Pujol",
                "href": "/profile/Diego-Pujol-1"
            },
            "answer_text": "I'm not 100 % certain, but I think Steve Morse (from the Dixie Dregs, Deep Purple, etc.) grabs the pick this way:  I took this picture from a Guitar World article that talks about his technique. The link is here: Cracking the Code with Troy Grady: Cracking the (Steve) Morse Arpeggio Code — Video  No need to state this, but he is one of the best alternate pickers in the world, so that obviously works for him. The way you described is useful for when you use your wrist to pick very fast. I actually, ever since I started playing guitar, used to grab the pick in a similar way than the one picture above, because that felt comfortable for me, and I also thought that was the way everybody did. But the only problem I had was that my thumb bends backwards, so it was difficult for me to play really fast. Then I learned the typical way in which shredders (fast, flashy players) or very technical guitarrists did it, and I started changing the way I grab the pick for when I have to play fast passages. If you're looking for the best way to grab the pick FOR YOU, I suggest you try as many as you can and decide which one is the most comfortable and the one that works for your particular anatomy. Everyone is different, and what works for Paul Gilbert or Yngwie Malmsteen might not work for you, because the size of your forearm, your wrist, your hand, or your fingers is probably different. The most important thing about technique is that it doesn't have to hurt you; it has to be the best possible way in which YOU can achieve what you want. You have to be comfortable. If it hurts you or bother you, you should stop doing it, because 1) you probably won't be able to play what you want, your arms and hands will get tired, and you're not gonna sound any good, and also 2) injuries do occur to musicians, and they are as painful and difficult as any. Also, for anyone who doesn't know who Steve Morse is, whether or not his picking technique works, and is curious about finding out, here's a video of him playing a tune called \"Tumeni Notes\":  Good luck! ",
            "date": "Answered January 9, 2016",
            "views": "61",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nicolas Azéraut",
                    "user_href": "/profile/Nicolas-Azéraut"
                },
                {
                    "user_id": "William Cleveland",
                    "user_href": "/profile/William-Cleveland-3"
                },
                {
                    "user_id": "Philip Maxwell Senior",
                    "user_href": "/profile/Philip-Maxwell-Senior"
                },
                {
                    "user_id": "Vishwateja Vanapalli",
                    "user_href": "/profile/Vishwateja-Vanapalli"
                },
                {
                    "user_id": "Craig Cunningham",
                    "user_href": "/profile/Craig-Cunningham-7"
                },
                {
                    "user_id": "Miloš Milohanović",
                    "user_href": "/profile/Miloš-Milohanović"
                },
                {
                    "user_id": "Simon Hayes",
                    "user_href": "/profile/Simon-Hayes-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Subhankar Das",
                "href": "/profile/Subhankar-Das-12"
            },
            "answer_text": "This guy:  For those who don't recognize him, he is Doyle Wolfgang Von Frankenstein from the band The Misfits. The way he holds his pick is plain weird. In order to hold pick like him you need to keep your thumb pointed downward, and keep your index finger slightly curled inward. The pick is held between the downward pointed thumb and the curled index finger. I once tried holding the pick that way, and immediately noticed that when you hold the pick that way you can't riff like a normal guitarist. You either need to punch downwards to play, or hit the strings with large heavy swaying motions to play. If you watch the videos of The Misfits well that's exactly how Doyle plays his guitars. What surprises me the most is how he doesn't run out of breath, because playing guitar that way is extremely exhaustive, and not only that I wonder how his guitar is still in good shape despite of such abuse. Edit: I found out why his guitar is still in shape. His guitar is apparently reinforced with steel plates. If that ain’t enough he uses a weird Floyd Rose system that is permanently locked using steel rods instead of springs in the back. That oddball locked down trem combined with the locking nut keeps his guitar in tune despite of his weird and completely abusive picking style.As of why he doesn’t run out of breath, well he’s a pro-wrestler he has truckload of stamina. ",
            "date": "Updated March 28, 2020",
            "views": "19",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Turner",
                    "user_href": "/profile/Michael-Turner-544"
                },
                {
                    "user_id": "Sachin Sheoran",
                    "user_href": "/profile/Sachin-Sheoran-63"
                }
            ]
        }
    ]
}