{
    "title": "Who is the best rapper out of the current kpop girl groups? - Quora",
    "tags": [
        "Hip Hop and Rap Artists"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kazumi Hatake",
                "href": "/profile/Kazumi-Hatake"
            },
            "answer_text": "*Short List: Yoojung, Yeeun, HyunA, Soyeon, Jennie, Moonbyul, LE, Yezi, Haneul, Ryujin, and more. Details: Jennie (BLACKPINK)Yes, she can rap and rap well. She’s under YG. Went against her parents’ wishes to pursue music. She trained for 5 years. Don’t bother coming at me telling me she can’t. HyunA (4MINUTE, Wonder Girls, Now soloist)HyunA isn’t currently in a kpop girl group but she used to be, so she’s on this list. I guess I could put CL in too, but everyone says CL we already know she’s good. Moonbyul (MAMAMOO)What can I say? She just raps pretty well.LE (EXID)Also raps pretty well.Yeeun (CLC)There’s something great about the way she raps, her voice and style.Yezi (FIESTAR)There’s no doubt she’s one of the best (female) korean rappers. I would also say Tymee, but I’m not sure if she counts if we’re talking about K-pop? Rookies -Soyeon (G)-IdleWe all saw this coming, everyone says she’s one of the best female rappers. All the popularity around her has kind of turned me away from her, but I can’t deny her skill.Yoojung (Weki Meki)Okay, I haven’t seen her rap much, I’ll be honest. But when she does, it just… it’s good and I feel like she has potential. A lot of potential. She’s so sassy and sweet and I love her. (I don’t stan Weki Meki but they are the only girl group with a cute concept that I like and thats saying something)Haneul (Saturday)An absolutely amazing rapper, and sooo underrated. I’m not even kidding. Check her out. Ryujin (ITZY)I think there’s something attractive about how she raps. Not sure what, but I think there is. E.U/Mia (Everglow) I know E.U and Aisha are the rappers but I feel like Mia has potential as a rapper. Anyway their rookies and we haven’t seen much from them but I think they could be good so here they are, on this list. Edit: I’ve decided to add links of them rapping. Jennie  (don’t tell me she screams I don’t wanna hear it. Sometimes she gets a little loud but she’s trying to be heard over the fans and the track playing and especially near their debut she had a lot of energy and when she gets really excited she raps louder, but she doesn’t scream normally. there’s plenty of non-yelling examples in these videos.)   (i dont think the others had her strange cloud rap so i wanted to include this last video as well)HyunA  Moonbyul  LE I could not find a good video of her rapping that included her rapping live as well so, sorry about that.  Yeeun (CLC)  Yezi (FIESTAR, Solo)   Oh and did I mention she can sing like an angel too? That’s right, badass rapper, can write, produce, choreograph, and sing beautifully. Queen.  Rookies Soyeon  Yoojung Underrated as hell. Check this girl out give her some love she deserves it. so much potential. I don’t know her, don’t stan weki meki, haven’t seen Produce 101 but I love her sass, her tone, her style.  Also her stage presence is fire. 🔥 I especially love the end of this video “wait i minute and i’ll take you there” her expressions… (yes ik this is unrelated but 🤷‍♀️)  Ryujin  MiaIn this video she’s singing, because she is a vocalist. But for example, in Adios, her tone when she raps (she raps a little bit) is pretty good and she has great presence and is badass. She’s also in charge of girl crush in the group (confirmed).  She’s also a great dancer/performer. (unrelated sorry)  In conclusion I think she’d be good at rapping if she did it because of her tone and style/swag. E.U   I can’t say much about Mia, E:U, and Ryujin as I haven’t seen them rap much. Hopefully Stone shows more of Everglow’s talent and Ryujin gets better. She’s doing good for a rookie but Ryujin’s rap isn’t amazing. Haneul (Saturday)  (0:41 is especially impressive) She’s too underrated, it’s sad. And so is her group. They’re kinda like Weki Meki? So if you like that cute and sassy vibe check them out. Anyways, that’s all. EDIT: Yoojung really is amazing. Rookie or not, she is one of the best idol rappers out there. Another video to prove it. her part starts at 2:35 i also believe she wrote her own lyrics for this.  *edit edit 5/6/20: I FORGOT YEEUN HOW COULD I FKALSKFDFKS FORIVE ME. AND YEZI. I’m also adding Haneul. ",
            "date": "Updated June 3, 2020",
            "views": "78",
            "upvotes": " View 50 Upvoters",
            "upvoters": [
                {
                    "user_id": "Deniz Önal",
                    "user_href": "/profile/Deniz-Önal-2"
                },
                {
                    "user_id": "Sweet Sour",
                    "user_href": "/profile/Sweet-Sour-27"
                },
                {
                    "user_id": "Anuja Raja",
                    "user_href": "/profile/Anuja-Raja-1"
                },
                {
                    "user_id": "Radish - Nim",
                    "user_href": "/profile/Radish-Nim"
                },
                {
                    "user_id": "Sarah Nasaka",
                    "user_href": "/profile/Sarah-Nasaka-1"
                },
                {
                    "user_id": "Natasharaj Jeripotula",
                    "user_href": "/profile/Natasharaj-Jeripotula"
                },
                {
                    "user_id": "Amy Huang",
                    "user_href": "/profile/Amy-Huang-317"
                },
                {
                    "user_id": "Ruby",
                    "user_href": "/profile/Ruby-1235"
                },
                {
                    "user_id": "Pari Sinha",
                    "user_href": "/profile/Pari-Sinha-13"
                },
                {
                    "user_id": "Skylar Glen",
                    "user_href": "/profile/Skylar-Glen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Betsy Wong",
                "href": "/profile/Betsy-Wong-4"
            },
            "answer_text": "There are only 2 girls I could think of right now because both of them amazed me. Jimin (AOA)  She looks just like a small doll but she could spit fire. Why I consider her to be one of the best female rappers out of girl groups? Because she outright dissed (seems like she won) Cheetah without a look of fear during Unpretty Rapstar. Most girls would tremble at the sight of her, but she managed to deliver and dissed her smoothly infront of her face, apart from having great stage presence on stage. And to make it more intense, she stuck out a middle finger to her. And her voice is ideal for rapping (for me). It just sounds nice.  During the show, Shin released a few collaboration singles, such as \"T4SA\" with MC Meta and Nuck. [7] Her song with Seulong, \"Good Start\", was produced by Verbal Jint and peaked at number two on the Gaon Singles Chart. [8] \"Puss\", her rap battle song with rapper Iron during the semi-finals, peaked at number one on the Gaon Singles Chart. Source : Wikipedia “Puss” is definitely nice and badass if you like the rap genre! Give it a listen. Soyeon (G-Idle)  Talk about deadly. Her vocal colour/voice is almost similar to Jimin but So Yeon is a bit extra. She used to participate in Produce 101 S1 but ranked 20th in the last episode. Like WHATTTTTT she's a talented trainee at that. Like Jimin she also participated in Unpretty Rapstar S3 and she won as the 2nd runner up. Which of course includes many dissing and (maybe) swearing. She debuted under CUBE in 2017 as an artist and released 2 digital singles which she self-produced, “Jelly” and “Idle Song” In 2018, she debuted as G-Idle and the songs are all self-produced and self-written by her. But what makes me go “wow” is her stage presence. She alone could make the stage burn on fire. This collaboration that I'm going to mention below is an example. In February 2018, Soyeon and fellow (G)I-dle member Miyeon were approached by Riot Games [19] [20] to participate in a collaboration project with American artists Jaira Burns and Madison Beer as part of a virtual girl group called \"K/DA\" for the multiplayer online battle arena video game League of Legends. Soyeon, Miyeon, Beer, and Burns recorded vocals for the virtual group, which consists of new versions of League of Legends characters. K/DA officially debuted with the song \"Pop/Stars\" during the 2018 League of Legends World Championship on November 3, 2018. [21] The official music video for \"POP/STARS\" was released on the same day, reaching 30 million views on YouTube in five days, [22] and 100 million in one month. The single release of the song reached the number one position on Billboard's World Digital Songs chart. Source: Wikipedia POP/STARS - Opening Ceremony Presented by Mastercard | Finals | 2018 World Championship Despite being a rookie, she is one tough and badass female k-idols out there. Edit: I just realised the question mentioned “current girl groups” so the accurate answer would be Soyeon! Jimin from AOA is from the 2nd gen and I would like to add CL to this list too.  Such a fierce image she holds on to but a huge sweetheart off-stage. Her stage presence could swallow us whole. I would like to see her dissing and freestyling tho :( I wanted to add Cheetah and Jessi too but the question asked specifically for girl groups so here you go. ",
            "date": "Answered June 4, 2019",
            "views": "142",
            "upvotes": " View 64 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sanjana Riadol",
                    "user_href": "/profile/Sanjana-Riadol"
                },
                {
                    "user_id": "Ichika Park",
                    "user_href": "/profile/Ichika-Park"
                },
                {
                    "user_id": "Kesang Choki",
                    "user_href": "/profile/Kesang-Choki-3"
                },
                {
                    "user_id": "Han Hyomi",
                    "user_href": "/profile/Han-Hyomi"
                },
                {
                    "user_id": "İrem İlhan",
                    "user_href": "/profile/İrem-İlhan-1"
                },
                {
                    "user_id": "Skylar Glen",
                    "user_href": "/profile/Skylar-Glen"
                },
                {
                    "user_id": "ROSHLINDA HAWAIBAM",
                    "user_href": "/profile/ROSHLINDA-HAWAIBAM"
                },
                {
                    "user_id": "Maelis.",
                    "user_href": "/profile/Maelis-1"
                },
                {
                    "user_id": "Hyunji Lee",
                    "user_href": "/profile/Hyunji-Lee-32"
                },
                {
                    "user_id": "Yoo Taeyang",
                    "user_href": "/profile/Yoo-Taeyang-2"
                }
            ]
        }
    ]
}