{
    "title": "Who is the most successful recording artist of all time? - Quora",
    "tags": [
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matthew Clay Burris",
                "href": "/profile/Matthew-Clay-Burris"
            },
            "answer_text": "Probably someone we aren't think of…maybe Elvis. Maybe Mike. Probably Celine Dion. These days the hip-hop types are moving the most freight, and the bean counting lines get blurred when you have to consider who and how much did what and what platform are we talking about. Someone's always going to say it's The Beatles and that's that. The other guy will say it's Dylan. Garth Brooks The Grateful Dead have been recorded playing live a lot A WHOLE LOT. Does that put Garcia in the running? Zeppelin, The Eagles, Fleetwood Mac, Pink Floyd? EVERYONE had a copy or two of those bands records. Elton and AC/DC put out a record a year for seemingly 30 years. Rick Rubin and Dr. Dre are responsible for tons of sales, do they count? Whitney, Brittney, Madonna, Ri-Ri, Tay tay? Slim Whitman? Vicente Fernandez? Juan Gabriel. I don't think anyone can say for certain, do you? Too many intangibles. In the end my vote goes to…. The Rolling Stones! Longevity, influence, at or near the top of the heap for a good decade, tours, merchandise, hits….shoite, they've done it all, and if that isn't success.. ",
            "date": "Answered August 22, 2019",
            "views": "119",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jay Fibonacci",
                "href": "/profile/Jay-Fibonacci"
            },
            "answer_text": "Different industries are comprised of different people with different live and backgrounds, what do you mean?successful as records made, or successfull as “started with 1 turntable a mixer and a microphone, started writing lyrics, now 10 years later I have a record label with some insane artist on smashing the scene, with 2 turntables maybe 3 maybe 4 a 16chn mixer recording all samples live from drum loops to guitar riffs bass lines to crazy synth sounds created from a raw simple sound like a knock at the door, recording studios all over the east n west coast” that’s a successfull artist,to me anyway, starting with nothing and gaining an entire world, but there’s so many ways of being successfull, in hip hop I think DrDre has been the most successfull . ",
            "date": "Answered December 6, 2018",
            "views": "113",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Peter Coultas",
                    "user_href": "/profile/Peter-Coultas"
                }
            ]
        }
    ]
}