{
    "title": "Who do you think is the most underrated jazz musician of all time? - Quora",
    "tags": [
        "Jazz Music",
        "Underrated Things or People",
        "Music Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gary Soucie",
                "href": "/profile/Gary-Soucie-2"
            },
            "answer_text": "After pondering this question for several days, I still can’t come up with an answer. It’s difficult to answer for several reasons. First, do you mean underrated by fellow musicians, jazz critics, bookers, record producers, or jazz fans? If we try to consider all of those categories together, Shorty Rogers as a trumpet player might get a mention; or Al Cohn as an arranger. Second, do you mean underrated, compared to their actual musical worth? (In this case, someone like Fats Navarro or Lennie Tristano or Roy Kral (as pianist and arranger)—who are much-appreciated by musicians, critics, and other jazz cognoscenti—could be considered woefully underrated. Third, there are plenty of cats who aren’t among the very best who are not appreciated and rated as much as they deserve; people like Tony Fruscella, Sonny Berman, and Don Fagerquist (just to stick to trumpet players) might be mentioned in this category. Fourth, there are musicians who are widely misunderstood because of twists and turns in their career. Consider Barbara Carroll, who spent the last several decades of her career play in a posh cabaret, making people forget that when she first emerged in the late 40s she was known to her peers as “Bebop Bobby Carroll,” who recorded with many of the bebop era’s standouts. Finally, there are those whose short lives or brief careers make people forget just how great they were: Jutta Hipp, Lorraine Geller, and Terry Pollard (here, I’m sticking to female pianists who deserve a much wider recognition). ",
            "date": "Answered June 10, 2019",
            "views": "172",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kenneth E MacAlister Jr",
                    "user_href": "/profile/Kenneth-E-MacAlister-Jr"
                },
                {
                    "user_id": "Adrian Hart",
                    "user_href": "/profile/Adrian-Hart-1"
                },
                {
                    "user_id": "Michelle LoPrete",
                    "user_href": "/profile/Michelle-LoPrete"
                },
                {
                    "user_id": "Klaus Schmirler",
                    "user_href": "/profile/Klaus-Schmirler"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rusty Southwick",
                "href": "/profile/Rusty-Southwick"
            },
            "answer_text": "Critics seem rather adept in their ratings of classical era jazz musicians, but they're less enthusiastic toward contemporary ones. My vote goes to Earl Klugh, who was most active in the ’70s and ‘80s. I enjoyed the albums “Life Stories” and “Heart String”.  One other musician who deserves a nod is Kevin Eubanks, who was a regular on Jay Leno's show. I liked the albums “The Heat of Heat” and “Face to Face”.  Honorable mention goes to Special EFX.  ",
            "date": "Answered June 5, 2019",
            "views": "101",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jay Mosley",
                    "user_href": "/profile/Jay-Mosley"
                },
                {
                    "user_id": "Stuart Holme",
                    "user_href": "/profile/Stuart-Holme"
                }
            ]
        }
    ]
}