{
    "title": "Who is the most talented music director of Bollywood? - Quora",
    "tags": [
        "Music Directors",
        "Bollywood Music",
        "Talent",
        "Bollywood"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pankaj Gautam",
                "href": "/profile/Pankaj-Gautam-19"
            },
            "answer_text": "As per my understanding of music, everyone has a different taste than others. In fact, I change my taste in music with time to time. Here is my take on this- A. R. Rahman - Not because he got Oscars. I think Jai Ho is one of his mediocre songs. But, Rahman is someone whose songs are like slow drugs. I never like his song when I listen to them at first. But then, I realise that I am humming that tune while working. I go back and listen to that song and got to know few things he has done amazingly. And then, one after other… the repeat mode gets on. I am listening to him in the order newest to oldest. And seriously, when you start from Enna Sona, Agar Tum Sath Ho to Pathaka Guddi to Kun Faaya Kun to Kaise mujhe tum mil gayi, Kahi to hogi wo……. Cut to Saathiya, Chhaiya Chhaiya, Jiya Jale, Roza, Tu hi re! When it comes to tunes, reckon the starting tune of Agar tum sath ho? The tune of Ye jo des hai tera? And leave everything and listen to Arziyan from Delhi 6 with full focus on lyrics, you will know how good Rahman it is. He is a blessing to us and I hope we can listen to many more great compositions by him.Shankar Ehsaan Loy - I know there are lots of people who deserve this spot but I think Shankar Ehsaan Loy deserve this better than anyone else. Starting from Mission Kashmir with Bumro Bumro, Dil chahta hai, Lakshya… SEL have given all time greatest compositions like Kal ho na ho… from Kajraare to Sinbad the sailor. One year back, I had a doubt whether SEL can use Arijit's voice in a song. And then came “mast magan”. Do you remember the tracks of Bhaag Milkha Bhaag? Amitabh Bacchan tweeted about the excellence of “O Rangrez”. Recently, Mirzya released and the movie didn't do well but if you listen to the jukebox, there are some musical gems waiting for u like Teen Gawah and Hichki. And at last, remember the World cup 2011 theme song 'De ghuma ke'?Pritam and Amit Trivedi - thought alot that who is better, but both are so good that can't put one ahead of other. One can blame Pritam of plagiarism, but boss, he composed the songs listening to which I have passed my school and college. Start with Gangster, Life in a metro and then the all time favourites Jab we met, Love Aaj kal.. Pritam's songs are so nice that one can fall in love with the song and the person with whom is listening to it. And then came Barfi.. “Itti si khushi”, “Phir le aaya dil”… I am sure Agent Vinod is not that good and the movie is going to be remembered for the song “Raabta”. Then, he took the country to DJ with Yeh Jawani Hai Deewani. Then came Bajrangi bhaijaan, “Tu jo mila” “Zindagi Kuch to bata” and the most famous of them all… the recent chartbuster hit “Channa Mereya”. For Amit Trivedi, I have just one word - respect! Someone who made such big name in a very short span of time. Start with the album which was the sign of a paradigm shift in music industry - Dev D. Pardesi, Tauba tera jalwa are not the numbers you can cherish as great songs but you are going to remember these songs for your lifetime. Have you heard of “Ek Lau zindagi ki”? Listen to it, you will get a feel of bombay theme tune of Rahman. He is the one who gave my generation the songs we can listen while we sit alone. “Iktara”, “Manjha” are two songs which will be in my playlist forever. The music of Kai Po Che is so chilling that you never get hold of your nerves during the film. Queen is the album which set Amit's name in the top music directors list with London Thumakda and Gujariya. Fitoor is such a nice album and Pashmina is pure gold. And if you still have any doubts on Mr. Trivedi… “Ik Kudi Jida Naam Mohabbat hai……”Having said this, if anybody has got the doubt that SEL don't deserve 2nd place… I am sorry but Kal Ho Na Ho will always be the best song of bollywood in my view. ",
            "date": "Answered April 24, 2017",
            "views": "56",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shane Studio",
                    "user_href": "/profile/Shane-Studio"
                },
                {
                    "user_id": "Rajesh Subramanian",
                    "user_href": "/profile/Rajesh-Subramanian-94"
                },
                {
                    "user_id": "Gulam Moinuddin",
                    "user_href": "/profile/Gulam-Moinuddin-23"
                },
                {
                    "user_id": "Uttam Kumar Shatdarsanam",
                    "user_href": "/profile/Uttam-Kumar-Shatdarsanam"
                },
                {
                    "user_id": "Midun",
                    "user_href": "/profile/Midun-2"
                },
                {
                    "user_id": "Shivam Singh",
                    "user_href": "/profile/Shivam-Singh-1954"
                },
                {
                    "user_id": "Rohan Pillai",
                    "user_href": "/profile/Rohan-Pillai-24"
                },
                {
                    "user_id": "Debdulal Das",
                    "user_href": "/profile/Debdulal-Das-12"
                },
                {
                    "user_id": "Siddharth Upadhyay",
                    "user_href": "/profile/Siddharth-Upadhyay-4"
                },
                {
                    "user_id": "Prasanna Sridharan",
                    "user_href": "/profile/பிரசன்னா-ஸ்ரீதரன்-Prasanna-Sridharan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arpit Harsh",
                "href": "/profile/Arpit-Harsh-7"
            },
            "answer_text": "A.R. RahmanListen to his first mesmerizing music of Roja(1992), anybody will understand how strong influence it created into the Indian Music. Most Bollywood audience listen to his music by 1993 or 1994, and hence the musicians got influenced by his music partnered the innovation & trend setting. Rahman is skilled in Carnatic music, Western classical, Hindustani music and the Qawwali style. Symphonic orchestral themes have accompanied his scores, where he has employed leitmotif. His compositions bring out the uses of counterpoint, orchestration and the human voice, evolving Indian pop music with unique timbres, forms and instrumentation. Rahman is arguably more adept at using synthesized sound and beats in his music, and his music has gained wider national (India) and international popularity.  Two Oscar Award winner and one of the finest composer of World right now. 2.Ilaiyaraaja  Ilaiyaraaja has won four Indian National Film Awards for best film scoring, and is a recipient of the prestigious Padma Bhushan Award from the Government of India. Music style Interfusion of Western, Indian folk and Carnatic elements. amalgamated elements of genres such as Afro-tribal, bossa nova, dance music doo-wop, flamenco, acoustic guitar march, pathos, pop, psychedelia, and rock and roll 3.Vishal Bharadwaj  In modern Bollywood movie Vishal Bharadwaj’s music is considered as fresh and melodious. Ankit Tiwari Ankit Tiwari is an Indian playback singer and music director. His career began upon to meeting Pradeep Sarkar, where he got a chance to work on jingles and started composing background scores for television programmes  Sunn Raha Hai (Aashiqui2), Galliyan (Ek Villain), Tu Hai Ki Nahi (Roy), Tu Jo Hai (Mr X) Amaal Mallik  Sooraj Dooba Hain (Roy), Saiyaan Superstar (Ek Paheli Leela), song sung by Salman Khan (Hero) ",
            "date": "Answered March 14, 2017",
            "views": "19",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gulam Moinuddin",
                    "user_href": "/profile/Gulam-Moinuddin-23"
                },
                {
                    "user_id": "Niranjan Prathap",
                    "user_href": "/profile/Niranjan-Prathap"
                },
                {
                    "user_id": "Uttam Kumar Shatdarsanam",
                    "user_href": "/profile/Uttam-Kumar-Shatdarsanam"
                },
                {
                    "user_id": "Midun",
                    "user_href": "/profile/Midun-2"
                },
                {
                    "user_id": "Aastha Jadon",
                    "user_href": "/profile/Aastha-Jadon"
                },
                {
                    "user_id": "Lavanya Tripurana",
                    "user_href": "/profile/Lavanya-Tripurana"
                },
                {
                    "user_id": "Anwesha Chakraborty",
                    "user_href": "/profile/Anwesha-Chakraborty-27"
                }
            ]
        }
    ]
}