{
    "title": "Who invented the acoustic guitar? When was it invented? - Quora",
    "tags": [
        "Acoustic Guitars",
        "Inventors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ken Rowe",
                "href": "/profile/Ken-Rowe-7"
            },
            "answer_text": "The acoustic guitar (Or what we can point to and call it guitar like ) has its origins dating back to the 500’s. It was a North African instrument that would eventually evolve into what we have today. There are other similar instruments that were known to the ancient Sumerians and Egyptians, and there are “cousins” coming from Iranian areas. The originals were completely different, having 4 “courses” of double strings. The instrument was tuned much like a violin or other stringed instrument would be, each set of strings a tuned a 5th away from the next. By the 1400’s the guitar was the most common household instrument, and by the early 1500’s they had added a string set. (5 string) And at this point there was written music specifically for the guitar- Baroque music. At this point there were now two forms of guitars- one meant strictly for baroque, and one made for everything else. This second guitar was tuned such that the 3rd string was 1/2 step below the 5th it should be tuned to. Moving into the mid to late 1600’s we find yet another string set had been added, and by the 1700’s the courses were replaced by 6 single strings. The way it was tuned shifted the 1/2 step note to the 2nd string and added the 2nd E note. There were two schools of guitar playing- Them that were Spanish influenced (flamenco) and them that were not. Then in the late 1800’s a new design happened. They began moving away from the “ladder” braced design (look it up) and changed to what our modern versions look like today. Other advances include the use of steel strings as apposed to animal sinew, followed by nylon strings which were first made in 1948. ",
            "date": "Answered November 9, 2017",
            "views": "48",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Emmett Roch",
                    "user_href": "/profile/Emmett-Roch"
                },
                {
                    "user_id": "Raymond Russ Kroll",
                    "user_href": "/profile/Raymond-Russ-Kroll"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jules Marcel",
                "href": "/profile/Jules-Marcel"
            },
            "answer_text": "Many people attribute the discovery of the guitar to Antonio Torres Jurado. In reality Gaetano Vinaccia is credited with the discovery of the first six string guitar which later became the basis of the modern acoustic guitar. His family produced some of the finest violins in Europe at the time. His family is also credited with inventing the mandolin, a six stringed instrument in 1799 and built in naples Italy. Antonio Torres Jurado is credited as one of the most important inventors in the history of guitars. He is the creator of the modern acoustic guitar. he lived in Seville, Spain. It was in the 1850’s, using the existing model from Vinaccia as inspiration, Jurado expanded the size of the base and then focused his attention on the dynamics of the soundboard. His work has been credited with bringing the acoustic guitar into the mainstream. ",
            "date": "Answered January 5, 2018",
            "views": "57",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Emmett Roch",
                    "user_href": "/profile/Emmett-Roch"
                },
                {
                    "user_id": "Raymond Russ Kroll",
                    "user_href": "/profile/Raymond-Russ-Kroll"
                },
                {
                    "user_id": "Car Vent",
                    "user_href": "/profile/Car-Vent"
                },
                {
                    "user_id": "Dhiman Ghosh",
                    "user_href": "/profile/Dhiman-Ghosh-7"
                },
                {
                    "user_id": "Nirav Kotak B",
                    "user_href": "/profile/Nirav-Kotak-B"
                }
            ]
        }
    ]
}