{
    "title": "Who sings the best harmony in rock music? - Quora",
    "tags": [
        "Rock Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Chanin",
                "href": "/profile/Steve-Chanin"
            },
            "answer_text": "I agree with many of the bands mentioned, particularly CSNY, the Beach Boys, the Beatles, Queen, Fleetwood Mac, the Four Seasons, R.E.M.  I’ll add a few no one seems to have put out there: Elton John’s classic 70s band (some examples: “Someone Saved My Life Tonight,” “Mona Lisas and Mad Hatters,” and the aptly named “Harmony,” which has some of my favorite backup vocal work).  Pink Floyd’s Gilmour and Wright were great, particularly on early 70s stuff like “Echoes,” “Burning Bridges,” and “Wot's . . . Uh The Deal.”  And, though not conventional or what would be ordinarily be thought of as pretty, Jagger and Richards at the Rolling Stones’ peak were amazing. Apart, their voices were somewhat flawed, but together they were perfect—so perfect, it’s hard to fathom either of them singing with anyone else. “Wild Horses,” “Brown Sugar,” “Honky Tonk Women,” “Beast of Burden,” “Jumpin' Jack Flash,” “Let it Loose,” and especially “Memory Motel” are  examples that spring to mind, but really any time those two voices came together it was special. (Note, most of the songs I mentioned are rockers, and it’s a lot harder to find good harmony on rockers than on ballads.) ",
            "date": "Answered March 19, 2015",
            "views": "51",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tom Adams",
                    "user_href": "/profile/Tom-Adams-123"
                },
                {
                    "user_id": "Cam Ballew",
                    "user_href": "/profile/Cam-Ballew"
                },
                {
                    "user_id": "Kevin Gault",
                    "user_href": "/profile/Kevin-Gault-3"
                },
                {
                    "user_id": "Mike Berry",
                    "user_href": "/profile/Mike-Berry-1"
                },
                {
                    "user_id": "David Durham",
                    "user_href": "/profile/David-Durham"
                },
                {
                    "user_id": "Nick du Plessis",
                    "user_href": "/profile/Nick-du-Plessis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nick du Plessis",
                "href": "/profile/Nick-du-Plessis"
            },
            "answer_text": "A few quick suggestions: WAR, the Beatles, the Beach Boys, R.E.M., Supremes, Earth, Wind and Fire, Yes, CSN&Y, Temptations, Martha and the Vandellas, the Shangri-Las, Chicago, Kinks, Everly Brothers, Isley Brothers, Foreigner, Yardbirds, Duran Duran, the Byrds, the Four Seasons, Depeche Mode, and the Osmonds. Elton John's peak band (on Goodbye Yellow Brick Road) did great harmony work. A lot of great singers (Whitney, Mariah, Mary J.) started out as backing singers. You can make jokes about that if you want, but I think the experience is a great way to build and solidify musicianship. I think we're in an interesting period where a lot of eccentric indy artists are harmonizing with themselves with gorgeous in-studio results - Glasser and Austra come to mind. Kate Bush and Meredith Monk are kind of the matron saints there. ",
            "date": "Updated July 22, 2015",
            "views": "39",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                },
                {
                    "user_id": "Daniel Ruffin",
                    "user_href": "/profile/Daniel-Ruffin-4"
                },
                {
                    "user_id": "Maggie McQuaid",
                    "user_href": "/profile/Maggie-McQuaid"
                },
                {
                    "user_id": "David Durham",
                    "user_href": "/profile/David-Durham"
                },
                {
                    "user_id": "Richard H. Schwartz",
                    "user_href": "/profile/Richard-H-Schwartz"
                }
            ]
        }
    ]
}