{
    "title": "Who composes Eminem's music? - Quora",
    "tags": [
        "Eminem (musician)",
        "Rap Music",
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Guillermo René Ramírez Bonilla",
                "href": "/profile/Guillermo-René-Ramírez-Bonilla"
            },
            "answer_text": "It's generally a team effort. While, as far as I understand, Eminem has the final say on what goes and what doesn't and he writes all of his lines. At least there's no evidence or strong rumor otherwise. But as for the music, it's a bit more complex. As you may know[1], most major rappers depend on producers to get their instrumentals. Eminem has worked with various production teams throughout his career, sometimes getting himself involved directly in that process, but generally trusting someone else to lead it. As a matter of fact, many of his song list multiple writers, including various producers alongside Matters himself. Oh, a third element is that due to a mix of professional respect and legal matters, people whose songs get (significantly? I am not an expert to know how many deep cuts include samples) sampled also get co-writing credits.   [1] Hip-hop has historically been the work an emcee (or rapper) providing lines over the music of a second person. In the early days this was a disc jockey who would use vinyl records and a turntable to get beats, but as time went on and the genre formalized, this role became production, which was pretty driven to samples and drum machines at first but slowly evolved to encompass pretty much whichever method the producer prefers. ",
            "date": "Answered December 14, 2015",
            "views": "6",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Pawas Dixit",
                    "user_href": "/profile/Pawas-Dixit-1"
                },
                {
                    "user_id": "Lisa Gardiner",
                    "user_href": "/profile/Lisa-Gardiner-25"
                },
                {
                    "user_id": "Vishal Singh",
                    "user_href": "/profile/Vishal-Singh-756"
                },
                {
                    "user_id": "Noah Saunders",
                    "user_href": "/profile/Noah-Saunders"
                },
                {
                    "user_id": "Jade Kim",
                    "user_href": "/profile/Jade-Kim-69"
                },
                {
                    "user_id": "Amanda Craigie",
                    "user_href": "/profile/Amanda-Craigie"
                },
                {
                    "user_id": "Nicole Smoczynska",
                    "user_href": "/profile/Nicole-Smoczynska-1"
                },
                {
                    "user_id": "Gowtham Krishna",
                    "user_href": "/profile/Gowtham-Krishna-81"
                },
                {
                    "user_id": "Chris Ringgold",
                    "user_href": "/profile/Chris-Ringgold"
                },
                {
                    "user_id": "Jaskaran Singh Sodhi",
                    "user_href": "/profile/Jaskaran-Singh-Sodhi-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tyler Mead",
                "href": "/profile/Tyler-Mead-3"
            },
            "answer_text": "Eminem writes all of his own music, and sometimes he freestyles it, but it is all original. However, he does not always make his own music along with the lyrics, that privilege goes to his studio or, more importantly, Dr. Dre. Dre has been making the music for Eminem for a very long time, and there's a reason for it: Dre is really good at it. Along with Eminem, who is really good at what he does, which is rapping and making the lyrics work (except, arguably his \"love is evol\" rhyme *shudder*), Dre is a talented studio hand, if not the best. ",
            "date": "Answered September 9, 2015",
            "views": "27",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vishal Singh",
                    "user_href": "/profile/Vishal-Singh-756"
                },
                {
                    "user_id": "Amanda Craigie",
                    "user_href": "/profile/Amanda-Craigie"
                },
                {
                    "user_id": "Gowtham Krishna",
                    "user_href": "/profile/Gowtham-Krishna-81"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Saksham-38"
                },
                {
                    "user_id": "Angie Gomez",
                    "user_href": "/profile/Angie-Gomez-20"
                }
            ]
        }
    ]
}