{
    "title": "Who is a better guitarist, Eddie Van Halen or Slash? - Quora",
    "tags": [
        "Slash (musician) ",
        "Eddie Van Halen (musician)",
        "Van Halen",
        "Guitarists"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dan Scheffki",
                "href": "/profile/Dan-Scheffki"
            },
            "answer_text": "“Better” is always subjective to discuss or ask about. With that out of the way. Eddie was/is by far more innovative than Slash and (to me) a far better technical player than Slash ever could hope to be. Not saying Slash is “bad” but he didn’t innovate on the guitar like Eddie did with tapping and with sounds as Eddie did. Slash also did not have the technique Eddie had. I also don’t think Slash was nearly as accomplished a rhythm player as Eddie. You have to understand Eddie was basically playing in a power trio with a frontman. Lots of ground to cover there especially live. Slash always had a second guitarist helping hold down the rhythm. I believe if you stacked them up song riff for song riff too …that Eddie’s would be more impressive overall. These are just some of the obvious things that come to mind for me thinking of the two of them. To me…Eddie being the pioneer that he was and the sheer number of people who still try to emulate him puts him in a different class than Slash. ",
            "date": "Answered April 21, 2020",
            "views": "226",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eric Hughes",
                    "user_href": "/profile/Eric-Hughes-32"
                },
                {
                    "user_id": "Chris Austin",
                    "user_href": "/profile/Chris-Austin-83"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Doyle",
                "href": "/profile/John-Doyle-311"
            },
            "answer_text": "EVH is amongst a list of about 6–7 of the greatest rock guitarists ever. This list includes, in no particular order, Page, Hendrix, Clapton, Beck, Allman, SRV. Slash is somewhere down the list at 300+. I’ve seen all the above and Slash and at 300+ I’m being kind. Frankly he sucks and doesn’t deserve to be in the same sentence with EVH. ",
            "date": "Answered December 15, 2019",
            "views": "188",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jacqueline Taylor",
                    "user_href": "/profile/Jacqueline-Taylor-160"
                },
                {
                    "user_id": "Joe Vallee",
                    "user_href": "/profile/Joe-Vallee-1"
                }
            ]
        }
    ]
}