{
    "title": "Who are some famous people who come from Ibiza? - Quora",
    "tags": [
        "Ibiza",
        "Fame and Mass Popularity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Burden",
                "href": "/profile/Michael-Burden-6"
            },
            "answer_text": "Although the historical basis for this claim is dubious, Ibiza likes to claim that two famous people from history have come from the island, namely Hannibal and Christopher Columbus. Ibiza was first colonised in 680 BC by the Phoenicians who were the greatest seafarers of antiquity and it was they who founded Ibiza town (Eivissa). The Phoenicians ran the Island up until 550BC, and then the Carthaginians took over, because Carthage was a Phoenician colony itself. The Carthaginians ruled Ibiza until 147 BC when they were finally destroyed by the Romans during the Punic Wars. Ibiza therefore claims that the famous Carthaginian General Hannibal, who according to most historical records was born in Carthage in 247BC, was actually born in Ibiza and to be precise on the small island of Conillera, which is just off the main island of Ibiza and can be seen from the Sunset Strip in the resort of San Antionio. I studied Latin at grammar school until I was 16, and achieved a Grade 1 pass at O level (the forerunner of the GCSE exam) in the subject. I therefore studied not only the history of the Romans but also a little of the history of their arch enemy the Carthaginians. One little piece of information I learned was that Hannibal, like the Russian monk Rasputin, was said to be very resistant and almost immune to poison, because over the years he had taken different poisons first in small and then in increasingly large doses, but in the end he committed suicide by poisoning himself with a large dose of strong poison he had always kept for this purpose. Hannibal’s name was recorded in Carthaginian sources as ḤNBʻL (in Punic: ). The name is said to mean \"grace of Baʻal\", \"Ba'al is gracious\", or \"Ba'al has been gracious\". Ba’al was the Carthaginian and Phoenician god, who is also mentioned in the Old Testament of the Bible, through being the god of the Canaanites who were displaced by the ancient Hebrews, and who were also the same people as the Phoenicians. Christopher Columbus according to most records was born in Genoa in 1451, though many other theories about his origins abound, one of which is that he was from Ibiza. While this has never been proved, studies have led researchers to believe that his mother-tongue was Catalan, as he spoke and wrote in such a style, using words typical to Catalan native speakers. It has been argued that his real name was Colom, and not Colon (the Spanish form of Columbus) and that he was a member of the powerful Colom Jewish family of Ibiza, merchants who held the top political posts on the island, and were a branch of the Coloms of Catalonia. As most residents and visitors to Ibiza will know, in the boulevard El Paseo de Ses Fonts in San Antono stands a huge statue of an enormous egg known as The Egg of Columbus. This is in recognition of (one of many) apocryphal stories that, during a banquet thrown in Columbus's honour after his return from his voyages, some noblemen claimed that the discovery of the Americas was no big deal, and that anyone with the same equipment and ship's complement would have been able to do the very same thing. Columbus challenged them to make an egg stand on its tip, unsupported and when no-one was able to do it, Columbus simply took the egg, tapped it on the table so as to flatten the tip and the egg stood without falling over. The moral being that once you have been shown how to do something, it is easy, whereas to discover something new without help or knowing the answer in advance is much more difficult. ",
            "date": "Answered September 4, 2017",
            "views": "925",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Linda Jee",
                    "user_href": "/profile/Linda-Jee-1"
                }
            ]
        }
    ]
}