{
    "title": "Who was the worst country singer? - Quora",
    "tags": [
        "Country Singers and Musicians",
        "Country Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Huff",
                "href": "/profile/Steve-Huff-1"
            },
            "answer_text": "I’m from Nashville, I’m a singer, so I have some biases here. I am not going to name the person who came to mind first, sorry (we actually have mutual friendly acquaintances and Nashville is still a small town, in some ways). She blew up in Nashville in the 1980s and did become famous. She had some great songwriting behind her and she was super-appealing; attractive, charismatic, good on stage. But when it came to evaluating her sheerly on vocal ability, she had none. Like a 5-note range, and what sounded like a permanent rasp. It was pretty blatant that sound engineers worked overtime putting her albums together. It was painful to watch her sing live. She had a male counterpart who fit the same description: handsome, charisma for days, courted the same specific subset of country music listeners. He was every bit her equal in badness—sang with so much tension he was painful to watch, this strained, choked sound. He even jutted his lower jaw out as he sang, which is one of the worst tension-inducing things you can do. The woman, oddly, ended up married to one of the finest country singers to ever pick up a guitar, a really gifted vocalist with good range and musicality. Haven’t heard much from her in years, and I’ve long suspected that’s because she ruined her voice beyond using (her rasp, to any trained singer, was ample evidence of nodules in action). ",
            "date": "Answered November 13, 2018",
            "views": "18",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stephanie McKenna",
                    "user_href": "/profile/Stephanie-McKenna-27"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Ferris-T-Bueller"
                },
                {
                    "user_id": "Matty Watts",
                    "user_href": "/profile/Matty-Watts-1"
                },
                {
                    "user_id": "Angela Smith",
                    "user_href": "/profile/Angela-Smith-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Geoff Arnold",
                "href": "/profile/Geoff-Arnold-2"
            },
            "answer_text": "Billy Ray Cyrus was reputed to be pretty bad. But that’s because of the song, not the singer. Kris Kristofferson is not amazing either. But I prefer his version of “Bobbie McGee” because it has soul for days. You know, it really isn’t about being a bad singer. Bob Dylan was a bad singer, but his songs still hit a chord. Steve Earle is pretty “bad”, too, but his material just hits you, and you begin to see his singing actually makes the song work right. I love his Bluegrass stuff. There are a lot of bad singers in Country. But you have to listen to how they convey their music. If they do it with conviction, convincing you the story they’re telling matters, isn’t that what counts? I’ll take a Bob Dylan and Steve Earle and their sincere delivery over the best Country crooners who have no conviction or sincerity. ",
            "date": "Answered December 30, 2018",
            "views": "446",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andy Roper",
                    "user_href": "/profile/Andy-Roper-6"
                },
                {
                    "user_id": "Sonny Armstrong",
                    "user_href": "/profile/Sonny-Armstrong-5"
                },
                {
                    "user_id": "Gail Gerald",
                    "user_href": "/profile/Gail-Gerald-1"
                },
                {
                    "user_id": "Rick Harrison",
                    "user_href": "/profile/Rick-Harrison-60"
                },
                {
                    "user_id": "Andrew Woodson",
                    "user_href": "/profile/Andrew-Woodson-2"
                },
                {
                    "user_id": "Jay Roberts",
                    "user_href": "/profile/Jay-Roberts-34"
                }
            ]
        }
    ]
}