{
    "title": "Who picks the background music for TV shows? - Quora",
    "tags": [
        "Background Music",
        "Television Production",
        "Soundtracks",
        "Television Business",
        "Television",
        "Television Series"
    ],
    "response": [
        {
            "author_info": {
                "name": "Earl Dingman",
                "href": "/profile/Earl-Dingman-1"
            },
            "answer_text": "Well a lot of music is written for the show by composers. Some work alone with triggers or synth and watch the show on a TV set or their computer while they noodle along. Some write out basic parts, turn them over to an arranger/copyist. Then they bring them in to a recording session with 35 to 100 orchestra instruments. Sessions are in 3 hour blocks, twice daily for a fixed fee for the musicians. Typically a producer or contractor picks the players. Big composers may ask for specific drummers, percussionists, horn and flute players. Generally 30–50% of the music is original. After that either a Music Supervisor or a Music Editor has ALL the recordings done by all the composers and looks for one that will fit a given scene. All the Cartoon shows. All the prime time shows. All the Soaps use originally composed music. Soaps used to hire an organist or pianist and they’d “noodle” along and give it a name, and file a copyright and the studio would own the publishing and the player/composer would be with ASCAP or BMI and would get paid every time The Edge of Night or the Secret Storm or General Hospital came on TV. Now they use synths and triggers. When I was at an ASCAP meeting one of the Soap opera composer/keyboardists was asking a question of the ASCAP executives as to why all his competition in Soap music were moving over to BMI. I never learned the answer as the ASCAP man ushered him away. I remember in the LAST season of the Man From UNCLE the Music Supervisor or Editor decided to use ALL of Jerry Goldsmith’s compositions in one of the episodes. Goldsmith only recorded two episodes worth in the first season of the show and wrote the theme song, which other arrangers butchered. In a third season episode of The Man From UNCLE Gerald Fried wrote this really neat flute, percussion and bass vamp. In a later episode the Music Supervisors or Editor used part of that same vamp in a new episode. I worked with a keyboardist who wrote the Power Ranger’s theme and does music for shows like Hot in Cleveland, The Real Wives of New York City, Thundermans and lots of cartoon shows. He also appeared on TV backing his wife or her band, including Johnny Carson’s Tonight Show and Regis and Kathy Lee. Another person I worked with is Music Supervisor on shows. For an episode of Covert Affairs the Music Supervisor or Music Editor picked a classic “European feel” song and put that into the show. In some instances the Producers might have a say. I’m not sure who put “Future Starts Slow” by The Kills into the Relevance episode of Person of Interest. One of the producers may have heard it and thought it made a nice ending to that episode. The writer produced the episode they wrote, so they may have asked if that song could be bought and used. The Kills were not a big act, so use of their master was probably cheap. Heck, they might have let them use it for free just for the exposure. They also got a CUE when it ran on the Network through ASCAP or BMI. It was background a vocal. Still worth maybe $1,000 or so each airing. I’m not sure who put the opening of “Under Pressure” into the ending of the pilot of “Studio 60 on the Sunset Strip.” NBC does use that a lot. One of the producers, or a Music Supervisor or a Music Editor might have picked it out. Since the vocals by Bowie and Mercury weren’t heard (just that bass lick and Mercury’s piano chord) it wouldn’t make as much as the Kills or Tricky would make with their songs. I’m sure director Antoine Fuqua picked all the songs for “The Replacement Killers” because he came from doing music videos. He had to have picked “City of Angeles” and “She Makes Me Wanna Die” The composers get $$$ each time it plays on TV as it’s vocal and up front and used TWICE. Once inside the movie and for the ending credits in it’s entirity. I can get thousand and thousands on a network. In the case of 2001, Stanley Kubrick picked ALL of the music used. Composer and Publishers of music that’s in Copyright and registered through either ASCAP or BMI get paid for EVERY TV airing. Local or Network. An hour of background music in prime time can fetch thousands of dollars on a network like NBC, CBS or ABC. A theme song gets even more money. For games shows the Producer or Show Runner or a Music Supervisor may pick songs. The Original Match Game use “A Swinging Safari” and a lot of ABC game shows use Herb Alpert and the Tijuana Brass hit singles. Sometimes they use public domain “canned” music. That costs them the price of the CD disk. ",
            "date": "Answered September 27, 2020",
            "views": "180",
            "upvotes": " Answer requested by Lizzie Taylor"
        },
        {
            "author_info": {
                "name": "Graham Stephens",
                "href": "/profile/Graham-Stephens-3"
            },
            "answer_text": "TV shows tend to use pre-recorded copyrighted music unlike films where music is composed specifically (unless the copyrighted track is central to the action such as Queens Bohemian Rhapsody in Waynes World). TV producers, unlike film producers, are much more hands on and will generally select music in conjunction with the screenwriter. Once the rough edit is available the selected music will be dubbed on and a viewing session organised with the writer, director and editor. If they are viewing multiple options a music librarian will also attend to ensure the approved track for each segment is accurately noted and will check copyright fees, if any, payable to the RIAA or equivalent organisation. In movies this task usually falls to the director for approval. The producer will approve the final movie score with the director and composer but is generally not involved in the day to day operation. ",
            "date": "Answered September 26, 2020",
            "views": "186",
            "upvotes": " Answer requested by Lizzie Taylor"
        }
    ]
}