{
    "title": "Who do you think is gay in K-pop? Why? - Quora",
    "tags": [
        "LGBTQ Issues",
        "Homosexuality",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Liv Smith",
                "href": "/profile/Liv-Smith-95"
            },
            "answer_text": "Update: I have decided that I think Kim Lip may be straight so I’ll remove her from my list. After receiving some info on Miyeon from (G)-IDLE, I’ve decided to add her to my list. Update #2: I have found some more info about Sehun that alludes to him being gay which I will add to this post. Update #3: I originally thought that all of GOT7 were straight but I have changed my mind on a couple members so I will be adding those members to my list. Update: I have changed my opinion on a certain EXO member and I will be adding that member to my list. Disclaimer: These are just my assumptions. If you disagree with them, that’s fine. But remember that just because an idol doesn’t say they’re lgbt or even denies they’re lgbt, that doesn’t mean they’re not LGBT. There are hundreds of kpop idols so of course they’re are lgbt ones. However, if they were to come out, they could risk losing their careers which is why a lot of them don’t come out to the public. Everything I’m using to support my opinions can be searched up online. So use google if you want proof for what I’m saying. I will be listing which idols I think are lgbt and why I think so. I’m going to start with the members of Boy Groups I think are LGBT: 2 am Jo Kwon- Gay. Is there anyone who disagrees with me on this? Jo Kwon is obviously uninterested in women. There’s a video of him kissing a woman in which he looks disgusted. I don’t think he dislikes women. He’s just not attracted to them. Whenever I see pics or videos of him with women, he looks like the gay best friend. He has a tattoo saying “Born this way”. What straight guy gets that tattoo? He posted a pic on Instagram of him holding a Troye Sivan album and kissing it. Now onto how Jo Kwon has addressed the rumors about him being gay. He hasn’t exactly denied them. In fact, the way he addresses them points to the likelihood of him being gay. Here are some ways he’s addressed the rumors: He said he’s “aware of those rumors, but I don't care at all. That's who I am”“I was born this way and I'm doing my best with what I'm given.”I mean come on. He didn’t even say he’s not gay. This all sounds like he’s gay. Astro MJ- Gay. He seems pretty into men but not women. Sanha- Gay. Like MJ, he also shows no interest in women. Ateez Yunho- Gay. He seems into men but not women. When he met one of the TVXQ members, it seemed like he got super flustered like he had crush on him. San- Gay. He also seems into men but not women. I’m also going to talk about his interest in Troye Sivan. Troye has a huge LGBT fan base and many LGBT people, especially gay men, resonate with his songs which is why they like him. However, I don’t believe that just because a man likes Troye’s music, he’s gay. Seonghwa and Jungkook like Troye’s music and I believe both Seongwha and Jungkook are straight. However, I think it’s different with San. His favorite song is “Heaven” by Troye. “Heaven” is about accepting yourself and not changing yourself for society. For a song like this to be San’s favorite song, that’s telling. Mingi- Gay. He literally said his ideal type is an actor named Nam Joohyuk. Straight men don’t say their ideal type is a male actor. B.A.P. Yongguk- Gay. I know he contributes to writing a song in which one of the topics is LGBT relationships. When Himchan was talking about his techniques he uses to attract women. Yongguk asked whether they work on men too. That’s just not something a straight guy would ask. Block B Zico- Bisexual and possibly non-binary. Another member says that “Zico’s sexual taste is really unusual” and that he “kind of likes men as well”. Zico doesn’t react to this statement. I assume Zico has told his members he’s bisexual. He also said if he were to become genderless, that would be fine. I don’t fully understand non-binary identities, I’ll admit, but people should identify as whatever gender they feel comfortable as. Taeil- Gay. He literally said he doesn’t like girls but doesn’t dislike them either. He says that girls are average. BTS: Jimin- Gay. He tweeted 5 years ago “It’s Valentine’s Day. Only look if you’re a fanboy. Don’t look if you’re a fan girl”. And his crush on Tony from American Hustle Life? That was super obvious. It’s not even the norm in Korean culture to hug anyone that isn’t a family or friend. He didn’t know Tony that well and was totally hugging him and all over him. I don’t believe anything happened between Jimin and Tony because Tony seems straight. Jimin also flirted with a couple of male interviewers in America and he’s totally flirted with Wonho. He’s totally more into men than women. He’s friendly with them, but it doesn’t seem to get more than friendly. Yeah he’s been flirty with fans at fansigns, but I think he knows it’s part of his job. Idols have flirted with fans at fan-signs as part of their job. Gay men can put on an act and it’s clear Jimin can do a good job at it flirting with fans. V- bisexual. I thought he was straight until he said that “Call me By Your Name” is his favorite movie. That’s not something a straight guy says. V has also shown interest in women which is why I believe him to be bisexual. Suga- bisexual. He literally said in an interview that his dating preferences aren’t limited to the opposite gender so he basically came out as bi. Also one of his lines in Cypher pt 3 J-hope- Bisexual. Honestly, he was hard to read but I decided he was bisexual. In an old video, Jimin said J-hope really likes men and J-hope didn’t deny it. Also J-hope’s relationship with Jimin is interesting. They’re pretty affectionate but they may also just be friends. But if any two BTS members are dating, it’s Jimin and J-hope. But J-hope also wrote part of the lyrics for “War of Hormone” and looking at the lyrics, I just don’t see how a gay man would write something like that. Plus he seems to show interest in women. CIX Yonghee- Gay. He just doesn’t seem into women but he’s definitely into men. D.I.P. Seongho and Yubon- Gay and are/were in a relationship. They said they were in a relationship on Facebook. I don’t know if they’re still together though. Hyeonseong- bisexual. He said he liked both men and women on Facebook. EXO Chanyeol- Gay. So apparently I’ve heard his mannerisms are more feminine but that’s not why I think he’s gay. I think he’s gay because he posted on his social media asking why he falls in love with anime characters and saying “Why are those anime characters always male”? This isn’t something a straight guy says. Chanyeol is clearly gay and this is probably his way of indirectly coming out. Baekhyun- bisexual. He just gives off that vibe. He shows interest in both genders. I wouldn’t be surprised if he’s promiscuous and/or polyamorous (nothing wrong with those things btw). Also I do believe Baekyun had something going on with Sehun whether it was completely sexual or romantic. Baekhyun and Sehun filmed a drama where they were fake making out I believe and Baekhyun said in an interview that the drama shows what he and Sehun do in their real life. He seemed totally serious saying that and not joking at all. Also he said Sehun has a big dick. They’ve definitely had sex. Sehun- Gay. He literally said he liked men at a concert. He doesn’t seem interested in women. Baekhyun even said he’s not into girls. And I already explained what I think went on with him and Baekhyun. Sehun also starred in the Netflix variety show Busted and there was this scene where Sehun admited that he used his handsome face to swindle people, to this one of the guests asked him if he used his looks to swindle women out of money and Sehun replied with ''not women''. Tao- Gay. He just doesn’t seem into women but seems into men. Kai- bisexual. There’s a video of EXO performing in concert and D.O. is singing. It looks like Kai is staring at him. There’s a fan who yells “Jongin (Kai’s real name), he’s going to melt!” Some fans scream after that and laugh. Kai doesn’t laugh. He literally turned his head away from D.O. My guess is that he may try not to make his attraction to men noticeable but that doesn’t always work. GOT7 Bambam- Gay. Now, at first, I thought Bambam was straight. I didn’t want to generalize him simple because he has feminine mannerisms. I also assumed that he just liked skinship and he had to act like that towards the members for his job. While I do believe that kpop companies make these idols do fanservice, I do believe that Bambam is gay because now I noticed that he doesn’t seem into women and there’s this video of him dancing during a concert where he’s literally putting his hand to his mouth imitating giving a blowjob. That’s just not something straight men do. Here’s the link to the video (go to 0:20) to find the video of Bambam:  There is no heterosexual explanation for that. And no, I don’t believe JYP told Bambam to do this. Two of the other members are sitting to the right of Bambam. One of them is JB but I can’t tell who the other one is cause the vid is blurry. The other member laughs after Bambam imitates giving a blowjob while JB at first looks surprised and then laughs. Jackson- Bisexual. He may have a female preference. He honestly seems into both men and women and seems too comfortable doing gay fanservice stuff for a straight guy. IMFACT Ungjae- bisexual. He said his ideal type was a sexy guy. One of the other member’s says that Ungjae’s ideal type, who is a Korean male actor, is in a certain k-drama. When the members are sitting together in a V-live, one of them mentions that Ungjae’s sexual preference keeps changing. Ungjae says that he’s been single for awhile so maybe it can change. Jian- Gay. During a v-live, Ungjae says that Jian likes guys when Jian said his ideal type was a responsible girl. Jian said no and Ungjae said “You said you liked guys yesterday!” MBLAQ Lee Joon- Bisexual. He literally said in an interview that he had gfs and bfs. Monsta X Minhyuk- Gay. He doesn’t show any interest towards women but totally shows interest in men. He seems to enjoy doing affectionate fan service with his members which definitely isn’t straight. Lots of kpop idols feel uncomfortable during fan service like this as you can tell. However, it’s totally the opposite with Minhyuk. Wonho- bisexual. He literally said that gender doesn’t matter to him in relationships so he came out as bisexual. He also dated a trans guy before he medically transitioned. Some people may hate that I’m going to say this but I’ll say it: Most gay cis men don’t want to date trans men that haven’t medically transitioned at all. Straight men aren’t going to date trans men at any stage of their transition cause they’re men. However, this isn’t usually a problem for bisexual people. I know Wonho’s former label said that he dated the trans guy to protect him but I think they said that to cover up Wonho’s sexuality. NCT Taeyong- Gay. He literally said in an interview that he’s not interested in women. That’s basically coming out. He’s gotten flustered by men multiple times. I know there was the scandal involving him being homophobic in his school days. I honestly think he had a lot of internalized homophobia but is more comfortable with his sexuality nowadays. I know he’s related to Hong Suk Chung who is one of the few openly gay celebs in Korea and they didn’t find out they were related or met until 2018. Hong Suk Chung could’ve helped Taeyong become comfortable with his sexuality. Taeil- Bisexual. I’m pretty sure he said he’s fine dating a guy or girl. Yuta- Bisexual. He seems like he’s into both men and women. Ten- Gay. He’s obviously into men and not women. I know there was an interview with Ten’s high school teacher and she said he wasn’t into girls at school. Now, I know Thailand is more progressive on LGBT rights than Korea so maybe his teacher thought that would be ok to say? But Ten looked a bit surprised and nervous when she said that like he was concerned she was going to out him. Now onto his reaction to Hyunseung’s and Stephanie’s “Hit the Stage”. If you haven’t watched it, I suggest you should. The way he reacted to it definitely isn’t how a straight man would react to it. Some people may say “Well he didn’t want to make himself look bad and ogle her on camera”. Nah. He was pretty annoyed by the dance. The way he looked away from Stephanie basically screamed “OMG I can’t even”. Jaehyun- Gay. He seems to show interest in men but not women. And when Wonho complimented him, he got extremely flustered. Not something that would happen to a straight guy. When Johnny (who I believe is straight) got complimented by Wonho, he didn’t react in a way that would make people question his sexuality. Nu’est Ren- Gay. I am not saying this because he looks very feminine. The other members seem to protect him from questions about his ideal type. Now, why would they do this if Ren wasn’t gay? Also he has a tattoo of the lyrics “we are all born superstars” from Lady Gaga’s song “Born This Way”. This just isn’t a tattoo a straight man would get. Romeo Kangmin- Gay. This guy basically came out in an interview even though Korean media isn’t believing it. He said his ideal type is a cute and handsome man like him. It’s not a slip of the tongue because he wrote his answer down beforehand. Seventeen S. Coups.- Bisexual. He basically admitted he was bisexual in a song and I’ll get into my opinions on his relationship with Woozi when I talk about Woozi. Jun- Gay. He seems more into men than women and when I got into seventeen, Jun was the one that gave me the most gay vibes. Woozi- Bisexual. Woozi doesn’t seem to care about gender. Also there’s definitely something going on between Woozi and S. Coups. There are videos of them predebut of S. Coups holding Woozi and kissing him on the cheek but not in a way where they’re supposed to be doing fanservice. They seemed to have toned it down since debut probably due to not wanting to deal with assumptions and fans fetishizing their relationship. But Woozi doesn’t seem to like affection from anyone unless it’s S. Coups. That’s telling. The8- Bisexual. When asked his ideal type by Hoshi, he responded with “boy or girl”? He basically indirectly came out as bisexual. Shinee Key- Gay. . He just doesn’t show interest in women. Jonghyun (R.I.P.)- Bisexual. He seemed into both men and women. Stray kids Felix- bisexual. It’s pretty clear he’s into both men and women. At a fansign (and there’s a recording to prove this and it’s in English). A girl asked him what his ideal type was and he responded with “Boy or girl?”. She said both. He said his ideal type for a guy was someone who is dark and mysterious like Changbin. I have my opinions on whether Felix and Changbin had something going on and I’ll get onto them when I talk about Changbin. Changbin- gay. He doesn’t show interest in girls and I think it’s pretty clear he’s into men. I’m not one to ship idols together but I do believe Felix and Changbin have or had something going on. Just the way they would look at each other and act around each other seemed more than friendly. I know that idols do gay fan service but this seemed more than that. Also Felix called Changbin cute in an American interview (America isn’t big on fan service like Korea). Also Felix describing his ideal male type as basically Changbin? They either dated or are dating. It does seem like they toned it down a bit though. A few reasons could explain this: Changbin and Felix broke up.Changbin and Felix don’t want people assuming things about their relationship.Changbin and Felix are sick of fans fetishizing their relationship.Super Junior Heechul- Bisexual with male preference. I initially thought Heechul was fully gay. He never even denied the rumors about him being gay. But now that he’s dating Momo from Twice, I feel that he’s bisexual with a male preference. There are bisexual people who think they’re fully gay at first but then become romantically attracted to someone of the opposite gender. I think this happened in Heechul’s case. There are also bisexual people who think they’re fully straight but then become romantically attracted to someone of the same gender. Shindong- Bisexual. He said something about wanting the person that he dates to be pretty or handsome. I don’t think he was referring to women when he said handsome. Eunhyuk- Bisexual. He shows interest in men and women. Siwon- Gay. Ok I know he’s tweeted and said homophobic things. That doesn’t mean he’s not gay. I believe he is (or was) repressing his sexuality because he believes being lgbt is wrong. He’s has way too much fun with gay fan service for him to be straight. There are plenty of idols who are clearly uncomfortable with gay fanservice but Siwon isn’t. I hope he realizes (if he hasn’t already) that there’s nothing wrong with being LGBT and accepts his sexuality. If I’m wrong and he’s straight, I also hope he realizes there’s nothing wrong with being LGBT (if he hasn’t already). ZhouMi- Gay. He seems really into men but not into women. He only seems to like women as friends. Kibum- Bisexual. He seems to be into both genders. Also the letter he wrote describing Donghae definitely isn’t very straight. The Boyz Kevin- Gay. He shows no attraction to women but he seems into men. TVXQ Junsu- Gay. While he has said that he’s not gay, there are many factors to indicate that he is gay. He said that he feels good when people say he’s gay. Even straight men with no fragile masculinity don’t like people assuming they’re gay. He played a role in a musical where he had to kiss a guy. No, this doesn’t make him gay. There are straight men who have played gay male characters. I’m getting to what does indicate that he’s gay and how it relates to this musical. Junsu admitted that he wanted to kiss the man harder in the musical. I mean, that’d be an odd thing for a straight man to say. It seems like he really enjoyed the kiss. Straight male actors who play gay male characters and kiss them may not feel grossed out by it, but if they’re straight, why would they enjoy kissing men? On Junsu’s birthday in 2008 (there’s a video of this), the members gave him a shirt that says “Sorry girls, I’m gay.” One of the members said that she shirt is “very suitable for Junsu”. This indicates that Jungsu has come out to his members. TXT Soobin- Gay. He’s clearly into men and not women. Hueningkai- Gay. He’s always given me gay vibes and he doesn’t seem to be into women. Verivery Minchan- Bisexual. He seems to be into men and women. Kangmin- Gay. He seems very into men but not women. Victon Byungchan- Gay. He just seems very into men and not women. VIXX Ravi- Bisexual. He literally said that gender isn’t important in liking someone or in a relationship. It’s likely he was referring to his own experience as a bisexual. N- Gay. He seems more into men than women. And here are the members of girl groups that I think are LGBT: Blackpink Rose- Lesbian. She doesn’t seem super into men but she seems into women. There’s this one interview where she was being asked if she thought a male actor was cool. And she basically said yeah but then went on to talk about this female actress she said was really cute and who made her heart flutter. That sounds like she has a crush on this actress. The interviewer then asked Rose something alone the lines of “What about (insert male actor’s name)? A lot of people think he’s cool”. And then Rose was like “Yeah, he’s cool.” But she sounded uninterested in him. Also when blackpink were on Treasure Box, everyone seemed to be fangirling over the men except Rose. Rose even said “You guys love it so much!” when the other members were fangirling about the guys. This reminds me about how my past lesbian friends would react over me fangirling about my male crushes. Lisa- Bisexual. She seems pretty into men but I also think she could be into women. Her favorite song is “Honey” by Kehlani which is all about liking girls. I don’t think a straight woman would say that’s her favorite song. Busters Hyeongseo- Lesbian. She doesn’t show interest in men but she seems to show interest in women. Dreamcatcher Yooheon- bisexual. She was very specific about how she likes people and wasn’t mentioning genders. F(x) Amber- Lesbian. No, it’s not just because of her presentation but her presentation is a factor. Every single woman I’ve met who’s that masculine is lesbian or bisexual. This stereotype exists for a reason. Amber is friendly around guys but that’s it. Just friendly. She treats them like bros and that’s it. With women it’s different. Yeah, she’s friendly with them and I sense some attraction there. She also said she doesn’t care if people think she’s gay. I’ve never met a straight woman who doesn’t care if people think she’s gay. (G)-IDLE Soyeon- Bisexual with female preference. She wrote the lyrics for “Oh My God” and female pronouns are used. In the video for “Idle Song”, Soyeon goes to check out a girl and talks about wanting something fresh because her relationship with a man is getting boring. She also wore a shirt in the video that says I ❤️ boys I❤️girls multiple times. Shuahua- Lesbian. She seems very into women but not men. Miyeon- Lesbian. So she said she wants to date someone who looks like her. I just think that’s an odd thing for a straight girl to say. Girls Generation Taeyeon- Lesbian. She said the members could be the ideal types of both men and women. She also doesn’t seem into men. I think her relationship with Baekhyun was fake. It was probably a publicity stunt that backfired. Taeyeon said in an interview that she wanted to sing a song to someone to confess her love to. The interviewer asked if the person was a guy. Taeyeon laughed and said no. She also said in an interview that she had a crush on a girl. And of course the interviewer quickly changed the subject. ITZY Ryujin- Lesbian. She doesn’t seem into men. It’s pretty ckear she’s very into women. IZ*ONE Sakura- Bisexual with female preference. I think her female preference is pretty strong but she’d still date a man. In an interview in 2017, she said that “having a true relationship is loving the parter based on their ideas...Things like gender come after...I could happen to like a woman”. She said that looking at cute girls makes her feel better and that making a girl become super excited while cross dressing was really fun. She also said she would date Irene of Red Velvet but this was before all the stuff about Irene being rude to staff came out. Hyewon- Lesbian. She seems very into women but not men. Loona Yves- lesbian or bisexual. I don’t know if she’s into men but I’m certain she’s into women. Here’s what she said in her message to Sunmi: “i don't know if you know me, but i'm Yves from Loona, i saw you at the broadcasting studio that one time, you winked while looking my direction, but did i just imagine that? i couldn't sleep that night, i even wrote it in my diary. I'd like for it to be true, if it is, please wink at me next time too. I'll wink back at you\" This sounds like she has a crush on Sunmi. Mamamoo Moonbyul- Lesbian. She seems very into women but not men. Red Velvet Wendy- Bisexual. She seems to show interest in both men and women. Twice Nayeon- Bisexual with male preference. I think it’s pretty clear she’s into men. But she’s also said that she’d want to be reborn as a man so she would know what it’s like to have a girlfriend. There’s also a video of her trying to kiss Rose of Blackpink, who I believe is lesbian. Momo- Bisexual with female preference. I thought she was a lesbian until I found out she was dating Heechul. Honestly, Momo seems uninterested in all men except for Heechul. There is this video from a few years ago where the members were playing a game involving which male actor was her ideal type. Momo seemed bored and irritated while some of the members seemed interested in this game. Momo seems very into women though. As I talked about before, there are people who are gay or straight then find themselves attracted to someone of the gender they thought they weren’t into. I believe this happened with Momo when she started liking Heechul. It’s also possible Momo is more into feminine looking men and Heechul is more feminine looking. I had a friend who thought she was lesbian but then she started becoming attracted to more feminine looking men. At this fansign, Mina and Momo were doing the peppero game and Sana pushed their heads together making their lips touch just a little bit. Mina (who I believe is straight) looked super embarrassed (I’m sure her anxiety disorder contributed to that also) while Momo looked fake embarrassed and then just looked like “yeah, whatever”. When Momo was told to sing a song by JYP at this concert and she was supposed to say “I have a man”, she said “I have a woman instead” and didn’t change the pronouns. Even when a couple other members told her to change them while she was singing. Sana- Lesbian. She doesn’t seem very into guys. She also looked bored during that ideal type game. When Tzuyu (who I think is straight) was fangirling over male actors during the game, Sana said “It doesn’t matter. You can’t date them. It’s just a game”. Honestly, that sounds like something one of my past lesbian friends would’ve said to me when I was fangirling about my male crushes. She also said that when she watches tv, she’s more attracted to the women. No straight woman says this. Chaeyoung- Lesbian. She shows no interest in men but she’s obviously interested in women. She’s stared at female idols the way you would stare at your crush. She cut her hair because of Kristen Stewart. She enjoys being called a girl crush. She contributed to writing a song in one line is “I’m uninterested in men...I think puberty came late to me”. Yeah, not the straightest thing ever. She chose to perform “Born This Way” in Korea with a few other members. She chose the song. Wonder Girls Sunmi- Lesbian. She basically came out at a fan meet in Amsterdam. She said “I have may sides to me like dorky and LGBT. LGBT queen.” And then some seconds later she said “There are sides of me that I know very well like I just said”. Sunmi said after the concert that she’s not LGBT but LGBT supportive. I don’t believe this and I’ll explain why. It’s very possible JYP created this fake narrative to protect Sunmi’s career. Her career could’ve been over if the world knew she was gay. Yes, she called herself an LGBT queen in the video but she didn’t say wasn’t LGBT. She literally said that she has an LGBT side to her and that she knows that side very well. Straight women don’t say this. Also I’m sure Sunmi is sick of hiding her sexuality and felt comfortable coming out in Amsterdam because she knows how progressive it is and her fans would support her. And the fans were screaming with excitement after she said she has and LGBT side. Also it’s likely that she called herself an LGBT queen because she’s aware that a lot of kpop fans are hailing Sunmi as an LGBT queen. This isn’t the only reason why I think Sunmi is gay. I first thought she was LGBT when I watched the dance practices to Gashina and videos where she performed Gashina. The videos with the gender switch were different. Sunmi seemed much more comfortable and into it with the female dancers while she seemed robotic with the male dancers. And there are female idols that are comfortable with their male dancers and not robotic unlike Sunmi. When Sunmi is dancing with men, it’s like “Ok gotta pretend to be into men. Whatever it’s part of the job but not my jam.” When Sunmi is dancing with women it’s like “Yay, I get to dance with hot girls. This is totally my thing.” Yubin- Lesbian. Yubin posted online predebut saying this: “Any interested bitches contact me...so if you want to have some fun under me, try and seduce me now. You know I only want bottoms, right?” I mean come on, this screams gay. Here’s a soloist who I think is LGBT: Cheetah- Lesbian or bisexual. There are photos of her and a rumored girlfriend and the photos make them look like a couple. ",
            "date": "Updated October 31, 2020",
            "views": "19",
            "upvotes": " View 24 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Chang",
                    "user_href": "/profile/James-Chang-38"
                },
                {
                    "user_id": "Jennie Kim",
                    "user_href": "/profile/Jennie-Kim-208"
                },
                {
                    "user_id": "Veron Ong",
                    "user_href": "/profile/Veron-Ong-7"
                },
                {
                    "user_id": "Isabel Lopez",
                    "user_href": "/profile/Isabel-Lopez-333"
                },
                {
                    "user_id": "Ronwela Miralles",
                    "user_href": "/profile/Ronwela-Miralles"
                },
                {
                    "user_id": "Cross Jean",
                    "user_href": "/profile/Cross-Jean"
                },
                {
                    "user_id": "Theo Park",
                    "user_href": "/profile/Theo-Park-4"
                },
                {
                    "user_id": "Lara Chi",
                    "user_href": "/profile/Lara-Chi-1"
                },
                {
                    "user_id": "Karley Cox",
                    "user_href": "/profile/Karley-Cox-1"
                },
                {
                    "user_id": "Kallie Polk",
                    "user_href": "/profile/Kallie-Polk-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rosie Reyes",
                "href": "/profile/Rosie-Reyes-42"
            },
            "answer_text": "THESE ARE MY OPINIONS: Chaeyoung TWICE (lesbian) - y’all this is the most obvious one lol. I mean maybe I am wrong and she is straight but this woman loves women. She even had painted boobs on her nails. She watches mainly LGBTQ movies, hears many LGBTQ artist and songs, etc. Her Justin Bieber ‘Boyfriend’ cover she still used the same lyrics while Nayeon changed them to boy. At fan signs you can see the clear difference with her and fanboys vs fangirls lol. She also chose to perform ‘Born This Way’ despite South Korea being homophobic af! If there is one actually LGBTQ member of TWICE it’s gotta be Chaeyoung. Sorry Sana stans but I find Sana more clingy and loving due to the fact she is an only child and loves having friends who are like siblings :).    Ryujin ITZY (BI) - I mean she literally said on a show that she gave a JYP representative her number just bc she found her cute. Ryujin also screams BI vibes lol.    Moonbyul MAMAMOO (Lesbian) - Ik she dresses more tomboy out of comfort but like she literally subliminally flirts with all her fangirls. I can name more women in love with her then men lol. She smirks bc she knows we all dying of gay panics lol.    Wendy RED VELVET (non label) - Ik most ppl assume Irene bc she has a funny relationship with men but Wendy gives me open minded vibes. I feel like Wendy would be chill and open minded to dating a girl. I feel like she also wouldn’t have a label!    Sunmi (no label) - Ik Sunmi supports the LGBTQ community a lot but I feel she would also be open minded to dating a female. I feel bc how open and educated she is about the LGBTQ community she wouldn’t have a label as well.    BTS Suga (pan) - I feel Yoongi would only care about if they are a good person not the gender!    Wonho (Pan) - same with Yoongi I believe he only cares about personality!    Irene RED VELVET (aromantic & demisexual) - I don’t believe Irene is lesbian but I do think she is aromantic. I don’t think she really cares for love. I just think she’s too focused on her career and current life to be involved with love. Irene has men bowing down to her left and right but I don’t think Irene really has interest or care! She also may be aromantic due to the fact so many guys care more about her beauty then her as a person.    TWICE Tzuyu (aromantic) - same situation as Irene. Tzuyu has so many admirers but I just don’t think she really cares for any of that. Same with Irene she may feel or be this way bc too many ppl are invested in her beauty than her personality!    Sehun EXO (aromantic & asexual) - his own members talk about how sehun has no interest in dating or women. Sehun obviously has many female admirers but I don’t think he really cares or trips!    ",
            "date": "Updated October 25, 2020",
            "views": "561",
            "upvotes": " View 811 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Leah Zukowsky",
                    "user_href": "/profile/Leah-Zukowsky"
                },
                {
                    "user_id": "James Chang",
                    "user_href": "/profile/James-Chang-38"
                },
                {
                    "user_id": "Ronwela Miralles",
                    "user_href": "/profile/Ronwela-Miralles"
                },
                {
                    "user_id": "Camila Lugo Alvarez",
                    "user_href": "/profile/Camila-Lugo-Alvarez"
                },
                {
                    "user_id": "Hemanth Mateti",
                    "user_href": "/profile/Hemanth-Mateti"
                },
                {
                    "user_id": "Haru Reira",
                    "user_href": "/profile/Haru-Reira-1"
                },
                {
                    "user_id": "A Tomato",
                    "user_href": "/profile/A-Tomato-7"
                },
                {
                    "user_id": "Eva Andre",
                    "user_href": "/profile/Eva-Andre-1"
                },
                {
                    "user_id": "Lana Leljak",
                    "user_href": "/profile/Lana-Leljak"
                },
                {
                    "user_id": "Johannes Acuna",
                    "user_href": "/profile/Johannes-Acuna"
                }
            ]
        }
    ]
}