{
    "title": "Who was the greatest guitarist of the 80s? - Quora",
    "tags": [
        "Guitarists",
        "1980s",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Johann Von Staubig",
                "href": "/profile/Johann-Von-Staubig"
            },
            "answer_text": "Davey Johnstone.As a teenaged member of Murph and Shaggis then Draught Porridge playing guitar, Banjo ans Sitar he was act of the folk scene. His instrumental verbosity and skill made him an elite session player.After he’d joined Magna Carta he became skilled in transferring to the electric guitar. Even more session work was accomplished. He was asked to play on Bernie Taupin’s solo album by Magna Carta’s producer Gus Dudgeon who was to take on a new artist, Elton John.Elton loved Davie’s playing and his musical direction and he moved from Magna Carta to the Elton John band in the early ‘70s. Davey is still playing with him.In lulls between working with Elton, Davey has provided guitar work for (amongst others) Kiki Dee, Alice Cooper and Meatloaf.He has never been a Star but has been an interesting musician, enhancing but not taking over all the recordings he’s played on. Nor his live performances where he seems content to play out of the spotlight. ",
            "date": "Answered October 5, 2018",
            "views": "149",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chris Booth",
                    "user_href": "/profile/Chris-Booth-54"
                }
            ]
        },
        {
            "author_info": {
                "name": "Malcolm Minchin",
                "href": "/profile/Malcolm-Minchin"
            },
            "answer_text": "A lot of candidates for this accolade, the greatest guitarist of the 80’s. And I’m going to guess that the questioner means the 1980’s. The guitarist I’m picking has been active since the lat 1950’s, but involvement in a group in the 1980’s, where he’d previously found fame as a solo artist (though he was famed for wanting student guitarists to be taught how to play in an ensemble). Wrote and played famous film scores, worked with legends like Pete Townshend, Andre Previn and Julian Breem, trained under Segovia, I am of course talking about motherfucking John ‘Crocodile’ Williams. ",
            "date": "Answered October 5, 2018",
            "views": "38",
            "upvotes": "0"
        }
    ]
}