{
    "title": "Who is the fastest guitarist ever? - Quora",
    "tags": [
        "Guitarists",
        "Guitars",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Preetam Shetty",
                "href": "/profile/Preetam-Shetty-7"
            },
            "answer_text": "John McLaughlin really kickstarted the entire shred genre during the Mahavishnu Orchestra days. Edit 1: There were guitarists who played fast even before McLaughlin became famous (Ex: Lonnie Mack), but they never got the kind of fame or adulation that McLaughlin commanded at his peak. As far as speed is concerned, there are too many players to list here. Many of the guitarists mentioned in this thread (except McLaughlin and the flamenco players) came to prominence during the 80s. Those were the days where every guitarist in a rock band tried to play as fast as they could and the singers tried to sing as high as they could. Basically, these guys tried to outdo their idols (think Hendrix, blackmore, page etc.). Some of the standout shredders from the 80s include:Malmsteen (of course)Jason beckerChris ImpelliteriVinnie MooreRichie KotzenMichael Angelo BatioMarty FriedmanPaul Gilbert (legend - and probably one of the fastest ever)Greg HoweMichael Lee FirkinsVaiSatchand many more... I must have missed out atleast a 100 other names. And most of these guys played Hard Rock. Its not like the jazz world didn't have its share of speed freaks:Allan HoldsworthFrank GambaleShawn LaneBrett Garsed (not strictly jazz - but this guy has one of the best legato techniques after Holdsworth)Scott Henderson (pure freak - music his band 'Tribal Tech' still gives me the shivers)Steve Morse (Super Human Being - God of alternate picking)Al Di Meola ...these are just a few that I can remember of the top of my head right now. And then there were the blues players such as, Roy Buchanan, Stevie Ray Vaughn... and let's not forget the country and blues grass guitarists (remember Chet Atkins?). The realm of classical guitar and flamenco guitar are also chock full of fast players.  Music has obviously evolved a lot from the 80s. We still have speed freaks (probably faster then the 80s guys) but the emphasis is not on speed as much as it used to be. Some of the more gifted guitarists now actually started playing in the 80s. So, guys like John Petrucci, Michael Romeo, Jeff Loomis, Pat O'Brien (cannibal corpse anyone?) et al, are still playing music that has traces of the shred era. Some of the other less known or underrated guitarists that come my mind include Ron 'Bumblefoot' Thal (freak of nature - master technician and gifted composer) and Guthrie Govan (probably the most versatile modern guitarist). The point that I am trying to make is that -  there is no way to judge who is the fastest guitarist. There are just too many variations in technique, style, melodic knowledge, harmony etc etc. For example: you cannot compare fingerstyle guitarists with rock guitarist who play using a plectrum. Neither can you compare Allan Holdsworth's spidery odd-timed intervallic modal runs with a John Petrucci 3-note per string harmonic minor scalar runs. Plus, a guitarist might be good at playing single string stuff and suck at fast picked broken chords or arpeggios or tapping.  So, if you ask me, all this talk of fastest, greatest, is just that - talk. These distinctions actually don't translate well in real world terms. However, if you are trying to look for new virtuoso music or are generally interested in shred guitar, you should check this list: Need for Speed: The 50 Fastest Guitarists of All Time ",
            "date": "Answered December 3, 2015",
            "views": "28",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mike Reiss",
                    "user_href": "/profile/Mike-Reiss-2"
                },
                {
                    "user_id": "Olga Trucios Dona-Dio",
                    "user_href": "/profile/Olga-Trucios-Dona-Dio"
                },
                {
                    "user_id": "Víctor Andrés Tous Casamitjana",
                    "user_href": "/profile/Víctor-Andrés-Tous-Casamitjana-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nicolas Azéraut",
                "href": "/profile/Nicolas-Azéraut"
            },
            "answer_text": "A2A Thanks for asking, but I am afraid my answer will not be very informative. Bluntly put, I don’t care who is the fastest timed guitar player - is it even a thing? the fastest timed? who times a musician? To be perfectly honest, and despite the fact that I think and say and write that speed in music is pointless if it doesn’t serve an artistic purpose, the excited headbanging and wannabe rockstar kid in me can’t but take off and soar during every second of any solo played by Vinnie Moore, Eddie Van Halen, Randy Rhoads, Paul Gilbert or really any other shredding guitarist… But I know better now, and I value considerably more an expressive guitarist than a fast one. Playing fast is sometimes required, and then it is a capacity that any serious guitarist should have - to a certain extent, and with the ability to improve one’s speed if necessary by any amount of work. But playing like this guy…  Well, if you ask me I’ll stay with my BB King records. ",
            "date": "Answered August 22, 2018",
            "views": "385",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Rudy Kazudi",
                    "user_href": "/profile/Rudy-Kazudi"
                }
            ]
        }
    ]
}