{
    "title": "Who decided that black people would be known as African Americans? - Quora",
    "tags": [
        "African-American History",
        "Africans",
        "African Americans",
        "Black People",
        "Racism",
        "American Ethnicity and People",
        "History of the United States of America",
        "Race and Ethnicity",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Danny Hembree",
                "href": "/profile/Danny-Hembree"
            },
            "answer_text": "I don’t think it has been decided. Some people are into the Hyphenated-American thing. Some black people want to get back to their African roots but, for most, that’s not really possible. Black Americans have lived here for several centuries as have many whites and have no idea where there ancestors lived and what their culture was like. I think the hyphenated-American thing is a product of identity politics and is not of much use to Americans other than those who are descended from more recent migrations and can actually identify their origins. Black Americans have a lot more in common, culturally, with white Americans than their African ancestors. I use the term Black people based upon the notion that “Black is Beautiful”. I prefer to just refer to us all as Americans unless there is some compelling need to make a distinction. ",
            "date": "Answered June 1, 2020",
            "views": "783",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Thro",
                    "user_href": "/profile/John-Thro-2"
                },
                {
                    "user_id": "Natnael Musa",
                    "user_href": "/profile/Natnael-Musa"
                },
                {
                    "user_id": "Daniel Issaks Rubin",
                    "user_href": "/profile/Daniel-Issaks-Rubin"
                },
                {
                    "user_id": "Shirl Werner",
                    "user_href": "/profile/Shirl-Werner"
                },
                {
                    "user_id": "Rob White",
                    "user_href": "/profile/Rob-White-63"
                },
                {
                    "user_id": "László Pál",
                    "user_href": "/profile/László-Pál-1"
                },
                {
                    "user_id": "Peter Rose",
                    "user_href": "/profile/Peter-Rose-37"
                },
                {
                    "user_id": "Dineo Poo",
                    "user_href": "/profile/Dineo-Poo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Saroch",
                "href": "/profile/Tom-Saroch"
            },
            "answer_text": "Chinese Germans I guess. To much of this bull shit. Why do we have to label things to create a lot of these problems. Where either African, Italian, French , or what ever. If your American, your American . Some ass hole always wants to create problems. Why not just try getting along with each other like God intended, it’s really not that hard. Respect each other for who we are, forget about labels. Stop all the double standards. A person can be African American or Mexican American, but why can’t he be Swiss American. Hell if somebody said he was Swiss American they might think he was full of holes and put him on a sandwich thinking he was cheese. So you see, like I said all these labels are pure bull shit and do nothing but stir up trouble. Let’s call Japanese folks yellow Americans. I remember when some people in America were called black Americans. Bull ! ",
            "date": "Answered June 1, 2020",
            "views": "452",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Thro",
                    "user_href": "/profile/John-Thro-2"
                },
                {
                    "user_id": "Eugene Craddock",
                    "user_href": "/profile/Eugene-Craddock"
                },
                {
                    "user_id": "Charles Yesudas",
                    "user_href": "/profile/Charles-Yesudas"
                }
            ]
        }
    ]
}