{
    "title": "Who is better, Eminem or Rap Monster? - Quora",
    "tags": [
        "RM (BTS member)",
        "Eminem (musician)",
        "Rap Music",
        "Hip Hop and Rap Artists"
    ],
    "response": [
        {
            "author_info": {
                "name": "Krystyna Black",
                "href": "/profile/Krystyna-Black-1"
            },
            "answer_text": "Eminem, easily. I assume you are asking who is better as a rapper. I say Eminem because of his strong delivery, rhymes, punchlines, vast discography, incredibly honest music and the fact that he made rap music mainstream. Almost single-handedly. I’ve heard every track released by RM, including all his covers and both his mixtapes. I’ve also heard almost all of BTS’s rap-heavy songs. I’ve seen lyrics videos and explanations videos, and watched a few of his lives where he explains behind-the-album process, so this is not an uninformed or biased answer. RM is definitely skilled in wordplay and delivery, but unlike Eminem, he’s 25. He doesn’t have half the experience or practise, and never will. He hasn’t focused solely on rap, instead he went into production and composition of electronic pop music. As an idol he also spends several hours a day dancing and working out, time which Eminem at the same age likely spent writing and rapping. Obviously Eminem is better at what he does. Another big factor is that RM cannot release music that is too honest or direct. Sure, he keeps it real but at the end of the day he is an idol tied by contracts and industry rules and has an image to maintain. Eminem gives zero fucks about image, hence what we get from him is raw, uncensored music, making it all the more amazing. He thinks Trump is shit? He’ll rap that. He thinks gun laws need to change? He’ll put it in writing in his music video while recreating the Las Vegas shooting. There’s no opinion he’s afraid to express. The most direct RM can get is talk about haters, the dark side of fame and how BTS has worked hard to succeed. Which, fair. But there’s more in his world he should be making music about and can’t. I don’t doubt RM’s passion for rap at all, but he’s simply not on the same level as Eminem. In fact, Eminem is probably still an idol figure to him. Thanks for reading :) ",
            "date": "Answered March 11, 2020",
            "views": "184",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aditya Tiwari",
                    "user_href": "/profile/Aditya-Tiwari-1156"
                },
                {
                    "user_id": "Roobin Mogor",
                    "user_href": "/profile/Roobin-Mogor"
                },
                {
                    "user_id": "Farah Nauqiah",
                    "user_href": "/profile/Farah-Nauqiah"
                },
                {
                    "user_id": "Sukanya Sengupta",
                    "user_href": "/profile/Sukanya-Sengupta-5"
                },
                {
                    "user_id": "Ronit Rajesh",
                    "user_href": "/profile/Ronit-Rajesh-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fiona Blue",
                "href": "/profile/Fiona-Blue-4"
            },
            "answer_text": "I don’t think they can be compared as their styles or songs’ concepts don’t have much in common. It’s like comparing Adele and Beyonce. They seem to be often on similar concepts, overall. But when you compare their styles in singing or lyrics. it’s not the least bit similar. A lot of artists may pursue similar concepts, but the way they breathe life into those concepts, is extremely different. When it comes to majority of songs that doesn’t have a lot of roughness and mostly about specific yet common emotional issues, I’d prefer RM. But for songs that have more fierceness along with deep lyrics, I’d prefer Eminem. But overall, I have never preferred one artist over another. I’d rather prefer some of their own songs over another. Like, Eminem’s “mockingbird” over “rap god”. RM’s “Moonchild” over “Joke”. (Unless I feel like murdering someone, then it’s Rap God and Joke). But if u look at RM himself, he’d prefer Eminem. Someone else here has already explained this, but once again, Eminem is someone RM looks up to. That is another proof to any RM fans who don’t know Eminem, that Eminem is truly a ”rap god” . -I physically felt my lifespan decrease as I typed that reference- Hence it comes down to what you prefer the most in rap songs. Not just what others think. After all, we call it as a “personal” preference. It really is simply a matter of personal taste. ",
            "date": "Answered March 12, 2020",
            "views": "49",
            "upvotes": "0"
        }
    ]
}