{
    "title": "Who makes better music (not the best rapper), Kanye West or Eminem? - Quora",
    "tags": [
        "Eminem (musician)",
        "Kanye West (musician)",
        "Rap Music",
        "Hip Hop and Rap Artists",
        "Hip Hop Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Jacobs",
                "href": "/profile/John-Jacobs-286"
            },
            "answer_text": "Kanye West. Listen, I fucking hate Kanye now. Can’t stand him. Haven’t been able to stand him since he dropped yeezus. Why name your album yeezus? Weird name, okay. The music, experimental, some good some bad but whatever. But COLLEGE DROPOUT. Holy shit. If you’ve listened to this album straight through front to back, all in one sitting, loud speakers and everything, kush clouds around, then you know what I’m talking about. God damn. I actually turned it on right now so I can finish this answer, and don’t worry I’ll talk about Eminem too. Kanye did the unthinkable at the time. This guy made his beats and rapped over them. He wasn’t just a producer, he was a rapper. And vice versa. Do you have any idea the amount of creative vision that he had and was able to manifest? He could write raps first then make a beat, or do the opposite as well. He was a true artist. Jay z actually wanted him originally just for his beats, by kanye wanted to rap too, so jay z let him. Have you heard “breathe in, breathe out” on CD. The cohesion of the lyrics and the beat is unparalleled, at least in songs I’ve heard. Eminem is honestly in my opinion, a niche rapper. He’s really good, REALLY REALLY good. But Eminem’s music was so rebellious when he came out, cause it had to be. He was the first big, legit, white rapper. He had to be hard. He had to really be good and edgy, so he would be taken seriously. He’s basically the father of all the white rappers you see today, cause without him they would definitely not be able to do what they’re doing now. Eminem is just a rapper, I’m sure he produces now, but NOBODY did what Kanye did and did it as well. There are countless beats I can list that are great as instrumentals, as well as the actual sosngs. His lyrics are amazing too. There’s a lot of personal things he talks about in his music, and it really helps his relatablity. Eminem is mostly one view, being the first of his kind. I can relate with Kanye more about his dad telling him to not buy clothes I can with Eminem who rapped about some crazy shit when he first came out. Kanye hands down. ",
            "date": "Answered September 2, 2018",
            "views": "45",
            "upvotes": " View 23 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shehryar Khan",
                    "user_href": "/profile/Shehryar-Khan-33"
                },
                {
                    "user_id": "Rahul Bhardwaj",
                    "user_href": "/profile/Rahul-Bhardwaj-683"
                },
                {
                    "user_id": "Vaibhav Sharma",
                    "user_href": "/profile/Vaibhav-Sharma-158"
                },
                {
                    "user_id": "Taylor Prescott",
                    "user_href": "/profile/Taylor-Prescott-6"
                },
                {
                    "user_id": "Anup Ghosh",
                    "user_href": "/profile/Anup-Ghosh-105"
                },
                {
                    "user_id": "Phuoc` Minh",
                    "user_href": "/profile/Phuoc-Minh-1"
                },
                {
                    "user_id": "Lekhotla Mafisa",
                    "user_href": "/profile/Lekhotla-Mafisa"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Thompson-59"
                },
                {
                    "user_id": "Danish Tan",
                    "user_href": "/profile/Danish-Tan-1"
                },
                {
                    "user_id": "Sreenivasulu Pogunul",
                    "user_href": "/profile/Sreenivasulu-Pogunul"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ingrid Nozahic",
                "href": "/profile/Ingrid-Nozahic"
            },
            "answer_text": "Eminem is probably in the top 3 well respected rappers alive today. Nobody would claim that he isnt proficient, successful and legendary in the Hip Hop community and even the world. Kanye on the other hand admits to not being anywhere near the best rapper but he is an absolute genius and inspirational among his peers. He has a feel for music that penetrates the soul. He knows how to go way past the safety zone and produce innovative sounds, samples and songs that work. Kanye does not have a safety zone, he does what he feels. When friends have asked me how I can like that arrogant idiot I show them Runaway as an intro to his work. It NEVER fails. Not everything he does works, indeed not everything he says either! However he is willing to put it out there. Genius has its price and he is affected by his bi-polar which leads to outrageously extreme emotions both negative and positive. I can’t compare Eminem to Kanye - in terms of the music they put out Kanye is light years ahead. Eminem has inspired so many rappers today and I don’t want to put him down but his sphere of influence is limited. ",
            "date": "Answered September 1, 2018",
            "views": "14",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anusha Ramu",
                    "user_href": "/profile/Anusha-Ramu-8"
                },
                {
                    "user_id": "Danish Tan",
                    "user_href": "/profile/Danish-Tan-1"
                },
                {
                    "user_id": "Ahmet Özkan",
                    "user_href": "/profile/Ahmet-Özkan-6"
                },
                {
                    "user_id": "T Prez",
                    "user_href": "/profile/T-Prez-1"
                },
                {
                    "user_id": "Dinesh Dkm",
                    "user_href": "/profile/Dinesh-Dkm"
                },
                {
                    "user_id": "Arnab Johar",
                    "user_href": "/profile/Arnab-Johar"
                },
                {
                    "user_id": "Antariksha Kumar",
                    "user_href": "/profile/Antariksha-Kumar-2"
                },
                {
                    "user_id": "Taylor Prescott",
                    "user_href": "/profile/Taylor-Prescott-6"
                },
                {
                    "user_id": "Chris Miller",
                    "user_href": "/profile/Chris-Miller-941"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Multidimensionnelle-Morel"
                }
            ]
        }
    ]
}