{
    "title": "Who won the October 22nd presidential debate? - Quora",
    "tags": [
        "2012 US Presidential Debates",
        "2012 U.S. Presidential Election",
        "Mitt Romney (politician)",
        "Barack Obama (politician)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Greg Lovern",
                "href": "/profile/Greg-Lovern-1"
            },
            "answer_text": "On the principle that winning a presidential debate means winning votes, I don’t think either one of them won this debate. I think Trump pleased his voters, and Biden satisfied his, but I really have a hard time imagining that either one of them won a single new vote during this debate. On the other hand, Kristen Welker — wow! If she wasn’t hands down the best moderator ever with a difficult participant, I’d like to know who was. To be fair to Chris Wallace, Trump wasn’t nearly as obnoxious tonight as he was in the first debate. But he was still pretty bad. Welker did a very impressive job of persistently bringing him back on topic, but never argued with him on the facts. She was fair to both of them but vigorously stayed in control, though Trump still occasionally got away from her and ran off the rails. And somehow she even managed to be pleasant the whole time, too! I thought her performance was frankly amazing. Trump forcefully landed a lot of points that no doubt meant a lot to his voters who either don’t know or don’t care that he was lying. Most of what Trump said during the debate was lies or at least highly misleading. As always over the last four years, one of the most interesting questions for me is whether, and to what extent, he believes his own lies. Because really, truly, sincerely seems to believe them. Biden often had a worried expression, looked down a lot, and often struggled to express himself. Sometimes it was hard to understand what point he was trying to make. He came across as old. He was like your elderly relative who you lately sometimes have a hard time communicating with. Not senile though. The mental clarity was obviously there; just not always expressed expeditiously. To the attentive listener, Biden made good points. But a better debater would have made those points more clearly. One point that struck me during this debate was that Trump’s incessant interruptions in the first debate probably to some extent covered up for Biden’s difficulty in expressing himself, thus making Biden look better. This time we got a better picture of Biden. Biden would have done far better to stop worrying about Trump’s lies and just flash that megawatt smile. The more egregiously Trump lied, the bigger he should have smiled. And sometimes laughed. He would have come across as the good-natured, unflappable guy we want so much to replace Trump. Instead he more often came across as fussy and anxious. When he did flash that smile and laugh, it worked well. If this debate moves the polling needle significantly, I’ll be surprised. The main result I’d expect of this debate is for it to catapult Kristen Welker into near celebrity status. ",
            "date": "Answered October 23, 2020",
            "views": "93",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lorraine Stephen",
                    "user_href": "/profile/Lorraine-Stephen-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Alexander",
                "href": "/profile/Bill-Alexander-31"
            },
            "answer_text": "If you have already voted for Joe Biden, then of course, Biden Won. If you were on of the millions in the Trump camp, then of course, Trump won. The winner write the history. Not the losers. I think Abe Lincoln summed it up best when he said; “One of the most famous sayings attributed to Abraham Lincoln is about deception: You can fool all the people some of the time and some of the people all the time, but you cannot fool all the people all the time” The debate was not about who the best candidate was, it was all about what was kept from the voting public. It’s called censorship and it is alive and well in America. We saw it up and front last week when three of the biggest Tech Giants known to mankind took away your right to read something they didn’t like. Oh, they said it was all about someones laptop being hacked or that it had been discredited but I have not heard one person deny ownership and the real owner hired an attorney to get it back. That’s sort of like admitting it is yours,. Here is the deal, America is not blind. It is not stupid. It will indeed get the truth. It lit up the internet. It went viral. I have already read some of the emails and I didn’t have to look very deep. I already saw a total violation of the law on video where a speaker bragged about being so powerful that he could with hold Billions of Dollars from a Government who sorely needed it to rebuild a country that needed rebuilding. He said if a prosecutor didn’t get fired, the money would be with held. If you didn’t believe him, call the President. That’s on tape. Case you missed it, take a look.  Oh, my post will be limited. Most of you will never get a chance to read it or view the video,. That’s how censorship works. Who won the debate tonight? That isn’t the question. The question should be who is going to allow the continuation of your rights to be eroded over the next four years? Who is going to take those rights away and who is going to give you solace as you lose everything. The economy got shut down. One of those guys promised to shut it down again and one said he would not. Be careful who you vote for. Be very careful. Your freedoms are at stake. They are already being taken away from you. Be scared, be very scared. ",
            "date": "Answered October 22, 2020",
            "views": "53",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sudarshan Rao",
                    "user_href": "/profile/Sudarshan-Rao-55"
                },
                {
                    "user_id": "William Burke",
                    "user_href": "/profile/William-Burke-203"
                }
            ]
        }
    ]
}