{
    "title": "Who is a singer that has a similar singing style to Amy Winehouse? - Quora",
    "tags": [
        "Amy Winehouse (musician)",
        "Music Recommendations",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Frank Erfurth",
                "href": "/profile/Frank-Erfurth"
            },
            "answer_text": "I assume you are looking for someone who does the same sort of things with her voice, not someone with a similar pitch, timbre etc.  Look for jazz recordings of female artists to hear the same kind of runs and attitude that Ms. Winehouse infused her songs with.  I would suggest Ella Fitzgerald, Nina Simone, Sarah Vaughan, Billy Holiday, Etta Jones, Paula West to name just a few.  If you like that fusion of jazz and pop, try Duffy or Adele.  If you want something even more towards the pop/R&B side, try Macy Gray or Erykah Badu.   Here are a few songs to look at: Nina Simone - SinnermanPaula West - The SnakeBilly Holiday - SugarEtta Jones - My Gentleman FriendSarah Vaughan - Whatever Lola WantsElla Fitzgerald - Bewitched Bothered and BewilderedDuffy - RockferryAdele - Rumor Has ItMacy Gray - I TryErykah Badu - Hey Sugah ",
            "date": "Answered December 2, 2014",
            "views": "21",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Karlotta Meyer",
                    "user_href": "/profile/Karlotta-Meyer-1"
                },
                {
                    "user_id": "Billie Crowley",
                    "user_href": "/profile/Billie-Crowley"
                },
                {
                    "user_id": "Erin Quinn",
                    "user_href": "/profile/Erin-Quinn-24"
                },
                {
                    "user_id": "Alexis Bur",
                    "user_href": "/profile/Alexis-Bur"
                },
                {
                    "user_id": "Michaele Hannemann",
                    "user_href": "/profile/Michaele-Hannemann"
                },
                {
                    "user_id": "Ty Buxton",
                    "user_href": "/profile/Ty-Buxton-3"
                },
                {
                    "user_id": "Daniel Meltzer",
                    "user_href": "/profile/Daniel-Meltzer-4"
                },
                {
                    "user_id": "Seth Memol",
                    "user_href": "/profile/Seth-Memol"
                },
                {
                    "user_id": "Dennie Peterson",
                    "user_href": "/profile/Dennie-Peterson"
                },
                {
                    "user_id": "Sandra Evans",
                    "user_href": "/profile/Sandra-Evans-67"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tamara Batty",
                "href": "/profile/Tamara-Batty-1"
            },
            "answer_text": "You are right in saying that it is impossible to find someone with the same voice as Amy Winehouse. She had the most unique voice and it is a shame that she didn’t have enough time to use it for longer! Winehouse was very influenced by jazz and soul music and she did study jazz music for a while and you can hear it in her music: the rhythms and chords she uses are very jazz-infused, as well as her singing style. So I would say that these classic jazz singers are ones to enjoy as I thoroughly enjoy listening to them as I thoroughly enjoy listening to Amy Winehouse: Nina SimoneElla FitzgeraldBillie HolidayAretha FranklinOf course these singers won’t have the same voice as Amy, but the styles are similar and they are amazing musicians in their own right. I hope these are singers you will come to enjoy! ",
            "date": "Answered April 24, 2017",
            "views": "58",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Billie Crowley",
                    "user_href": "/profile/Billie-Crowley"
                },
                {
                    "user_id": "Ivan Drek",
                    "user_href": "/profile/Ivan-Drek"
                },
                {
                    "user_id": "Jay Levine",
                    "user_href": "/profile/Jay-Levine-6"
                },
                {
                    "user_id": "Brandon Lo",
                    "user_href": "/profile/Brandon-Lo-19"
                },
                {
                    "user_id": "Ionut Apetrei",
                    "user_href": "/profile/Ionut-Apetrei"
                },
                {
                    "user_id": "Ty Buxton",
                    "user_href": "/profile/Ty-Buxton-3"
                },
                {
                    "user_id": "Dennie Peterson",
                    "user_href": "/profile/Dennie-Peterson"
                }
            ]
        }
    ]
}