{
    "title": "Who is 'Becky with the good hair' mentioned in Beyonce's song 'Sorry'? - Quora",
    "tags": [
        "Sorry (Beyonce song)",
        "Lemonade (2016 album)",
        "Beyoncé (musician)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marc Bodnick",
                "href": "/profile/Marc-Bodnick"
            },
            "answer_text": "The internet is discussing a couple of possibilities. 1. Fashion designer Rachel Ray Rachel Ray denies that she is Becky, but who knows. Vox has a good post on this. Key excerpt: Who is Rachel Roy? And is she Becky? Roy is probably best known for being a fashion designer who's made multiple appearances on Project Runway and appearances on Keeping Up with the Kardashians. Unless you're into fashion or reality television, you probably have no idea who she is. But to faithful members of the Beyhive, Roy has been floating around in Beyoncé's orbit as a second-tier villain for the last couple of years. Roy's origin story with music's most powerful couple begins with her stint as an intern at Jay Z's clothing line Rocawear after she finished college (around 1996). According to Teen Vogue, she worked in every department, and eventually worked her way up to become a creative director. This plays into Roy's role in the Great Elevator Fight of 2014, when Beyoncé's sister Solange infamously attacked Jay Z while the two shared an elevator after the Met Ball. Make no mistake, Roy wasn't in the elevator when everything went down. But her existence may have spurred Solange's attack on Jay. Everyone knows what happened in the elevator. Leaked security video of the fight — which showed Solange attacking Jay Z — went viral online. And Beyoncé later addressed the incident in the remix to her song \"Flawless,\"where she talks about shit going down when there's a \"billion dollars in an elevator.\" But there's a secondary story from that same night that never received as much attention: Solange had a run-in with Roy before she got into that fateful elevator. At the time, US Weekly reported that Beyoncé got involved, but it wasn't clear what was said or why the two fought. Later, The Daily News reported that Solange fought with Jay because of Roy and Jay Z's working relationship possibly becoming more. \"Rachel is a little too close to Jay Z,\" the Daily News's source said. \"Solange doesn’t like it, and Beyoncé doesn’t like it.\" Meanwhile, Wendy Williams connected the dots and alleged that Roy and Jay may have had a sexual relationship when she was an intern at Rocawear, suggesting that something like a flirty look or a greeting that was a little too comfortable set Solange off at the Met Ball party: Fast forward to 2016 and \"Becky with the good hair,\" and this theory that Roy is Becky begins to make sense. She has pretty hair that looks nice, which she touts as her most remarkable feature. She wrote a message about said hair hours after Beyoncé'sLemonade premiere. She used some of the same phrasing Beyoncé used to describe said hair. She has prior drama with the Knowles family. And if Lemonade is seen as Beyoncé addressing that fight and the rift with her relationship with Jay Z, then everything about Roy being \"Becky\" locks into place. What's more uncertain at this point is why the spirit moved Roy to post that Instagram picture with that caption. Was it a cry for attention? Does she have bad friends who encouraged her to do it? Is she not of sound mind? Source: Beyoncé's Lemonade: Is Rachel Roy \"Becky with the good hair?\" 2. British singer Rita Ora Per CNN: The Internet is also speculating that \"Becky\" could be British singer Rita Ora. In 2008, the singer signed with Roc Nation, the record label owned by Jay Z. She also made a cameo in his \"Forever Young\" music video the following year. But what got fans buzzing was her recent appearance wearing a Gucci outfit Beyonce sported in her \"Formation\" music video and a Snapchat of Ora wearing a bra that featured lemons. Needless to say, Beyonce fans took it personally and went after Ora, who is also an actress who will next be seen in the \"50 Shades of Grey\" sequel. All of that, coupled with the fact that Ora posted a photo from the 1973 film \"Ash Wednesday,\" was enough to start tongues wagging. The film, starring Elizabeth Taylor, is about a woman who undergoes plastic surgery in an attempt to save her marriage. ",
            "date": "Answered April 27, 2016",
            "views": "13",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anne Runge",
                    "user_href": "/profile/Anne-Runge"
                },
                {
                    "user_id": "King Kagem",
                    "user_href": "/profile/King-Kagem"
                },
                {
                    "user_id": "Veni Johanna",
                    "user_href": "/profile/Veni-Johanna"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Painter",
                "href": "/profile/Jon-Painter"
            },
            "answer_text": "I'll advance the hypothesis that this is not an individual. Beyoncé is tackling a historical coded paradigm.  It's not my experience or story, so I'll turn to MTV's Rebecca Thomas: \"The idea of good hair actually has its roots in slavery, when white owners would deliberately separate and assign slaves with light skin and straighter “good hair” to household work, leaving the punishing field work to those with darker skin and kinky African hair. In their essential guide, Hair Story, authors Ayana Byrd and Lori Tharps explain what happened next and for generations to come: 'Black people themselves internalized the concept … [and] propagated the notion that darker-skinned Blacks with kinkier hair were less attractive, less intelligent, and worth less than their lighter-hued brothers and sisters.' ... So when Beyonce tells her cheating man he “better call Becky with the good hair,” she’s nodding to our historical baggage and signifying far more than just a girl with a bouncy blowout.\" Beyoncé’s Lemonade And What Black Girls Really Mean By ‘Good Hair’ ",
            "date": "Answered April 27, 2016",
            "views": "850",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kris Oliver",
                    "user_href": "/profile/Kris-Oliver-17"
                },
                {
                    "user_id": "Anne Runge",
                    "user_href": "/profile/Anne-Runge"
                },
                {
                    "user_id": "Viola Yee",
                    "user_href": "/profile/Viola-Yee"
                },
                {
                    "user_id": "Adria Henderson",
                    "user_href": "/profile/Adria-Henderson"
                },
                {
                    "user_id": "Tess Holmes",
                    "user_href": "/profile/Tess-Holmes-1"
                },
                {
                    "user_id": "Amarie Nicole",
                    "user_href": "/profile/Amarie-Nicole"
                },
                {
                    "user_id": "Holly Root-Gutteridge",
                    "user_href": "/profile/Holly-Root-Gutteridge"
                },
                {
                    "user_id": "Ken Fishkin",
                    "user_href": "/profile/Ken-Fishkin"
                },
                {
                    "user_id": "Marc Bodnick",
                    "user_href": "/profile/Marc-Bodnick"
                }
            ]
        }
    ]
}