{
    "title": "Who has more personality bts or blackpink? - Quora",
    "tags": [
        "BLACKPINK",
        "BTS (K-pop group)",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Destiny Jones",
                "href": "/profile/Destiny-Jones-451"
            },
            "answer_text": "Judging because there is not that much blackpink content only blackpink house, lives and the 365 thing. So I think blackpink is fake in a way I’m not sure how to put my emotions together on them but Lisa is the fakest out of them. so I’m gonna go with BTS on this one they are always congratulating us on THEIR achievements of course they don’t tell us everything but they show more of themselves and we can kinda tell (if you watch enough bts content) what type of people they are. Namjoon- he’s a caring person he seems very understanding. But he can get annoyed at times you can see it in the mans eyes lol 😂 but that’s ok we are all human. There’s not much to say about namjoon I can definitely trust him with my life tho he just seems so genuine. BTS- Seokjin- he is an extrovert. He doesn’t tell us much about his personal life definitely not a problem tho. He seems like a mood maker along with hobi and jimin for the group. He is really funny I love him for that he is the real savage in the group he says he didn’t listen to the company. Yoongi- it’s not a shocker that yoongi is also and introvert. He is also really funny in my opinion. He is definitely more on the closed off side when it comes to personal issues tho and that is fine I just hope he doesn’t bottle up his emotions. 2nd most savage in the group definitely. Hoseok- he is definitely and extrovert he doesn’t seem fake honestly just because he doesn’t smile sometimes doesn’t mean anything I’ve said this before and I’ll say it again WE ARE ALL HUMANS. We know a little about his family like his sisters IG. A lot of ARMY follows her in there. Other than that he just wants our love and happiness so let’s just appreciate him. Jimin-he is definitely an extrovert maybe an ambivert. Jimin i think he still may have body image issues but I don’t want to assume anything I just hope that he is healthy and taking care of himself. Jimin tells us a lot about himself he is also my bias. But he can sometimes be a little to much and that is because he is a people pleaser he just wants our validation and love. He sometimes wants attention but there is nothing wrong with that. Taehyung- in the beginning of the year up until like may he seemed a bit sad but now he is happier and i am very happy to see that. It’s no doubt that he has changed and I am fine with that as long as he is comfortable in his own skin no one should have any problems. He shares a lot with us as well which is cool he has an aesthetic personality his music taste is immaculate and he likes to do arts and he has a really unique voice. Jungkook- now jungkook has been through a lot this past year but still shows us the good side of himself. I think he just needed a break to distance himself and i am proud of him for doing that. His personality tho he is definitely an introvert he keeps to himself but shares things with us as well and it’s clear that he loves us a lot. So I can definitely say he is genuinely BLACKPINK- Jisoo- by far the realest member of blackpink. I can tell she really does love the members and that is what I like about her she is so genuine and really cute. I’m still waiting for actor sooya. There isn’t really much to her I like her a lot tho and she seems like a likable person she doesn’t really share any other info. Jennie- by acknowledging her you can most definitely tell she’s sick of YG’s bs. She wants to do more with her life than be used once or twice a year and that is why I feel she sometimes rebels the company. But she is a bit sus I can’t point my finger on it but idk why some people find her to be a bxtch she is really cute and funny maybe it’s her RBF. Other than that Jennie just wants to do more than what she does but they are stuck in YG’s dungeon. Chaeyoung- I can tell she wants to take music to the next level but YG is holding not only her but the other girls back from doing that think about it. Jisoo could have been and actor doing way more with her life right now than wasting time on YG. Anyways sorry about that back to Rosé she is definitely the one most passionate about music and she is also really funny too so to me her and jisoo seem the most real. And did I mention she is really pretty. Lalisa- I cant say I exactly like her but she isn’t that bad I just can’t seem to like her like the others. I like her rapping because her voice has that charisma in it but Jennie has a better flow but her raps are still enjoyable. But one thing I absolutely dislike is her aegyo it just makes me cringe to the max she’s cute and all but when she talks in a baby voice god I just can’t. Other than that I don’t think she is as interested in music as the others it’s clear her strong suit is dancing so I think after blackpink she’ll do more of her own dancing thing. That’s about it other than she has to big of an ego and it irks me like she’s better than everyone else. Idk she’s sus too. Anyways sorry if that was too long I just like bts more as people blackpink is good to I just want them to be more open with their music and personas I don’t mean to offend anyone either. anyways stan BTS stan BLACKPINK   ",
            "date": "Updated September 6, 2020",
            "views": "2",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Elva Zheng",
                    "user_href": "/profile/Elva-Zheng-5"
                },
                {
                    "user_id": "Sehun Min",
                    "user_href": "/profile/Sehun-Min-1"
                },
                {
                    "user_id": "Cassie Valentine",
                    "user_href": "/profile/Cassie-Valentine-7"
                },
                {
                    "user_id": "Jasmine Morelli",
                    "user_href": "/profile/Jasmine-Morelli"
                },
                {
                    "user_id": "Jenam Kodak",
                    "user_href": "/profile/Jenam-Kodak"
                },
                {
                    "user_id": "Blair Waldorf",
                    "user_href": "/profile/Blair-Waldorf-132"
                },
                {
                    "user_id": "Tara Leonard",
                    "user_href": "/profile/Tara-Leonard-22"
                },
                {
                    "user_id": "Taylor Masters",
                    "user_href": "/profile/Taylor-Masters-23"
                },
                {
                    "user_id": "Triin Michelson",
                    "user_href": "/profile/Triin-Michelson"
                },
                {
                    "user_id": "Shuchita Sarawade",
                    "user_href": "/profile/Shuchita-Sarawade"
                }
            ]
        },
        {
            "author_info": {
                "name": "Selene Sara",
                "href": "/profile/Selene-Sara"
            },
            "answer_text": "Both of them have, both are humans only. Stop discriminating between them. Both groups worked hard to reach where they are today. If you have seen the reality shows of both the groups( Run BTS, Break the Silence, Blackpink House,24/364 with Blackpink and Blackpink diaries ). These kind of questions are the ones that start fan wars between Blinks and Armies,so please don ask this kind again, I know that you may have not meant to ask it purposely All of them have fun personalities and are nice people both have contributed to various Charity cases too. So both have personalities. stay safe and take care bye ",
            "date": "Answered September 5, 2020",
            "views": "133",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sweeyener",
                    "user_href": "/profile/Sweeyener"
                },
                {
                    "user_id": "Jasmine Hath",
                    "user_href": "/profile/Jasmine-Hath"
                },
                {
                    "user_id": "Ava Nevarez",
                    "user_href": "/profile/Ava-Nevarez-2"
                }
            ]
        }
    ]
}