{
    "title": "Who taught Eddie Van Halen how to play guitar? - Quora",
    "tags": [
        "Eddie Van Halen (musician)",
        "Van Halen",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Russell Spear",
                "href": "/profile/Russell-Spear"
            },
            "answer_text": "Eddie taught himself to play guitar. He didn’t learn to play music by himself. Eddie Van Halen took guitar lessons for years as a child before he ever started playing guitar. He already had an understanding of chords, scales and theory. He never learned to read music, so his understanding of those things may or may not have been what you’re thinking they would be, but on some level, he understood how those things work. He simply played by ear and with the memory of watching his teacher’s hands properly perform a piece of music. He was an inordinately gifted musician. Playing piano also taught him to use both hands in a coordinated fashion. I’ve been playing guitar over 36 years and it was only fairly recently that I discovered how many players have a problem of not being able to properly synchronize their hands. That seemed really bizarre to me because I don;t understand how you can not understand that you have to synchronize the two, but like Eddie, I had the benefit of a couple years of piano lessons before I ever picked up a guitar. For me, synchronizing is as natural as breathing. Maybe it’s because I played piano first. I knew chords, scales and theory already when I started playing guitar as well. ",
            "date": "Answered October 8, 2020",
            "views": "956",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Steve Pierce",
                    "user_href": "/profile/Steve-Pierce-13"
                },
                {
                    "user_id": "Jonathan Simmonds",
                    "user_href": "/profile/Jonathan-Simmonds-4"
                },
                {
                    "user_id": "Victoria Nicholson",
                    "user_href": "/profile/Victoria-Nicholson-29"
                },
                {
                    "user_id": "Marcia Lupo",
                    "user_href": "/profile/Marcia-Lupo-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robin Bailey",
                "href": "/profile/Robin-Bailey-6"
            },
            "answer_text": "The official story is that with the exception of a friend showing him some chords, Eddie taught himself. That sounds pretty amazing, and it definitely is. However, Eddie grew up in a very music oriented household and had been playing other instruments since the beginning of his days, mainly the piano for about 10 years before he picked up the guitar. His Mom wanted Eddie and Alex to become famous concert pianists, so they took lessons every week from a Russian Pianist for 10 years, and they hated it. But they had to practice the piano 30 minutes a day, every day, and they were hugely talented with it. When you get good at an instrument and have a deep understanding of how music works, you can apply much of that same knowledge to other instruments. Your hands just have to get good with the new instruments, but a solid foundation is already there, and your brain can tap into all of it much easier than before. This is essentially what Eddie did when he started picking up the guitar and eventually mastering it in a very big way, to the point that he became a game changer on guitar. ",
            "date": "Answered July 8, 2019",
            "views": "18",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Steve Pierce",
                    "user_href": "/profile/Steve-Pierce-13"
                },
                {
                    "user_id": "Ashley Jones",
                    "user_href": "/profile/Ashley-Jones-586"
                },
                {
                    "user_id": "Victoria Nicholson",
                    "user_href": "/profile/Victoria-Nicholson-29"
                },
                {
                    "user_id": "Scott Raby",
                    "user_href": "/profile/Scott-Raby"
                },
                {
                    "user_id": "Don Stuart",
                    "user_href": "/profile/Don-Stuart-6"
                },
                {
                    "user_id": "Rocknroller",
                    "user_href": "/profile/Rocknroller-1"
                },
                {
                    "user_id": "Arthur Raisfeld",
                    "user_href": "/profile/Arthur-Raisfeld"
                }
            ]
        }
    ]
}