{
    "title": "Who is bigger? The Beatles or BTS? - Quora",
    "tags": [
        "The Beatles (band)",
        "BTS (K-pop group)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Georgia McLean",
                "href": "/profile/Georgia-McLean-16"
            },
            "answer_text": "Certainly not BTS. If we’re strictly talking about the earlier days of the Beatles (1962/1963/1964), then I’d say the only similarity they share is that they both blew up in their home country, and then became big in America. However, the Beatles really took over everything. They became a very mainstream band, for people of all ages, taking over domestic goods, movies and even tv shows! In fact, 60% of the American population watched their first televised American appearance on the Ed Sullivan Show. In contrast, when BTS performed on SNL (which I guess could be our generation’s version of the Ed Sullivan Show) viewership actually took a nose dive. And then of course, you have “Beatle-mania,” which isn’t being replicated on the same level for BTS. You hardly see any cities brought to a standstill because of screaming fans today. When asking around, I haven’t had a single person tell me they know a BTS song. I’ve asked a pretty wide age range, and all of them have only been able to name Beatles songs. But now let’s talk about talent. The Beatles still win in this category. The Beatles brought together some of the best musicians ever, only because of the time and place. They collaborated well, and wrote over 280 songs in almost 8 years. BTS has been together since 2013 (six years) and only has 97 tracks. They won’t reach a number close to this, even if they stay together for another two years. But the quality of the music is also very contrasting. Part of what made the Beatles so great was how different every single song was. Most songs had emotion, and a lot of time put into it. BTS songs are all pretty similar, and sound very computerized. The Beatles’ music will most likely never be lost to time, as BTS’ will be lost in a sea of music identical to it. So no BTS is not bigger than the Beatles in any way (at least in the U.S) ",
            "date": "Answered June 1, 2019",
            "views": "109",
            "upvotes": " View 76 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Šhů Häm",
                    "user_href": "/profile/Šhů-Häm"
                },
                {
                    "user_id": "Mark Bosson",
                    "user_href": "/profile/Mark-Bosson-1"
                },
                {
                    "user_id": "Washmi Wijeratne",
                    "user_href": "/profile/Washmi-Wijeratne-1"
                },
                {
                    "user_id": "Francesca Ramos",
                    "user_href": "/profile/Francesca-Ramos-9"
                },
                {
                    "user_id": "Nocturne",
                    "user_href": "/profile/Nocturne-24"
                },
                {
                    "user_id": "Venkat Agiri",
                    "user_href": "/profile/Venkat-Agiri"
                },
                {
                    "user_id": "Sharlhyn Tolentino",
                    "user_href": "/profile/Sharlhyn-Tolentino"
                },
                {
                    "user_id": "ANIRBAN",
                    "user_href": "/profile/ANIRBAN-69"
                },
                {
                    "user_id": "Mohammad Moosa",
                    "user_href": "/profile/Mohammad-Moosa-41"
                },
                {
                    "user_id": "Alex Pardo",
                    "user_href": "/profile/Alex-Pardo-21"
                }
            ]
        },
        {
            "author_info": {
                "name": "Natalie Clark",
                "href": "/profile/Natalie-Clark-202"
            },
            "answer_text": "Both are big in their own way. The Beatles mania has stayed for a long time and they are ICONIC. BTS worldwide success has just begun and they've already reached The Beatles in some instances in a shorter period of time. Like I said, to me both are big, but we all know The Beatles have a greater history. Anyway, they're both pop, but from different places and eras (and even languages). I think it's really nice that we have a group almost as big as The Beatles for this generation. The best part is that they're not similar at all, they're both unique with different styles and approaches, and that's the beauty of it. The Beatles had a great impact in music and style that changed the industry forever. BTS impact is mostly cultural, the mix of different backgrounds and ideas makes them extremely unique and influential. They're changing South Korea’s history while quietly influencing the whole world. The way they mix their art with psychology is magestic, that's why they have fans of all ages and backgrounds. I would be angry if a group reached such success by being a copy paste of another one, but The Beatles and BTS are extrmely different and they both deserve respect. BTS didn't even think they would be as famous as they are today and they feel overwhelmed and even embarrassed by the comparisons. There's no need for fan wars, no one is taking the throne, each group has its own crown and it's well deserved. Let's just appreciate history and generations with an open mind. PS. The Beatles reached worldwide success in a time when there was no internet and everything was mostly local. BTS reached success in a more advanced era where everything seems easier but in reality the competition is bigger and it's harder to be noticed, specially if you don't speak English. I admire them both. ",
            "date": "Answered May 23, 2019",
            "views": "64",
            "upvotes": " View 32 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rounak Sen",
                    "user_href": "/profile/Rounak-Sen-8"
                },
                {
                    "user_id": "Venkat Agiri",
                    "user_href": "/profile/Venkat-Agiri"
                },
                {
                    "user_id": "Shagun Dassi",
                    "user_href": "/profile/Shagun-Dassi"
                },
                {
                    "user_id": "Pranav Ravel",
                    "user_href": "/profile/Pranav-Ravel"
                },
                {
                    "user_id": "Khushboo Gautam",
                    "user_href": "/profile/Khushboo-Gautam-19"
                },
                {
                    "user_id": "Denzel Forasteros",
                    "user_href": "/profile/Denzel-Forasteros"
                },
                {
                    "user_id": "Dilly Mackey",
                    "user_href": "/profile/Dilly-Mackey"
                },
                {
                    "user_id": "Himasree Meragana",
                    "user_href": "/profile/Himasree-Meragana"
                },
                {
                    "user_id": "Priyanka Azim",
                    "user_href": "/profile/Priyanka-Azim"
                },
                {
                    "user_id": "Min Yoonji",
                    "user_href": "/profile/Min-Yoonji-88"
                }
            ]
        }
    ]
}