{
    "title": "Who is Srikant in Amazon Prime's Mirzapur? - Quora",
    "tags": [
        "Mirzapur, Uttar Pradesh, India",
        "Mirzapur (Amazon Prime original series)",
        "Amazon Prime Video (Video on demand service)",
        "Amazon India (amazon.in)",
        "Amazon Prime",
        "Amazon.com (product)",
        "Amazon (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Priyanka Gupta",
                "href": "/profile/Priyanka-Gupta-378"
            },
            "answer_text": "There is NOONE as Srikant in Mirazapur. Basically,after delivering the successful series like Made In Heaven, Mirzapur, Comicstaan and many more, now Amazon Prime Video has announced the new series titled, The Family Man. The poster looks very intriguing as it has featured all the spy stuff in a black briefcase along with a gun which will leave you in a split yet wanting for more. Amazon Prime Video took their social media and shared the first poster of The Family Man which also introduces the name of the lead character that is, ‘Srikant Tiwari’. Sharing the same Amazon Prime Video write, “par sawaal hai… kya? #SrikantKuchChupaRahaHai” This announcement surely triggered excitement with one question, “Srikant Kuch Chupa Raha Hai?”. ",
            "date": "Answered September 17, 2019",
            "views": "794",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dhaval Mangukiya",
                    "user_href": "/profile/Dhaval-Mangukiya-4"
                },
                {
                    "user_id": "Ashish Khandelwal",
                    "user_href": "/profile/Ashish-Khandelwal-45"
                },
                {
                    "user_id": "Swarnim Bhardwaj",
                    "user_href": "/profile/Swarnim-Bhardwaj"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sussen Martin",
                "href": "/profile/Sussen-Martin"
            },
            "answer_text": "No contracts. Start free trial. There is NOONE as Srikant in Mirazapur. Basically,after delivering the successful series like Made In Heaven, Mirzapur, Comicstaan and many more, now Amazon Prime Video has announced the new series titled, The Family Man. ",
            "date": "Answered June 1, 2020",
            "views": "110",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shreshth Jaiswal",
                    "user_href": "/profile/Shreshth-Jaiswal-8"
                },
                {
                    "user_id": "Sagar Ghelani",
                    "user_href": "/profile/Sagar-Ghelani-4"
                }
            ]
        }
    ]
}