{
    "title": "Who is the greatest living composer? - Quora",
    "tags": [
        "Composers",
        "Music Composition",
        "Classical Music",
        "Best of X"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stephen Anderson",
                "href": "/profile/Stephen-Anderson-14"
            },
            "answer_text": "Sorry if this is an annoying answer, but there is no such thing.  A big part of that is because most famous composers, in fact let's include songwriters and actually ALL musicians, are really really good at one or two things, and pretty good at most things if they apply themselves, musically speaking, and then of course lousy at others.  I did my masters in film scoring at USC, and there were some very opinionated people in my program. For example there are some people who are die-hard John Williams fanboys, which is fine. I mean there's a reason he's famous. The problem is that they obsess over the one or two things that he does really really well, which is write memorable melodies and use the orchestra like he invented it. And then they insist that any other composer who isn't equally as skilled in that specific skill-set is a hack. Or a fraud.  Let's talk about Hans Zimmer. Basically the opposite of John Williams. People love hating on Hans, and it's mostly because they think that composing involves nothing more than writing a melody down on a piece of paper, and that's not really Hans' main strength. I've met him, in fact I was offered a job to work at his studio, and I can tell you the man is talented. I don't think there's anyone on earth who can manipulate samples and synths like him. Walking into his studio feels like walking into the command center of a team of terrorist hackers bent on world domination. He has so many computers networked together he had to get the city of LA to allocated more electricity to his block just to power them all. He has literally invented so much of the sounds we hear in film music today and it's amazing.  But can Hans write a piece for a full orchestra that's basically flawless in terms of orchestration, meaning using the instruments to their fullest capacity and having them blend together like peanut butter and jelly, without any post editing? Nope. Does John Williams know how to use a DAW? Nope.  So who's the best composer? There is no such thing. ",
            "date": "Answered December 12, 2013",
            "views": "19",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Emily Rose Lai",
                    "user_href": "/profile/Emily-Rose-Lai"
                },
                {
                    "user_id": "David Blackburn",
                    "user_href": "/profile/David-Blackburn-97"
                },
                {
                    "user_id": "George Davis",
                    "user_href": "/profile/George-Davis-16"
                },
                {
                    "user_id": "Alex Popper",
                    "user_href": "/profile/Alex-Popper-3"
                },
                {
                    "user_id": "Aidan Dinh",
                    "user_href": "/profile/Aidan-Dinh"
                },
                {
                    "user_id": "Aniket Chauhan",
                    "user_href": "/profile/Aniket-Chauhan-10"
                },
                {
                    "user_id": "Rajath Sharma",
                    "user_href": "/profile/Rajath-Sharma-1"
                },
                {
                    "user_id": "Alberto Oliveira",
                    "user_href": "/profile/Alberto-Oliveira"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Sergeant",
                "href": "/profile/Chris-Sergeant-5"
            },
            "answer_text": "There is not enough time in this lifetime to hear all the good music, see all the great art, read all the great literature, experience all that life has to offer. It is a blessing to know such things. Just when I think I have heard it all, I discover something new. Yet, I still want to hear Beethoven’s 5th again, for the countless time. I feel especially grateful to live at the same time as Philip Glass. I love his music. I own many cd’s and downloads. I love his repetitive rhythms and his cinematic vision. He has his critics, and I don’t know if mankind will be listening to Mr Glass a hundred years from now, but I am very thankful to live in his time of creativity. ",
            "date": "Answered December 12, 2019",
            "views": "293",
            "upvotes": "0"
        }
    ]
}