{
    "title": "Who is your favorite Japanese female singer? - Quora",
    "tags": [
        "Japanese Music",
        "Singers",
        "Japan",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Suttichart Denpreuktham",
                "href": "/profile/Suttichart-The-Cat"
            },
            "answer_text": "I am always a big fan of the Kalafina group, before that I actually always a fan of Kajiura Yuki arrangement but when she found Kalafina, the sonar dynamic of the trio vocalist really bring her work to the next level. Nearly all of their songs required all of the female vocalists to work together to create an intricate, layers upon layers of melody that shine like a multicolour jewel. Most media categorise their work as J-pop but I think they should have a separate category of their own, even today, I have never seen any work of music in or outside of Japan ever come close to their style. In a sense, they remind me more of classical music, like a string trio that perform with a female voice rather than an instrument. J-pop is just happened to be one of the types of song they performed within their style (they also perform symphonic rock, progressive, R&B and many more with their signature harmonic performance.  To be fair, I think all of them deserve my pick (after all, their songs are pretty much impossible to perform alone, and they themselves had admitted this) but as per the question, if I have to pick one it will probably be Otaki Wakana  Compare to the rest of the band, she may not be the most prominent member of the group (Kubota Keiko with her extremely low, almost baritone pitch probably take that title.) Despite that, however, Wakana is without the most skilled performer of the three. She has extreme control over soprano voice. She doesn’t perform as the main singer as often as the other two and her voice may be subtle in a lot of their titles - however, it’s her background voice that often gave the band their signature “angelic” feeling. It is also her solid performance that saves the band more often than not in their live performance, especially in their earlier live concert which their performance quality often drop dramatically compared to their studio record. This may be expected more or less but Wakana performance is often the only one who remains consistent both in record studio and live concert and gave the two other vocalists a solid ground to stand. This is much less so in their modern lives however, they improved so much over the year and it’s always a treat to hear a slight variation of my favourite track every year in their concert. ",
            "date": "Answered January 14, 2019",
            "views": "515",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aphichart Khongsuvarn",
                    "user_href": "/profile/Aphichart-Khongsuvarn"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emanuel Leung",
                "href": "/profile/Emanuel-Leung"
            },
            "answer_text": "Suzuhana Yuko  Yoshioka Yui  Hirano Aya (Well, she kinda counts lmao :XD)  ",
            "date": "Answered January 14, 2019",
            "views": "456",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yu-Hsing Chen",
                    "user_href": "/profile/Yu-Hsing-Chen-1"
                },
                {
                    "user_id": "Serg Ortiz",
                    "user_href": "/profile/Serg-Ortiz"
                },
                {
                    "user_id": "Nathan Yang (楊立慶)",
                    "user_href": "/profile/Nathan-Yang-楊立慶"
                },
                {
                    "user_id": "Victor Lee",
                    "user_href": "/profile/Victor-Lee-301"
                },
                {
                    "user_id": "Ahmet Tursun",
                    "user_href": "/profile/Ahmet-Tursun"
                },
                {
                    "user_id": "Hadyan Vikia",
                    "user_href": "/profile/Hadyan-Vikia"
                },
                {
                    "user_id": "Kang-Lin Cheng",
                    "user_href": "/profile/Kang-Lin-Cheng-1"
                },
                {
                    "user_id": "Jean-Luc Liu",
                    "user_href": "/profile/Jean-Luc-Liu"
                },
                {
                    "user_id": "Pipin Firmansyah",
                    "user_href": "/profile/Pipin-Firmansyah"
                }
            ]
        }
    ]
}