{
    "title": "Who are your Favorite guitar players? - Quora",
    "tags": [
        "Playing Guitar",
        "Guitars",
        "Musical Instruments",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ed Seith",
                "href": "/profile/Ed-Seith"
            },
            "answer_text": "Wonderful arbitrary question! I have a number of favorites, some who influenced my formative years as a musician, some who still inspire me, and certainly some that I don’t emulate but listen to and enjoy immensely. Here’s a sampling, in no significant order (except that the first ones in my head are probably the “most favorite”). Some are “duos.” Randy Rhoads (Ozzy)Steve Vai (David Lee Roth, Frank Zappa, Whitesnake, solo)Adrian Smith/Dave Murray (Iron Maiden)Synyster Gates (Brian Haner Jr - Avenged Sevenfold)Adam Dutkeiwitz (Killswitch Engage)Stevie Ray VaughnMatt Heafy/Corey Beaulieau (Trivium)Joe SatrianiJohn Petrucci (Dream Theater, mostly older stuff)Zakk Wylde (the Ozzy years - not the solo/BLS stuff so much)Frank Hannon/Tommy Skeoch (Tesla - HUGE formative influence!)Warren DeMartini (Ratt)Criss Oliva (Savatage)Nuno Bettencourt (Extreme)David Gilmour (Pink Floyd)James Hetfield (Metallica - not a Kirk fan)Marty Friedman (Megadeth)Paul Gilbert (solo and Mr. Big)Andy Timmons (solo and Danger Danger in the 90s)Mark Tremonti (Tremonti, Alter Bridge, Creed not so much)Mark Knopfler (Dire Straits, solo)Tom Keifer (Cinderella)Keith Douglas (Tora Tora)Diamond Darrell Abbott (Pantera)Richie Sambora (Bon Jovi, yeah, I said it - Richie is fantastic)George Lynch (Lynch Mob, Dokken)Michael Wilton (Queeensryche)Brad PaisleyEVHJeff Waters (Annihilator)That’s a lot. Part of the reason is that if you want to be a good and relatively unique musician, you need a LOT of incluences - the more the better. ",
            "date": "Answered May 20, 2016",
            "views": "342",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dev Shah",
                    "user_href": "/profile/Dev-Shah-350"
                },
                {
                    "user_id": "Rena Feng",
                    "user_href": "/profile/Rena-Feng-3"
                },
                {
                    "user_id": "Diego Pujol",
                    "user_href": "/profile/Diego-Pujol-1"
                },
                {
                    "user_id": "Andrés Parzanese",
                    "user_href": "/profile/Andrés-Parzanese"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zack Thompson",
                "href": "/profile/Zack-Thompson-12"
            },
            "answer_text": "1- Angus/Malcolm Young In my opinion, the two greatest guitarists to have ever graced the instrument. I’m personally a huge fan of Angus’s style as a lead guitar player (his solos are a perfect mix of blues, rock, and Angus’s electric playing style), and I doubt that there are too many people who would disagree with naming Malcolm Young as one of the best Rhythym guitarists ever. Listen to the solo in the demo version of “If you want blood” and the solo in “Live Wire” for some of Angus’s best work 2- Vivian Campbell His work on the first two Dio albums is just amazing. His tone isn't the best but the passion he plays with makes up for it in spades. I also really like how he phrases his solos. They all have a very unique mix of shredding and traditional hard rock/blues playing. Take the solo in “Holy Diver” for instance; It starts with a very moderately paced, bluesy lick that works up to frantic end. Very unique. 3- Marty Friedman His guitar work in Megadeth is legendary. I really like his unconventional playing style and sound and he has written some of the most recognizable solos in metal history. Tornado of Souls is probably his most recognizable, though they're all great 4- Adrian Smith Adrian and Dave Murray are one of the most famous duo’s in metal history. I personally prefer Adrian’s bluesy style to Dave’s legato style, but regardless, Adrian is a master composer. Listen to “Wasted Years” or his amazing solo in “Caught Somewhere in Time” to hear some of his best work 5- Roy Z I’m going to take an unconvetional route here and go with Roy Z as my last pick. While I’m no fan of his work with Tribe of Gypsies, his work on Bruce Dickinson’s solo albums are some of the best riffs ever written. His style, while not particularly unique, fits well to Bruce’s vocals and his composition skills are top notch. Listen to the main riffs in “Tyranny of Souls”… Actually just listen to the albums “Tyranny of Souls” and “The Chemical Wedding” as well as the track “Road to Hell” off of “Accident of Birth” to hear some of the finest riffs ever written-it’s worth your time. Also listen to his solo on “Tears of the Dragon”. HONORABLE MENTIONS: Randy Rhoads, Carlos Cavaso (for Metal Health and Condition: Critical), Chris DeGarmo, Warren DeMartini, Erik Turner, Brad Paisley, Phil Collen/Steve Clark, George Lynch, Glenn Tipton, Dave Mustaine, Frank Hannon ",
            "date": "Answered July 4, 2016",
            "views": "327",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dev Shah",
                    "user_href": "/profile/Dev-Shah-350"
                }
            ]
        }
    ]
}