{
    "title": "Who is a better rapper, Cardi B or Nicki Minaj? - Quora",
    "tags": [
        "Nicki Minaj (musician)",
        "Cardi B (musician)",
        "Rap Music",
        "Hip Hop and Rap Artists"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shannon Leigh",
                "href": "/profile/Shannon-Leigh-55"
            },
            "answer_text": "Nicki is by far a better rapper/singer/artist overall. She’s definitely more talented as she writes all of her music and has even written for other artists. She also produces/co-produces many of her songs. She can also sing and act as displayed in her roles in movies such as Barbershop 2 and The Other Woman. She is most definitely more professional and an established business women. Cardi b had one good song (Bodak Yellow) that it turned out she did not write nor take part in creating. Her previous managers gave her the song and they were in contract to receive 30% of her earnings, but after this song made her popular she signed a 360 deal with Atlantic records and stopped associating with the managers who helped her get on Love and Hiphop and gave her Bodak Yellow. A 360 deal is when the label puts large amounts of money into promoting the artist and the artist pays them back for all of that money and gives them 50% their profits. Her album was created and released under Atlantic records. Her next solo single was written by Pardison Fontaine and it was exposed immediately after being released that you could find the song on YouTube being rapped word for word by Pardison uploaded two years earlier (since been removed). She even acknowledged after the backlash that she did not care about writing her own lyrics as long as she and the writer made money. It has also been exposed that Atlantic had offered other artists lucrative deals for their agreement to publicly attack Nicki Minaj who is obviously been a dominating artist in the genre for many years. There is also a huge question about Atlantic records practice of paying large amounts for her promotion including the illegal practice of “payola” which is paying Dj’s/stations for an artist’s radio play. Other than musical-talent, Nicki encourages her fans to go to school and has paid the tuitions of numerous fans to further support this goal for all of her fans male or female. She encourages women to be independent, earn their own money, own their individual sexuality (however that may be), and not to let men ever put them down/take advantage of them. Cardi b told her fans to get sugar daddies if they did not want to work or go to school. I would assume it’s a matter of opinion, but Nicki has had longevity as an artist because of her talent and professionalism. Cardi has risen to fame quickly and not solely due to her music ability. There really is no comparing them as artists as Nicki takes pride in her writing and rapping ability and Cardi simply hopes to turn a profit regardless of who writes her music or genuinely likes it. ",
            "date": "Answered January 19, 2019",
            "views": "17",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kerdija Styles",
                    "user_href": "/profile/Kerdija-Styles"
                },
                {
                    "user_id": "Patrick Belliza",
                    "user_href": "/profile/Patrick-Belliza"
                },
                {
                    "user_id": "Sarai Maraj",
                    "user_href": "/profile/Sarai-Maraj"
                },
                {
                    "user_id": "Tony Shen",
                    "user_href": "/profile/Tony-Shen-64"
                },
                {
                    "user_id": "Total Drama Gigi",
                    "user_href": "/profile/Total-Drama-Gigi"
                },
                {
                    "user_id": "Kadence Keys",
                    "user_href": "/profile/Kadence-Keys"
                },
                {
                    "user_id": "Surajkumar Chulliparambil",
                    "user_href": "/profile/Surajkumar-Chulliparambil"
                },
                {
                    "user_id": "Rian Arceta",
                    "user_href": "/profile/Rian-Arceta"
                },
                {
                    "user_id": "Flores Gramans",
                    "user_href": "/profile/Flores-Gramans"
                },
                {
                    "user_id": "Kartikeya Durrani",
                    "user_href": "/profile/Kartikeya-Durrani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anne",
                "href": "/profile/Anne-1376"
            },
            "answer_text": "Nicki Minaj is a better rapper. That’s just raw facts. She has proven to be a talented rapper many times. She has made major hits with big names in the rap game such as Lil Wayne, Eminem, Kanye West,Jay Z, Drake, Future, Big Sean etc. Honorable mentions like Beyoncé, Madonna Rihanna… the list just goes on. Getting these artistes to be featured on a song with you is very much of a big deal. Now the gag is that some of these big names actually came to Ms Minaj asking for her to feature on their song. Monster by Kanye west till this day is a smash hit. She out rapped the other featured artists. Kanye west, one of the well known rappers who has been in the game for years gave Nicki her accolades. In his own words “the scariest artist is Nicki Minaj and I think she has the most potential to be the number 2 rapper of all time because nobody is bigger than Eminem. Eminem is the biggest rapper of all time”. He also said that he almost cut her verse on monster because of how good it is. And refused to release “new body” because she also did what she had to do on that song 😂 Now, another fact is that whenever Nicki Minaj is featured on a song we all play that song because we want to hear Nicki Minaj rap, when you feature Nicki on a song, the song is automatically hers because she owns it. She has bars for days, one of the few artists that still believes in the importance of pushing your own pen instead of hiring ghostwriters. She literally has like 5 different flows in one song and no one can take that from her. A truely talented lyricist is what she is. I’m still in awe of how talented she is to be very honest. Unlike the newbie Cardi B, who doesn’t even write her songs and barely speaks well. She built her career on sympathy and on top of all that she relies on payola for her streams and start petty social media rants and feuds. There’s an agenda against Nicki Minaj and it truly hurts me that people refuse to see this but turn around to compare her to someone who isn’t talented enough to write her OWN MUSIC!!! What makes you a true singer/rapper is when you actually push your pen. And Nicki is one of the few people that still pushes her pen even though some people swear that she doesn’t. Nicki Minaj is always compared to male rappers in the game but you never see anyone comparing Cardi to them. Because she isn’t as good. The fact that Nicki gets compared to male rappers is enough proof to show you how good she is. Also, she gets the most hate from men because she’s a “woman”. Yes, gender plays a massive role here The reason why I said “male” rappers is because the hip hop industry was mainly dominated by men until Nicki Minaj came through and broke that barrier of men dominating. There were other female rappers before her of course. The likes of Foxy brown, Missy Elliot, lil Kim, to name a few. But they didn’t make as much impact as Nicki Minaj. Let’s be honest with ourselves, in this age and time, I can call a random person and ask them if they know who Nicki Minaj is. 90% if not all, will definitely say yes. But I can’t say the same about the rest. That doesn’t mean that they’re not good or talented. They’re mostly known by the people that were born in the early 90s. Nicki Minaj came through and became the new face of “Female rap”, owned it and stood toe to toe with the big boys and they stepped aside. She broke that barrier of making it seem like “rapping” is just for men. Other people came before her like I mentioned earlier. But do they have the same longevity, consistency and overall impact? The answer is No. People just say Cardi b is better because they hate Nicki and needed someone in the limelight that feels the same way to push their “I hate Nicki”agenda. Comparing someone who just had one good year of hype and also used the Nicki hate train to her advantage is such a disrespectful thing to do. Imagine comparing Eminem, Lil Wayne, Kanye and Jay Z to Lil pump. Laughable right? Exactly! It makes no sense. So, when I see people comparing them I just get mad. Nicki has impact. She has hits from mixtapes, freestyles and albums. The pink print being my favorite album and the Queen album is a close second. Some say Nicki has no Grammy but Cardi does and that makes her better. I just find it funny really. Because an award that is twisted to the favor of whoever they deem fit shouldn’t be a yardstick of success or be used to diminish one’s talent. Nicki still remains the highest selling female rapper 13 years into her career with a networth of $100+ million as at March 2020. Nicki’s discography alone is better than Cardi’s entire career and that’s facts. Ole girl hasn’t charted for a long time now ever since the payola investigations started. People think it’s by winning a Grammy or having a #1 hit. Let’s be honest with ourselves, a #1 is really good but it also doesn’t actually mean it’s a great song.And I believe Nicki will eventually have her #1 hit and Grammy too. Since people won’t shut up about it and try to use that to diminish her artistry. Cardi is just an overhyped industry plant with zero lyrical content. Always talking about how she’s gonna slap bitches, fight bitches who wants to steal her man with her long acrylics, talking about the sex positions she wants and what not. Nobody wants to hear all of that ratchet stuff. Let’s not forget that this same woman whom the media consistently try to make look modest has raped men and drugged them for money and she owned up to it when the proof showed up. She also made racist comments calling black people “roaches and monkeys”. But hey, it’s Cardi B, “it was just a mistake” they said. Imagine if this was Nicki? Would it have been swept under the carpet like they did to Cardi? I’ll leave you to answer that question yourselves. People love to say Nicki always raps about pussy or sex every time. But have you actually taken your time to listen to gems like Win again, still I rise, lookin ass(don’t be misled by the title), the crying game,grand piano, I lied, all things go, ganja burn, Can anybody hear me, dark side of the moon?! These songs aren’t talked about that much but they hold a great and significant meaning about her struggles etc. Everything happening to her today, she saw it coming and made songs for each one. And it all makes sense now. Also, men are allowed to rap about mediocre things such as drugs, sex, money and objectifying women and describe the size and shape of their penises. Men using women’s bodies and nakedness to hype up their position of male toxic power & sex appeal is acceptable in today’s society. But when a woman sings or raps about her body it’s the end of the world?! She gets looked down upon and slut shamed. That just makes no sense to me really. People are quick to call Nicki names and underrate her because it’s the “trendy” thing to do. I know for a fact that this hate train will come to an end soon. I know that for sure. She’s a very strong woman. She’s hated by many, gets death wishes and even called a barren woman. Through it all. She has amassed a fiercely loyal fan base that will never be wavered. I don’t always agree with all her life choices or decisions but I will always respect her. People can hate all they want but there will never be another “Nicki Minaj”. No one is doing it like her anymore. They can copy her flows and style but they can’t copy the delivery and how well she does it. That’s why she’s the standard, the blueprint. In her words “I’m the blueprint, oh I mean the pinkprint(Double entendre). Don’t forget that hating popular topics or things doesn’t make you an interesting person. It’s not a cute look at all! No matter what people try to say, Nicki’s legacy can never be undone. She’s been in the game for 13 years and still counting and has earned herself the Queen title. They’ve been trying to tarnish her image from time but it just isn’t working and still won’t . Listen, when you’re good, you’re good. They blackballed her and refused to play her songs on radio but guess who’s still charting her way to the top and recently the only rapper(male and female) to see her discography streamed 1 billion times this year. Yup. You read that right. 1 billion. That’s 1 billion times in 12 weeks WITHOUT PAYOLA? And she achieved this while on a musical hiatus. Her name is ONIKA FUCKING TANYA MARAJ!! We don’t call her the Queen for nothing. They can keep hating all they want but it’s all good, ‘cause when you’re legendary, you shine no matter what!. ",
            "date": "Updated May 14, 2020",
            "views": "72",
            "upvotes": " View 91 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Eugene Marinski",
                    "user_href": "/profile/Eugene-Marinski"
                },
                {
                    "user_id": "Patrick Belliza",
                    "user_href": "/profile/Patrick-Belliza"
                },
                {
                    "user_id": "Sarai Maraj",
                    "user_href": "/profile/Sarai-Maraj"
                },
                {
                    "user_id": "Tony Shen",
                    "user_href": "/profile/Tony-Shen-64"
                },
                {
                    "user_id": "Xander Leon",
                    "user_href": "/profile/Xander-Leon"
                },
                {
                    "user_id": "Jarret Jarikre",
                    "user_href": "/profile/Jarret-Jarikre-1"
                },
                {
                    "user_id": "Bernice Imperial",
                    "user_href": "/profile/Bernice-Imperial"
                },
                {
                    "user_id": "Phemine Chayuga",
                    "user_href": "/profile/Phemine-Chayuga"
                },
                {
                    "user_id": "Jerry Bernard",
                    "user_href": "/profile/Jerry-Bernard-9"
                },
                {
                    "user_id": "Kushwanth Pandiri",
                    "user_href": "/profile/Kushwanth-Pandiri"
                }
            ]
        }
    ]
}