{
    "title": "Who is the hottest member of BlackPink? - Quora",
    "tags": [
        "BLACKPINK",
        "Attractive Women",
        "K-Pop Idols",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Emma Kim",
                "href": "/profile/Emma-Kim-50"
            },
            "answer_text": "All of them are gorgeous but I personally think Jisoo is the most beautiful.  Her looks haven’t changed much from when she was in middle school. She has a symmetrical face with heart shaped lips and puppy like eyes. Her looks are the most delicate in Blackpink.  I love her to death but I wish she was better at posing for photos because when I saw her in real life I was shocked by how much prettier she looked in real life! Other idols have also said that she looks more gorgeous irl. Nancy from Momoland said, “I think she’s gorgeous to the extent that the camera can't capture her beauty.”          Gif below~         Students who knew her in middle school also all came out and said she was really kind, and always cute and cheerful, like a puppy. Students from her high school all said she had a very lovable personality as well, everyone also called her “Red Riding Hood” because she always had a red hat in the winter. Another thing that really drew me into Jisoo is how versatile she is. There are so many different sides to her and she has these subtle changes to the vibe and feeling she gives off.                     I love pictures of Jisoo performing~                  Gifs again~      Jisoo with bangs~    She also has the prettiest body line in Blackpink. Here she is doing flying yoga   She has a wide pelvis so her body line looks really nice~  And she has good proportions too  BONUS: Jisoo predebut pictures♡♡    I think this was 3 or almost 4 years ago Edit: I saw Blackpink at the Tokyo girls collection performance and at the Adidas fansign event. I was legit staring at them for a couple hours at both events, and Jisoo is the most stunning for sure. She looked 100 times better in real life! Last year she came in 4th place out of several hundred idols on a poll voted by idols on who was better looking in real life. Edit2:I think the most stunning part about Jisoo is her personality. She is so sweet, kind, hard working and bright that it makes me want to be a better person. Example 1: During a concert in their world tour, Jisoo got hit in the nose by a firework, right between her eyes. Her nose was badly burned and it was bleeding so much that the other members, Rosé, Lisa and Jennie, thought she would rest and not perform her solo that night. However, Jisoo wanted to push through for blinks so instead of not performing, she switched her solo performance schedule with Jennie (Jisoo was originally supposed to go last and Jennie was supposed to go first). She cleaned up the blood, put a skin colored patch sticker on, covered it up with makeup and performed her solo. The picture below was taken by a fan at the send-off.  Example 2: While they were still on their world tour, Jisoo had swollen nymph lodes. They are caused by stress and/or illness. They cause fatigue and pain, and the pain is amplified when you sing because the throat is usually sore. She carried on performing as always, dancing and singing for hours during their concerts.  In the above photo you can see she is also sweating quite a bit, this was due to the fatigue her swollen nymph nodes were causing. Example 3: The girls performed at coachella 2019 in between performing at their concerts. On week 2 Jisoo was sick with a cold+body ache+back pain but she gave a stellar performance. After their set, the girls mingled, had fun and met other celebrities, but Jisoo stayed behind at the hotel to rest so that she would be able to perform better at the Fort Worth concert. She also told fans not to worry, that she feels better and that she loves them in English even though she is self-conscious about her English speaking skills.  Example 4: Jisoo was feeling sick and in a bad condition and she was crouching down at the airport, but when she walked out into the public area she pretended she was fine so that the fans wouldn't worry. She brightly smiled and waved at the fans even though she was sick.   Example 4: She is always there for the other members and always wipes their tears away and consoles them but she never cries in front of them. She is the oldest member so she always takes care of the other members and doesn't show them her tears because she doesn't want them to worry. The members have only seen Jisoo cry once in the 8 years they have known each other- when Jennie hurt her ankle after their debut stage. (Jisoo said that she also shed a few tears when she got the burn/cut on her nose because it hurt so bad but we’re not counting that as crying lol).  Example 5: Her classmates have come out and said that she was always kind and bright, like a puppy. They also said she was nice and friendly to everybody, and always lifted everyone's mood. One of her classmates even said he used to go over to her class and pretend to talk to his friend when in reality he just went to look at her lol.  Closing off with a gif of Jisoo sending hearts to everybody❤  ",
            "date": "Updated October 7, 2019",
            "views": "997",
            "upvotes": " View 467 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/S-B-3002"
                },
                {
                    "user_id": "Priya Chaudhary",
                    "user_href": "/profile/Priya-Chaudhary-190"
                },
                {
                    "user_id": "Thanvitha M",
                    "user_href": "/profile/Thanvitha-M"
                },
                {
                    "user_id": "Jisoo Manoban",
                    "user_href": "/profile/Jisoo-Manoban"
                },
                {
                    "user_id": "AAlessandraT",
                    "user_href": "/profile/AAlessandraT"
                },
                {
                    "user_id": "Finley Hall",
                    "user_href": "/profile/Finley-Hall-6"
                },
                {
                    "user_id": "Neia Lenz",
                    "user_href": "/profile/Neia-Lenz"
                },
                {
                    "user_id": "Ainora Elmi",
                    "user_href": "/profile/Ainora-Elmi"
                },
                {
                    "user_id": "Queen Kash",
                    "user_href": "/profile/Queen-Kash-2"
                },
                {
                    "user_id": "Shilpa Murali",
                    "user_href": "/profile/Shilpa-Murali-25"
                }
            ]
        },
        {
            "author_info": {
                "name": "Livia Hanlon",
                "href": "/profile/Livia-Hanlon"
            },
            "answer_text": "Korean standards: Jisoo, Jennie, Rosé, Lisa For most Kpop groups, the visuals are usually the ones who fit the Korean beauty standards the most. In this case, It’s Jisoo. She definitely fits the standards of Korean beauty; long head, long slim nose, round eyes, perfect proportions. Next would be, Jennie. She isn’t a ‘visual’ but many people consider her to be. Especially when she gives off a ‘sexy’ or ‘hot’ vibe. Her in red lipstick, or wearing black usually gives Koreans ‘attractive vibes’. Her small face, round eyes, small nose, and perfect-shaped lips, attract many Korean. Rosé would be next. Even though she isn’t known for her beauty like Jisoo and even Jennie, she fits the Korean beauty standards in some ways. Pale skin, round eyes. Even though 90 percent of the time, Korean beauty standards consider visuals to have ‘black’ hair, Rosé can still impress people with her pale skin, and rosy lips. Last, Lisa. Koreans mostly focus on ‘black-haired’ people. Lisa was born with brown hair, and while she does have round eyes, and a slim nose, she sometimes sticks out of the group with her unique sense of style. Many Koreans judge humans like lisa, who where unique or wild clothing, or hairstyles, or makeup. American Standards: Jennie, Rosé, Lisa, Jisoo Although many people disagree, many people I know (including me) think Jennie is the prettiest of Blackpink. Jennie has a very distinctive face, that looks especially good to Americans. Just like Koreans, Americans think she is very sexy and has a good face for magazines and photo shoots. Rosé would definitely be next. She is a close second with Jennie, and unlike Jennie, many people think she has a more ‘cute’ and ‘beautiful’ face. Many people love her hair, and her long nose. Some of my close friends think that she is a second visual in Blackpink (After Jennie) Next, Lisa. Lisa is treated differently for her style in America than in Korea. Many Americans love the way she is styled,(Including me) and think that being unique is good. Although she isn’t the prettiest to many Americans, she is definitely the most popular in America, which gains her a lot of fans loving her for who she is. Jisoo. Like Lisa, Jisoo’s beauty in America has mostly to do with her fans. Jisoo most likely has the least American fans, and I have a feeling its because she isn’t very fluent in Korean, and unlike the other members, she hasn’t taken time or practied English for a period of time. Jisoo to many Americans is too ‘Asian’ or ‘Weird’ which I find Absurd. Many people doubt Jisoo’s(Our beautiful) visuals. ",
            "date": "Answered April 9, 2019",
            "views": "207",
            "upvotes": " View 59 Upvoters",
            "upvoters": [
                {
                    "user_id": "Siya Singh",
                    "user_href": "/profile/Siya-Singh-168"
                },
                {
                    "user_id": "AAlessandraT",
                    "user_href": "/profile/AAlessandraT"
                },
                {
                    "user_id": "Jovanca Clarisa",
                    "user_href": "/profile/Jovanca-Clarisa"
                },
                {
                    "user_id": "Leena Sujitkumar",
                    "user_href": "/profile/Leena-Sujitkumar"
                },
                {
                    "user_id": "Mark Olpindo",
                    "user_href": "/profile/Mark-Olpindo-1"
                },
                {
                    "user_id": "Suhani Jariwala",
                    "user_href": "/profile/Suhani-Jariwala"
                },
                {
                    "user_id": "Tina Carno",
                    "user_href": "/profile/Tina-Carno"
                },
                {
                    "user_id": "Tabyana",
                    "user_href": "/profile/Tabyana"
                },
                {
                    "user_id": "Swapna Mustari",
                    "user_href": "/profile/Swapna-Mustari-1"
                },
                {
                    "user_id": "Allan Cruz",
                    "user_href": "/profile/Allan-Cruz-67"
                }
            ]
        }
    ]
}