{
    "title": "Who do you think could replace Chester Bennington in Linkin Park? Do you think they should just start a new band instead? - Quora",
    "tags": [
        "Chester Bennington (musician)",
        "Linkin Park (band)",
        "Bands (music)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sarah McGee",
                "href": "/profile/Sarah-McGee-38"
            },
            "answer_text": "I've answered this question numerous times in different forms. My answer won't ever change about this. You cannot replace anyone. People are finite. Once you are gone - that is it. There is no clone to replace anyone. LP isn't even looking to replace Chester. They have stated that if another singer comes along and it feels as though it would be a good fit with them then it would happen naturally.. Like it did with Chester. They are not out there looking for some chump wanna-be singer to replace the heart of their band. And… No they should not start a new band… what the hell? :\\ You must know very…very little about LP. They were a band before Chester ever came along. Mike and Brad are technically the founders of Linkin Park. So… them starting a “new” band is more than a bit ridiculous. Take a moment and really think about what it is you are asking… really. Do you really want some limp dick singing Chester Be's songs? I find the thought of someone else singing his songs cringe worthy. ",
            "date": "Updated June 21, 2019",
            "views": "580",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aurora Hoxha",
                    "user_href": "/profile/Aurora-Hoxha-4"
                },
                {
                    "user_id": "Ankan Roy",
                    "user_href": "/profile/Ankan-Roy-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jade Star",
                "href": "/profile/Jade-Star-8"
            },
            "answer_text": "I think it depends on if Chester ever expressed how he felt about the band continuing on if he left or something happened to him. If they've had his blessing I have no problem with them continuing on as LP. As for getting a new singer they need to take their time and find the person that is the closest to a perfect fit they can get. Nobody will ever be just like Chester but i think they can find someone that will channel chesters style but bring their own twist to things. ",
            "date": "Answered May 29, 2019",
            "views": "187",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ankan Roy",
                    "user_href": "/profile/Ankan-Roy-18"
                },
                {
                    "user_id": "Dawson Retter",
                    "user_href": "/profile/Dawson-Retter-1"
                }
            ]
        }
    ]
}