{
    "title": "Who has had a bigger impact in the history of music between Queen and The Beatles? - Quora",
    "tags": [
        "Queen (band)",
        "Music History",
        "Rock and Roll Music",
        "The Beatles (band)",
        "Rock Music",
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Wayne Mac",
                "href": "/profile/Wayne-Mac-8"
            },
            "answer_text": "There have been a lot of well-intentioned questions like this lately. They probably come from a millennial source who is not au fait with the Beatles. I would recommend to the questioner to read several books about the Beatles and their impact on life in the 1960’s. Queen have had their profile expanded by the recent movie about Freddie Mercury. I can understand how a millennial far removed from the 1960’s and even Queens era might think this way. Its charming but inaccurate. The Beatles had more impact on popular music than any other artist in the 20th Century. Queen were a great band to be sure but just another band among many. The Beatles heralded rock music and influenced history and lifestyles. I can understand how you might think Queen were on that level but they weren’t. Do the reading on the Beatles and you will be fascinated. ",
            "date": "Answered August 8, 2019",
            "views": "91",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Robert Laszcz",
                    "user_href": "/profile/Robert-Laszcz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Thorogood",
                "href": "/profile/Peter-Thorogood-3"
            },
            "answer_text": "A rather silly question the beatles paved the way for British rock hence no Beatles no music history therefore no Queen and the usa loved them . So I'll let you work out the answer to your own question . Or you can read up on the history of rock . Not rock and roll. Rock which as I've said before is a British idiom not american whose white businessmen stole the expression from the African American slang. I hope this answers your question as I still regard queen as overrated and more of a stage show and were regarded by some person as more influential than the beatles . Go figure . Even the stones first hit was a Beatles song and they were more influential than queen . ",
            "date": "Answered August 7, 2019",
            "views": "117",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Robert Laszcz",
                    "user_href": "/profile/Robert-Laszcz"
                },
                {
                    "user_id": "Patricia Edwards",
                    "user_href": "/profile/Patricia-Edwards-102"
                },
                {
                    "user_id": "Jeroen De Wijn",
                    "user_href": "/profile/Jeroen-De-Wijn"
                }
            ]
        }
    ]
}