{
    "title": "Who is better, Michael Jackson or Justin Bieber? - Quora",
    "tags": [
        "Justin Bieber (musician)",
        "Michael Jackson (musician)",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rohit Rana",
                "href": "/profile/Rohit-Rana-927"
            },
            "answer_text": "Short Answer = Michael Jackson I will answer it with open mind. Michael Jackson Started Singing at the age of 5 with his brothers. He didn’t have social media at that time. He even faced racism in his career. Justin also started at a young age. He had the advantage of Social Media. He didn’t have any racism in his career. Many teenagers only like him because of his looks. At the age of 24, Michael Jackson released Thriller which is the best selling album of all time. It sold a total of 66 million copies. Justin has sold around 150 million album copies till this date while MJ sold 750 million. Guinness Book Of World record identifies MJ as The Greatest Entertainer Of All time. MJ recieved a lifetime achievement award at the age of 28. He is also the most awarded person of all time and The Highest Earning Artist Dead or Alive. MJ was the first black artist to air on MTV. Justin can play Intruements. We never saw Michael playing any intruement live though he has been credited to play drums and guitar in a few songs and there also a few pictures of him playing Guitar And Piano  Michael Jackson was a great dancer too. Earlier, he used to watch James Brown dance and imitated his moves. Later, he popularized Moonwalk and also created Dance Moves like Side Glide, Circle glide, The Robot. If you observe Justin’s earlier videos, he can be seen imitating MJ moves. He hasn’t created any Special dance move, most of his moves are MJ moves. He is also a good dancer. Michael Jackson is the ONLY popstar to be inducted in National Museum of Dance Hall Of Fame. If We Talk about their Voices, they both had a shrill voice (Though MJ made his voice shrill intentionally), MJ was a versatile singer which earned him a place in Rock hall of fame. Michael Jackson, the King of Pop, has more No. 1 hits than most artists, he gave 13 no.1 hits, out of which 5 songs were written by him. Justin Gave 7 no.1 hits which is also very great but surely he didn’t surpass MJ. In terms of songwriting, Justin has written more catchy songs BUT the songs MJ wrote, are timeless, his songs are still Relative. He wrote songs on Global issues like Human Trafficking (The Lost Children), Negative Effect of Industrialization (The Earth Song), Helping others (Heal The World) Racism (Black or White) , Corruption(They don’t care about us) and many more. Almost all the fellow celebrites of MJ loved him. While we can see Some Celebs booing Justin in award shows. Half the artist who came after MJ were actually inspired from him. (eg. Britney Spears, Beyonce, Bruno Mars , Justin Bieber and many more.) In 1987, a survey confirmed that MJ is the most popular person on earth. On 25 june 2009, MJ died and the same day, Google, Twitter and Wikipedia crashed due to user traffic. His Funeral was viewed by 1 billion people wordwide. When the Music Video ‘Black or White’ premiered on TV. almost 500 million people viewed it from 27 countries. I am NOT talking about views, I am talking about an actual audience. In YouTube, JB fans watch his videos repeatedly but we cant do it with TV.  I don’t think any other artist can achieve that much fame. MJ has earned 4.1 billion (Dead and Alive). He is the highest selling dead artist every year after his demise. MJ also owned the ‘ATV catologue’ (till 2016) which owns all the songs of Beatles, Some songs of Elvis, Elton John, Eminem and many other songs. MJ purchased it in 1985 for 47 million and till 2016, its worth was 1.1 billion, Sony purchased it for 750 million Dollars. Justin’s net worth till now is more than 200 million. And he has a lot of time to earn more. Michael Jackson is the Most awarded Person of all time. MJ won eight grammy awards in one night for THRILLER. He was 24 years old that at that time, he also made a world record for most grammy awards won in a night. Both are great philanthropists, Justin has got a world record for Most wishes fulfilled in Make a wish foundation. JB did it with his own time, money and dedication. MJ has got a world record for Most Charities Supported by a pop artist (39 in number). He also did it with his own time, money and dedication. MJ also founded The Heal the world foundation which helps children affected by War and poverty. I personally think its not good to tell who is better at philanthropy because it is done to help others. Both singers Should be respect for their charities. I don’t have any personal hatred with Justin, I love his music but comparing him to the Greatest Entertainer of all time is totally unfair. He himself considers MJ his greatest Influencer. Thanks For Reading. ",
            "date": "Updated September 9, 2020",
            "views": "13",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dhairya Sharma",
                    "user_href": "/profile/Dhairya-Sharma-101"
                },
                {
                    "user_id": "Riyaz Md",
                    "user_href": "/profile/Riyaz-Md-17"
                },
                {
                    "user_id": "Pickle Rick",
                    "user_href": "/profile/Pickle-Rick-219"
                },
                {
                    "user_id": "Abhilash Kaushik",
                    "user_href": "/profile/Abhilash-Kaushik-8"
                },
                {
                    "user_id": "Ehtesam Aleen",
                    "user_href": "/profile/Ehtesam-Aleen"
                },
                {
                    "user_id": "MJ Fan 550",
                    "user_href": "/profile/MJ-Fan-550"
                },
                {
                    "user_id": "YN Ln",
                    "user_href": "/profile/YN-Ln-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amaan Rafiq",
                "href": "/profile/Amaan-Rafiq-1"
            },
            "answer_text": "Justin bieber…. LoL jks mj as he has better voice and also he influenced all the other pop stars and he is also got a bigger net worth than jb even dead. Lol mj dead is still better than jb alive. No one can replace mj yet maybe in the future jb will become the king of pop but so far he is like the Prince of pop and mj is still king even tho he is dead. So quick answer mj is better as he has more #1 than jb and also broke more records than him and he was the most successful out of a family of singers whereas bieber became relevant for covers on other pop song on YouTube and was given an album at 15 or 16 years old but Jackson was 14 when his first album came out. Check it up he released it in 1971 or 1972 so he was 14 or 15 but if he was 14 he was the youngest ever performer but already was when he performed in Jackson 5 at the age of 5. He is the best person in pop still and the King of pop and idk why but fucking wade liar Robson and james mega liar safechuck had been lying this whole time. Think about it all that time in mj trial for child molesting they said he didn't do anything and he was found not guilty. Then out of nowhere in 2013 they change that to yes he did molest us. This means they are probs just lying for attention and to make ppl be sorry for their story which is nasty, u already ruined the man's legacy when he was alive we will not let u do it when he is dead fuck all this bs molesting crap real mj fans like me know that he didnt do nothing so stop lying u two bitches Robson and safechuck I am done now *mic drop* Peace ✌️ ",
            "date": "Answered July 19, 2019",
            "views": "22",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pickle Rick",
                    "user_href": "/profile/Pickle-Rick-219"
                },
                {
                    "user_id": "Abhilash Kaushik",
                    "user_href": "/profile/Abhilash-Kaushik-8"
                },
                {
                    "user_id": "Murali Pk",
                    "user_href": "/profile/Murali-Pk-9"
                },
                {
                    "user_id": "Vicky Rko",
                    "user_href": "/profile/Vicky-Rko-3"
                },
                {
                    "user_id": "Tao Xie",
                    "user_href": "/profile/Tao-Xie-46"
                },
                {
                    "user_id": "Tushaam Agrawal",
                    "user_href": "/profile/Tushaam-Agrawal"
                },
                {
                    "user_id": "Gabriella Zavul",
                    "user_href": "/profile/Gabriella-Zavul"
                },
                {
                    "user_id": "Anas Ahmad",
                    "user_href": "/profile/Anas-Ahmad-161"
                },
                {
                    "user_id": "Azar Muhammed",
                    "user_href": "/profile/Azar-Muhammed-5"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/I-AM-NoOb-12"
                }
            ]
        }
    ]
}