{
    "title": "Who are the most acclaimed jazz musicians alive today? - Quora",
    "tags": [
        "Jazz Music",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Patrick McKenzie",
                "href": "/profile/Patrick-McKenzie-3"
            },
            "answer_text": "No matter what answer I give, it will be somewhat bias because there are so many great living Jazz musicians. So I will just list some that I’ve personally have heard myself. On Trumpet, Jon Faddis, Roy Hardgrove, Wynton Marsalis, James Morrison, Ryan Kisor, Bryan Lynch and this list would be too long. Next, would be drums: Steve Gadd, Dennis Chambers, Herlin Riley, Jeff Watts and Gilrado Piloto. On Sax, Sonny Rollins, Joe Lovano, Kenny Garret, Branford Marsalis, Gary Bartz, Todd Williams III, and Ron Blake. There are several more but once again a very long list. Trombone, Fred Wesley, Steve Turré, Conrad Herwig, Trombone Shorty, and Wycliffe Gordon. Piano and/or keyboards, Greg Philliganes, Herbie Hancock, Bennie Worrell, Joey Defrancesco, Barry Harris and this list is long as well. On Guitar, George Benson, Pat Matheny, Raphael Saadiq ( bass guitar too ) Mike Stern. On Bass guitar, Marcus Miller, Peter Washington, Charlie Haden, Brian Bromberg, Ron Carter and many more. Anyone of these players sound awesome as a soloist too and there are so many that I have yet to mention that fit this list too. I hope this help. ",
            "date": "Answered September 20, 2018",
            "views": "35",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Casey Burnett",
                    "user_href": "/profile/Casey-Burnett"
                },
                {
                    "user_id": "Ron Swanson",
                    "user_href": "/profile/Ron-Swanson-22"
                },
                {
                    "user_id": "Novia Antoinette",
                    "user_href": "/profile/Novia-Antoinette"
                },
                {
                    "user_id": "Muiris Mac Cartaine",
                    "user_href": "/profile/Muiris-Mac-Cartaine"
                },
                {
                    "user_id": "Ed Ardzinski",
                    "user_href": "/profile/Ed-Ardzinski"
                },
                {
                    "user_id": "Eddie Rogers",
                    "user_href": "/profile/Eddie-Rogers-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Huw Peterson",
                "href": "/profile/Huw-Peterson"
            },
            "answer_text": "These are the most acclaimed jazz musicians alive today whom I am familiar with. The first three especially are among the greatest ever. From before the fusion era: Wayne Shorter, saxophoneMcCoy Tyner, pianoSonny Rollins, saxophoneCurtis Fuller, tromboneHerbie Hancock, pianoJimmy Heath, saxophoneLou Donaldson, saxophoneBenny Golson, saxophoneJimmy Cobb, drumsRoy Haynes, drumsRon Carter, bassGeorge Benson, guitarHere are major fusion jazz musicians that are still alive: Billy Cobham, drumsStanley Clarke, bassJack Dejohnette, drumsJohn McLaughlin, guitarJean-Luc Pony, violinChick Corea, pianoPat Metheny, guitarAl Di Meola, guitarJeff Beck, guitarJeff Lorber, pianoThe album cover, album and song that first got me into Wayne Shorter, the greatest jazz legend who is still alive and playing (Sonny Rollins can’t play anymore):  McCoy Tyner, the greatest Jazz legend I have seen live. He is still touring, catch him if you get a chance!  ",
            "date": "Answered December 14, 2018",
            "views": "42",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Oscar S Michel",
                    "user_href": "/profile/Oscar-S-Michel"
                },
                {
                    "user_id": "Kenneth E MacAlister Jr",
                    "user_href": "/profile/Kenneth-E-MacAlister-Jr"
                },
                {
                    "user_id": "Michelle LoPrete",
                    "user_href": "/profile/Michelle-LoPrete"
                },
                {
                    "user_id": "Rich Sackett",
                    "user_href": "/profile/Rich-Sackett"
                },
                {
                    "user_id": "Audrey Chung",
                    "user_href": "/profile/Audrey-Chung-6"
                },
                {
                    "user_id": "Muiris Mac Cartaine",
                    "user_href": "/profile/Muiris-Mac-Cartaine"
                },
                {
                    "user_id": "Jocke Enegren",
                    "user_href": "/profile/Jocke-Enegren"
                }
            ]
        }
    ]
}