{
    "title": "Who is better, Travis Scott or Kanye West? - Quora",
    "tags": [
        "Travis Scott (musician)",
        "Kanye West (musician)",
        "Rap Music",
        "Hip Hop and Rap Artists",
        "Hip Hop Music",
        "Musicians",
        "Celebrities",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Patrick Gat",
                "href": "/profile/Patrick-Gat"
            },
            "answer_text": "Wow, this may just be the most obvious question I've ever read. Well, let's list the achievements of each rapper. Kanye's achievements: -Signed several successful rappers (Big Sean, for example) who are making it big now. -Is widely considered to be one of the best rappers of all time. -Has collaborated with countless other artists. -His album My Dark Twisted Fantasy is considered to be one of the greatest albums of all time. -Has inspired probably hundreds of rappers. -Has still maintained his fanbase. Travis Scott's achievements: -Made a hit song that only went famous thanks to Drake -Songs are so constantly overplayed that it genuinely bothers me, because I can't go into a parking lot without someone blasting Sicko Mode or Stop Trying To Be God. So yeah, I think the answer is obvious. ",
            "date": "Answered December 29, 2018",
            "views": "746",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "T Prez",
                    "user_href": "/profile/T-Prez-1"
                },
                {
                    "user_id": "John Smith",
                    "user_href": "/profile/John-Smith-25731"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gina Murrell",
                "href": "/profile/Gina-Murrell-2"
            },
            "answer_text": "Whoever thinks Kanye is better is a Maga hat wearing jackass that gobbles up bullshit faster than it can be fed to them. He, like his wife, is a self promoting narcissist that only cares about himself. I wish he would lose his voice forever and we would never have to hear him rudely take over a stage ever again. He is trash. ",
            "date": "Answered December 29, 2018",
            "views": "179",
            "upvotes": "0"
        }
    ]
}