{
    "title": "Who danced the best on the song 'Pinga' from Bajirao Mastani, Deepika or Priyanka? - Quora",
    "tags": [
        "Bajirao Mastani (2015 movie)",
        "Bollywood"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sangeerth P",
                "href": "/profile/Sangeerth-P"
            },
            "answer_text": "The song Pinga ga pori is a traditional, gorgeous, attractive, charming song which took nearly 25 days for its shoot. And i would say Priyanka danced better than Deepika. I say so because of the following reasons. This following image shows her stupendous intro over the song. 2. And now this step which is the most untold step in the song would ever make any one wonder how she danced as it was the most difficult step in the complete song.  3. The complementary step for the same line would this and this step would be comparatively easier to be performed than the other which Priyanka performed  4. And here the josh with which Priyanka danced wont be matched to Deepika who would dance with some lesser energy than her senior.  5. And in this step it would be difficult for Priyanka to balance her body but she managed it in a lesser time. The complementary step for the same line danced by Deepika. And she can’t cope with those steps and it took many days for the director to shoot this scene.   6. And in this both of them were given hard steps in which Deepika was unable to co-operate. And hence it too delayed the shooting of the song.  And these scenes and evidences clearly says Priyanka’s dance was more felicitous than Deepika’s dance. Regards Sangeerth P And sorry for my English ",
            "date": "Answered September 28, 2017",
            "views": "29",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harshinee Mahesh",
                    "user_href": "/profile/Harshinee-Mahesh-1"
                },
                {
                    "user_id": "Ratan Patil",
                    "user_href": "/profile/Ratan-Patil-7"
                },
                {
                    "user_id": "Jayasimha Mandya",
                    "user_href": "/profile/Jayasimha-Mandya"
                },
                {
                    "user_id": "Roshni Reju",
                    "user_href": "/profile/Roshni-Reju"
                },
                {
                    "user_id": "Kc",
                    "user_href": "/profile/Kc-65"
                },
                {
                    "user_id": "Janhavi Kumthekar",
                    "user_href": "/profile/Janhavi-Kumthekar"
                },
                {
                    "user_id": "Anju Venugopalan",
                    "user_href": "/profile/Anju-Venugopalan-4"
                },
                {
                    "user_id": "Neha Kumari",
                    "user_href": "/profile/Neha-Kumari-1716"
                },
                {
                    "user_id": "Nazmira Saloojee",
                    "user_href": "/profile/Nazmira-Saloojee"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/SRIVIDYA-PRABAKAR"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aditya Thete",
                "href": "/profile/Aditya-Thete-2"
            },
            "answer_text": "Pinga was traditional marathi dance form song from movie Bajirao Mastani , tthe stunning looks and dance moves by Priyanka Chopra and Deepika Padukon added a classical colours to it , with choreography by Remo D’Souza . The song was filmed on womens haldi-kumkum program in film. Judging the dance is very difficult task when you have such a talented cast filming it. But as per my observations , the costumes suited Priyanka much better than Deepika (due to her height) and thats the only reason Priyanka’s moves looked from clean thn Deepika . Here's the rating for the song: Priyanka Chopra : 9.4/10 Deepika Padukon : 9.2/10 ",
            "date": "Answered June 19, 2018",
            "views": "12",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Janhavi Kumthekar",
                    "user_href": "/profile/Janhavi-Kumthekar"
                },
                {
                    "user_id": "Shruthy Sarma",
                    "user_href": "/profile/Shruthy-Sarma"
                },
                {
                    "user_id": "Aastha Arunika",
                    "user_href": "/profile/Aastha-Arunika"
                },
                {
                    "user_id": "Ashwini Umbare",
                    "user_href": "/profile/Ashwini-Umbare-1"
                },
                {
                    "user_id": "Mayuri Sahu",
                    "user_href": "/profile/Mayuri-Sahu-7"
                },
                {
                    "user_id": "Anjali",
                    "user_href": "/profile/Anjali-133"
                },
                {
                    "user_id": "Jasleen Gaur",
                    "user_href": "/profile/Jasleen-Gaur"
                },
                {
                    "user_id": "Nandini Vasaikar",
                    "user_href": "/profile/Nandini-Vasaikar"
                }
            ]
        }
    ]
}