{
    "title": "Who is the worst guitar player? - Quora",
    "tags": [
        "Guitarists",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Craig De Witt",
                "href": "/profile/Craig-De-Witt-1"
            },
            "answer_text": "I once was playing a gig and made a few very obvious (to me) mistakes. There were some very competent muso’s there and a few radio sound engineers. I felt a bit embarrassed but got the best advice from another musician at the time. He said “don’t feel bad about the mistakes, If the others could do better they would have been playing instead of you.” My opinion, the worst guitar players are those who hang back yet critisise others. Why is the world bent on whose the best and whose the worst? Its madness. We are all trying to be one person, which aside from being impossible would make the world a singularly boring place. Lil Wayne poses and appears to be a fraud, well don’t buy his music or support him. What sooo many people do?, well maybe they are just like him, or maybe they don’t know they are being duped. You dont like Ed because Ed plays three chords? Same advice above. Lets see how you finger pick those three chords to achieve the same as he has. Music is about simplicity and complexity in just the right combination to make sounds YOU as the individual can relate to, can enjoy, and can feel. Everything else is meaningless. If one great actor playing one note again and again does it for you, great, if one technical maestro shreds at a million notes a minute, Fantastic. If not turn them off and look elsewhere. If you start to play a solo or riff over a piece of music and start on a bum note, your ear should immediately tell you that, and if you are sharp and quick enough to slide right out of there up or down to a correct note in the scale, that singular mistake could possibly give you the next best hook for a song you didn’t know you had in you. For me the best guitarists are the ones that get me to feel the music, the emotion, the tension, the release. The worst, aside from what I’ve already stated, I wouldn't know, I turn them off when I don’t like their styles. ",
            "date": "Answered August 23, 2019",
            "views": "29",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dany Stark",
                    "user_href": "/profile/Dany-Stark-6"
                },
                {
                    "user_id": "Aaron Puckett",
                    "user_href": "/profile/Aaron-Puckett"
                },
                {
                    "user_id": "Fred Elfrd",
                    "user_href": "/profile/Fred-Elfrd-1"
                },
                {
                    "user_id": "Matthew Stanislawski",
                    "user_href": "/profile/Matthew-Stanislawski"
                },
                {
                    "user_id": "Lucas Amaral",
                    "user_href": "/profile/Lucas-Amaral-25"
                },
                {
                    "user_id": "Tina Michels Nelson",
                    "user_href": "/profile/Tina-Michels-Nelson-1"
                },
                {
                    "user_id": "Nickolas Muilaert",
                    "user_href": "/profile/Nickolas-Muilaert-2"
                },
                {
                    "user_id": "Steve McLaughlin",
                    "user_href": "/profile/Steve-McLaughlin-41"
                },
                {
                    "user_id": "Mohit Kumar",
                    "user_href": "/profile/Mohit-Kumar-537"
                }
            ]
        },
        {
            "author_info": {
                "name": "Subhankar Das",
                "href": "/profile/Subhankar-Das-12"
            },
            "answer_text": "Lil Wayne: Forget about playing guitar, that bloke doesn’t even know how to hold and pick a guitar right. The worst part about him is that he tries to show off that he’s a good guitarists and there are his stupid fans who believe that he’s a good guitarist. Henry Kaiser: The very proof that the best gear in the world won’t make you the best musician. He’s rich as heck and buys extremely pricey boutique amps and stuff, like Dumble amps, Pete Cornish effect pedals, etc, but when it’s about playing right, he outright sucks a big one. He’s one of the few guitarists who can actually make a Dumble amp sound as horrible as a crappy solid state amp. His music is just an incoherent mess of horrendous noises. And the worst part is that some people believe that he’s actually doing some unique Avant-Garde stuff. He has literally made a career for himself by faking that he is doing something new and unique. The truth is that he has no idea about playing guitar. Ed Sheeran: All he does is play three chords again and again while singing the most cringeworthy pop songs. Nick Jonas: His guitar playing is totally sloppy, he’s a total poser who tries hard to portray himself as a stereotypical pop rock guitarist but fails miserably. ",
            "date": "Updated July 7, 2019",
            "views": "26",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jim Bailey",
                    "user_href": "/profile/Jim-Bailey-101"
                },
                {
                    "user_id": "Shigeru Andres",
                    "user_href": "/profile/Shigeru-Andres"
                },
                {
                    "user_id": "Jared McCartney",
                    "user_href": "/profile/Jared-McCartney-6"
                },
                {
                    "user_id": "Ami Shah",
                    "user_href": "/profile/Ami-Shah-452"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Shaimal"
                },
                {
                    "user_id": "José Cruz Parker",
                    "user_href": "/profile/José-Cruz-Parker-1"
                },
                {
                    "user_id": "Nickolas Muilaert",
                    "user_href": "/profile/Nickolas-Muilaert-2"
                },
                {
                    "user_id": "Amrit Janardhanan",
                    "user_href": "/profile/Amrit-Janardhanan-1"
                },
                {
                    "user_id": "Tommy Wimmer",
                    "user_href": "/profile/Tommy-Wimmer"
                },
                {
                    "user_id": "John Perkins",
                    "user_href": "/profile/John-Perkins-205"
                }
            ]
        }
    ]
}