{
    "title": "Who is the fastest heavy metal guitar player alive? - Quora",
    "tags": [
        "Heavy Metal Bands",
        "Metal (music)",
        "Heavy Metal (music)",
        "Guitarists",
        "Playing Guitar",
        "Guitars",
        "Rock Music",
        "Musical Instruments",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Moffett",
                "href": "/profile/John-Moffett-21"
            },
            "answer_text": "I am would say Michael Angelo Battio he is from the 80s band Nitro. If you doubt this go to YouTube and search his name and listen to “speed kills” you will be amazed! He is also ambidextrous and shreds at incredible speeds with both hands! He uses a special 2 neck guitar with the necks going in opposite directions and uses legato, hammer ons and pull offs etc… Although technically he is a master I don't choose him in my list of guitar heroes. He is not the best songwriter in his genre but rather just an anomaly who should be playing in a circus or on a cruise ship as an exotic act of guitarist and show off not “showman” which he is very talented and has incredible showmanship. I compare him to a mathematician more than an artist who can play with soul. I am not putting the man down either ,I own his instructional CDs and speed does kill! ",
            "date": "Answered October 18, 2020",
            "views": "350",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Taylor Hardy",
                    "user_href": "/profile/Taylor-Hardy-31"
                },
                {
                    "user_id": "Ehab M Mattar",
                    "user_href": "/profile/Ehab-M-Mattar"
                },
                {
                    "user_id": "Mario Lucki",
                    "user_href": "/profile/Mario-Lucki"
                },
                {
                    "user_id": "Abhijeet Rahane",
                    "user_href": "/profile/Abhijeet-Rahane"
                },
                {
                    "user_id": "Jim Clem",
                    "user_href": "/profile/Jim-Clem-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eden Rose",
                "href": "/profile/Eden-Rose-14"
            },
            "answer_text": "A lot people rightfully cite Michael Angelo Batio. I would agree that the man is incredible at what he does. His playing, whilst doing nothing for my sensibilities, is superhuman. For most guitarist his level of technical proficiency is completely unobtainable. That said, there is a truly awful metal band called DragonForce. The lead guitarist, Herman Li, is so fast that it actually sounds stupid, like a video game. Li is probably the fastest guitarist I have ever heard (although there is debate as to whether or not his sound is a bit of studio trickery). Be warned. Fast does not equal good.  ",
            "date": "Answered October 23, 2020",
            "views": "839",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Taylor Hardy",
                    "user_href": "/profile/Taylor-Hardy-31"
                },
                {
                    "user_id": "Edwin Ernst",
                    "user_href": "/profile/Edwin-Ernst"
                },
                {
                    "user_id": "Rich Finley",
                    "user_href": "/profile/Rich-Finley-3"
                },
                {
                    "user_id": "Sydney Gouveia",
                    "user_href": "/profile/Sydney-Gouveia-2"
                },
                {
                    "user_id": "Ehab M Mattar",
                    "user_href": "/profile/Ehab-M-Mattar"
                }
            ]
        }
    ]
}