{
    "title": "Who was your favourite musician when you were a teenager? - Quora",
    "tags": [
        "Pop Music",
        "Rock Music",
        "Music Recommendations",
        "Music Industry",
        "Musicians",
        "Teenagers and Teenage Years",
        "Music",
        "Experiences in Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Oglesby",
                "href": "/profile/Steve-Oglesby-2"
            },
            "answer_text": "Same as now. I was a teenager until late June 1969. Beethoven, Mozart, Sibelius, Tchaikovsky, Coplin, Bernstein, Rogers, Vaughn, Hammerstein, Brubeck, Hancock, Ellington, Berry, Franklin, Green, Lennon, McCartney, Zimmerman, Hendrix, Allman, Clapton, Hayward, Bruce, Bruford, Entwhistle, Squire, Moon, Santana, Beck, Anderson…you get the point. There are many I left out, because they were groups: The Association, The Four Tops, The Beach Boys, Paul Revere and the Raiders. Also, among those I mentioned are other great musicians who were contemporaries of those listed, but no less worthy of recognition because they were not at the top of my mind. I was lucky to grow up when popular music exploded from a 3 minute ditty to symphonic masterworks that were no longer playable on normal radio. I was also lucky that not-so-normal radio (FM) would play those 10-20 minute compositions. There is no list that can include all the great purposed sounds that helped shape my life. Apologies for any misspellings. ",
            "date": "Answered May 19, 2019",
            "views": "139",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Paul Bennett",
                    "user_href": "/profile/Paul-Bennett-215"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kyle Lee",
                "href": "/profile/Kyle-Lee-32"
            },
            "answer_text": "The same one is my favorite now as well Corey Taylor the lead singer of both slipknot and stone sour. I fell in love the first slipknot song I heard which was pulse of the maggots. Their raw style and anger just…. Really appealed to me Have a listen to their latest single unsainted from their new album we are not your kind. Slipknot - Unsainted [OFFICIAL VIDEO] ",
            "date": "Answered May 19, 2019",
            "views": "51",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jeremiah D. Seitz",
                    "user_href": "/profile/Jeremiah-D-Seitz"
                }
            ]
        }
    ]
}