{
    "title": "Who is the best 3-piece band of all time? - Quora",
    "tags": [
        "Progressive Rock Bands",
        "Music Bands",
        "Rock Bands",
        "Bands (music)",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jerome Lee",
                "href": "/profile/Jerome-Lee-79"
            },
            "answer_text": "Thin Lizzy had 3 guys (Downey, Lynott, Bell.) That great Irish band which put out some amazing tracks from their first album onwards. As the story goes, none of them could stand in the shadows, and everyone had to come forward and rock. Just listen to any track of their debut: on songs like “Ray Gun” you can hear that wailing guitar riff which kind of reminds me of a combination of the riffs of “Voodoo Child” and “Peace Frog” by Hendrix and the Doors. Then on “Remembering” the second half is a masterpiece - the bass and drums and guitar are all clearly audible and just pound along at breakneck pace. On that note, Jimi Hendrix Experience needs no introduction though. Of course, a revolutionary band, Hendrix’s influence on guitar playing is vast. All 3 albums were classics. And I always thought Mitch Mitchell was one of the most underrated and best drummers ever, same vein as Ginger Baker… So, then, Cream. Only 4 albums but some of the best heavy blues/psychedelic/hard rock ever. The riff on Sunshine inspired a few thousand hard rock bands. White Room will always be my favourite for the searing guitar solo at the end and Baker going mad on the drums throughout. Clapton had success with other projects, but that was always my favourite era of his. Rush. Very progressive and heavy rock/proto-metal on the first few albums, with quite a few exercises in complexity. They were as heavy as King Crimson, and like them, they could really find ways to spend 10 minutes. Neil and Geddy are usually considered as in the top 3 greatest drummer and bassist ever (subjective though.) That was one hell of a rhythm section. The Police. Not that bad. ",
            "date": "Answered October 28, 2020",
            "views": "39",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Eric Johnson",
                "href": "/profile/Eric-Johnson-774"
            },
            "answer_text": "I'm alway hesitant to do \"Who's best\", especially of all time. As for 3-piece bands, well obviously there's Rush but there's also Emerson, Lake and Palmer. However there's also Cream, Jimi Hendrix Experience, Stevie Ray Vaughan and Double Trouble, the Police, Robin Trower etc., but what about The Who and Led Zeppelin? They were also 3-piece bands but each with a vocalist. Rush was a hell of a prog band but so was ELP…while Cream and Grand Funk Railroad showed us what a 3- piece could do, Zeppelin was the blueprint for rock bands to come. The Police were arguably the top act of their generation, the Who pretty much invented the Rock Opera and were the godfathers of punk rock and I don't even know what I need to say about Hendrix and Stevie Ray….greatness needs a proper band. I would be hard put to call any of these bands 'better' than the others. They were all the best at what they were and I loved them all. I think there needs to be a different criteria. ",
            "date": "Answered October 22, 2020",
            "views": "446",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mark H. Spud Friedman",
                    "user_href": "/profile/Mark-H-Spud-Friedman"
                },
                {
                    "user_id": "Me Myself",
                    "user_href": "/profile/Me-Myself-625"
                },
                {
                    "user_id": "Michael D. Mirne",
                    "user_href": "/profile/Michael-D-Mirne"
                },
                {
                    "user_id": "James Welch",
                    "user_href": "/profile/James-Welch-26"
                },
                {
                    "user_id": "Graham Giles",
                    "user_href": "/profile/Graham-Giles"
                },
                {
                    "user_id": "George Peterson",
                    "user_href": "/profile/George-Peterson-13"
                }
            ]
        }
    ]
}