{
    "title": "Who are the top 10 fake YouTubers on YouTube? - Quora",
    "tags": [
        "YouTube Personalities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Elvir Mujkanovic",
                "href": "/profile/Elvir-Mujkanovic"
            },
            "answer_text": "Oh man, there are too many to keep at 10. But here we go! 10.) Faze Banks - He has recently been in a allegation of a club (won’t name but google it if interested) assaulted his girlfriend and himself. This is the second time now that he’s been involved in an allegation at a club. This is getting ridiculous at this point. 9.) Marina Joyce - She has been purposefully acting odd in an attempt to start a trend called (#savemarinajoyce) in the end. It’s been nothing but a publicity stunt. I mean, just google Marina Joyce conspiracy theories on youtube and you’ll be stuck in an everlasting rabbit hole. 8.) Logan Paul - Welp, he’s just a stereotypical scumbag. He’s done illegal stuff in places like Italy, and has been acting like a fool in public over in America. Allegations spread that he was cheating with his brother (Jake Paul’s) girlfriend. He’s scummy. I don’t like him. 7.) Matthew Santoro - Plagiarizing smaller sites and have been crediting none of them and using them for his own personal profit in his Top 10 Videos. Again, scummy. Bald. But scummy. 6.) TmarTn - So basically, he hosted a video game gambling site. He was advertising it, but he never said he was a co owner for it. So basically, he was fooling kids into spending thousands on virtual shiny knives and making a complete profit from it. Scummy. Nice hair. But scummy. 5.) Onision - I hate him. I’d put him lower but it would be an insult to the number 1 spot. He acts like a two year old who was neglected by his parents, and it’s disappointing to see how our culture has evolved. 4.) Alissa Violet - She’s the girlfriend of Faze Banks, and I guess sexism doesn’t prevail in this scenario because they’re both scummy. Its that she’s even scummier. She’s been involved with the recent allegations with Faze Banks. She was “assaulted” even though this club has revealed FOOTAGE of them both being hammered and being complete ******** to the management as well as other civilians. Faze Banks tried swinging on a security guard multiple times. And Alissa Violet was recording civilians on the street to annoy them. But when karma hits them back. They turn to the victims card. She tried saying that security touched her posterior, and that security put Banks in a headlock. 3.) Ksi - There’s nothing to respect about him. He made fake drama over youtube with MULTIPLE you tubers, and in the end. He made a video admitting that the drama was fake, and he was laughing all through it. He made video after video, song after song. All for it to end with him getting money by using his fans as view bots. It’s honestly down right scummy. I hate this man. 2.) Keemstar - He’s gotten slightly better. But it’s still a low. Keemstar live streaming and blatantly using the N-Word as an insult. He hopped onto the trashy music bandwagon, and the worst of all. He protects the scummy people I name above. Protects them! I hate this gnome. 1.) Ricegum - He earned his youtube fame by making fun of 12–13 year olds for making “Bad music/videos,” but ironically enough. 1 year later, he does the same. He’s a lying, manipulative, and a downright hypocrite. His fanbase has the mental capacity of a rock, and whatever bad music video makes. His fans just eat it up. Calling it: “Lit,” “Amazing,” “Better then (Insert other rapper/singer,” and it’s dreadful. I thought the Jake Paul fanboys were bad. But then you get into Ricegum’s comment section. You say anything negative about Ricegum, and you’ll be bombarded with a list of, “Kill ys,” “Trash,” “L.” It’s disappointing that 12 year olds lost good taste in music. Who here actually remembers Dynamite by Taoi Cruz. Nope, just me? How about Break Your Heart? Still me? ",
            "date": "Answered December 2, 2017",
            "views": "168",
            "upvotes": " View 33 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aceng Safia",
                    "user_href": "/profile/Aceng-Safia-1"
                },
                {
                    "user_id": "Ethan Harper",
                    "user_href": "/profile/Ethan-Harper-31"
                },
                {
                    "user_id": "Michelle Bond",
                    "user_href": "/profile/Michelle-Bond-10"
                },
                {
                    "user_id": "Jason",
                    "user_href": "/profile/Jason-3142"
                },
                {
                    "user_id": "Shreya M",
                    "user_href": "/profile/Shreya-M-19"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Noah-R-77"
                },
                {
                    "user_id": "Diego Lozano",
                    "user_href": "/profile/Diego-Lozano-40"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Candy-Sweet-20"
                },
                {
                    "user_id": "Shreena Patel",
                    "user_href": "/profile/Shreena-Patel-16"
                },
                {
                    "user_id": "Matthew Morton",
                    "user_href": "/profile/Matthew-Morton-37"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brandon Yen",
                "href": "/profile/Brandon-Yen-5"
            },
            "answer_text": "According to a video, here’s a list: 10. Zoella Zoella was a popular YouTube star and decided to write her own book. Shortly after the public quickly found out that she didn’t even write the book herself. 9. RichKidsTV After one of the kids hosted a raffle in which he would donate money to a charity, he decided to donate the money to his favorite charity of all - his bank account. 8. Keemstar He basically called people pedophiles when they showed the slightest bit of it. Turns out none of the people he accused were actually pedophiles! 7. Marina Joyce She acted weird on camera to start the #savemarinajoyce trend. She really just wanted some attention. 6. Sam and Nia They tried to make the public believe that they were going to have another baby, but really just wanted more attention and subscribers. A couple days later they announced that they had a miscarriage… sketchy… 5. Sam Pepper Sam Pepper sexually assaults women by groping them and denying it when they asked him if he did it. He also kidnapped his friend and scared him so badly he was crying. Later he tried to cover it up by saying it was all staged. 4. LonelyGirl15 She started acting weird on camera and did weird things. Later the public discovered that she was a hired actress and had scripts she read off of. She even had her own team of writers to write the script for her. 3. FouseyTube He hired people off craigslist to do a uber driving prank, where he hops into cars and insists that they are uber drivers. He also staged a fight with RiceGum. Hmmm…. 2. Matthew Santoro He’s a pretty popular youtuber, but he’s been caught using lists off of a site for his videos, like “10 people who do weird things”. He also uses the same people in the same order and the same information on the site. Finally, #1: TmarTn TmarTn constantly made videos about how you sign up with this site where you enter your CSGO skins/weapons and get things that are equally as valuable, and he always wins. However, it was revealed that he owned the site and that was illegal. So there’s your list! ",
            "date": "Answered November 25, 2017",
            "views": "485",
            "upvotes": " View 80 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Steve Henry",
                    "user_href": "/profile/Steve-Henry-56"
                },
                {
                    "user_id": "Michelle Bond",
                    "user_href": "/profile/Michelle-Bond-10"
                },
                {
                    "user_id": "Brandy Farmer",
                    "user_href": "/profile/Brandy-Farmer-7"
                },
                {
                    "user_id": "Evan Mongeon",
                    "user_href": "/profile/Evan-Mongeon"
                },
                {
                    "user_id": "Latrell Llana",
                    "user_href": "/profile/Latrell-Llana-1"
                },
                {
                    "user_id": "Alex Gould-Arocha",
                    "user_href": "/profile/Alex-Gould-Arocha"
                },
                {
                    "user_id": "Mukul Raj Kaushal",
                    "user_href": "/profile/Mukul-Raj-Kaushal-3"
                },
                {
                    "user_id": "Matthew Morton",
                    "user_href": "/profile/Matthew-Morton-37"
                },
                {
                    "user_id": "A. Anuma",
                    "user_href": "/profile/A-Anuma"
                },
                {
                    "user_id": "Aaron Sison",
                    "user_href": "/profile/Aaron-Sison-2"
                }
            ]
        }
    ]
}