{
    "title": "Who likes grunge music apart from me? - Quora",
    "tags": [
        "Grunge Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Justin M. Wilsey",
                "href": "/profile/Justin-M-Wilsey"
            },
            "answer_text": "I do, I actually know a few bands from the Pacific Northwest that can be labeled as ‘Grunge’, and I am also a solo ‘Grunge’ artist (Justin M. Wilsey). The thing about ‘Grunge’ is it just a corporate label invented to pile all bands from PNW. For example Alice in Chains, Mudhoney, Melvins, Screaming Trees, Soundgarden, Pearl Jam and Nirvana are all labeled ‘Grunge’ but all sound different. I consider such acts as Sonic Youth, Neil Young, Tom Petty all as Grunge type bands, but there is also newer bands like Badflower, The Glorious Sons, and The Fever 333 who I also consider Grunge. I prefer the term Alternative Rock, and most people in the Seattle Area will shun away from the word ‘Grunge’. ‘Grunge’ is such a broad term that its hard to find listeners of it, but most alternative bands have a ‘Grunge’ sound. People who listen to Folk rock, Noise rock, 90s alt rock, New Wave Rock, basically can be lumped into the ‘Grunge’ Genre. When describing my music I prefer the term ‘Non-Genre Specific’, so as not to be caught up in the drama of labels. ",
            "date": "Answered May 19, 2019",
            "views": "116",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dana O'Neill Studer",
                    "user_href": "/profile/Dana-ONeill-Studer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marko Perälä",
                "href": "/profile/Marko-Perälä"
            },
            "answer_text": "Me ",
            "date": "Answered May 19, 2019",
            "views": "8",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dana O'Neill Studer",
                    "user_href": "/profile/Dana-ONeill-Studer"
                }
            ]
        }
    ]
}