{
    "title": "Who had sung the highest number of songs? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Roel Thierie",
                "href": "/profile/Roel-Thierie"
            },
            "answer_text": "I am not sure how to interpret your question. If you want to know who wrote/created the most songs in the world and if you limit the ambit of this question to pop music (i.e.: the genre of popular music that originated in its modern form in the United States and United Kingdom during the mid-1950s and that includes pop, folk and rock songs that made it into the charts), then I think Bob Dylan would be a strong candidate. He has has released 36 studio albums, 91 singles, 26 notable extended plays, 40 music videos, 12 live albums, 13 volumes comprising The Bootleg Series, 19 compilation albums, 13 box sets and 7 soundtracks as main contributor. This one's my personal favorite Dylan song:  cf. https://en.wikipedia.org/wiki/Bob_Dylan_discographyCf. https://ftw.usatoday.com/2015/11/bob-dylan-songs-ranked-no-1-every-song-mississippi-like-a-rolling-stone-visions-of-johanna-rainy-day-woman Bob Dylan was awarded the Nobel Prize in Literature on Thursday, so we thought we’d look back at this ranking of all 359 of his songs. Bob Dylan releases the 12th volume of his much-heralded Bootleg Series on Friday. This one — alternate takes, rehearsals and false starts from his mid-60s heyday — is one of the best collections of Columbia’s tremendous archival material from America’s greatest artist. To honor the release, FTW ranked the 350-plus songs Dylan has put out in his career. The criteria was simple: We ranked studio releases only (including movie soundtracks) or songs that Dylan played in concert more than 100 times. Ironically, we couldn’t rank the bootlegs (official or not, though we wanted to) or else this list would be well into the thousands. Each of the top 25 songs is accompanied by comment, the rest of the top 100 has some intermittently sprinkled throughout and then the next 259 songs have Youtube clips of some of the deeper tracks (or in the case of the bottom 100, the ones I loathe the least). 1. Mississippi ( ”Love & Theft”, 2001) Four years after his career was revived with Time Out of Mind, Dylan released a single in the summer of 2001 (Po’ Boy) and announced that his new album, “Love & Theft” would be released on Sept. 11. Though the album was recorded far before that horrific day, the connections are chilling, especially on the album standout, Mississippi. It includes lines about being trapped in a city that has a “sky full of fire” and “pain pourin’ down,” not to mention the endlessness of emptiness. But all of Dylan’s work has been as evocative as this, even from when he was a 21-year-old folk singer trying to make it in the Village. The greatest Dylan songs are about that inexorable march toward the end. But never is he so wistful about the wasted years, lost love and loneliness as he is on Mississippi. When he sings about that great mistake of his life — staying in Mississippi a day too long — you can practically see a wry smile on his face, as if that memory of the perfect woman at the perfect time is better than chasing that dream. 2. Visions Of Johanna ( Blonde on Blonde, 1966) If ever Dylan captured that thin, wild, mercury sound he craved, it was on his 1966 masterpiece, Blonde on Blonde. But Visions broke that mold of the first side of the first record — a haunting, acoustic journey about a mysterious woman who may or may not exist. Few, if any, of Dylan’s songs are about drugs, but rarely are they more prevalent than on a handful of BoB songs. I mean, one doesn’t write: “But Mona Lisa musta had the highway blues you can tell by the way she smiles/See the primitive wallflower freeze/When the jelly-faced women all sneeze/Hear the one with the mustache say, ‘Jeez, I can’t find my knees.’/Oh, jewels and binoculars hang from the head of the mule/But these visions of Johanna, they make it all seem so cruel” without a little speed kick. Shoot, that makes Lucy In The Sky With Diamonds sound like kiddie lit. Some would argue this is Dylan’s greatest song. For me, the top two alternate every few months or so. They’re both pure brilliance, among the top 10 rock song in history, as is the next song on our list. 3. Like A Rolling Stone ( Highway 61 Revisited, 1965) Bruce Springsteen said at Dylan’s Rock N’ Roll Hall of Fame induction that the first time he heard the song “that snare shot sounded like somebody had kicked open the door to your mind.” Having been a Dylan fan for 25 years, I think of that quote often: What was it like for a teenager, adult or anyone to open up the Highway 61 vinyl, put it on the turntable and drop the needle to hear that opening note and then the full, luscious sound that followed? Rolling Stone had this as No. 1 on their list of 500 best songs ever and who can argue? The Beatles had released (the underrated) Help! just a few days before Highway 61 and while that album is wonderful in its own right, it was barely in the same universe as Highway. Even Rubber Soul and Revolver couldn’t catch up. The Beatles would have to wait until Sgt. Pepper’s, two years later (and after Blonde on Blonde), before their grand creation. LARS is the Dylan song that initiates most in to the Dylan fraternity. It’s his biggest hit. And it has every damn right to be. 4. Abandoned Love ( Desire outtake, 1975) Bounced from Desire for the forgettable Joey (a song about the mobster Joey Gallo who had been gunned down years earlier), Abandoned Love would have turned Desire from a respectable follow-up to Blood On The Tracks to another mid-70s masterpiece. The Scarlet Rivera violin licks here are as good as anything that made the album. 5. Not Dark Yet ( Time Out of Mind, 1997) Dylan hadn’t yet had his brush with death when he wrote Not Dark Yet, which makes the “it’s not dark yet/but it’s getting there” chorus all the more haunting. For all the bleakness on this record, it’s amazing that four years later he’d make one of his happier albums, Love & Theft. 6. The Times They Are A-Changin’ ( The Times They Are A-Changin’, 1964) If Like A Rolling Stone is taught on the first day of Dylan 101, The Times… are on the syllabus for day two. Though appropriated for countless songs that came after and almost given too much importance in the Civil Rights movement, it’s still Dylan’s classic song from the first-period of his career. 7. Shelter From The Storm ( Blood on the Tracks, 1975) “Beauty walks a razor’s edge, someday I’ll make it mine,” Dylan sings in Shelter. Nearly 40 years later, he wrote “all I know is that I’m thrilled by your kiss.” Mission accomplished? 8. Desolation Row ( Highway 61 Revisited, 1965) Though the fills of session guitarist Charlie McCoy are tremendous, providing nuance to the easy three-chord progression played by Dylan, this 11-minute album closer is highlighted by Dylan’s characters — Cinderella, Bette Davis, Romeo, Cain, Abel, the hunchback of Notre Dame, the Good Samaritan, Opheila, Noah, Einstein (disguised as Robin Hood), Dr. Filth, The Phantom of the Opera, Casanova, Nero, the Titanic, Ezra Pound and T.S. Eliot. 9. Just Like A Woman ( Blonde on Blonde, 1966) Nobody really speculates about the subject of Dylan’s greatest love ballad (though Edie Sedgwick has been thrown around), which is odd given the decades of attention people have paid to who Carly Simon was singing about in You’re So Vain. 10. Tangled Up In Blue ( Blood on the Tracks, 1975) Some part of Dylan died the day he record his immortal Tangled in a studio in Minnesota. Was it the’60s? His views of the ’60s? His marriage? Thousands upon thousands of words have been spilled on the subject and Dylan’s structure, characterizations and Shakespearean verse. It’s the song he said took 10 years to live and two years to write. But this is for certain: Never before has viciousness sounded so vivacious. 11. Girl From The North Country ( Nashville Skyline, 1969) Keith Richards likes the original better. There’s no arguing with Keith Richards, so we’ll just put the Johnny Cash duet higher and hope Keith doesn’t notice. 12. I Want You ( Blonde on Blonde, 1966) Too often on lists such as this, there’s a tendency to want to spread the wealth and let multiple albums have a track in the top 20. That’s nonsense. Blonde on Blonde is Dylan’s greatest album. Of course it’s going to have four of the top 14 spots on the rankings. 13. Lily, Rosemary And The Jack Of Hearts ( Blood on the Tracks, 1975) (The same goes for Blood on the Tracks.) The original New York version sounded like a slower, more coherent Desolation Row. The frenetic take from Minneapolis, the one which made it to the album, turns this chorus-less track into Dylan’s greatest storytelling song: 14. Stuck Inside of Mobile with the Memphis Blues Again ( Blonde on Blonde, 1966) Dylan’s narrators, whether fictional (as in this song and dozens of others) or real (like in his tremendous memoirs Chronicles or in his various protest songs about specific events), are always unreliable, especially in this classic with the “French girl” who “knows me well” or the railroad man who “smoked my eyelids and punched my cigarettes.” 15. Love Sick ( Time Out of Mind, 1997) In terms of importance, this would be in the top five, as it was the track that kicked off Dylan’s late-career renaissance (and also got him onto a Victoria’s Secret commercial.) It also made for one of the strangest moment in Grammy’s history, yes, even weider than that time Ol’ Dirty Bastard rushed Shawn Colvin’s acceptance speech by saying Wu-Tang is for the children. 16. A Hard Rain’s a-Gonna Fall ( The Freewheelin’ Bob Dylan, 1963) There are more origin stories about this one than a comic-book character. Dylan has said that every line in the song is the first line to another song he never got around to writing. He said it was a poem he never intended to perform. (Clinton Heylin, the Dylan biographer, provides solid evidence to the contrary.) The rhythm was taken from a 500-year-old ballad. And the “hard rain” was never intended to be about nuclear fallout, but a bit of everything relating to the chaos of those frightening times. Oh, and Dylan was 21 when he wrote it. 17. Love Minus Zero/No Limit ( Bringing It All Back Home, 1965) Put it on for the first time and it sounds like something you’ve heard a thousand times before, yet is wholly unique in its own right. When the Dylan classics got a remastered release a few years back, this was one of the tracks that jumped out: the embellishments by second guitarist Bruce Langhorne showed that so much more was going on than descending chords in a Dylan-esque dropped-C with a fourth-fret capo. (These alternate takes open the new Bootleg Series record and for good reason. They draw attention to the subtle nuances of how Dylan changed chords, lyrics, fills and pauses. It’s gorgeous.) 18. I Threw It All Away ( Nashville Skyline, 1969) My buddy, with whom I’ve had multiple listening Dylan parties, seen over a dozen shows with over the years and consulted with me on this list, implored me to put this lower. I complied because he’s getting married on Saturday but at some point had to say, hey, make your own list, bub. Like everything on Nashville Skyline, this is a simple song with simple, plain lyrics sung in a smooth, country croon. It’s one of Dylan’s greatest laments. 19. Baby, Let Me Follow You Down ( Bob Dylan, 1962) It’s perhaps the best song performed in the electric sets of Dylan’s famous 1966 shows — played with sneering disregard to a crowd that tried clapping to get Dylan and The Hawks off their rhythm in the “Royal Albert Hall,” show. All of it showed the versatility of Dylan: A song performed acoustically, with a harmonica of course, on Bob’s debut was now an electric showcase performed with a full band — who would eventually become The Band — that was just beginning to find its sea legs. 20. My Back Pages ( Another Side of Bob Dylan, 1964) “I was so much older then, I’m younger than that now.” 21. Absolutely Sweet Marie ( Blonde on Blonde, 1966) It wasn’t until Sweet Marie, the 11th track on a 14-song album, that Blonde on Blonde “entered fully and sublimely into what is now considered classic rock and roll,” wrote the music historian Sean Wilentz. 22. Blowin’ In The Wind ( The Freewheelin’ Bob Dylan, 1963) A great, early Dylan track, and one that helped make him famous, but loses points because the Peter, Paul and Mary version was, frankly, better. But this hit started the unyielding criticism that Dylan plagiarizes his music/lyrics, a claim he talked about with Rolling Stone last year: “People have tried to stop me every inch of the way. They’ve always had bad stuff to say about me. Newsweek magazine lit the fuse way back when. Newsweek printed that some kid from New Jersey wrote “Blowin’ in the Wind” and it wasn’t me at all. And when that didn’t fly, people accused me of stealing the melody from a 16th-century Protestant hymn. And when that didn’t work, they said they made a mistake and it was really an old Negro spiritual. So what’s so different? It’s gone on for so long I might not be able to live without it now. ’em. I’ll see them all in their graves.” 23. Restless Farewell ( The Times They Are A-Changin’, 1964) How could a 22-year-old write such a brilliant a song about a “false clock” trying to “tick out my time?” It sounds so aged, like something that could have appeared on one of Time Out of Mind. But the song, Dylan’s 90th, isn’t about death, it’s about an infamous Newsweek article/hatchet-job that claimed Blowin’ In The Wind was written by a New Jersey high-school student, hence the “dirt of gossip” and “dust of rumor” he sings of. 24. Nettie Moore ( Modern Times, 2006) The truest sign of a Dylan fan: Ask them to name their 10 favorite songs from 1997 on. If they can name three, you’ve got yourself a Dylan fan. But since so much of a music fan’s Dylan knowledge comes from just a 12-year period from 1963 to 1975, his late-career renaissance isn’t as appreciated by even great music fans. So kick back, put on the headphones and enjoy one of his 10 best from modern times. 25. 4th Time Around ( Blonde on Blonde, 1966) Known best for parodying The Beatles (and John Lennon’s) Norwegian Wood, this late BoB track reportedly upset Lennon, who felt he was being made fun of. “John treats Bob almost like a God,” Alf Bicknell, the Beatles chauffeur at the time wrote in his diary. But George Harrison thought it was about Dylan hearing Norwegian Wood and, assuming that Lennon and McCartney had written it after listening to his stuff too much, now Bob was now keeping the back-and-forth going (hence the song’s title). Dylan resisted The Beatles until he heard I Want To Hold Your Hand while driving in Colorado, right about the time you couldn’t resist them any longer. Later, Dylan would apparently put an upside down picture of The Beatles on the cover of his decidedly un-60s John Wesley Harding. 26. Red Cadillac and a Black Moustache ( Good Rockin’ Tonight: The Legacy of Sun Records, 2001) A rockabilly cover of an old Sun Record song that’s as infectious as any of the tunes made famous by the legendary Memphis music house. 27. Every Grain Of Sand ( Shot of Love, 1981) Anytime someone says Dylan lost it in the ’80s, play them this haunting, gorgeous plea for salvation. And then readily conceded that the mid-’80s were certainly lost. 28. Moonlight ( ”Love & Theft”, 2001) Though this will be lost on all but the most hardcore Dylan fans, picking this song in the old, immortal “Dylan Pool” won it for our team “The One With The Mustache.” 29. Sad-Eyed Lady Of The Lowlands ( Blonde on Blonde, 1966) Nine years after writing this 16-minute capper to Blonde on Blonde, Dylan would confirm on the Desire album what most suspected already: the sad-eyed lady he sings of was his wife Sara. 30. Only a Pawn in Their Own Game ( The Times They Are A-Changin’, 1964) The best of Dylan’s racial protest songs. It begins with a startle — “A bullet from the back of the bush shot Medgar Evers’ blood” — and doesn’t let up until we get to the murderer’s epitaph at the end. 31. Positively 4th Street (single, 1965) 32. One More Night ( Nashville Skyline, 1969) 33. Oh, Sister ( Desire, 1976) Dylan saw the fiddler/violinist Scarlet Rivera walking down 2nd Ave. and brought her into the Desire sessions. Her strings leave an indelible mark on each track, most notably on Oh, Sister, which also include a haunting vocal by the session’s background singer, Emmylou Harris. 34. Ballad of a Thin Man ( Highway 61 Revisited, 1965) A phenomenal track that’s underproduced on Highway 61 but gets its full due in concert, especially as the lead-in to the “Judas!” cry in Manchester in 1966. Play loud. 35. The Lonesome Death of Hattie Carroll ( The Times They Are A-Changin’, 1964) “Now is the time for your tears” was the great reveal in Dylan’s protest masterpiece, one with lyrics that read like journalism — albeit, much like his other protest songs based off real events, journalism that plays hard and loose with the facts. 36. Subterranean Homesick Blues ( Bringing It All Back Home, 1965) 37. Blind Willie McTell (Infidels outtake, 1983) 38. Changing of the Guards ( Street Legal, 1978) One of Dylan’s weirdest, most enigmatic songs lyrically (and that’s saying something). But this is his lost gem of the ’70s, overshadowed by the sneering Blood on the Tracks and the songs on Desire that became pop-culture icons. 39. It Takes A Lot To Laugh, It Takes A Train To Cry ( Highway 61 Revisited, 1965) Dylan played this song second in his famous “electric” set at the Newport Folk Festival in 1965, though it was called Phantom Engineer then. 40. Soon After Midnight ( Tempest, 2012) The best song off Dylan’s last album of originals, this simple ditty is like Mississippi lite, with lines that resemble the lost love expressed in our No. 1 song. 41. Huck’s Tune ( Lucky You soundtrack, 2005) Even some Dylan fans might not be aware of this deep cut from a horrible Eric Bana poker movie but it’s surprisingly great, even after you catch the last five minutes of the movie on HBO2 (not good enough for regular HBO) and hear, wincingly, that the main character’s name is “Huck.” 42. Tonight I’ll Be Staying Here With You ( Nashville Skyline, 1969) A staple of his Rolling Thunder Revue shows, it’s the most rocking track on the genre-busting Nashville. 44. One Of Us Must Know (Sooner Or Later) ( Blonde on Blonde, 1966) 43. Things Have Changed ( Wonder Boys soundtrack, 2000) Dylan seemed genuinely surprised and touched when this song won the Oscar in 2001, delivering a heartfelt acceptance speech from Sydney, where he was on his Never Ending Tour. 45. Girl From The North Country ( The Freewheelin’ Bob Dylan, 1963) The superior, non-Johnny Cash, version Keith Richards spoke of. You decide: 46. Tell Me That It Isn’t True ( Nashville Skyline, 1969) This is so much harder an exercise than I imagined. You could make your own list and have any of the previous 46 songs in the top 10 (and plenty after this) and no Dylan fan could really argue. 47. Señor (Tales of Yankee Power) ( Street Legal, 1978) 48. One Too Many Mornings ( The Times They Are A-Changin’, 1964) Another folk song changed indelibly by the electric rendition on the 1966 tour. 49. Knockin’ on Heaven’s Door ( Pat Garrett and Billy the Kid soundtrack, 1973) 50. It Ain’t Me, Babe ( Another Side of Bob Dylan, 1964) 51. Po’ Boy ( ”Love & Theft”, 2001) Robert Christgau, the legendary music critic, wrote of L&T: “If Time Out of Mind was his death album–it wasn’t, but you know how people talk–this is his immortality album.” The line “all I know is that I’m thrilled by your kiss,” is the perfect 10-word message on any card to your significant other. 52. Mr. Tambourine Man ( Bringing It All Back Home, 1965) A step up from It Ain’t Me, Babe, this was Dylan’s first, and one of his only, dabbles into psychedelia, with stripped senses, numb toes, “ragged clowns” and the “smoke rings in my mind.” Though no one can verify Dylan had his first experiment with LSD before writing this, it certainly has the makings of a “trip upon your magic swirlin’ ship.” 53. Jack-A-Roe ( World Gone Wrong, 1993) Bob Weir wasn’t pleased when Dylan and Jerry Garcia, neither of whom were apparently in the best of shape at the time, would sneak off during the infamous “Dylan and the Dead” tour of 1986 to have the Grateful Dead frontman teach Dylan this old folk ballad. 54. Spirit On The Water ( Modern Times, 2006) 55. When the Ship Comes In ( The Times They Are A-Changin’, 1964) 56. Lucky Old Sun ( Shadows In The Night, 2015) The highlight of Dylan’s surprisingly great album of classics from the American songbook (all of which had been performed by Frank Sinatra at one time or another). 57. Simple Twist of Fate ( Blood on the Tracks, 1975) 58. Workingman’s Blues #2 ( Modern Times, 2006) 59. The Ballad of Frankie Lee and Judas Priest ( John Wesley Harding, 1967) The best track of Dylan’s perplexing follow up to Blonde on Blonde and his first album released after his infamous motorcycle accident. While the world was expecting Dylan to come out with a response to Sgt. Pepper’s and Pet Sounds, he instead went for a psuedo-country, acoustic album. 60. Just Like Tom Thumb’s Blues ( Highway 61 Revisited, 1965) 61. Temporary Like Achilles ( Blonde on Blonde, 1966) 62. Make You Feel My Love ( Time Out of Mind, 1997) This one has been covered so much people forget, or never knew, it was a highlight of Dylan’s ’97 masterpiece. 63. This Dream Of You ( Together Through Life, 2009) TTL is the least regarded of Dylan’s five late-career records, but there are plenty of gems to be mined anyway. 64. Highlands ( Time Out of Mind, 1997) 65. Masters of War ( The Freewheelin’ Bob Dylan, 1963) Here’s what Dylan had to say to USA TODAY about his most savage protest song: Masters of War, for instance, “is supposed to be a pacifistic song against war. It’s not an anti-war song. It’s speaking against what Eisenhower was calling a military industrial complex as he was making his exit from the presidency. That article appeared on Sept. 10, 2001. 66. It’s Alright, Ma (I’m Only Bleeding) ( Bringing It All Back Home, 1965) 67. Some Enchanted Evening ( Shadows In The Night, 2015) 68. Jokerman ( Infidels, 1983) 69. Boots of Spanish Leather ( The Times They Are A-Changin’, 1964) 70. Don’t Think Twice, It’s All Right ( The Freewheelin’ Bob Dylan, 1963) 71. All Along The Watchtower ( John Wesley Harding, 1967) It’s a chicken/egg situation. Is All Along the Watchtower a great song, or was it made great by Jimi Hendrix’s cover, the best cover in the history of music? Let’s go to Dylan: “I liked Jimi Hendrix’s record of this and ever since he died I’ve being doing it that way…. Strange though how when I sing it I always feel it’s a tribute to him in some kind of way.” 72. You’re No Good ( Bob Dylan, 1962) The first track on Bob Dylan’s first album. Even if it wasn’t great, it’d rank high based on its historical value alone. 73. Thunder On The Mountain ( Modern Times, 2006) 74. Isis ( Desire, 1976) 75. It’s All Over Now, Baby Blue ( Bringing It All Back Home, 1965) After playing his three-song electric set at Newport ’65 — a set that had varying effect on different people, depending on which stories you listen to — Dylan started what appeared to be an unplanned acoustic set with this tune. The end had already come and no one realized it. 76. Tempest ( Tempest, 2012) A 15-minute, no-chorus track about the sinking of the Titanic, one the appropriates real characters (Astor, Calvin, Blake and Wilson) and fictional (“Leo” is mentioned twice, yea, that Leo). It was a song you listened to for the first time and figured, “that was nice, but I’ll never listen to it again” Yet every time it pops up, it’s hypnotic rhyming structure makes you keep listening and 15-minutes later you’re glad you did. 77. Queen Jane Approximately ( Highway 61 Revisited, 1965) 78. Most Likely You Go Your Way And I’ll Go Mine ( Blonde on Blonde, 1966) 79. The Man In Me ( New Morning, 1970) There are Bob Dylan fans who aren’t Big Lebowski fans but few Big Lebowski fans who aren’t Bob Dylan fans. As it is, I ten dto think the Coen brothers classic turned this song into a forgettable throwawy from New Morning and turned it into a classic. But darn if it doesn’t rock every time it comes on screen. 80. Under The Red Sky ( Under the Red Sky, 1990) Though Dylan’s renaissance is always tied to Time Out of Mind he showed flashes on the four albums from 1989’s Oh Mercy to 1993’s World Gone Wrong. 81. Highway 51 ( Bob Dylan, 1962) 82. Forgetful Heart ( Together Through Life, 2009) 83. Silvio ( Down in the Groove, 1988) 84. Can You Please Crawl Out Your Window (Single, 1965) 85. Went To See The Gypsy ( New Morning, 1970) 86. Ring Them Bells ( Oh, Mercy, 1989) 87. Quinn The Eskimo (The Mighty Quinn) ( Self Portrait, 1970) Every high-schoolers favorite Dylan song, even if they’re not exactly sure that it’s Dylans. 88. Bye And Bye ( ”Love & Theft”, 2001) 89. New Pony ( Street Legal, 1978) 90. Idiot Wind ( Blood on the Tracks, 1975) “Someone’s got it in for me, they’re planting stories in the press,” Dylan begins on this 2pac-like diss track. Well, not really. But upset over a People magazine report that he was splitting with his wife, Dylan wrote yet another incisive tune for his ’70s masterwork. 91. Hazel ( Planet Waves, 1974) 92. I’ll Be Your Baby Tonight ( John Wesley Harding, 1967) 93. Gotta Serve Somebody ( Slow Train Coming, 1979) 94. Emotionally Yours ( Empire Burlesque, 1985) 95. I Shall Be Released ( Greatest Hits: Vol. II, 1971) Every song can’t be great, right? (At least in the top 100. Though we won’t be providing commentary on the remaining 250+ songs — hoo boy, there are some dogs in there.) This single hit No. 6 on Rolling Stone’s list of top 100 Dylan songs, but wasn’t among the 13 Dylan tracks that were listed in its top 500. Maybe the problem is that there are so many other version of this song (two from the Basement Tapes, from The Last Waltz, at Budokan, the Band’s version and in Dylan’s legendary 1993 Supper Club show that this fairly tame performance just underwhelms. 96. Pressing On ( Saved, 1980) Dylan’s three Christian-rock albums are derisively referred to as the “Unholy Three,” even though they produced a number of great songs, including this one and the aforementioned Gotta Serve Somebody. 97. Corrina, Corrina ( The Freewheelin’ Bob Dylan, 1963) 98. No Time To Think ( Street Legal, 1978) 99. Everything Is Broken ( Oh, Mercy, 1989) 100. Hurricane ( Desire, 1976) This rocks far more than any eight-minute protest song should. Forget that almost all of its facts were wrong and that Dylan essentially disowned it years later (never performing it after Jan. 25, 1976, much to the consternation of fans who assume he’s breaking out the song in concert when he plays the first few chords to Watchtower). Opening lines don’t get much better than “pistols shots rang out in the barroom night.” 101. On A Night Like This ( Planet Waves, 1974) 102. Honey, Just Allow Me One More Chance ( The Freewheelin’ Bob Dylan, 1963) 103. One More Cup Of Coffee (Valley Below) ( Desire, 1976) 104 Pay in Blood ( Tempest, 2012) 105. See That My Grave is Kept Clean ( Bob Dylan , 1962) 106. Tombstone Blues ( Highway 61 Revisited, 1965) 107. Lenny Bruce ( Shot of Love, 1981) 108. Autumn Leaves ( Shadows In The Night, 2015) 109. Wedding Song ( Planet Waves, 1974) 110. To Be Alone With You ( Nashville Skyline, 1969) 111. When The Deal Goes Down ( Modern Times, 2006) 112. Bob Dylan’s 115th Dream ( Bringing It All Back Home, 1965) 113. Life Is Hard ( Together Through Life, 2009) 114. Country Pie ( Nashville Skyline, 1969) 115. If Not For You ( New Morning, 1970) 116. Talkin’ New York ( Bob Dylan, 1962) 117. Going, Going, Gone ( Planet Waves, 1974) 118. To Ramona ( Another Side of Bob Dylan, 1964) 119. Never Say Goodbye ( Planet Waves, 1974) 120. Most Of The Time ( Oh, Mercy, 1989) 121. Jolene ( Together Through Life, 2009) 122. Sara ( Desire, 1976) 123. Maggie’s Farm ( Bringing It All Back Home, 1965) 124. Meet Me In The Morning ( Blood on the Tracks, 1975) 125. Chimes of Freedom ( Another Side of Bob Dylan, 1964) 126. Trying To Get To Heaven ( Time Out of Mind, 1997) 127. Cat’s In The Well ( Under the Red Sky, 1990) 128. Beyond The Horizon ( Modern Times, 2006) 129. Pledging My Time ( Blonde on Blonde, 1966) 130. I Dreamed I Saw St. Augustine ( John Wesley Harding, 1967) 131. House of the Risin’ Sun ( Bob Dylan, 1962) 132. Man In The Long Black Coat ( Oh, Mercy, 1989) 133. Romance In Durango ( Desire, 1976) 134. Man of Constant Sorrow ( Bob Dylan, 1962) 135. Drifter’s Escape ( John Wesley Harding, 1967) 136. If You See Her, Say Hello ( Blood on the Tracks, 1975) 137. With God On Our Side ( The Times They Are A-Changin’, 1964) 138. Obviously 5 Believers ( Blonde on Blonde, 1966) 139. Cry A While ( ”Love & Theft”, 2001) 140. Song to Woody ( Bob Dylan, 1962) 141. If Dogs Run Free ( New Morning, 1970) 142. Honest With Me ( ”Love & Theft”, 2001) XXX D0 TECH DYLAN LOVE 27 THEFT COVER A ENT 143. Lay, Lady, Lay ( Nashville Skyline, 1969) 144. Highway 61 Revisited ( Highway 61 Revisited, 1965) 145. Down Along The Cove ( John Wesley Harding, 1967) 146. Lonesome Day Blues ( ”Love & Theft”, 2001) 147. Buckets Of Rain ( Blood on the Tracks, 1975) 148. Til I Fell In Love With You ( Time Out of Mind, 1997) 149. God Knows ( Under the Red Sky, 1990) 150 The Wicked Messenger ( John Wesley Harding, 1967) 151. I’m a Fool to Want You ( Shadows In The Night, 2015) 152. Cold Irons Bound ( Time Out of Mind, 1997) 153. I Don’t Believe You (She Acts Like We Never Have Met) ( Another Side of Bob Dylan, 1964) 154. She Belongs to Me ( Bringing It All Back Home, 1965) 155. Standing in the Doorway ( Time Out of Mind, 1997) 156. The Night We Called it a Day ( Shadows In The Night, 2015) 157. Ballad of Hollis Brown ( The Times They Are A-Changin’, 1964) 158. Disease Of Conceit ( Oh, Mercy, 1989) 159. Long and Wasted Years ( Tempest, 2012) 160. Black Crow Blues ( Another Side of Bob Dylan, 1964) 161. You’re Gonna Make Me Lonesome When You Go ( Blood on the Tracks, 1975) 162. Mozambique ( Desire, 1976) 163. You’re A Big Girl Now ( Blood on the Tracks, 1975) 164. High Water (For Charley Patton) ( Love & Theft, 2001) 165. Delia ( World Gone Wrong, 1993) 166. Bob Dylan’s Dream ( The Freewheelin’ Bob Dylan, 1963) 167. From A Buick 6 ( Highway 61 Revisited, 1965) 168. Spanish Harlem Incident ( Another Side of Bob Dylan, 1964) 169. Beyond Here Lies Nothin’ ( Together Through Life, 2009) 170. All I Really Want To Do ( Another Side of Bob Dylan, 1964) 171. Ain’t Talkin’ ( Modern Times, 2006) 172. I Believe In You ( Slow Train Coming, 1979) 173. Pretty Peggie-O ( Bob Dylan, 1962) 174. Gates of Eden ( Bringing It All Back Home, 1965) 175. Why Try to Change Me Now ( Shadows In The Night, 2015) 176. Can’t Wait ( Time Out of Mind, 1997) 177. Belle Isle ( Self Portrait, 1970) 178. As I Went Out One Morning ( John Wesley Harding, 1967) 179. New Morning ( New Morning, 1970) 180. Fixin’ to Die ( Bob Dylan, 1962) 181. I Pity The Poor Immigrant ( John Wesley Harding, 1967) 182. Winterlude ( New Morning, 1970) 183. Talkin’ World War III Blues ( The Freewheelin’ Bob Dylan, 1963) 184. Stay With Me ( Shadows In The Night, 2015) 185. Canadee-I-O (Good As I Been To You, 1992) 186. Blood In My Eyes ( World Gone Wrong, 1993) 187. Jim Jones ( Good As I Been To You, 1992) 188. Million Miles ( Time Out of Mind, 1997) 189. Outlaw Blues ( Bringing It All Back Home, 1965) 190. Tweedle Dee & Tweedle Dum ”Love & Theft”, 2001) 191. In My Time of Dyin ( Bob Dylan, 1962) 192. Bob Dylan’s Blues ( The Freewheelin’ Bob Dylan, 1963) 193. Floater (Too Much To Ask) ( ”Love & Theft”, 2001) 194. California ( NCIS soundtrack, 1972) 195. Oxford Town ( The Freewheelin’ Bob Dylan, 1963) 196. Full Moon and Empty Arms ( Shadows In The Night, 2015) 197. John Wesley Harding ( John Wesley Harding, 1967) 198. Summer Days ( ”Love & Theft”, 2001) 199. Rollin’ and Tumblin’ ( Modern Times, 2006) 200. Leopard-Skin Pill Box Hat ( Blonde on Blonde, 1966) 201. Tomorrow Night ( Good As I Been To You, 1992) 202. Dear Landlord ( John Wesley Harding, 1967) 203. Ballad In Plain D ( Another Side of Bob Dylan, 1964) 204. Nashville Skyline Rag ( Nashville Skyline, 1969) 205. Covenant Woman ( Saved, 1980) 206. Blackjack Davey ( Good As I Been To You, 1992) 207. You’re Gonna Quit Me ( Good As I Been To You, 1992) 208. Black Diamond Bay ( Desire, 1976) 209. Hard Time ( Good As I Been To You, 1992) 210. Baby, Stop Crying ( Street Legal, 1978) 211. Gospel Plow ( Bob Dylan, 1962) 212. Is Your Love In Vain? ( Street Legal, 1978) 213. Handy Dandy ( Under the Red Sky, 1990) 214. The Levee’s Gonna Break ( Modern Times, 2006) 215. Dirge ( Planet Waves, 1974) 216. Narrow Way ( Tempest, 2012) 217. We Better Talk This Over ( Street Legal, 1978) 218. Frankie & Albert ( Good As I Been To You, 1992) 219. What’ll I Do ( Shadows In The Night, 2015) 220. Peggy Day ( Nashville Skyline, 1969) 221. If You Ever Go To Houston ( Together Through Life, 2009) 222. North Country Blues ( The Times They Are A-Changin’, 1964) 223. I Shall Be Free No. 10 ( Another Side of Bob Dylan, 1964) 224. Step It Up And Go ( Good As I Been To You, 1992) 225. I Am A Lonesome Hobo ( John Wesley Harding, 1967) 226. Where Are You Tonight? (Journey Through Dark Heat) ( Street Legal, 1978) 227. Stack A Lee ( World Gone Wrong, 1993) 228. You Angel You ( Planet Waves, 1974) 229. Born In Time ( Under the Red Sky, 1990) 230. World Gone Wrong ( World Gone Wrong, 1993) 231. Time Passes Slowly ( New Morning, 1970) 232. Diamond Joe ( Good As I Been To You, 1992) 233. On the Road Again ( Bringing It All Back Home, 1965) 234. Ragged & Dirty ( World Gone Wrong, 1993) 235. True Love Tends To Forget ( Street Legal, 1978) 236. Forever Young ( Planet Waves, 1974) 237. Day Of The Locusts ( New Morning, 1970) 238. Two Soldiers ( World Gone Wrong, 1993) 239. Froggie Went A-Courtin ( Good As I Been To You, 1992) 240. Freight Train Blues ( Bob Dylan, 1962) 241. Where Teardrops Fall ( Oh, Mercy, 1989) 242. Down the Highway ( The Freewheelin’ Bob Dylan, 1963) 243. Something There Is About You ( Planet Waves, 1974) 244. Sign On The Window ( New Morning, 1970) 245. Three Angels ( New Morning, 1970) 246. I Shall Be Free ( The Freewheelin’ Bob Dylan, 1963) 247. Motorpsycho Nightmare ( Another Side of Bob Dylan, 1964) 248. 2 X 2 ( Under the Red Sky, 1990) 249. Dirt Road Blues ( Time Out of Mind, 1997) 250. Arthur McBride ( Good As I Been To You, 1992) 251. Someday Baby ( Modern Times, 2006) 252. My Wife’s Home Town ( Together Through Life, 2009) 253. Scarlet Town ( Tempest, 2012) 254. What Can I Do For You? ( Saved, 1980) 255. Sittin’ On Top Of The World ( Good As I Been To You, 1992) 256. When He Returns ( Slow Train Coming, 1979) 257. Unbelievable ( Under the Red Sky, 1990) 258. Where Are You? ( Shadows In The Night, 2015) 259. What Good Am I? ( Oh, Mercy, 1989) 260. The Ballad of Ira Hayes ( Dylan, 1973) 261. Gonna Change My Way Of Thinking ( Slow Train Coming, 1979) 262. Shake Shake Mama ( Together Through Life, 2009) 263. Mary Ann ( Dylan, 1973) 264. Tough Mama ( Planet Waves, 1974) 265. Dark Eyes ( Empire Burlesque, 1985) 266. Precious Angel ( Slow Train Coming, 1979) 267. Saving Grace ( Saved, 1980) 268. It’s All Good ( Together Through Life, 2009) 269. When You Gonna Wake Up ( Slow Train Coming, 1979) 270. One More Weekend ( New Morning, 1970) 271. Tin Angel ( Tempest, 2012) 272. Do Right To Me Baby (Do Unto Others) ( Slow Train Coming, 1979) 273. Sarah Jane ( Dylan, 1973) 274. In The Summertime ( Shot of Love, 1981) 275. Saved ( Saved, 1980) 276. Lily of the West ( Dylan, 1973) 277. Blue Moon ( Self Portrait, 1970) 278. A Satisfied Mind ( Saved, 1980) 279. Little Sadie ( Self Portrait, 1970) 280. The Groom’s Still Waiting At The Altar ( Shot of Love, 1981) 281. Early Roman Kings ( Tempest, 2012) 282. Take A Message To Mary ( Self Portrait, 1970) 283. Tight Connection To My Heart (Has Anyone Seen My Love) ( Empire Burlesque, 1985) 284. Heart Of Mine ( Shot of Love, 1981) 285. Sweetheart Like You ( Infidels, 1983) 286. Little Maggie ( Good As I Been To You, 1992) 287. 10,000 Men ( Under the Red Sky, 1990) 288. Alberta #2 ( Self Portrait, 1970) 289. Never Gonna Be The Same Again ( Empire Burlesque, 1985) 290. Alberta #1 ( Self Portrait, 1970) 291. Something’s Burning, Baby ( Empire Burlesque, 1985) 292. In The Garden ( Saved, 1980) 293. Property Of Jesus ( Shot of Love, 1981) 294. I’ll Remember You ( Empire Burlesque, 1985) 295. Living The Blues ( Self Portrait, 1970) 296. Love Henry ( World Gone Wrong, 1993) 297. Solid Rock ( Saved, 1980) 298. Seeing The Real You At Last ( Empire Burlesque, 1985) 299. I and I ( Infidels, 1983) 300. Brownsville Girl ( Knocked Out Loaded, 1986) 301. Rank Strangers To Me ( Down in the Groove, 1988) 302. Clean Cut Kid ( Empire Burlesque, 1985) 303. Early Mornin’ Rain ( Self Portrait, 1970) 304. Don’t Fall Apart on Me Tonight ( Infidels, 1983) 305. Ninety Miles An Hour (Down a Dead End Street) ( Down in the Groove, 1988) 306. Under Your Spell ( Knocked Out Loaded, 1986) 307. Copper Kettle (The Pale Moonlight) ( Self Portrait, 1970) 308. Shenandoah ( Down in the Groove, 1988) 309. Death Is Not The End ( Down in the Groove, 1988) 310. Can’t Help Falling in Love ( Dylan, 1973) 311. What Was It You Wanted ( Oh, Mercy, 1989) 312. Man Gave Names To All The Animals ( Slow Train Coming, 1979) 313. Union Sundown ( Infidels, 1983) 314. Sugar Baby ( ”Love & Theft”, 2001) 315. Watered-Down Love ( Shot of Love, 1981) 316. A Fool Such As I ( Dylan, 1973) 317. Broke Down Engine ( World Gone Wrong, 1993) 318. Joey ( Desire, 1976) 319. Political World ( Oh, Mercy, 1989) 320. Sally Sue Brown ( Down in the Groove, 1988) 321. Mr. Bojangles ( Dylan, 1973) 322. Precious Memories ( Knocked Out Loaded, 1986) 323. Let’s Stick Together ( Down in the Groove, 1988) 324. I Forgot More Than You’ll Ever Know ( Self Portrait, 1970) 325. License to Kill ( Infidels, 1983) 326. Wigwam ( Self Portrait, 1970) 327. Maybe Someday ( Knocked Out Loaded, 1986) 328. Let It Be Me ( Self Portrait, 1970) 329. Had A Dream About You, Baby ( Down in the Groove, 1988) 330. Minstrel Boy ( Self Portrait, 1970) 331. Gotta Travel On ( Self Portrait, 1970) 332. Neighborhood Bully ( Infidels, 1983) 333. It Hurts Me Too ( Self Portrait, 1970) 334. Dead Man, Dead Man ( Shot of Love, 1981) 335. The Boxer ( Self Portrait, 1970) 336. When Did You Leave Heaven? ( Down in the Groove, 1988) 337. Roll On John ( Tempest, 2012) 338. You Wanna Ramble ( Knocked Out Loaded, 1986) 339. In Search of Little Sadie ( Self Portrait, 1970) 340. Days Of 49 ( Self Portrait, 1970) 341. Spanish Is The Loving Tongue ( Dylan, 1973) 342. Trust Yourself ( Empire Burlesque, 1985) 343. T.V. Talkin’ Song ( Under the Red Sky, 1990) 344. Father Of Night ( New Morning, 1970) 345. She Belongs to Me ( Self Portrait, 1970) 346. Are You Ready ( Saved, 1980) 347. They Killed Him ( Knocked Out Loaded, 1986) 348. Shot Of Love ( Shot of Love, 1981) 349. When The Night Comes Falling From The Sky ( Empire Burlesque, 1985) 350. Man of Peace ( Infidels, 1983) 351. Got My Mind Made Up ( Knocked Out Loaded, 1986) 352. Woogie Boogie ( Self Portrait, 1970) 353. Ugliest Girl In The World ( Down in the Groove, 1988) 354. Big Yellow Taxi ( Dylan, 1973) 355. Driftin’ Too Far From Shore ( Knocked Out Loaded, 1986) 356. Trouble ( Shot of Love, 1981) 357. Like A Rolling Stone ( Self Portrait, 1970) 358. Wiggle Wiggle ( Under the Red Sky, 1990) 359. Rainy Day Women #12 & 35 ( Blonde on Blonde, 1966) ",
            "date": "Answered July 19, 2018",
            "views": "174",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Priyanshu Kumar",
                    "user_href": "/profile/Priyanshu-Kumar-831"
                },
                {
                    "user_id": "Sonu Banerjee",
                    "user_href": "/profile/Sonu-Banerjee-5"
                },
                {
                    "user_id": "Gopalan S",
                    "user_href": "/profile/Gopalan-S-1"
                },
                {
                    "user_id": "Kabir Anand",
                    "user_href": "/profile/Kabir-Anand-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sjoerd van Loon",
                "href": "/profile/Sjoerd-van-Loon-1"
            },
            "answer_text": "Lets talk about famous artists only. Looking at most recorded songs it is Elvis with around 711 official releases plus various unofficial it will be around 770. In 22 years time that is around 35 a year. That is more than any other. Arteha Franklin 112 official releases. Michael Jackson made 10 albums i think, well that's about 150–200 songs. Then you can count how many concerts an artist has given where he sang his songs. Then Elvis is clearly number one. He has given a crazy amount of near to 1000 concerts in his life. He gave from 100 to 300 a year. Sometimes he gave two or three concerts a day for three weeks. Then have three weeks off. Michael Jackson did around 500 in his lifetime which is also a lot. When you also count the times an artist would rehearsal its also Elvis at number one. He just liked being in a studio and singing songs, fooling around. So summed up, any way you look it... ",
            "date": "Answered October 28, 2016",
            "views": "286",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Subramanya Shet",
                    "user_href": "/profile/Subramanya-Shet-11"
                },
                {
                    "user_id": "Sharath Kumar Mennekanti",
                    "user_href": "/profile/Sharath-Kumar-Mennekanti"
                },
                {
                    "user_id": "Bad Egg",
                    "user_href": "/profile/Bad-Egg-2"
                },
                {
                    "user_id": "Rupanjal Rabha",
                    "user_href": "/profile/Rupanjal-Rabha"
                },
                {
                    "user_id": "Mukesh Bhardwaj",
                    "user_href": "/profile/Mukesh-Bhardwaj-6"
                },
                {
                    "user_id": "Sami Jarbouh",
                    "user_href": "/profile/Sami-Jarbouh"
                },
                {
                    "user_id": "Arnold Gyan",
                    "user_href": "/profile/Arnold-Gyan-1"
                },
                {
                    "user_id": "Dennis Hauser",
                    "user_href": "/profile/Dennis-Hauser"
                },
                {
                    "user_id": "Dan Knight",
                    "user_href": "/profile/Dan-Knight-1"
                }
            ]
        }
    ]
}