{
    "title": "Who are some of the most unique guitarists? - Quora",
    "tags": [
        "Guitarists"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Austin",
                "href": "/profile/Chris-Austin-83"
            },
            "answer_text": "These would be the most unique guitarists so far. Buckethead  Anything I have to say about guitar, it always starts with Buckethead. Anyways. Like I have always been saying that Buckethead is a very unique guitarist. He knows all techniques. He can play all genres, and he has loads of works. So, far you will see very few guitarists like him. His tone is also very variable. That’s why I am going to mention him again here. Tosin Abasi Sushovan Shakya (सुशोभन शाक्य) a quora user once mentioned me about him. I said him, I was saving Tosin for another category. And that’s what I was saving him for. Tosin is a very talented guitarist. He’s a djent guitarist. Djent is a very unique genre. There’s no doubt in it. Its the shredding, technical version of prog-metal. The guy uses 7–8 strings guitar. One of most talented young guitarist (under 40) of now. Frank Zappa Here comes the music professor. He is known for his leadership in band. Doing various jazzy stuffs. He can play multiple instruments (Including bicycle). But his guitar playing ability was awesome. He was born in 1940. Born very edge. But he learnt many new things. The first thing I was amused by his playing when I saw him tapping on his guitar (yeah before eruption) for 2 minutes. Produced very clean tone with it. And since then I started to follow his guitar performances and found out that he was a pure genius on guitar. He was a very technical for his time. Django Reinhardt Born in 1910. The earliest guitarist I am mentioning. He had two paralyzed fingers. But he kept playing one with just two fingers. And that was the most unique thing. I know that Tony Iommi also had injuries. But Django was before him. And while Tony had focused on riffs, Django did lead work greatly. He was one of the fastest guitarists of his time. And with just two fingers. I had to mention him here. Erik Mongrain  I know a lot of you might not know about him. That’s why I am mentioning a video of him. He is a canadian guitarist. And his most famous work is air tapping. While he plays his guitar like a piano/drums. I have seen tapping. But not like him. He brought tapping to a new level. He is underrated. Deserves more credits. Steve Vai Apart from being a shredder he has done many things on his guitar. Best student of Joe Satriani. But got more unique. He mastered using whammy bar. Does very good hammer ons/pull offs and tapping. The fact is that he worked with Frank Zappa. I think that helped him to get more unique sound. Les Paul Les Paul was a great designer of guitar. But he was also a great guitarist. He was a jazz guitarist. And he was quite unique. Probably the pioneer of multi-track. His playing techniques consisted of sweep picking, fretting, different effects and fast alternate picking. He had tremendous skills on electric guitar. Also heard that he was experimenting with tube distortion in 1945. Not sure about it though. But saw some of his performances. Were awesome. Tom Morello Tome has amazing skills on whammy pedal. As well as other effect pedals. Matt Bellamy would be his tight competitor. But Tom does it more uniquely. Those weird sounds from his pedals made him on this list. Michael Angelo Batio The fastest shredder of all time. But that’s not why he’s here. He does some of the most unique things that no one can do. The guy can play guitar with two hands. I mean not like picking with one hand and other hand for holding chords. He can play the notes with both hands. He can switch his upside-down guitar playing rapidly. Especially that part when he plays from upside and quickly takes plays in right position. Ritchie Blackmore The guy might play folk music for the past 25 years. But in his early era he was a killer. Especially the speed killer. Doing various kinds of experiments. Playing the arpeggios very quickly. Messing up with whammy bar. Or playing jazz, blues, classical what had come to his mind. He is the father of shred-guitar and heavy metal. I believe that he is the best guitarist from his time. Honorable MentionsI won’t say that these guitarists are very unique but they deserve to be on here. Plus since 10 guitarist are already here. Matt Bellamy A lot of us understatement this guy for being attached to pop music. But that doesn’t change anything. The truth is that he is a great guitar player. Like I said before he can use effect pedals greatly. His tapping, tremolo picking, fast arpeggios are great. But overall he is here because of his unique tones. Mark Knopfler His sound isn’t that unique. I mean not that much (except for the fact that I could never get the tone of “Money for Nothing”). But truth to be told, his playing style is unique. There are countless fingerstyle guitarists. But not many people can play like him. He makes some tone that can’t be played easily. He played various kinds of guitar throughout his history. The man can build speed or play very slowly. Not sloppy at all. His lead work is also very good. Especially in songs like Sultans of Swing, Telegraph Road, Private Investigation. Steve Hackett Not a big fan of his guitar playing. But gotta admit his playing style. Even his les paul is unique. With a whammy bar attached. He did great Genesis. Plus the thing that he did some great techniques like tapping and sweep picking at that time. ",
            "date": "Answered April 2, 2018",
            "views": "32",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jerry Thompson",
                    "user_href": "/profile/Jerry-Thompson-59"
                },
                {
                    "user_id": "Niek Dautzenberg",
                    "user_href": "/profile/Niek-Dautzenberg"
                },
                {
                    "user_id": "John Shaluly",
                    "user_href": "/profile/John-Shaluly"
                },
                {
                    "user_id": "Kevin Sharp",
                    "user_href": "/profile/Kevin-Sharp-3"
                },
                {
                    "user_id": "Yosey Huff",
                    "user_href": "/profile/Yosey-Huff"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Quak-Quak-3"
                },
                {
                    "user_id": "Kaushik Kurudi",
                    "user_href": "/profile/Kaushik-Kurudi"
                },
                {
                    "user_id": "Holly Root-Gutteridge",
                    "user_href": "/profile/Holly-Root-Gutteridge"
                },
                {
                    "user_id": "Edward Doran",
                    "user_href": "/profile/Edward-Doran-6"
                },
                {
                    "user_id": "Chuck Boothe",
                    "user_href": "/profile/Chuck-Boothe-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Langlois",
                "href": "/profile/Robert-Langlois-5"
            },
            "answer_text": "Django Reinhardt with Stephane Grappelli with La Quintette du Hot Club de France, 1934. During his career he wrote over 100 songs and played despite having lost the ability to use 2 fingers as the result of a fire in the gypsy caravan they called home. His influence in the world of Jazz guitar, as a solo rather than rhythm instrument, is immense. He played a Selmer acoustic guitar, single cutaway through a mic for amplification. Despite having only three useful fingers his instrumental solos are complex, melodic and rhythmic using a mix of chords and single note lines. That’s my basic take on explaining his style. He was a unique individual according to various stories sometimes not showing up for gigs simply because he didn't feel like playing. He has had a far reaching influence in the world of Jazz rock and country with players as diverse as BB King, Chet Atkins, Willie Nelson and Paul McCartney citing him as influences. Give him a listen, you’ll understand why. Also: can't ignore Frank Zappa with The Mothers of Invention. He was a standout with his intelligent, sarcastic, sometimes politically incorrect but always uniquely interesting lyrics coupled with outstanding compositions and solos that equalled what other players were doing both then and now. Frank Zappa, died too young. ",
            "date": "Answered August 16, 2017",
            "views": "18",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Barton",
                    "user_href": "/profile/David-Barton-70"
                },
                {
                    "user_id": "Rich Moore",
                    "user_href": "/profile/Rich-Moore-29"
                },
                {
                    "user_id": "Jim Bob",
                    "user_href": "/profile/Jim-Bob-1594"
                },
                {
                    "user_id": "Paul Diana",
                    "user_href": "/profile/Paul-Diana"
                },
                {
                    "user_id": "Tony Baron",
                    "user_href": "/profile/Tony-Baron-2"
                },
                {
                    "user_id": "Guillermo René Ramírez Bonilla",
                    "user_href": "/profile/Guillermo-René-Ramírez-Bonilla"
                },
                {
                    "user_id": "J Robb Wilson",
                    "user_href": "/profile/J-Robb-Wilson"
                },
                {
                    "user_id": "Mike Walker",
                    "user_href": "/profile/Mike-Walker-101"
                },
                {
                    "user_id": "David Allsop",
                    "user_href": "/profile/David-Allsop-6"
                },
                {
                    "user_id": "Chris Austin",
                    "user_href": "/profile/Chris-Austin-83"
                }
            ]
        }
    ]
}