{
    "title": "Who is your favourite in I-Land (BigHit)? - Quora",
    "tags": [
        "Big Hit Entertainment",
        "BTS (K-pop group)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Holly Tan",
                "href": "/profile/Holly-Tan-6"
            },
            "answer_text": "I finally finished ep. 10 and am rather devastated. I needed to get this out of my system, so bear with me lol. My favorite I-LAND contestant is Ta-ki!  I never thought I would be the type to get attached to survival show contestants, but here we are lol. I can’t quite put a finger on it, but from day one, this kid has stolen all my uwu’s. Many of you might wonder why I was so fond of him throughout the show. Although he is a good performer, he is definitely not the strongest. However, I prefer personality over talent (most of the time). In most of I-LAND, Ta-ki has been a bright and charming part of the show. He might not have had a chance for a larger part in performances, but I look forward to his parts because he brings so much joy and energy! His freestyle dance against Heesung was exemplary of this strength. He’s derpy and playful, which cheers up other members. He’s young, but also incredibly understanding and loving. He doesn’t know it, but he has taught a lot of older contestants much, especially K. He’s kind and does his best to better the team, rather than just himself. Even though he wasn’t as a strong of a performer as the other members currently in the top 10, I do think his stage charisma made up for it. It would’ve also been a joy watching him grow in I-LAND. Unfortunately, that won’t happen, but I’m hopeful :’) He has a lot of potential and has room for growth and learning. I hope he continues training and refining his skills (if he wants to that is). I’m looking forward to the day Ta-ki debuts! ",
            "date": "Answered September 7, 2020",
            "views": "240",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jessivett Sanchez",
                    "user_href": "/profile/Jessivett-Sanchez"
                }
            ]
        }
    ]
}