{
    "title": "Who buried Moses? - Quora",
    "tags": [
        "Moses (biblical figure)",
        "Burial (death ritual)",
        "The Bible"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rodney Smith",
                "href": "/profile/Rodney-Smith-47"
            },
            "answer_text": "According to the bible, Jehovah God buried Moses body. Deuteronomy 34:5,6, reads: (5) “After that Moses the servant of Jehovah died there in the land of Mo'ab just as Jehovah had said.” (6) “He buried him in the valley in the land of Mo'ab, opposite Beth-pe'or, and nobody knows where his grave is down to this day.” So, the question now becomes, why did Jehovah God bury Moses body? Why would Jehovah God conceal where Moses body was buried, so that no one down to this day knows where it is? The answer: Because a dispute arose over Moses body by an arch enemy of Jehovah God. To find out who that enemy is we must go to the bible book of Jude. Jude 9, reads: “But when Michael the archangel had a difference with the Devil and was disputing about Moses body, he did not dare to bring a judgment against him in abusive terms, but said: “May Jehovah rebuke you.” So Jehovah God ended the dispute by burying Moses body in a location never since discovered. But still, why did Jehovah God do this? Likely, this was to prevent the Israelites from being ensnared into false worship by making a shrine of Moses grave. Evidently the Devil desired to use Moses body for some such purpose. So Jehovah God did this to protect his people from falling into a trap the devil tried to set to ensnare them into false worship of Moses. And they could have easily made a shrine of Moses grave, had they known where it was, because they deeply mourned Moses death. Deuteronomy 34:8 confirms this, it reads: “The people of Israel wept for Moses on the desert plains of Mo'ab for 30 days,” So Jehovah God thwarted the devil's plan to take advantage of his people while they were vulnerable and mourning. And that is stunning proof that Jehovah God loves his true people. Jehovah God still protects his true people today. Jehovah's witnesses, (Isaiah 43:10) Jehovah God alerts us by means of his word the bible. He alerts us and makes known to us the crafty works of the Devil, so that we don't get ensnared into false worship. And why does Jehovah God do this for his true people today? 2 Corinthians 2:11 , says: “So that we may not be overreached by Satan, for we are not ignorant of his designs.” Isn't that beautiful? Jehovah God lets us know the tricks the devil uses to try and ensnare us into false worship. What are some of the devil's tricks? The Holidays, like this one now upon us, Halloween. Halloween is a Pagan Holiday that celebrates Evil, and he uses the deception that it's just fun for the kids, a chance to have a good time. The real truth is, whoever celebrates Halloween is giving an act of worship to Satan, Yes you have been fooled. So, that is why Jehovah's witnesses do not celebrate any of the Pagan Holidays. Including: Easter, Christmas, Valentines day,Thanksgiving day, Mardi Gras, Etc. They are all of Pagan origin, don't take my word for it just google each holiday and ask if it has Pagan roots. Satan has to trick people into worshiping him, he deceived Eve in the Garden of Eden. (Genesis 3:2–5) read that account. So, yes Jehovah God, according to the bible did bury Moses body where no one can find it to this day. It was out of an act of love to protect his people, and fulfill his purposes. As for you critics of Jehovah God, you missed the whole beauty of it all. The fact that no one has found Moses body or the burial site, is stunning proof that the bible is true and accurate. Remember the scripture at Deuteronomy 34:6, the latter part of the verse reads: “and nobody knows where his grave is down to this day.” And that is absolutely the truth. Thank You. ",
            "date": "Updated November 5, 2018",
            "views": "116",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Yana Mimi",
                    "user_href": "/profile/Yana-Mimi"
                },
                {
                    "user_id": "Pamela Ramsawak-Thorne",
                    "user_href": "/profile/Pamela-Ramsawak-Thorne"
                },
                {
                    "user_id": "Mary Norton",
                    "user_href": "/profile/Mary-Norton-51"
                },
                {
                    "user_id": "Okama Onayemi",
                    "user_href": "/profile/Okama-Onayemi"
                },
                {
                    "user_id": "Lui Dragonfly",
                    "user_href": "/profile/Lui-Dragonfly"
                },
                {
                    "user_id": "Sharon Leslie",
                    "user_href": "/profile/Sharon-Leslie-14"
                },
                {
                    "user_id": "Tim Cahill",
                    "user_href": "/profile/Tim-Cahill-8"
                },
                {
                    "user_id": "Rod Hjelm",
                    "user_href": "/profile/Rod-Hjelm"
                },
                {
                    "user_id": "Anand Varghese",
                    "user_href": "/profile/Anand-Varghese-10"
                },
                {
                    "user_id": "Aaryan A",
                    "user_href": "/profile/Aaryan-A-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ian Sawyer",
                "href": "/profile/Ian-Sawyer"
            },
            "answer_text": "Original Question: Who buried Moses? Moses never existed, he’s an imaginary character in the story of Exodus, a completely fictional story written at the time of the Babylonian Exile to give a sense of history, belonging and common spirituality to the scattered and disheartened people of Judea. It’s entirely fictitious. This story is one of the most researched in all biblical archaeology, yet repeated expeditions since the mid-1850s have found absolutely nothing credible to support the story - other than evidence of when it was really written. The Bible story says that God buried Moses, however the Lord of the Rings story says that Gandalf was initially known as Gandalf the Grey, but returned from the dead as Gandalf the White. There’s about as much believability in that story as there is about Moses in Exodus. ",
            "date": "Answered June 30, 2017",
            "views": "25",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andrew Holliday",
                    "user_href": "/profile/Andrew-Holliday-1"
                },
                {
                    "user_id": "Goblin Goodfella",
                    "user_href": "/profile/Goblin-Goodfella"
                },
                {
                    "user_id": "Abdul Rasheed",
                    "user_href": "/profile/Abdul-Rasheed-1081"
                },
                {
                    "user_id": "Mac McGarry",
                    "user_href": "/profile/Mac-McGarry-1"
                },
                {
                    "user_id": "Daniel James Berger",
                    "user_href": "/profile/Daniel-James-Berger"
                },
                {
                    "user_id": "Erik Faust",
                    "user_href": "/profile/Erik-Faust"
                },
                {
                    "user_id": "Suprej Mohana Keerthi",
                    "user_href": "/profile/Suprej-Mohana-Keerthi-1"
                },
                {
                    "user_id": "Nicholas Peterman",
                    "user_href": "/profile/Nicholas-Peterman-1"
                }
            ]
        }
    ]
}