{
    "title": "Who is more famous, BTS or BlackPink? - Quora",
    "tags": [
        "BLACKPINK",
        "BTS (K-pop group)",
        "K-Pop",
        "Fame and Mass Popularity",
        "Celebrities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Devon",
                "href": "/profile/Devon-194"
            },
            "answer_text": "BTS without a doubt, but I don’t neccessarily agree with the other answers stating that their proof is that bts is “better”. They ARE but the proof is more in their impact and actual amount of fans. First I think it’s important you define where exactly they are famous. Yg has been pushing the idea that blackpink is insanely popular in the US for a few years now but the numbers never really backed it up. YG, blinks, and the media would use blackpink’s YouTube views and compare them to BTS’s views and say that since they both have tons of views that they must have the same amount of attention from America. But in reality, BTS’s views were spread out all over the world and the US was one of their number one countries. BP on the other hand is insanely popular in SE Asia, which no suprise were their top countries for sales and views, America coming in fairly low in most of the charts I’ve seen. So BTS is without a doubt more popular in the us than blackpink already, but beyond just America, there’s an issue with comparing blackpink’s fame with BTS’s. blackpink have a lot of hype and lots of casual fans among the kpop community but like most girl groups, that hype doesn’t translate to actual stans. Case in point, they have tons of YouTube views and Spotify streams (consumed often by casual fans) but their sales are very low and their ticket sales outside of Asia aren’t that great. (Don’t believe what yg releases about ticket sales, they’ve been exposed multiple times in the past for manipulating ticketing data and falsely claiming and overhyping sold out shows. I’ve been to a show they reported as a major success and sold out…let’s just say there were lots of empty seats and I got my ticket for a discounted price a few weeks before the show) Blackpink has a lot of hype but if that hype falls then they don’t have a solid fanbase to keep up with this level of fame, bts on the other hand have more than enough fans to support them which is something that artists in the music industry PRAY for. I also think a big thing with people perceiving blackpink as being super famous (which they are but specifically being “as famous” as bts) is the way they are talked about in the media. Western media will make headlines like “Bts, blackpink, and more are taking over the us” but how come they are using blackpink’s name when there are other boy groups that outsold, outcharted, and have way more fans in the us than blackpink? BP are successful in the us but chart nowhere near the level of bts, but if you see that headline without knowing much about the groups, it would be a safe bet to say they were on the same level right? that’s why armys always get frustrated when bp and other groups are lumped in with BTS’s success. Outside viewers see all the names together coupled under BTS’s achievements and think that they are all doing just as good, this is what riding on BTS’s coattails means. Popularity and hype is all about making people believe that you’re more popular than you are in order to gain their attention and therefore more popularity. This is how blackpink became such a big name in the US and are said to be “taking over the us”. Not because they have the numbers to back it up, but because when ppl read about kpop, they see bts and bp together. the difference is that blackpink will get talked about when they (eventually) have a comeback but are often not mentioned anywhere outside of that promotion period. Bts on the other hand are casually mentioned everywhere, from late night shows, to movies, to speeches, to high school pep rallies. ppl talk about them even outside of when they have a comeback meanwhile blackpink dissapear (or honeslty never appeared) from people’s minds the second they aren’t seeing headlines about them breaking YouTube views. I think another big difference with how their two fames compare is also what their “achievements” are. Let’s take one that gets talked about a lot, grammys vs Coachella. blackpink performing at Coachella was amazing! It was a great opportunity for them and garnered a lot of hype and honeslty they slayed the performance. But they weren’t even the first kpop group to be invited there, Epik High was. And yes it was a great thing for them but let’s compare this… is bts popular enough to be invited to perform at Coachella had their schedule allowed? Absolutely yes, they outsold almost all the acts there and would attract hordes of fans. But are blackpink popular enough to be invited and nominated for a Grammy? Not really. Besides PCAs they haven’t really been nominated, let alone won, any award at all in the us or made any impact on the critics of the industry. if both runners can run a 5k, but only one can run a 10k, Isn’t it obvious who the stronger runner is? sorry this got so long but I’ll end it by saying this. I’ve met tons of ppl either in class or just throughout my day who like kpop. 90% of those ppl are army or multis that also stan bts. most ppl I’ve talked to who were stans of other groups found them after finding bts. I’ve met ONE blink out of all of them. most have said they’ve listened to blackpink but only one person I’ve ever talked to said they stan them. blackpink has a lot of attention, but their fame surrounding their music is mostly hype and their other achievements focus more on being brand ambassadors and socializing with other more famous celebs (which btw is cookie cutter how yg let gdragon promote himself and I wouldn’t be surprised if he’s using the same marketing strategies that they saw work with gdragon on the girls) saying blackpink is talented and famous is 100% true. Saying bts is talented and popular is 100% true but saying blackpink is as famous as bts, let alone MORE famous, is 100% untrue. and anyone trying to argue that needs to understand that the media is really good at making you THINK someone is more popular than they actually are. ",
            "date": "Answered December 22, 2019",
            "views": "205",
            "upvotes": " View 219 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rielle Long",
                    "user_href": "/profile/Rielle-Long"
                },
                {
                    "user_id": "Adrian Yang",
                    "user_href": "/profile/Adrian-Yang-19"
                },
                {
                    "user_id": "Anjana Arthiv",
                    "user_href": "/profile/Anjana-Arthiv-1"
                },
                {
                    "user_id": "N P",
                    "user_href": "/profile/N-P-887"
                },
                {
                    "user_id": "Elna Maria Jose",
                    "user_href": "/profile/Elna-Maria-Jose"
                },
                {
                    "user_id": "Yukimi Suzuki",
                    "user_href": "/profile/Yukimi-Suzuki-2"
                },
                {
                    "user_id": "Ayuko Susuki",
                    "user_href": "/profile/Ayuko-Susuki"
                },
                {
                    "user_id": "Hema Hema",
                    "user_href": "/profile/Hema-Hema-298"
                },
                {
                    "user_id": "Shreya Yadav",
                    "user_href": "/profile/Shreya-Yadav-164"
                },
                {
                    "user_id": "TaeTae Passion",
                    "user_href": "/profile/TaeTae-Passion"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ka Wai",
                "href": "/profile/Ka-Wai-13"
            },
            "answer_text": "Since you only mentioned two groups, shouldn’t it be “more” rather than “most”? :) I think they have different kind of popularity. Since, I don’t watch/follow Blackpink closely, I’ll only break down BTS fame and impact. Here I will mention both good and bad news mentioned about them since we’re going to measure the fame. Last year, Jungkook had minor car accident. It was his fault by the way. What I noticed was 20 or 30 major newspapers across the globe covered about it. You might bumped into another person’s car in your life or someone bumped into yours but nobody cared to write about it. Recently, BLM movement happened and many people demanded BTS to speak up about it and complained them that they didn’t speak up sooner enough. In fact, while they were complaining, the boys quietly arranged to donate. Nobody complained other K-Pop acts fiercely or blamed them directly if you notice. May be this is the first time seeking help from Asian artists usually they only pushed US artists. BTS have 3 Billboard No.1 albums less than a year and 4 in total and still coming for more. That’s something many artists want to achieve as well. What more impressive is BTS snatched no.1 spot without doing any bundles. During the time, physical and digital album sales are down but streaming is more popular. When BTS added a concert in Riyadh, Saudi Arabia due to government to government (probably diplomatic request), they went there. And there’s a huge issue. Human Rights Watch group even issued a statement. However, many other K-Pop acts went there and hardly nobody say anything about it. They simply didn’t care. May be, they somehow thought BTS was the only relevant group. Once upon a time, long long time ago, Jimin wore a T-Shirt. That issue turned out enormous, huge impact. Just wearing a shirt on vacation long long long time ago when they were not even that popular/famous. It’s like BTS could start World War III at that time just one member wearing a T-shirt. They became a ham between sandwich 🥪 … I mean two countries. At one point, prominent Jewish organization accused them. Although they were just simply collaborating with Sai Taiji who was considered as founding father of K-Pop, first bringing pop/hip-hop and dance to Korean culture, kind of knighting BTS to next generation after him. Ahem … not to mention Jim Jones accident caused by Agust D recently. So yes … people care. People care about BTS. BTS also appeared on Dear Class of 2020 together with President Obama, Michelle Obama, Secretary Robert Gate, Secretary Condoleezza Rice, Google CEO, Beyoncé etc and made commencement speech. They also made speech at UN and were ambassadors of UNICEF - Love Yourself, End violence campaign for two years or so. They patronaged art project called Connect BTS in 2020 which may cost between $10 million to $15 million. Though they didn’t mention the exact amount. In 2019, they conquered Stadiums across the globe such as Rose Bowl, Wembley, Soldiers Fields as first Korean act or even first Asian act. They were about to do more in 2020 but due to pandemic, all of their tour have been postponed although many stadiums concerts in US were already sold out. Instead they managed to hold largest paid online concert in June 2020 though. They were offering live streaming the concerts at home and live viewing them at cinemas since 2019. When all the venues are closed, they’re able to use their second wings. In 2019, they swept almost all grand awards in Korean award shows plus took home some American awards as well. Their management company, once almost filing bankrupt, is about to go public and issues an IPOs which worth between 2 to 4 billion US dollars. BTS success is being studied. And also discuss in some universities in U.S.  Their latest album series is based on a psychology book written by Murray Stein. When BTS albums came out, the author, Murray Stein, analyzed and explained their albums back.   The famous “The Alchemist” writer happily signed books for BTS and tweeted about them along with a post-it note from BTS.  BTS had Kingsman theme in their stage performances and photo books and Kingsman writer showed his interest back in the band as well. Why did these writers pay attention and tweet about BTS? Because their songs and music videos have literature references rather than just a bubblegum pop. They made their fans to think, analyze and sometimes made them buy those books and read them indirectly. They also have some meaningful collaboration.  BTS leader RM pre-debut song  They also have some self-love and encouragement songs and addressing mental health.   I think BTS influence/fame is based on something different from Blackpink or any other K-Pop groups or any other artists in general. BTS are not popular because of people streaming their music videos and songs. Because of their songs and lyrics, people stream their music videos and songs so that many can notice them and make them visible. Yes … any artist can be more popular than BTS but their way of popularity won’t be the same as BTS. That doesn’t mean that BTS are saints and they are always right or they are dead serious. There’re many songs they exploded and smacked back the people who drags them and hate on their success. They have many diss tracks. Other than that they are humble, funny, crackhead and being normal rather than act like celebrities type. It’s not easy to humble at this point. But, they still act like they are no different than others. In conclusion, BTS writes their own history (in this case, I wrote this for them :)) and Blackpink will write their own history in their own way. If you compare someone is famous, you need to know what kind of fame and what it is based on and why they are famous. There are stories and reasons behind those music videos views and Spotify streams. I’m sure Blackpink has one and it’s not necessarily the same as BTS. ",
            "date": "Answered June 28, 2020",
            "views": "107",
            "upvotes": " View 87 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alex Bliss",
                    "user_href": "/profile/Alex-Bliss-19"
                },
                {
                    "user_id": "Eberechukwu Chidera",
                    "user_href": "/profile/Eberechukwu-Chidera"
                },
                {
                    "user_id": "Ruhama Rupu",
                    "user_href": "/profile/Ruhama-Rupu"
                },
                {
                    "user_id": "MiSsh Almn",
                    "user_href": "/profile/MiSsh-Almn"
                },
                {
                    "user_id": "Bareera Awais",
                    "user_href": "/profile/Bareera-Awais"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Stale-Cupcakes-1"
                },
                {
                    "user_id": "Estee Marie Camara",
                    "user_href": "/profile/Estee-Marie-Camara"
                },
                {
                    "user_id": "Ti",
                    "user_href": "/profile/Ti-134"
                },
                {
                    "user_id": "Nsyhjtj",
                    "user_href": "/profile/Nsyhjtj-2"
                },
                {
                    "user_id": "Alf Lagrisola",
                    "user_href": "/profile/Alf-Lagrisola"
                }
            ]
        }
    ]
}