{
    "title": "Who is the most underrated Indian cricketer? - Quora",
    "tags": [
        "Underrated Things or People",
        "Cricket Players",
        "Indian National Cricket Team"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aravind Baby",
                "href": "/profile/Aravind-Baby-6"
            },
            "answer_text": "Ajit Agarkar.  The name would probably make you remember only the Bombay duck incident for which he became infamous for. Seven consecutive ducks, all against Australia, of which four of which were off the first ball- not the kind of record anyone would like to be remembered by. Infamously known and booed down-under as the Bombay duck, he was diminutive, silent, and went about his job with a no-frills attitude, which is probably why he passes under the radar most of the time, and may even come off as a “wasted talent”. With the oodles of talent he possessed, one might be excused for thinking this, but was he a prodigal child indeed? With a careful analysis of his performances, one could arrive at the conclusion that he was not consistent. Yes, the guy infamous for the string of ducks also holds the record for the fastest ODI 50 by an Indian, off just 21 balls. (the second in the list is Dravid, which is another shocker!)  He averages a shade below 15 in ODIs. However, when he was given a chance to bat higher up in the order, he almost always repaid the faith rested on him. His top score of 95 also came when he came at one-down. On the odd occasions when he was used as a pinch hitter, he could contribute some runs before perishing. However, he mostly padded up towards the fag end of the innings when the tension of slogging usually got the better of him. Bonus edit: After going through a few videos of Indian wins in the noughties, I observed another specialty of his batting which enhanced his pinch-hitting abilities: his high backlift. Agarkar used to lift the bat almost to his shoulder-level, generating a tremendous underarm power even while playing the ball close to his body. He was not quite adept at controlling the immense power with his lanky frame, which made his shots look quite unaesthetic. Well, the shots usually worked to fetch us a handy 20–25 runs in quick time in the slog overs! Plus, he has one singular achievement which has eluded even batting greats like Tendulkar and Lara. A century at the Mecca of Cricket, The Lord’s. Batting with a crumbling Indian lower order chasing a mammoth total, Agarkar blasted his way to an unbeaten 109, a feat of ferocity, aggression, and desperation, but with class written all over it.  But hey, he wasn’t in the team as a batsman! Technically, not even as an all-rounder! He was a bowler. An opening bowler. How many of you know that before the mystery spinner whose “mystery” was soon solved, Agarkar held the record for the fastest to 50 wickets (23 matches) for over a decade- a record he snatched from the legendary Dennis Lillee? And while we are at it, he is also the fastest to complete the duo of 200 wickets and 1000 runs in just 133 matches. Guess whom he beat to it? Shaun Pollock! His test stats weren’t as glorious as the ODI ones. But there is one forgotten performance of him down-under that broke the back of the Australian invincibles- The fierce 6/41 which derailed their second innings. Sadly, it was conveniently drubbed by another man’s performance of the lifetime- an emphatic Rahul Dravid’s 233 and an unbeaten 72. Also, how many of you remember that he was part of the radical bunch of cricketers who scooped the T20 World Cup out of nowhere in 2007?  Amidst all these, however, the crowning glory is- he is the third-highest wicket-taker for India in ODIs with 288 scalps to his name, only bettered by the Karnataka legendary duo of Kumble (339) and Srinath (315).  You do realize that in terms of wickets, he bettered even Zaheer Khan, who was arguably the best exponent of left-arm swing bowling of the noughties? Yes, part of it comes from one fact- he was the bowler, who used to be targetted because of the miserly supporting bowler at the other end, evidently proved by his economy rate of over 5 at an era where 200+ was still considered a defendable total. However, it doesn’t take the sheen from his record- he was a wicket-taker, and he did his job with a unique panache and a smiling and calm demeanor- a visible deviation from the overtly aggressive celebrations of the quickies of the generation. Perhaps that’s where he went wrong. In between the legend who is Srinath, the impact of Zaheer, the longevity of Nehra Ji, and the slew of pacers who came in between, we somehow lost a silent performer who is unfairly remembered for one infamous record than plenty of stellar statistics! ",
            "date": "Updated February 25, 2020",
            "views": "17",
            "upvotes": " View 726 Upvoters ",
            "upvoters": [
                {
                    "user_id": "P.Abhinav",
                    "user_href": "/profile/P-Abhinav-3"
                },
                {
                    "user_id": "Parth Sunil Tanna",
                    "user_href": "/profile/Parth-Sunil-Tanna"
                },
                {
                    "user_id": "Shreyas Kamat",
                    "user_href": "/profile/Shreyas-Kamat-13"
                },
                {
                    "user_id": "Nandha Kishor",
                    "user_href": "/profile/Nandha-Kishor-7"
                },
                {
                    "user_id": "Kevin Steven",
                    "user_href": "/profile/Kevin-Steven-30"
                },
                {
                    "user_id": "Godson Fernandes",
                    "user_href": "/profile/Godson-Fernandes-5"
                },
                {
                    "user_id": "Pushpendra Singh",
                    "user_href": "/profile/Pushpendra-Singh-2015"
                },
                {
                    "user_id": "Charan Aditya",
                    "user_href": "/profile/Charan-Aditya-5"
                },
                {
                    "user_id": "Hari Prasad",
                    "user_href": "/profile/Hari-Prasad-1053"
                },
                {
                    "user_id": "Ashutosh Maheshwari",
                    "user_href": "/profile/Ashutosh-Maheshwari-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yash Hirani",
                "href": "/profile/Yash-Hirani-1"
            },
            "answer_text": "Whenever I see the word underrated, 2 names come to my mind in Indian cricket. The people who always did their best, or still do. If they were in some other team, would have been selected almost instantly, but not in India. They are truly the Silent Servers of Indian Cricket. Note- Obvious names mentioned in many answers like Rahul Dravid, Anil Kumble, Gautam Gambhir and Ajinkya Rahane are omitted from this list.  The Greatest Player, never to play for India Imagine a batsman who scored his runs so efficiently that he could not be stopped anywhere, a batsman who worked tirelessly to get a blue cap, but never got it. A person who, despite all the time being ignored, never gave up. The person who scored 260 in his Ranji debut. The man who was sitting in the dugout, being the next one to bat, when the God Of Cricket and his friend were making the world record school partnership. The man who scored over 11 thousand first class runs at an average of more than 48. He is Amol Mazumdar  The man never gave up. He scored and scored and scored runs, tirelessly, effectively, consistently, but never played just because he played in the era of arguably, India’s best batting lineup. He is the definition of underrated.  The Complete Cricketer He started his career with a bang, making the Pakistani batsmen dance in front of his swing. He kept on impressing the people with his immaculate control on swing and seam. The management dropped him with the reason, that he was not a good death bowler. He simply went back to IPL, improved his abilities. Came back a better bowler. The management dropped him saying, he did not have enough pace. He just went back, gained some speed. Came back a faster bowler. The management needed a better tail ender batsman. He improved his batting skill. He is Bhuvaneshwar Kumar.  He bowls well. He bats well. He fields well. Want to remove the openers, he gets the ball. Want to break a partnership, he is asked to bowl. Want to restrict the batsmen in death overs, he is asked to bowl. Lower order failed, and someone is needed to hang around with the set batsman? He is always there. Bhuvaneshwar Kumar is often ignored as people only praise likes of Bumrah and Kuldeep Yadav in India’s bowling, when he is the vital cog there.  Many other names are there, including… Dinesh KarthikNaman OjhaParthiv Patel (Pretty much every good WKB in Dhoni era)Irfan PathanAmit MishraRobin UtthapaSigning off, Yash Hirani ",
            "date": "Answered February 9, 2018",
            "views": "52",
            "upvotes": " View 67 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sakib Tamboli",
                    "user_href": "/profile/Sakib-Tamboli-2"
                },
                {
                    "user_id": "Rudransh Bhargava",
                    "user_href": "/profile/Rudransh-Bhargava-1"
                },
                {
                    "user_id": "Siddharth Das",
                    "user_href": "/profile/Siddharth-Das-77"
                },
                {
                    "user_id": "Atharva Sawant",
                    "user_href": "/profile/Atharva-Sawant-8"
                },
                {
                    "user_id": "Sandesh Balan",
                    "user_href": "/profile/Sandesh-Balan"
                },
                {
                    "user_id": "Aniket Kumar Singh",
                    "user_href": "/profile/Aniket-Kumar-Singh-85"
                },
                {
                    "user_id": "Amal Varghese",
                    "user_href": "/profile/Amal-Varghese-9"
                },
                {
                    "user_id": "Rekha Roy",
                    "user_href": "/profile/Rekha-Roy-15"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/KUMARAN-R-63"
                },
                {
                    "user_id": "Ankit Sharma",
                    "user_href": "/profile/Ankit-Sharma-4141"
                }
            ]
        }
    ]
}