{
    "title": "Who's your favorite K-pop group between Loona and Dreamcatcher? Why? - Quora",
    "tags": [
        "Dreamcatcher (K-pop)",
        "Loona (K-pop group)",
        "K-Pop Idols"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aspry Wright",
                "href": "/profile/Aspry-Wright"
            },
            "answer_text": "Who's your favorite K-pop group between Loona and Dreamcatcher? Why?  FIGHT!! I asked this question but was hesitant to answer because I like both. A LOT. Let's have a look. Dreamcatcher: a failed group from 2014 that was completely reinvented with a darker tone with rock influences. Amazing dance routines. Relies too heavily on the electric guitar, but it works. They kill cover dances. Kill them! Their music is powerful, with sultry but creepy live performances. They open “You & I\" with vampire attacks…  Shots to the head…  Oh my God, lol. I love this group! Their title songs’ MV's are very supernatural but their b-sides vary. Still, it's the titles that set the stage for a group. They are conceptually hardcore semi-horror. Nobody else in K-pop is doing that. It's a ballsy move. Loona: a relatively new group that debuted in the craziest way ever. Each member was introduced over time with her own song and video. Their little company that supposedly employs under 20 people, sprung for the price of 12 solo projects to intro their group. Holy shit I love that. That's truly believing in their product. They also do great cover dances. In fact, I found them before Dreamcatcher and was immediately impressed by their dancing. They aren't as fiery as Dreamcatcher but they expertly manage their huge team on the stage. These two moves from “Butterfly\" are mind-blowing.   They aren't changing any games with their music but what they do, they do it awesomely. Loona and Dreamcatcher both appeal to me in many ways. Both vocals are comparable. Their names are easy. Loona and Dreamcatcher. Not D8FZ21 or some shit I have to look up to understand. I called 2NE1 “To Anyone\" for five goddam years before I understood how to really say it. I don't like big teams, so that's a deduction for Loona. But I wonder about Dreamcatcher's mass appeal. They're kinda niche and that won't help them down the line. The groups are so similar in their abilities that it would take something minor like that to deduce an outcome. Loona wins. Wait a minute. I just bitched about Dreamcatcher's concept when that's what I love about them? I don't want them to do anything else. That was a crazy thing to write. Okay. Okay, I can't choose. I want them both. Fuck it, it's a tie.  Thanks for reading. ",
            "date": "Answered August 1, 2019",
            "views": "2",
            "upvotes": " View 51 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lily Hawthorne",
                    "user_href": "/profile/Lily-Hawthorne-6"
                },
                {
                    "user_id": "Laine Hiller",
                    "user_href": "/profile/Laine-Hiller"
                },
                {
                    "user_id": "Nivedita",
                    "user_href": "/profile/Nivedita-190"
                },
                {
                    "user_id": "Aira Kay",
                    "user_href": "/profile/Aira-Kay"
                },
                {
                    "user_id": "Anvitha Nath ⁷",
                    "user_href": "/profile/Anvitha-Nath-⁷"
                },
                {
                    "user_id": "Joy Myelin",
                    "user_href": "/profile/Joy-Myelin"
                },
                {
                    "user_id": "Mia Garrett",
                    "user_href": "/profile/Mia-Garrett-18"
                },
                {
                    "user_id": "Kei Yeo",
                    "user_href": "/profile/Kei-Yeo"
                },
                {
                    "user_id": "Karen Will",
                    "user_href": "/profile/Karen-Will-12"
                },
                {
                    "user_id": "Verity Ames",
                    "user_href": "/profile/Verity-Ames"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elisabeth Johnson",
                "href": "/profile/Elisabeth-Johnson-39"
            },
            "answer_text": "i personally don’t like k-rock similar to dreamcatcher but some of their songs really do bop, but i guess all of loonas songs are amazing. dreamcatcher doesn’t have bad songs, they just aren’t my type. loona also doesn’t have any bad songs except like puzzle sorry puzzle iS NOT IT PERIODT PUZZLE BOTHERS ME okay anyways. i personally prefer loonas visuals over dreamcatchers but i also don’t really know dreamcatchers members as well. i think all of them are absolutely gorgeous in their own ways but loona has this alluring aura that makes they so beautiful and made me want to stan them! dreamcatcher as a whole is extremely talented and their members are really cool and interesting, but so are loona members! i really like both groups, but loona is ultimately my favorite!  bruh i didn’t even mean to make that joke but yea go loona ",
            "date": "Answered August 5, 2019",
            "views": "748",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Wide Awake",
                    "user_href": "/profile/Wide-Awake-9"
                },
                {
                    "user_id": "Kiara Reddy",
                    "user_href": "/profile/Kiara-Reddy-5"
                },
                {
                    "user_id": "Kat Martinez",
                    "user_href": "/profile/Kat-Martinez-74"
                },
                {
                    "user_id": "Reggienald Suarez",
                    "user_href": "/profile/Reggienald-Suarez"
                },
                {
                    "user_id": "Aspry Wright",
                    "user_href": "/profile/Aspry-Wright"
                }
            ]
        }
    ]
}