{
    "title": "Why is US music popular in the UK but not vice versa? - Quora",
    "tags": [
        "United States-United Kingdom Relations",
        "Pop Music",
        "Culture of the United States of America",
        "Fame and Mass Popularity",
        "Musicians",
        "The United Kingdom",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kasim Bey",
                "href": "/profile/Kasim-Bey"
            },
            "answer_text": "I’ve only been in the UK for 5 years, so I’m certainly no expert but I do have a few thoughts on the matter. The UK is a bit more nostalgic than the US. In my local area alone there are about 4–5 Blues Brothers tribute singers and maybe as many Freddy Mercury impersonators. Second, British singers normally mimic American accents when they’re singing. But, there’s a tendency to be missing that magical ingredient in their music. I can’t explain it, but it’s like comparing British food to American food. It will fill you up but it ain’t spectacular. This may sound like an exaggeration, but even McDonalds here tastes bland. There’s something in this culture that’s ok with being bland and unexciting. Third, American art forms have been copied for a long time. And even in America Black art forms have been stolen and mimicked like Blues, Jazz, Gospel, Rock & Roll, R&B, etc. and the offenders have Pat Booned all of the soul out of the music until all of what made it so special was sucked out of it. In my opinion, Brits may be able to hit the notes, but miss out on the essence of the music. Fourth, my garage is next to my neighbors garage and he plays an oldies station all day every day. Some days I dread working in my garage, because if I have to hear another Beatles song again I might just take a baseball bat to that innocent radio of his. Some people can listen to the same 3 songs for decades like it’s the first time they heard it. There are a lot of older Brits that do not value creativity in music like I’m used to in America. Finally, I’m thankful for internet radio, because the music that’s played on the radio here can be quite depressing. There are few artists here that don’t sound like the artist that preceded them on the radio. It may be because I’m getting older, but I wind up turning off the radio and just watch the scenery pass by. That’s just how uninspiring the music here is to me and I think the aforementioned observations are contributing factors as to why a lot of Americans aren’t inspired by a lot of acts from the UK. ",
            "date": "Answered May 2, 2019",
            "views": "263",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Frank Stratton",
                    "user_href": "/profile/Frank-Stratton-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Sturt",
                "href": "/profile/Chris-Sturt-1"
            },
            "answer_text": "I am not sure it is. OK, I listen to a particular genre of music, Alternative/Rock, and only listen to the radio station in my home town of San Diego, but probably 20% of the music on the 4 stations I listen to are British. Right now, I just went to the website of my local station 91X, and here are the last 7 songs played (not sure why they picked 7 to show not 10!) From : 91X - Song History JUST A GIRL No DoubtTHOUGHT CONTAGION MuseSEVEN NATION ARMY The White StripesDARE GorillazFIRST DATE BLINK 182SUPERPOSITION Young The GiantSUGAR, WE'RE GOIN DOWN FALL OUT BOYIf that is anything to go from, 2 out of 7 (29%) of the songs were British. From the other station I listen to from the last 28 songs, 5 (18%) were British (and 20 American) Still Breathing Green_DayNorthern Lights Death Cab For CutieSeven Nation Army White StripesSober Up AJRShut Up And Dance - Walk The MoonWish I Knew You The RevivalistsGuiding Light Mumford & SonsSanteria SUBLIMEThought Contagion MuseMountain Sound Of_Monsters_And_Men (Iceland!)Chlorine Twenty One PilotsSail AWOLnationSomething Just Like This Chainsmokers_&_ColdplayWelcome To Paradise Green DayWe Are Young fun_feat._Janelle_MonaeBroken LovelythebandHigh Hopes Panic! At The DiscoScar Tissue - Album Version Red_Hot_Chili_PeppersSit Next To Me Foster The PeopleHo Hey LUMINEERSHome Ft. Nick PetriccaTake Me Out Franz_FerdinandWalking On A Dream Empire_Of_The_Sun (Aussie)Heathens Twenty One PilotsFirst Cold_War_Kids1901 PHOENIX (French)Happier Marshmello F. BastilleLoser BECKThere is the local rock station, with only 1 out of 10 (only 10%) songs this morning being British (unless you count the British singer in AC/DC, but I’ll let Australia have them) Tell Me Baby Red Hot Chili PeppersBodies - Drowning PoolZombie - Bad WolvesRock and Roll - Led ZeppelinBeverly Hills - WeezerAin't No Rest for the Wicked - Cage the ElephantHow Did You Love - ShinedownT.N.T. - AC/DC (British singer!)She - Green DayInsane in the Brain - Cypress HillNow to contrast, I did the same thing for my old favorite Alt station in the UK, Radio X, here is there evening playlist. 8 out of 10 are British, and one Canadian and on Dutch, not an American song in sight! Keep It Together Adam FrenchChameleon BLANcHeadspace Bloxxhttp://Me.TV Black FuturesCry Every Time Chappaqua WrestlingI Don't Like You But I Love You Clean Cut KidDaphne Did It Cleopatrick (Canadian)Crack The Password EUT (Dutch)Upside Down Holy Moly & The CrackersSame Things Twice IdlewildSo certainly when it comes to rock/alternative I would argue that the UK music has a larger influence on the US than the other way around. Of course, if you like 90’s skate punk, then the US wins hands down! ",
            "date": "Answered April 12, 2019",
            "views": "12",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Wade Beckham",
                    "user_href": "/profile/Wade-Beckham"
                },
                {
                    "user_id": "Candida Frith-Macdonald",
                    "user_href": "/profile/Candida-Frith-Macdonald"
                },
                {
                    "user_id": "Emily Montgomery",
                    "user_href": "/profile/Emily-Montgomery-6"
                },
                {
                    "user_id": "Kerry Mcarthur",
                    "user_href": "/profile/Kerry-Mcarthur-3"
                },
                {
                    "user_id": "John Kelly",
                    "user_href": "/profile/John-Kelly-301"
                },
                {
                    "user_id": "Amanda Springer",
                    "user_href": "/profile/Amanda-Springer-3"
                },
                {
                    "user_id": "Steve Hall",
                    "user_href": "/profile/Steve-Hall-309"
                },
                {
                    "user_id": "Matthew Hallsworth",
                    "user_href": "/profile/Matthew-Hallsworth-1"
                },
                {
                    "user_id": "Chris Cherry",
                    "user_href": "/profile/Chris-Cherry-17"
                },
                {
                    "user_id": "Claire Henderson",
                    "user_href": "/profile/Claire-Henderson-24"
                }
            ]
        }
    ]
}