{
    "title": "Why can I sing much higher notes when singing softly, but I cannot do it loudly? - Quora",
    "tags": [
        "High Notes",
        "Singers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Saverio Sciacca",
                "href": "/profile/Saverio-Sciacca"
            },
            "answer_text": "You are probably going into falsetto (Head unmixed) making it easy to reach high tones. If you start from a low tone (Chest range) & go up & you are not accomplished, you will have difficulty to remain in full chest range to what we call full head range, because the tension increases around D1 & E1 (over mid. C1) for men in general E1/F! for tenors. The so called voice is put together by vocal cords attached to vocal muscles. In head function (falsetto) both stretch, but only the cords vibrate. In full voice both stretch & vibrate.The vocal muscles wring like two towels inwardly throwing a novice, who has not yet learned physiological breathing & support. Physiological breathing: Breath as you have always had, where your lungs full up enlarging your diaphragm down & outwardly; sing all tones by utilizing your chest; coming from; leaning from , drawing from your chest! This will slow down the exhalation- Support- manifesting what we call support for the phrases of singing. Your chest resonance will be dominant up to CI slowly going over to head resonant dominance to F1, totally from #FI to high CII. Here from #FI to CII, you will need to tone down the form of your A vowel to Awe, as in AmOre. This allowing for a smaller space in throat to avoid a flat, scream, white vowel tone that would come physiologically as of #FI/GI causing fatigue. This is complete breath & tonal support. Good Luck. ",
            "date": "Answered January 3, 2018",
            "views": "35",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Istvan Geza Juhasz",
                    "user_href": "/profile/Istvan-Geza-Juhasz"
                },
                {
                    "user_id": "Bonnie Boom",
                    "user_href": "/profile/Bonnie-Boom"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prince Rahn",
                "href": "/profile/Prince-Rahn"
            },
            "answer_text": "I’m going to start off with this. Head voice (falsetto) and chest voice are actually the same voice, just stretched into 2 different parts. They all come from the same throat, or set of vocal chords. When you sing higher quietly, you’re pushing higher towards your head voice. It gets to a point where you’re right in between chest and head voice. That point is what people call “mix voice”. It’s when you’re singing and it sounds like chest voice, but you’ve now added some head voice to it. So, in essence, you’re singing in chest and head voice at the same time. When you’re singing louder, it’s harder to sing in that mixed voice because your head voice is softer than your chest voice. So trying to sing from that loud, stronger chest voice, then transitioning to your head voice is not easy. You’d have to gradually get quieter again to switch to mix voice easily. The best way to be able to sing higher louder is to practice your higher notes until they become easier for you, and keep going up, practicing singing loudly until it becomes easy for you. ",
            "date": "Answered January 3, 2018",
            "views": "17",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Celeste",
                    "user_href": "/profile/Celeste-363"
                },
                {
                    "user_id": "Istvan Geza Juhasz",
                    "user_href": "/profile/Istvan-Geza-Juhasz"
                },
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                }
            ]
        }
    ]
}