{
    "title": "Why is modern music so hollow? - Quora",
    "tags": [
        "Modern Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Sheriff",
                "href": "/profile/Peter-Sheriff-1"
            },
            "answer_text": "Not all modern music is hollow but I can understand what you mean. For example, I don’t find an artist like Sam Gellaitry or Lido to have hollow music. Their music makes a point or tells a story. I think that’s the problem with lots of modern music, sometimes it seems to lack a point or story or concentrates much more on technicality than the story to the song. Music is a reflection of society though so maybe the focus on technicality over vibe, story of a song reflects modern societies desire for perfection with the amount of information we have in it and social media which gives off the illusion of having more than we do, and makes others look perfect when they aren’t perfect. I was just listening to a modern producer who made some electro funk music and it sounded good, especially technically. I like some of his music, however I didn’t feel his personality or mood in the song compared to some older funk records I’ve heard. It was more like the producer was like an engineer. Someone who made the song cause he knew he could do it, it felt a bit detached. In a way it isn’t bad but I felt like their was some distance between his song and his real self. Adding to this, the modern studio can be all mostly on your smartphone or PC. People are making songs in their bedrooms. This is a relatively new way of making music so people are seeing what they can do rather than making music just for the fun of it like they may have with more tradtional acoustic instruments. Most videos on production teach technique but not the art of storytelling. I think the main problem with modern music is that we have forgotten a bit that music is an art, storytelling and the balance between technique and the more arty side of music isn’t as balanced as it may have been in the past generally. ",
            "date": "Answered November 10, 2019",
            "views": "147",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Flemming Sørensen",
                "href": "/profile/Flemming-Sørensen-1"
            },
            "answer_text": "When somebody asks this question I always think of this serious, educated, and well thought through lyrics from 1963: \"A well a everybody's heard about the birdB-b-b bird, bird, bird, b-bird's the wordA well a bird, bird, bird, the bird is the wordA well a bird, bird, bird, well the bird is the wordA well a bird, bird, bird, b-bird's the wordA well a bird, bird, bird, well the bird is the wordA well a bird, bird, b-bird's the wordA well a bird, bird, bird, b-bird's the wordA well a bird, bird, bird, well the bird is the wordA well a bird, bird, b-bird's the wordA well a don't you know about the bird?Well, everybody knows that the bird is the word!A well a bird, bird, b-bird's the wordA well a everybody's heard about the birdBird, bird, bird, b-bird's the wordA well a bird, bird, bird, b-bird's the wordA well a bird, bird, bird, b-bird's the wordA well a bird, bird, b-bird's the wordA well a bird, bird, bird, b-bird's the wordA well a bird, bird, bird, b-bird's the wordA well a bird, bird, bird, b-bird's the wordA well a bird, bird, bird, b-bird's the wordA well a don't you know about the bird?Well, everybody's talking about the bird!A well a bird, bird, b-bird's the wordSurfin' birdB-b-b aah, aah!Pa pa pa pa, pa pa pa pa, pa pa pa pa, pa pa pa paPa pa pa pa, pa pa pa pa, pa pa pa paPapa, ooma mow mowPapa, ooma mow mowPapa ooma mow mow, papa ooma mow mowPapa ooma mow mow, papa ooma mow mowOoma mow mow, papa ooma mow mowPapa ooma mow mow, papa ooma mow mowPapa ooma mow mow, papa ooma mow mowOom oom oom oom, ooma mow mowPapa ooma mow mow, papa oom oom oomOom ooma mow mow, papa ooma mow mowOoma mow mow, papa ooma mow mowPapa a mow mow, papa ooma mow mowPapa ooma mow mow, ooma mow mowPapa ooma mow mow, ooma mow mowPapa oom oom oom oom, ooma mow mowOom oom oom oom, ooma mow mowOoma mow mow, papa ooma mow mowPapa ooma mow mow, ooma mow mowWell a don't you know about the bird?Well, everybody knows that the bird is the word!A well a bird, bird, b-bird's the wordA well a ooma mow mowPapa ooma mow mowPapa ooma mow mowPapa ooma mow mowPapa ooma mow mowPapa ooma mow mowPapa ooma mow mow\" I think the conclusion is that there has always been hollow music. One thing that has happened during later years though, is that the attention span of ordinary people has been shortened drastically. Therefore the music has to fit this tendency to be successfull. So there is no time to go into deep feelings or very academic lyrical content. ",
            "date": "Answered July 28, 2018",
            "views": "201",
            "upvotes": "0"
        }
    ]
}