{
    "title": "Why did they make the band BTS? - Quora",
    "tags": [
        "BTS (K-pop group)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nurul Syakilla",
                "href": "/profile/Nurul-Syakilla-2"
            },
            "answer_text": "BTS. BTS stands for Bangtan Sonyeondan, a Korean expression. 방탄소년단 To be more understandable, we can called BTS as Bulletproof Boy Scouts. This name means a lot to them, unlike other groups. This name is suggested by Bang PD. With the concept of youth that they bring, they want to be a symbol that would deny all criticisms and common stereotypes that are faced by teenagers like bullets. That’s why the “school trilogy” concept lasted for 2 years since BTS’s debut. School. This is where all the common problems for teenagers.   The name BTS indicates the role of every member in protecting the values of teenagers. In July 2017, it is announced that BTS will also stand for Beyond The Scene. The members of BTS who is growing, will go beyond the reality that they face. Eventually, they will go further. So, to conclude. BTS brought the name “BTS” because they aim to bring justice. And now, we witness how their dream is achieved in a process. Either with the name of Bangtan Sonyeodan, Bulletproof Boy Scouts or Beyond The Scene, the members are continuing their journey. They ask to LOVE YOURSELF. They ask to SPEAK YOURSELF. So many contributions on behalf of them. Their video, pictures, dance and singing may distinguish even 1 percent of sadness and anger, but it would be enough. A hope that BTS will always be BTS. ",
            "date": "Answered June 5, 2019",
            "views": "54",
            "upvotes": " View 79 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Adamari Naranjo",
                    "user_href": "/profile/Adamari-Naranjo"
                },
                {
                    "user_id": "Summer Zhao",
                    "user_href": "/profile/Summer-Zhao-18"
                },
                {
                    "user_id": "Priya Koshy",
                    "user_href": "/profile/Priya-Koshy-9"
                },
                {
                    "user_id": "Hind Jallab",
                    "user_href": "/profile/Hind-Jallab"
                },
                {
                    "user_id": "Duaa Alle",
                    "user_href": "/profile/Duaa-Alle"
                },
                {
                    "user_id": "Rohini Gopinath",
                    "user_href": "/profile/Rohini-Gopinath-1"
                },
                {
                    "user_id": "Fine Fricke",
                    "user_href": "/profile/Fine-Fricke"
                },
                {
                    "user_id": "BTS ARMY Wolf",
                    "user_href": "/profile/BTS-ARMY-Wolf"
                },
                {
                    "user_id": "Jung Chan",
                    "user_href": "/profile/Jung-Chan-5"
                },
                {
                    "user_id": "Sanjana Abdhoosee",
                    "user_href": "/profile/Sanjana-Abdhoosee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jason Li",
                "href": "/profile/Jason-Li-615"
            },
            "answer_text": "I'm not actually sure if they're real. There's been rumors that they do exist somewhere in Korea, but to be honest it could be a myth. I think that BTS are just imaginary characters that are just a representation of what a perfect ideal group is. They say BTS has a storyline but I think that this storyline is made up by directors to appeal for little kids or teens to give them hope. I personally think that they don't exist; they're just made up characters. I think this because their music videos, their person themselves, and dances just seem to surreal and bizarre to exist in reality. I mean think about it, how in the hell is it possible to be born as an anime character just like how v in DNA looked like? Or how Jimin in blood sweat and tears looked like? There's no way someone in reality would look like them whatsoever. The reason you see BTS the way you see them in music videos is just really good cgi and animation. Like I said before, they probably do exist, but I highly doubt they actually do. If what I'm saying is actually true, which I probably am, then I'm sorry to break it to you, armies, but your favorite boy band isn't real. They're just a concept. ",
            "date": "Answered October 5, 2020",
            "views": "114",
            "upvotes": "0"
        }
    ]
}