{
    "title": "Why do rock stars destroy their guitars and instruments on stage? - Quora",
    "tags": [
        "Rock Stars",
        "Electric Guitars",
        "Guitarists",
        "Rock Bands",
        "Playing Guitar",
        "Guitars",
        "Rock Music",
        "Musical Instruments",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brent Chauvin",
                "href": "/profile/Brent-Chauvin-1"
            },
            "answer_text": "It’s a spectacle, a show. It’s for effect no more no less. Who did it first? Who cares. You could argue that musicians didn’t invent this convention of showmanship. It’s more closer to theater in a way. Get physical with it and the audience in turns feels it more. I would saying destroying your guitar now in 2019 is a turn off unless you can really make me believe that you are angry. Guitars cost money. I would cringe seeing a nice guitar smashes to bits. I think overall, this is for young people in their teens and early 20’s. Seeing un-tethered aggression like that is exciting. Older people see that, and they think, man you just smashed your paul reed smith. Who’s gonna pay for that. But I guess that’s they smash fender copies cause the replacement parts are cheap. Just break the neck, and we can get a new one. You end up with battle scares on the guitar, and it looks cool, very punk. At least that’s what Kurt Cobain did. Break the neck off, and leave it for the tech. Pretty good gimmick if you can pay for it. ",
            "date": "Answered March 27, 2019",
            "views": "603",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Donald Dixon",
                    "user_href": "/profile/Donald-Dixon-6"
                },
                {
                    "user_id": "Nelson Vidinha",
                    "user_href": "/profile/Nelson-Vidinha"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sam Steiger",
                "href": "/profile/Sam-Steiger-2"
            },
            "answer_text": "I’ve been known to indulge in a little Metzger-inspired Auto Destructive Art on rare occasions, when I was young and dumb. Now that I’m old and dumb I don’t have the energy. The first time was really just an act of pure frustration. I was playing in a dank humid basement and probably for that reason one of the strings wouldn’t stay in tune. This was a guitar that I’d saved for months to get and was quite expensive for the time. Every song was marred by the sour tone of that one string slipping constantly, gradually getting on my nerves, till I reached boiling point. At some point I flipped-out and decided to teach the guitar a lesson it would never forget. It put up quite a fight for an inanimate object but after a brief struggle it gave up, ensuring that never again would it plague me with its insolence. I have to admit it was fun, strangely cathartic and the resultant racket was like music to my teenage ears. The five people in the audience seemed to enjoy my display of childish histrionics as well. ",
            "date": "Answered March 19, 2019",
            "views": "972",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Donald Dixon",
                    "user_href": "/profile/Donald-Dixon-6"
                },
                {
                    "user_id": "Nelson Vidinha",
                    "user_href": "/profile/Nelson-Vidinha"
                },
                {
                    "user_id": "Ananth Menon",
                    "user_href": "/profile/Ananth-Menon-1"
                }
            ]
        }
    ]
}