{
    "title": "Why do I get a pressure headache when I sing-along to soft breathy songs? - Quora",
    "tags": [
        "Singing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Axl Hill",
                "href": "/profile/Axl-Hill"
            },
            "answer_text": "Pressure headaches aren't due to the style of song (although some vocal styles tend to cause more headaches such as yelling) This could happen in 3 circumstances: 1. The song isn't in your comfortable range and thus you push above your natural capabilities. This can cause tension and although you are't pushing hard compared to other styles, what pressure is being used is magnified by your bodily tension. 2. Being an inexperienced vocalist means your breathing most likely isn't of a good standard. Make sure to take big deep breaths, down to the diaphragm (place your hand on your stomach and breathe so your hand goes in and out, not your shoulders going up and down).If breathing is not of a good standard it can cause a lot of tension in the note amplifying any pressure. 3. (And this is the most likely cause) All new or inexperienced singers go through stages of what I call \"Tension Fear\" this is where, although often unaware, an inexperienced singer will experience tension through the fear of doing something wrong (this is why drunk people are more inclined to confidently sing karaoke, because intoxication has removed them nerves. This is also why people singing in the shower or car do not feel it, as they aren't purely focused on singing.)Because of this inert fear, new singers will tense up and sing quieter and push more pressure through, even when not needed, that is amplified by the tension leading to pressure headaches. Also, just to add, airy songs obviously require more air to pass through the note. Because of this the lungs are under more pressure, don't be fooled by it being a quiet style of vocals.  Volume =\\= pressure! ",
            "date": "Answered March 5, 2014",
            "views": "179",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Timi Dare",
                    "user_href": "/profile/Timi-Dare"
                },
                {
                    "user_id": "Simon Smolanko",
                    "user_href": "/profile/Simon-Smolanko"
                },
                {
                    "user_id": "Tæ Universe",
                    "user_href": "/profile/Tæ-Universe"
                },
                {
                    "user_id": "Cynthia Antony Kuzhikodiyil",
                    "user_href": "/profile/Cynthia-Antony-Kuzhikodiyil"
                },
                {
                    "user_id": "Sunny George",
                    "user_href": "/profile/Sunny-George-21"
                },
                {
                    "user_id": "Javier Hernandez",
                    "user_href": "/profile/Javier-Hernandez-93"
                },
                {
                    "user_id": "Ruchi Handoo",
                    "user_href": "/profile/Ruchi-Handoo"
                },
                {
                    "user_id": "Jason M Stallworth",
                    "user_href": "/profile/Jason-M-Stallworth"
                },
                {
                    "user_id": "Mohamed Dhia Rezgui",
                    "user_href": "/profile/Mohamed-Dhia-Rezgui"
                },
                {
                    "user_id": "Wednesday Alicarte",
                    "user_href": "/profile/Wednesday-Alicarte"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rafat Hauque",
                "href": "/profile/Rafat-Hauque"
            },
            "answer_text": "Check your breathing technique. There is a high probability that you are failing to have strong control when you are letting the air out and putting too much pressure on your voice. Conserving the breathe and letting it out in a controlled way and getting more air in a regular interval during singing might help you. Since I cannot witness what you are trying to do, I am not sure how to give you specific solutions. Here are a few possible solutions that might help- Hissing practice (do not go beyond your comfort zone, the time you can sustain will increase gradually as you start practicing).Staccato (start from a low home and try to reach up to as high as you can, but once again, do not go beyond your comfort zone).When you're singing a breathy song, find out at which points you are running out of breathe. Make sure you take breathe in a regular interval. You do not have to exhaust the breathe, make sure even when you have the air conserved, you let the previously taken air out and breathe in. Set your interval in such a way so that you have still air left to use.Sing your heart out! ",
            "date": "Answered April 26, 2018",
            "views": "31",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Rose-3164"
                }
            ]
        }
    ]
}