{
    "title": "Why is Metallica so popular? - Quora",
    "tags": [
        "James Hetfield",
        "Metallica (band)"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Singer",
                "href": "/profile/John-Singer-59"
            },
            "answer_text": "I will give you the real answer! It is NOT because any of the following: They were the bestThey did something that no one did beforeThey were the fastest and heaviestThe real reason they got popular is… They benefited greatly by existing in a PRE-INTERNET world, as did all the famous bands in the 80s, 90s and the bands before them. The basic idea is that they benefited from people’s ignorance or the lack of knowledge of what was actually happening around the world or even across the united states. Why is this so important? It is simply the reverse logic of today. Why can’t great musicians stand out today? Because there is too much noise on the internet. Everybody who owns a guitar and a pirated copy of pro tools has content to share. Real musicians and bands can no longer stand out because there are too many bands and wannabe musicians everywhere and the normal population can’t sift through the noise. Simply stated, back then there weren’t that many bands around and people generally weren’t aware they had other options due to limited communication. Essentially people were living in somewhat isolated bubbles of limited knowledge or ignorance if you will. The two great things about Metallica were they had good songwriting skills and they were marketed extremely well. The following is absolutely true from the time Metallica came to fame. The new wave of british heavy metal hadn’t completely hit the States mainly due to limited communication. Most people only knew about Iron Maiden and Judas Priest but they weren’t fully aware of bands like Diamond head, etc that influenced Metallica.There were other bands that were faster, heavier and doing what Metallica was doing but people didn’t know about them.From 1983–1989. If you listened to bands like Metallica, Slayer, Megadeth and Anthrax, that was the heaviest music around. BUT hardly anybody knew that during that time there were multiple underground scenes brewing in England and the United States where there were many bands that played faster and harder than Metallica or Slayer ever did. But the perception was, these bands (Metallica, etc) were the only bands doing what they were doing because as I said people didn’t know what was happening outside big media information feeding.If you were in California, you literally didn’t know there was a heavier scene brewing in Tampa, Florida as early as 1986 unless you saw it in some obscure magazine or heard about it through a friend. Bands like Death and Morbid Angel started around 1983 around the same time as Metallica but in Florida. As early as 1983–1988, bands like Carcass and Napalm Death were pioneering grindcore and extreme metal in England. But generally all people knew about were a limited number of bands that were ‘perceived’ to be the heaviest such as Metallica, Slayer, Megadeth and Anthrax.If Metallica were starting out today, they would be lost in the internet among all the other bands. Here are some things they did to become more popular. When extreme metal was big (thrash was considered extreme metal at that time), they rode that wave high from 1983 to 1989. Such a scene could never exist today because we don’t live in isolated bubbles as people did at that time. What I’m saying is, thrash was considered THE extreme form of music but there were actually many more extreme scenes happening at the exact same time but only a limited number of people knew about them.In the Black album, they changed their sound because metal was peaking and everybody was doing it and around that time, they knew there were other heavier bands that were coming out. So they had to differentiate themselves by changing direction.After the black album, they basically did what any new band would have done if they had come up at that time, so they tried to fit in with what was happening which was grunge and alternative music. Lars actually said on MTV that, “Heavy metal is over” for Metallica after the Nirvana boom happened. .This then became a pattern where they started jumping on whatever was current as evident with St.Anger.Ultimately, Metallica is popular because they benefited greatly from the pre-internet era, brilliant marketing, great initial songwriting and also because they adopted to the current landscape and relevant trends easily. Update: For the people that don’t like this answer. I am 46 years old.. lol. I was there in the late 80s and I can tell you what my high school was like. We lived in isolated bubbles. You were either into Metallica or Megadeth and if you were truly crazy you were into Slayer. I heard of Carcass and Napalm Death but that’s about it and that only because somebody introduced it to me. Other than this you had about 30 other bands from the new wave of british heavy metal and the glam bands like GnR. Literally no one knew that death metal was brewing in Florida. That was not common knowledge. In 1988, if you listened to Slayer, that was the most brutal, evil thing out there period. As I explained above, there were harder bands but we did not know about them because there was no internet. So in this way, Metallica benefitted greatly because we did not know there were other heavier and faster underground options. This is why you don’t see bands come up today because we don’t live in isolated bubbles anymore. ",
            "date": "Updated August 28, 2020",
            "views": "109",
            "upvotes": " View 50 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ariana Cote",
                    "user_href": "/profile/Ariana-Cote"
                },
                {
                    "user_id": "Maieiei ً",
                    "user_href": "/profile/Maieiei-ً"
                },
                {
                    "user_id": "Dorothy Hockenberry",
                    "user_href": "/profile/Dorothy-Hockenberry"
                },
                {
                    "user_id": "Rahul Dhage",
                    "user_href": "/profile/Rahul-Dhage-6"
                },
                {
                    "user_id": "Azizul Alias",
                    "user_href": "/profile/Azizul-Alias"
                },
                {
                    "user_id": "Olivier Alcide",
                    "user_href": "/profile/Olivier-Alcide-1"
                },
                {
                    "user_id": "Michael Criswell",
                    "user_href": "/profile/Michael-Criswell-7"
                },
                {
                    "user_id": "Zac Afer",
                    "user_href": "/profile/Zac-Afer"
                },
                {
                    "user_id": "Dagur Björnsson",
                    "user_href": "/profile/Dagur-Björnsson"
                },
                {
                    "user_id": "Jasper Bezemer",
                    "user_href": "/profile/Jasper-Bezemer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gilles Vaudois",
                "href": "/profile/Gilles-Vaudois"
            },
            "answer_text": "You can read my answer below, it’s rather complete. But if you want to know why Metallica is so popular, you may as well read that Billboard article, which somehow manages to explain that, in a nutshell. Metallica is just unique. Here's How You Can Go to Every Show on Metallica's Upcoming North American Tour Metallica has been a constant presence for 30+ years in pop culture. For every Justin (Bieber or Timberlake), Lady or any new phenomenon, the one band representing power songs (power chords) all around the world, seemingly constantly on tour and/or with a new relevant album out there, has been Metallica. It was the top concert draw in the US for the 90’s. Even between albums, they still manage to tour here or there, maintaining a presence and a sense of continuity no matter what.  So it’s about character, but also management, somehow they remained on top business-wise throughout decades of existence, and when they fell really hard (with Napster and James’ rehab) they still managed to get something significant out of it - namely a groundbreaking documentary, “Some kind of monster”, then a 3D half-concert half-story movie. There are mega-fans who support the band no matter what, and the rest of the world is curious about that band - sales for the “black album” (1991) are still strong after a quarter-century. It’s a band that keeps reinventing itself, always coming up with new music and tricks while keeping tabs with their roots, inspired by U2 in the way they carry themselves, manage their own career.  They bring value. It’s an unbeatable product, period. Yeah, that’s it. They’re great. Simple as that. Well-managed, well-balanced, always performing and giving fans something great and highly enjoyable, and always giving more. They had a fan-club for decades (paid membership), membership is now free (yet they recognize “legacy” fans who paid for years by giving them extra benefits). Always manage to be fair to anyone. Their website is up-to-date, probably the best in the business - anything you want is available: all recent concerts are recorded and available for download a few days later, a lot of older stuff gets uploaded on the regular. “St Anger”, their 2003 album, came with a DVD of the whole album recorded live in the studio. Not only you had the songs on the CD, but you could watch the band performing the songs together in the studio, in live conditions, only without a crowd. It was awesome, just mind-blowing. High production value, such a big bang for my bucks.  The last tour (2017-current), while performing the song “a moth into a flame”, they had dozens of mini-drones flying over the stage in a beautiful display. Just mind-blowing. Here you have it, they always manage to keep up with expectations. Or exceed them, just for kicks. They’re true. You know you’re paying for stuff, but it’s so cool, you don’t get the sense of getting ripped off, ever. The concerts? 2-plus hours of loud stuff, relentless energy, as close to the audience as possible (central stage in arenas). In 2012, when they celebrated 20 years of the “Black album” with a special tour (may 12, 2012 in Stade de France with 75 000 attendance), they performed the whole album (12 songs) in reverse order (because they had to finish on top with hit song “enter sandman”, which is the first song of the album), yet still managed to play 5 songs beforehand, including one brand new (“hell and back”) and one special (“No remorse”) and followed with 3 extra songs as an encore. 20 whole Metallica songs - I think it lasted over 3 hours or so. Such an awesome memory (as I attended and enjoyed).  Breaking news!!! As I mentioned on top, Metallica issued 250 special tickets for their 34-date US tour, “a leg of the WorldWired tour which focuses on markets Metallica missed last year”. For a hefty sum upfront ($598), fans can attend as many concerts as they can (travel expanses and a clear schedule being the biggest challenge for most people, but that can be managed). Of course these “wherever I may roam black tickets” are sold out already. Basically, if you want to follow the band across the country, you can. You get your money’s worth by attending 4 shows (out of 34), so every extra show after that is free… Need I say more? Metallica constantly makes things happen. Song Statistics - Metallica ",
            "date": "Updated May 1, 2019",
            "views": "71",
            "upvotes": " View 34 Upvoters",
            "upvoters": [
                {
                    "user_id": "Franklyn Ezekiel",
                    "user_href": "/profile/Franklyn-Ezekiel"
                },
                {
                    "user_id": "Dorothy Hockenberry",
                    "user_href": "/profile/Dorothy-Hockenberry"
                },
                {
                    "user_id": "Rahul Dhage",
                    "user_href": "/profile/Rahul-Dhage-6"
                },
                {
                    "user_id": "Jim Wilson",
                    "user_href": "/profile/Jim-Wilson-141"
                },
                {
                    "user_id": "Jesus Camejo Rodriguez",
                    "user_href": "/profile/Jesus-Camejo-Rodriguez"
                },
                {
                    "user_id": "Eunice Olave",
                    "user_href": "/profile/Eunice-Olave"
                },
                {
                    "user_id": "Jim Davis",
                    "user_href": "/profile/Jim-Davis-531"
                },
                {
                    "user_id": "Aadhya Sharma",
                    "user_href": "/profile/Aadhya-Sharma-7"
                },
                {
                    "user_id": "Brian Stevi",
                    "user_href": "/profile/Brian-Stevi"
                },
                {
                    "user_id": "Prashant Muneshwar",
                    "user_href": "/profile/Prashant-Muneshwar-4"
                }
            ]
        }
    ]
}