{
    "title": "Why do so many musicians use Macs? - Quora",
    "tags": [
        "Professional Musicians",
        "Music Producers",
        "Composers",
        "Music Composition",
        "Music Production",
        "Mac (computer)",
        "Artists and Creative Professions",
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kirk A. Janowiak",
                "href": "/profile/Kirk-A-Janowiak"
            },
            "answer_text": "There are two fundamental reasons and a host of smaller reasons: Macs work out of the box and are felt by musicians and many other creatives as being more intuitive than Windows, and certainly more intuitive than typical Linux-based PCs. The Mac OS tends to fail (crash) less often, plays quite well with even aging software, and is much less likely to be attacked by malware than Windows PCs.Mac machines are built with premium components and hardware. The external cases and the frames of the laptops are made of tough metals and alloys and better withstand the rigors of the road than most (certainly not all) PC laptops made of plastics. Even the iMac is built more durable than it needs to be and withstands rough handling better than most desktop machines and their monitors.Longevity is another reason many people like Macs. Most Macs remain serviceable and useable for 5 years or more. Each of my last two, heavily-used MacBooks worked quite well for over 6 years. I finally broke one through abuse. The one I have now is just beginning to show its age at just under 7 years [Edit Summer 2019: This ol’ MacBook Pro still works, but I retired it in 2019 after more than 10 years of daily service…for a 2012 model that is still enough to do the work. The iMac purchased at the same time as the retired MBP is still in daily use with years of expected use predicted.]. Most inexpensive PC laptops give a couple or three years of service before the incessant changes and updates to the Windows system software begins to cause slow-downs and unpredictable incompatibilities with installed applications. Inexpensive PCs often come with lower-quality hard drives that are prone to fail if they are heavily used (often get hot). The typical PC system is more sensitive to drive fragmentation than the Mac OS, so PCs tend to experience far more hard drive failure due to mechanical issues and issues caused either by the fragmentation itself (e.g. loss of bits in a small fragment during writing or copying) or or due to issues caused by accidents during the defragmentation process. Yes, it appears that Macs cost a bit more, but you get what you pay for. If you spec out a Windows PC laptop with the same quality internal components, from the tiniest stainless steel screws, to the power supply, the motherboard, to the material the frame and case is made of, you'll find the price differences shrink pretty quickly. Consider the longevity, and the amortization brings the annual cost of ownership into line between the PC & Mac. ",
            "date": "Updated September 3, 2019",
            "views": "10",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Martin",
                    "user_href": "/profile/James-Martin-2"
                },
                {
                    "user_id": "Edmund Grondine",
                    "user_href": "/profile/Edmund-Grondine"
                },
                {
                    "user_id": "Sanki King",
                    "user_href": "/profile/Sanki-King"
                },
                {
                    "user_id": "Keshav Singh",
                    "user_href": "/profile/Keshav-Singh-124"
                },
                {
                    "user_id": "Paul Rodger",
                    "user_href": "/profile/Paul-Rodger"
                },
                {
                    "user_id": "Lslam . Kz",
                    "user_href": "/profile/Lslam-Kz"
                },
                {
                    "user_id": "Bibek Aryal",
                    "user_href": "/profile/Bibek-Aryal-3"
                },
                {
                    "user_id": "Pratham Shanbhag",
                    "user_href": "/profile/Pratham-Shanbhag"
                },
                {
                    "user_id": "Akhil Sivakumar",
                    "user_href": "/profile/Akhil-Sivakumar-1"
                },
                {
                    "user_id": "Mark Eaton",
                    "user_href": "/profile/Mark-Eaton-66"
                }
            ]
        },
        {
            "author_info": {
                "name": "Malcolm Pike",
                "href": "/profile/Malcolm-Pike-2"
            },
            "answer_text": "Somewhere around the mid nineties when home recording on a computer first became possible/affordable - it was on an Apple computer first. There really wasn’t a choice. For at least a couple of years, my home office/studio was split right down the middle (literally divided in two - mostly with music/recording related gear) - on the left was my Windows PC desk (I was a computer programmer for about 16 years) and on the right was my Apple/Mac desk (i’ve been a musician a lot longer than that). I had no choice with the Windows PC either - all of my clients used them - so I had to as well. But I’m getting ahead of myself - the first personal computer I bought was an Apple SE30. That was the early 90’s and we were still a ways away from any kind of audio recording! I remember being thrilled when Apple released a new software driver for my printer that allowed me to print in gray scale instead of black and white. In those early days - Apple/Mac was the most exciting thing around. Even with it’s gray scale little screen and rudimentary GUI - wow - it’s making me a bit nostalgic thinking of those times…. But - anyway - from the beginning Apple was the computer for artists and musicians. PC’s with Windows and mainframes running UNIX were for business’s and crunching numbers. Of course, Apple wanted to be in offices crunching numbers too - and Microsoft wasn’t sitting still doing nothing either - because the next thing we knew - Windows showed up - (yeah I remember pre-Windows MS-Dos days - and dBase and Lotus 123…. And NO Apple). And eventually they started to catch up with each other…. I remember being a bit confused by MS Office for Macs! It makes sense of course, now, but back then it was weird. I better say this right now - as far as which is best and all that - whatever. I know all the arguments and I’ve heard the fanatics on both sides - it’s boring. I have used and loved (and hated) both platforms - as well as UNIX and Ubuntu/Linux and - and if it does what I need it to - cool. (It’s still a love/hate relationship and always will be - i’m just glad they work at all) anyway… Although I haven’t thought about this forever, Apple screwed up pretty big in the latter part of the 90’s - I don’t remember exactly when (and what were they called? “power pc’s” or something?) Anyway, for a little while Apple allowed other companies to make “macs” (so to speak) - but the whole thing didn’t work out very well (Steve Jobs wasn’t there if I remember right - wasn’t he off working on “the box” or something?) - anyway - macs were also more expensive, as was the software, with far fewer software titles than Windows. And then Cubase for Windows came along and some affordable audio interfaces… And anyway it was a pain - and expensive - having to keep both systems like that. So- with a wife and kids to take care of - and clients all on Windows - well - I sold my Mac and was basically done with them by the late 90’s. I still use Cubase on Windows to this day. Oops! Sorry - what was the question? Why do so many musicians use Mac’s? Always have and why not? Technically I don’t use a Mac but I do enjoy my iPad (using it to write this) and iPhone - and Apple Music and Garage Band and Cubasis… So - Thanks for the trip down memory lane! Now I better go record something and everything better work right! Cheers, brad ",
            "date": "Updated July 12, 2017",
            "views": "45",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Keshav Singh",
                    "user_href": "/profile/Keshav-Singh-124"
                },
                {
                    "user_id": "David Wilson",
                    "user_href": "/profile/David-Wilson-1654"
                },
                {
                    "user_id": "Ernesto Pichardo",
                    "user_href": "/profile/Ernesto-Pichardo-2"
                },
                {
                    "user_id": "Lucas Valdovinos",
                    "user_href": "/profile/Lucas-Valdovinos"
                },
                {
                    "user_id": "Jack Mills",
                    "user_href": "/profile/Jack-Mills-19"
                },
                {
                    "user_id": "John Crosby",
                    "user_href": "/profile/John-Crosby-2"
                },
                {
                    "user_id": "Ryan Kony",
                    "user_href": "/profile/Ryan-Kony"
                },
                {
                    "user_id": "Jiang Junbo",
                    "user_href": "/profile/Jiang-Junbo"
                },
                {
                    "user_id": "Vincent Verschuren",
                    "user_href": "/profile/Vincent-Verschuren"
                }
            ]
        }
    ]
}