{
    "title": "Why do a lot of bands have two guitarists, with both playing essentially the same part (rhythm guitar)? - Quora",
    "tags": [
        "Electric Guitars",
        "Rock Bands",
        "Bands (music)",
        "Guitars",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Keith La Croix",
                "href": "/profile/James-Keith-La-Croix"
            },
            "answer_text": "As some if not most have responded here, they’re not playing the same part. There are more than a few reasons to have two guitarists. As someone said here, it thickens the sound. In this case, it’s best if the two use different voicings of the same chords: one might play them in the low midrange while the other plays the same chord, but higher broadening the tonal spectrum. In other cases, the two guitar players might play radically different instruments. Though Jimmy Page was the sole Led Zeppelin guitarist, in the studio, he would often layer his brighter Telecaster over his darker Les Paul. Having two guitarists also allows for more interesting parts to be played without losing sound. Someone gave the great example of Keith Richards and Ron Wood where neither just play simple rhythm parts, but play interesting part off of one another. But sometimes a singer/guitarist does just play a simple rhythm part and they need another guitar player to put something more interesting over it. The Pretenders and The Cars come to mind where James Honeyman-Scott in the former and Elliot Easton in latter put the icing on the cake that their band leaders, Chrissie Hynde and Ric Ocasek respectively, provided. It also allows different styles to be used: slide guitar over fretted guitar in the Allman Brothers, Adrian Belew’s experimental sounds over Robert Fripp’s prog rock in their version of King Crimson. The bottom line is that when well used, two guitar players can yield a bigger, thicker, and more interesting sound. ",
            "date": "Answered November 23, 2017",
            "views": "479",
            "upvotes": " View 151 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michiel Lombaers",
                    "user_href": "/profile/Michiel-Lombaers"
                },
                {
                    "user_id": "Wayne Knazek",
                    "user_href": "/profile/Wayne-Knazek-1"
                },
                {
                    "user_id": "Jeff Jochim",
                    "user_href": "/profile/Jeff-Jochim-1"
                },
                {
                    "user_id": "Rafli Avriza",
                    "user_href": "/profile/Rafli-Avriza"
                },
                {
                    "user_id": "Yashaya Yasharahla",
                    "user_href": "/profile/Yashaya-Yasharahla"
                },
                {
                    "user_id": "Dimitar Kalmadanski",
                    "user_href": "/profile/Dimitar-Kalmadanski"
                },
                {
                    "user_id": "Samuel Jordan",
                    "user_href": "/profile/Samuel-Jordan-17"
                },
                {
                    "user_id": "Fred May",
                    "user_href": "/profile/Fred-May-3"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/A-Non-Pony"
                },
                {
                    "user_id": "Chris Malek",
                    "user_href": "/profile/Chris-Malek-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Larry Atchley Jr",
                "href": "/profile/Larry-Atchley-Jr"
            },
            "answer_text": "Especially in Heavy Metal bands that often have two or even three guitarists, while one or two are playing rhythm, the other is playing the guitar solo. Often, the different guitarists will trade off playing solos during the song. Every professional guitarist has a unique signature sound, so it adds much more variety to the rhythm and solo playing. Also, as others have mentioned, having multiple guitars adds layers and depth to the music, especially when playing live. You can have one guitarist add multiple guitar parts to a song in the recording studio, but to pull off playing that same song in a concert where it will sound close to the recording, you need more than one guitarist. It will never sound as rich or complex as the recording, because you can add so many layers of sound in the studio that you cannot have in a live performance. Bands that are known for their sounding especially great in concert typically use more than one guitarist. Good examples: Iron Maiden, with Dave Murray, Adrian Smith, and Janick Gers, and Judas Priest, with Glenn Tipton, and K.K. Downing. And of course, we are only talking about lead and rhythm guitarists, not bass guitarists, as there would be one of those in the band to help drive the beat of the song in conjunction with the drummer. You don't need more than one bassist because adding another would likely “muddy” the sound. ",
            "date": "Answered November 29, 2017",
            "views": "51",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yashaya Yasharahla",
                    "user_href": "/profile/Yashaya-Yasharahla"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/A-Non-Pony"
                },
                {
                    "user_id": "Angie Moon",
                    "user_href": "/profile/Angie-Moon-3"
                },
                {
                    "user_id": "Frank Rasche",
                    "user_href": "/profile/Frank-Rasche-2"
                },
                {
                    "user_id": "Ennis Nortey",
                    "user_href": "/profile/Ennis-Nortey"
                },
                {
                    "user_id": "Stuart Holme",
                    "user_href": "/profile/Stuart-Holme"
                },
                {
                    "user_id": "Samuel Gaytan",
                    "user_href": "/profile/Samuel-Gaytan"
                }
            ]
        }
    ]
}