{
    "title": "Why do people get upset when someone tells the truth? - Quora",
    "tags": [
        "Truth",
        "Interpretations of Human Behavior",
        "Understanding Emotions",
        "Emotions",
        "Interpersonal Interaction"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Kidwell",
                "href": "/profile/William-Kidwell-1"
            },
            "answer_text": "In his classic book, The Confessions, Saint Augustine tells us: “People love the truth when it serves them, but they hate it when it doesn’t.” It sounds very cynical, but you have to realize Saint Augustine is writing from the standpoint of a repentant sinner. Without compromising Saint Augustine’s religious intent just to benefit psychology - it seems fair to say, even if a person manages to see through their own sins and hypocrisies, they still have to deal with the iniquities of people who may or may not care about the truth. Let’s look at a psychological example. I’m an accountant, not a psychologist. And, while it may not seem like an accountant should speak to psychological matters, I can tell you there are very few people in the world who won’t lie about money or property. People will always do everything they can to acquire and/or protect money and property as much as possible. And, yet, what are they? Money is certainly not the reality of the property it “values”. In that sense, money is basically nothing more than greedy lie. But people still often treat it as if it is the reality itself, so you can begin to see where someone, somewhere along the line, is likely to push a lie - even upon an innocent soul. Pontius Pilate - who’s name was right on the money as his own property - asked Jesus, “What is truth?” Let’s look away from money to an example of human behavior. After what happened in Parkland Florida last week, I’ve been watching a lot of old documentaries on Sandy Hook, Columbine, etc.. During these videos - as is popular in the media - everyone keeps blaming school shootings on gun control or psychological problems. But the problem isn’t gun control or psychology - it’s probably more in the media. The Truth is - every one of us knows how to be charitable at every point in time, and there’s never an excuse not to be charitable. A simple prayer makes this clear. Looking directly at and working off of a charitable motive would likely never result in a school shooting. Even if a person were totally insane, i.e. unable to identify right and wrong, their instincts for self-preservation and the preservation of others would still probably be intent on doing something good, even though their actions would be random. No amount of political dialogue, legislation, social media commentary, psychological study, education or entertainment will ever be able to deny the good charity itself can accomplish. So why do people get upset over the truth? If they do, then it’s probably because most of us are asking non-existent questions, or often looking for answers in the wrong way or wrong place. ",
            "date": "Answered March 2, 2018",
            "views": "68",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Jeen",
                    "user_href": "/profile/David-Jeen"
                },
                {
                    "user_id": "Hydra Sagaria",
                    "user_href": "/profile/Hydra-Sagaria"
                },
                {
                    "user_id": "Rikki Monique",
                    "user_href": "/profile/Rikki-Monique"
                },
                {
                    "user_id": "Natalie Coninx",
                    "user_href": "/profile/Natalie-Coninx"
                },
                {
                    "user_id": "William Thompson",
                    "user_href": "/profile/William-Thompson-254"
                },
                {
                    "user_id": "Richard Deschambault",
                    "user_href": "/profile/Richard-Deschambault"
                },
                {
                    "user_id": "Amelia McDowell",
                    "user_href": "/profile/Amelia-McDowell-1"
                },
                {
                    "user_id": "James Fern",
                    "user_href": "/profile/James-Fern-2"
                },
                {
                    "user_id": "Mark Mangrum",
                    "user_href": "/profile/Mark-Mangrum-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jessica Burde",
                "href": "/profile/Jessica-Burde"
            },
            "answer_text": "Context matters. Who is stating what fact, to whom, when. Tell a grieving mother whose child died of a drug overdose, “It’s his own fault he died,” is, technically, stating a fact. It is also likely to get you (at best) escorted out of the mother’s presence and hopefully punched in the face. Because regardless of how true it is, it is dismissive of her grief and as such cruel to someone who is already suffering. Telling an insecure person that their plan is logically unsound and economically unfeasible will make them angry because most insecure people take criticism and critiques of their ideas and work as self criticism and get angry in self defense. Tell someone a fact that violates their fundamental beliefs, and you run into cognitive dissonance, which Eric Tran did a better job that I could of breaking down Eric Tran's answer to Why do people get upset when someone tells the truth? When asking about human behavior, you always need context. Edit to add: This of course assumes that the person in question IS actually stating a fact. Way, way to often I’ve seen someone say “Hey, it’s just a fact” about something that is actual flat out WRONG and it is their cognitive dissonance that keeps them from learning otherwise. And while I can’t speak for anyone else, yes I get mad when I need to refute the same false “fact” for the fourth time this month because Google exists and I am not your teacher, but when I tell people they are wrong about a deeply embedded belief, they demand I prove it. I have better things to do with my time then try to educate someone who takes it as an article of faith that they are right and I am wrong. ",
            "date": "Updated August 12, 2017",
            "views": "27",
            "upvotes": " View 47 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hydra Sagaria",
                    "user_href": "/profile/Hydra-Sagaria"
                },
                {
                    "user_id": "K So",
                    "user_href": "/profile/K-So-11"
                },
                {
                    "user_id": "David Penney",
                    "user_href": "/profile/David-Penney-2"
                },
                {
                    "user_id": "Alfa",
                    "user_href": "/profile/Alfa-138"
                },
                {
                    "user_id": "Kaiya Mudge",
                    "user_href": "/profile/Kaiya-Mudge-2"
                },
                {
                    "user_id": "Vib (विभांशु)",
                    "user_href": "/profile/Vib-विभांशु"
                },
                {
                    "user_id": "Helen Bowden",
                    "user_href": "/profile/Helen-Bowden-2"
                },
                {
                    "user_id": "Isaac Vega",
                    "user_href": "/profile/Isaac-Vega-1"
                },
                {
                    "user_id": "Cecilia Crosby",
                    "user_href": "/profile/Cecilia-Crosby-1"
                },
                {
                    "user_id": "Jay Roberts",
                    "user_href": "/profile/Jay-Roberts-34"
                }
            ]
        }
    ]
}