{
    "title": "Why do so many people hate the sound of the accordion? - Quora",
    "tags": [
        "Accordions",
        "Musical Instruments",
        "Hate",
        "Music",
        "Understanding Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lourdes M. Cabrera",
                "href": "/profile/Lourdes-M-Cabrera"
            },
            "answer_text": "The first thing that comes ot mind upon reading the question is: accordions create a sound of sadness. Like the violin, it could be high pitched or low. It depneds on th handling requiredd to playing it. The sad notes the accordion plays are truly unattractive to the hearers, inthe same way when the sound gets high-pitched. I do not like the violin’s high-pitched sound, exveot when the notes required it. So it is not much with accordion. Perhaps, the baisc construction of an accordion has somehting to do with it. (Source: https://en.m.wikipedia.org) Construction  Play media A diatonic button accordion being played Accordions have many configurations and types. What may be technically possible to do with one accordion could be impossible with another: Some accordions are bisonoric, producing different pitches depending on the direction of bellows movementOthers are unisonoric and produce the same pitch in both directions. The pitch also depends on its size.Some use a chromatic buttonboard for the right-hand manualOthers use a diatonic buttonboard for the right-hand manualYet others use a piano-style musical keyboard for the right-hand manualSome can play in different registersCraftsmen and technicians may tune the same registers differently, \"personalizing\" the end result, such as an organ technician might voice a particular instrument",
            "date": "Answered September 22, 2019",
            "views": "289",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Donald",
                "href": "/profile/David-Donald-1"
            },
            "answer_text": "Mostly because they have either heard only granny music, Polish wedding tunes, or bad trad. If you have ever heard a great French Jazz Acordianist or Astor Piazolas bandion tangis you don’t understand what the instrument can do. ",
            "date": "Updated May 22, 2020",
            "views": "97",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Liz Hobby",
                    "user_href": "/profile/Liz-Hobby"
                },
                {
                    "user_id": "Shawn Stovall",
                    "user_href": "/profile/Shawn-Stovall-1"
                }
            ]
        }
    ]
}