{
    "title": "Why do I cry over some songs? - Quora",
    "tags": [
        "Crying",
        "Songs",
        "Understanding Emotions",
        "Emotions",
        "Music",
        "Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Proctor",
                "href": "/profile/James-Proctor"
            },
            "answer_text": "Interesting to me that almost every single answer to this question has assumed an emotional response due to triggered memories. Perhaps that's why, but then, I doubt you would have asked your question; you'd know why, as you would relive those strong memories and experiences. Fairly obvious connection. I'm going to give a different answer based on my own experience. I think music (with our without singing) can be emotive in a general sense. Not sad, not mournful, not anything specific. Just powerful in pure, undirected fashion. You say “a song that's not sad or emotional,” but I take that to mean specifically emotional. Your crying response may be related to the ability of music to make your feel, not one way or another, but to powerfully open you up. I've experienced this, and it often gives me chills/goosebumps and brings me to tears. Not because I'm sad, mad, happy, or excited. But because there is an immensity of feeling, of emotion. It's like the raw emotional substrate upon which all emotions are built. And it moves us powerfully. These experiences are not based on specific connections you've made between a song and an experience. They aren't nostalgia. They aren’t due to memories, repressed or otherwise. They are simply part of what it is to be human. We are innately musical, and this is a manifestation of this fact. Not sure if this describes your experience or helps you, but it describes my own experience with instances like you mentioned in your question. I'm not emotional in a specific way. I'm fundamentally moved. You are OK. It's totally OK. In fact, it's beautiful. It's part of what makes us human. And it's one of the more powerful, rich experiences one can have. Treasure these experiences. ",
            "date": "Answered February 3, 2017",
            "views": "32",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shivaprasad G",
                    "user_href": "/profile/Shivaprasad-G-13"
                },
                {
                    "user_id": "Manisha Manu",
                    "user_href": "/profile/Manisha-Manu-48"
                },
                {
                    "user_id": "Marc Salmo",
                    "user_href": "/profile/Marc-Salmo"
                },
                {
                    "user_id": "Justine Bulaong",
                    "user_href": "/profile/Justine-Bulaong"
                },
                {
                    "user_id": "Dove Russo",
                    "user_href": "/profile/Dove-Russo"
                },
                {
                    "user_id": "Anthony Baggins",
                    "user_href": "/profile/Anthony-Baggins"
                },
                {
                    "user_id": "Mallerie Hendrix",
                    "user_href": "/profile/Mallerie-Hendrix"
                },
                {
                    "user_id": "Huyen-Tran Phung",
                    "user_href": "/profile/Huyen-Tran-Phung"
                },
                {
                    "user_id": "Yin Shan Ho",
                    "user_href": "/profile/Yin-Shan-Ho"
                },
                {
                    "user_id": "Jason Thompson",
                    "user_href": "/profile/Jason-Thompson-125"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Hesterberg",
                "href": "/profile/Michael-Hesterberg-1"
            },
            "answer_text": "The answers that Sid Davis, and GR gave are very complete and say most everything. But, I’ll add just one more element. If you’re a person with active imagination, then you can add “empathy” to the other reasons. I’m telling my age here; but when the song “Tie a yellow ribbon” by Tony Orlando and Dawn first came out, back around 1973, it was responsible for an upsurge in Kleenex brand tissue stock! In case you’re too young to have memories of this song; here it is in a nut-shell: Guy is freshly released out of serving three years in prison, and wrote his girl a letter before actually getting out. In that letter he accepts full responsibility for his sentence, and lets her know how sorry he is. He is riding home on a greyhound bus, and about to pass through his home town, where he and his girlfriend (or his wife—song didn’t make that clear!) lived, and wants to know if he is welcome back again or not. Apparently the town is a small one, with a highway running right through the town as a main street, and the bus will pass right by her house. In his letter to her, he said if she is still interested in starting over with him again, that she should tie a yellow ribbon around the base of an oak tree in front of the house as a signal that she still loves him—-but if he doesn’t see that yellow ribbon, then he just won’t bother to get off the bus—-he’ll take that as a sign, and blame himself. When the bus got into town and her house, everybody on the bus reacted—I guess his sad story was passed around to all the passengers—she not only ties just ONE ribbon around the tree, but she tied A HUNDRED ribbons around the tree!! In this case, I don’t think it took a memory of any personal experience to start the waterworks, just a good imagination! ",
            "date": "Answered February 3, 2017",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Tigerstar-1"
                }
            ]
        }
    ]
}