{
    "title": "Why can I only hear the background music and not the voice when I listen to music with my headphones, and how can I fix it? - Quora",
    "tags": [
        "Background Music",
        "Hearing Voices",
        "Hearing",
        "Voice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carl Garthwaite",
                "href": "/profile/Carl-Garthwaite"
            },
            "answer_text": "Assuming the headphones are good and plugged in correctly, I’m seeing at least one possibility for the cause… (A word of explanation first) When music is mixed and mastered, typically the vocals are dead center in the mix. If the music you cannot hear vocals in is a surround mix (5.0, 5.1, 7.1, etc.), chances are good the vocal (other than any reverb or delay effects applied to the vocal, or backing vocals) are only present in the front center speaker signal. So if you are listening to a portable device, be sure you are playing a stereo mix, not a surround sound mix. If you are plugging your headphones into a surround sound receiver, try finding a mode on the receiver which will output stereo rather than surround. If your source music IS already in stereo, it may be that one side of your headphones is wired in reverse and the sound is cancelling itself out, but that’s unlikely as you’d still hear it, but it would sound “odd”. ",
            "date": "Answered November 5, 2018",
            "views": "54",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Robson",
                    "user_href": "/profile/John-Robson-110"
                },
                {
                    "user_id": "Paula Arce",
                    "user_href": "/profile/Paula-Arce-6"
                },
                {
                    "user_id": "Robert Ehle",
                    "user_href": "/profile/Robert-Ehle"
                },
                {
                    "user_id": "Dakar'e Martinez",
                    "user_href": "/profile/Dakare-Martinez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Willow Lilly",
                "href": "/profile/Willow-Lilly-2"
            },
            "answer_text": "Poor wiring, in some part of the system of the headphones, can cause this. Make sure there’s no frayed wires, and everything is plugged in. To make sure, unplug and replug whatever you’ve got it plugged into. If you still hear it, get more specific about your system. If it’s an older stereo playback type of machine, that’s much more serious than just a pair of JVC buds in your iPhone. Go to The Ultimate Headphones Testfor a true frequency. There’s several, so use what you need in case things start going south, and remember to ground your cables. ",
            "date": "Answered August 1, 2020",
            "views": "736",
            "upvotes": "0"
        }
    ]
}