{
    "title": "Why is America handling the covid-19 so poorly? - Quora",
    "tags": [
        "COVID-19 in the USA",
        "COVID-19 (2019-2020)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jon Davis",
                "href": "/profile/Jon-Davis-10"
            },
            "answer_text": "No. We haven’t lost control. We gave up trying to control something we no longer fear.  I can still remember early March. There was that single weekend where the nation shut down in trembling fear. My wife and I went to our favorite restaurant to celebrate an anniversary. I told her to enjoy it, because we might not be back for some time. As news kept evolving, we became very afraid. The early projections were that we would have anywhere from 60% infection rates with 1–5% mortality, leaving as many as one to three million Americans dead. This was especially terrifying for my wife and I. We were due to have a baby soon. Jennie wouldn’t normally be at risk, but now… Watching the models at the time, and knowing that we live in a rural area centralized between Oklahoma City and Dallas, the fear I predicted was that the peak of the pandemic would strike us a few months later, right about now. This week, we will give birth to our second daughter. I lost sleep thinking about the terrible graphs where hospitals would be inundated with the sick and the dying. Selfishly, yet apologetically, I asked our doctor, “What do you think the odds are that they’ll cannibalize Labor and Delivery to accommodate them?”  That was our world in March. There were runs on basic necessities including toilet paper, flour, and guns. People hid. They hunkered down. They did what they were told by the President, CDC, and the media man, all saying that this was something we had to do. People locked themselves away, distanced from one another in the hope of bending the curve. That was the collective mission. “Bend the curve”. We had to bend the curve of exponential growth of new cases, so that we would have fewer hospitalizations, hospitals would not be overwhelmed, and fewer people would die. We had to not touch anything, not breathe around anyone, not go anywhere or do anything, and by oldest daughter had to learn to recite the mantra of Dune’s Fear is the Mind Killer; It is the little death” as a method for how to wash her hands. And we did. Before my first daughter was born, I wrote her a letter about the world when she entered it. That was 2016. For my second daughter, I intend to recount how it is a very patriotic time that we lived in 2020. You might not see it that way, but I do. Ours is a nation divided in many ways. An endless cycle of manufactured outrage has us constantly at everyone’s throat. But in March, we were all collectively afraid. A little bit of fear is good. It centers you. It pushes back against those things which are less important, and it brings people together. For that time, we were all afraid, and that was good. It’s funny how quickly you can distract those who really aren’t afraid of anything to move on to the next source of outrage, but this was something real that affected all of us equally. COVID-19, the Coronovirus, the Chinese Wuhan Virus, or as I like to call it, the Chinese Communist Party Virus of 2020, it didn’t matter so much what it was called because it mattered what it did. It was the great equalizer of mankind, and that was good. Even though we didn’t like each other, particularly in my country, we all did what was best for each other... because that is what was best for us. We locked ourselves away, we distanced, and we did nothing. Rather than yell scream and shout fruitlessly on social media about whatever we were told to be angry about in that three week cycle, we collective did something. We really did something together. All of us, whether we liked one another or not, whether we realized it or not, finally worked together to solve a problem which affected each and every one of us equally. And we did it for more than three weeks. We did what we needed to. We bent the curve to the point that infections were down. And with it, the deaths from Coronavirus were down. That gave our researchers time to understand the disease more. We developed new treatments and learned new tactics. We learned that certain drugs, deemed controversial to reckless months ago, actually do work extremely well in treating COVID-19 — assuming they’re administered by a doctor, though admittedly much less effective when self-administered through drinking fishbowl cleaner. We also learned that ventilators are not a great treatment, but flipping the patient over and breathing down, was. We learned how to move around while transmitting the virus less, further slowing the spread while going on back to our lives. But we got it down so far that we completely changed course on what we thought the goal was from only a month before. We started acting as if the goal was to get to a point where we wiped out the plague through sheer will to endure the isolation — to starve it out. That was never the goal. No one, back in March, was saying that should have been the goal. The social contract we all signed was to push back against the death and the dying by not overwhelming hospitals and giving researchers time to develop the kinds of treatment that mitigate death from COVID-19. They did that. Bless those miracle workers because they did that. American researchers, along with allies across the planet, pioneered and innovated solutions to the key problem affecting the world. That’s what the road to victory looked like. Slowing down the spread to the point that it died out wasn’t. We need to understand how much that matters, and how impossible that goal was. When we look to late April, we saw the curve bent, and broken. But what about everywhere else? As in, everywhere in the world that the virus could have been? It’s still raging. You can choose to focus on Europe, where the disease is dwindling, but Europe isn’t the center of the world. The 7-day daily average for deaths in the world are still going up as deaths are decreasing here in the United States and Europe. That tells us a lot of things about how successful we would be at stopping the disease flat.  Regions like Asia, South America, and Africa are getting worse. This is even when you factor that many of the countries we know nothing about because they are aren’t developed enough to provide the data we would need, or where the data is suspect, due to the nature of totalitarian regimes. And a very uncomfortable reality looms when you look to certain countries. There, you might find reported cases and death rates that make no sense against any plausible rational explanation.  I’m just going to say the quiet part out loud. China is lying. The world’s most populous country did not go from the source of a global pandemic, to having it mostly under control, then with a bizarre spike in deaths, only to be down to 0 days later and almost none since. For that matter, here in the United States, we also need to grapple with the fact that new outbreak cases are spiking along the Mexican border. That suggests that the disease is far more rampant in Mexico than what they have reported.  There is mounting evidence also that most other nations seem to be under reporting to ease resistance and calm panic, while the US is likely suffering problems of over reporting cases and deaths related to COVID-19, in part, for health care facilities to gain additional funding, in part, due to faulty testing methods both here and abroad[1], and in part for partisan nonsense. That being the case, if we were trying to wipe out the disease simply through social distancing policy here in the United States, we can’t forget America doesn’t exist in a vacuum. We would have needed to rely on many other places also following this exact strategy which many aren’t, can’t, and won’t.  This is why we could never have cleansed ourselves of the disease through simple social distancing. Too many places in the world aren’t capable of fulfilling that strategy, and many who say they are… are lying. They were always going to be centers where the disease would incubate and reemerge. Locking down the world forever until the virus was wiped out was never realistic. But we did what we all agreed to do. We reduced the number of deaths by buying time where the researchers could produce effective treatments. They continue to produce more and more effective treatments by the day. We did it and people realized that most of our worst fears were nowhere near what we believed them to be. That’s great news. We should be excited about that. But then… politics. It became a political battle because another very good argument started to gain traction. As we discovered that this virus wasn’t as deadly as we first thought, we had to re-evaluate the cost of the cure.  Immediately following the lockdown, tens of thousands of businesses closed their doors, many for the last time. With it meant that millions of people would be furloughed, or simply lose the jobs and income they relied on. We had a single month increase in unemployment that was impossible to compare to any other month in all of US history. The consequences of such a radical shift would be devastating.  This is not to mention the effect on stock markets, where millions of people lost trillions of dollars. This was mostly the wealth of average people, their savings and what they planned to rely on for retirement. We had erased the gains of the economy that took years to rebuild. It saw day after day of record breaking losses. This wasn’t because of some structural failure in the economy. This wasn’t the market adjusting to systemic problems. It wasn’t like 2008’s banking crisis. It wasn’t like the start of the Great Depression. The collapse was due purely to uncertainty and government policy. Of course, if you brought that that up you “cared more about money than lives.” People who voiced anything along the lines of questioning the severity of the imposed lockdown, you were shamed. Brutally shamed. However, the social unrest two months later was an expressed concern many voiced openly before they happened, due to understanding the nature of such monumental collapses of millions of people’s sources of income and employment. It’s simply not good for people to sit around with nothing to do and no income. They have time to get angry and that anger has ways of doing things that don’t honestly make a lot of sense. We need to look at things very honestly. How did we get from one man’s brutal death at the hands of a white police officer (and two POC police officers, there as well) evolve over the course of five weeks to include calls to demonize and abolish the institution of the police across the US, mobs burning and looting cities across America, and other mobs forming to rip down statues; not just of Confederate Generals, but of Washington, Jefferson, and to even place the future of Mt. Rushmore in question? A rational person could not reasonably draw a line from defending the existence of Mt. Rushmore to the death of George Floyd. The lockdowns were a part of that chaos.  While no one could have expected things to snowball as quickly as they did, people were saying that the lockdown had costs, and if the virus wasn’t as deadly as we believed, then the cure was now demonstrably more dangerous than the disease. Then we started to open up. In phases, we started opening up. First some businesses, then others. Businesses had to follow new guidelines, and some organizations deemed “non-essential” had to fight for their rights to to be included, as well. But we started opening back up, and the economy reflected this. What shows today was pulled from MarketWatch and shows the last six months of boom/bust/recovery of the economy. Following a fairly steady V-shaped curve, the economy is today, breaking records for the highest point it has ever been.  No one is talking about that. In part I freely speculate, because there were voices calling for a depression in hopes of it affecting the next Presidential election. If we have a failed economy, the thoughts were Trump’s presidency would be blamed. Well, after suffering the worst economic downturn in history… we’re back to breaking records on the good end and no one is talking about that. Perhaps they should. If it was going to be blamed on Trump if the economy did poorly, but now that the economy is doing well again… No, but the virus has become politicized ever since. Texas began opening back up May 1st. And as we saw, that did not involved any increase in COVID for many weeks. While much has been said of the increase in Red States vs Blue states, many blue cities are in red states — Dallas, Houston, and San Antonio, are all very blue districts in Texas, for example. But looking to county partisanship tells a very different story about the rise in COVID 19 than the popular narrative of red cities. As you can see, the rise didn’t begin a few weeks after the states opened up at the beginning of May, but about six weeks later. This is not to ignore the fact that while the blue areas saw astronomical gains in the beginning, the narrative of red states now responsible fails because the red and blue counties are also on a near identical trajectory.  We also have some data that points to one important question of who exactly is getting the virus. Minnesota did well in asking a very important question early on of age, and that answer is also very revealing. Even as we’re seeing an increase in cases, all the age groups getting sick aren’t getting sick at the same rate. One particular group is getting sick far, far more often than anyone else. 20–29 year olds, and again, this isn’t happening only after the states started to open back up, but weeks and weeks after they should have if opening up were the cause.  So what were mostly 20 year olds doing a few weeks prior to the spike? Gathering by the tens of thousands to protest.  Yes, the spike in cases didn’t actually come when people said it would simply by the country opening up. It would have happened much sooner if it had. But three weeks after the start of the George Floyd protests and we very uncoincidentally see the rise in COVID cases among exactly the group we’re mostly like to see there. But what was really the death of the public’s compliance was that this blatantly disastrous behavior wasn’t called out. Businesses had to be limited in how many people they serve. Churches were banned from opening, and if they were forced to open, then they couldn’t sing. Family gatherings were limited to only a handful of people. And gathering in large numbers to protest opening up the economy? That would lead to disaster. No groups larger than 8 people. But the protests where tens of thousands gathered to protest social justice? Perfectly fine. No possible way you’ll get sick there. So that we’re clear — getting a haircut and singing a hymn in Church is evil; screaming in protest is virtuous.  This was the moment that the lockdown ended. No one was going to go on living a life of lockdown when such blatant hypocrisy was practiced by the people who shamed, and continue to shame, them for not wearing a mask. The protests are clearly why we have this spike today. The people who were following the rules were fed up. They followed the rules while we locked down. They followed the rules when they had to be denied services that they relied on. They followed the rules as many lost their jobs, and they followed the rules as many others lost their income. They even followed the rules when the CDC said that protesting the lockdowns would spread the virus. We were through the worst things, but they kept pushing for more rights taken away from the people who were following the rules. But then other protests started up again. We knew the rules. You’re not supposed to do that. But this was against cops, and for social justice, and saying that there were all these systemic problems, and there was hatred and evil and bigotry still at the heart of every American for things that happened long ago. It doesn’t matter. A gathering of many people is a bad thing to do because of the plague. But when those protests happened we all saw that the rules were only rules if you were angry about the right things. When major health organizations gave a free pass to protesters clearly doing the the worst things possible at the time when, even by their own standards they outlined only weeks before, that was a pivot point. The people who followed the rules realized that they didn’t have to anymore. The protesters decided that for us. People were done following rules that were only rules for them.  The final straw, though, was something that should have been celebrated. Even as the cases increased, the deaths were going down.  That’s what winning looks like. It doesn’t look like every possible good metric going down, or like a magic wand transforming all the bad numbers to zero. It looks like something that we were never able to control, no longer being as scary as it once was. We will likely have more outrbreaks, but the death rate doesn’t seem to be going up. That’s a very good thing and we should celebrate it. But we aren’t. We’re looking at this as a failure, but it isn’t. While there really is no “winning”, this is the best we could hope for — the knowledge that we don’t have to kill our way of life just to prevent some us from dying. That last part matters. A lot of people look to the high number of cases we in the United States suffered as evidence of things it wasn’t, such as the failure of our president. A more thorough reading demonstrates a great deal more nuance than that. We can’t forget a few things, such as to ignore the fact that for the first two months when the country should have been collectively preparing, we were all engaged in another piece of partisan nonsense.  People only really started talking about the outbreaks when it became convenient to shift away from the collective efforts of so many to effectively carry out this coup. Likewise, when early action was taken to shutdown our communication with China in January, that was called racist and was fought. But most of all, the President’s inability to stop the virus with a wave of his hand, demonstrated the difficulty of a single authoritarian to do much in the United States. We are a nation of fifty mostly autonomous units, ruled by local leaders. That’s a good thing because most problems aren’t plague related. We haven’t had the kinds of conversations about States Rights we’re having since perhaps Roe v Wade. If a few of those leaders fail horrendously, such as the completely failed policies of New York state under Governor Cuomo, it affects and reflects on the rest of the nation. When New York state still accounts for highest fatality rates of almost anywhere in the world, it’s not right to chastise the rest of the country for that, nor for him to be lionized for being the single most important point of failure into why the disease became so rampant in our country in the first place. That is to say, the only way that Trump could have done what people say he should be able to do is if he was actually the kind of dictator everyone lamented he’d surely be. He isn’t and can’t be, which is why some states seriously failed the rest of us. It’s good that we didn’t lose that. It’s good that we didn’t suffer so much to fear that we gave up a great deal of essential liberty that we can’t get back. A lot of the restrictions, they’ve been difficult, and many unwise. For many others, it would be better if we would just wear the masks. But we got through this without sacrificing too much of who we are as a nation. We should be happier about that. In a seemingly unrelated event, a few days ago was July the 4th, our nation’s Independence Day. California recently issued a series of mandates banning gathering to celebrate the 4th of July. California also has many laws on the books banning certain kinds of fireworks. As an Oklahoman, we call those banned fireworks by the legal term “the good ones”. Because of those laws, illegal fireworks trade has become commonplace over the last few years, and an ironic tradition has grown around their use. In open defiance of the law, people set off these fireworks by the thousands in cities like Las Angeles. But when they banned the celebration of July 4th all together, it seems that the people of LA revolted in the most American way possible. Thousands of people defied what they viewed as unjust and unnecessary laws, to fire illegal fireworks in the most brazen way humanly possible. Bombs burst across the city, lighting up the skyline in defiance of laws Americans decided shouldn’t be laws. It was loudly decrying the will of the governed, and it was probably the most American thing ever. California. Who’d have thought?  There are things within our control and there are things that aren’t. COVID-19 was never something we or anyone else could have ever controlled. It was hubris to assume we had that power. But we solved the most dangerous problems about it through focus and working together. We mitigated them to the point that we, thinking and rational people, could focus on bigger problems, such as an economic crisis caused by our then rational response to something that should have been taken very seriously. That’s where we are now. We’re letting go of trying to control something that never could be contained, and instead looking to other problems that still need to be solved. And you still think people should just lock down for the betterment of everyone, fine. But remember, no one will ever follow rules if the rules only apply to them.  Relaxed. Researched. Respectful. - War Elephant Footnotes[1] Why we're overestimating the mortality rate for COVID-19",
            "date": "Answered July 7, 2020",
            "views": "243",
            "upvotes": " View 741 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ralston Heath",
                    "user_href": "/profile/Ralston-Heath"
                },
                {
                    "user_id": "Aaron Dekker",
                    "user_href": "/profile/Aaron-Dekker-4"
                },
                {
                    "user_id": "Arthur Albin",
                    "user_href": "/profile/Arthur-Albin-1"
                },
                {
                    "user_id": "Tiger Girl",
                    "user_href": "/profile/Tiger-Girl-8"
                },
                {
                    "user_id": "Amrit Janardhanan",
                    "user_href": "/profile/Amrit-Janardhanan-1"
                },
                {
                    "user_id": "David Staller",
                    "user_href": "/profile/David-Staller-1"
                },
                {
                    "user_id": "Bowen Horne",
                    "user_href": "/profile/Bowen-Horne"
                },
                {
                    "user_id": "Olivia Masterson",
                    "user_href": "/profile/Olivia-Masterson-7"
                },
                {
                    "user_id": "Lucas Lu",
                    "user_href": "/profile/Lucas-Lu-17"
                },
                {
                    "user_id": "Elijah Krause",
                    "user_href": "/profile/Elijah-Krause"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven Haddock",
                "href": "/profile/Steven-Haddock"
            },
            "answer_text": "In order to beat the coronavirus and get case numbers down, there are a few things you have to do: The virus spreads fastest in enclosed places where people are together for a long time. Those places have to be closed down.Anyone who has the virus, or has been recently exposed to it, can spread the virus even if they’re not showing symptoms. Those people have to stay in one place and not go anywhere.The only clearly effective way to prevent the spread of the virus between individuals, apart from physical separation, is to wear a mask. The virus can spread between people with masks on, but it’s a much less likely proposition. Moreover, a person with a mask is much more likely than a person without a mask to get the disease than the other way around - a mask protects other people more than it protects you.In response to the breakout of the virus in China: The government banned large gatherings entirely. Those who defied the ban had their property seized.Wuhan, where the virus was at its worst, was isolated from the rest of the country - no travelling in or out. Anyone who tested positive, and anyone who was living with them, was sent to a hotel and was not allowed to leave. There was no charge and volunteers helped prepare and distribute food.Masks were distributed and their use was encouraged.Result - 83,000 cases and 4,600 deaths. On July 10, China recorded four new cases, usually people travelling to the country from abroad. By contrast, the United States did everything wrong: People are allowed to travel throughout the country. A cluster of cases in Athens, Georgia was traced to a single person from Atlanta who attended a funeral there. Although theaters and arenas were closed quickly, churches were allowed to remain open, and the majority of infection clusters have been found there. That’s resulted in a disproportionately high death rate among preachers.The United States has no system in place to easily test people who may have been exposed, and when a person tests positive they are often not required to self-isolate. One death was attributed to a dinner party where a person who had tested positive but wasn’t showing symptoms went to the party anyway. It’s difficult for the United States to trace the source of an infection and little effort has been made to find people who may be been exposed at the same time.Mask use has largely not been made mandatory and, when it has, law enforcement officials are refusing to enforce the requirement. There are constantly situations where people have refused to wear masks where they are required, such as when shopping or at a medical clinic.Instead Politicians are pushing for the re-opening of places where the virus is likely to spread, such as workplaces and malls.Politicians are not correcting misconceptions about the virus when they arise, meaning many people aren’t getting tested, and are going out when they may be infected.Politicians are openly supporting people who refuse to wear masks in public, and are often seen without masks themselves, even when masks would be mandatory even without the coronavirus Like the Mayo Clinic  Or a plant where they make sterile personal protective equipment ",
            "date": "Updated August 14, 2020",
            "views": "733",
            "upvotes": " View 855 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Daniel Chen",
                    "user_href": "/profile/Daniel-Chen-439"
                },
                {
                    "user_id": "Whiterose Yan",
                    "user_href": "/profile/Whiterose-Yan"
                },
                {
                    "user_id": "Hien Vu",
                    "user_href": "/profile/Hien-Vu-31"
                },
                {
                    "user_id": "Iresh Dilan",
                    "user_href": "/profile/Iresh-Dilan"
                },
                {
                    "user_id": "Nick Sweet",
                    "user_href": "/profile/Nick-Sweet-7"
                },
                {
                    "user_id": "Wayne Graeve",
                    "user_href": "/profile/Wayne-Graeve"
                },
                {
                    "user_id": "Catharina Forbes-Boeren",
                    "user_href": "/profile/Catharina-Forbes-Boeren"
                },
                {
                    "user_id": "Bob Cancelliere",
                    "user_href": "/profile/Bob-Cancelliere"
                },
                {
                    "user_id": "Bryan Baker",
                    "user_href": "/profile/Bryan-Baker-31"
                },
                {
                    "user_id": "Rosemary Sullivan",
                    "user_href": "/profile/Rosemary-Sullivan-17"
                }
            ]
        }
    ]
}