{
    "title": "Why do record companies have to own the artist’s master recordings? - Quora",
    "tags": [
        "Record Labels",
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Val Del Prete",
                "href": "/profile/Val-Del-Prete"
            },
            "answer_text": "There are two copyrights involved when a song is recorded and released to the public: the copyright in the music (lyrics, melodies, chords, even before it is recorded) and the copyright in the “sound” (the copyright in the particular recorded version of the song, or “master rights”). Both copyrights are protected by copyright law and both copyrights generate royalties. This distinction is subtle, but extremely important to understand how royalties generate money and who is entitled to what.For example: “I will always love you” was written by Dolly Parton in 1973. As a writer, she owns the copyright in the music. This means that, as a writer, she will make money out of any version of the song that is released, including the version sung by her as an artist, no matter how many times the song is released and by how many labels. In fact she was also paid as a writer for the version recorded by Whitney Houston, which sent the song into global superstardom. However, although a song has one unique copyright associated to the music, different releases of the song have distinct “master rights” - because they are technically different recordings of the same song, released by different labels. Each label generally owns the master rights to the particular version of the song that they release and will make money from those rights every time this version is exploited commercially. This is “the theory”. But in practice, and especially nowadays, the ownership of such rights is negotiated between writers, producers, artists and record labels. The music industry is an extremely competitive money driven game where rights ownership is partially negotiable on a song by song basis, and the ability to negotiate (or have your manager negotiate) the best share of the rights in a song is extremely relevant to your career as an artist or as a writer, not matter how talented you are in your “art”. For example most superstars end up launching their own record label (or a joint venture with their original record label), so that they own a significant portion of the master rights of their songs and can make more money from them.Clearly, the bigger the share of master rights (as well as songwriting rights) you own, the more money you will make when the song is used. Rights owners are paid each and every time the song is downloaded, streamed, sold on CD, synchronized to other media (movies, TV programs), played live etc. For a very big hit on the charts, even a 2% difference in the share you own of the rights, can have a very significant impact on the amount of royalties you will get. ",
            "date": "Answered June 19, 2019",
            "views": "13",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "J Norton",
                    "user_href": "/profile/J-Norton-7"
                },
                {
                    "user_id": "Nelson Vidinha",
                    "user_href": "/profile/Nelson-Vidinha"
                },
                {
                    "user_id": "Ralph Huisman",
                    "user_href": "/profile/Ralph-Huisman-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gael MacGregor",
                "href": "/profile/Gael-MacGregor"
            },
            "answer_text": "Besides the obvious — that whoever owns the greatest interest in the recording (master) is going to reap the greatest monetary benefits… Every use of the master for film, TV, advertising, and video games needs to be licensed and paid for by the entity wanting to use it. Such licenses are actually in two parts: The Synchronization License — this covers the use of the actual composition/song, and is issued by the publisher. It can be just an actor singing it on screen, or — if the production wants a specific recording of the song, then they also need… The Master Use License — this is the license that allows the production to use a particular recording of the song. This means new revenue for everyone with a piece of the pie. Then there’s the compulsory Mechanical License — this is when you want to record someone else’s song and sell your recording of it. It is, like the synchronization license, granted by the publisher (or publisher’s representative), and requires payment up front of the fees. These are computed based on the number of units/downloads you plan to press/sell times the current statutory rate. Once you’ve secured the mechanical rights, then you have the right to sell or license your master as you see fit. The publisher still would be issuing their own license for the song, but you would reap the benefits is your master is used instead of the famous one that would cost much more. So whoever owns the various rights is who gets paid. ",
            "date": "Answered May 30, 2019",
            "views": "579",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nelson Vidinha",
                    "user_href": "/profile/Nelson-Vidinha"
                },
                {
                    "user_id": "Stephen Wildman",
                    "user_href": "/profile/Stephen-Wildman-1"
                },
                {
                    "user_id": "Bart Reardon",
                    "user_href": "/profile/Bart-Reardon"
                }
            ]
        }
    ]
}