{
    "title": "Why don't TV shows have theme songs any more? - Quora",
    "tags": [
        "TV Theme Songs",
        "Theme Music",
        "Television",
        "Television Series"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bill Dawson",
                "href": "/profile/Bill-Dawson"
            },
            "answer_text": "I've worked in television for 25+ years as a graphic designer and animator. I worked for and ran businesses in the 90s that created Emmy award winning \"main-title design.\" Designers I worked with created opens for ER and Friends, among many others.  Some time around the mid 90s \"audience retention\" became a buzzword and a huge concern. TV networks became convinced that opening titles gave the audience time to tune out before a show began. The idea was to jump right into the next show as quickly as possible. It was the death knell for both opening title sequences and theme songs. The last theme song I can recall from that era was \"The Fresh Prince of Bel Air.\" Yes, there have been theme songs since like the one I accidentally heard begin an episode of The Big Bang Theory- but I cannot stomach that show, so I don't think it counts. It's a shame, because I think TV shows are missing a key component that made them memorable. Like it or not, The Love Boat theme was memorable and a part of that show's icky charm. The same goes for Welcome Back Kotter, WKRP in Cincinnati, The Brady Bunch, Gilligan's Island (both versions), Green Acres and, of course, The Beverly Hillbillies. Y'all come back now, y'hear? ",
            "date": "Answered May 17, 2012",
            "views": "36",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ben Frashure",
                    "user_href": "/profile/Ben-Frashure"
                },
                {
                    "user_id": "Andy Trump",
                    "user_href": "/profile/Andy-Trump-1"
                },
                {
                    "user_id": "Christine Infanger",
                    "user_href": "/profile/Christine-Infanger"
                },
                {
                    "user_id": "John Coy",
                    "user_href": "/profile/John-Coy"
                },
                {
                    "user_id": "Scott McFadden",
                    "user_href": "/profile/Scott-McFadden-4"
                },
                {
                    "user_id": "Blaise Bell",
                    "user_href": "/profile/Blaise-Bell-1"
                },
                {
                    "user_id": "Tracy Murray",
                    "user_href": "/profile/Tracy-Murray-10"
                },
                {
                    "user_id": "David Zarrick",
                    "user_href": "/profile/David-Zarrick"
                },
                {
                    "user_id": "Gordon Schultz",
                    "user_href": "/profile/Gordon-Schultz"
                },
                {
                    "user_id": "Gary Phillips",
                    "user_href": "/profile/Gary-Phillips-203"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Roemmele",
                "href": "/profile/Brian-Roemmele"
            },
            "answer_text": "There are a few reasons. 1) Theme songs are not seen as cool anymore and become dated very quickly.  Schlock is the word new producers use when they are asked.  The Love Boat theme is the example that is often cited. 2) Aaron Spelling's influence.  Aaron controlled most of the top producing shows from 1970s thru the late 1980s, the golden age of theme songs judged by pure quantity.  He was a lover of theme music and also track music used during the shows .  He worked almost exclusively with Charles Fox.  Yes, Charles wrote the Love Boat theme.  He also wrote the Happy Days theme song as well as hundred of others.  Shows not directly controlled by Aaron wanted to follow his successful formula. 3) Modern shows want to be seen as real and prefer the songs from little known or well know artists to be on the show. And to be used as tracking music.  There is also profits to be made when a show promotes an unknown artist. 4) Title sequences have been slimed down by 60% since the 1970s. So there it little time to register a clear theme song. ",
            "date": "Answered February 2, 2011",
            "views": "26",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andy Trump",
                    "user_href": "/profile/Andy-Trump-1"
                },
                {
                    "user_id": "Tracy Murray",
                    "user_href": "/profile/Tracy-Murray-10"
                },
                {
                    "user_id": "Bill McDonald",
                    "user_href": "/profile/Bill-McDonald"
                },
                {
                    "user_id": "Darrell Blank",
                    "user_href": "/profile/Darrell-Blank"
                },
                {
                    "user_id": "Mark Rogowsky",
                    "user_href": "/profile/Mark-Rogowsky"
                },
                {
                    "user_id": "Janine Murray",
                    "user_href": "/profile/Janine-Murray"
                },
                {
                    "user_id": "Pete Mauro",
                    "user_href": "/profile/Pete-Mauro"
                },
                {
                    "user_id": "Hiawatha Bray",
                    "user_href": "/profile/Hiawatha-Bray"
                },
                {
                    "user_id": "Pamela D'Luhy",
                    "user_href": "/profile/Pamela-DLuhy"
                }
            ]
        }
    ]
}