{
    "title": "Why isn't classical music very widely appreciated anymore? - Quora",
    "tags": [
        "Classical Composers",
        "Contemporary Classical Music",
        "Composers",
        "Classical Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Emma Steven",
                "href": "/profile/Emma-Steven-14"
            },
            "answer_text": "I'm one of the very, very few people in the world that feels this way I guess, but I actually do NOT like classical music, for a lot of reasons. Let me start this off by clarifying though that I am basing my opinions only off of the music I have heard and the people in my town associated with classical music that I've met. Firstly, the culture behind it reflects intellectualism and professionalism. The fans of classical music always seem to act like they have a greater brain than anyone who doesn't like classical music. The musicians who perform classical music think they are better than any other musicians. Classical musicians that I've met have especially been blind to any forms of popular music, and usually, dismiss all of it. I've been accused of blasting classical music too easily before giving it a chance, but I would argue that a majority of classical musicians would blast great popular music too easily before giving it a chance. All genres of music have a few good things and a few bad things, but it is all up to personal taste, understanding, and patience. The biggest reason here would probably be because there is an unspoken battle between classical musicians and popular musicians, where classical musicians just look down on them as trash. I dislike classical music because I feel that my personal taste for more popular music has made more and more classical musicians dislike me, and I have gained a more defensive approach to classical music for this reason.I like quite a few of the famous classical melodies, like Beethoven's 5th, 9th, Mozart's Requiem, The Planets, etc. but in terms of ALL classical music, a lot of it seems to be small, off-the-road pieces like Saxophone or Trumpet sonatas, unaccompanied solos, etc. These pieces sound, to me, like they were composed for the sake of showing off a soloist's skill and aren't meant to be listened to for pleasure but for knowledge. Call me \"stupid,\" but I don't hear NEARLY as much emotion in Paul Creston's Saxophone Sonata as I do in something like \"Shine on you Crazy Diamond\" by Pink Floyd, or the guitar solo Jimi Hendrix performed in \"Machine Gun,\" or the song \"Neighborhood #1\" by Arcade Fire. I feel like classical music puts a greater emphasis on notes and the analyzing of notes than popular music does, but popular music puts a greater emphasis on art and emotion than classical music does. To me, it's the difference between a mathematical proof and the painting \"The Scream.\" Popular music stimulates greater thoughts in me about life, emotion, the world, and everything really. That's not to say that classical music has no emotion. Moonlight Sonata, Chopin's Piano Ballades, the third movement of \"Symphonic Metamorphosis\" by Hindemith. There are dozens and dozens of classical pieces I really like, so I'm not entirely one-sided here.All of the unwritten rules about dress code, when and when not to clap... it's all too much. (\"It's referred to as a 'Piece.' NOT a 'song!'\") Music should not be a fashion statement. Music should not be a study in etiquette. Music should be a personal, artistic and emotional statement from the heart. It should feel personal, not impersonal. It should not be a requirement to memorize a composer's life dates to be a real fan of his/her music. It should not be a requirement to wear a tuxedo if you are performing the music you love. Classical musicians speak of music being a language, and if this is true, what message are they trying to communicate? Would you rather talk to the businessman in the expensive suit leaving the office, or the homeless person on the street begging him for money? Who would have more to say? Who would understand more about life and hardships?A lot of it does go on too long... It's easy to point fingers and call people names like \"impatient,\" but we've all heard those pieces that have 12 different endings. There is just not enough change in an hour-long piece to keep me emotionally invested in the sound. Compared to popular music, take a song like Pink Floyd's \"Echoes\" or Sigur Ros' \"Varuo\" These songs have a clear crescendo and end when the crescendo does, instead of classical pieces that have 40 crescendos throughout the piece. There is a lot of ups and downs in a classical song which makes it more like a roller coaster, compared to pop music being like going skydiving.It's harder to find classical music that \"thinks outside the box.\" What I mean by that is that the most revolutionary classical pieces still sound... well, classical. In popular music, you have musicians like Jimi Hendrix that completely redefined genres and sounds. \"But Jimi Hendrix sounds like loud guitar rock music, and we've all heard that. It's a cliche.\" Yes, but before Hendrix, that sound didn't exist at all, and he willed it into creation using the latest technology, and multiple genre influences. Perhaps one of the most groundbreaking classical pieces was \"The Rite of Spring,\" and, to my ears, I can instantly pinpoint that it is a classical piece within the first minute or two. People living in the year 1967 who was listening to Jimi Hendrix for the first time had never heard anything quite like that sound before, and weren't sure what to categorize it as, other than \"Jimi Hendrix.\" The best musicians to me are the ones who defy genres and create their own sound.Most people would say that popular music has taken a lot from classical music and that without classical music, popular music wouldn't exist. This is true, however, the part of the equation that is being left out here is that music EVOLVED. Classical music was the first music to use certain chord progressions, and anyone who used the same chord progressions after was \"obviously copying from the original,\" right? Wrong. Music evolved through musicians and composers who took these concepts, expanded them, and made them their own. Then the next generation took what the previous generation had done, and added to that too. Music has evolved more and more, especially as technology has come around, and I think it is unfair to say dismiss modern music as theft from older forms of music while ignoring the bits and pieces that have been added from each generation. The evolution of music has happened, is happening, and will always happen, and to be dismissive enough that one ignores all music after a certain era seems very blind to me. A perfect musician would be able to find inspiration in any piece of music regardless of era.I can keep going and keep listing reasons, but in the end, those that like classical music are pretty dismissive of those who don't. I fear many of my points here will be blasted and criticized without much thought being given to the points I'm trying to make. This post is getting long now, so I shall end it here. I welcome any helpful criticism that doesn't resort to name-calling or trying to point out logical inconsistencies in my post. I am not a professional at the debate, and do not wish to engage in the normal internet-type of debating here. I do wish to gain a greater appreciation of classical music, but I've heard and played many hundreds upon hundreds of hours of classical music, and the more I hear, the more I dislike it. ",
            "date": "Answered September 10, 2019",
            "views": "3",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jordan Becht",
                    "user_href": "/profile/Jordan-Becht"
                },
                {
                    "user_id": "Rohan Mitra",
                    "user_href": "/profile/Rohan-Mitra-45"
                },
                {
                    "user_id": "Lachlan Croll",
                    "user_href": "/profile/Lachlan-Croll-1"
                },
                {
                    "user_id": "Ngọc Trương",
                    "user_href": "/profile/Ngọc-Trương-23"
                },
                {
                    "user_id": "Heerack Ganguly",
                    "user_href": "/profile/Heerack-Ganguly"
                },
                {
                    "user_id": "Josh Bloomer",
                    "user_href": "/profile/Josh-Bloomer-1"
                },
                {
                    "user_id": "Jasper A. Tugók",
                    "user_href": "/profile/Jasper-A-Tugók"
                },
                {
                    "user_id": "Elias Gutenbrunner",
                    "user_href": "/profile/Elias-Gutenbrunner"
                },
                {
                    "user_id": "Andreas Panagiotopoulos",
                    "user_href": "/profile/Andreas-Panagiotopoulos-4"
                },
                {
                    "user_id": "Avry Tan",
                    "user_href": "/profile/Avry-Tan"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Leigh",
                "href": "/profile/David-Leigh-1"
            },
            "answer_text": "Unlike the other answers here, I don't disagree with the premise of the question; Americans just don't listen to classical music anymore. But say you wanted to get someone into baseball, and say you tried to do that by explaining the role baseball played in decreasingly-agrarian communities in the early 20th century, you’d probably have a similar lack of success. The sociopolitical moment in time is an interesting context for baseball, but if you don’t yet understand how baseball is played, it’s not going to help you sit still and enjoy a whole baseball game. In a way, this is how we do music advocacy—if you go to an outreach presentation, there will be a scholar speaking to a group of potential opera fans, usually very young ones or very old ones. The scholar, in an attempt to make the opera seem manageable to the audience, will go into detail on the plot, the historical context, maybe will bring in geopolitical history from the time of composition, etc. All stuff that's genuinely interesting. But for me, rule #1 of music advocacy needs to be not to try to convince your audience to like this music for any reason other than the reason that you, yourself, like it. By contrast, literally everyone I've ever given a voice lesson to understands and appreciates opera, even if they don’t go regularly. Why? Because they understand what's actually happening on the stage, not just the context for it. Right now the Metropolitan Opera has an ad campaign that’s finally trying to get back to this fundamental level of appreciation for opera: “THE VOICE MUST BE HEARD,” which I think pushes back well against the existing paradigm, and it seems like they’re having success with it so far.  Meanwhile, I’m struck by the complaint that most of the public has about contemporary art, and how ironic it is in the face of the complaint that most of the public has about contemporary classical music. People go to a museum or a gallery show and they see a painting that looks like it was easy to make, or a found object installation, and they say something like “is this art? But I could make that myself!” What they find frustrating here is that they don’t feel like they’re seeing the work of a true expert on display in that gallery (N.B. they are, but that’s not the point here). What they’d prefer to see is a return to the incredibly ornate, skill-heavy work of previous centuries, in which people apprenticed for years to achieve technical mastery. Ironically, in classical music, people get frustrated by the exact opposite. Sure they’d rather hear a Beethoven symphony than a Cage piece, but the Beethoven feels effete, needlessly complex, and “not fun” in comparison to a song by The Beatles. The Beethoven is like a piece of Baroque art, with all of the incredible complexity and brilliance of that, but the public doesn’t value that particular skill in music in the same way, largely because they haven’t been educated to understand it. Also, a lot of classical music performances are genuinely boring, even to professionals. This is because the tolerance for failure has gotten very low. In opera, for instance, there was a singer a little over 50 years ago named Mario del Monaco, who was very famous.  If you believe the stories, in about 50% of his public performances his voice would crack at least once, but the rest of the time, the voice was glorious. The question I find myself asking a lot these days is whether this man would have been a famous opera singer today. He was attractive, charismatic, and sang brilliantly, but would a modern-day opera audience have a high enough tolerance for failure to watch this guy crack all over the place, in exchange for seeing something exciting and beautiful? If you’re not willing to see an artist fail, you’re going to get a lot of safe art, and that’s what we’ve done in this country. Lastly, and maybe most importantly, we’ve created an anticompetitive atmosphere in professional classical music. At this point, basically every major city in America has a symphony orchestra and an opera company, but pretty much only one major one. So what this means is that the public can really only express strong opinions on which artists they want to see by literally flying to another city. For someone like Jonas Kaufmann, this happens—when he has been booked at the Met, people fly in from all over the country to see him (which has made it even more frustrating on the frequent occasions when he’s cancelled performances). But there’s really no other artist that I can think of that people are willing to fly to another city to see, which means that the stars are chosen not by the people who pay to hear them, but by arts administrators. Often, the administrators are good at their jobs, but no matter how good you are at picking, you’re unlikely to be perfect. So what we end up with is passive drift, and classical music moves slowly away from what the public wants to hear. The sad contrast is that I wish you all could hear what my rehearsals are like. It’s the most incredible thing, watching a group of world-class artists working with a world-class conductor—the atmosphere is so intense and focused, and the music is really central in a way that it rarely is in performance. More than anything, we need to move music performances into that rehearsal place if we really want audiences to understand what makes it great. ",
            "date": "Answered October 2, 2016",
            "views": "57",
            "upvotes": " View 72 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Allison Riccardi",
                    "user_href": "/profile/Allison-Riccardi-2"
                },
                {
                    "user_id": "John Bryan Querioz",
                    "user_href": "/profile/John-Bryan-Querioz"
                },
                {
                    "user_id": "Landen Marcroft",
                    "user_href": "/profile/Landen-Marcroft-1"
                },
                {
                    "user_id": "Alex Smith",
                    "user_href": "/profile/Alex-Smith-4374"
                },
                {
                    "user_id": "Ana Ivkov",
                    "user_href": "/profile/Ana-Ivkov"
                },
                {
                    "user_id": "Vy Phan",
                    "user_href": "/profile/Vy-Phan-17"
                },
                {
                    "user_id": "Khang Do Ba",
                    "user_href": "/profile/Khang-Do-Ba"
                },
                {
                    "user_id": "Jessica Finch",
                    "user_href": "/profile/Jessica-Finch-41"
                },
                {
                    "user_id": "Harry Barnes",
                    "user_href": "/profile/Harry-Barnes-47"
                },
                {
                    "user_id": "Justin Han",
                    "user_href": "/profile/Justin-Han-101"
                }
            ]
        }
    ]
}