{
    "title": "Why is Honey Singh so famous? - Quora",
    "tags": [
        "Why Is X So Popular?",
        "Indian Singers and Musicians",
        "Yo Yo Honey Singh"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dipam Goswami",
                "href": "/profile/Dipam-Goswami-1"
            },
            "answer_text": "It was probably 2012–2013 ..when I heard the song named “Brown Rang” by honey Singh …this was something very new and fresh. This was the first song when I knew that this is rap genre. Although Bohemia and other good artists were there …but honey had a new stuff . His songs were very relative to our stories ,so we could easily connect us to what he was saying. This is one the main reasons of honey's success. But after sometime I heard Bohemia …and his raps are insane. Though he is not as famous as honey Singh ..his raps were about his struggle and story . The reason for Bohemia not being famous that he don't like to be in the media as he said in one of his songs..….and this is the reason of honeys success. But those who love real rap doesn't like honey…because his raps are mostly party numbers and include abusive languages. Some rappers (Sikander khalon ) don't even consider honey as a rapper ,they say honey is a music producer…and this is something I also agree. Songs like brown rang, dope sop , blue eyes,Manali trance are not even completely written by honey singh . Brown rang is written by the famous rapper Badshah, dope sole is written by raftaar and he is in the video of dope dope for some seconds. Manali trance and blue eyes are the consequences of golu's skill of writing . So, We can say that honey apparently stole the limelight and fame ,badshah or raftaar deserved. The famous song “get up Jawani” don't have the name of badshah in it …where badshah is there in the video rapping beside honey wearing a half pant. Raftaar also have some songs like “Sadko pe Khali pili phirta main “ but honey says that he doesn't even know Raftaar…so to conclude behind honey's success there are so many things..but now his stardom is fading day by day.. ",
            "date": "Answered July 3, 2019",
            "views": "487",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Oukash Sofi",
                    "user_href": "/profile/Oukash-Sofi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prabhakar Bhat",
                "href": "/profile/Prabhakar-Bhat"
            },
            "answer_text": "The first song of him I listened was \"This party's getting hot\". I came to know choot and other songs after a long time (I came to know about couple of them now). As I see it, he became famous after his album \"international villager\". The market for hip-hop was too small (I know there was Bohemia and others). Honey Singh made nice dance numbers with some rap thrown in, with quality videos and marketing. Obviously those who like \"real rap\" don't like him. But others, mostly teenagers partying all over like his party anthems. Moreover, even though his lyrics are stupid, his music is not. It's a unique combination of quality videos, upbeat music, misogynistic lyric, a fit body and celebrity endorsements that made him famous. However, I believe his prime time is over. There is a lot of competition now. Raftaar and Baadshah are getting as/more popular. Especially Badshah caters to same market as Honey Singh. ",
            "date": "Answered May 3, 2015",
            "views": "39",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pratik Chaudhari",
                    "user_href": "/profile/Pratik-Chaudhari-202"
                },
                {
                    "user_id": "Mayank Saxena",
                    "user_href": "/profile/Mayank-Saxena-122"
                },
                {
                    "user_id": "Dipam Goswami",
                    "user_href": "/profile/Dipam-Goswami-1"
                },
                {
                    "user_id": "Priyobroto Chokroborty",
                    "user_href": "/profile/Priyobroto-Chokroborty"
                },
                {
                    "user_id": "Subhadeep Bhatta",
                    "user_href": "/profile/Subhadeep-Bhatta"
                },
                {
                    "user_id": "Anjali",
                    "user_href": "/profile/Anjali-1050"
                },
                {
                    "user_id": "Arjun KR",
                    "user_href": "/profile/Arjun-KR"
                }
            ]
        }
    ]
}