{
    "title": "Why does music sound like music and not just normal sound? - Quora",
    "tags": [
        "Sound",
        "Human Brain",
        "Neuroscience",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Angelo Fahard",
                "href": "/profile/Angelo-Fahard"
            },
            "answer_text": "The answers covering physiology/biology all cover some very interesting and important aspects of this, but we must take into account the very important role played by culture - or, more simply, by what we’re used to calling music already whenever we’re confronted to any (new) sound or group of sounds. There is no good definition of music: if you try to produce one, you’ll inevitably end up either including stuff that you don’t really consider music, or excluding stuff that you definitely do consider music. So saying that something is music is always a contextualized call, and in many cases the frontiers can be blurry. Before I put some examples here, it’s important to underline that music is never natural, and that there is no music “closer to nature” than another. Music is always the result of a human action, at the very least the action of listening to music (and thus attributing to what is listened to the value of “being music”), more commonly the result of deliberately making music. Yes, that seems circular - but since we don’t have a clear and fixed definition, this is unavoidable. (Similar situation: Why do we use the word “chair” to mention a chair? I can trace the history of this usage, but ultimately I cannot give a formal, logical demonstration of a reason. We just do. Say hello to Wittgenstein.) Ok, some examples of sounds that are definitly music to a lot of people, but which have been called “not-music” by some others. My aim with these examples is to show that the difference between “music” and “normal sound” often cannot be found in the physics of the sounds themselves, but must be searched in how they are received and understood. music of the Yawalapiti (traditional, recorded in 2012) Tangerine Dream - Nebulous Dawn (1972) Pierre Schaeffer - Etude aux chemins de fer (1948) Helmut Lachenmann - Guero (1970) some traditional Korean Pansori some Inuit throat singing (several different techniques) these two messy minutes in Stravinsky’s Rite of Spring (1913) Edgard Varèse - Ionisation (1931), in which there are no “notes” in the traditional, pitched sense (also check out his Déserts, which made people call the radio station asking if there was a transmission problem) Einstürzende Neubauten - Autobahn (1984) lots of their early stuff defies conventional definitions of music the very start of this in 1737 is not wholly unlike the ending of this in 1967 …and of course, the piece made explicitly to question what music is: John Cage - 4′33″ (1952) ",
            "date": "Answered July 30, 2017",
            "views": "130",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Francisco Fonseca",
                "href": "/profile/Francisco-Fonseca-12"
            },
            "answer_text": "Sound consists of: In physiology and psychology, sound is the reception of waves and their perception by the brain.(Sound - Wikipedia) Music is collecting those waves and put them in order, like you were cleaning up your closet. You produce waves and make them combine and a regular scheme that allows the brain to understand patterns, meter, tempo and melody.  When sound waves enter the human ear, they stimulate neurons called hair cells that lie on a flat plane. Depending where it is located, each hair cell responds to a characteristic frequency. Those at one end respond to high frequencies, those at the other end to low frequencies.(The Mystery Of Music: How It Works In the Brain) So when you hear a sound it goes to your brain and it is divided between multiple cells and in each of those cells there divisions that are tuned. Also from the same document above a doctor conduted a study: \"We predict you should find cells that are tuned to familiar chords,\" Dr. Bharucha said. Some cells may be tuned for octaves, musical fifths and fourths, he said. Others would specialize in detecting patterns of ascending or descending tones. So as you can see we already have in our brains the connetions and cells that understand the sounds. What makes music is the combination of those cells perfectly in a way that enable other sensations like emotional reactions: Brain mapping shows that musical networks also extend into the brain's emotional circuits in the limbic system. And that is why the definition of music depends from person to person, e.g: I may consider that rock and roll is just random sound and you say Rock and Roll is the best music there is, because for you it affects you somehow. Hope it helped!  Sources: Human Brain Basis of Musical Rhythm Perception: Common and Distinct Neural Substrates for Meter, Tempo, and Pattern ",
            "date": "Answered July 25, 2017",
            "views": "1",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Maitrey Gramopadhye",
                    "user_href": "/profile/Maitrey-Gramopadhye"
                },
                {
                    "user_id": "Nathan Collins",
                    "user_href": "/profile/Nathan-Collins-29"
                },
                {
                    "user_id": "James Wood",
                    "user_href": "/profile/James-Wood-306"
                },
                {
                    "user_id": "Bill Jackson",
                    "user_href": "/profile/Bill-Jackson-43"
                },
                {
                    "user_id": "Vishakha Sharma",
                    "user_href": "/profile/Vishakha-Sharma-19"
                },
                {
                    "user_id": "Jarrod Miller",
                    "user_href": "/profile/Jarrod-Miller"
                },
                {
                    "user_id": "Nuno Moreiras",
                    "user_href": "/profile/Nuno-Moreiras"
                },
                {
                    "user_id": "Jessica Mathews",
                    "user_href": "/profile/Jessica-Mathews-10"
                },
                {
                    "user_id": "Nikolay",
                    "user_href": "/profile/Nikolay-11"
                }
            ]
        }
    ]
}