{
    "title": "Why don't people understand Amy Winehouse? - Quora",
    "tags": [
        "Amy Winehouse (musician)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Linda Ro",
                "href": "/profile/Linda-Ro"
            },
            "answer_text": " I just watched this documentary about Amy Winehouse. It provides you with an intimate view of her life via a compilation of footage taken, and accounts made, by people who were close to her, her friends and family.   Was she misunderstood?  I don't know that she ever truly had anybody in her corner.  That has nothing to do with being understood.  She suffered from eating disorders as a teen while her mother thought it was just a phase.  Her father was more focused on her career than her well-being.  She had relationships with men who, from what I saw, didn't really love her as a person, but rather loved that she became a persona.  Her brother who knew about her bulimia as a teen, stated that it wasn't the drugs and alcohol that killed her, but the binging and vomiting sessions. She resorted to behaviours that provided escape from all of it.  It only got worse as she became well known.  She is quoted saying before she was 20 \"...if I became famous, I don't know how I would handle that. If I became famous, I would go mad\". Where was everyone?  Someone could have tried harder.  If she was my friend, I certainly would have. (so much easier said than done, right?)  Regarding the second part of your question: Do normal \"artists\", or people, have the capability to produce intense expressions about their emotions?  I am pretty sure they do.  Art can be a good outlet for the expression of pain and those things you mentioned:  anger, rage, sadness, loss, grief. If an artists chooses song to express him or herself that is a very public art form.  On top of their emotions, and making those emotions intelligible and marketable, they have to deal with being in the spot light, being scrutinised and torn apart for their every single action.  Who wouldn't want to escape that?  Once you hit fame, you can never go back.  You cannot hide, so escape might be the only choice: escape from yourself. Amy had a unique voice, was naturally talented.  Her lyrics were poignant. I didn't get into her music until after her death.  I enjoy the music that much more now that I know a little bit of her history. She makes The 27 club.   It makes sense to me that people living a fast life, having to deal with a constant spotlight in their first decade of adulthood need to find some sort of balance to make it to the next. With so much going on, how is this feasible?   How many of us resolve our early hurts in our 20s?  ",
            "date": "Answered March 7, 2016",
            "views": "32",
            "upvotes": " View 34 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nabila Roselano",
                    "user_href": "/profile/Nabila-Roselano"
                },
                {
                    "user_id": "Meow Rchl",
                    "user_href": "/profile/Meow-Rchl-1"
                },
                {
                    "user_id": "Jacqueline A Power",
                    "user_href": "/profile/Jacqueline-A-Power"
                },
                {
                    "user_id": "Filip Radojkovic",
                    "user_href": "/profile/Filip-Radojkovic-1"
                },
                {
                    "user_id": "Jolan Hillman",
                    "user_href": "/profile/Jolan-Hillman"
                },
                {
                    "user_id": "Serenity Filipovich",
                    "user_href": "/profile/Serenity-Filipovich"
                },
                {
                    "user_id": "George Verykoukis",
                    "user_href": "/profile/George-Verykoukis"
                },
                {
                    "user_id": "Ivan Drek",
                    "user_href": "/profile/Ivan-Drek"
                },
                {
                    "user_id": "Romaine Holmes-Bey",
                    "user_href": "/profile/Romaine-Holmes-Bey"
                },
                {
                    "user_id": "Iza Suder",
                    "user_href": "/profile/Iza-Suder"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vickie Lynn",
                "href": "/profile/Vickie-Lynn-4"
            },
            "answer_text": "People don't understand her just like they don't understand Michael Jackson. She clearly has raw talent and all the media wants to do is focus on her drug and alcohol addiction. Cause you know that bad news sell alot faster than good news. Amy Winehouse may not have been perfect,but she was still human like everyone else. She had a heart and feelings too,and it hurts me to know that my favorite singer in the world is gone. I'm hurt because of it. But the truth is that she is misunderstood like Michael Jackson. But the ironic thing was when they both died,their music sales went up the roof!  ",
            "date": "Answered April 18, 2016",
            "views": "14",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Billie Crowley",
                    "user_href": "/profile/Billie-Crowley"
                },
                {
                    "user_id": "Filip Radojkovic",
                    "user_href": "/profile/Filip-Radojkovic-1"
                },
                {
                    "user_id": "Backtoblack",
                    "user_href": "/profile/Backtoblack"
                },
                {
                    "user_id": "Aidan Jude Heckerman",
                    "user_href": "/profile/Aidan-Jude-Heckerman"
                },
                {
                    "user_id": "Pedro Henrique Vieira",
                    "user_href": "/profile/Pedro-Henrique-Vieira-2"
                },
                {
                    "user_id": "Jane Carter",
                    "user_href": "/profile/Jane-Carter-105"
                },
                {
                    "user_id": "Shannon Edwards",
                    "user_href": "/profile/Shannon-Edwards-66"
                },
                {
                    "user_id": "Ryan Smith",
                    "user_href": "/profile/Ryan-Smith-654"
                },
                {
                    "user_id": "Ariana Isabella Nechita",
                    "user_href": "/profile/Ariana-Isabella-Nechita"
                },
                {
                    "user_id": "Ajax Mikka",
                    "user_href": "/profile/Ajax-Mikka"
                }
            ]
        }
    ]
}