{
    "title": "Why is Led Zeppelin considered the 'greatest band ever'? - Quora",
    "tags": [
        "Led Zeppelin (band)",
        "Rock Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kat Jackson",
                "href": "/profile/Kat-Jackson-48"
            },
            "answer_text": "Led Zeppelin is considered the greatest band ever because of a few reasons, including their musical and social influences, and the bandmates' friendship, but I'll shorten it down to the 2 most objective reasons for convenience sake. 1. Each member’s inherent mastery of their instrument Each member of Zeppelin (Jimmy Page on guitar, Robert Plant on lead vocals, John Paul Jones on Bass guitar and keyboard, and the great John Henry Bonham on drums) had effectively mastered their instruments long before ever even being In Zeppelin. For example, John Bonham had been playing since he was only 5 years old, and had developed unmatched skill in his trade in almost 30 years of playing by the time he died at the age of 32.  Aside from Bonzo, Page had an affectionate vision in abstract sounds and noise making. He would use outlandish instruments like the electric-acoustic “hurdy-gurdy,” a Gibson U-style harp guitar, and the Theramin. One of his most famous innovations was using a violin bow on an electric guitar in the band’s renditions of Dazed and Confused live.  John Paul Jones, bassist and otherwise multi-instrumentalist, would be the other half of the Zeppelin Rhythm section; in accordance to Bonham. He famously chugged bass riffs like in The Immigrant Song and Whole Lotta Love, but had also perfected the elegant technique of groove-songs like The Lemon Song. Also noted are his often overdriven bass tones, and broad span of world instruments he was able to play, such as the triple-neck mandolin, mellotrons, etc. Robert Plant, it goes without much explanation, had unbelievable tone control and outstanding vocal chords; He was capable of reaching notes ranging from F2-C6. Four octaves! (I don’t know much else about singing from a technical standpoint so I can’t give you much more on his technical ability, but his musicality is unfathomable). All in all, their technical fluidity and skill is among the highest in the world. 2. Their Sense of Music - Zeppelin has made I believe 84 total songs throughout 9 albums, and you could select any track from any album and you would find enjoyment in it, or if nothing else appreciation. Jimmy page made so many riffs it’ll make your head spin; an honest anomaly to musicians trying to emulate their sound. Meanwhile, Bonham (dubbed the “Hammer of the gods” by admirers for his echoing, loud, sound and heavy, thunderous style.) was the driving force behind every Zeppelin song he was on. He kicked ass behind the set and made others aware by defining their music and outlining their sound. Add Jonsey on the bass, and Robert plant on lyric duty and vocals, you got a song. But even among all their smash hits and reeeaally well executed tracks, one of their more defining and most impressive qualities is that they improvise their songs heavily/do them differently every time they would play them live. Royal Albert Hall, The Song Remains the Same, Paris, etc. - All live shows where the band was recorded improvising entire songs within already existing songs in their catalog. One of their most famous improvisations would have to be “San Francisco,” an on the spot single placed in the center of Dazed and Confused The song Remains the same Live, 1973, located at about the 5:50 mark in the above video. (6:17 is considered one of the greatest improv moments in music history) Conclusion: Say what you will about your own take on zeppelin's catalog, but from an objective view of their technical skill and ability to channel emotion into music, they're pretty damn great. Thank ya. ",
            "date": "Updated March 5, 2018",
            "views": "124",
            "upvotes": " View 122 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alexander Zwitbaum",
                    "user_href": "/profile/Alexander-Zwitbaum-1"
                },
                {
                    "user_id": "Stefano Casetti",
                    "user_href": "/profile/Stefano-Casetti"
                },
                {
                    "user_id": "François Cardinaud",
                    "user_href": "/profile/François-Cardinaud"
                },
                {
                    "user_id": "George Peterson",
                    "user_href": "/profile/George-Peterson-134"
                },
                {
                    "user_id": "Mike Ngare",
                    "user_href": "/profile/Mike-Ngare-2"
                },
                {
                    "user_id": "R. Zaki",
                    "user_href": "/profile/R-Zaki"
                },
                {
                    "user_id": "Ian Lundquist",
                    "user_href": "/profile/Ian-Lundquist-2"
                },
                {
                    "user_id": "Kartikaye Kumar Singh",
                    "user_href": "/profile/Kartikaye-Kumar-Singh-1"
                },
                {
                    "user_id": "Chuck Bankoff",
                    "user_href": "/profile/Chuck-Bankoff"
                },
                {
                    "user_id": "Matthew Isaac",
                    "user_href": "/profile/Matthew-Isaac-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Chapman",
                "href": "/profile/Andrew-Chapman-75"
            },
            "answer_text": "The premise of the question is a little faulty because, no, they weren’t and aren’t considered better than The Beatles by most people. Now, as for the minority who do consider Zeppelin to be the greatest… I’m going to take the answer a different direction, since what you can read in the other answers certainly explains Zeppelin’s prowess very well. Led Zeppelin had a few distinct advantages apart from their musical talent: They started in the developing days of rock music. While rock extends back to the 1950s and even ‘40s, the template for rock ’n’ roll as we know it was made popular by The Beatles. And their arrival in the U.S. was a mere four years before Zeppelin started. Those four years were like a chemistry lab for music (and culture) in which the sound evolved and changed at an incredible rate. But mostly, it was like a blank canvas, in which a band could truly create something new. So, while they weren’t literally the first, they were very close to the first at what they did (and certainly the first collectively). Being early in a wave is crucial to establishing “greatness” — look at Amazon, Facebook, and Google as examples in the business world. None were the first at what they did, but they were early and had a very blank canvas to start. And of course, as in any field, the earliest rock bands and rock stars had the greatest opportunity to be influential toward future bands and rockers.They lasted. If you’ve ever been in a band, you know that it’s astonishing that any band can survive, thrive, and succeed for years. Led Zeppelin lasted twelve years, only ending due to John Bonham’s death. Whether they could’ve gone another three or thirty years, we’ll never know, but their dozen years together was greater than 95% of the rock bands in existence when Zeppelin started in 1968. Only eight bands — The Rolling Stones, The Grateful Dead, Pink Floyd, The Kinks, The Beach Boys, Fleetwood Mac, The Who, and Jefferson Airplane/Starship — were still going in 1980. (Add Golden Earring and Scorpions if you count lesser-known European bands who later became popular worldwide). This allowed them to produce more music, which naturally increases the odds of creating great music and being perceived as great. [Note: I may be forgetting a band or two that also lasted from 1968–1980, but the point still stands that 95% of bands did not.]They didn’t go through member changes. This is a close point to #2, but significant because a lot of bands have a hard time establishing themselves in the public perception when personnel change. When this happens, it usually slows the band’s progress and often leads to musical changes (take Fleetwood Mac as an example) that fail to create a solid “brand.” It’d be as if McDonald’s was trying all sorts of foods in the 1950s instead of focusing on fast burgers and fries. Led Zeppelin was one of the few bands who stayed a solid unit through their time, which led to their being a stronger presence in the public’s mind.Part of the “right place, right time” concept, Zeppelin came about when record labels gave bands and artists time to develop. This allowed the band to be true to their musical vision without the pressure of delivering a hit record for the label. This authenticity is a big part of their greatness.They had less competition, both within music and entertainment overall. Remember… this was a time when fewer record albums came out in a year than are now released every day. Your only way to hear new music was through, most likely, one specific radio station in your area that featured the genre you liked (aside from a friend playing the record for you). Most people had only three or four TV stations, none of which were on 24 hours a day. Movies, for the most part, were in the theaters. So, all this combined, the entertainment market was very very narrow compared to what it is today. Led Zeppelin wasn’t competing for people’s attention with Netflix, Amazon, 500 cable channels, and thousands of other points of music on streaming services.Obviously, other bands also enjoyed some of these advantages, but very few had all of them as Led Zeppelin did. Those who did were similarly successful for the same reason. And its this combination of factors, again apart from inherent musical talent, that allowed Zeppelin to be considered all these decades later to be one of the greatest rock bands ever. ",
            "date": "Answered March 8, 2018",
            "views": "4",
            "upvotes": " View 34 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mark Gerrard",
                    "user_href": "/profile/Mark-Gerrard-5"
                },
                {
                    "user_id": "Aris Pavlou",
                    "user_href": "/profile/Aris-Pavlou"
                },
                {
                    "user_id": "Ray Nobel",
                    "user_href": "/profile/Ray-Nobel"
                },
                {
                    "user_id": "Mohan",
                    "user_href": "/profile/Mohan-437"
                },
                {
                    "user_id": "Owen Dodson",
                    "user_href": "/profile/Owen-Dodson-2"
                },
                {
                    "user_id": "Teleri Ferch Nyfain",
                    "user_href": "/profile/Teleri-Ferch-Nyfain"
                },
                {
                    "user_id": "Patricia Clements",
                    "user_href": "/profile/Patricia-Clements"
                },
                {
                    "user_id": "Amorim Sousa",
                    "user_href": "/profile/Amorim-Sousa"
                },
                {
                    "user_id": "Dark Truths",
                    "user_href": "/profile/Dark-Truths-3"
                },
                {
                    "user_id": "Anne Koudelka",
                    "user_href": "/profile/Anne-Koudelka"
                }
            ]
        }
    ]
}