{
    "title": "Why do so many teenagers today love 80s music? - Quora",
    "tags": [
        "1980s Music",
        "1980s",
        "Teenagers and Teenage Years"
    ],
    "response": [
        {
            "author_info": {
                "name": "Zuhayr Ali",
                "href": "/profile/Zuhayr-Ali-1"
            },
            "answer_text": "Since I am teenager, Sophomore in High School, I believe I can answer this, as I am listening to What Have I Done to Deserve this by Pet Shop Boys as I write this. I honestly believe 80s music is probably the best era of music. Absolutely clean lyrics, unlike today’s music, especially rap music where its just super degrading to women (I do like the Weeknd though, his music has actual meaning to it and although he does cuss, its not all bunched up together and given out to the public). Another reason why is our parents. Our parents are now in their 40s and very early 50s. They were in junior high and high school in the 80s. And ever since then, they really haven’t stopped playing 80s music. In fact, on sateillite radio, they have dedicated channels for 50s, 60s, 70s, 80s, 90s, and 2K’s music. My dad especially got me into 80s music. Back when he was growing up in Pakistan, him and his siblings would jam out to American music in the 70s and 80s while drinking Coca-Cola, their favorite thing to do. Then in 1983, they immigrated to the United States. So, I personally feel my dad has more connection to 80s music then the average American who is born here and grew up in the 80s. Although there is a lot of love for 80s at my high school, there is also a lot of hate. Or not hate, but dislike. I sometimes do get made fun of for listening to 80s music. But those who also like 80s don’t listen to all 80s music. See, it really bothers me when, (I won’t say their race but you can figure out what their race is) they divide 80s music into white people 80s and black people 80s. And they think “white people 80s” is wack and “black people 80s” is better. And then they go on Snapchat and say “OMG I love 80s”, when they hate majority of the music anyway. But yes, many teenagers do like 80s music. So do I. Most of the influence comes from TV shows like Stranger Things, which is set in 1984. Our parents also have a lot of influence on why we listen to 80s. Many of us when we were growing up listened to it in the back seat of our cars. Whenever I play today’s music in the car when my dad is there, he gives me the look, and I know what he’s thinking. “This music is really garbage son. How about some Michael Bolton (or insert any other 80s/90s artists and bands)?” ",
            "date": "Answered March 24, 2018",
            "views": "77",
            "upvotes": " View 37 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rama Chandran",
                    "user_href": "/profile/Rama-Chandran-737"
                },
                {
                    "user_id": "Rita Li",
                    "user_href": "/profile/Rita-Li-70"
                },
                {
                    "user_id": "Ryan Erangonit",
                    "user_href": "/profile/Ryan-Erangonit"
                },
                {
                    "user_id": "Truth Seeker",
                    "user_href": "/profile/Truth-Seeker-432"
                },
                {
                    "user_id": "Phoebe Young",
                    "user_href": "/profile/Phoebe-Young-18"
                },
                {
                    "user_id": "Sean Peters",
                    "user_href": "/profile/Sean-Peters-69"
                },
                {
                    "user_id": "Giordano Bruno",
                    "user_href": "/profile/Giordano-Bruno-29"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Shv-M-1"
                },
                {
                    "user_id": "Adrian Trejo",
                    "user_href": "/profile/Adrian-Trejo-1"
                },
                {
                    "user_id": "Jaysen Hamilton",
                    "user_href": "/profile/Jaysen-Hamilton"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alison Johnson",
                "href": "/profile/Alison-Johnson-24"
            },
            "answer_text": "A lot of our parents were in high school or college in the 80’s. It was what we listened to in the back seat of the car growing up, or around the house. There also seems to be something about 80’s music, the lyrics, the basic beats, chord progressions, and melody that appeals to high schoolers. They are songs that you can sing along with your friends to and not be embarrassed not knowing the lyrics because A)its from a different century, and B)They’re fairly easy to predict. It’s also not as monotone as modern music, (aside here, if you ever sing along to pop radio, you may notice that the majority of the song is only 5 notes, an octave if you’re lucky.) It was probably the choice music of our parents when we were young because the lyrics were usually clean, and if they weren’t, they weren’t necessarily explicit (I mean, have you ever read the lyrics to Hungry Like the Wolf? On second thought, don’t!). Now, we can read into the euphemisms and understand what they songs are really about, which makes it all the more relatable to where we are in our experiences in life. 80’s music was typically in a comfortable range for almost everyone, and if it isn’t, it’s fun to try to hit the high notes and make a fool of yourself in front of your friends as they all try to shriek that note, too (looking at you, Freddie Mercury). ",
            "date": "Answered June 16, 2017",
            "views": "34",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Regrets Sm",
                    "user_href": "/profile/Regrets-Sm"
                },
                {
                    "user_id": "James Davis",
                    "user_href": "/profile/James-Davis-229"
                },
                {
                    "user_id": "Nevada Kun",
                    "user_href": "/profile/Nevada-Kun"
                },
                {
                    "user_id": "Alex Clem",
                    "user_href": "/profile/Alex-Clem-6"
                },
                {
                    "user_id": "Autumn Gabriel",
                    "user_href": "/profile/Autumn-Gabriel-1"
                },
                {
                    "user_id": "Sophia Starling",
                    "user_href": "/profile/Sophia-Starling"
                },
                {
                    "user_id": "Simon Jester",
                    "user_href": "/profile/Simon-Jester"
                },
                {
                    "user_id": "Sofia Almeida",
                    "user_href": "/profile/Sofia-Almeida-5"
                },
                {
                    "user_id": "Sarah McClung",
                    "user_href": "/profile/Sarah-McClung-2"
                },
                {
                    "user_id": "Tiny López",
                    "user_href": "/profile/Tiny-López"
                }
            ]
        }
    ]
}