{
    "title": "Why I cant learn any song on guitar? - Quora",
    "tags": [
        "Playing Guitar",
        "Learning to Play Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dion Kara",
                "href": "/profile/Dion-Kara"
            },
            "answer_text": "This question is hard to answer without seeing you play. But for most of my students their biggest problem was not having the correct technical proficiency to perform the movements it would take to play the songs they wanted to play. The following will help you with the mechanical skills required to play correctly: Small, precise movements. Only moving the fingers you need to move, as far as they need to move without any extra movement.Only lifting them as far as they need to be lifted from the strings but no further than that.Making sure the fingers are hitting in the right position to get a clear sound at the correct volume without using any more force than what is needed.Making sure both hands and your entire body are free of tension. This means no involuntary movements from unused fingers or other unused body parts.In my experience the following is a good practise guide. There are three things that work best for my students: Regular (if possible frequent) practise.Working on a mixture of exercises to help build correct technique.Learning versions of the songs you want to play that are at your level of ability.Make sure that your instrument is always accessible. Always have it in the place (apart from work or school) where you spend the most time. One of the things that has helped my students is using 5-10 minutes of spare time to fit a quick practise session in. If this is done often you will be surprised at the progress you make. I have also found that the students that use these shorter periods to work on technical exercises tend to improve faster than the students that work on pieces or songs. Working on technique sounds boring but it will help you learn to play better in a shorter timeframe as well as making sure you don't end up cramps or pain in your hands or arms. Another habit that works very well is making sure that no matter how long or short your practise session is, having a goal for every time you are on your instrument it will contribute to faster improvement. The last thing I will say is if you do have longer sessions (anything over 30 minutes) try and have a break every 5-10 minutes for beginners or every 20 minutes for more experienced players. A break can be a 5 minute change of exercise or song or an actual break. The reason for the break is to make sure that you can remain focussed on your technique and form. The sooner you can play music employing correct technique the easier it will become to play and you will improve a lot faster. Best of luck. ",
            "date": "Answered October 6, 2016",
            "views": "502",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Artem-Semibolotnyi"
                },
                {
                    "user_id": "Chris Moore",
                    "user_href": "/profile/Chris-Moore-1537"
                },
                {
                    "user_id": "Ibrahim Husein",
                    "user_href": "/profile/Ibrahim-Husein-4"
                },
                {
                    "user_id": "Radoslav Nikolov",
                    "user_href": "/profile/Radoslav-Nikolov-2"
                },
                {
                    "user_id": "Delmont Ribeiro",
                    "user_href": "/profile/Delmont-Ribeiro"
                },
                {
                    "user_id": "Alex Bloom",
                    "user_href": "/profile/Alex-Bloom-2"
                },
                {
                    "user_id": "Edward Ward",
                    "user_href": "/profile/Edward-Ward-79"
                },
                {
                    "user_id": "Zhong Xin",
                    "user_href": "/profile/Zhong-Xin-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike O'Connor",
                "href": "/profile/Mike-OConnor-20"
            },
            "answer_text": "Sounds to me like you’re maybe trying something a wee bit too hard for your current ability. I can understand the frustration. For years I found my violin playing plateaued, and I could not advance. Eventually I realised I was trying stuff that was way too hard for me. I backed off a lot and instead I played relatively straightforward stuff really well. In time I found pieces that just stretched my ability a little bit - not a lot - and I found that I had the spare capacity to cope with the new challenges. What ever your instrument or genre I suggest you try something just a little bit easier and work on that - it’s more fun than getting disheartened because you haven’t got instant genius. ",
            "date": "Answered November 13, 2016",
            "views": "247",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Shekhar Dutt",
                    "user_href": "/profile/Shekhar-Dutt-12"
                }
            ]
        }
    ]
}