{
    "title": "Why do many Native Americans have non-Native American names? - Quora",
    "tags": [
        "Native American History",
        "Native Americans",
        "Surnames",
        "American Ethnicity and People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Erik Painter",
                "href": "/profile/Erik-Painter"
            },
            "answer_text": "I’m not sure if you are asking about first or last names. For first names, Native people live in the same modern America that anyone else does and each set of parents names their kids however they want. It is not really different than Bobby Jindal or Nikki Haley (both with families from the Punjab) or Joseph pronounced the Spanish style changing to Joe. Some names are popular, or seem cool or they want a “more English sounding name” or are in the family. There are hundreds of tribes and traditional and languages (and tens of language families) and naming traditions. Many native languages have consonant and vowel sounds that the average English speaker would not know where to begin pronouncing it. So many parents will choose a name that is easier for their kids. Although in the past in places people were forced to have “American” names, today anyone can have any name. They choose for the same reasons other people do. In some traditions there is a private Native American name that is given. In some of those traditions that name would not have been used in public even in traditional times. In those cultures, for everyday life they had various nicknames based on personal attributes or things they did. There are many cultures in the world where this was common. In Japan until the 1900s it was common if you became a writer or poet or priest or other profession to take a new name. In any case, the history of Native American names used today is tied to each tribe and the history of it’s particular contact with the US government and culture and in some cases the Spanish government before that. Generalizations don’t really work well. So I can give you some examples in Navajo culture. In Navajo (Dine’) the private name might be something like: Naat’áłgaii (white chief) or Hashké yił názdá (he returned in anger) for private male names and ’Ádeezbaa’ (she is going to lead on the raid) or Naadlį́ nez (tall warrior girl) for female names. Some families still give these sort of ritual names in ceremonies for their children. They do not use them in everyday life. Almost no person, unless they have studied Navajo, can know how to say these names. It is not too hard if you study, but it would be hard in modern public school. But they were not (and are not) used publicly anyway. Up until the mid 20th century most people spoke Navajo and they had everyday names that they used in Navajo. These might change over a life. These were like 'Anádlohí (laughing one) or Dághaa’łbáhí (grey mustache) or Ba’áłchíní (many children) or Tł’aa’í (left handed one). Again, few English speakers can handle these so people used mangled English version, used translations or chose (or had chosen for them) English names. So Tł’aa’í became Klah and Cly, for example, or the name Chee came from someone with red hair. In Spanish times people chose or had chosen Spanish names like Manuelito (a famous leader). When the US government started recording things and taking censuses they sort of have wrote down what they heard, assigned names, and translated some names. As people were forced into schools on the Navajo Nation (starting in the 1890 but for most not until the 1920s or so) they were assigned “English names”. Some people started joining the military and chose names. Some became Christian and got a baptism name (not large numbers of these in the Navajo lands). Some people used these names in everyday life but until after WWII most did not. Most lived everyday life in Navajo language and used regular Navajo names. They would have a “school” name that might also be used with public officials from the government and then their name they used in real life. Those who became very religious in one of the tens of different Christina denomination that sent missionaries used a “Christian name”. But many even if they had one of those, most did not use it in everyday life in spoken Navajo. In Navajo culture there were no “Last names”. It actually is pretty new in parts of Europe too. When someone introduces themselves in Navajo one says in order, first ones mother’s clan (your clan), then your father’s clan, then in more formal situations the mother’s father’s clan and father’s father’s clans. Then you say where you are from and then you say your name. When asked by the US to have last names some went with tradition and used their mother’s clan name. But the US didn’t understand this was matrilineal and then assigned this to all members in the family and and passed it down from the father. So last names like this ended up in however English speakers could say or spell it. Examples of this are Clausechee from the clan name Tl’ashchi’i meaning “red bottom land clan”. Others translated the clan name like “Many Goats”. Others told the American they were son or or grandson of somebody. Because of Navajo grammar the “son of” part is at the end. Americans thought that was the last name so many are named Begay or Benally. Others got last names that were professions, nicknames. Chishchilly is from Tsii’ yisch’ilii (Curly hair). Bizahalone is from “talkative one”. Tso mean Big, Tsosie - Skinny . Atcitty is from Blacksmith. Singer is a translation from the Navajo word for a “medicine man” or ritual religious practitioner. Some translated these description names into English last names like Curly. As some people were forced into boarding schools in some of them met people from other tribes. Some married and new last names joined the tribe. This was always the case even before boarding schools as it is considered incest to marry into any of the four clans of your grandparents or associated ones. About 1/3 of the clans origin stories are about someone from another tribe. There is even a Naakai dine’e. (Mexican people clan). As time went on in the early 20th century some married European Americans and took those names too. Today, on the Navajo Nation one sees a whole range of origin of last names. Most people go by a “American” first name. Many have another name they use in Navajo. Some have a ritual name that they only use in those circumstances. Some people had assigned family names and have decided to go back to a more traditional one or one that has more meaning. Shonto Begay the Navajo artist and writer is an example of this. He is from Shonto, AZ (meaning -sunnyside spring) . He was born in the 1950s. His father was Mailboy Begay in English. It was for his profession. When he was forced to go to BIA Boarding school they gave him the name Wilson. He never liked it. At home he had be called (as is common) Aashkii’ Yazhi, meaning Little Boy. His last name is the same as the one his father was given in the confusion of what Begay, son of meant in Navajo. In Navajo, his eldest maternal aunt named him Shonto for the place and for a great, great grandmother who had the name Asdzaa’ Shaa’n toh’. He goes not by Wilson Begay but by Shonto Begay now. “I had always had an interest in names. What is it, who wears it, and especially what it means to the bearer. Most people I meet inherited their names from family long past. Some names are chosen without much creativity. Some are way too creative. Some people wear their names for the sound. Our own names are something we say with great consciousness. Like other Navajo kids, I grew hearing the admonition, “Don’t say your name. Your ears will dry up.” I had to learn how to introduce myself by my name later in life, when I felt I was strong enough to carry the name of my entire community. Uttering one’s own name, especially one’s original name, is like releasing breaths of prayers into the universe. Names are powerful among my people and connect you to your ancestors. Names carry you through life, empowering you with story and spiritual recognition.” ",
            "date": "Answered June 14, 2016",
            "views": "89",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kali Kat",
                    "user_href": "/profile/Kali-Kat"
                },
                {
                    "user_id": "Alan English",
                    "user_href": "/profile/Alan-English"
                },
                {
                    "user_id": "Derek Gardner",
                    "user_href": "/profile/Derek-Gardner-9"
                },
                {
                    "user_id": "Charles Wilson",
                    "user_href": "/profile/Charles-Wilson-520"
                },
                {
                    "user_id": "Bran Fuller Snow",
                    "user_href": "/profile/Bran-Fuller-Snow"
                },
                {
                    "user_id": "Devin C. Roe",
                    "user_href": "/profile/Devin-C-Roe"
                },
                {
                    "user_id": "Ka Man",
                    "user_href": "/profile/Ka-Man-3"
                },
                {
                    "user_id": "Jerry Mc Kenna",
                    "user_href": "/profile/Jerry-Mc-Kenna"
                },
                {
                    "user_id": "David Pfeiffer",
                    "user_href": "/profile/David-Pfeiffer-4"
                },
                {
                    "user_id": "Robert P. Collins",
                    "user_href": "/profile/Robert-P-Collins"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sam Morningstar",
                "href": "/profile/Sam-Morningstar"
            },
            "answer_text": "Surnames were acquired through different means over the years. Intermarriage with a non-Native could bring in a legitimate surname. And this could even be through a female line (which differs from the patrilineal tradition of many European cultures). For example, Quanah Parker, a Comanche chief…took the last name of his mother. In many cases, a Native American would keep his or her tribal name and then assume a “White name” for cross-cultural purposes (e.g. formal record keeping purposes, dealing with Americans). Today, this tradition can be found in Asian diaspora populations living in the West - where some individuals might choose a “Western” name instead of using their real name (in their own language). An example of choosing an individual name is Cherokee leader, Elias Boudinot. His given Cherokee name was Gallegina Uwati, but he took the name of a White mentor when he enrolled at mission school. Then there were the imposed surnames. This could be when Natives were sent to boarding schools/religious missions and were assigned a last name without their input. Or, during the Reservation Era, when Natives were considered wards of the state (non-US citizens) and Indian Agents or Superintendants ran things like a fiefdom. They would assign last names for record-keeping purposes and enumerations. This could be for land allotment assignments, rations, base rolls, etc. In that case, it could be a combination of Western names arbitrarily assigned, a transliteration of the Native language, a translation of the head of household’s personal name…and then that became the name for everyone in the family (entrenched as a surname), etc. ",
            "date": "Answered June 14, 2016",
            "views": "66",
            "upvotes": " View 31 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bran Fuller Snow",
                    "user_href": "/profile/Bran-Fuller-Snow"
                },
                {
                    "user_id": "Harry Wang",
                    "user_href": "/profile/Harry-Wang-14"
                },
                {
                    "user_id": "Alexandru Vălcăneanțu",
                    "user_href": "/profile/Alexandru-Vălcăneanțu-1"
                },
                {
                    "user_id": "Duffy Tortes",
                    "user_href": "/profile/Duffy-Tortes"
                },
                {
                    "user_id": "Alan Randall",
                    "user_href": "/profile/Alan-Randall-5"
                },
                {
                    "user_id": "Weyodi O'Clerc Stern",
                    "user_href": "/profile/Weyodi-OClerc-Stern"
                },
                {
                    "user_id": "Selene Raven",
                    "user_href": "/profile/Selene-Raven-1"
                },
                {
                    "user_id": "Erik Painter",
                    "user_href": "/profile/Erik-Painter"
                },
                {
                    "user_id": "Tola Olowokere",
                    "user_href": "/profile/Tola-Olowokere"
                },
                {
                    "user_id": "Ronald Salazar",
                    "user_href": "/profile/Ronald-Salazar-1"
                }
            ]
        }
    ]
}