{
    "title": "Why isn't Here There and Everywhere by The Beatles ever mentioned as one of their better songs? - Quora",
    "tags": [
        "Paul McCartney",
        "The Beatles (band)",
        "Song Lyrics",
        "Rock Music",
        "Song Identification",
        "Music Recommendations",
        "Musicians",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Johnston",
                "href": "/profile/Alex-Johnston-39"
            },
            "answer_text": "It’s a very well-crafted song, and—tear-jerking personal anecdote alert!—it happens to have been my parents’ favourite Beatle song. They met in London in the mid-60s and I grew up in a house that had their copies of Revolver and Sgt Pepper. When my dad died in 1996, my mother left a card on his coffin with a line from the song: Each one believing that love never dies. If you’ve sufficiently recovered from that to read on, I think one reason why it’s not more popular is that it’s rather cosy and complacent. McCartney wanted to write a song expressive of being in love and nothing being wrong. He succeeded, but the result is like drinking dessert wine and eating too many cakes: excessively sugary. ‘Good Day Sunshine’ has a spring in its step, but ‘Here There and Everywhere’ lacks the power and energy to charm anyone who isn’t already in its rather sleepy and self-satisfied mood. That’s my opinion, anyway, and it’s one of the reasons why I disagree with the notion that Revolver is the band’s best album. This is a song that I invariably skip. ",
            "date": "Answered September 16, 2019",
            "views": "82",
            "upvotes": " View 89 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Magnus Franer-Erlingsen",
                    "user_href": "/profile/Magnus-Franer-Erlingsen"
                },
                {
                    "user_id": "Richard Warmington",
                    "user_href": "/profile/Richard-Warmington"
                },
                {
                    "user_id": "Matthew Faas",
                    "user_href": "/profile/Matthew-Faas-2"
                },
                {
                    "user_id": "Ethan Arenson",
                    "user_href": "/profile/Ethan-Arenson"
                },
                {
                    "user_id": "Sarah Hajko",
                    "user_href": "/profile/Sarah-Hajko"
                },
                {
                    "user_id": "Ted Andrews",
                    "user_href": "/profile/Ted-Andrews-5"
                },
                {
                    "user_id": "Anthony Jackson",
                    "user_href": "/profile/Anthony-Jackson-415"
                },
                {
                    "user_id": "Satyam Singh",
                    "user_href": "/profile/Satyam-Singh-23"
                },
                {
                    "user_id": "Jeff Brenner",
                    "user_href": "/profile/Jeff-Brenner-3"
                },
                {
                    "user_id": "Evan Griffith",
                    "user_href": "/profile/Evan-Griffith-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Lowe",
                "href": "/profile/Tom-Lowe-34"
            },
            "answer_text": "Well it was mentioned by Lennon as one of their better songs. According to McCartney it was more or less the only McCartney song that Lennon complimented him on. I think it is a wonderful song, and listen to the other takes of the song, McCartney does some amazing singing in the different versions and rehearsals. Perhaps it isn’t more famous because it is too similar in genre to Yesterday.. or because there are so many good songs in The Beatles’ catalogue. Unlike Yesterday or For No-one, there is no real pain or tension in the song. Despite it being about wanting a distant lover, it really is just a positive declaration of love, superbly sung. ",
            "date": "Answered September 17, 2019",
            "views": "199",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Curt Bourque",
                    "user_href": "/profile/Curt-Bourque"
                },
                {
                    "user_id": "Chris Leotti",
                    "user_href": "/profile/Chris-Leotti-1"
                }
            ]
        }
    ]
}