{
    "title": "Why do I feel sad whenever I listen to old music? Is it because all of them are dead? - Quora",
    "tags": [
        "Sadness",
        "Understanding Emotions",
        "Emotions",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kelson Olson",
                "href": "/profile/Kelson-Olson"
            },
            "answer_text": "The reason could be because they are dead, especially if you are directly thinking about the late artists when you listen to it. Sometimes I listen to The Beatles, or some classical music, and feel this way due to those that are gone. A lot of music nowadays is bad. I mean it is really bad. The lyrics are repetitive and drony, the overall message is psychologically disturbing, and any spoken lyrics are blatantly auto-tuned with a computer making it sound all roboty. The message is either greatly ego based, culturally abusive, behaviorally alienating, or all three. It compounds how disturbed (and sad) I feel from a lot of the music when I realize there are droves of teenagers basically worshipping this music, and taking the message within the music as if it is normal and OK things to do. Years later you find women that worship Taylor Swift (or other similar artists) unable to build anything close to a healthy relationship, a wasteland of marriage history, and still singing along as if it was the right choice to embrace harmful behavior taken from the music as if it was a textbook for life. Or how about the drug user and pusher who finally ended up in prison after numerous stints in various jails? His favorite artist was (probably still is) .50 cent, Tupac, The Game, etc, and the person still cannot even accept basic responsibility of the twisted reality they have created for themselves which does not adhere to the real world. Music itself might not directly alter someone’s mental state, but when listened to enough and really internalized by someone to the point of enshrining it with their behavior, it does change them. Over time they begin to act it out. I find this overall to be very sad how many people are, or have allowed themselves to become due to what they listen to. In my opinion, it tells tales of how people are losing their consciousness and empathy for one another on a whole new scale of mental degeneration. If you are still reading you are probably thinking “what the hell does this have to do with old music?” Everything, because the new makes the contrast stark comparison to how music used to be. Much of the way old music used to be is being lost, if not destroyed, with how new music is produced or encouraged. ",
            "date": "Answered March 24, 2017",
            "views": "27",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aditya Seth",
                    "user_href": "/profile/Aditya-Seth-23"
                },
                {
                    "user_id": "Al Doza",
                    "user_href": "/profile/Al-Doza-1"
                },
                {
                    "user_id": "Jason Weber",
                    "user_href": "/profile/Jason-Weber-50"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/SS-1091"
                }
            ]
        }
    ]
}