{
    "title": "Why is everyone called Kim in Korea? - Quora",
    "tags": [
        "Nicknames",
        "Korean (language)",
        "Korean Ethnicity and People",
        "Given Names",
        "North Korea",
        "Korean Peninsula",
        "South Korea",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Princess Ampol",
                "href": "/profile/Princess-Ampol-1"
            },
            "answer_text": "Kim is one of the most common last names in Korea along with Lee and Park. Back then when Korea was still a royal dynasty, people were separated in different classes in the society similar to the caste system. Only the royal and yangban (양반-middle-class or aristocrats) people have the privilege of having last names. Sometimes, kings would give a last name to a certain patriarch as a symbol of honor and favor, a reward for something they’ve done. There came a point in Joseon dynasty wherein everyone was able to adapt last names. The Japanese rule also forced everyone to have last names (although their names were changed to Japanese). A lot of people chose the last names Kim, Lee and Park which are used by a lot of prominent figures in the society. This gave them the feel that they can now be attached to such people. It is also interesting to note that “Kim” in Hanja (Chinese character) is 金 meaning “gold”. It adds to the reason why it was such a commonly used last name. People believe in attaching certain good meanings to their names to become a self-fulfilling prophecy of how their life would be. Although Kim, Park, and Lee are common last names, they usually have different clans from different regions in Korea. They may share a last name but they can be unrelated by blood as well. ",
            "date": "Answered January 8, 2020",
            "views": "275",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lynn Ridenour",
                "href": "/profile/Lynn-Ridenour-1"
            },
            "answer_text": "Lol. Sometimes it seems that way. And actually about 60 percent of the population has one of three surnames: Kim, Lee, or Park. They can be spelled differently in English. For example Syungmun Rhee is the same as Lee because the R and L in Korean is the same sound and same letter in the Korean alphabet. And the same applies to variations of the surname Park. Kim, on the other hand, has only one spelling in English that I'm aware of. There are still a lot of Korean surnames, though, after you get past the most common three. ",
            "date": "Answered January 7, 2020",
            "views": "183",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lily Foreman",
                    "user_href": "/profile/Lily-Foreman"
                },
                {
                    "user_id": "Tiff Davies",
                    "user_href": "/profile/Tiff-Davies"
                },
                {
                    "user_id": "Frank Seward",
                    "user_href": "/profile/Frank-Seward"
                },
                {
                    "user_id": "Skye Vait",
                    "user_href": "/profile/Skye-Vait"
                }
            ]
        }
    ]
}