{
    "title": "Why is Jimi Hendrix still the greatest guitarist ever? Is there anyone even close to him? - Quora",
    "tags": [
        "Jimi Hendrix (musician)",
        "Guitarists",
        "Guitars",
        "Rock Music",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bill Lonero",
                "href": "/profile/Bill-Lonero"
            },
            "answer_text": "Hendrix was not/is not the greatest guitarist of all time. I’m so tired of that title being attached to him like it’s a tattoo. When Jimi came out there was a lot of “standard” guitar playing (i.e. minor pentatonic box playing, no frills blues solos, I-IV-V progressions etc). Hendrix came out and was doing things others weren’t such as playing behind his back, playing with his teeth, lighting his guitar on fire (contrary to popular belief, he only did this twice. Once in Florida and once in Monterey, Ca). His rendition of the Star Spangled Banner at Woodstock is what really brought him a lot of attention in America because the hippies saw him as anti-war which was right up their alley. It wasn’t because his technique was great. It wasn’t because his music was spectacular. It was because he was a showman and he knew how to milk that stage and audience for everything it was worth. He was exciting to watch but live he was hard on the ears. Lots of feedback and vibrato bar dives. I’ve known people that saw him live and their comments were “great to watch. Hard to listen to”. But let’s put this into perspective. At the time that Hendrix came out, you had the Trogs, The Beatles, The Rolling Stones, The Byrds, The Animals, The Monkees (basically a lot of bands with the word “the” before their names). Most of these bands were playing either straight rock and roll or straight blues (rock and roll was really still trying to find its identity). Along comes this guy from Washington that played guitar louder and with more showmanship than any of these bands. Remember also, Hendrix was not an overnight sensation. He had been playing around the circuits since the early 60s with The Isley Brothers and Little Richard. It wasn’t until he went to London in 1966 that he started making a real name for himself. He was a threat to Eric Clapton, Jeff Beck and Jimmy Page (all ex-members of The Yardbirds) when he got to London. He had created a buzz. Musically he wasn’t doing anything much different than the other guys. Enter Eddie Kramer. Eddie became Jimi’s studio engineer and was really responsible for the Hendrix studio sound (lots of effects such as delays, reverbs, backward guitar, etc) much akin to The Beatles engineer George Martin. Eddie had a vision and Jimi implemented it. That’s not to say that Jimi didn’t have the vision himself. Eddie had the expertise to bring it to fruition. Together they made a great team. Now, Jimi’s death at 27 is what really catapulted his fame. It was abrupt. It was unexpected. Had he lived he would have recorded a lot more albums. Hopefully he would have grown as a musician. Remember also that Hendrix did a lot of hallucinogenic drugs such as acid and LSD. This definitely decreased his inhibitions and increased his creativity. That however doesn’t qualify someone to be the greatest guitarist of all time. Let’s looks at Jimi’s discography while he was alive: Studio albums - 3 Now let’s take a look at how many albums were released by Jimi’s family AFTER he passed away:  That’s 138 albums AFTER he died. That, right there above, is the main reason that people are still talking about James Marshall Hendrix. Pure greed from his family who have been living off the Hendrix name since September 18, 1970. This to me, is disgusting. They will release anything and everything they can to capitalize on his fame and it is because of them that they have kept his name alive and people are still talking about him. To me, the criteria to be “the greatest guitarist of all time” should include these factors: Influence (Jimi has that. Score of 100)Can play any style of music fluidly (Jimi could not do that. Score of 0 )Innovator (Jimi was that. Score of 100)Was a great showman (Jimi definitely had that. Score of 100)Had perfect technique (Jimi did not have that. He was sloppy. Score of 25)Is a great songwriter (that’s debatable since music is so subjective. Score of 50).Plays with emotion (Jimi did that on occasion. Score of 75)Knows music theory (there is some debate on this. A friend of mine that was friends with Hendrix says that Jimi knew music theory so because I trust my friend I’m going to give Jimi a score of 80 on this)Could transform a cover song into something better (Jimi did this on multiple occasions with “All Along the Watchtower”, “Johnny B. Goode” and many others. Score of 100).Can read music (Jimi couldn’t read music. He was asked on the Dick Cavett show if he could read music and Jimi replied “No. No I can not”. Score of 0).With a possible score of 1,000, Jimi scores 630. That’s just past 50%. The greatest guitarist of all time would score 1,000. So there you have it. Jimi Hendrix is NOT the “greatest guitarist of all time”. Can we put this to rest now? ",
            "date": "Updated June 11, 2019",
            "views": "85",
            "upvotes": " View 32 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rik Elswit",
                    "user_href": "/profile/Rik-Elswit"
                },
                {
                    "user_id": "Sylvia Getlin",
                    "user_href": "/profile/Sylvia-Getlin"
                },
                {
                    "user_id": "Ashmede Asgarali",
                    "user_href": "/profile/Ashmede-Asgarali"
                },
                {
                    "user_id": "Remi Van Hout",
                    "user_href": "/profile/Remi-Van-Hout"
                },
                {
                    "user_id": "Brian Farr",
                    "user_href": "/profile/Brian-Farr"
                },
                {
                    "user_id": "Grandzou .",
                    "user_href": "/profile/Grandzou"
                },
                {
                    "user_id": "Rezcky Ramadhan",
                    "user_href": "/profile/Rezcky-Ramadhan"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Shaimal"
                },
                {
                    "user_id": "Gary Bruce",
                    "user_href": "/profile/Gary-Bruce-5"
                },
                {
                    "user_id": "Mark Varela",
                    "user_href": "/profile/Mark-Varela"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martin Turner",
                "href": "/profile/Martin-Turner-57"
            },
            "answer_text": "I don’t think that anyone with a wide knowledge of guitar says that Jimi Hendrix was the greatest guitarist of all time, but many people would argue that he was the greatest rock guitarist. A lot of people, of course, would say that all ‘who was the greatest’ questions are silly, but they are silliest across different genres. Segovia, Django Reinhardt, Charlie Christian, Robert Johnson, and so on were as defining in their own genres as Hendrix was in his.  But let’s unpack for a moment what a reasonable criterion for ‘greatness’ is. We are certainly not saying that Hendrix was the most technically skilful player: Eddie van Halen (who roadied for Hendrix at least once) could have run rings around Hendrix. Nor are we saying that he created the best music, or that he had the best tone. Let me suggest three criteria for greatness, which help explain why Hendrix, Segovia, Reinhardt and the others are considered great. Impact on audiencesImpact on other guitaristsImpact on the artImpact on audiencesHendrix transformed what people were willing to listen to. The virtuoso rock guitarist was not really a thing before Hendrix (notwithstanding the emerging ex-Yardbirds trio of Beck, Clapton and Page). For at least forty years after his death, rock was barely considered rock without virtuoso guitar. Clearly, it helped a lot that much of the audience at Woodstock were stoned at the time he played the Star Spangled Banner. Very few audiences in a clear state of mind would have put up with it if they had not been previously exposed to Hendrix’s playing. But the audience of the 1970 Woodstock film was certainly not all stoned, and this film transmitted Hendrix’s extraordinary solo to many new audiences, and generations of aspiring guitarists. Impact on other guitaristsThe London music scene at the time was buzzing with emerging virtuoso playing. Eric Clapton had been playing with the Yardbirds since 1963, followed by Jeff Beck and Jimmy Page, but Hendrix, by all accounts, lifted things to a new level (I was busy being born at the time, so am reporting what other said). Certainly, 25 years after Hendrix, emerging guitarists were still trying to play like Hendrix. In 1985, the artist that Marty McFly wants to emulate in Back to the Future was Hendrix. If we didn’t have the term ‘lead guitarist’ or ‘rock guitarist’, then we could describe virtuoso guitarists in the rock tradition that came after him as ‘Hendrix-style guitarists’. You can hear echoes of his playing in almost everyone who played rock after him—including many guitarists who only knew the playing second-hand, via Led Zeppelin, or Van Halen, or Guns ’n Roses. Impact on the artThe basic vocabulary of rock guitar was part popularised by, part extended by, and part invented by Jimi Hendrix. Many of the techniques, of course, were drawn from earlier players, but the sound of rock, with modded Marshall amplifiers cooking at the maximum, feedback assisted sustain and the super-vibrato that Hendrix was able to create, coupled with cutting-edge effects like Wah-Wah, relied on taking those techniques in a radical new direction. Hendrix didn’t have just one technique, he had ten, which he fused together into something which was no longer just blues played loud, but was its own thing.  I would argue that all the others I mentioned had a similar impact in their respective genres. All of them came relatively near the beginning of those genres: they were ‘classic’ players in the sense that they defined the art, popularised it and influenced others when it was new. The people who came after them who did it better may have been better technicians, or even better musicians, but they did not define it. To me, that is the defining characteristic of greatness. For this reason, it will be very hard for any other guitarist to come along and be as ‘great’ as Hendrix in rock, because Hendrix already defined it. To be great in the same way, someone will need to create a new genre. ",
            "date": "Answered September 24, 2019",
            "views": "48",
            "upvotes": " View 43 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Eliot Layton",
                    "user_href": "/profile/Eliot-Layton"
                },
                {
                    "user_id": "Michael Cosyn",
                    "user_href": "/profile/Michael-Cosyn"
                },
                {
                    "user_id": "Michael Prosser",
                    "user_href": "/profile/Michael-Prosser-6"
                },
                {
                    "user_id": "Dren Aguirre",
                    "user_href": "/profile/Dren-Aguirre"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Shaimal"
                },
                {
                    "user_id": "Per J Olsen",
                    "user_href": "/profile/Per-J-Olsen"
                },
                {
                    "user_id": "Gary Ciminelli",
                    "user_href": "/profile/Gary-Ciminelli"
                },
                {
                    "user_id": "Rich Krueger",
                    "user_href": "/profile/Rich-Krueger-3"
                },
                {
                    "user_id": "Scott Hoag",
                    "user_href": "/profile/Scott-Hoag-5"
                },
                {
                    "user_id": "Joe Hahn",
                    "user_href": "/profile/Joe-Hahn-25"
                }
            ]
        }
    ]
}