{
    "title": "Why can I sing perfectly fine, and with good tone only when singing quietly, but can't otherwise? - Quora",
    "tags": [
        "Singing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sharmi",
                "href": "/profile/Sharmi"
            },
            "answer_text": "Give it a thought! May be it’s the fear of judgement that prevents you from singing loud! And you feel being in a comfort zone and hum something quietly and perfectly when nobody is gonna listen to you. Does singing quietly mean singing only in your head? Have you ever tried out singing out loud and see how does it feel to be a shower superstar !! Well I’m not kidding! Singing in the shower can really be helpful especially if you are shy of making it in the public and it’s for the same reason; it’s your very own cozy private comfy zone! Try this out. Singing lets you emote and you should have fun while doing it. So sing your heart out and forget the rest.Good luck! ",
            "date": "Answered November 27, 2017",
            "views": "19",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Samridhi Jha",
                    "user_href": "/profile/Samridhi-Jha-10"
                },
                {
                    "user_id": "Domhnall Mac Giolla Riabhaig",
                    "user_href": "/profile/Domhnall-Mac-Giolla-Riabhaig"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Aria-M-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saverio Sciacca",
                "href": "/profile/Saverio-Sciacca"
            },
            "answer_text": "One can speak & sing softly. Try first speaking softly & in this same speaking range elongate your tones, which is singing & try to increase volume. This is your chest range. By utilizing your chest resonance; sing with & through the chest, you will recognize volume. Exercise up into your high chest & lower middle ranges to e flat 1 & F1. If you speak or sing w/o chest resonance, your facial resonance will also sound thin. Just Crooning always sounds good, subjectively, especially under the shower. Good Luck. ",
            "date": "Answered November 28, 2017",
            "views": "14",
            "upvotes": "0"
        }
    ]
}