{
    "title": "Why is Jimin of BTS dirty-minded? - Quora",
    "tags": [
        "Park Jimin (BTS Member)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richie Duff",
                "href": "/profile/Richie-Duff"
            },
            "answer_text": "Tbh at least more then half of the Army's think that Jiminie is totally “Dirty Minded” but from his perspective I can disagree with you :) he might seem but he's not…  He's out there existing, making everyone happy and just in general being a cute lil Bean and making everyone soft.. But wait till you piss him off :D:)  Jimin gets involved with a lot of dirty stuff but I can tell he's not like that at all.. Yea he can slip Som joke here and there but that's about it..     Also if you watch some videos sometimes it seems like it slips out of his mouth accidentally :D but remember that he's still in the entertainment industry and can definitely act certain way…. (believe me they all know what Crazy Army's want to see or hear and they don't mind to say or do so…)   Also he said that the older hyungs are very dirty minded (THOSE BIGGEST ONES BEING RM AND JIN) *instant betrayal* XD :D but I never actually thought that Jin was the one who's the most dirtiest according to Chim :D so imagine living like that for 7 years? You'll definitely be dirty :D or other members will make you look that way :D believe me I know how it is…  I love Jiminies attitude, he will kick your ass for good if you will try to make him dirty or make stupid jokes about him being short :D if you wonder then yes…  Jimin Definitely is THAT friend. ",
            "date": "Answered October 7, 2019",
            "views": "103",
            "upvotes": " View 32 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yukimi Suzuki",
                    "user_href": "/profile/Yukimi-Suzuki-2"
                },
                {
                    "user_id": "Cassandra Kontchou",
                    "user_href": "/profile/Cassandra-Kontchou"
                },
                {
                    "user_id": "Johanna (Yoyo)",
                    "user_href": "/profile/Johanna-Yoyo"
                },
                {
                    "user_id": "Jorie Alexander",
                    "user_href": "/profile/Jorie-Alexander"
                },
                {
                    "user_id": "Sangram Singh",
                    "user_href": "/profile/Sangram-Singh-10"
                },
                {
                    "user_id": "Sio F",
                    "user_href": "/profile/Sio-F"
                },
                {
                    "user_id": "Ananya Mukherjee",
                    "user_href": "/profile/Ananya-Mukherjee-184"
                },
                {
                    "user_id": "Divya Kumari",
                    "user_href": "/profile/Divya-Kumari-248"
                },
                {
                    "user_id": "Joy Myelin",
                    "user_href": "/profile/Joy-Myelin"
                },
                {
                    "user_id": "Barsana Dey",
                    "user_href": "/profile/Barsana-Dey-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexa Kahny",
                "href": "/profile/Alexa-Kahny"
            },
            "answer_text": "Let’s just go over this… Jimin is a 23-year-old man. Not a 5-year-old boy. Everyone has hormones. Most people’s hormones increase their desire for sex at some point in their lives, with the exception of asexual people, in which I highly doubt any of BTS are asexual. Jimin is dirty-minded because of his hormones. Some people don’t let the hormones take over the cleanness of their minds, Jimin wasn’t one of those people. Jimin is someone I would say has an increased desire for sex. Not saying it’s unhealthy or bad, because, it’s not. I mean, just watch his reaction to Normani. Do you see how he acts when he finds someone attractive? He’s a horny guy, it’s only natural he’d be dirty-minded. ",
            "date": "Answered December 1, 2018",
            "views": "63",
            "upvotes": " View 45 Upvoters",
            "upvoters": [
                {
                    "user_id": "Natasha Palacios",
                    "user_href": "/profile/Natasha-Palacios-3"
                },
                {
                    "user_id": "Valentina",
                    "user_href": "/profile/Valentina-585"
                },
                {
                    "user_id": "Rashmitha Yerrabelly",
                    "user_href": "/profile/Rashmitha-Yerrabelly"
                },
                {
                    "user_id": "Kristy Huang",
                    "user_href": "/profile/Kristy-Huang-9"
                },
                {
                    "user_id": "Joy Myelin",
                    "user_href": "/profile/Joy-Myelin"
                },
                {
                    "user_id": "Madhu Dakshinamoorthi",
                    "user_href": "/profile/Madhu-Dakshinamoorthi-1"
                },
                {
                    "user_id": "Sio F",
                    "user_href": "/profile/Sio-F"
                },
                {
                    "user_id": "Mono Taegukk",
                    "user_href": "/profile/Mono-Taegukk"
                },
                {
                    "user_id": "Shanaya",
                    "user_href": "/profile/Shanaya-151"
                },
                {
                    "user_id": "Ana Gherman",
                    "user_href": "/profile/Ana-Gherman-5"
                }
            ]
        }
    ]
}