{
    "title": "Why are we so bad at listening to what others have to say? - Quora",
    "tags": [
        "Psychology of People Skills",
        "Listening",
        "People Skills",
        "Communication",
        "Social Psychology",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Perry Nein",
                "href": "/profile/Perry-Nein"
            },
            "answer_text": "I like to listen to people. I hear some strange and wonderful stories. I don't verbalize too much. In the sixties I was taught to journal. I journal everything. It's become a habit. If I'm talking to somebody and say I stubbed my toe I will see the look in their eyes on where they're trying to relate to stories about stubbed toes. It's human behavior. Makes it hard to listen when you're thinking of something to say when people are talking to you. Some people say things about me that are simply not true. I tried to disuade them, not listening they were trying to think of a way to rebut me. When I do have something that needs to be said I will say it to the appropriate people. No if ands buts. If they didn't want to listen to me that's their problem I relayed the message. I have been told I was being rude when I displayed that type of behavior. When talking to people I keep it brief. No one wants to listen to what I have to say. They have better things to talk about. .’Paris Hilton's dog’s $2,000,000 diamond necklace is so very important, look it's got a diaper on how cute, what did Perry just say? He's so rude. He said your car's what? Don't listen to Perry.’ Those are some of the situations I've been in where people don't listen to me. I'm so accustomed to journaling I have been remiss. The last power outage blew out my video card. There was a voltage differential between my monitor and PC. Now I use my phone. On Quora. ",
            "date": "Answered July 28, 2020",
            "views": "563",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Teresa Suarez",
                "href": "/profile/Teresa-Suarez-1"
            },
            "answer_text": "I’ve encountered so many people who choose not to listen to either your stories and/or opinions. The reasons I think for this are: Arrogance; Many people can be so arrogant to the point that they believe that your opinions are nonsense and therefore insignificant. With that said, such people think that they are the smartest in the room and only their opinions are right. But opinions are opinions, and no one opinion is right unless proven.Inability to accept defeat or the fact that someone got it right; When a person has too much pride, it becomes extremely difficult to accept one’s own mistake or difficult to learn from others who possibly know much more than they do.Lack of deep understanding or empathy; This applies to arguments and simple discussions and venting. People with this trait choose to quickly dismiss people due to simple annoyance. They choose to dismiss others because they believe that only their problems and own happiness matter in the world - every man for himself. Being around such people will only bring you down more when you’re already troubled.The list could go on and on, but these three things should give you a view as to why some people choose not to listen. Whatever happens, fight for what you believe in without inflicting pain on others. Also, do look for people who will listen to you. Although such people rarely exist, you will find one as long as you are the same. ",
            "date": "Answered August 11, 2017",
            "views": "2",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Floris-53"
                },
                {
                    "user_id": "Moatasem Kassab",
                    "user_href": "/profile/Moatasem-Kassab"
                },
                {
                    "user_id": "Dhawal Mehta",
                    "user_href": "/profile/Dhawal-Mehta-10"
                },
                {
                    "user_id": "Sarah D Hensley",
                    "user_href": "/profile/Sarah-D-Hensley"
                },
                {
                    "user_id": "Dorita Emerson",
                    "user_href": "/profile/Dorita-Emerson"
                },
                {
                    "user_id": "Sidney Anita",
                    "user_href": "/profile/Sidney-Anita"
                },
                {
                    "user_id": "Vera K",
                    "user_href": "/profile/Vera-K-11"
                },
                {
                    "user_id": "Karen Becker",
                    "user_href": "/profile/Karen-Becker-5"
                },
                {
                    "user_id": "Carol McCooke",
                    "user_href": "/profile/Carol-McCooke"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Michaele-M"
                }
            ]
        }
    ]
}