{
    "title": "Why did Russia wish to 'take back' Crimea? - Quora",
    "tags": [
        "Politics of Ukraine",
        "Russia–Ukraine Relations",
        "Russia–Ukraine Conflict (2014–present)",
        "Politics of Russia",
        "Ukraine",
        "Russia"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joseph Williams",
                "href": "/profile/Joseph-Williams-160"
            },
            "answer_text": "The basic answer is that this is a combination of symbolism and strategy. Strategically, Crimea is a gold mine. Russia has the issue of geography. In other words, its biggest problem is that, since most of its land is so far up north, it suffers brutal winters. These winters can block ports and basically entrap its citizens, and in a globalized world like this, that’s a death trap.  Vladivostok port, in the wintertime. (Vladivostok port | Björn Steinz) Crimea, in general, is very important, as some of its ports are far enough south that they remain ice-free all year. This means that, if Russia can have these ports, it’d have a way to actually be a part of the globe (not to mention allow its navy to have a means of “setting up shop,” if you will). Symbolically, Russia also wanted Crimea because, for the longest of times, it has always been a part of Russian territory. This has led to Crimea hosting a large number of Russian ancestors in the region, so it’s like a part of Russia. Giving up Crimea was giving up a very important piece of its territory and culture. Taking it back, therefore, was a major political boost, since it boosted nationalism. This made Putin look amazing. Some also speculate that Russia annexed Crimea as a way to destabilize Ukraine, since Ukraine was planning on joining NATO. This is likely in response to NATO basically coming up to Russia’s borders.  Map of NATO countries, with Ukraine in red, indicating it wants to join NATO. Source: Top 14 maps and charts that explain NATO - Geoawesomeness If Ukraine becomes a part of NATO, as you can tell from that map, Russia might be put in a major bind, as Belarus will be the only country that Russia might be able to go through in a time of war. That makes Russia uncomfortable, so destabilizing Ukraine (through Crimea and Donbass) prevents Ukraine from joining and keeps Russia safe. So, Russia likely annexed Crimea because of symbolism and strategy. ",
            "date": "Answered October 10, 2017",
            "views": "144",
            "upvotes": " View 91 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vansh Kumar",
                    "user_href": "/profile/Vansh-Kumar-73"
                },
                {
                    "user_id": "Siddharth Banerjee",
                    "user_href": "/profile/Siddharth-Banerjee-45"
                },
                {
                    "user_id": "Rajat Ranjith",
                    "user_href": "/profile/Rajat-Ranjith"
                },
                {
                    "user_id": "Pranav Piyush",
                    "user_href": "/profile/Pranav-Piyush-5"
                },
                {
                    "user_id": "Abhinav Prasad",
                    "user_href": "/profile/Abhinav-Prasad-56"
                },
                {
                    "user_id": "Dmitry Gukov",
                    "user_href": "/profile/Dmitry-Gukov"
                },
                {
                    "user_id": "Sudais Asif",
                    "user_href": "/profile/Sudais-Asif"
                },
                {
                    "user_id": "Yi Wei",
                    "user_href": "/profile/Yi-Wei-28"
                },
                {
                    "user_id": "Osman Yissah",
                    "user_href": "/profile/Osman-Yissah"
                },
                {
                    "user_id": "Matt",
                    "user_href": "/profile/Matt-3964"
                }
            ]
        },
        {
            "author_info": {
                "name": "Misha Sivan",
                "href": "/profile/Misha-Sivan"
            },
            "answer_text": "While most of the western media has used “annexation” as a term that describes the events in Crimea in February and March 2014, those events have never been formally established as annexation by any court or other legal international body. Thus your question is moot, since the Russian Federation did not annex Crimea! The people of Crimea and Sevastopol had voted in a plebiscite on March 16, 2014 to secede from Ukraine, following an anti-constitutional coup in Kiev in February 2014. Crimea had always been an Autonomous Oblast in Ukraine, see Constitution of the Autonomous Republic of Crimea - Wikipedia, as was declared in 1992. Since then it was their desire to secede from Ukraine. Seeing who came to power in Kiev in a wave of violent pandemonium of Western Ukraine ultra-nationalists, that had highjacked the peaceful protests in the Maidan in the beginning of 2014, the people of Crimea had acted in self defense to prevent the bloodshed and violence in their home. After all Crimea was not supposed to be in Ukraine in the first place, it was “gifted” to the Ukrainian Soviet Socialist Republic in 1954 illegally by the Ukrainian Secretary General of the Soviet Communist Party Nikita Khrushchev. As a matter of fact this mistake should have been corrected during the break-up of the Soviet Union in 1991 as per Belavezha Accords, that provided for a referendum of autonomous oblasts of the Soviet Republics, which Crimea was at that time. Independent Ukraine kept the Crimean peninsula, but as an autonomous region, that was entitled to a referendum. And so they did first in December 1991 (followed by declaration of independence in May 1992, that was annulled by Kiev) and more recently in March 2014. Once Crimea and separately Sevastopol became independent legal entities, they have submitted a formal request to join the Russian Federation. That request was granted, as expected, so, legally there was no annexation! If you prefer to play with semantics, try this definition fro a size: “the Crimean people had exercised their inalienable right to self-determination and had expressed their free will to liberate their homeland from the 21 years of the illegal Ukrainian occupation.” ",
            "date": "Answered October 26, 2016",
            "views": "267",
            "upvotes": " View 262 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Martin Knutsson",
                    "user_href": "/profile/Martin-Knutsson-4"
                },
                {
                    "user_id": "Nattaq Wayne",
                    "user_href": "/profile/Nattaq-Wayne-1"
                },
                {
                    "user_id": "Kyle Patching",
                    "user_href": "/profile/Kyle-Patching"
                },
                {
                    "user_id": "Avdhoot Mohite",
                    "user_href": "/profile/Avdhoot-Mohite-1"
                },
                {
                    "user_id": "Yousef",
                    "user_href": "/profile/Yousef-132"
                },
                {
                    "user_id": "Mihai Boncalo",
                    "user_href": "/profile/Mihai-Boncalo"
                },
                {
                    "user_id": "Vansh Kumar",
                    "user_href": "/profile/Vansh-Kumar-73"
                },
                {
                    "user_id": "Tony Dood",
                    "user_href": "/profile/Tony-Dood"
                },
                {
                    "user_id": "Boris U",
                    "user_href": "/profile/Boris-U"
                },
                {
                    "user_id": "Kostas Margiavičius",
                    "user_href": "/profile/Kostas-Margiavičius"
                }
            ]
        }
    ]
}