{
    "title": "Why do chairs have four legs? - Quora",
    "tags": [
        "Chairs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gurkirat Singh",
                "href": "/profile/Gurkirat-Singh-51"
            },
            "answer_text": "This is an interesting question. My first reaction to this question was: “what?! So that you don't fall!! What the ffffffuuu..” But then I switched the engineer inside me on and came to the conclusion that… Chairs are not always required to have four legs. Legs of chair can be attached at points which would be vertices of an equilateral triangle, and it would be stable, just like wooden stools. A chair can have even one leg and still be stable, given the leg is thick enough. Basically the purpose is to distribute the weight equally and uniformly in all directions, else you'll topple and hit the head housing your beautiful face on concrete…or tiles…may be marble…doesn't matter actually, you'll break it anyway. The difference, however, comes in the weight carried by each leg. More the number of legs, lesser the weight carried by each leg, hence less failures. More legs also means more cost, that is the reason we don't see seven legged super stable chairs. The number 4 is also more symmetric, compared to odd numbers like 3 or 5. Additionally, finding the location of points to fix legs is simpler if the legs are to be fixed in a square or rectangular fashion. Conclusion: The idea behind 4 legs of a chair is an amalgam of physics, cost, ease of manufacturing and aesthetics/symmetry. Or… It could be some weird pre-historic superstition which just stuck. Having said this, I now have an eerie feeling of getting up of my 4 legged chair…but what would I sit on? ",
            "date": "Answered April 24, 2018",
            "views": "15",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kirito",
                    "user_href": "/profile/Kirito-61"
                },
                {
                    "user_id": "Anish Kumar",
                    "user_href": "/profile/Anish-Kumar-209"
                },
                {
                    "user_id": "Swapna",
                    "user_href": "/profile/Swapna-116"
                },
                {
                    "user_id": "Pradeep Joshi",
                    "user_href": "/profile/Pradeep-Joshi-3"
                },
                {
                    "user_id": "Aman Sharma",
                    "user_href": "/profile/Aman-Sharma-101"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vedank Singhania",
                "href": "/profile/Vedank-Singhania"
            },
            "answer_text": "Four-legged chairs are by far the most common form of chair. However, only three legs are necessary to maintain stability whilst sitting on the chair. If the chair were to tilt, then with both a four-legged and three-legged chair, there is only one direction in which the chair can tilt whilst retaining two legs on the ground. So why not go for the simpler, cheaper, three-legged chair? Or how about a more robust, five-legged chair? What is so special about the four-legged case? One suggestion is that the load supported by each leg is lower in a four-legged chair, and so the legs themselves can be weaker and cheaper. But then why not 5 or 6 legs? Another suggestion is that the force to cause a tilt is more likely to be directly forwards or sideways with respect to the person's body, which would retain two legs on the floor with a four-legged chair, but not a three-legged chair. A third suggestion is that four-legged chairs just look the best asthetically, due to the symmetry. Finally, perhaps it is just simpler to manufacture a four-legged chair, again due to this symmetry. Or is it just a custom that started years ago and never changed? ",
            "date": "Answered April 25, 2018",
            "views": "11",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chiraag Khanna",
                    "user_href": "/profile/Chiraag-Khanna"
                },
                {
                    "user_id": "Ashiq Hameed",
                    "user_href": "/profile/Ashiq-Hameed-1"
                },
                {
                    "user_id": "Saurabh Kumar Maurya",
                    "user_href": "/profile/Saurabh-Kumar-Maurya-9"
                },
                {
                    "user_id": "Kavisha M. Desai",
                    "user_href": "/profile/Kavisha-M-Desai"
                }
            ]
        }
    ]
}