{
    "title": "Why do some people get angry when someone is wearing a MAGA hat? - Quora",
    "tags": [
        "MAGA Hat",
        "Hats & Caps",
        "Clothing and Apparel",
        "Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alys Richards",
                "href": "/profile/Alys-Richards"
            },
            "answer_text": "Because some people, in spite of their claims of tolerance, are narrow-minded, intolerant bigots who don’t practice what they preach. You see, tolerance is usually not practiced by the people who SAY they are tolerant, but the ones that don’t make a big deal out of it. After all, an honest person doesn’t have to go around telling people they are honest, do they? Progressive attacks increasingly are less like arguments and more like attempts to silence because, for them, it’s ok to look different, but it’s not ok to hold opposing political views. The opposition must be silenced, for in order for Socialism to take over and rule, everyone must think the same, or at least appear to. The only way to get everyone to agree is by force. Step one in forcing conformist thought is to silence the dissenters, then take away the citizens' means of resisting: their right to own guns. Five years ago, guns were banned in Venezuela. Today, in a petroleum rich country that used to be one of the wealthiest in the world, the people are rioting because they are starving. Unarmed, the protesters are being shot down by their own police. This is exactly what the Left in the US is trying to do; silence and disarm. It couldn’t be clearer. When \"wide swaths of the population (educated urbanites) routinely refuse to engage with anyone who occupies a different position on the political spectrum, they will probably be more ignorant about what those people actually believe. They will tend to demagogue each other, and assume the worst. It's very easy to find examples of this: Relatively privileged, elite media folks were among the most eager to wrongly assume that a bunch of MAGA-hat-wearing teenagers were harassing a Native American man on the steps of the Lincoln Memorial\". https://reason.com/blog/2019/03/06/the-most-politically-intolerant-american As Thomas Sowell, American economist and social theorist who is currently a Senior Fellow at the Hoover Institution, Stanford University, said, \"Liberalism is nothing more than totalitarianism with a human face.\" ",
            "date": "Updated August 30, 2019",
            "views": "15",
            "upvotes": " View 61 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jay Goodman",
                    "user_href": "/profile/Jay-Goodman-5"
                },
                {
                    "user_id": "Mary Nesrsta",
                    "user_href": "/profile/Mary-Nesrsta"
                },
                {
                    "user_id": "Dennis Brenes",
                    "user_href": "/profile/Dennis-Brenes-2"
                },
                {
                    "user_id": "Derek Horschel",
                    "user_href": "/profile/Derek-Horschel"
                },
                {
                    "user_id": "Jeffrey McKinery",
                    "user_href": "/profile/Jeffrey-McKinery"
                },
                {
                    "user_id": "David Dunigan",
                    "user_href": "/profile/David-Dunigan"
                },
                {
                    "user_id": "Victoria Shirkey",
                    "user_href": "/profile/Victoria-Shirkey"
                },
                {
                    "user_id": "Aronga Immanotta",
                    "user_href": "/profile/Aronga-Immanotta"
                },
                {
                    "user_id": "Amy D ThompsonBernard",
                    "user_href": "/profile/Amy-D-ThompsonBernard"
                },
                {
                    "user_id": "Dan Nguyen",
                    "user_href": "/profile/Dan-Nguyen-519"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Chaplan",
                "href": "/profile/Michael-Chaplan-1"
            },
            "answer_text": "Thanks for the question, Zach. Perhaps you remember Hillary’s “two basket” speech. Hillary was talking about the sort of people who were unlikely to vote for her. Here is the pertinent part: \"I know there are only 60 days left to make our case -- and don't get complacent, don't see the latest outrageous, offensive, inappropriate comment and think, well, he's done this time. We are living in a volatile political environment. You know, to just be grossly generalistic, you could put half of Trump's supporters into what I call the basket of deplorables. Right? The racist, sexist, homophobic, xenophobic, Islamaphobic -- you name it. And unfortunately there are people like that. And he has lifted them up. He has given voice to their websites that used to only have 11,000 people -- now 11 million. He tweets and retweets their offensive hateful mean-spirited rhetoric. Now, some of those folks -- they are irredeemable, but thankfully they are not America.\" \"But the other basket -- and I know this because I see friends from all over America here -- I see friends from Florida and Georgia and South Carolina and Texas -- as well as, you know, New York and California -- but that other basket of people are people who feel that the government has let them down, the economy has let them down, nobody cares about them, nobody worries about what happens to their lives and their futures, and they're just desperate for change. It doesn't really even matter where it comes from. They don't buy everything he says, but he seems to hold out some hope that their lives will be different. They won't wake up and see their jobs disappear, lose a kid to heroin, feel like they're in a dead-end. Those are people we have to understand and empathize with as well.\" Some Republicans who don’t like to read long arguments reduced the entire content of Hillary’s speech to “those who oppose me are deplorables: racists, sexists, bigoted, etc.” They didn’t care that Hillary had said that she wanted to help those who were suffering economically, the people in the second basket. Many Trump followers described themselves as “deplorables.” And the MAGA hat became the symbol of Trump followers. Those with economic (or other) concerns became irrelevant, and it became common to assume that Trump followers = deplorables. ",
            "date": "Updated March 21, 2019",
            "views": "471",
            "upvotes": " View 887 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lee Samuelson",
                    "user_href": "/profile/Lee-Samuelson"
                },
                {
                    "user_id": "Kelly Cheney",
                    "user_href": "/profile/Kelly-Cheney-10"
                },
                {
                    "user_id": "Dan Bolger",
                    "user_href": "/profile/Dan-Bolger-8"
                },
                {
                    "user_id": "Angela Stockton",
                    "user_href": "/profile/Angela-Stockton"
                },
                {
                    "user_id": "Trevor Cochran",
                    "user_href": "/profile/Trevor-Cochran-7"
                },
                {
                    "user_id": "Colleen Wolfe",
                    "user_href": "/profile/Colleen-Wolfe-3"
                },
                {
                    "user_id": "John Hampton",
                    "user_href": "/profile/John-Hampton-82"
                },
                {
                    "user_id": "Joaquin Hemstreet",
                    "user_href": "/profile/Joaquin-Hemstreet"
                },
                {
                    "user_id": "Michel Murray",
                    "user_href": "/profile/Michel-Murray-2"
                },
                {
                    "user_id": "Katrina Larkin",
                    "user_href": "/profile/Katrina-Larkin-1"
                }
            ]
        }
    ]
}