{
    "title": "Why is progressive rock so unpopular? - Quora",
    "tags": [
        "Progressive Rock (music genre)",
        "Classic Rock Music",
        "Rock Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Lanzarotta",
                "href": "/profile/Mark-Lanzarotta"
            },
            "answer_text": "Because it almost killed rock and roll by taking it in a pretentious hyphenated direction, actually almost killing it and handing the field over to Disco, before Punk arrived to save the day. All those stupid people saying Rock was Dead in the early Seventies were looking at progressive rock and jazz fusion as evidence, and most of the insensate unimaginative lumps wanted rock to die so they could listen to their gooey Bread albums without being laughed at. Synthesizer noodling made a bunch of Junior College dropouts feel like they were somehow cultured and refined. I remember listening to \"Tales of Topographic Oceans\" by Yes and wondering \"My God, what has happened to poor Rock And Roll? What happened to Chuck Berry?\" Then The Ramones came along and made all their contemporary bands look stupid and pretentious in comparison. Then it became fashionable to condemn Prog Bands as soulless heretics who stealthily tried to turn Rock into a bastard form of classical music. Their instrumental technical prowess was then called boring elitism. Sure, they were great musicians who substituted jamming for real song-writing, and overnight nobody needed it. What does a gas station attendant do with Relayer? This tremendous animus and backlash has carried over to the remnants of today, with Prog bands having serious problems entering the Rock Hall of Fame. Because of Heresy! Genesis only got in because they switched to the kind of slick commercial pop that Jann Wenner loves. King Crimson never sold out, not even Jethro Tull did, thus both of those fairly good bands have a rat's ass of a chance of entering Mr. Wenner's Palace of Dummy Schlock. What endures of Progressive Rock today that's the slightest bit important or meaningful? Well, Pink Floyd endured like hell by being the biggest panderers to dummyhood in creation, but they went a long way by stubbornly doing little that was not trite or formulaic. They were the lowest common denominator that won by being as unimaginative as their audience, they are the supreme sellouts. \"The Lamb Lies Down on Broadway\" was a smashing success creatively, not so much financially. But it holds up really well over time. Peter made something really gritty and weird that his schlockmeister bandmates couldn't ruin with their doodlings, and it holds up today far better than anything by Yes does. Yes, those colossal instrumentalists, were actually so weak that they collapsed the second Roger Dean stopped making their album covers, they were humbugs. What, then, will endure of Progessive Rock? Some Crimson, some Tull. Some earlier meanderings of Peter Gabriel like \"Supper's Ready.\" Not much, really. In the early Seventies, The Beatles had just broken up and nobody knew what to do. I attended an Alice Cooper concert and a Yes concert in the same week. Progressive rock was kind of a guilty pleasure in those days. People listened to it and enjoyed it, but had the nagging suspicion that they were on the wrong track Chuck Berry-wise. Then they listened to Punk and briefly felt like they were on the right track. But then that scene was forcibly stamped out by Reagan's police squad, the horrendous wasteland dreck of the Eighties commenced. There was a Renaissance of sorts with Grunge. Then Cobain put a bullet in his head and Rock and Roll collapsed like the lost continent of Atlantis. The Ramones broke up and promptly all died. The White Stripes flickered and faded away. Today we have the Foo Fighters and The Black Keys, and endless inchoate continents of Hip-Hop. Don't feel bad, Progressive Rock, the whole thing is a mass of charred rubble now. The winner? The Internet. ",
            "date": "Updated February 17, 2018",
            "views": "65",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bridget • S",
                    "user_href": "/profile/Bridget-•-S"
                },
                {
                    "user_id": "Stanley Brown",
                    "user_href": "/profile/Stanley-Brown-14"
                },
                {
                    "user_id": "Josh Betts",
                    "user_href": "/profile/Josh-Betts-18"
                },
                {
                    "user_id": "Niklas Tjitra",
                    "user_href": "/profile/Niklas-Tjitra"
                },
                {
                    "user_id": "James Lagan",
                    "user_href": "/profile/James-Lagan-3"
                },
                {
                    "user_id": "Roy Truax",
                    "user_href": "/profile/Roy-Truax"
                },
                {
                    "user_id": "Souryadipta Dasgupta",
                    "user_href": "/profile/Souryadipta-Dasgupta-1"
                },
                {
                    "user_id": "Joe Newport",
                    "user_href": "/profile/Joe-Newport"
                },
                {
                    "user_id": "Geoffrey Perkins",
                    "user_href": "/profile/Geoffrey-Perkins-2"
                },
                {
                    "user_id": "Jim Busbin",
                    "user_href": "/profile/Jim-Busbin"
                }
            ]
        },
        {
            "author_info": {
                "name": "JC Harris",
                "href": "/profile/JC-Harris-4"
            },
            "answer_text": "The real question is “Why hasn’t Progressive Rock made a comeback?”. Almost all genres -do- have periodic revivals. But not ‘prog’. There is one primary reason progressive rock is the Rodney Dangerfield of all the big rock genres: the critics LOATHED it. From all the jokes and contempt, most young people are surprised to learn just how big these bands were from ’71 to ’80. But most young people also cannot appreciate how influential ‘rock journalism’ was during rock’s heyday. Rolling Stone, Creem, et al. -mattered-. And the critics hated -everything- about prog from day one. Traditionally, what matters above all things to most pop music critics is ‘authenticity’. Critics tended to love styles that are ‘honest’ and that tends to strongly favour music which is both musicially and lyrically -stripped-. So ‘Americana’ tends to be considered good. Punk is good because it’s so primal. ‘Roots’ is good. World music is the ultimate in authenticity. Even EDM is grudingly accepted because it has one simple goal: to get people dancing! But anything that becomes too ‘advanced’ either lyrically or musically is almost automatically suspected of being ‘inauthentic’ when it aspires to be something -more-. It’s ‘over-produced’ and worst of all, ‘pretentious’. So from the critical viewpoint progressive rock was about the least ‘authentic’ music one could imagine, what with its ‘symphonic’ pretensions. Plus, bands like Yes and Rush often had adolescent or just plain nonsensical lyrics and that drove critics apoplectic. (This is a shame because some bands like Gentle Giant and Genesis, could write especially great poetry.) Now lots of bands had silly lyrics, but when Led Zeppelin sings about a ‘tadpole in a jar’ or a ‘bustle in yer hedgerow’ it’s cool because, hey, they’re just having fun. They’re -really- a super-charged blues band. Nudge, nudge. Wink. Wink. In any case, you can’t overestimate how critical loathing affects this whole discussion. When progressive rock fell, it fell harder than other styles because there were a whole lot of people -rooting- for it to fail. And the bands themselves did not disappoint. Most of the big groups had 2–3 albums of good ideas and then just self-destructed. That’s a pretty typical shelf-life for most genres of music, but groups like Emerson, Lake and Palmer became a bit of a double-joke, buying castles and so forth even as their music was in decline. In short, Spinal Tap was as much about ELP as anyone else. Now lots of genres have a period out in the cold. It’s easy to forget that disco was -reviled- for a time. But think about this: Even the name ‘progressive rock’ is long winded. So the nickname is ‘prog’. My guess is that it’s an attempt at being self-deprecating—to say “Hey we don’t take ourselves too seriously, folks.” But it’s hard to take the genre seriously with a nickname that rhymes with ‘frog’. Even the people who are into it seem permanently scared of being labeled as ‘pretentious’. Here’s the unique thing about progressive rock among older genres: Most genres as popular as progressive rock was have periodic resurgences. Motown, Disco, Rockabilly, all make comebacks. Even ‘jam bands’ have big audiences, so it’s not the length of the pieces. But not progressive rock. This partly has to do with the fact that it requires a very high level of skill to do well. And frankly -most- bands that do try to do an updated version are not very good. If you check out retro groups in any other genre they tend to be very good. They re-invent their respective genres. But even hardcore fans agree that almost every new prog band (with one or two very notable exceptions) sound nowhere near as good as ‘the originals’. So the jokes about endlessly pretentious songs just keep be proven true over and over again. The other side of the coin is that audiences these days simply don’t have the attention span for -any- complex music. All the popular musics tend to be ever more simplistic. Jam Band music might seem to be an exception, but it’s largely a hypnotic genre—twenty minute solos over one chord. In summary, Progressive Rock was the product of a unique moment in pop music history when there were audiences for long, complex pieces. It was very popular, but the critics hated it. But there has been a fundamental change in the way we listen to music -and- in our now seemingly permanent desire for more simple forms of music. Both these forces have prevented it from making a comeback. So the jokes have metastasized into what appears to be a permanent state. It’s the genre that’s easy to make fun of because it has no one to defend it in the wider culture. ",
            "date": "Updated July 7, 2016",
            "views": "95",
            "upvotes": " View 60 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Felipe Rodrigues Leone",
                    "user_href": "/profile/Felipe-Rodrigues-Leone-1"
                },
                {
                    "user_id": "Hani Ismail",
                    "user_href": "/profile/Hani-Ismail-8"
                },
                {
                    "user_id": "Mario Finka",
                    "user_href": "/profile/Mario-Finka"
                },
                {
                    "user_id": "Matthew Moran",
                    "user_href": "/profile/Matthew-Moran-29"
                },
                {
                    "user_id": "Marcio Rochwerger",
                    "user_href": "/profile/Marcio-Rochwerger"
                },
                {
                    "user_id": "Luigi De Luca",
                    "user_href": "/profile/Luigi-De-Luca-6"
                },
                {
                    "user_id": "Andrew Dyrda",
                    "user_href": "/profile/Andrew-Dyrda"
                },
                {
                    "user_id": "Jacob Shirley",
                    "user_href": "/profile/Jacob-Shirley-8"
                },
                {
                    "user_id": "Pilthy Phinecone",
                    "user_href": "/profile/Pilthy-Phinecone"
                },
                {
                    "user_id": "Nikolaus Exeli",
                    "user_href": "/profile/Nikolaus-Exeli-1"
                }
            ]
        }
    ]
}