{
    "title": "Why is Taylor Swift no longer popular? - Quora",
    "tags": [
        "Taylor Swift (musician)",
        "Celebrity and Music",
        "Fame and Mass Popularity",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brian Hollweck",
                "href": "/profile/Brian-Hollweck"
            },
            "answer_text": "Taylor Swift has not lost popularity, but the genre hip hop dominates now the single charts, other classical pop stars struggle too. Taylors album reputation sold 2 million copies first week in November 2017. It went on to move 4,5 copies by the end of the year worldwide, became the second best selling album 2017. It went on to become Billboards biggest album of 2018.   Her reputation stadium tour 2018 grossed 345 Million $, this is the third biggest tour by a female artist ever. This made Taylor the highest grossing solo act of the decade. Fans were up to spend hundreds of $ for tickets/merch.  Taylor was named the second best earning woman in music by Forbes in 2018.  Taylor was named the most influental person of Twitter 2018, by posting 13 tweets  Taylor was asked to open the American Music Awards 2018, the Grammys 2019 and the Billboard Awards 2019. She decided to open the AMA‘s and the Billboards. Taylor broke the VEVO record on Youtube by 10 Million views, beating out Ariana Grande.  Taylor was on TIME magazine cover a third time, being named an icon.  Taylor was named the world‘s highest paid celebrity 2019, beating out the second best paid woman in music by 100 Million $  Taylor got the privilege to be featured on Vogue US September cover  Taylor received 3 awards at the 2019 VMA’s including Video of the Year  Taylor won all her 6 AMA nominations, including artist of the decade and artist of the year. She is now the most awarded artist in the shows history.  Taylor was named most influential person on Twitter in 2019  Billboard named Taylor their women of the decade  Billboard released a list of the 10 biggest artists in US history, Taylor placed #8  Taylor became the world‘s highest earning female entertainer of the DECADE (Forbes) Taylor was named the world‘s best-selling artist in the world in 2019  Taylor is doing good on any metrics (earnings/record sales/touring/award shows/covering magazines/social media influence), to think about artists who really lost massive popularity i think about Usher, 50 Cent, Nelly, Avril Lavinge and Kesha. Sources: Billboard, IFPI, Pollstar, Forbes, Rolling Stone, Vogue, TIME ",
            "date": "Updated June 1, 2020",
            "views": "53",
            "upvotes": " View 55 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Theresa Peterson",
                    "user_href": "/profile/Theresa-Peterson-69"
                },
                {
                    "user_id": "Sunil Singh",
                    "user_href": "/profile/Sunil-Singh-1517"
                }
            ]
        }
    ]
}