{
    "title": "Why is copyrighting so important in the music industry? - Quora",
    "tags": [
        "Copyright Law",
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Felix Jansens",
                "href": "/profile/Peter-Felix-Jansens"
            },
            "answer_text": "Entire books have been written about copyrights, the one more boring than the other. What follows is short and sweet… Copyright means income for the artist, whether it is the author of the song or the performer of the song. Sometimes these are the same people, sometimes not. There was a time when a singer would sing on a market and go around with his hat to get some cents after the performance. As there was no such thing as a record people bought as well a copy of the song printed on paper. Because if you wanted to ‘hear’ a song, you either had to go to the market to listen to the performer, or sing it yourself at home. Of course when a song was pretty popular different performers would ‘copy’ it and sing it as well on markets, claiming it was their song and cashing in on the performance and on their own printed version. That was basically the start of copyright, because the original writer of the song obviously wanted a share from the performance done by others. Then radio and records were invented, and instead of singing for one hundred people you were now performing for one million people, and getting copyrights for ‘one million listeners’. Same for records that sell in the millions… Many cents make performers (and writers) millionaires. ",
            "date": "Answered December 30, 2016",
            "views": "834",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Istvan Geza Juhasz",
                    "user_href": "/profile/Istvan-Geza-Juhasz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Istvan Geza Juhasz",
                "href": "/profile/Istvan-Geza-Juhasz"
            },
            "answer_text": "Like others wrote: copyrighting your music will grant your income if anyone wants to use your music. This also “enforces” originality of new creations. Luckily there are more possible melodies than we could ever write (see my calculations here: my answer to Will there be a day when all the melodies are used and no new music can be created anymore?).Before copyright laws the only way a composer could get financial support was to be supported by some royalty, nobility or by the church. J. S. Bach was a church employee, and craved for a laic employer and the (relative) creative freedom that could give him. If today’s copyright laws were implemented those days, and he could write whatever he wanted, who knows what this “crazy scientist of music” could have written?… ",
            "date": "Answered October 21, 2017",
            "views": "16",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sriram Narayanan",
                    "user_href": "/profile/Sriram-Narayanan-19"
                }
            ]
        }
    ]
}