{
    "title": "Why didn't Pink Floyd's Richard Wright ever sing the vocals for 'Time' live? - Quora",
    "tags": [
        "Richard Wright",
        "Pink Floyd (band)",
        "Vocals",
        "Rock Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Laurence Wilson",
                "href": "/profile/Laurence-Wilson-7"
            },
            "answer_text": "Richard Wright always sung the vocal for Time live, going right back to when they were performing it in 1972. Sometimes he would sing behind Dave Gilmour on the Versus and then take over for the choruses. The experience edition of Dark Side of the Moon has a live concert included and you can clearly hear Richard sing on time. In fact he sings a slightly altered lyric to the first chorus. Instead of “Tired of lying in the sunshine…” He sings, “Lying supine in the sunshine…” Richard was so loved for his vocal parts on Time that when he played live with Gilmour, the crowd would cheer when he did his parts. It is true to say that Richard’s vocals diminished on the albums after Dark Side of the Moon. He’s not on Animals or The Wall and was out of the band by The Final Cut and is only on the chorus on Shine on you Crazy Diamond. He doesn’t do much on Momentary Lapse of Reason but he’s making a great contribution in Division Bell. He did vocals live on the end of Dogs. I think what happened was that as Roger emerged as a lead singer, Rick naturally subsided because there still had to e room for Dave, and then Dave subsided too. Until Waters left that is. ",
            "date": "Answered July 11, 2017",
            "views": "16",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jarrah W",
                    "user_href": "/profile/Jarrah-W"
                },
                {
                    "user_id": "Diana Baki",
                    "user_href": "/profile/Diana-Baki-1"
                },
                {
                    "user_id": "Chris Pampling",
                    "user_href": "/profile/Chris-Pampling"
                },
                {
                    "user_id": "Jay Koenig",
                    "user_href": "/profile/Jay-Koenig-3"
                },
                {
                    "user_id": "Steve Chanin",
                    "user_href": "/profile/Steve-Chanin"
                },
                {
                    "user_id": "Wayne Chesser",
                    "user_href": "/profile/Wayne-Chesser"
                },
                {
                    "user_id": "Mike Bowerbank",
                    "user_href": "/profile/Mike-Bowerbank"
                }
            ]
        }
    ]
}