{
    "title": "Why doesn't Thanksgiving have as many specials or songs as Halloween or Christmas? - Quora",
    "tags": [
        "Thanksgiving",
        "Christmas"
    ],
    "response": [
        {
            "author_info": {
                "name": "Elizabeth Penrose",
                "href": "/profile/Elizabeth-Penrose-1"
            },
            "answer_text": "Read about any feast, either religious or royal. This is granted as a solemn occasion. Yes, at Passover an adult hides a piece of unleavened bread: yes, at a Tudor royal suppers they had cakes and confections in comic or magical guises. There are games. But there is something sober in the occasion. There is more solemnity in the historical occasion of the American feast. The Colonists have suffered through a Starving Winter. But in springtime, a few Native Americans come across them. These guests have their own sufferings: kidnapped, they had returned to find the rest of their nation dead from a European-borne epidemic. The Indians teach the Colonists some ways to coax the earth to give them a little more food. After the harvest is set in, the Indians come back. Both sides provide edibles, and they feast and have a shooting party. This is one of the few occasions where one group of Europeans and one group of Native Americans equitably share a table in peace. “Over the River and Through the Wood” isn’t really a Thanksgiving song. The occasion is never mentioned. It mentions a family going back to a dinner with a “pudding” — perhaps Christmas pudding? It’s fun to be scared, as on Halloween; fun to get gifts, as on the secular Christmas. Eating in somebody’s home with your relatives around is, at the best, not that sort of fun. It’s time to be thankful, and perhaps comfortable as well. ",
            "date": "Updated October 13, 2017",
            "views": "75",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Williams",
                    "user_href": "/profile/David-Williams-328"
                }
            ]
        },
        {
            "author_info": {
                "name": "Katie Bekei",
                "href": "/profile/Katie-Bekei"
            },
            "answer_text": "Sure there are songs, but in order to hear them, you'll have to watch the singers perform at half-time during the football game. Most Americans don't necessarily want or need songs during this holiday, after all, they have football games to occupy them, the Macy’s Day Parade to watch, turkey to anaesthesizes them into a coma, all followed by Black Friday, an entire day devoted to buying a Christmas tree and shopping for Christmas. Personally, I think Americans are far too tired to care about songs for Thanksgiving, after all, the stores have had Christmas decorations up since the beginning of November, Christmas carols are already playing on the radio, and they've started to run Christmas movies and cartoons on tv. There simply isn't enough room to jam in any more. However, if you're still hung up on songs, then you may wish to check this site out. Thanksgiving Is the Best Holiday. Here Are 24 Songs to Celebrate it. ",
            "date": "Answered October 9, 2017",
            "views": "75",
            "upvotes": "0"
        }
    ]
}