{
    "title": "Why do some people hate music? - Quora",
    "tags": [
        "Hate",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lindsay Jung",
                "href": "/profile/Lindsay-Jung"
            },
            "answer_text": "Since you've asked me this directly, I will just help you search for the answer on the net. For the next paragraphs, it will not be from my own words but from different sources. I will paste the links. This is a post from The Local website Scientists discover why some of us 'hate' music  Scientists discover why some of us 'hate' music Published: 07 Mar 2014 11:22 GMT+01:00 If music leaves you cold, don't worry: it's perfectly normal and you're completely healthy. That's the finding of a new study headed up by Spanish scientists. Rock, jazz, flamenco, or classical music: for some people it all sounds like so much noise. While most people react to music emotionally, and with an increased heart rate and by sweating more, a small group don't feel a thing. And while a lack of ability to enjoy everyday activities is generally considered a sign of depression, there is nothing wrong with these people. Instead they are suffering from researchers are calling specific musical anhedonia. That's the finding of a new study carried out by a global team of researchers headed up by the University of Barcelona and Catalonia's Bellvitge Institute of Biological Investigation and published in Current Biology. \"We wanted to look at music because its something that exists across cultures and doesn't have a biological function,\" study author Josep Marco told The Local.    \"Music is also something instinctual, and very direct, and it's often assumed that everyone actually likes music. But we wanted to find out if that was actually true.\"  To test this idea, researchers first used a web questionnaire to identify people who might have this lack of feeling for music. Study participants were then asked to listen to music chosen by other university students. Among the pieces of music chosen were Puccini's Nessun Dorma, the Four Seasons of Vivaldi, and the theme song from the 1992 Barcelona Olympics. Pavarotti sings the aria Nessun Dorma from the Puccini opera Turandot While listening, volunteers had to press a button depending on whether they didn't like the piece of music much, they liked it a lot, or it left them cold.  \"We found that some people didn't respond at all to the music,\" Marco said. Researchers then looked at whether people who didn't respond to music emotionally had a problem with their neural reward system. But an experiment which measured excitement about earning money showed these 'non-musical' people had an increased heart rate and sweated more. In other words they were healthy. The findings suggest music has its own pathways in the rewards system, the scientists said. \"The identification of these individuals could be very important to understanding the neural basis of music — that is, to understand how a set of notes (is) translated into emotions,\" Marco said in a separate statement. Some 1 to 5 percent of people suffer from specific musical anhedonia, the researchers estimate. \"We've had a lot of emails from people since the study was published saying 'I've never liked music, and people have always told me it was strange,'\" Marco told The Local. \"But this is not an illness, and it's not something that needs to be 'fixed.'\" And this is a post from University Herald Some People Genuinely Hate Music, Study Finds  A latest University of Barcelona study has found that not everybody turns to music for pleasure. Researchers have described the new condition as musical anhedonia - the inability to experience pleasure from music. \"The identification of these individuals could be very important to understanding the neural basis of music-that is, to understand how a set of notes [is] translated into emotions,\" Researchers Josep Marco-Pallarés said in a press release. Listening to music helps relieve stress, anxiety and depression. The calming power of music has relaxing effect on minds and bodies, and a beneficial effect on physiological functions like slowing the pulse and heart rate, lowering blood pressure, and decreasing the levels of stress hormones. Previous studies found little evidence about this form of anhedonia. Participants reported a comparatively low sensitivity to music related rewards than other forms. Researchers concluded that there may be several explanations for low music sensitivities. Some people dislike music as they have difficulty perceiving it, a condition called amusia. Or they might simply have answered the questions incorrectly. For the current study, the experts divided participants into three groups of 10 based on their appreciation for music - high, average, and low. The participants took part in two different experiments - a music task, where they reported their degrees of pleasure while listening to music; and a monetary incentive delay task, where they were asked to react quickly to a target to win money. The scientists observed that during both the experiments, there was an increased activity in the reward-related neural circuits of the participants' brains and a spike in dopamine production, the chemical that makes one feel good. During the experiments, the researchers observed changes in skin conductance response and heart rate as physiologic indicators of emotion. Despite normal musical perception capacities, some normal people were found to display no autonomic response to sound and music. However, the very same group of people responded well in the second experiment or to the monetary rewards. \"The idea that people can be sensitive to one type of reward and not to another suggests that there might be different ways to access the reward system and that, for each person, some ways might be more effective than others,\" Marco-Pallarés said. The finding is published in the Cell Press journal Current Biology. From Science Daily http://www.sciencedaily.com/releases/2014/03/140306130411.htm  Some people really just don't like music Date: March 6, 2014 Source: Cell Press Summary: It is often said that music is a universal language. However, a new report finds that music doesn't speak to everyone. There are people who are perfectly able to experience pleasure in other ways who simply don't get music in the way the rest of us do. Share: Annoying noise (stock image). Researchers have described a new condition called specific musical anhedonia -- the specific inability to experience pleasure from music. Credit: © Alexey Laputin / Fotolia It is often said that music is a universal language. However, a new report in the Cell Press journal Current Biology on March 6 finds that music doesn't speak to everyone. There are people who are perfectly able to experience pleasure in other ways who simply don't get music in the way the rest of us do. The researchers refer to this newly described condition as specific musical anhedonia -- in other words, the specific inability to experience pleasure from music. \"The identification of these individuals could be very important to understanding the neural basis of music -- that is, to understand how a set of notes [is] translated into emotions,\" says Josep Marco-Pallarés of the University of Barcelona. The researchers previously found hints about this form of anhedonia after they developed a questionnaire to evaluate individual differences in musical reward. Those evaluations found some individuals who reported low sensitivity to music but average sensitivity to other kinds of reward. But multiple explanations are possible for these low music sensitivities. For instance, some people might seem to dislike music because they have trouble perceiving it, a condition called amusia. Or maybe some people simply answered the questions inaccurately. In the current study, the research team decided to look more closely at three groups of ten people, with each group consisting of participants with high pleasure ratings in response to music, average pleasure ratings in response to music, or low sensitivity to musical reward, respectively. Participants in the three groups were chosen based on their comparable overall sensitivity to other types of rewards and their ability to perceive music. Subjects participated in two different experiments: a music task, in which they had to rate the degree of pleasure they were experiencing while listening to pleasant music, and a monetary incentive delay task, in which participants had to respond quickly to a target in order to win or avoid losing real money. Both tasks have been shown to engage reward-related neural circuits and produce a rush of dopamine. Meanwhile, the researchers recorded changes of skin conductance response and heart rate as physiologic indicators of emotion. The results were clear: some otherwise healthy and happy people do not enjoy music and show no autonomic responses to its sound, despite normal musical perception capacities. Those people do respond to monetary rewards, which shows that low sensitivity to music isn't tied to some global abnormality of the reward network. The findings might lead to new understandings of the reward system, with implications for pathologies including addiction and affective disorders, the researchers say. \"The idea that people can be sensitive to one type of reward and not to another suggests that there might be different ways to access the reward system and that, for each person, some ways might be more effective than others,\" Marco-Pallarés says. Wondering where you fall on the music reward spectrum? Complete the questionnaire and find out here: http://www.brainvitge.org/bmrq.php. Story Source: The above post is reprinted from materials provided by Cell Press. Note: Materials may be edited for content and length. Journal Reference: Ernest Mas-Herrero, Robert J. Zatorre, Antoni Rodriguez-Fornells, Josep Marco-Pallarés. Dissociation between Musical and Monetary Reward Responses in Specific Musical Anhedonia. Current Biology, 06 March 2014 DOI: 10.1016/j.cub.2014.01.068 Lastly, this is from The Verge Bad brains: some people are physically incapable of enjoying music  Bad brains: some people are physically incapable of enjoying music Research shows that people who say \"I don't like music\" aren't just trying to sound cool By Arielle Duhaime-Ross  on March 6, 2014 12:00 pm  Email @ArielleDRoss  For most people, the mere suggestion that a favorite song fails to evoke an emotional response in another human being sounds preposterous. Sure, that person might not like that song as much as you do, but they'll definitely feel something — right? Not necessarily, says Josep Marco-Pallerés, a cognitive neuroscientist at the University of Barcelona and lead author of a new study that explores why some people feel indifferent to music. \"Music isn't rewarding for them, even though other kinds of rewards, like money, are,\" he says. \"It just doesn't affect them.\" SOME PEOPLE DON'T GET A KICK OUT OF LISTENING TO MUSIC To find out why, researchers recruited 30 university students, each of whom had been identified as very sensitive to music, moderately sensitive, or not sensitive at all thanks to a questionnaire. Researchers also made sure that the study's participants weren't depressed, tone-deaf, hearing-impaired, or otherwise unable to understand music — all factors that would have dampened their pleasure response. Then, researchers monitored the student's heart rates and sweat levels during listening sessions involving familiar pieces of music (previous studies have shown that people react more strongly to music they know). \"We asked them to bring music from home that they like,\" Marco-Pallerés recalls, \"and most of them had problems doing that.\" Those who were indifferent to music either ended up bringing a smaller number of recordings — some didn't own music at all — or had to borrow music from a family member. THEIR HEART RATE DIDN'T INCREASE WITH EACH CRESCENDO The study's results, published today in Current Biology, are surprising. Although these participants were perfectly capable of perceiving when a tune was sad or happy, they didn't show physical or emotional reaction. They didn't shiver if a singer hit a high note, and their heart rate didn't increase with each crescendo. But when asked to play a game involving a monetary reward, those who were indifferent to music reacted just like everyone else: the thought of winning even a small amount of money was enough to make their hearts race. The results were unchanged a year later, when 26 of the students took the test again. But we shouldn't mistake an indifference to music for dislike, Marco-Pallarés says. When students were asked to describe their affinity for music on a scale of one to ten, for example, those who were indifferent usually answered with the number five — the mathematical equivalent of a shrug. Researchers even have a name for the condition: \"specific musical anhedonia.\" The term anhedonia is used by psychologists to describe a person's inability to derive pleasure from activities that most find enjoyable. But as the monetary-reward experiment indicates, this specific anhedonia only affects music perception. \"Now that we know that there are people with specific musical anhedonia,\" Marco-Pallerés says, \"we want to know the neural bases that might explain [it].\" The research team plans to conduct a new experiment using functional magnetic resonance imaging (fMRI) to study how the brain's reward system differs in these people. HARD TO EXPLAIN WHY WE LIKE MUSIC IN THE FIRST PLACE This is first experiment to demonstrate that anhedonia can be specific to a single form of reward, so many questions remain unanswered. There might be other forms of specific anhedonia that we don't know about yet, Marco-Pallerés says. But the fact that the first form to be identified is related to music is interesting in and of itself, he says, because from an evolutionary standpoint, it's hard to explain why we like music in the first place. \"Music doesn't give us access to biologically relevant advantages,\" he says, the way food or money does. \"The emotions are the key point in this reward.\" So, from a survival standpoint, there's no disadvantage to being indifferent to music. As Marco-Pallerés puts it, you just end up with \"people who don't understand why anyone would pay to go to a concert.\" SOURCECURRENT BIOLOGY IMAGE CREDIT WILLIAM BRAWLEY / FLICKR ",
            "date": "Answered December 7, 2015",
            "views": "42",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rainer Bögle",
                    "user_href": "/profile/Rainer-Bögle"
                },
                {
                    "user_id": "Evelyn Medrano (에벨 린 메드 라노)",
                    "user_href": "/profile/Evelyn-Medrano-에벨-린-메드-라노-イヴリンメドラーノ"
                },
                {
                    "user_id": "Jasper Abyss",
                    "user_href": "/profile/Jasper-Abyss"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Joey-Of-Texel"
                },
                {
                    "user_id": "Dana Weiszman",
                    "user_href": "/profile/Dana-Weiszman"
                },
                {
                    "user_id": "Anish Kumar",
                    "user_href": "/profile/Anish-Kumar-330"
                }
            ]
        },
        {
            "author_info": {
                "name": "Courtney Caldwell",
                "href": "/profile/Courtney-Caldwell-17"
            },
            "answer_text": "Original Question: Why do people hate music? I'm not sure anyone outright hates music, but people will say they hate a TYPE of music. This could be for any number of reasons: It's painful for them to listen to it. Many people have sound sensitivities that can make some music painful, especially high pitched sounds. My mom cant do music with deep repetitive bass because it hurts her chest. Some people at concerts have had lungs collapse due to the bass. And no, your ears ringing after a concert does not mean the music was good, it just means it was loud and causing you ear damage. They just don't like how it sounds. This is how it is for me with most modern Hip Hop/Rap. My ears/brain don't react well to the style and it immediately causes irritation when I hear more than one song. But I can still tolerate and even like some of these kinds of songs, I actually like Low Life - Future ft. The Weeknd and one of my favorite songs is White Walls by Macklemore. Us vs. Them. This is a reasoning I've heard a lot, especially from people who love one genre but then completely shun the other just because it's different/a bastardized version/not REAL music, etc etc. You mostly hear it with people (re: teenagers establishing their identity) who shun most \"popular\" music and only feel like the most obscure genre of metal or whatever is the only music worth listening too, and if you don't agree you're just a tasteless sheep. I was a teen who bought into this silly mindset at one point, so I'm not hating on teens! There's also people who hate a genre, such as country, even though they've only heard one heavily pop-ified Taylor Swift song, and assume it defines the entire genre. ",
            "date": "Answered February 6, 2018",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Evelyn Medrano (에벨 린 메드 라노)",
                    "user_href": "/profile/Evelyn-Medrano-에벨-린-메드-라노-イヴリンメドラーノ"
                },
                {
                    "user_id": "Jasper Abyss",
                    "user_href": "/profile/Jasper-Abyss"
                }
            ]
        }
    ]
}