{
    "title": "Why did the movie ‘Laila Majnu’ flop? - Quora",
    "tags": [
        "Movie Business and Industry",
        "Bollywood"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shreyasi Rao",
                "href": "/profile/Shreyasi-Rao"
            },
            "answer_text": "Ok. So a film like laila majnu with a new age adaptation has to be absolutely convincing as a story so that the audience can go ahead from “this doesn't happen in real life” to actually contemplating the higher philosophy. I believe that there is nothing that an audience cannot be convinced of. So if you want to show madness in love I will believe it if you try hard enough. While this is an analysis after watching the film once the shoot, edit and the entire film was put together. But while you are making this tough a film it is applaudable and a brilliant effort. But here's what I would've wanted different. This story had some horrible villains, looking at their caliber as a team to bring to life majnu. The family rivalry is very lukewarm. You could've made Laila's father more loving and relatable so that whenever Laila takes her father's side it makes sense. The husband is just a duffer and absolute evil, he should've had atleast some virtues and moral convictions to be an antagonist to this particular, very powerful, modern day majnu. This hero needs more obstacles than blaming on circumstances to go mad. He is rich, he has friends, his father dies and this isn't life altering like for say Haider. It's not enough. Just marrying off Laila and the turning point of madness being his wait for her divorce. Everything gets resolved so easily and it is handed to Majnu in a plate which he refuses and that doesn't make sense. This hero in particular needed to be driven to madness by the people around him along with the loss of Laila which wasnt done. They convinced us about majnu going mad but they didn't do much to show us why, except losing Laila and that is where I feel the movie fell short. ",
            "date": "Answered July 17, 2020",
            "views": "734",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Afreen Ansari",
                    "user_href": "/profile/Afreen-Ansari-116"
                },
                {
                    "user_id": "Rupa Kar",
                    "user_href": "/profile/Rupa-Kar-14"
                },
                {
                    "user_id": "Deeksha Bhattacharyya",
                    "user_href": "/profile/Deeksha-Bhattacharyya"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neenu Singh",
                "href": "/profile/Neenu-Singh-4"
            },
            "answer_text": "There are no masala scenes or songs in this movie and the stars of this film are not that popular either, these are the only two reasons. You can come up with flaws in the storyline or whatever but i've seen much worse earn much more than what they genuinely deserve. I would give this movie a solid 10/10 and if u haven't watched it yet i would 100% recommend that u watch it on zee5. This movie is so pure and true to its root and its storyline. I've read some reviews talking about how the love sequence bw laila and kaes should've been better but imo love is pretty self explainatory and whatever length of the film is dedicated to showing their love works well for me, love is shown in almost each and every bollywood movie and anything more than that would've taken time away from something that was unique to this movie i. e. the way this movie explained the sorrow of losing love. I have never experienced that much pain through a movie before. The way kais's loss is shown, his depression and him descending into a state of dissociation is depicted is outstanding. It actually aches my heart to see him lose his confidence and his innocent carelessness after losing laila. What's even better than all that is how the movie shows that even after everything was going to be fine and all that kaes had to do was wait a little longer, he decided to find his happiness in his hallucination of laila, away from the dunia and its duniadaari. There are a lot of songs in this movie but i am not complaining about that either. Each and every song is beautiful and iconic. Perfect for this folklore classic lovestory. They do not take away anything from this movie and if anything, the songs explain the situation or the dilemma the characters are facing while the actors remain silent but act out their character's emotions amazingly well. I love how other than that 4-5 line monologue of kaes, no character talks about their pain but even then u can understand very well what they are going through, and thats good acting. I would always regret not watching this movie when it first came out in the theatres. But atleast now we can appreciate it. ",
            "date": "Answered August 30, 2020",
            "views": "108",
            "upvotes": "0"
        }
    ]
}