{
    "title": "Why do Google Play Music and YouTube music exist when they offer the same service (music)? - Quora",
    "tags": [
        "Google Play Music",
        "Google Play"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ivanov Moreno",
                "href": "/profile/Ivanov-Moreno"
            },
            "answer_text": "The original service that YouTube provided was personal videos. Then Google bought them. Then people began to upload their own music before music streaming services like Google Play Music started, and actually this was a catalyst for those services to pop. Also people started uploading their own ripped from TV music videos. Google/YT spent years shutting them down or blocking them, both music only and music vids. Remember when YT used to silence people’s uploaded videos just because sometime into them was a 5–10 second piece of a known music piece playing in the background?. Well, that was generating so much bad blood and bad publicity so they stopped doing that and began to seek new approaches. VEVO (HQ music vids) appeared on YT, and Google Play Music started to provide its streaming music service. But now we have the thousands of music tracks on YT that people uploaded in those past years as video, and Google won’t delete them, because I guess it’s too much work, and there’s no point in doing so because their music playing licenses are already sorted out. And now that streaming music services exist, the existence of all those music-tracks-uploaded-as-videos also serve almost no purpose. Google Play Music only does music streaming, not music videos. The same as the rest of streaming music services. But your subscription to GPM gives you access to YT Red, which is YT without ads. Nobody else gives you music vids included in your subscription btw. So both services cover different bases. YouTube has no competition anywhere else for music videos nowadays, and in my opinion this allows them to run Google Play Music, since I highly doubt that they generate much revenue on it. Why don’t they merge the two? Because, as I already mentioned, they cover different bases. People still like to watch music videos, I can attest that. Also, you can’t run the sound only and expect a flawless music experience if you use music vids because many music videos are like created like cinematic shorts, so they have noise, silences, interludes, intros, outros, etc. that wouldn’t make sense if you were only listening to them instead of watching them. ",
            "date": "Answered March 20, 2018",
            "views": "481",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jessica Annan",
                    "user_href": "/profile/Jessica-Annan-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bria Fazio",
                "href": "/profile/Bria-Fazio-1"
            },
            "answer_text": "YouTube compiled a list of the music you listen to most frequently your favorite artist your favorite songs Etc and sometimes they will do remakes of Persians with new videos included. It could be positive subliminal messaging but sometimes I hear a metallic almost like percussion in some of the newer versions that I have listen to but I'm not sure ",
            "date": "Answered March 31, 2018",
            "views": "142",
            "upvotes": "0"
        }
    ]
}