{
    "title": "Why do people like to sing in karaoke? - Quora",
    "tags": [
        "Karaoke",
        "Singing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sydney Bruce",
                "href": "/profile/Sydney-Bruce-10"
            },
            "answer_text": "I love to sing karaoke, and I'm told I'm quite good at it. I think people like to sing karaoke because when you hear your favorite songs normally you tend to learn the words and sing along with them. Maybe you can't sing on that big old stage but I'll tell you what, get up in front of one of those little monitors and belt out Bobby McGee and then you tell me if you don't feel Janis Joplin in your heart and your soul door standing somewhere going hey girl thanks for remembering. I like it because it just feels good. And for those of you that are worried about what anybody else thinks, get over it. I admire anyone that can get up on a stage and seeing whether they seem good or bad, I just think it's awesome that they sing from the heart. ",
            "date": "Answered March 9, 2019",
            "views": "232",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hank Shepherd",
                    "user_href": "/profile/Hank-Shepherd-1"
                },
                {
                    "user_id": "Gustavo Rodrigues",
                    "user_href": "/profile/Gustavo-Rodrigues-59"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amy Bowersox",
                "href": "/profile/Amy-Bowersox"
            },
            "answer_text": "I sing karaoke because I enjoy it, first and foremost. I’m a performer at heart, and I like to have an outlet to show my skills. It also helps me socialize and meet new people; I have met quite a few this way. On a more personal note, singing along with female vocalists on the radio is one way I practiced my feminine voice prior to my transition. Singing karaoke is just an extension of that. ",
            "date": "Answered July 14, 2020",
            "views": "570",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andrew Hagen",
                    "user_href": "/profile/Andrew-Hagen-20"
                },
                {
                    "user_id": "Karen Marie Shelton",
                    "user_href": "/profile/Karen-Marie-Shelton"
                }
            ]
        }
    ]
}