{
    "title": "Why is the One Piece anime so badly done? - Quora",
    "tags": [
        "One Piece (creative franchise)",
        "Manga"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thompson Doughboy",
                "href": "/profile/Thompson-Doughboy"
            },
            "answer_text": "To clarify, One Piece itself is a fantastic series. It has a variety of compelling characters, and a world full of depth. However I think the anime sucks. It’s a terrible adaptation in my opinion. The animation 90% of the time plain sucks. The only things that seem to move are the mouths. Animation is a very timely, costly process. However there is no excuse for its absolutely lackluster animation. Every episode covers on chapter of the manga. ONE CHAPTER. A chapter in manga takes about 10 minutes or less to read. Depending of course on how fast you read. But still, you’re essentially experiencing the story at twice the speed if you read the manga. Plus filler, (although not much filler exists). It takes forever to get through arcs. Especially because I don’t really have a lot of time on my hands to begin with. Lastly, most of the soundtrack blows. It’s all of this 90s synth, which doesn’t match the setting whatsoever. There are some good things about it, but overall I think the ratio weighs in the negative’s favor. The manga I think is far better. ",
            "date": "Answered November 7, 2019",
            "views": "17",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gary Whittaker",
                    "user_href": "/profile/Gary-Whittaker-6"
                },
                {
                    "user_id": "Teja Akella",
                    "user_href": "/profile/Teja-Akella"
                },
                {
                    "user_id": "Damien Webb",
                    "user_href": "/profile/Damien-Webb-8"
                },
                {
                    "user_id": "Alean Zhang",
                    "user_href": "/profile/Alean-Zhang"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rohit Kumar",
                "href": "/profile/Rohit-Kumar-3357"
            },
            "answer_text": "It's trash, i mean who would watch a series in which the protagonist is a rubber man. What fun would it be anyway? That’s what I used to think before watching one piece. Initially i had only heard about it and watched a few anime clips but when I seriously had almost nothing to watch I decided to spend my time watching it .I started from episode 1 before I knew was on episode 10, days kept on passing by and so were the episodes and before I knew I got addicted to watching it but soon after reaching a certain point I decided to take break as the story started cooling down, it was around episode 250 something. After 2 weeks I decided to give it another chance and to my surprise the story suddenly started picking up the pace and I kept on watching it and caught up with the anime. The journey was totally like an emotional rollercoaster their were times my head was boiling with anger just to hit character who was talking trash about the Luffy (protagonist )and their were many other similar incidents(obviously i won’t spoil) their were emotional scenes as well and I felt almost like throbbing after watching them .The action and fighting scenes in the anime is truly amazing (something which i was not expecting at all). In short One Piece is one of the best anime i’ve watched and believe me i’ve watched too many so you can trust me on this one. Hope this might clear your misunderstanding. ",
            "date": "Updated June 30, 2020",
            "views": "985",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Codrin Popa",
                    "user_href": "/profile/Codrin-Popa-4"
                },
                {
                    "user_id": "Mark Ahnfeldt Dissing",
                    "user_href": "/profile/Mark-Ahnfeldt-Dissing"
                }
            ]
        }
    ]
}