{
    "title": "Why are so many bass players in bands also the keyboard players? - Quora",
    "tags": [
        "Bass Guitar",
        "Keyboards (instrument)",
        "Bands (music)",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert L Gerrard",
                "href": "/profile/Robert-L-Gerrard"
            },
            "answer_text": "Why are so many bass players in bands also the keyboard players? To play a keyboard instrument, you generally go through a fairly complex and painful period of learning theory. Not just for reading music, but for understanding the structure of chords on the keyboard. WHen playing, keyboard players notice that the keynote of the chord isn’t always the lowest note, and that the bass notes follow a line that is quite melodic… it’s as interesting as the top line melody, and sometimes it IS the melody. This is very simplified as an explanation, but the fact is that having the experience outlines above, a keyboard player is very aware of the need for a good bass line, and that the bass not defines the harmony, and the feel of the whole piece can be altered by changing the bass line. This has the potential to make a keyboard player a capable bassist as well. But no, it isn’t a “given” that a keyboard player will be any good on bass. I know and work with some great bass players. They don’t have keyboard skills beyond basic chord playing, but they really know how to use their own instrument to the best effect. I think your question indicates that you haven’t taken a large enough sample of either keyboards ists or bassists. They’re usually specialists in their field, but as suggested above, keyboard players do understand how to make a good bass line - even if they never pick up a bass. The best bass lines though? They all come from specialist players. ",
            "date": "Answered April 1, 2019",
            "views": "470",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daisy Hudson",
                    "user_href": "/profile/Daisy-Hudson-3"
                },
                {
                    "user_id": "Jean Prate",
                    "user_href": "/profile/Jean-Prate"
                },
                {
                    "user_id": "Velony Anzaya",
                    "user_href": "/profile/Velony-Anzaya"
                },
                {
                    "user_id": "Paul Bennett",
                    "user_href": "/profile/Paul-Bennett-215"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dean Mathieson",
                "href": "/profile/Dean-Mathieson-5"
            },
            "answer_text": "I don't think that is generally true, but is at least more true in trios. I am a bassist/keyboardist, and the reason I like the combination is I see the guitar as the central instrument. I'd prefer the guitar always having a part, and the keyboards sometimes supporting the song. Otherwise, the keyboards would replace the guitar. Another minor difference - I don't use a pick, so transitioning to keys and back to bass is really smooth. If I were alternating between guitar and keys, each time I'd need a plan for what to do with the pick. If you need to transition quickly, this can be a problem. ",
            "date": "Answered August 23, 2020",
            "views": "45",
            "upvotes": "0"
        }
    ]
}