{
    "title": "Why are there more white rock singers? - Quora",
    "tags": [
        "Rock Singers and Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Jordan",
                "href": "/profile/Robert-Jordan-82"
            },
            "answer_text": "I’m going to guess Rock appeals more to whites than it does other ethnic groups? It’s actually kind of ironic since rock is an offshoot of the black mans blues (which was a form of slave music), and Classical on the other side. Rock really is a hybrid, and will some day get lost in all the labels of genres that are floating around. If you look around, there are more white country singers as well, there are possibly more white opera singers too. Do you see where this is headed? Where does Rock n roll not exist? Rock exist in predominantly white countries, much like country and Opera do. Chances are people in the Congo don’t really consider this question too much, likewise there are roughly a million Indians in the Amazon rainforest who don’t give much thought to this question. There are quite a few folks of Middle Eastern descent who don’t consider this question either. Funny thing though, rock isn’t just for white folks, K-pop is becoming a rage in South Korea, I would guess it will eventually make it’s way to China. Iron Maiden has a huge legion of fans in Central and South America(actually across the world) along with many other rock bands. The Japanese actually introduced the world to Japanese heavy metal(Loud). I can also think of a few Black rock n rollers from Mother’s Finest to Living Colour. I’m wondering if your question should’ve been more along the lines of why does Rock n Roll have such a wide appeal? Thanks! Robert ",
            "date": "Answered January 11, 2018",
            "views": "277",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gary Marra",
                    "user_href": "/profile/Gary-Marra"
                },
                {
                    "user_id": "Derek Frost (フブキ)",
                    "user_href": "/profile/Derek-Frost-フブキ"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Virgil",
                "href": "/profile/David-Virgil-1"
            },
            "answer_text": "Why are there more black soul singers? What is interesting is the fact that back in the 50’s it was black artist that really pioneered Rock and Roll but back then black music was segregated and white artist more or less ripped off black artist and performed their own versions of the songs. In the 60’s there was still segregation of music and the Beatles pretty much change the face of music by refining it and creating music that wasn’t pop and wasn’t Rock and Roll but instead a blend of many genres. I suppose it’s possible that what started out as Blues and black Rock and Roll went off into a different direction with people like Smokey Robinson and Marvin Gaye creating what would become known as the Motown sound. That would develop into the R&B music most closely associated with Black artist. I think that music is somewhat of a cultural thing and as it develops it’s not uncommon for what eventually turns into as is the case with the Rock music of the 60’s-present simply was not culturally relevant to black artist or at least most black artist because you have black artist like Hendrix that combined blues and rock to achieve something truly amazing. Lenny Kravitz followed Hendrix in really making an impact in what is considered a predominately white genre. To summarize my answer I believe culturally rock music did appeal to black artist as much as R&B music. ",
            "date": "Answered January 11, 2018",
            "views": "144",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Karen Carmichael",
                    "user_href": "/profile/Karen-Carmichael-7"
                }
            ]
        }
    ]
}