{
    "title": "Why is karaoke considered to be fun? - Quora",
    "tags": [
        "Karaoke",
        "Singing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Denny Mack",
                "href": "/profile/Denny-Mack-3"
            },
            "answer_text": "you stumped me, for this question results in a lot of different answers. There are a lot of people that hate Karaoke and then there are several people out there that love it. There are some who can really sing and belt them out, some that are descent and then there are those who can't care a tune to save their lives. But the all have smiles on their face and having fun. Rule one in Karaoke regardless of the performance you still clap and applaud, for it is not easy to get up in front of strangers and sing. So if you want a physiological point of view on what makes Karaoke fun the go to the following link and read the article.https://www.thecut.com/2018/04/a-psychological-explanation-for-the-appeal-of-karaoke.htmlor if you want to know a good reason to do Karaoke then go to this link and read a good article on why South Korea and Japan use Karaoke to relieve stress. https://makingmusicmag.com/karaoke/Enjoy the articles I found them interesting to say the least ",
            "date": "Answered January 26, 2019",
            "views": "449",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Amy Bowersox",
                    "user_href": "/profile/Amy-Bowersox"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shafi K",
                "href": "/profile/Shafi-K-19"
            },
            "answer_text": "Because it is made for the people to enjoy and remove frustration by singing the way they want. This they can do that in complete isolation away from anybody or sing in front of audience. ",
            "date": "Answered May 24, 2020",
            "views": "79",
            "upvotes": "0"
        }
    ]
}