{
    "title": "Why are we allowed to use copyrighted music on Instagram videos but not YouTube? - Quora",
    "tags": [
        "Instagram Video",
        "Music Videos",
        "Copyright Infringement",
        "Copyright Law",
        "Online Video",
        "Instagram (product)",
        "Videos",
        "YouTube Videos",
        "YouTube"
    ],
    "response": [
        {
            "author_info": {
                "name": "Todd Gardiner",
                "href": "/profile/Todd-Gardiner"
            },
            "answer_text": "You are really asking “why are we not punished for using copyrighted music on Instagram?”, because let me tell you right now: using someone else’s content without permission is illegal copyright infringement. Instagram does not have an upload scanner like YouTube does. So your law breaking is not detected until weeks or months later. That doesn’t mean that Instagram allows it, just that enforcement of the law by the copyright holder is burdensome and takes a while. But YouTube has previously been sued for BIG MONEY for copyright infringement. So they not only do the minimum needed, by abiding by DMCA takedown requests. They also created an upload scanner to try and block copyright infringing material before it is even displayed to other users. And, with that scanner, they were able to make some money for themselves. They made a deal with those recording artists that were on the fence about allowing their music to be used by strangers: If we detect your music, you give us permission to play it in a video and we will give you ad revenue. You can still take down the video if the rest of the content offends you. So many recording artists actually allow their music in random videos on YouTube. YouTube then puts ads on these videos and the uploaders cannot monetize them. The hard part for you, of course, is that there is no list of which songs you can use. You are playing Russian Roulette—will my video get ads or will it just be blocked and I get slapped with a copyright strike? But if you can figure out which songs are whitelisted, you can use them in your videos, no problem. ",
            "date": "Answered February 8, 2019",
            "views": "212",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Selim Mete",
                    "user_href": "/profile/Selim-Mete"
                },
                {
                    "user_id": "Janine Uys Erasmus",
                    "user_href": "/profile/Janine-Uys-Erasmus"
                },
                {
                    "user_id": "Staffan Vilcans",
                    "user_href": "/profile/Staffan-Vilcans"
                },
                {
                    "user_id": "Aimee Diaz",
                    "user_href": "/profile/Aimee-Diaz-25"
                },
                {
                    "user_id": "Sarah Ichkhanian",
                    "user_href": "/profile/Sarah-Ichkhanian"
                },
                {
                    "user_id": "Morgan Rydberg",
                    "user_href": "/profile/Morgan-Rydberg-3"
                },
                {
                    "user_id": "Ben Adams",
                    "user_href": "/profile/Ben-Adams-232"
                },
                {
                    "user_id": "Théo Hega",
                    "user_href": "/profile/Théo-Hega"
                },
                {
                    "user_id": "Thomas P. Buehner",
                    "user_href": "/profile/Thomas-P-Buehner"
                },
                {
                    "user_id": "Lawrence Sumiller",
                    "user_href": "/profile/Lawrence-Sumiller"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harry Spencer",
                "href": "/profile/Harry-Spencer-12"
            },
            "answer_text": "I believe you’re referring to being able to use music in your Instagram story which no one else here has covered. As someone who produces and distributes music, I can say that record labels and distribution companies, actually distribute their music to Instagram. I am an independent artist and I use DistroKid to distribute my music to Spotify, Apple Music, etc. I am always asked whether I want to distribute my stuff to Instagram for people to use there.I can only imagine that Instagram pay some sort of fee to these distribution companies and record labels who choose to do this. YouTube on the other hand, does not pay record labels and distributors to use their music and so it is up to the content creator to clear the rights to a song if they want to use it. ",
            "date": "Answered January 8, 2020",
            "views": "56",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jasmin Brownell",
                    "user_href": "/profile/Jasmin-Brownell"
                }
            ]
        }
    ]
}