{
    "title": "Why does tremolo get used interchangeably with vibrato? - Quora",
    "tags": [
        "Guitarists"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christopher Pellerito",
                "href": "/profile/Christopher-Pellerito"
            },
            "answer_text": "You will occasionally hear guitar shop heroes say “why is [the whammy bar] called a tremolo when it should really be called a vibrato?” Heed not these blowhards, and do not join their ranks. Music existed for centuries before guitars did, and the Italian words tremolo and vibrato have been in use since the Renaissance. Vibrato refers to fluctuation of pitch on an instrument that produces continuous pitches (e.g. a piano cannot produce vibrato but a fretless violin can.) Tremolo comes from the Italian word for “tremble” and can refer to a wide variety of effects (rapid fluctuation of volume, or rapid, repeated plucking of a single pitch, or trilling between discrete pitches.) In the right hands, a whammy bar-equipped guitar could certainly produce a tremolo effect. Listen to say, Jeff Beck’s “’Cause We’ve Ended as Lovers” from Blow by Blow and tell me whether the effect he produces with his whammy-equipped Stratocaster is “trembling” i.e. tremolo. What about a Floyd Rose or Kahler style whammy that can produce Van Halen style “dive bombs?” That’s not vibrato OR tremolo; it’s more like portamento. Should it be called a portamento bar? ",
            "date": "Answered September 23, 2020",
            "views": "92",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bryant Walley",
                    "user_href": "/profile/Bryant-Walley"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Serhant-Hedkins"
                },
                {
                    "user_id": "Mohammed Arafat Reza",
                    "user_href": "/profile/Mohammed-Arafat-Reza-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Grossman",
                "href": "/profile/Joseph-Grossman-7"
            },
            "answer_text": "By knowledgeable musicians, it generally does not. In contemporary usage: Tremolo= same note again and again quickly in succession. Vibrato = “wobble” in pitch of a note that emulates sound of human voice. Reason the two get confused is because Leo Fender (who, by the way, didn’t actually play guitar) decided to call the vibrato arm on his guitar a “tremolo”. Name stuck. Tremolo:  Vibrato (Eric Clapton, style):  ",
            "date": "Answered September 23, 2020",
            "views": "29",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rik Elswit",
                    "user_href": "/profile/Rik-Elswit"
                },
                {
                    "user_id": "Kevin Miller",
                    "user_href": "/profile/Kevin-Miller-141"
                },
                {
                    "user_id": "Eric Monroe",
                    "user_href": "/profile/Eric-Monroe-11"
                },
                {
                    "user_id": "Divyesh Desigar",
                    "user_href": "/profile/Divyesh-Desigar"
                },
                {
                    "user_id": "Helgi Briem",
                    "user_href": "/profile/Helgi-Briem"
                },
                {
                    "user_id": "Paul Larsen",
                    "user_href": "/profile/Paul-Larsen-14"
                },
                {
                    "user_id": "Ozzy Fyfe",
                    "user_href": "/profile/Ozzy-Fyfe"
                },
                {
                    "user_id": "Richard Morris",
                    "user_href": "/profile/Richard-Morris-158"
                },
                {
                    "user_id": "Tony Baron",
                    "user_href": "/profile/Tony-Baron-2"
                },
                {
                    "user_id": "Mario Stradale",
                    "user_href": "/profile/Mario-Stradale"
                }
            ]
        }
    ]
}