{
    "title": "Why is it called a wake when someone dies? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Marcelle Lapointe",
                "href": "/profile/Marcelle-Lapointe"
            },
            "answer_text": "Because, originally, friends and family spent the night and often the next day surrounding the body and the funeral was immediately after that because, with no real capacity to preserve bodies, they had to be buried fast. It is called a wake because you stayed awake in order to be with the dead one. Word with the same meaning in French. (It is called ‘veiller au corps’ in French Canada). ",
            "date": "Answered June 25, 2020",
            "views": "173",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Valerie Niosi",
                    "user_href": "/profile/Valerie-Niosi-1"
                },
                {
                    "user_id": "Kanupriya Tiwari",
                    "user_href": "/profile/Kanupriya-Tiwari-1"
                },
                {
                    "user_id": "Marc Ander",
                    "user_href": "/profile/Marc-Ander"
                },
                {
                    "user_id": "Glenda King",
                    "user_href": "/profile/Glenda-King-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Davender Sahu",
                "href": "/profile/Davender-Sahu"
            },
            "answer_text": "Yes, of course. Our body system is always under control of our mind . As, I feel we all are bonded with our soul (the undefined atom ) . God feering peoples always feel some extra ordinary presence (our inner mindset). So it's a regular lifelong process we follow, i.e,what to eat what is taste, how to enjoy life with all means.. we like todo whatever our mind allow us. It can be better or burst in view of our social life. Somewhere we over react & some time we overlook. Now ,we discuss the calling of wake at time of death; as, I understood our brain always try to operate functions of our body properly, when our body system doesn't follow it's instruction the soul started there role in the body. Our life journey real displayed in our unconscious mind, at that time full stored balance of our energy stands together with our holy 'soul'. The person as a self analysts decide,what he/she done in whole life. There is no evidence I found ,at that moment what role further to make body to be destroyed.as well as our soul get away from our body. ",
            "date": "Answered June 28, 2020",
            "views": "40",
            "upvotes": "0"
        }
    ]
}