{
    "title": "Why do radio stations only play singles? - Quora",
    "tags": [
        "Internet Radio",
        "Radio Stations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Micheal Chang",
                "href": "/profile/Micheal-Chang-1"
            },
            "answer_text": "Radio stations must pay a fee in order to obtain a licence from The American Society of Composers, Authors and Publishers (ASCAP). This will then allow licenced stations to play the music permitted under the agreement. This ensures content creators are paid. See: Radio Licence With that out of the way, there might be different versions of the same song edited in different durations which will serve different purposes. “Singles” are typically edited to 3 minutes for most commercial pop music stations during peak hours so station directors can slot in hits, jingles, and DJ time accordingly for maximum audience draw. Other versions such as “Long Play” might better suit special programming hours such as Dance Music from 9:00PM to 3:00AM on Saturday nights. Then there are song which have no “Radio Edits” such as Stairway to Heaven or classical music performances so stations specializing in the genre will slot in the song at a time they consider appropriate. Basically radio stations can play any song within their licencing agreement, so they plan and choose accordingly. ",
            "date": "Answered July 21, 2017",
            "views": "19",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rhea Studies",
                    "user_href": "/profile/Rhea-Studies"
                },
                {
                    "user_id": "Tanner Clark",
                    "user_href": "/profile/Tanner-Clark-12"
                },
                {
                    "user_id": "Isabella Dula",
                    "user_href": "/profile/Isabella-Dula"
                },
                {
                    "user_id": "Mweya Ruider",
                    "user_href": "/profile/Mweya-Ruider"
                },
                {
                    "user_id": "Stephen Ahubelem",
                    "user_href": "/profile/Stephen-Ahubelem"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gene Turnbow",
                "href": "/profile/Gene-Turnbow"
            },
            "answer_text": "The question posited isn’t completely valid. Sometimes radio stations do play entire albums - but this is rare. Part of the reason is that it’s hard to hold your listener bases’ attention for more than about 20 minutes at a time on average. Some people put the radio on and listen all day, but this is pretty rare. Playing nothing but the same artist for 45 minutes is a good way to achieve a new high score for disconnects. The other part of the reason is that under U.S. law, internet radio stations may not intentionally play more than two cuts from the same album in the same hour, and may not play two of them in sequence by the same artist. Not every terrestrial broadcast station has an internet streaming counterpart, but for those that do, they have to adhere to this rule as well. This is specifically to prohibit stations from playing entire albums, so that listeners cannot tune in at an expected time and record an entire album so as to avoid having to buy it. So far as I know, Canada does not have this restriction, so if you’re listening from Canada, or the station you listen to broadcasts from there, you may have better luck. My own station, http://kryptonradio.com, plays a lot of singles, but we play cuts from a lot of soundtrack albums too, so we’re a little more on the fringes of what most radio stations. do. ",
            "date": "Answered April 13, 2018",
            "views": "555",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mara Waldmann",
                    "user_href": "/profile/Mara-Waldmann"
                }
            ]
        }
    ]
}