{
    "title": "Why are there such mixed opinions of John Lennon ranging from a great guy to a jerk? - Quora",
    "tags": [
        "John Lennon",
        "The Beatles (band)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ely Matawaran",
                "href": "/profile/Ely-Matawaran"
            },
            "answer_text": "Nice question. Short answer: Because he really was a great guy and at the same time a jerk. Shorter answer: Because he's a human being. All of us have multifaceted and complex personalities. You too can be a great guy to your friends and a jerk to your subordinates. It's just more glaring in the case of John Lennon because he went to extremes. And that's because he didnt take much effort to discipline or control himself. And why should he? He was John Lennon, the legend. This complexity in the person of John Lennon was thoroughly studied by author Albert Goldman, known then as (as claimed by the book but others would dispute) the master of the world of pop culture. He spent 6 years doing research and conducting 1,200 interviews from around the world just to be able to understand and define the man. It's all in his very thick and very controversial book “The Lives of John Lennon” which with a few extra bucks I had then I was able to purchase during the 80s.  This is a fascinating and highly contentious book of almost 800 pages - an attempt to take us deep unside Lennon's carefully guarded world. Starting with Lennon as a kid who liked to introduced himself to people he met with “I am John Lennon!” complete with all the swagger and the attutude that it was as if he was already the John Lennon the legend he was to become. A kid not afraid of dying, “it's just like getting out of one car and into another\". And the book approaching its end with Lennon telling Jack Douglas after a session in the studio that he was not afraid of dying because if he dies he would become much more famous than Elvis. A couple of hours later, he was dead. Shot by Chapman. And after countless interviews in 6 years, was Albert Goldman able to understand and define John Lennon? Did he get a clearer picture of the man? Well, in some sort of summation, here's what he wrote, “what emerges is a startling and revolutionary portrait. The man of peace proves to be a man of uncontrollable violence. The man of madcap humor and unfailing wit turns out to be a taciturn malancholic. The strong and aggressive character conceals a weak and passive personality. The proud king of rock 'n' roll has so poor an opinion of himself that he is ready to offer his life to the most insistent bidder. The supreme symbol of youthful vitality is more than half in love with life and death.” And so who was the real John Lennon? “The real John Lennon was not his image. In fact, there was no real John Lennon, only an endless succession of masks that he spent his tortured and tragic life impulsively donning and doffing.” It seemed to me that Goldman was disappointed by what he had found out about our martyred idol John Lennon. Well, as they say, “legends are legends, don't make them people\". If you try to equate the man to the legend, you’re bound to get disappointed - because a legend is actually a larger-than-life persona created mostly by publicity machine and the media. And the man behind the legend is well, a man. Just like you and I. Thanks! ",
            "date": "Updated April 23, 2018",
            "views": "12",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ben Gazda",
                    "user_href": "/profile/Ben-Gazda"
                },
                {
                    "user_id": "James Christopher Desmond",
                    "user_href": "/profile/James-Christopher-Desmond"
                },
                {
                    "user_id": "Joseph Jordania",
                    "user_href": "/profile/Joseph-Jordania"
                },
                {
                    "user_id": "Joseph Blue",
                    "user_href": "/profile/Joseph-Blue-3"
                },
                {
                    "user_id": "Tim Buhl",
                    "user_href": "/profile/Tim-Buhl"
                },
                {
                    "user_id": "Chance Bryant",
                    "user_href": "/profile/Chance-Bryant-4"
                },
                {
                    "user_id": "Hank Charneskey",
                    "user_href": "/profile/Hank-Charneskey"
                },
                {
                    "user_id": "Shari Small",
                    "user_href": "/profile/Shari-Small"
                },
                {
                    "user_id": "Ray Otani",
                    "user_href": "/profile/Ray-Otani-1"
                },
                {
                    "user_id": "Matti Ritvanen",
                    "user_href": "/profile/Matti-Ritvanen"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Virgil",
                "href": "/profile/David-Virgil-1"
            },
            "answer_text": "Truthfully John could be a great guy at times and a jerk other times. There is no denying that he was a great talent but as a person he seemed to have a Jeckle and Hype personality. I tried to meet him once and he told me to “Piss off” and in all fairness he was under the influence at the time and by all accounts if he had been drinking he could be a pretty mean and aggressive person. Weall have our moments and why should he be any different. While John was a tremendous artis he wasn’t always the nicest person. He was a horrible father to Julian and not particularly a good husband to either Cynthia or Yoko at times. The reason there are so many mixed opinions is because he was very nice to some and not so nice to others. Depending on a person’s experience with John he was either a great guy or a real A-hole. ",
            "date": "Answered April 3, 2018",
            "views": "343",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shari Small",
                    "user_href": "/profile/Shari-Small"
                },
                {
                    "user_id": "Mario Caiti",
                    "user_href": "/profile/Mario-Caiti"
                },
                {
                    "user_id": "Gary Palumbo",
                    "user_href": "/profile/Gary-Palumbo-1"
                },
                {
                    "user_id": "Helen Stockwell",
                    "user_href": "/profile/Helen-Stockwell"
                },
                {
                    "user_id": "Jesse Spangler",
                    "user_href": "/profile/Jesse-Spangler"
                },
                {
                    "user_id": "Sean Cronin",
                    "user_href": "/profile/Sean-Cronin-22"
                },
                {
                    "user_id": "John Jansen",
                    "user_href": "/profile/John-Jansen-25"
                }
            ]
        }
    ]
}