{
    "title": "Why do guitar tuners use 440 hz? - Quora",
    "tags": [
        "Guitar Tuner"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Cox",
                "href": "/profile/Andrew-Cox-83"
            },
            "answer_text": "That is the standard reference pitch of the musical tuning system used, and it’s a little-noticed but crucial aspect of modern music. In the modern Equal Tempered Tuning System, all other pitches are expressed as ratios of the reference frequency. So your tuner is nothing more than a computer that analyzes the frequency of your guitar string(s) and compares that to its calculated correct frequency for that particular note. For virtually all music made in the last two hundred years, that reference pitch has been 440Hz for A5. If you tune your instruments to be in tune at A=440, your music will sound the way it is intended to sound. ",
            "date": "Answered March 10, 2020",
            "views": "65",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mohammed Saiful Alam Siddiquee",
                    "user_href": "/profile/Mohammed-Saiful-Alam-Siddiquee"
                }
            ]
        },
        {
            "author_info": {
                "name": "John McFarland",
                "href": "/profile/John-McFarland-23"
            },
            "answer_text": "It’s the A note. the high E string held down at the 5th fret. 440 Hz. means the string vibrates 440 times in one second. Thus, the G string held at the 2nd fret is 220 Hz. the 5th string played open is 110 Hz. Also 440 Hz. A note is an internationally agreed upon standard for tuning for what is called the even tempered scale which we have all been using for a long time. Some electronic tuners can be changed to a different tuning, the old international standard for the A note was 436 Hz. it originated in a time that we didn’t use the even tempered scale but rather used the just tempered scale. The Just tempered scale is really the Pythagorean scale split into more notes. You can find stuff on the just tempered and Pythagorean scale on YouTube. ",
            "date": "Answered March 10, 2020",
            "views": "133",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Francisco Migliozzi",
                    "user_href": "/profile/Francisco-Migliozzi"
                },
                {
                    "user_id": "Mohammed Saiful Alam Siddiquee",
                    "user_href": "/profile/Mohammed-Saiful-Alam-Siddiquee"
                }
            ]
        }
    ]
}