{
    "title": "Why is Ariana Grande so much more of a goddess than Taylor Swift? - Quora",
    "tags": [
        "Ariana Grande (actor, musician)",
        "Taylor Swift (musician)",
        "Celebrity and Music",
        "Musicians",
        "Celebrities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Johnson Mike",
                "href": "/profile/Johnson-Mike-16"
            },
            "answer_text": "It all has to do with personalities more than beauty! Ariana has a funny side to her and a very caring playful side that shows in the smile that she always has on her face and she loves to be herself around people! Taylor Swift always has that better than thou look on her face and rarely smiles. Ariana can sing anything, including Broadway and Opera because of all the voice lessons she took as well as all the dance lessons, she can truly dance. Taylor Swift sings in the same momo tone, rarely smiles, and dances like Steve Martin in the Jerk movie! Now for the body, there isn’t too hard of a decision there,one is so sexy and finger licking good and the other looks like the Scarecrow in the OZ. ",
            "date": "Answered March 8, 2020",
            "views": "194",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Spotify Stan",
                    "user_href": "/profile/Spotify-Stan"
                },
                {
                    "user_id": "Michael Vincent",
                    "user_href": "/profile/Michael-ONial"
                },
                {
                    "user_id": "Veronique Helmridge-Marsillian",
                    "user_href": "/profile/Veronique-Helmridge-Marsillian"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Barnhart",
                "href": "/profile/James-Barnhart-25"
            },
            "answer_text": "I am sorry but I see and hear nothing about either women that would give them “Goddess Status”. I have listened to both of their music. It is good but not amazing. They are both attractive but neither are jaw dropping beautiful. From the stories I have heard, you would have a better chance of actually meeting Taylor. Also, if you were in LA and went to a donut store, you would have to worry if Taylor had licked them (I still haven’t got over Ariana licking food for sale). I would guess if you find Ariana more of a goddess than Taylor, it is just your taste (pun not intended) in performance styles and style of appearance. ",
            "date": "Answered February 17, 2020",
            "views": "237",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Meni Ken Roberts",
                    "user_href": "/profile/Meni-Ken-Roberts"
                },
                {
                    "user_id": "Melissa Hecker",
                    "user_href": "/profile/Melissa-Hecker-2"
                }
            ]
        }
    ]
}