{
    "title": "Why do movies make their own soundtracks instead of using existing songs? - Quora",
    "tags": [
        "Soundtracks",
        "Movie Soundtracks",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shane Tennent",
                "href": "/profile/Shane-Tennent"
            },
            "answer_text": "Most of it is a matter of money.  In some cases, getting the rights to use a piece of existing music could cost more than paying someone to write a piece of music. If you examine the James Bond series, especially as the movies get younger, the producers took advantage of both kinds of music.  They would pay gobs of money to well known artists to perform music made for the intro credits.  Then, to tie the movie in, they would create a sound track that was a combination of the song from the intro, and the classic Bond theme... all worked together. You KNOW that cost money. There are many popular, and expensive movies, that use both established pieces of music (to improve the viewer experience) and original incidental music. Some of the movies require a whole soundtrack that is made up of popular music.  Many times, if a movie is made about an event in the past, popular music from that time will be used in the soundtrack to set the tone, and keep the viewer immersed in that time period. In the case of an epic like Star Wars, the orchestra was used so as to produce grand, sweeping pieces that would appeal to the broadest audience possible.  In these kinds of music, where the director is attempting to create a very specific mood, it is better to have an original score written for the scene, so as to control the emotional roller coaster.  You want the audience to feel Julia Roberts confusion melt away as she is walking away from Bennet and out of the Casino at the end of Ocean's 11... and when she stops and really realizes what is going on, it isn't just the expression on her face that makes the audience get what she is feeling... it is the change in music.  To have that level of control, one needs control over everything.. ",
            "date": "Answered March 13, 2015",
            "views": "626",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mario Stradale",
                    "user_href": "/profile/Mario-Stradale"
                },
                {
                    "user_id": "Lu Laverde",
                    "user_href": "/profile/Lu-Laverde"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Corelis",
                "href": "/profile/Jon-Corelis"
            },
            "answer_text": "I think in the past a large part of the reason was the studio system.  In those days, movies were very big business.  The making of a feature film was a major corporate business project, and the businesses (the studios) maintained all the resources necessary for it: stars, directors, technicians, costume and set designers, etc.  Since they were doing all that, it made sense for them to include composers and musicians as part of their own staffs, so they wouldn't have to bother about permissions, and so they could custom make music which would exactly suit their films. To an extent this is still true, though I believe that most major films today have musical sound tracks that are at least partly computer generated.  But since the 1960s there has actually been a trend towards using previously recorded music in films.  A notable example is the Coen Brothers \"O Brother Where Art Thou?\", which has a terriffic musical soundtrack, though all of it I believe consists of older recorded music. Incidentally, an interesting in-between example is the great musical \"Singing in the Rain,\" which had music by studio musicians, but all the songs themselves were written prevous to the movie for other purposes. ",
            "date": "Answered March 15, 2015",
            "views": "263",
            "upvotes": "0"
        }
    ]
}