{
    "title": "Why do the notes E and F and the notes B and C not have a sharp and a flat? Why were they created as half-steps? - Quora",
    "tags": [
        "Musical Notes"
    ],
    "response": [
        {
            "author_info": {
                "name": "Barnaby Page",
                "href": "/profile/Barnaby-Page"
            },
            "answer_text": "Well, there are a couple of different aspects to consider here. One is the notes themselves, and the other is the way they appear on a keyboard. The very short answer is that the notes do exist, and we are wrong to assume (as we’re often taught when beginners) that all sharps and flats are black notes. For example, there is an E sharp - it just happens to be the same note as F - and there is a C flat, which happens to be the same note as B. (And the same applies to the other “missing” notes.) If that sounds implausible, think about C sharp. That note exists, right - you can see it on the piano? Okay, if C sharp exists, then the key of C sharp major must exist. And if the key of C sharp major exists, what can the third note be EXCEPT an E sharp? You can prove the existence of the other “invisible” sharps and flats in the same way, if you need to! So B, C, E and F are not in any way disadvantaged by lacking certain sharps and flats. They do have them, they’re just less obviously marked off as being sharps and flats, because they’re also white. (Perhaps for this reason, they’re also less used by composers.) Bear in mind, too, that the naming of notes is just a convention. There is no hierarchy in which E (for example) is a more “important” note than E flat. All notes in the scale are created absolutely equal, one semitone apart! Indeed, this is illustrated well by the German practice. The Germans refer to what the rest of us call B flat as B, and to what the rest of us call B as H. But the note we call B flat, which they call B, is still exactly the same note inside and outside of Germany, in the way you play it and the way you hear it. It’s just a name. (As an added benefit this lets the Germans spell out BACH in musical notes.) Finally, let’s consider the keyboard. The short answer is that originally, the keyboards of early organs only had what we know as the white notes, all appearing the same. Music simply relied on a smaller number of potential notes. Gradually more notes were introduced to the keyboard, and some were coloured differently in order to make it easier to visually locate them. You can imagine that it would be much harder to locate F (say) on a keyboard consisting entirely of white notes than it is to identify the pattern of white and black which tells us where an F is. Again, whether a note is black or white on the keyboard doesn’t dictate whether it can or cannot be a sharp or flat. It’s simply a convenient way to arrange them. Interestingly, some early keyboards used the opposite of the black-and-white convention that we’re familiar with, so what we think of as “white” notes were coloured black and vice-versa. ",
            "date": "Answered January 23, 2018",
            "views": "966",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Johan Van Herke",
                    "user_href": "/profile/Johan-Van-Herke"
                },
                {
                    "user_id": "Tracey Edgar",
                    "user_href": "/profile/Tracey-Edgar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Newstetter",
                "href": "/profile/Mark-Newstetter"
            },
            "answer_text": "E, F, B and C do have sharps and flats. The E sharp is F, F flat is E, B sharp is C, C flat is B. … If you already understand G# and Ab are the same note pitches, then it’s really no different. It all has to do with the context in which the notes happen. For instance, if you look at all 12 major keys you’ll see that every key is a sequence of all seven alphabet letters. Some are natural tones (simply an alphabet letter), some are sharps and some are flats. The key of C major is made up only of natural tones. The ratio of the pitches of a major key are based on a series of whole-steps and half-steps …  Every key follows this same sequence of whole-steps and half-steps. The reason the notes are not all equally spaced in pitch, i.e., not all whole-steps, not all half-steps, is because of the way sound frequencies align to produce consonant harmonies. What we call a musical key is simply a group of pitches chosen for their harmonic relationships which enable the structuring of pleasing musical ideas. It’s a little more complex than that, but that’s the essence of it. There are many different systems in the world, and over time there have been many changes to all systems, but they all are based on organizing pitches into useful groups suited to the musical criteria of each culture. We call the system of organizing notes into 7-note keys based on a total pool of 12 notes the “diatonic” system. Diatonic literally means “through the notes.” Each of the 12 notes in the system becomes the tonic (the note a key is based on is called the tonic) of a key, so there are 12 keys: The 12 Major Keys: C major = C D E F G A B C G major = G A B C D E F# G D major = D E F# G A B C# D A major = A B C# D E F# G# A E major = E F# G# A B C# D# E B major = B C# D# E F# G# A# B F# major = F# G# A# B C# D# E# F# (The keys of F# and Gb are tonally the same, or “enharmonic keys”) Gb major = Gb Ab Bb Cb Db Eb F Gb Db major = Db Eb F Gb Ab Bb C Db (could also be C# if every note is sharp) Ab major = Ab Bb C Db Eb F G Ab Eb major = Eb F G Ab Bb C D Eb Bb major = Bb C D Eb F G A Bb F major = F G A Bb C D E F Notice that the keys are arranged in a sequence of fifths. That is to say, the first key is C … if you count five steps from C; “C > D > E > F > G,” you reach the next key of G. D is a fifth from G, A is a fifth from D, and so on. We call this sequence the Circle of Fifths. Notice that after the key of C which has not sharps or flats, sharps are added one by one to each subsequent key, until reaching the key of F# (six sharps), which can also be Gb (six flats) … whichever a composer prefers. If we were to keep adding sharps, we would reach the key of C# in which all seven notes are sharp, but there’d still be four more keys to go, so it’s practical to start using flats instead, starting either with the key of Gb (six flats) or Db (fiver flats), and then start losing a flat each key as you go around the circle, until you’re back to C. The diagram below shows the circle of 5ths. Notice that if you go around the circle clockwise (alphabetically) you get 5ths , if you go around counter clockwise (also alphabetically) you get 4ths.  … So, although the answer is not exactly simple, you can be sure that every note can be sharp or flat. In fact, there are even double-flats and double-sharps, so, for example, the note A could actually be called G double-sharp, or it could be called B double-flat. Double sharps and flats are rarely used, but the do exist in the diatonic system. The same rules apply to the names given to every one of the 12 notes in the system, even E,F,B and C. ",
            "date": "Answered January 23, 2018",
            "views": "39",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chuck McDowell",
                    "user_href": "/profile/Chuck-McDowell"
                },
                {
                    "user_id": "John Ferguson",
                    "user_href": "/profile/John-Ferguson-55"
                },
                {
                    "user_id": "Cristian Dragus",
                    "user_href": "/profile/Cristian-Dragus"
                },
                {
                    "user_id": "ELAVARASI BASKAR",
                    "user_href": "/profile/ELAVARASI-BASKAR"
                },
                {
                    "user_id": "Ted Pascoe",
                    "user_href": "/profile/Ted-Pascoe"
                },
                {
                    "user_id": "Jim Asherman",
                    "user_href": "/profile/Vlad-Dragul"
                },
                {
                    "user_id": "Bettye Perry",
                    "user_href": "/profile/Bettye-Perry-1"
                },
                {
                    "user_id": "Michael Fort",
                    "user_href": "/profile/Michael-Fort-10"
                },
                {
                    "user_id": "Mark Wessels",
                    "user_href": "/profile/Mark-Wessels-5"
                },
                {
                    "user_id": "Tracey Edgar",
                    "user_href": "/profile/Tracey-Edgar"
                }
            ]
        }
    ]
}