{
    "title": "Why is the Bollywood song 'Jimmy Jimmy' so famous in Russia? - Quora",
    "tags": [
        "Jimmy Eat World",
        "Bollywood Music",
        "Russia",
        "Fame and Mass Popularity",
        "Bollywood"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anna Stepanova",
                "href": "/profile/Anna-Stepanova-1"
            },
            "answer_text": "This question has just brought so many memories to me… Although I grew up after the collapse of the USSR and when the era of Indian cinema in Russia had already ended. But I inherited my mother’s love for Indian movies and I got introduced to them at very early age. Indian cinema was incredibly popular in the Soviet Union. I remember an interview with Ranbir Kapoor, in which he was asked what fame meant to him. He recalled an episode from life of his grandfather Raj Kapoor. When Kapoor visited the Soviet Union (for Moscow Film Festival or something), a giant crowd of his fans surrounded the car in which he was sitting and raised it to carry it over the streets of Moscow. Ranbir said that was what true fame meant for him. I guess, it gave you an idea how much love Indian actors were receiving in the USSR. The movie Awaara is the third most watched foreign movie in the Soviet Union, with audience over 63 millions. The movie was so popular that even the title song Awaara got its Russian version. Brodyaga (the Russian title of the movie) was the beginning of one long epoch when Indian movies were screened in Soviet cinemas. I have heard so many stories from my family that when a new movie was released, the cinemas used to get so crowded, that people had to stand in the rows. This period lasted from the 1950s to the late 1980s. And the movie Disco Dancer was the last Indian movie screened in the USSR, which achieved similar popularity. It occupies 8th position among most watched foreign movies in the USSR. Mithun Chakraborty got very popular and loved after the movie got released. If you wonder why, just look at this:  I mean is it possible to look at this face and not fall in love? After so many years my heart still melts while looking at him. As I said before, my mother showed me my first Indian moves when I was around 8. There were not shown in local cinemas anymore but nearly everyone had a huge collection of cassettes of Indian movies at home. My very first Indian movie was a Mithun Chakraborty movie and along with many elder and younger Soviet/Russian women I got a crush on him. Coming back to your question, why this particular song and this particular movie got so famous in Russia. I am not a witness of those times and I can only repeat what I heard. The late 1980s was time when disco was a very popular music genre. The Soviet audience, unfortunately, had little opportunity to listen to this kind of music as it all was “American” and “capitalist” and was not very encouraged. On another hand, we had our best friend India and their movie Disco Dancer with cover versions of many hits. So instead of listening to the original song You’re OK by Ottawan, Soviet viewers got to hear Jimmy Jimmy Aaja Aaja first and they loved it way too much. This song is known till now. In modern times, Indian films are often remembered with irony along with other things from our Soviet past. Indian cinema is much less popular in Russia than it used to be. But a few classics like Awaara, Seetha Aur Geetha and Disco Dancer are still sometimes shown on TV. And if you say any Russian that you are Indian, there is a high chance that they will start singing Jimmy Jimmy to you. ",
            "date": "Updated February 9, 2018",
            "views": "86",
            "upvotes": " View 2.8K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Raj Goswami",
                    "user_href": "/profile/Raj-Goswami-68"
                },
                {
                    "user_id": "Srijan Gupta.Upshift",
                    "user_href": "/profile/Srijan-Gupta-Upshift"
                },
                {
                    "user_id": "Rosy John",
                    "user_href": "/profile/Rosy-John-8"
                },
                {
                    "user_id": "Vaibhav Gupta",
                    "user_href": "/profile/Vaibhav-Gupta-1186"
                },
                {
                    "user_id": "Uday Kumar",
                    "user_href": "/profile/Uday-Kumar-5896"
                },
                {
                    "user_id": "Vivek Saini",
                    "user_href": "/profile/Vivek-Saini-32"
                },
                {
                    "user_id": "Sourabh Kumar",
                    "user_href": "/profile/Sourabh-Kumar-1414"
                },
                {
                    "user_id": "Manthan",
                    "user_href": "/profile/Manthan-39"
                },
                {
                    "user_id": "Brian Murthy",
                    "user_href": "/profile/Brian-Murthy"
                },
                {
                    "user_id": "Riya Vachhani",
                    "user_href": "/profile/Riya-Vachhani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lulu Sundae",
                "href": "/profile/Lulu-Sundae"
            },
            "answer_text": "May I say it is also popular in China back then,I guess it is because the communist world was againt US and western culture back then,and bollywood film is delightful and harmless.And for China, anything Soviet did, they did.Soviet is their god father in a way. ",
            "date": "Answered February 22, 2018",
            "views": "31",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Srijan Gupta.Upshift",
                    "user_href": "/profile/Srijan-Gupta-Upshift"
                },
                {
                    "user_id": "Uday Kumar",
                    "user_href": "/profile/Uday-Kumar-5896"
                },
                {
                    "user_id": "Sutirtha Sil",
                    "user_href": "/profile/Sutirtha-Sil"
                },
                {
                    "user_id": "Soumyajit Das",
                    "user_href": "/profile/Soumyajit-Das-77"
                },
                {
                    "user_id": "Monica Anand",
                    "user_href": "/profile/Monica-Anand-28"
                },
                {
                    "user_id": "Ripon Das",
                    "user_href": "/profile/Ripon-Das-58"
                },
                {
                    "user_id": "Arindam Dutta",
                    "user_href": "/profile/Arindam-Dutta-104"
                }
            ]
        }
    ]
}