{
    "title": "Why do we have unique feelings attached to new situations that we sometimes connect to songs we heard in that time of change? - Quora",
    "tags": [
        "Neuroscience",
        "Songs",
        "Understanding Emotions",
        "Emotions",
        "Music",
        "Psychology of Everyday Life",
        "Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Castanza",
                "href": "/profile/John-Castanza"
            },
            "answer_text": "Thanks for the request. It is because songs are recorded moments that we associate with. Whenever we hear a song (specially over and over again) during certain situations (sad, nostalgic, happy, exciting, emotional, etc.), our brain registers it and associates it with that moment. That's why when artists makes their songs, it's about a moment in their life that they are experiencing or experienced. Songs are moments. And we associate their songs and relate to them because we're going through something similar and it reflects our very own moments. And that's why an artist always evolve differenly from when they first begin. For an example… If they were poor before and after time they become wealthy the feel of their songs become different, because the sadness or happiness are at different levels. You can never expect an artist to be the old him/her because they evolved, and so many people want the artist to be their old self because they feeling they had in their songs were different. ",
            "date": "Answered September 17, 2019",
            "views": "53",
            "upvotes": " Answer requested by Nadine Krämer"
        },
        {
            "author_info": {
                "name": "Bethel Wondwossen",
                "href": "/profile/Bethel-Wondwossen-2"
            },
            "answer_text": "When we listen to songs we feel sense of familiarity. And we remember those moments clearly. For e.g Alan listened some romantic song with his ex girl friend lily. Alan is now in a new relationship with Helen. Then one night he listened the same song with Helen. He found him self thinking about lily even though he was over her. Songs have power to make us remember the good and bad times. They can make our selves lost in that particular moment. ",
            "date": "Answered September 17, 2019",
            "views": "13",
            "upvotes": " Answer requested by Nadine Krämer"
        }
    ]
}