{
    "title": "Why do major chords sound 'bright' and 'happy' while minor chords sound 'dark' and 'sad'? - Quora",
    "tags": [
        "Chords (music)",
        "Chord Progressions",
        "Guitar Chords",
        "Music Theory",
        "Music Composition",
        "Playing Guitar",
        "Guitars",
        "Sound",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yuri Vilenkin",
                "href": "/profile/Yuri-Vilenkin"
            },
            "answer_text": "I like to think that it is a prejudice in general and little important now as both types are freely used in same works. Besides, if single chord is able to call unpleasant feeling then it can't call the feeling of happiness. The chords were invented by choir singing in thirds and made music mach more interesting. Now it is clear that they permit create expressive timbres thank controlled dissonances and useful horizontal ties . By it particular important the ties with tonic note. If compare these abilities by major and minor chords then results is different for triads,7th, 9th and so on chords. For example 9th minor chords are widely used by jazz performances clearly not for feeling of sadness. Concerning triads and 7th chords then major ones are better in majority of genres because they can provide more various timbres and temporal ties. Therefore they are used much more often except genres for which relative weak dissonances characteristic,for example in melancholic music. The opinion that properties of minor and major chords follow from ratios 1,2,3,4, 5.... is incorrect. Now ratios of our 12 ET music scale pitches are powers of 1,059... and only with different exactness correspond to natural numbers. In reality the properties of minor and major scales follow from positions of tones and semitones in them. The above mentioned opinion may be explained by certain nearness of Pythagorean musical scale which basis is natural numbers to 12 ET scale. ",
            "date": "Answered November 18, 2019",
            "views": "173",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Omar Baltuth",
                "href": "/profile/Omar-Baltuth"
            },
            "answer_text": "This happy/sad dichotomy is purely an artifact of cultural bias. In many cultures, nearly all music is “minor”, i.e., using the minor third interval as opposed to the major third interval.There, there are lots of “happy” songs done in a minor key. Listen, at random, to any Slavic folk music or modern Middle Eastern pop tunes to demonstrate this. Your Northern European/British/North American perception only holds true for the bulk of music from those cultures. Anywhere else, knowledgeable people will say, “Don’t be ridiculous!” ",
            "date": "Answered November 14, 2019",
            "views": "116",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joy Angela",
                    "user_href": "/profile/Joy-Angela-2"
                },
                {
                    "user_id": "Dave Bartholome",
                    "user_href": "/profile/Dave-Bartholome-2"
                }
            ]
        }
    ]
}