{
    "title": "Why has no band ever emerged to match the popularity or success of the Beatles? - Quora",
    "tags": [
        "The Beatles (band)",
        "Bands (music)",
        "Fame and Mass Popularity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steven Haddock",
                "href": "/profile/Steven-Haddock"
            },
            "answer_text": "It’s a minor miracle the Beatles formed in the first place and it was a second major miracle that they stayed together as long as they did - seven years. Don’t blame Yoko. And I agree with you. I’ve also said that you can take any single band out of the history of rock and roll and it would pretty much have unfolded the way it did. Except for The Beatles. Take The Beatles out and everything turns out differently. In the seven years they were together, rock and roll went from “Three guitars and a drum kit” to “whatever you want it to be”. The strength of the band was in its individual members, and so was the eventual break up of the band. Largely self taught, but with a solid commitment from each of them to keep improving, John, Paul, George and Ringo were always committed to learning and trying something new while, at the same time, trying to produce music that they thought would be popular. And it all started when John Lennon met Paul McCartney. John already had his own band. Had he never met Paul, John Lennon probably would have been an incredibly popular entertainer in his own right and would have led a succession of bands. However, when he started working with Paul, he realized that Paul was a better musician than he was. He realized at that moment two things: Paul was better at writing music than he was. Paul’s tunes were better even though his lyrics weren’t quite as good.Paul was a better guitar player.As such, John realized this wouldn’t be his band any more - it would be their band. It takes a lot of guts to start to work with someone better than you when, to that point, you’ve been the best musician in the room. He did it anyway. It happened again when Paul introduced George Harrison to John. It was clear that George was a better guitar player than either of them, despite being younger. They both decided to work with him anyway, even if it literally meant being second and third fiddle. So they got a band together with their friends Stu Sutcliffe and Pete Best. Sure, they were good, they were popular, but they found someone really good. Richard Starkey, who was older than any of them, had his own band that played a lot of country and western covers. Richard went by the western themed name “Ringo Starr” and his band rivaled the Beatles in popularity. Sutcliffe had already left by this time, but one night Best couldn’t make it and the other three asked Ringo to fill in on drums. It was a revelation. Ringo had been specializing on the drums for years by this time and his drumming improved the band. There was no reason for Ringo to give up his band. As Lennon later said, everyone loved Ringo - he was the most charismatic of them all. Had he not joined The Beatles, he still would have been a massive success. But they asked him anyway. It was a big decision, but Ringo decided to go along and Best was let go. Now, after they broke up, which one of them didn’t have a successful career afterwards? The answer is “none of them”. Paul and Ringo are still packing them in at concerts. Harrison became a major influence on music and a successful solo artist. John Lennon also had an awesome solo career. And that’s what made the Beatles special. Each and every one of them was capable of either playing alone or leading their own band. Each one of them knew it. Instead, they decided to play as a band, not a bunch of individual musicians. Who was the lead guitarist of The Beatles? They didn’t have one - whoever could handle the lead part better did it. Who was the lead singer of The Beatles? They didn’t have one - they even let Ringo sing lead at times. Who was the lead songwriter of The Beatles? They didn’t have one. Most of their songs are credited to Lennon-McCartney, and George got to release songs too. Try to imagine any other band like that. I can think of “The Blues Brothers Band” an all star band of blues musicians, but they only lasted long enough to make two movies and a few concerts. The rest of the time they worked apart. And that’s what happened. Each one of them got tired of being “The Beatles” because they wanted to move in other directions. Lennon started to think the music was insipid. Harrison grew angry about his lack of writing contributions. Ringo spent most of his time in recording sessions not doing anything because they started to move away from drumming tracks. Paul, he was just upset about how much John and George were griping. ",
            "date": "Updated July 7, 2019",
            "views": "525",
            "upvotes": " View 244 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mark Winkelsas",
                    "user_href": "/profile/Mark-Winkelsas-1"
                },
                {
                    "user_id": "Juri Rosenfeld",
                    "user_href": "/profile/Juri-Rosenfeld"
                },
                {
                    "user_id": "Carolyn Elizabeth",
                    "user_href": "/profile/Carolyn-Elizabeth-2"
                },
                {
                    "user_id": "Chris Frohring",
                    "user_href": "/profile/Chris-Frohring"
                },
                {
                    "user_id": "Mark Olivas",
                    "user_href": "/profile/Mark-Olivas-6"
                },
                {
                    "user_id": "David Bell",
                    "user_href": "/profile/David-Bell-879"
                },
                {
                    "user_id": "Just Saying",
                    "user_href": "/profile/Just-Saying-83"
                },
                {
                    "user_id": "Jocelyn Provost",
                    "user_href": "/profile/Jocelyn-Provost-1"
                },
                {
                    "user_id": "Jim West",
                    "user_href": "/profile/Jim-West-4"
                },
                {
                    "user_id": "Isaiah Howansky (イザヤホワンスキー）",
                    "user_href": "/profile/Isaiah-Howansky-イザヤホワンスキー"
                }
            ]
        },
        {
            "author_info": {
                "name": "Russ C F Garvey",
                "href": "/profile/Russ-C-F-Garvey"
            },
            "answer_text": "Why has no band ever emerged to match the popularity or success of the Beatles? As someone else has already stated here: because of the minor miracle that they emerged in the first place - there were just too many events, chance meetings, opportunities, setbacks, etc. that had to fall into place. We will never likely see this happen again to this degree. One other answer mentioned the Rolling Stones success, but, here’s the thing - in my opinion, from all I’ve read on the subject, they would have never been given the opportunity to succeed as well as they have if the Beatles had not cleared the way for them and every other group to follow in the turbulent music scene that emerged in the ‘60’s. Hmm, I don’t think I can make my answer to this question short. Two major things come to mind in explaining the Beatles contribution in shaping the future of Rock & Roll at the time. The first deals with their early development in Liverpool and Hamburg and the state of R&R in the late ‘50’s and ‘60’s in the US. The second points to the importance of EMI and George Martin. As an added bonus, I found a video that answers this question by going into great musical detail, with interesting trips down the modal and tonal minutia of music and the Beatles use of these techniques. (Below) First, Skiffle was dying a quick death after a dramatic initial rise in 1957 and by ’61 Liverpool had become the epicenter of new music in Great Britain and the acts that created it. There were more bands – and more touring bands, with more venues to play in in the North, than anywhere else in England at the time, and The Beatles were very much a part of this. In fact recording acts, such as Cliff Richard (Hertfordshire) and Billy Fury (Liverpool), who were known in London and recorded in London, did almost all of their touring dates in the North. And the overused quote from London, “guitar groups are out,” is often misquoted and overused in the sense that, at least in London, guitars and groups were never “in” in the first place. Only Frank Ifield - an English born Australian - was considered “national” by the powers that be in London at the time (although Richard had more staying power). But even most of his appearances were in the “North.” Liverpool was, at least for 24 months or so, the right place at the right time for the newly minted R&R groups emerging from the ashes of Skiffle. Brian Epstein worked extremely hard in promotion all through 1962 following the Beatles first single, “Love Me Do.” In conjunction with the tireless efforts of Kim Bennett, a music promoter working with Sid Coleman in the music publishing arm of EMI, this constant work was crucial in sending the song up the charts - as high as 17 depending on the source. This work was vitally important for one very good reason: The Beatles contract with EMI was “over” by then. They were contracted to record 6 sides - and no more - which they had already satisfied. The previously released song rising and the efforts of Coleman, Bennet and Epstein went a long way in convincing George Martin to renew a contract for another single, “Please, Please Me.” After the resultant contract renewal, and eventual new recording agreement with EMI, by the end of 1962, Beatlemania is in full swing in Liverpool and leaking out fast. By mid-1963, London and the rest of England are engulfed in the tidal wave. This started the obsession but doesn't explain what sustained it. Their emergence in ’60, ’61 and their explosive rise in ’62 in Liverpool and to the rest of England in ’63 is only part of the reason. Ed Sullivan caught a whiff of the excitement on a business trip to London in 1963 and assigned some underlings to investigate. By November, Brian Epstein had flown to NY to work on a deal for a two-night engagement on Sullivan’s Sunday night show. While John was telling the Royal audience back home in the Prince of Wales Theater to “Rattle your Jewelry,” Brian was inking the contract in NY. In the ‘50’s and ‘60’s, EMI was a giant. In fact, they owned Capitol Records in the US. But they had always maintained an arm’s length arrangement when it came to releasing recordings in their respective countries…until now. Martin and Epstein had been grousing and complaining to get the Beatles records released in the US on the Capitol label, to no avail. Things came to a head with the release of Parlophone’s 5th Beatles single, “I Want To Hold Your Hand” in late ‘63. Sir Joseph Lockwood, EMI’s formidable Chairman sent his right-hand man, L.G. Wood to NY to personally deliver the message; something that, we’re told by Beatles Biographer Bob Spitz, is “akin to the Pope leaving Rome.” Wood, something of a bulldog himself, wasn’t in town to “ask.” The message to Capitol? “You must take it.” Capitol agreed to release it in the last week of 1963 and backed up the release with $40K worth of promotion, an unheard of sum at the time. By January’s month-end, Capitol had a number 1 hit on their hands in the US. Just as important as all of these steps above, was the mood in Britain and the US at the time that allowed – even encouraged – this avalanche of music to wash over the waiting masses of young people. The lifestyle in England after the war had not changed much. Class was still very much in order and rationing was still in effect for much of the country well into the early fifties. In fact, the average middle-class American would have been appalled at the living conditions of his British counterpart. The Profumo affair would help change this. It’s not every day that an MP or, in this case, the Secretary of State for War, is caught publicly with his pants down (so to speak) in a sordid tale of sex, scandal and leaked state secrets. This helped propel the slowly changing and evolving sense of worth the middle and working class was beginning to exert; especially with the burgeoning youth population growth of war babies now well into their teens. Back in the US, things are quite different, with the war recovery speeding along nicely (albeit with Korea) and an emerging suburban middle-class lifestyle where life is good and people are happy and the airwaves are full of “safe” music like Patti Page, Perry Como, Eddie Fisher and Frankie Laine. The obvious change in music is one of the things that everyone points to in helping to define the British Invasion and its import on culture, politics, etc. But, curiously, in a nutshell, what The Beatles and those who followed managed to do was to reintroduce America to its own music. Americans were longing for the “next big thing” in their collective recovery from the events of November 22, 1963. The Kennedy assassination was a body blow to the nation and especially to young adults and a good part of the teenage population who were quite enthralled by what he represented in a promise for the future. In the mid ‘50’s, American Rock & Roll was still very much nascent and many of its main practitioners were decidedly outside of the mainstream. So much so, that until they were seen in the flesh by enough people, new Rock and Rollers such as Elvis Presley and Jerry Lee Lewis were assumed to be black and were lumped in with other “undesirables” such as Gene Vincent, Carl Perkins, Little Richard and Chuck Berry – music that was just not supposed to be listened to in polite society. The “good” music consisted of the steady diet of pabulum that was being produced by “Boy” acts, including Fabian, Tab Hunter, Pat Boone and Ricky Nelson and “Girl” acts such as Connie Francis. But R & B (and to a lesser extent, Blues) was slowly working its way into white America with the many black groups of the fifties and early sixties headlined by the Drifters and the Ronettes and by single acts like The Big Bopper and Fats Domino – music that was co-existing with the other undesirables above, music that was being soaked up like a sponge by the young Beatles and all of their contemporaries, and music which they imaginatively and successfully turned into something new – from something very American. Elvis, not being the same performer he was in 1955–59, and the death of Buddy Holly - along with the drying up of R&R in the US - replaced with a lot of that “safe” music left a huge gap in the musical landscape over which the Beatles ran rough-shod in 1964. It didn’t hurt that they worked their asses off while in Hamburg in ’61 and ‘62. In fact, over a cumulative 10 month period during that time, comprising just 27 weeks, the Beatles amassed 918 hours of stage performance time. Think about that for a minute - that equates to 612 ninety-minute shows, or 1,836 half-hour shows. That is an unthinkable workload; and one, in my opinion, that will never again be matched. Even more amazing is that they were able to stretch their musical ability over this period of time in spite of the mediocre drummer (Best) and the barely pedestrian bassist (Sutcliffe). This speaks volumes about the innate ability of the other three - John, Paul and George - to advance musically while being cuckolded by what should have been the backbone of their musical structure, the drums and the bass. There were a lot of things that had to fall into place, a lot of chance meetings, a lot of fortuitous associations that all had to happen for the Beatles to emerge at a certain time and place, speeding them along to fame and securing their place in the musical pantheon. That time and place are a once in a lifetime occurrence, and one we’re not likely to see replicated for a long, long time. The slow emergence of a sense of worth of the working and middle classes in Britain coupled with the changing expectations of young Americans created a social, political and economic landscape that was ripe for change. The vehicle for that change was Rock & Roll, albeit a revamped, reworked and re-imagined version of American Rock & Roll as interpreted and innovated by the Beatles and all of those who followed them to America (and around the world) during the “British Invasion.” Second, the best thing to happen to The Beatles and their brand new manager, Brian Epstein, was getting rejected by Decca Records following their New Year’s Day, 1962, audition. In fact, it was also good news for the future Rolling Stones. Decca, at the time, followed the standard practice of the day: signing acts, picking songs from a stable of songwriters, hiring the studio musicians, telling the “act” what to do and how to perform, and finally, figuratively “patting the act on the head” with, “nice job, off you go, we’ll handle the rest.” As someone else on Quora once put it “…the capacity to collaborate and allow those with ideas to express them without getting all ‘I’m the boss’ on your ass…” was not SOP for 1962. Imagine the Beatles fate (and ours) if they had won that audition! I quiver at the thought. Eventually, at EMI, The Beatles and George Martin changed the way things were done for “guitar groups.” Decca changed their tune following the colossal success of the Beatles and quickly signed the Rolling Stones and abandoned their stuffy status quo. George Martin was innovative from early on in his career. There was a hierarchy of sorts at EMI and a loose competition between producers in tallying their charting acts. In the early and mid ‘50’s, George was decidedly bringing up the rear with musical acts but had a lot of success with spoken word and humor. This put him in good stead with those who “thought outside the box,” using new, imaginative and controversial methods, in-studio, for sound effects and the like. He would be drawing on this experience very soon. Surprisingly, George was “saddled” with producing the Beatles first cuts. The early story we were all led to believe – that Brian worked tirelessly (he did, in fact, work hard though) finally convincing EMI to sign a contract with the Beatles wasn’t true. To make a long story short, the music copyright arm of EMI wanted one of the songs (“Like Dreamers Do”) that the Beatles submitted for their 6 song audition and convinced EMI to sign them long enough to at least secure the ownership of this one song. A limited six-song (three recordings, six sides) contract was written up and George was put in charge of the sessions – as a sort of punishment that I won’t get into here. (Read “The Beatles: All These Years Vol 1 – Tune In,” by Mark Lewisohn, Chapter 27, for all the details). On June 6, 1962, the Beatles recorded “Besame Mucho,” “Love Me Do,” “PS I Love You” and “Ask Me Why.” Martin was rather underwhelmed by the selections and asked one of his assistants, Ron Richards, to find a song to for use as an A-side with “Love Me Do,” the most acceptable of the bunch, as the B-side. Martin, at this point, was still clinging to the “industry standard”– picking songs for the talent. This would soon change. A second session later in the summer, rounding out the 6 side contract, saw them record “How Do You Do It,” (the “found” song by Ron) and one other which escapes me at the moment, although I believe it was “Like Dreamers Do” mentioned above. Two things came together at this recording session to point Martin in a new direction concerning the Beatles. The first occurred in a meeting in the control room where a lengthy discussion with all four (Except Ringo, Pete was still barely hanging on by this point.) Martin found them engaging, funny, caustic and opinionated – several steps above what passed for teenage idols at the time who were all show and no substance. The second was the Beatles outright refusal to release “How Do You Do It” as their first single – a song personally picked for them (later released as the first hit for Gerry and the Pacemakers). “Love Me Do” was released on October 5, 1962, as the Beatles first single – a heretofore unimaginable turn of events with a brand new recording artist, or in this case, a “Beat Group.” Martin had some recommendations to make the song flow a little better, but the fact that he acquiesced and allowed them to record their own song as a first release is telling. A second, longer contract was soon written – following a lot of hard work, mentioned above, that eventually pushed “Love Me Do” up to the Top Twenty on the charts – which allowed the Beatles and George Martin to embark on a remarkable collaborative career in the studio. John and Paul were “rough” songwriters, meaning that they could not read musical notation, nor could they score a song. They brought finished – or sometimes a work in progress - lyrics with appropriate chord structure, mostly for rhythm guitar, into the studio. From there they worked closely with Martin, following his lead, taking his advice, suggesting “sounds,” asking about obscure (to them) instruments and the like. George, for his part, worked with his engineers to go into uncharted territory, advancing the art of sound recording to bring different and complicated effects into the finished product. The Beatles were an imaginative and innovative band. Luckily, they were matched up with the right producer at the right time, a man who wrung out of the studio more technical prowess than anyone could imagine was possible in the 1960’s. EDIT: There was a comment that listed lots of other bands that were on the air-waves in the early ‘60s in the US. He’s right (I didn’t list them all in my description above), but my opinion remains unchanged that R&R in America pre- ‘62 was a mishmash of groups and styles (Soul, R&B, West Coast, “Hootenanny,” etc., and, of course, Bob Dylan - a genre all by himself). But pure R&R, a-la the late ‘50s, was no longer driving the bus. The Beatles and the British Invasion re-invigorated that passion and steered a lot of what followed - especially over the next 10 years or so - and re-established R&R as the genre of choice for those of us who lived through that time. (I’ll interject here that I base this opinion not only on what I’ve read on the subject but what I remember living through and listening to during that time, having just turned 14 when the Beatles appeared on Sullivan’s show in February of 1964.) __________________________________________ Here is a video that explains an aspect of the success and their importance in musical history. It is one I had not heard or seen before and includes superlatives that even a Beatles fan like me finds surprising. But who am I to argue?  ",
            "date": "Updated September 22, 2019",
            "views": "53",
            "upvotes": " View 30 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Paul Murray",
                    "user_href": "/profile/Paul-Murray-37"
                },
                {
                    "user_id": "John Lundquist",
                    "user_href": "/profile/John-Lundquist-2"
                },
                {
                    "user_id": "Randy Garcia",
                    "user_href": "/profile/Randy-Garcia-99"
                },
                {
                    "user_id": "Niki Wonoto",
                    "user_href": "/profile/Niki-Wonoto"
                },
                {
                    "user_id": "Robbie Johnson",
                    "user_href": "/profile/Robbie-Johnson-81"
                },
                {
                    "user_id": "Jeremy Burk",
                    "user_href": "/profile/Jeremy-Burk-2"
                },
                {
                    "user_id": "Jim Gray",
                    "user_href": "/profile/Jim-Gray-43"
                },
                {
                    "user_id": "Ken Fishkin",
                    "user_href": "/profile/Ken-Fishkin"
                },
                {
                    "user_id": "Richard Olowendo",
                    "user_href": "/profile/Richard-Olowendo"
                },
                {
                    "user_id": "Matt Sipprell",
                    "user_href": "/profile/Matt-Sipprell"
                }
            ]
        }
    ]
}