{
    "title": "Why is worship music so lame nowadays? - Quora",
    "tags": [
        "Christian Music",
        "Lame",
        "Idol Worship (religious beliefs)",
        "Religious Worship",
        "Music Genres",
        "Worship and Worshipping",
        "Music Industry",
        "Christianity",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "AJ Crawshaw",
                "href": "/profile/AJ-Crawshaw"
            },
            "answer_text": "This is a question I have been asked and have asked myself for many years as a professional musician who also is a devout Christian. In some ways it’s not a fair question when secular music is also so derivative. But what I think most people mean is where are the great works of art? In the past I have put it down to “we have less creators and less resources than mainstream big label acts” so in other words it’s just the sample size is smaller, so there’s less chance for Genius to shine. In addition I would argue there are Christian artists who do write and continue to write very innovative music, but perhaps not worship music… Again we hit the problem does the church (its people) still desire to fund transcendent art on the scale of Queen or Radiohead or most recently Childish Gambino for it’s worship? In the past with Classical music the church employed the best songwriters who wrote songs that have lasted and will last for generations. Do we have that level of art being created from the church now…? Honestly I don’t think so. So what has changed? Well as I’ve hinted the church is no longer the patron of the arts it once was but also I think church culture has changed. Let me explain… Recently I learned two things from experts in the social sciences that floored me and changed my view. Firstly, voting behaviour is heavily influenced by personaility type. The biggest indicators being that the higher you are in the conscientious personality trait the more more likely you are to vote conservative (to the right) and the higher you in the open minded personaility trait the more likely you are to vote liberal (to the left). So what does this have to do with church culture? It will come as no surprise that muscians measure very highly on the open minded personaility trait. But what was of great interest to me, and my second discovery is that the modern christian church is filled with conservatives or people who measure high on the personality trait Conscientious and in fact modern churches are run by these same people too. This isn’t necessarily true of all churches, but by and large churches are deeply conservative to the point where many evangelical churches core structure mirrors that of the modern day coropration complete with a CEO pastor and middle managers. Now lets circle this back to the original criticism, “Christian music is unoriginal or lame.” I have a growing suspicion that churches are low in true creativity and entreprenuership. The people who run them are conscientious but not very creative and not so open to creative or new ideas. Also in their congregations there are very few highly creative poeple due to the conservative bias, and the creatives just not wanting to be there. Like minds stick together type deal. Thus the default I believe is for churches to not create but imitate and especially with the music. So instead of new songs or genres being encouraged in christendom, instead we turn our worship teams into cover bands for the faithful. And when we do create, the song writers are encouraged to write like this group over here or that group over there who are already successful. We now have song writing trends in Christian music. Our praise songs at the moment are all danced based electro pop and our worship songs are epic ballads or “Mumford and Sons” style hipster music. This isn’t just in the church world, copying is exactly what labels have been doing with song writing too over the decades. Music is becoming more and more homoginised in the world too. There are some excellent studies that back this up showing that we now hear a significantly less broad range of sounds in our recorded music on the radio then even a decade ago. The problem is this makes sense for a label who is trying to turn a profit. Copy what works! They are a business after all. But why is this the case with the church? My follow on question (or what’s top of my mind) isn’t the usual “Why aren’t we doing better than the world when our God is creator?” But rather, why aren’t we encouraging our song writers to write our local songs for our local worship? I think the church is actually trying to imitate the world and in so doing forgetting the needs of it’s immediate congregations. So what is the solution? Do we just throw our hands up in the air, and accept that the church is following the way of the label and the corporation and not following the bibilical instruction of the psalmist to “Sing a new song on the Lord.” Well no, I think this is where leaders can be bigger than there own natures and give space to the messy open minded creative people and let them create. I suspect that the Christian church frequently pushes away it’s most creative people unintentionally. When I was studying music almost my entire class started their love for music in the church and most of them felt the church wasn’t some where for them anymore. Many of them still believed in God just not church. I also think those same leaders should let their songwriters sing new songs on the stage on Sunday. Even if it doesn’t work. Even if it isnt as “good” as the latest mega church song. And when they fail and they will fail from time to time they should encourage them and then let them do it again and learn from the experience. Bigger churches could sponsor song writing retreats. There could be roles in the congregation of songwriter just like pastor or usher or musician. Sounds pretty messy right? Well the reason for allowing all this perceived risk of awkwardness is simple. The church is a body and its members need to function in their roles, see 1 Corinthians 12 for proof. And further the bible tells us to sing a new song constantly through the Psalms. It’s scripture and that should be what we base our churches on, not our personalities, biases or prejudices, or if our present congregations happen to be more Conscientious than Open minded. I believe the church has songwriters and great artists in it right now, I worry that we just aren’t giving them a voice. ",
            "date": "Answered October 19, 2020",
            "views": "36",
            "upvotes": " Answer requested by Misi Kosisek",
            "upvoters": [
                {
                    "user_id": "Misi Kosisek",
                    "user_href": "/profile/Misi-Kosisek"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jay Dee",
                "href": "/profile/Jay-Dee-39"
            },
            "answer_text": "Because it has no substance anymore. For the most part, Christian worship music has followed secular music - they’re chasing what makes people feel good, rather than imparting truth. Relying on specific beats, more or less on affecting a change in the state of mind - a form of hypnosis really. But look at the old hymns - a lot of scripture. Hard won truths. Beautiful to sing, but not “trippy”. The words are full of revelation born of pain, suffering and perseverance. Those are songs that have lasted centuries and still have meaning today. But contemporary music? Well, I mean, it’s pretty, but most of it is empty. That’s why they don’t last. When the only pain you’ve dealt with in your life are “first world problems”, it’s not going to have the same impact as a man who was told to renounce his faith as they killed his wife and children, one by one while he sang verses of what became a hymn, ultimately converting his accuser after he died a martyr. That’s the power of music born of real faith and testimony, something sorely lacking these days. But, don’t worry. The world is slowly destroying itself. The time again will come when true believers (I don’t think they’ll be called Christians anymore, because that term is becoming meaningless) will be harshly persecuted - our lives will be risked for our faith, and great Christian music, born of pain, suffering and perseverance will likely start to come out of it. I’m not sure that’s a great trade-off, but I have little doubt it will happen - the music part I mean. The persecution I’m quite sure is coming very soon. ",
            "date": "Answered October 19, 2020",
            "views": "24",
            "upvotes": " View 1 Upvoter "
        }
    ]
}