{
    "title": "Why do artists like singers or rappers have to grab their crotch all the time when they're performing? - Quora",
    "tags": [
        "Hip Hop and Rap Artists",
        "Hip Hop Music",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Charles Joseph Smith",
                "href": "/profile/Charles-Joseph-Smith"
            },
            "answer_text": "Now since the “Me Too” movement had now been made public, this is not the 1980s anymore. Now that sexual harassment is now into full view in the Hollywood’s world, there might be more and more crackdowns on non-penetrable types of harassment—not just the penetrable type of harassment (which includes “groping”), which includes crotch grabbing. Crotch grabbing is now generally outlawed in the workplace unless you are in the strip clubs. Everywhere else, it is flagged as blatant sexual harassment, which can lead to one being fired or even sued. Do that on a public street, this is a form of lewd conduct, and most municipalities forbid such a public act in their city or town ordinances. Get caught, and you get arrested, jailed, and/or face a stiff fine, and most likely you will be fronting a magistrate to answer to your unacceptable act. In other conservative environments outside the workplace, this act will get you an ejection from the store or other business, or even places like parks. In non-conservative environments, like DIY venues, the crotch-grabbing is less frowned upon but there were stories where people had been kicked out of even DIY house venues for this act. The technique of doing this often-taboo thing mentioned, in some places, and in some countries (especially the United States), can generally get even a celebrity musical artist into big trouble. Most people call this crotch-touching technique “dry humping”, which is a form of fapping (which is masturbation), and some people strongly object to this practice even today. Especially at people who had been already sexually abused or raped, and see this type of humping as something that can cause the severest nightmares in these already-abused people, forcing them to relive unwanted sexual advances and assaults they experienced in the past as victims. In a few environments, I heard horror stories that you can be charged with a more serious crime - not lewd conduct - but sexual assault, if you do this type of fapping. We had seen that when Prince almost did his crotch-grab in the triple-x song, “Nikki”, during the filming of “Purple Rain”. a lot of people objected to this risque act. If it were done by someone else, that person would be kicked off the stage, and likely out of the theater. And even Madonna herself was threatened with arrest if she did this act during the “Blind Ambition” tour, when she did a show in Toronto in 1990. The lesson of course is you can do this type of fapping still but not everywhere. Just don’t do it in places where they won’t allow you to do so. With that, my idea on why musicians fap like this despite the risks are several reasons — The rise of the 1970s disco era.The rise of the resurgence of gay culture.The temptation of being free with your sexual fantasies.",
            "date": "Answered March 28, 2018",
            "views": "158",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jacob Cumberbatch",
                    "user_href": "/profile/Jacob-Cumberbatch"
                },
                {
                    "user_id": "Minh Quân Nguyễn",
                    "user_href": "/profile/Minh-Quân-Nguyễn-1"
                },
                {
                    "user_id": "Gaston Bachelard",
                    "user_href": "/profile/Gaston-Bachelard"
                },
                {
                    "user_id": "Craig Boyle",
                    "user_href": "/profile/Craig-Boyle-5"
                },
                {
                    "user_id": "Barbara Roush",
                    "user_href": "/profile/Barbara-Roush-1"
                },
                {
                    "user_id": "Chris Ringgold",
                    "user_href": "/profile/Chris-Ringgold"
                },
                {
                    "user_id": "Michaelene Williamson",
                    "user_href": "/profile/Michaelene-Williamson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Ngugi",
                "href": "/profile/Mark-Ngugi"
            },
            "answer_text": "Well, it usually is rappers who do so and not really singers, being a side hustle rapper myself, I will offer what I think its the best explanation for this phenomenon even though the act happens pretty much subconsciously. While holding the microphone with your dominant hand, say you are right handed, you will find your left hand grappling with your crotch. Rapping is usually a mentally challenging task that allows you to produce an intricate sequence of words in a specific amount of time and usually to the rhythm of a beat.  As with most mentally challenging tasks, you find a part of your body physically contorting to match the level of strain being applied to your brain. For example footballers bouncing a ball on their foot would have the fingers of their hands twisted in an almost arthritic manner to give them the mental balance they require to perform flawlessly.  It is the same with hip hop, there isn't really much explanation as to why the left hand would gravitate to the crotch, but its a method of giving balance and stabilizing your flow. Plus it looks cool. ",
            "date": "Updated December 29, 2017",
            "views": "48",
            "upvotes": " View 38 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ace Hawkeye",
                    "user_href": "/profile/Ace-Hawkeye"
                },
                {
                    "user_id": "Jacob Cumberbatch",
                    "user_href": "/profile/Jacob-Cumberbatch"
                },
                {
                    "user_id": "Laurence Graber",
                    "user_href": "/profile/Laurence-Graber"
                },
                {
                    "user_id": "Andy Lutz",
                    "user_href": "/profile/Andy-Lutz-6"
                },
                {
                    "user_id": "Malachi McCoy",
                    "user_href": "/profile/Malachi-McCoy-1"
                },
                {
                    "user_id": "Jainatva Jain",
                    "user_href": "/profile/Jainatva-Jain"
                },
                {
                    "user_id": "Christa Rohdy",
                    "user_href": "/profile/Christa-Rohdy-2"
                },
                {
                    "user_id": "Amit",
                    "user_href": "/profile/Amit-1835"
                },
                {
                    "user_id": "Georgia Kincaid-Richter",
                    "user_href": "/profile/Georgia-Kincaid-Richter"
                },
                {
                    "user_id": "Niranjan Thangavel",
                    "user_href": "/profile/Niranjan-Thangavel"
                }
            ]
        }
    ]
}