{
    "title": "Why does Korean pop music have very less male fans? - Quora",
    "tags": [
        "Korean Pop Music",
        "Music Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rachel Shen",
                "href": "/profile/Rachel-Shen-9"
            },
            "answer_text": "I’m not totally sure: I think most of it would be gender norms. What seems more normal to you: a girl squealing over a cute guy or a guy squealing over a cute girl? Fangirling is more accepted than fanboying. Especially with pop music, a female pop star will have many female fans for being cool or cute or whatever, but a male pop star will also have more female fans than male fans: Queen Bey has a lot of female fans because of how cool she is, but Justin Bieber (:|) has more female fans than male fans. So with the fans of male and female idols being more generally female, fandoms end up more female. Another thing about gender: Masculinity is generally associated with strength and manly jaws and tanned biceps. Things like pale skin are more accepted on females than on males, and this is the same with makeup. Idols, however, end up wearing lots of makeup, and in Korea, they end up with light skin too. This separates them from the general idea of masculinity, making them less cool to many males. Female fans can listen to music from girl groups or fangirl over guys. Males, however…? Pop music is more feminine, I think. Even if there were equal amounts of guys and girls who were interested in a boy band, I imagine there would be less guys than girls obsessed with songs like Russian Roulette or Me Gustas Tu. So…yeah? ",
            "date": "Answered December 18, 2016",
            "views": "46",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Masuma Khan",
                    "user_href": "/profile/Masuma-Khan-30"
                },
                {
                    "user_id": "Aris Love",
                    "user_href": "/profile/Aris-Love-1"
                },
                {
                    "user_id": "Chong jia Qi",
                    "user_href": "/profile/Chong-jia-Qi"
                },
                {
                    "user_id": "Amethyst",
                    "user_href": "/profile/Amethyst-45"
                },
                {
                    "user_id": "James Williams",
                    "user_href": "/profile/James-Williams-888"
                },
                {
                    "user_id": "Ebba Brunvall",
                    "user_href": "/profile/Ebba-Brunvall"
                },
                {
                    "user_id": "Olivia Foxwood",
                    "user_href": "/profile/Olivia-Foxwood-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yuhaehan Yeonghyang",
                "href": "/profile/Yuhaehan-Yeonghyang"
            },
            "answer_text": "I think it depends upon how we see it. There are male fans in the fandoms but they can be seen lesser because of the extreme reactions given by the female fans. If you’re active in the KPop community, you would know there’s a male fan that shouts encouraging words at the top of his voice whenever the idols make a public appearance. He is a real fanboy and doesn’t hide it. I think male fans may hide their liking for a group. For girls, it is easier to shout to show their love towards their idols but that may be difficult for most of the male fans. There are male fans who go to the boy group fansigns and people make videos saying ‘KPop idols (male) reactions to male fans’. This is another reason many male fans feel shy to come out and accept their faves in the open. I personally listen to all kinds of groups including boy and girl groups and fangirl over them endlessly. Thus, it isn’t a matter of how less male fans are there in the fandom, but a matter of how many we can see. ",
            "date": "Answered May 25, 2018",
            "views": "964",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Masuma Khan",
                    "user_href": "/profile/Masuma-Khan-30"
                },
                {
                    "user_id": "Aris Love",
                    "user_href": "/profile/Aris-Love-1"
                }
            ]
        }
    ]
}