{
    "title": "Why is Cardi B famous, she's terrible? - Quora",
    "tags": [
        "Cardi B (musician)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mercedes Beato",
                "href": "/profile/Mercedes-Beato"
            },
            "answer_text": "You have probably only heard her rap. She can actually sing. I heard her sing a Whitney Houston song in one interview. Furthermore, her rapping is good. She stays on beat and sounds good rapping. It is very catchy. Some don’t like what she raps about. The content and rapping are two different things. The fact that she can rap is what draws people. Some people may feel her rapping content is inappropriate for children. That may be true, but it doesn’t mean she has no talent. When I first heard Cardi B on the radio while overseas, I didn’t care for the lyrics in and of themselves. But it didn’t take away from her ability to rap. I was wishing she was rappping about something different. After I saw her on TV, I realized she was funny and charming, raw, uncut and most of all vulnerable. People like people who allow themselves to be vulnerable. Cardi B was already on her way to the top before she joined the Show Love and Hip Hop. Cardi B is famous because she has the right amount of followers. When you are famous at this level, you usually have a lot of people working for you. Included in this group are the A and R people who see to it that radio stations play her music across the world. One thing I know about the Latin American Community is that they support each other. When I was in the Spanish Caribbean, I heard her song Bodak Yellow every three minutes on major Radio Stations. That speaks for itself. The Caribbean Community backs her up. Millions of people live there. Her parents are from different parts of the Caribbean, so do the math. ",
            "date": "Answered December 21, 2018",
            "views": "119",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Selene Sara",
                    "user_href": "/profile/Selene-Sara"
                },
                {
                    "user_id": "Stacey Lyday",
                    "user_href": "/profile/Stacey-Lyday"
                },
                {
                    "user_id": "Sneha Raveendran",
                    "user_href": "/profile/Sneha-Raveendran-2"
                },
                {
                    "user_id": "Garvita Singh",
                    "user_href": "/profile/Garvita-Singh-1"
                },
                {
                    "user_id": "Jonathan Bernal",
                    "user_href": "/profile/Jonathan-Bernal-5"
                },
                {
                    "user_id": "Nicole Johnson",
                    "user_href": "/profile/Nicole-Johnson-1311"
                },
                {
                    "user_id": "Lexie",
                    "user_href": "/profile/Lexie-239"
                },
                {
                    "user_id": "Ronald B",
                    "user_href": "/profile/Ronald-B-1"
                },
                {
                    "user_id": "Catherine S. Todd",
                    "user_href": "/profile/Catherine-S-Todd"
                },
                {
                    "user_id": "Sankalp Shukla",
                    "user_href": "/profile/Sankalp-Shukla-41"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mikael Chuaungo",
                "href": "/profile/Mikael-Chuaungo"
            },
            "answer_text": "She was kinda famous through Vine and Instagram during her stripper days, way before her music career started. Music companies then decided to promote her. See, this is how the music industry works. Ever once in a while record companies will decide on who will be the musical star between xxx period to xxx period. They decide what genre of music should be famous, and they get to decide what the public should like or not like. They will hire managers and social media specialists to pump news and controversies, put these new stars to TV shows, create scandals etc etc. Basically any person can be turned into a music star. As for Cardi B’s talent, her singing and rapping skills are as average as the next girl in a church choir. She used to be a stripper and solicit men for money. In her latest video she even admitted to drugging men and robbing them of their money. Some sexual favors here and there and BOOM you become an international star. Is she terrible? Well music is subjective. Some people like her music, some people dont. For me, she is a song spoiler. I really hate how she ruined Maroon 5’s “Girls Like You” song with her ear bleeding horrible mid-section rap. As for her personality, yes, she has a terrible personality. I have no respect for parents who allow their teenage children to go watch Cardi B. If she was a male, like Bill Cosby or R. Kelly, she would be in jail today (for drugging and assaulting her customers during her prostitution days) ",
            "date": "Answered March 27, 2019",
            "views": "169",
            "upvotes": " View 115 Upvoters ",
            "upvoters": [
                {
                    "user_id": "J Choi",
                    "user_href": "/profile/J-Choi-2"
                },
                {
                    "user_id": "Subir Nag",
                    "user_href": "/profile/Subir-Nag-2"
                },
                {
                    "user_id": "Jennifer Rodriguez",
                    "user_href": "/profile/Jennifer-Rodriguez-117"
                },
                {
                    "user_id": "Selene Sara",
                    "user_href": "/profile/Selene-Sara"
                },
                {
                    "user_id": "Ceren Ogal",
                    "user_href": "/profile/Ceren-Ogal"
                },
                {
                    "user_id": "To M Jing",
                    "user_href": "/profile/To-M-Jing"
                },
                {
                    "user_id": "Farhaan Farooqui",
                    "user_href": "/profile/Farhaan-Farooqui-1"
                },
                {
                    "user_id": "Renate Massek",
                    "user_href": "/profile/Renate-Massek"
                },
                {
                    "user_id": "Rishi Kar",
                    "user_href": "/profile/Rishi-Kar-7"
                },
                {
                    "user_id": "Jean-Francois Anstead",
                    "user_href": "/profile/Jean-Francois-Anstead"
                }
            ]
        }
    ]
}