{
    "title": "Why do guitar strings only vibrate at the first harmonic? - Quora",
    "tags": [
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tyler Brown",
                "href": "/profile/Tyler-Brown-55"
            },
            "answer_text": "They don’t. They vibrate at all of the harmonics, but the fundamental frequency and first overtone are an octave apart—in other words, it’s the same note—and every overtone above those first two harmonics is at a simple ratio that doesn’t clash with the original “root” note. This makes it sound like just one note, even though it most certainly isn’t. One way to show this is to play a string and then lightly touch that string right above the 12th fret. You’ll hear a distinct change in sound, as though the string is vibrating an octave above where it was before, but you’ll also notice an odd lack of change—the “new” note was always there. You could always hear it, and by touching the string at the 12th fret you’ve just muted all of the harmonics below that one, letting it shine through loud enough to hear clearly. This can also be done, with a tad more difficulty, at the 7th and 5th frets, producing different, higher harmonics. In theory, you can play such “harmonics” anywhere on the string, though they would often be too quiet to hear or even survive you touching the string. Enter distortion—the overtones are equalized closer to the amplitude of your fundamental frequency, so in the infamous “pinch harmonic” you’re just playing one of those hard-to-hear, upper register harmonics, and the distortion is amplifying it to audibility. This is also why Punk can get away with just using power chords—just the “root” note and the “fifth”, as opposed to the root, fifth, and third. The overtones for those notes line up nicely with the other notes that you would have had in a full chord, making it sound full even though it’s not. Interestingly, passing that full chord through distortion will give you some overtones that don’t fit the chord, adding some muddiness and discord that power chords eliminate. ",
            "date": "Answered February 19, 2018",
            "views": "732",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arjun Khetan",
                    "user_href": "/profile/Arjun-Khetan-2"
                },
                {
                    "user_id": "Brett Gildersleeve",
                    "user_href": "/profile/Brett-Gildersleeve"
                },
                {
                    "user_id": "Galahad Caliban",
                    "user_href": "/profile/Galahad-Caliban"
                },
                {
                    "user_id": "Tim Warner",
                    "user_href": "/profile/Tim-Warner-1"
                },
                {
                    "user_id": "Nicolas Azéraut",
                    "user_href": "/profile/Nicolas-Azéraut"
                },
                {
                    "user_id": "R. Eric Sawyer",
                    "user_href": "/profile/R-Eric-Sawyer"
                },
                {
                    "user_id": "Elwood Wyatt",
                    "user_href": "/profile/Elwood-Wyatt"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Song",
                "href": "/profile/John-Song-20"
            },
            "answer_text": "I think the question might be “why do guitar string vibrations miss the fundamentals”? Per Wikipedia - Missing Fundamental. “The fundamental frequency is not normally heard on acoustic guitars, classical guitars and other stringed instruments with one end of the strings anchored on a soundboard bridge which has a low profile, holding the strings close to the soundboard surface. In these cases, the lateral string vibration has no discernible effect on the bridge; instead, the bridge is excited by changes in string tension, which are twice the lateral wave frequency. On these instruments, listeners hear the first harmonic as the lowest note. Electric guitars are not like this; the fundamental frequency of each string is heard because the lateral string movement excites the electric pickups underneath the vibrating string.” ",
            "date": "Answered June 29, 2019",
            "views": "126",
            "upvotes": "0"
        }
    ]
}