{
    "title": "Why are some people obsessed with listening to music? - Quora",
    "tags": [
        "Listening to Music",
        "Listening",
        "Music",
        "Understanding Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mohit Rajai",
                "href": "/profile/Mohit-Rajai"
            },
            "answer_text": "For most people, listening to music is an important, daily activity. Even though people know that music is soothing and healing, they might not know exactly how music affects the brain. Here are five science-backed reasons why you should listen to music more often: 1. Eases pain According to a study from the Frontiers in Psychology journal, researchers found that patients with fibromyalgia who listened to music that they liked experienced less pain and had increased motor ability than when they listened to pink noise, also know as flicker noise. The music was played at a slower rate of less than 120 beats per minute.  2. Helps with focus If you need to focus, try listening to music specific to the late baroque period. Researchers from the Stanford University School of Medicine discovered that music led to brain changes that boosted attention and memory. The study was published in 2007.  3. Increases exercise performance Many fitness experts have recommended people to create a playlist that can energize the body. In several studies, researchers have concluded that fast, upbeat music can push people to workout harder and make the workout more enjoyable.  4. Boosts mood A 2011 study published in Nature Neuroscience found that classical music can trigger the brain to release dopamine, which improves mood and can make you feel happier.  5. Soothes If you have had a stressful day and want to calm down, try listening to mellow music. A study conducted in 2013 and published in Ergonomics found that listening to mellow music could effectively reduce road rage. The music also improved participants' driving ability.  peace!!! ",
            "date": "Answered May 31, 2017",
            "views": "29",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jim Clem",
                    "user_href": "/profile/Jim-Clem-4"
                },
                {
                    "user_id": "Leni Del",
                    "user_href": "/profile/Leni-Del"
                },
                {
                    "user_id": "Prasad Dedhe",
                    "user_href": "/profile/Prasad-Dedhe"
                },
                {
                    "user_id": "Atul Balaji",
                    "user_href": "/profile/Atul-Balaji-1"
                },
                {
                    "user_id": "Gokul Manohar",
                    "user_href": "/profile/Gokul-Manohar-3"
                },
                {
                    "user_id": "Sri Athithya Kruth",
                    "user_href": "/profile/Sri-Athithya-Kruth"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jojo Eastfall",
                "href": "/profile/Jojo-Eastfall"
            },
            "answer_text": "I used to hate music, the concept. I thought it was all too emotional, sometimes vulgar and what not. Then I got into classical music. And it was all good but I only liked really aggressive classical music like Verdi's requiem, Dvorak symphony n.9 mov.4, and pieces alike. Then in the ninth grade my friend got me into pop punk, at first I faked liking it, and only listened to it so that I would have something to talk with him about. But then after three months or so, I paid attention for a moment, and found the music to be very entertaining ; it was fast, loud and most importantly : aggressive, well and Angsty, it's pop punk after all. I asked him what was the name of the band, and he told me : “A Day To Remember”, I asked him : “is that the name of that song you showed me today ?” and he told me : “no, that's the name of the band.” which to me was odd, for a band to have such a long name. Anyway, fast forward to 2017, and I started getting into heavier music like Rammstein and Metallica and many more. However, getting into modern music introduced me to some soft music that I also like very much, such as : Oasis, Tears For Fears and others. I used to look at people that were obsessed with music, or even just liked it, in disgust, I thought : “whats the big deal, just air waves making a sound, that's what you like ? Primitive.” Music is liked for many reasons : artistic, emotional some see music even as a sport. And music comes in many flavors, and in large margins. No wonder humans have been obsessed over music for hundreds and even thousands of years. And if that didn't convince you that music plays a special role in our lives, here's a famous saying from some German dude : “Without music life would be a mistake”  TL:DR Because reasons. Thank you for reading, so long and goodnight. ",
            "date": "Answered October 3, 2018",
            "views": "36",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ruth MacDonough",
                    "user_href": "/profile/Ruth-MacDonough"
                },
                {
                    "user_id": "Casper Van der Kamp",
                    "user_href": "/profile/Casper-Van-der-Kamp"
                },
                {
                    "user_id": "Asilah",
                    "user_href": "/profile/Asilah-1"
                },
                {
                    "user_id": "Willow Whisper",
                    "user_href": "/profile/Willow-Whisper-2"
                },
                {
                    "user_id": "Horeja Njie",
                    "user_href": "/profile/Horeja-Njie-1"
                },
                {
                    "user_id": "Darius Ausama",
                    "user_href": "/profile/Darius-Ausama"
                },
                {
                    "user_id": "María Camila Araujo",
                    "user_href": "/profile/María-Camila-Araujo"
                },
                {
                    "user_id": "William Parker",
                    "user_href": "/profile/William-Parker-146"
                },
                {
                    "user_id": "Greg Dahlen",
                    "user_href": "/profile/Greg-Dahlen"
                },
                {
                    "user_id": "James Griffith",
                    "user_href": "/profile/James-Griffith-58"
                }
            ]
        }
    ]
}