{
    "title": "Why is 'Amar Dubey' trending on Twitter? - Quora",
    "tags": [
        "Twitter (company)",
        "Trends"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arup R Bhagat",
                "href": "/profile/Arup-R-Bhagat"
            },
            "answer_text": "Today Gangster Vikas Dubey's close aide Amar Dubey was shot dead in an encounter with cops in Maudaha, Hamirpur.  Vikas Dubey is wanted in the killing of eight policemen in Kanpur and has been on the run since Thursday last week. Amar Dubey was also reportedly involved in the incident, which has also revealed the alleged nexus between criminals and some moles in the police department who tipped them off about possible action against them.  Till date, three policemen have been suspended for their alleged involvement in tipping off Dubey ahead of the police raid in which eight cops lost their lives and seven were seriously injured. The suspended police personnel include two sub-inspectors and a constable. In a major revelation on 5th July, an aide of the absconding gangster, Dayashankar Agnihotri, had admitted that someone from the police department had called Dubey and alerted him about the police raid. Dayashankar, a close aide of the notorious gangster, was arrested by police after being shot in the leg during an encounter in Kanpur's Kalyanpur area on 4th July. He was later admitted at a district hospital for treatment. He is one of the 18 aides of Dubey on whom the police had declared a reward of Rs 25,000 each. Dayashankar confirmed that after Dubey received a call from police ahead of the raid, he alerted his gang members who got the time to prepare an ambush for the police personnel coming to arrest him. THANK YOU! Sources:- N18, Twitter Times of India brings the Latest & Top Breaking News on Politics and Current Affairs in India & around the World, Cricket, Sports, Business, Bollywood News and Entertainment, Science, Technology, Health & Fitness news & opinions from leading columnists. ",
            "date": "Updated July 11, 2020",
            "views": "216",
            "upvotes": " View 79 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shubham Singh",
                    "user_href": "/profile/Shubham-Singh-3867"
                },
                {
                    "user_id": "Anupam Kumar",
                    "user_href": "/profile/Anupam-Kumar-214"
                },
                {
                    "user_id": "Srinivas Rao",
                    "user_href": "/profile/Srinivas-Rao-31"
                },
                {
                    "user_id": "Satish Nair",
                    "user_href": "/profile/Satish-Nair-31"
                },
                {
                    "user_id": "Neha Kumari",
                    "user_href": "/profile/Neha-Kumari-1667"
                },
                {
                    "user_id": "Devendra Sahoo",
                    "user_href": "/profile/Devendra-Sahoo"
                },
                {
                    "user_id": "Sachin Suman",
                    "user_href": "/profile/Sachin-Suman-6"
                },
                {
                    "user_id": "Ravi",
                    "user_href": "/profile/Ravi-1061"
                },
                {
                    "user_id": "Rupali Baruah",
                    "user_href": "/profile/Rupali-Baruah"
                },
                {
                    "user_id": "Hemant Kumar",
                    "user_href": "/profile/Hemant-Kumar-3723"
                }
            ]
        }
    ]
}