{
    "title": "Why is the accessibility of J-pop so low compared to K-pop? - Quora",
    "tags": [
        "Music of Japan",
        "J-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Poh Wee Chern",
                "href": "/profile/Poh-Wee-Chern"
            },
            "answer_text": "Originally answered: Why is the accessibility of J-pop is so low compared to K-pop? That's because Japanese record labels see no need in expanding access to foreigners. Foreigners are less likely to buy physical CDs and merchandises, which is a bulk source of income for them. But I disagree that the accessibility of J-pop is so low compared to K-pop. Sure, I'm salty that I can't listen to albums by artists like Shoose and Tokyo 7th Sisters on Spotify, but J-pop is a separate genre listed as J-tracks (which encompasses all kinds of Japanese music). And I am surprised by the range of artists available there. These are some obscure artists that have albums available there: Caro KissaYuki YumenoSennzaiAmatsukiNana CaratHikaru NobuokaMaruco.Eternal MelodyTsuzuru TakamorieillJ-pop isn't as inaccessible as it was 5–10 years ago. Edit (20/2/2020): In light of conversations related to J-pop and my own experiences with discovering J-pop in recent times, I'm updating this answer. There's a few additional factors that leads to the lack of accessibility of J-pop compared to K-pop. However, they still do not warrant the “so low” part of the question. First, when laypeople talk about J-pop, it's almost always big name groups such as AKB48 and ARASHI. These groups are indeed inaccessible for a very long time. As for ARASHI, it took until the death of Johnny Kitagawa, the founder of Johnny's in late 2019, to have their discography available on Spotify globally in 6th February 2020. There's also issues with legendary names such as SMAP and ZARD who aren't available outside of Japan and record labels see no benefits in increased access as they are either retired or dead. So, the perception of J-pop being inaccessible permeate through other names, including big ones such as Kenshi Yonezu even when it is untrue. In fact, a lot of Japanese record labels (Except Johnny's, Avex and SMEJ, but even those do have increased accessibility in 2020) started increasing access to their artists over streaming services, but the lack of promotion outside of YouTube means they remain unaccessed even when they are accessible. Ironically, I saw an a YouTube ad for Felicia sung by AZKi, which is a Virtual YouTuber. Yes, artists using virtual avatars do have good accessibility on streaming services. Second, some of the J-pop songs are tied up in terms of copyright. This holds especially true when video games songs are concerned. If the video games are region locked to Japan, then the songs featured in them will definitely suffer the same. The only exceptions to this are Aikatsu! & Show By Rock!!. But for the latter, some of the licensed artists are inaccessible in streaming services (I'm looking at you, Alice Juban!) Third, some of the artists are listed under their Japanese names instead of romanized names. This is more of a Spotify problem, but this increases barriers to accessibility of J-pop as not everyone can type in Japanese or know the workarounds on this issue. For K-pop, using romanized names are sufficient most of the time. In the end, the accessibility issues for J-pop while certainly significant, isn't exactly so low anymore, even compared to K-pop. ",
            "date": "Updated February 24, 2020",
            "views": "261",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Evelyn Medrano (에벨 린 메드 라노)",
                    "user_href": "/profile/Evelyn-Medrano-에벨-린-메드-라노-イヴリンメドラーノ"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Do",
                "href": "/profile/Michael-Do-2"
            },
            "answer_text": "To answer this question: It’s because Japan doesn’t know how to market. Also Japanese companies don’t pander to foreign market the way Hollywood does (for example: Hollywood pandering to China. And USA is not the only one that does it, yes, that include South Korea). You don’t see Japan doing the same like Hollywood and other countries are taking China seriously. So Japan is the odd one out when it comes to pandering to foreign countries and cashing in on trends. That’s why J-pop doesn’t have the same accessibility like K-pop is getting. I can say the same for C-pop. C-pop also suffer from that same issues. Also it doesn’t help people are saying C-pop doesn’t have the same attractive factor that make K-pop look good to western audiences. But that’s another topic. So Poh Wee Chern is sort of correct on why J-pop’s accessibility is so low. But I disagree with him over about how much accessibility there is for Japanese music. We may have some indies artists from Japan available in the US/west, but the big name J-pop artists aren’t even available on Spotify and Itunes. So that’s unfortunate and this is why K-pop will continue to dominate Asian pop music scene. If you want to know more about J-pop accessibility issue, you can read more information here: Japanese Entertainment 101: Accessibility - OH! Press Answerman - Why is it so tough to buy Japanese digital media downloads? I hope this help. ",
            "date": "Answered January 20, 2020",
            "views": "387",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Evelyn Medrano (에벨 린 메드 라노)",
                    "user_href": "/profile/Evelyn-Medrano-에벨-린-메드-라노-イヴリンメドラーノ"
                },
                {
                    "user_id": "Devrim Singh",
                    "user_href": "/profile/Devrim-Singh"
                }
            ]
        }
    ]
}