{
    "title": "Why do professional rappers' records sound good but amateurs sound really bad? Is it a difference in how they are mastered or mixed? - Quora",
    "tags": [
        "Audio Recording",
        "Rap Music",
        "Hip Hop and Rap Artists",
        "Sound",
        "Music Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marlon Frazier",
                "href": "/profile/Marlon-Frazier"
            },
            "answer_text": "Two major things. For starters, National recording artist typically have access to top quality recording studios with legendary audio engineers to hone their sound to be industry standard. Most new or \"amateur\" rappers do not have the resources for these so their music is going to sound sub-par compared to those with money. But, to be honest it also boils down to technique. You can have a multi million dollar studio but still sound like shit if your engineer or your self doesn't know what you are doing. I've heard songs made in bedrooms that sound the same if not better then anything on the radio.  To me, it's a mixture of things to get that top quality sound. It's part equipment , part talent and a big part engineering. In this day and age, with cheap recording equipment and access to tutorials online, a new rapper with a decent budget of $2000 doesn't have much excuse to not be putting out at least good sounding quality music. ",
            "date": "Answered February 11, 2015",
            "views": "54",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Zach Phillips",
                    "user_href": "/profile/Zach-Phillips-9"
                },
                {
                    "user_id": "Matt Rayne",
                    "user_href": "/profile/Matt-Rayne-1"
                },
                {
                    "user_id": "Eve Lean",
                    "user_href": "/profile/Eve-Lean-1"
                },
                {
                    "user_id": "Neo You Ming",
                    "user_href": "/profile/Neo-You-Ming"
                },
                {
                    "user_id": "Thomas Shera",
                    "user_href": "/profile/Thomas-Shera"
                },
                {
                    "user_id": "Travis Cormack",
                    "user_href": "/profile/Travis-Cormack-1"
                },
                {
                    "user_id": "Steven Malm",
                    "user_href": "/profile/Steven-Malm"
                },
                {
                    "user_id": "Peter Bartholomew",
                    "user_href": "/profile/Peter-Bartholomew"
                },
                {
                    "user_id": "Nandan Chandregowda",
                    "user_href": "/profile/Nandan-Chandregowda"
                }
            ]
        },
        {
            "author_info": {
                "name": "Audun Kvitland Røstad",
                "href": "/profile/Audun-Kvitland-Røstad"
            },
            "answer_text": "I've recorded and mixed lots of hip-hop artists. Some pro, some amateurs. Sometimes it's possible to make an amateur sound awesome, but to be honest the most important part is the skills of the rapper.   I would say to make a song sound professional you would need a good mixing and mastering engineer but also a good rapper.  The room where you record could also play an important part. As rap artists usually use a lot of words in a short amount of time it is important to make them sound clear. So if your room has too much reverb that might be a problem. ",
            "date": "Answered February 23, 2015",
            "views": "26",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jainatva Jain",
                    "user_href": "/profile/Jainatva-Jain"
                },
                {
                    "user_id": "Eve Lean",
                    "user_href": "/profile/Eve-Lean-1"
                }
            ]
        }
    ]
}