{
    "title": "Why is so much of the power of metal music derived from the bass guitar compared to other genres of music (guitar, bass, instruments, technique, style, audio, mixing, sound, harmonics, harmony, chord progressions)? - Quora",
    "tags": [
        "Audio mixing (recorded music)",
        "Bass (sound)",
        "Bass Guitar",
        "Music Genres",
        "Heavy Metal (music)",
        "Music Theory",
        "Guitars",
        "Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rob Pember",
                "href": "/profile/Rob-Pember"
            },
            "answer_text": "Adding to what others have said, as with other genres, bass “glues” the guitar and drums together - but in metal the bass often uses a more aggressive tone and goes lower (either with 5 string or downtuning). Another thing is that the lowest frequencies of the bass guitar go lower than the kick drums(s), which in tandem with the kick drum(s) in metal often emphasising the “click” sound, leaves more space for the bass guitar to be heard/felt. ",
            "date": "Answered July 14, 2020",
            "views": "35",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Eliott Baker",
                "href": "/profile/Eliott-Baker-1"
            },
            "answer_text": "Bass is the backbone of almost every genre of music, not just metal. If fact, even some top 40s songs have incredible bass lines that you’re average bass player would have trouble playing. Without those bass lines the song would not have any groove. Most metal music (At least the stuff I play and listen to) is ALL about the groove. The drums and the bass set that groove and everything else is written around it to “dress it up”. ",
            "date": "Answered July 7, 2020",
            "views": "44",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gregory Domurat",
                    "user_href": "/profile/Gregory-Domurat"
                }
            ]
        }
    ]
}