{
    "title": "Why are synthwave music and retro-electro music so “addictive”? - Quora",
    "tags": [
        "Retro Electro",
        "Synthwave",
        "Electro Music",
        "Electronic Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Trini Cariaga",
                "href": "/profile/Trini-Cariaga"
            },
            "answer_text": "I think it’s a sense of fantasy and escapism that comes with the genres. It’s the same reason people like Steampunk. It’s a re-imagined and idealized version of what once was presented in a way of what could have been. Personally, I find something so dreamy and calming about 80’s Revival music. A lot of people were raised hearing music from the past few 50 years or so, and so these genres also just mean a lot to them and touch on their memories of growing up and so they get a sense of nostalgia about it as well, which makes it “addicting” to the listener. Sidenote: Thank you for linking to Quixotic! I’ve never heard of them before.. I’m adding that song to my synthwave/vaporwave/80s playlist :P. Since you like Synthwave, if you haven’t heard of them already, you might like Myzica. They aren’t too well known. Also, I can’t stop listening to this song lately. ",
            "date": "Answered September 20, 2017",
            "views": "18",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dominic Stewart",
                    "user_href": "/profile/Dominic-Stewart-29"
                },
                {
                    "user_id": "Sagnik Banerjee",
                    "user_href": "/profile/Sagnik-Banerjee-37"
                },
                {
                    "user_id": "Micca",
                    "user_href": "/profile/Micca"
                },
                {
                    "user_id": "Om Herekar",
                    "user_href": "/profile/Om-Herekar"
                },
                {
                    "user_id": "Marcus Schumann",
                    "user_href": "/profile/Marcus-Schumann"
                },
                {
                    "user_id": "Cristiane de Lima Santos",
                    "user_href": "/profile/Cristiane-de-Lima-Santos"
                },
                {
                    "user_id": "Jefferson Sigi Loso",
                    "user_href": "/profile/Jefferson-Sigi-Loso"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rama Chandran",
                "href": "/profile/Rama-Chandran-737"
            },
            "answer_text": "First off I want to say I am not a fan of the whole genre, but some of the music and songs made in this style can very addictive. Songs like FM Attacks “Stranger” “My Life” “Magic” or “Fireflies” by Spire Wolf , have that bright, optimistic “Christmassy” sound. Layers upon layers of different 1980s synth sounds, many times overlapping each other but bouncing off and playing off each other in harmony. There is just no other genre capable of such harmonies. The female vocals in “Stranger” is very seductive, feminine and heartfelt. The melodies are of prime importance, not like early 1990s techno music which is only stronger beats and bass given the utmost importance, kind like a jaded feeling decade to me. For the 1980s sounds pop-ish sounds, there is a trippy happy playful sheen to them. ",
            "date": "Answered October 20, 2020",
            "views": "26",
            "upvotes": "0"
        }
    ]
}