{
    "title": "Why aren’t singing teachers famous singers? - Quora",
    "tags": [
        "Pop Singers and Musicians",
        "Singing Voice",
        "Singers",
        "Voice",
        "Singing",
        "Teachers",
        "Fame and Mass Popularity",
        "Musicians",
        "Celebrities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kenneth Jaffe",
                "href": "/profile/Kenneth-Jaffe-1"
            },
            "answer_text": "There have been many examples of great singers being teachers, as well. However, one of things I think you may be getting at with this question is what stops more opera singers from becoming teachers than, say, a great trombonist? Much of this lies in the fact that a symphonic career can lend itself to being much more sedentary and less peripatetic than that of an opera singer. Even if you compare the schedule of a top tier solo pianist or violinist with that of an opera singer, the lifestyle is, indeed, quite different. With the exception of the rare person who sings/sang almost exclusively in concert in Lieder or Oratorio like (Hermann Prey or Thomas Quasthoff), most singers are really theater actors who are on the road, intensely working on a production for several weeks, only to be ripped up from that location to be in another city halfway around the world. Such a schedule hardly lends itself to being a dependable teacher in a single location for an aspiring singer who needs regular weekly guidance. Indeed, there have been many great RETIRED opera singers who have had illustrious careers, such as the great Virginia Zeani at Indiana University, or Marilyn Horne (now at Oberlin). Many great instrumentalist, even soloists, have often had their careers anchored as being first chair players in a top tier orchestra. For instance, there is a good chance that an upcoming brass player might want to study at Northwestern University, as many of the members of the Chicago Symphony are members of its faculty. This is a famous example, but this same dynamic often plays out all over the globe. Bottom line is that the lifestyle of a great singer leads by necessity to be jet-set, while most instrumentalists can lead a more stable life. This was one reason many great singers may not be famous, because it can be brutal on any but the individual with rare constitution to stomach that rough a life. ",
            "date": "Answered January 2, 2020",
            "views": "230",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Stephanie Jackson",
                    "user_href": "/profile/Stephanie-Jackson-340"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Leigh",
                "href": "/profile/David-Leigh-1"
            },
            "answer_text": "Disclaimer: I’m not famous but I sing with a lot of famous people. When singers get together, we often get to talking about technique, and it’s taught me a lot, both about how to sing and about what it takes to be a great teacher. When you talk to working singers, we tend to have a few basics that we rely on. These are tenets that we think of daily, in singing, all the time. But we also tend to always have a latest obsession of the moment. So if you ask us about singing, we’ll briefly talk you through our three basic building blocks, and then we’ll excitedly show you this thing we’ve been practicing. This is not what young singers need. Young singers need to be painstakingly talked through the basics, in 100 different ways. But active career singers don’t think about it that way—I know how to sing a balanced forte on an A natural, I don’t need to have 100 ways to get there. So I just remember the one way I need, and I focus my energy on things that will give me a marginal edge in other ways. There are, at many fancy conservatories, great singers who move into teaching later in life. Most of these people can be very helpful to a number of beginning singers, but also useless to many others. And then I’ve met a few truly great singers who have become great teachers, but this is a totally different skill—these people are just good at two things. The things are barely related. ",
            "date": "Answered December 30, 2019",
            "views": "43",
            "upvotes": " View 41 Upvoters",
            "upvoters": [
                {
                    "user_id": "Scotty Wright",
                    "user_href": "/profile/Scotty-Wright-4"
                },
                {
                    "user_id": "Lynn Bain",
                    "user_href": "/profile/Lynn-Bain-3"
                },
                {
                    "user_id": "Sagar Shekhar",
                    "user_href": "/profile/Sagar-Shekhar-16"
                },
                {
                    "user_id": "Sophia Marie Herrick Scott",
                    "user_href": "/profile/Sophia-Marie-Herrick-Scott"
                },
                {
                    "user_id": "Natasha V",
                    "user_href": "/profile/Natasha-V-19"
                },
                {
                    "user_id": "Keith Calhoun",
                    "user_href": "/profile/Keith-Calhoun-5"
                },
                {
                    "user_id": "Gyan Dissanaike",
                    "user_href": "/profile/Gyan-Dissanaike"
                },
                {
                    "user_id": "Marc David",
                    "user_href": "/profile/Marc-David-24"
                },
                {
                    "user_id": "Jessica Johnson",
                    "user_href": "/profile/Jessica-Johnson-1414"
                },
                {
                    "user_id": "Filipe Santos",
                    "user_href": "/profile/Filipe-Santos-14"
                }
            ]
        }
    ]
}