{
    "title": "Why has China’s government banned Facebook, Twitter, YouTube, etc? - Quora",
    "tags": [
        "Facebook Vs. Twitter",
        "Government of China",
        "Twitter (company)",
        "Facebook (company)",
        "Twitter (product)",
        "The Internet",
        "YouTube",
        "Facebook (product)",
        "China"
    ],
    "response": [
        {
            "author_info": {
                "name": "Derek Harkness",
                "href": "/profile/Derek-Harkness"
            },
            "answer_text": "I'll let Xi Jinping answer that for me: Full Text: Message of Congratulations from Chinese President Xi Jinping - Xinhua Xi said, \"the development of the Internet has posed new challenges to national sovereignty, security and development interests.\" Facebook et al. are foreign companies. China prefers local companies over foreign firms and often puts restrictions on foreign firms to protect homegrown talent. For example, there is a limit on the number of Hollywood movies that can be shown per year, so only the biggest names come to China and the domestic movie industry and grow. Same goes for the internet. China wants its domestic firms to develop and not get shouted out by multi-billion dollar Giants. China likes to control the message and censor the media, some foreign companies play ball (Yahoo! and Microsoft) while others refuse (Google, Twitter, Wikipedia[1]). Google used to comply with Chinese censorship, then suddenly it withdrew and redirected all its search traffic to their Hong Kong site instead of the .cn site. Another point to make is that Facebook et al. might not care that they are blocked. Google still does business in China. They have offices in Beijing and they sell advertising to Chinese firms. Likewise Facebook's CEO, Mark Zuckerberg is no stranger to China, he has even learned the Chinese language to an acceptably high level. He has discussed/made major deals with Chinese internet firms. There are two ways to enter a foreign market. You can take your own brand into the country and try to eek out a bit of the market share over many years, or you can just buy into one of the existing players in that country and get instant market share. Even when Google was in China, it didn't have the success that has had elsewhere. Yahoo has been in China for a very long time but has always struggled to capture the market even back when Yahoo was bigger than Google (remember then). Facebook also was never really popular in China. Facebook may have more success in the Chinese market by taking a stake in Chinese social media firms in just the same way that Yahoo has a huge stake in Alibaba. [1]Wikipedia? but that isn't blocked is it. Well, it is partly blocked. The Chinese version of Wikipedia is blocked and sensitive pages on the English site are blocked. Before 2008, Wikipedia was completely blocked. ",
            "date": "Updated February 16, 2017",
            "views": "491",
            "upvotes": " View 71 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Cornelius Johannes",
                    "user_href": "/profile/Cornelius-Johannes-1"
                },
                {
                    "user_id": "Hazik Khan",
                    "user_href": "/profile/Hazik-Khan-6"
                },
                {
                    "user_id": "Prince Kay",
                    "user_href": "/profile/Prince-Kay-35"
                },
                {
                    "user_id": "Jooquv Uîl",
                    "user_href": "/profile/Jooquv-Uîl"
                },
                {
                    "user_id": "Mueller Frank",
                    "user_href": "/profile/Mueller-Frank"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/OOS-B"
                },
                {
                    "user_id": "Dalip Singh",
                    "user_href": "/profile/Dalip-Singh-136"
                },
                {
                    "user_id": "Rongchen Xia",
                    "user_href": "/profile/Rongchen-Xia"
                },
                {
                    "user_id": "He Jastar",
                    "user_href": "/profile/He-Jastar"
                },
                {
                    "user_id": "Saurav Das",
                    "user_href": "/profile/Saurav-Das-33"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mingze Zhang",
                "href": "/profile/Mingze-Zhang"
            },
            "answer_text": "I know people will talk about propagenda, will talk about brain-washing, will talk about fear, etc. etc., they are all true. I hate the GFW too. However, if you think more, all the banned US media are biased, they are actually very biased. Not only biased towards China matters, but even many of the US matters. One example would be the recent Clinton vs. Trump. NEW YORK — Talk radio star Michael Savage has characterized his being abruptly pulled off the radio on Monday afternoon following a discussion of Hillary Clinton’s health issues as an act of “pure sabotage.” EXCLUSIVE – Michael Savage Reacts to Being Pulled From Radio Following Hillary Health Segment: ‘Pure Sabotage’ - Breitbart Given that those US media and social networks are even biased towards US matters, will you believe that they are fair to China? And to Chinese, even American Chinese? Watch this, and youtube denied to take it down after receiving complaints from Chinese immigrants.  Can you imagine a Chinese posting this on youtube against another race in America? I’m sure that it will be taken down asap. Another example would be Google. Google manipuated searching keyward hints regarding Hillary’s health and scandal matters. However, when Chinese govenment ask Google to do the same thing regarding scandals of Chinese govenment, Google refused and quit from China. Is there any reason to not block Google? I think standing on the govenment point of view, all govenments except US shall block Google and US media because they can’t control them. And when US is agasint one country (govenment), the search engines, the social networks will help a lot. In summary, I believe the ultimate reason to ban them is that US take China as enemy, and US’s media are too biased on China matters. Then whether it’s fear, brain-washing or propagenda, as you wish the answer would be are just reasons floating on the surface. Lastly I’ll tell you a true joke. My wife was applying US visa (in Shanghai), we were planning a trip to California. During the visa interview: the interviewer: describe your job my wife: media data analysis (actually work on audience rating analysis, providing data to ads companies) the interviewer: does it realate to data collection and data analaysis my wife: yes the interviewer: check. Please send me your detailed description of your company and we will send back to US for further background check. Btw, my wife’s collegue also applied US visa, and she only talked about ads and audience rating, without the sensitive keyword, and she got the 10 years multi-entry visa. How rediculous is this? you can judge it yourself. ",
            "date": "Answered September 28, 2016",
            "views": "134",
            "upvotes": " View 46 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rindang Anggit",
                    "user_href": "/profile/Rindang-Anggit"
                },
                {
                    "user_id": "Elaine Hawkins",
                    "user_href": "/profile/Elaine-Hawkins-16"
                },
                {
                    "user_id": "Long Le",
                    "user_href": "/profile/Long-Le-108"
                },
                {
                    "user_id": "Julian Hejna",
                    "user_href": "/profile/Julian-Hejna-1"
                },
                {
                    "user_id": "Nanthan Taglor",
                    "user_href": "/profile/Nanthan-Taglor"
                },
                {
                    "user_id": "Alicier",
                    "user_href": "/profile/Alicier"
                },
                {
                    "user_id": "劉 ",
                    "user_href": "/profile/劉-1"
                },
                {
                    "user_id": "Ma Jiangang",
                    "user_href": "/profile/Ma-Jiangang"
                },
                {
                    "user_id": "Hongle Sun",
                    "user_href": "/profile/Hongle-Sun"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/OOS-B"
                }
            ]
        }
    ]
}