{
    "title": "Why are there songs that are recorded live and don't have a studio version? - Quora",
    "tags": [
        "Music Recording",
        "Live Music",
        "Music Production",
        "Rock Music",
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Levine",
                "href": "/profile/Jeff-Levine-1"
            },
            "answer_text": "There is a studio version of I Want You To Want Me.  It is on the album In Color.  It is very rare that a song is on a live album without a studio version, unless it is a cover version from another artist that the artist tended to play in concert (Stay by Jackson Browne) or a collaboration between artists at a special concert (Stay by Jackson Browne with Bruce Springsteen).  With that said there are a lot of live versions of songs that are better known than their studio version.  Back in the 70s and to an extent the 80s, live albums were a much bigger deal than they are today.  Superstar live albums could be expected to sell millions of copies.  And, even more importantly, they were used to help break artists that were thus far unable to sell a lot of albums but were big concert attractions.  Cheap Trick and Peter Frampton are the two biggest examples of this.  Other artists that got to the next level because of a live album include Kiss, Bob Seger and REO Speedwagon.   Examples of live versions of songs being bigger hits than their studio counterpart: Maybe I'm Amazed, Rock N Roll All Night, and Candle in the Wind ",
            "date": "Answered April 8, 2014",
            "views": "1",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Peter Smith",
                    "user_href": "/profile/Peter-Smith-45"
                },
                {
                    "user_id": "Josh Briggs",
                    "user_href": "/profile/Josh-Briggs"
                },
                {
                    "user_id": "Brian Farr",
                    "user_href": "/profile/Brian-Farr"
                },
                {
                    "user_id": "Stéphanie Andrade",
                    "user_href": "/profile/Stéphanie-Andrade"
                }
            ]
        },
        {
            "author_info": {
                "name": "Miguel Zapata",
                "href": "/profile/Miguel-Zapata-4"
            },
            "answer_text": "Some songs just aren’t deemed fit for a studio album. Studio albums really have one goal - to sell money. The more nice songs there are, the better the sales of the album. On the artistic side, albums need to be coherent. They will have a theme or a certain sound. Some songs written during the sessions for a release may not fit the album that is created as a result of the said session. That is also why some songs will be released in albums much later, but will be noted to have been written at a previous session. So when a song is unreleased as a studio cut, where does it go? If it’s a good song nevertheless, then you will find it performed at a live show. And if that show gets recorded, then it becomes part of the live release. ",
            "date": "Answered October 15, 2018",
            "views": "152",
            "upvotes": "0"
        }
    ]
}