{
    "title": "Why are backbeat drums so important in rock music? - Quora",
    "tags": [
        "Backbeat Drums",
        "Drums",
        "Rock and Roll Music",
        "Rock Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Keenley",
                "href": "/profile/James-Keenley"
            },
            "answer_text": "To put it as clearly and concisely as possible, rock music is all about the backbeat. “Backbeat” basically means putting the emphasis/accent on a beat in the measure where one typically wouldn’t expect to find it. If you know even the basics of music theory, the emphasis is on the second and fourth beats of the measure, rather than on the first. If you know nothing about music theory (and that’s fine), pick a famous rock and roll song, sing it softly to yourself, and notice where the emphasis lies. An easy example to see this is the introduction to the Rolling Stones “Get Off My Cloud.” Listen to Charlie Watts’s drumming: dum-DUM-dum-DUMDUM dum-DUM-dum-DUMDUM or one-TWO-three-FOUR one-TWO-three-FOUR ",
            "date": "Answered October 7, 2017",
            "views": "782",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Sheehy",
                    "user_href": "/profile/Michael-Sheehy-4"
                },
                {
                    "user_id": "J.R.",
                    "user_href": "/profile/J-R-541"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ethan Hein",
                "href": "/profile/Ethan-Hein"
            },
            "answer_text": "Like all popular forms that descend from the African diaspora, rock is a delivery system for drum grooves. Everything else—lyrics, melodies, chords, arrangement, production techniques, etc—is decoration. The backbeat isn’t the only drum groove that goes well with rock, there are others that work well too. But there has to be some kind of Afrodiasporic groove, otherwise the music isn’t doing its job. ",
            "date": "Answered August 9, 2019",
            "views": "384",
            "upvotes": "0"
        }
    ]
}