{
    "title": "Why does Led Zeppelin still remain as the biggest rock band that ever existed? - Quora",
    "tags": [
        "Robert Plant",
        "Led Zeppelin (band)",
        "Classic Rock Music",
        "Rock and Roll Music",
        "Rock Bands",
        "Bands (music)",
        "Rock Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eric Johnson",
                "href": "/profile/Eric-Johnson-774"
            },
            "answer_text": "First of all let's just roll with \"one of\" the biggest since rock band is a bit nebulous here. There's the Beatles....but are they a rock band.... or pop, rock & roll even prog? Anyway it's an aspect of the market isn't it? It's all about what people want and think. Led Zeppelin arguably had the best rock drummer in the world with them in John Bonham, one of the best and most interesting guitarists with Jimmy Page. A most expressive and unique stylistically singers Robert Plant, and a well suited very talented bassist who got the music and was excellent at arrangements, John Paul Jones. Between them they created a unique form of the music we call \"Rock\"… and set the blueprint as well as the bar for everything that came after. Oh, and if that wasn't enough, they wrote \"Stairway to Heaven\". As I said though, in answer to the actual question, it's the people that put them there. ",
            "date": "Answered October 13, 2020",
            "views": "119",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Marilyn Jean Meissner",
                    "user_href": "/profile/Marilyn-Jean-Meissner-1"
                },
                {
                    "user_id": "Robert Laszcz",
                    "user_href": "/profile/Robert-Laszcz"
                },
                {
                    "user_id": "Hercilio Zanin Junior",
                    "user_href": "/profile/Hercilio-Zanin-Junior"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lindell B. Jones Jr.",
                "href": "/profile/Lindell-B-Jones-Jr"
            },
            "answer_text": "I wouldn’t say they’re the “biggest” — the Beatles and the Stones were definitely bigger, and then there are bands like Black Sabbath and Deep Purple. But Led Zeppelin is definitely *one* of the biggest rock bands to this day because their music has stood the test of time. Almost all of their music, every time I listen to it, sounds nearly as fresh as it did the first time I heard it. There’s just nothing that gives the same feeling as Jimmy Page’s guitar and Robert Plant’s voice together, not to mention their excellent drummer, John Bonham… ",
            "date": "Answered October 18, 2020",
            "views": "84",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Anders Karlsvik",
                    "user_href": "/profile/Anders-Karlsvik"
                }
            ]
        }
    ]
}