{
    "title": "Why do some people feel like Jennie from BLACKPINK isn't genuine compared to the other members? - Quora",
    "tags": [
        "Black Kpop",
        "Jennie (BLACKPINK)",
        "BLACKPINK",
        "K-Pop Idols"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mary Zhou",
                "href": "/profile/Mary-Zhou-26"
            },
            "answer_text": "First and foremost, the points I am about to establish are not entirely Jennie’s fault. There are certain things that YG will tell her to do, and she will have to that just do not mesh well together. Also, all of my conspiracies in my second point are only unproven theories. Do not spread whatever information I put there as true, as that may be harmful to Jennie and YG when none of this is proven, only speculated. 1. Her aegyo and innocent persona and her badass and queenly persona This was one of the things that first rubbed me the wrong way when I still was an avid Blink. Almost all the members try to form this duality, much like what BTS Jimin has where he is naturally cute and innocent-like off stage, but is a charismatic, sexy powerhouse when on stage. To achieve this, it is obvious that all four members purposely speak in a cuter tone, raise the pitches of their voices, and make cute faces at the camera whenever possible on TV broadcasts and their own shows. But I’m almost definitely sure that this is something YG makes them do in order to try and make them appeal to audiences that both like a badass attitude but also a innocent, babygirl persona. For the rest of the members, that duality somewhat works (ie. people have just accepted that Lisa is naturally cute like that, which I do believe based on how loving and doting her parents are to her), but just not as much for Jennie as it makes her come across as insincere and ‘manufactured’. I have friends who criticize Jennie for her music video for Solo, stating that it clashed because YG was trying to paint both a powerful persona for Jennie, but also an innocent, good girl one. They said that YG managed to achieve neither, and would have done better with more scenes like that ending one where she’s dancing amongst a group of backup dancers, looking like a true queen. I really agree, as the music video and the song never really stuck with me until that final scene came up. In my most humble opinion, I think Jennie would fit a badass, queenly, and savage persona almost all the time. It seems to fit her more naturally and is actually the reason why she appeals to so many of her fans, not just internationally but even in Korea. Her savage-ness and strong attitude was also what made me a fan of hers, and I really think it suits her better than any other concept. 2. Her lazy dancing This was a huge scandal happening some time ago, but the after effects of it are still here and she is still getting criticized. The gist of it was that some fans would catch Jennie taking small breaks in the choreography during serious performances, such as their world tour, and not completing certain dance moves correctly while the rest of the three members were giving their all. Over time, more and more proof of her lazy dances surfaced, but there were no official statements by YG explaining what happened; YG just started deleting videos, which most definitely only heated the fire more. My interpretation of this, however, is that logically speaking, Jennie would never lazy dance on purpose. She had been a trainee for seven years, ready to debut at fifteen but then criticized enough to delay all of that. Why the hell would she throw her actual career away now after all she experiences she suffered through as a fifteen year-old to stay afloat in the industry? She wouldn’t. Several reasons come to mind as to why this lazy dancing may be happening: she’s hurt, sick, mentally unwell, two of those, or all of them. BlackPink wears heels and elaborate stage costumes to dance all the time. It has been seen before that all it took was for Lisa’s pants to catch on her leg during a performance to scratch her up pretty well, almost to the point of bleeding. What if Jennie actually cut her leg pretty badly somewhere? What if she hurt her ankle dancing in heels? Accidents also happen, like one did with Kim Heechul during the height of his career when he got into a car accident and hurt his leg permanently and causes him to still not participate fully in choreography anymore to this day. It’s well established by now that YG would not care enough to pull Jennie out of promotions in order to let her heal properly if something serious did happen, but then again, what if the haitus was because of Jennie or another member getting hurt and having to heal? And if that really did happen, what if she never healed completely and is still in pain? Or an alternate possibility—Jennie may be going through major mental health issues. It’s obvious that Kpop stars have to maintain their weight diligently, or risk being shunned by fans for it. It has been seen during interviews and shows that when it comes to the topic of weight, Jennie is one of those girls that has to work in order to keep those pounds (or kilograms) off. Whenever weight loss is mentioned, Lisa is always the first one to speak and state that her skinniness and low weight is completely natural, and that she will eat properly but never actually gain weight. Jennie, as a joke, will usually follow up with a lighthearted, “How lucky”. This means that Jennie is always actively working to keep her weight in check, which is a huge undertaking. It has been seen that all the members having been slimming down these days, and Rosé has recently been seen as skinny as Lisa, maybe even more. Being surrounding by other beautiful, talented, and skinny girls must have put pressure on Jennie to stay skinny or be skinnier.  (skip to 37:32) Now, the point of all of this is that in all the clips of Jennie lazy dancing, she genuinely has a face of stress and anxiety, and she looks like she’s struggling and tired sometimes too. If she’s not eating properly or overworking herself in order to stay skinny, then perhaps she decided to take it too far and is now mentally unwell. Whether or not she is hurt or not eating properly, both can also explain why she is ‘more energetic’ in her Solo promotions. The girls of BlackPink should be close enough by now to tell each other at least some of their deepest and darkest secrets, right? If Jennie was hurt of is struggling with eating, then at least one of the members may have noticed or been told. What if they made a decision between themselves to let Jennie rest during their group performances, where she is easier to hide, and take it easy so that she has enough energy or pain tolerance to make it through her solo performances successfully? There is no doubt that the rest of the girls are considerate and loving enough to agree to try and mask Jennie’s lackluster dancing in order to ensure that she can do her thing on her solo stage while dealing with whatever fatigue or pain she may be going through. And if any of this is really true, unfortunately, YG does not care enough to have monthly physical and mental health checks to confirm or deny either of my claims. If she really is dealing with not eating well enough (to say the least) or if she’s hurt, then YG should have investigated the situation as soon as haters started posting about it. They also should have wasted no time in ensuring that they are speaking and taking good care of Jennie to make sure that everything is alright. But because YG never took the time to do that, they managed to put all the blame on Jennie herself. She is the only one we can criticize for her lazy dancing because YG never put out any statements as to what the heck is going on, which is again, very irresponsible of YG, but we as fans are used to it by now. This has also made Jennie seem very insincere and irresponsible herself because she is clearly not as involved as her group members during performances, but never gave a reason as to why. It makes her seem spoiled and ungrateful for being able to debut and make it big, and only fuels the fire of those that claim that Jennie is nothing but a pampered YG princess. Yet this is YG’s fault for not allowing her to put out a statement about it, or not putting out a statement themselves. The final portion of all of this is her trauma from when she was younger. As stated before, Jennie had once been scheduled to debut long ago as a solo artist, back when she was only fifteen or so (yes, she was that talented). When YG and even G-Dragon promoted her so much and supported her even more than some of the already-debuted artists in YG, the backlash was strong, and people criticized Jennie, again, for being a spoiled little YG princess. That nickname is now coming back to haunt her again, as well as the heavy mix between loving fans but also hardcore haters, and she must have some sort of trauma from that time when she was fifteen and got more a lot more hate than she deserved. This has been convinced that in addition to whatever she is going through to make her not dance properly is also being coupled with the fact that her mental state is being severely shaken by the influx of accusations and criticisms because of it. This is probably why that interview she did that everyone claimed was the creepiest thing they ever saw was that off-putting.  That interview was done right after all of the backlash for her lazy dancing happened, and her mental state was probably a mess. YG probably also forced her to do the interview anyway, resulting in her trying to keep herself together and trying to smile and be positive, but as seen in the video, it just could not come out right. 3. Final Thoughts Overall, I don’t know. I really do not know why people paint Jennie as insincere, because despite coming across as putting on several different persona’s to try and appeal to all audiences, she may be forced to by her company. That duality really is not working for her, however, and just sticking to either cute and innocent or badass and carefree may work for her more. But realistically, Jennie is such a loving group member and that shows in so many interviews and shows she does. She has her flaws but why the hell focus on those when she has ten times the amount of strengths? On the other hand, the lazy dancing happening may be because of so many things that it really is just hard to jump to one assumption and stick with it. Again, none of my theories up there have concrete proof, so please do not treat my theories as supported or true claims. But finally, I think that people will think, believe, and say whatever they want whenever they want. We humans are quick to judge, fast to shun (too fast), and slow to take back hurtful and maybe even wrong opinions. Whether there is correct reasoning behind radical judgments and negative comments will alway be in the eye of the beholder, so really, after so much analysis, I still do not and will never have a solidified answer for you. Maybe the answer is just to open our hearts a bit and close our mouths more. If only closed minds came with closed mouths… Be more accepting and patient for the truth before criticizing and hurting. If that would happen, then this would not even have to be a question to be answered. ",
            "date": "Updated October 25, 2019",
            "views": "192",
            "upvotes": " View 107 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Koko Yamada",
                    "user_href": "/profile/Koko-Yamada"
                },
                {
                    "user_id": "Lia Lee",
                    "user_href": "/profile/Lia-Lee-90"
                },
                {
                    "user_id": "Allan Cruz",
                    "user_href": "/profile/Allan-Cruz-67"
                },
                {
                    "user_id": "Aria Lee",
                    "user_href": "/profile/Aria-Lee-42"
                },
                {
                    "user_id": "Shay Hollywood",
                    "user_href": "/profile/Shay-Hollywood"
                },
                {
                    "user_id": "Spring Mercado",
                    "user_href": "/profile/Spring-Mercado"
                },
                {
                    "user_id": "Twinkle Dias",
                    "user_href": "/profile/Twinkle-Dias-1"
                },
                {
                    "user_id": "Puja Singh",
                    "user_href": "/profile/Puja-Singh-1675"
                },
                {
                    "user_id": "Rose Launois",
                    "user_href": "/profile/Rose-Launois"
                },
                {
                    "user_id": "Zahra Nawab",
                    "user_href": "/profile/Zahra-Nawab-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jade Kim",
                "href": "/profile/Jade-Kim-69"
            },
            "answer_text": "I’m not sure. There are a ton of reasons I could give you. But I think it’s because her idol image and her actual self seem like two completely different people. So to international fans see her as…I don’t know..fake? But she’s not the only idol like this. They all live double lives as more than one person. That’s the business. Most of the time, she’s asked to act a certain way by YGE. Sure, she could be doing some things of her own will. Sure she could be tired of the same dance and songs while the others are still giving it their all. But they’re aren’t all the same person, they experience different emotions/issues. Think about what someone else is going through before you judge them. This goes for anyone, famous or not. ",
            "date": "Answered September 2, 2019",
            "views": "24",
            "upvotes": " View 23 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kate Lewis",
                    "user_href": "/profile/Kate-Lewis-62"
                },
                {
                    "user_id": "Sweet Sour",
                    "user_href": "/profile/Sweet-Sour-27"
                },
                {
                    "user_id": "Shay Hollywood",
                    "user_href": "/profile/Shay-Hollywood"
                },
                {
                    "user_id": "Twinkle Dias",
                    "user_href": "/profile/Twinkle-Dias-1"
                },
                {
                    "user_id": "Nagarajan Gurusamy",
                    "user_href": "/profile/Nagarajan-Gurusamy-8"
                },
                {
                    "user_id": "Lauren Park",
                    "user_href": "/profile/Lauren-Park-122"
                },
                {
                    "user_id": "Bina Gogoi",
                    "user_href": "/profile/Bina-Gogoi-5"
                },
                {
                    "user_id": "Cams Maglaqui",
                    "user_href": "/profile/Cams-Maglaqui"
                },
                {
                    "user_id": "Mahiyat Alam",
                    "user_href": "/profile/Mahiyat-Alam"
                },
                {
                    "user_id": "Babita Konwar",
                    "user_href": "/profile/Babita-Konwar-1"
                }
            ]
        }
    ]
}