{
    "title": "Why do most teenagers seem to not like classical music? - Quora",
    "tags": [
        "Contemporary Classical Music",
        "Classical Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Austen Yueh",
                "href": "/profile/Austen-Yueh-2"
            },
            "answer_text": "Classical pianist and clarinetist here (oh, and I guess I'm still a teenager too) so I'll give this a shot, based on my own observations and interactions with people over the years. First: I think the question makes an implicit assumption that adults like classical music more than teenagers. I've found this to be only slightly true; adults are just a little less vocal about it. Second: From experiences doing classical outreach programs to kids of various ages, it's actually toddlers and very young children who are most receptive. If we try and talk to them they won't pay attention for more than a few seconds. But playing music holds their focus much longer, often with them making faces or moving along based on the musical shape/beat. These reactions slowly decrease with older age groups as kids figure out what's \"cool\" or not, suggesting that society's role in shaping (non-)enjoyment of classical music can't be underestimated. That being said, these seem to be the most common reasons teenagers (and adults) dislike classical music: Negative experiences. When I tell someone I studied and played piano for 14 years, a common response goes along the lines of \"oh, I remember when my parents made me take piano lessons... I quit when I was <insert single digit number here>. Practicing was so boring/too repetitive/my teacher always yelled at me/classical music just wasn't my thing.\" (Sadly, this is especially common with Asian kids.) Seriously, if I had a dollar for every time I heard this, I'd be well on my way to paying for MIT tuition.There are some really dedicated, talented teachers out there. But there's also a slew of mediocre ones eager to show off their 9- and 10-year-olds on difficult pieces far beyond their reach, or prescribing them something along the lines of \"play through this with the metronome 3 times perfectly each day\" without ever discussing musicality. If a performer's never connected emotionally with what he/she's playing, it'll always be a chore.Lack of exposure (aka Mozart != Chopin). Passing judgment of the entire genre based on one (or a few) composers is a bit like saying \"I don't like living in the US because New York City is expensive and crowded.\" I was fortunate enough to grow up with a fabulous piano teacher (aka my mom), so I got to hear and learn about a lot of variety growing up. Most classical musicians have their preferences: you'll find people who loathe Bach and people who live for it. And although I grew up learning lots of Haydn and Beethoven, I'd much rather listen to Rachmaninoff or Tchaikovsky. Plus people's tastes change over time as they accrue life experiences--first love, heartbreak, grief, loss, nostalgia--the list goes on.It's worth noting too, that classical music has made its way into popular modern-day movies, and people often don't consciously make the connection: (Schindler's List, anyone?) Shorter attention span / instant gratification. An average pop song--say, on a top 40 radio station--is just under 4 minutes. (It's a bit higher for some other genres, but not by much). In that time, you'll almost certainly hear the chorus within the first minute, and probably another two or three times before the song's over, in a fairly similar fashion each time.Believe it or not, a lot of classical music involves the same introduce-a-melody-early-and-repeat-it-every-so-often strategy. But heaven forbid you've gotta sit through a 45-minute symphony, or even a 15-minute piece for that gratification. In an age where more and more products are advertised as on-demand and faster, online shopping has taken over, and electronic communication has brought the world closer together, it's only natural that general attention span decreases.And as Rob stated in his answer, there will always be people who'd prefer other genres of music over classical, the same way some people choose tea over coffee or football over soccer. We're all individuals entitled to our own likes and dislikes; if we all shared the same tastes we wouldn't have the amazing variety of art and culture that we do. ",
            "date": "Answered July 31, 2014",
            "views": "306",
            "upvotes": " View 194 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Leigh",
                    "user_href": "/profile/David-Leigh-1"
                },
                {
                    "user_id": "Aini Raihan",
                    "user_href": "/profile/Aini-Raihan"
                },
                {
                    "user_id": "Juhi Sinha",
                    "user_href": "/profile/Juhi-Sinha-47"
                },
                {
                    "user_id": "Ashish Devnani",
                    "user_href": "/profile/आशीष-देवनानी-Ashish-Devnani"
                },
                {
                    "user_id": "Luke George Barlow",
                    "user_href": "/profile/Luke-George-Barlow"
                },
                {
                    "user_id": "Ardit Broly",
                    "user_href": "/profile/Ardit-Broly"
                },
                {
                    "user_id": "Sarah Li",
                    "user_href": "/profile/Sarah-Li-203"
                },
                {
                    "user_id": "Vy Phan",
                    "user_href": "/profile/Vy-Phan-17"
                },
                {
                    "user_id": "Stephen Brown",
                    "user_href": "/profile/Stephen-Brown-787"
                },
                {
                    "user_id": "John Davies",
                    "user_href": "/profile/John-Davies-801"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexander Prähauser",
                "href": "/profile/Alexander-Prähauser-1"
            },
            "answer_text": "In addition to the arguments already presented, I think there are some that go fairly deeply into the way popular and classical music have diverged over the last century. Concert culture: Classical concerts are fairly boring affairs with people sitting around boringly in fancy clothes and only being allowed to show emotion during breaks. This is a modern invention, we know from Mozart’s letters that he was fairly delighted by spontaneous bursts of applause during performances. Improvisation is restricted to playing scores slightly differently and pieces for the piano have to be played from memory, both again trends that originated in the last century. That’s not gonna fly with a kids today.Timbre: Going by some of the other answers, apparently all young people have severe forms of ADHD. Yet if we look here: 32 million of these dastardly rascals were somehow able to sit through a 10 minute song. Now, most of the appeal of this piece actually comes from timbral variation, which is why I, and I imagine most lovers of classical music, find it fairly boring, but to a lot of people it sounds really awesome. But if we look at classical music (I’m talking about classical classical in this answer, not modern classical, which is a wholly different beast altogether), most of the development is melodic or harmonic, areas in which it really does shine. Timbre not so much. The most important classical solo instrument is the piano, which has almost no timbral range. Larger arrangements, like symphonies, have loads of timbral variety, but the instruments mostly stay within their lane. Violins, of course, are are the great exception, those have lots of timbral variation, though probably not as much as a modern electric guitar. Furthermore, to the modern teenager’s ear, these old instruments just sound a bit stuffy. Put the third movement of the moonlight sonata on an electric guitar, add a bit a bit of percussion and voila, you just got yourself 28 million views:  Percussion: This brings me to my next point, which is that most classical music doesn’t really have all that much interest in percussion. The rhythms are rather basic and are conveyed in subtle ways, like chords. I know there are some drums in larger compositions but they mostly get lost in the mix. It’s all very subtle and boring and sophisticated and boring and subdued and boring… young people like to dance. How are we supposed to do that without rhythm?Virtuosity: Tied in with all the points mentioned above is the difference in the treatment of virtuosity. Classical music, especially nowadays, doesn’t have too much use for the concept. You are supposed to play your piece or your part in the arrangement and the extent of your individual contribution is restricted to the nuances between the notes. Certain performers do reach a level of fame but since they would never be allowed to change the structure of the pieces they play, differences between performances are restricted to levels that are only interesting for the initiated . Meanwhile, popular music meanwhile is absolutely in love with the concept of the virtuoso performer. The lone genius rock star, the crazy genius rapper, the intoxicated genius DJ… people really love their geniuses! This also goes with a different treatment of the private life of the performers: I don’t think anyone has ever gone through the most minute details of Glenn Gould’s life, but I suspect were he to drunkenly rant about about being “the fucking fury\" on an air plane, it wouldn’t have gone over too well and he probably wouldn’t have used it as the name of one of his albums. Meanwhile, if you’re Beyoncé, you can pretty much kiss any trace of a private life goodbye but you’ll also forever have a legion of rabid fans that will defend everything you do forever. This also results in an attractiveness deficit for classical music: sure second violin in the Vienna Philharmonics might be enormously challenging, but it won’t get you laid nearly as much as having your own band does.Improvisation: I’ve mentioned this already but it might be my biggest pet peeve with classical music: improvisation, to me, is maybe the most interesting expression of musical creativity and it has been completely banned from classical music. This didn’t use to be this way, it only changed in the last century and I hate it. Admittedly, popular music also exists on a spectrum of improvisation but in general it is still a lot more spontaneous than classical. Furthermore, a lot of older compositions are basically treated as sacrosanct while covers of popular songs are commonplace and can differ significantly from the original. This is a shame all the more because most classical music is not copyrighted, so could be stolen and reused in all kinds of manners. Again, most of the composers were incredible thieves that incorporated whole passages of other composers mostly without credit. We should start doing that again.Counterpoint: One of the greatest strengths of classical music, to me, seems to be its treatment of polyphony, and specifically, counterpoint. It is an incredible way of adding complexity. Sadly, it has gotten somewhat lost in time. This isn’t just the fault of modern pop, mind you, already horrible hacks such as Mozart initiated this development towards homophony, but it is very sad. Still, modern audiences have a harder time appreciating the simultaneous development of multiple melodic voices, in part because they just don’t know what to listen to.Lyrics: A lot of popular music uses lyrics and some of it is almost solely interesting because of them. Classical music doesn’t do that. You might say that’s better because it gives it more room for interpretation, or worse because it limits its expressivity, but in any case, it gives young people less to identify with. Now, you might say, but what about Oprah? And it’s true that opera music and church corals have lyrics, but they are often in another language and even when they are not they are mostly used as a vehicle for harmonic ingenuity and even when they are not, works like Jesu, meine Freude hardly speak to the hardships of the modern teenager. Because the lyrics are so dated, in the way they are delivered as well as their themes, it is actually the instrumental works that are more able to establish a direct connection to contemporary audiences.Rebellion: Youth is all about finding out how adults suck and trying to do something new before dying inside and becoming the very thing you hated and part of the problem. Music to accompany this short period of rebellion should be revolutionary. Most of the genres coming into existence in the last century were drenched into some kind of rebellious ethic: rock, punk, grunge, even techno. And while Beethoven’s music might have been revolutionary at the time, it has since somewhat lost its edge. Modern classical music might actually be bound to political messages, like Jason Eckart’s 16, but there are other problems with it sketched below.Elitism: Now, there are plenty of people enjoying classical music that are a pleasure to be around. But there are also some that are really obnoxious about it. Admittedly, I have encountered this phenomenon mostly in reports by friends, but apparently it was enough to turn them off, so something has to be there. And I get it: if you found something that really fits you get passionate about it and might not even need to listen to much outside. But can you maybe try to not sound like an arrogant jerk? Which leads me to my next point:Modern classical: The quintessential myth of modernity is that everything gets better all the time, which doesn’t really fit with the idea that the best composers died hundreds of years ago. There is new classical music being produced, it’s just that it sounds horrible. Not even my friends with a classical background can bear that kind of stuff. Perhaps our ears are just not sophisticated enough to appreciate the intricate disharmony in pieces like these moderately modern ones (which I picked precisely because they are far from the most ear-piercing) but you can’t be surprised that nobody likes classical music anymore if you need a three-year diploma to appreciate it. A musical tradition is alive if people are making music in it that can be appreciated even outside of it. According to this definition, classical music is all but dead. There is even an arrogant disdain towards the idea of composing something that might actually be enjoyable, as recounted here by an actual composer Curtis Lindsay's answer to Why isn't modern classical music as catchy and melodious as old classical music? So all in all, stop being so serious, make attending concerts fun again, make new stuff that doesn’t suck, give it a beat and some messages about hating the man, man, and young people might start to like classical music again. ",
            "date": "Answered April 25, 2020",
            "views": "319",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lord Rafox",
                    "user_href": "/profile/Lord-Rafox"
                },
                {
                    "user_id": "Danny Oh",
                    "user_href": "/profile/Danny-Oh-5"
                }
            ]
        }
    ]
}