{
    "title": "Why did Bob Dylan decline so much after the 60s? - Quora",
    "tags": [
        "Bob Dylan (musician)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gary Cottier",
                "href": "/profile/Gary-Cottier"
            },
            "answer_text": "Well all artists have their peak era's where they produce their greatest work and although they may create some good work in their later years it never seriously compares to their great period, at least not on any consistent level. It happened to the Rolling Stones. They were untouchable from the mid sixties to the early seventies and reached a peak in 1972 with the release of their classic album Exile on Main St. and then the quality of their output started to deteriorate. The Beatles all produced some really good music as solo artists but nothing ever really compared to what they achieved as a band. The same for Bob Dylan. Why? There are various reasons. When you first start writing and recording you have loads of inspiration that you've gathered all through your life, you have a hunger and desire that simply cannot be sustained, you will probably be fairly poor in terms of finance when you start off and you probably haven't settled down in a relationship let alone have a family. All these things inevitably change. Artists are always at their best when most of these reasons apply, when you have things to write about and things to say. It's like a well and it certainty isn't bottomless and it will inevitably dry up. The Rolling Stones, The Beatles and Bob Dylan don't have an endless supply of talent or even genius in their case. Dylan's peak years from 1963-1966 are untouchable. Only The Rolling Stones 1965-1972, The Beatles 1963-1969 seriously compares to it (and maybe Bowie 1971-1980) but you just can't keep it up forever. In late 1966 Dylan was involved in a motorcycle accident that kept him laid up for a while. Around that time he also dropped out of live performance, bought a home and started to raise a family. Music was no longer the absolute priority in Dylan's life anymore. Obviously it still meant a lot to him but it wasn't the be all and end all of his life. This family ideal shone through in his 1969 album Nashville skyline, a lighthearted throwaway country record. It was clear that Dylan wasn't the force he once was. He had money and obviously had a lot less to say. Dylan would still be Dylan and would still continue to make some fine albums (Blood on the tracks, Desire, Oh mercy, Time out of mind and Love and theft are all excellent albums) but for every one of those there was a clunker. He would never be able to hit those heady heights of the mid-sixties again. It's just human nature. There is hardly any artist in the history of the world who can just keep churning out masterpieces like there's no tomorrow and Dylan's just the same. Everybody has a limit of talent, for good or bad, for better or worse, and the Rolling Stones, The Beatles and Bob Dylan pretty much used most of their's in the sixties. As I said, Dylan would still release some decent albums and still be a force in music. He would help to create country rock, gospel rock and set the standard for 'heartbreak' singer/songwriter albums but his mid-sixties records are the main reason why Bob Dylan is a musical legend.  The great Bob Dylan. ",
            "date": "Answered May 11, 2018",
            "views": "357",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Joe Forshaw",
                    "user_href": "/profile/Joe-Forshaw"
                },
                {
                    "user_id": "Larry Atchley Jr",
                    "user_href": "/profile/Larry-Atchley-Jr"
                },
                {
                    "user_id": "Mike Sheward",
                    "user_href": "/profile/Mike-Sheward-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Octavio Solis",
                "href": "/profile/Octavio-Solis-2"
            },
            "answer_text": "Dylan’s decline wasn’t so much a decline as a deliberate attempt to focus more of his energies on home life and family. He’d been through a scary motorcycle accident that took him out of the game, after all. Most of the songs that he wrote after John Wesley Harding centered around domestic bliss and its opposite, the loss of love. Music fans and critics alike wanted him to put out important politically trenchant material like that released in his first 8 masterpiece albums. But Dylan will do what Dylan wants. He released a country album displaying a new singing style, a croon that turned off many of his followers. He put out Planet Waves which didn’t aspire to anything but simple songs of love and loss. And the came Self-Portrait which enraged so many, but was meant to be exactly what it said it would be: a catalogue of the songs that described the complex tastes and desires of a man who’s too hard to pin down. So there’s Let It Be Me and Simon and Garfunkel’s The Boxer and some old folks tunes like Copper Kettle included. The album has since been reassessed as a significant contribution to his canon. He also quietly recorded some of his most important music with the Band at Big Pink, which wasn’t released until 1975 as The Basement Tapes. But his best albums awaited us. In the 70’s some of Rock’s finest albums came. Blood on the Tracks and Desire. In the late 80’s he was still making important albums but under his Christian phase, which didn’t go well with his old base and critics. But listen to Oh Mercy and you know he’s still in high form. And in the mid-90’s he finds another seam of gold that reaches into the new millennium. Time out of Mind, Love and Theft, Modern Times, Together through Life, Tempest. These late career albums are stunning; they represent a new resurgent persona for Dylan. I’m not so fond of his live albums, but they’re still records of his performances that shouldn’t be sniffed at. There was no decline. Only ebbs and flows. ",
            "date": "Answered September 18, 2018",
            "views": "1",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Janet Dixon",
                    "user_href": "/profile/Janet-Dixon-1"
                },
                {
                    "user_id": "Maggie McQuaid",
                    "user_href": "/profile/Maggie-McQuaid-2"
                },
                {
                    "user_id": "Lee S. Dennis",
                    "user_href": "/profile/Lee-S-Dennis"
                },
                {
                    "user_id": "Ryan Streit",
                    "user_href": "/profile/Ryan-Streit"
                },
                {
                    "user_id": "Jean Accoh",
                    "user_href": "/profile/Jean-Accoh"
                },
                {
                    "user_id": "Rick Kipner",
                    "user_href": "/profile/Rick-Kipner"
                },
                {
                    "user_id": "Mitch Belyea",
                    "user_href": "/profile/Mitch-Belyea"
                },
                {
                    "user_id": "John Zalewski",
                    "user_href": "/profile/John-Zalewski-9"
                },
                {
                    "user_id": "Tony Baron",
                    "user_href": "/profile/Tony-Baron-2"
                },
                {
                    "user_id": "Muiris Mac Cartaine",
                    "user_href": "/profile/Muiris-Mac-Cartaine"
                }
            ]
        }
    ]
}