{
    "title": "Why are Punjabi songs so popular, even in non-Punjabi speaking localities? - Quora",
    "tags": [
        "Punjabi Music",
        "Punjabi Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bhuvan Mansotra",
                "href": "/profile/Bhuvan-Mansotra-1"
            },
            "answer_text": "In this era of music world if the song feels good to your ears people love it, for example despacito it was a song with a melody and music which has 5.4 BILLION+ views which is a Spanish song got immense love from all over the world (despite being in Spanish language). This tells us that it's about melody and music by which people connect but not language. Let's come to Punjabi songs, I was in a traditional wedding were the DJ was playing Hindi songs but as soon as the Dj switched to Punjabi songs the atmosphere changed. I always believe Punjabi songs has got that melody, music, lyrics which get connected to our soul instantly. That's the reason a party is incomplete without a Punjabi songs n the producers of Hindi cinema are understanding this need……..I m Proud to be Punjabi  ",
            "date": "Answered August 12, 2018",
            "views": "506",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Monika Singh",
                    "user_href": "/profile/Monika-Singh-1266"
                }
            ]
        },
        {
            "author_info": {
                "name": "KanakPreet Kaur",
                "href": "/profile/KanakPreet-Kaur"
            },
            "answer_text": "The thing is, these songs are so relatable with our personal life situations that you’ll feel that the songs were written and sung only for you…as if the singer knows or feels your emotions… It’s not only about sad or romantic songs ,but it’s also the energy and positive vibes you get after listening party songs. Many punjabi artists have also said that they write or sing such songs because they not only express their individual feelings but also for people who’ve been through that phase…! ",
            "date": "Answered February 17, 2020",
            "views": "142",
            "upvotes": "0"
        }
    ]
}