{
    "title": "Why does everyone hate Ed Sheeran so much? - Quora",
    "tags": [
        "Ed Sheeran (musician)",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Candida Frith-Macdonald",
                "href": "/profile/Candida-Frith-Macdonald"
            },
            "answer_text": "If you look at the story, you see that’s not “people”. That’s twitter, which is a biased sample of loudly opinionated people. When you consider what has been posted to others on twitter (including death and rape threats), Sheeran has had very mild abuse. I wouldn’t call it “hate”, quite a lot of it seems to be a very tired ginger busker joke. Yawn. But why did he become a target, even in a relatively mild way? Probably ubiquity and a feeling that the people who praise his stuff do so uncritically and to an unwarranted degree. I mean, he’s fine, but he gets lauded as some incredible once-in-a-generation original talent, which is a bit of a stretch. To be fair, I don’t think he does that, it’s unimaginative press mostly. ",
            "date": "Answered August 15, 2017",
            "views": "24",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Atharva Singh",
                    "user_href": "/profile/Atharva-Singh-88"
                },
                {
                    "user_id": "Owen Jaquith",
                    "user_href": "/profile/Owen-Jaquith-1"
                },
                {
                    "user_id": "Devin Miller",
                    "user_href": "/profile/Devin-Miller-63"
                },
                {
                    "user_id": "Paul Irving",
                    "user_href": "/profile/Paul-Irving-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gary Becker",
                "href": "/profile/Gary-Becker-37"
            },
            "answer_text": "The question is “Why doesn’t everyone hate Ed Sheeran enough”? I can’t stand his whimpering, pouting, whining mouth just like the rest of today’s ‘weemale’ noise makers. And… Yes. He can make himself more presentable looking, starting with a shower. Comb his hair. Then shave off all the hideous red pubic looking hairs from his face. Wear something classier than that lumberjack shirt or the army jacket. I don’t normally believe in tanning spas, but he can use some color. He looks like a zombie from The Walking Dead. ",
            "date": "Answered June 5, 2019",
            "views": "4",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sarah Roberson",
                    "user_href": "/profile/Sarah-Roberson-2"
                },
                {
                    "user_id": "Haven Highlander",
                    "user_href": "/profile/Haven-Highlander"
                },
                {
                    "user_id": "Alexander Alexander",
                    "user_href": "/profile/Alexander-Alexander-366"
                },
                {
                    "user_id": "Rafael Ewald",
                    "user_href": "/profile/Rafael-Ewald"
                },
                {
                    "user_id": "Ahmed Marco",
                    "user_href": "/profile/Ahmed-Marco-1"
                },
                {
                    "user_id": "Igor Anatolievich",
                    "user_href": "/profile/Igor-Anatolievich"
                }
            ]
        }
    ]
}