{
    "title": "Why did Chester Bennington hang himself after playing with his kid? - Quora",
    "tags": [
        "Death of Chester Bennington (July 2017)",
        "Chester Bennington (musician)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mila Daniel",
                "href": "/profile/Mila-Daniel-1"
            },
            "answer_text": "Dare I answer that question, I don’t think he had it planned beforehand. I believe that it was more of a (tragic) spur-of-the-moment decision. I find it unlikely that he ever went to sleep thinking “I will take my life on July 20th”. His late friend, Chris Cornell’s birthday was definitely a rough time for him to go through and he probably had been dreading that date for days, but I don’t picture Chester as the type of person who would decide on which day or particular moment to end his life. Firstly because I think it is unusual for people who have suffered from persistent depression as long as he has to pick a precise day and decide that this day will be the last and secondly because I think - and that is highly subjective - that he is a spontaneous person.  photo : Study Breaks Magazine Even though suicidal thoughts have alienated him for most of his life, having those thoughts and planning a suicide attempt are two different things and while the former put an undeniable strain on him, I don’t think the latter especially occupied his thoughts in his last days. I can only assume that going through the motions of his day-to-day life, he might have felt that nothing altered his negative mindset anymore, lost hope that anything ever would and decided to do what had tempted him all along. I am almost certain that playing with his kids on that precise day did not come into the equation of balancing reasons to live for versus reasons why I no longer want to live. He may have felt hollow, not wanting anything more from life, because that is what depression is about to me: feeling that nothing is worth the effort, especially life itself and more importantly you actually don’t care about anything anymore. That kind of feeling is strong and when you’ve felt that way for a long time, you might snap, rather unpredictably and decide to end it. EDIT : I have watched a lot of interviews since I wrote this and retrospectively, I’m thinking that Chester might have considered taking his life on Cornell’s birthday a little more strongly than I first thought. I still believe that his mind was not completely set on what he was to do, however it is likely that sinister ideas were gaining ground in his mind, getting heavier every day, ever since Cornell passed away. ",
            "date": "Updated November 1, 2018",
            "views": "164",
            "upvotes": " View 23 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nigael Larcot",
                    "user_href": "/profile/Nigael-Larcot"
                },
                {
                    "user_id": "Anagha",
                    "user_href": "/profile/Anagha-62"
                },
                {
                    "user_id": "Sudeep Kohli",
                    "user_href": "/profile/Sudeep-Kohli"
                },
                {
                    "user_id": "Sári Emőke",
                    "user_href": "/profile/Sári-Emőke"
                },
                {
                    "user_id": "Jasmine Chowdhary",
                    "user_href": "/profile/Jasmine-Chowdhary"
                },
                {
                    "user_id": "Lakshya Singh",
                    "user_href": "/profile/Lakshya-Singh-20"
                },
                {
                    "user_id": "Kiran Babu",
                    "user_href": "/profile/Kiran-Babu-321"
                },
                {
                    "user_id": "Susan Jenkins",
                    "user_href": "/profile/Susan-Jenkins-157"
                },
                {
                    "user_id": "Chinmoy Saikia",
                    "user_href": "/profile/Chinmoy-Saikia-12"
                },
                {
                    "user_id": "Bhavesh Maurya",
                    "user_href": "/profile/Bhavesh-Maurya-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harry Johnstone",
                "href": "/profile/Harry-Johnstone-7"
            },
            "answer_text": "No one could ever attempt to fully understand anothers mind. I believe suicide is a fairly easy idea to understand… when someone feels their suffering from life outweighs their gratitude for life .. It becomes a mental battle. Because why is it worth it. This can, and does happen often. Some swing back, and some don't. In regards to your question. Perhaps he experienced total bliss with his son.. And decided to leave on a good note. ",
            "date": "Updated July 2, 2018",
            "views": "78",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lilly Jorgie",
                    "user_href": "/profile/Lilly-Jorgie"
                },
                {
                    "user_id": "Lakshya Singh",
                    "user_href": "/profile/Lakshya-Singh-20"
                },
                {
                    "user_id": "Asha Pai",
                    "user_href": "/profile/Asha-Pai-21"
                },
                {
                    "user_id": "Gamze Tiryaki",
                    "user_href": "/profile/Gamze-Tiryaki"
                },
                {
                    "user_id": "Yshwant Kumar",
                    "user_href": "/profile/Yshwant-Kumar-1"
                },
                {
                    "user_id": "Siddharth Bharadwaj",
                    "user_href": "/profile/Siddharth-Bharadwaj-8"
                },
                {
                    "user_id": "Matt Orbita",
                    "user_href": "/profile/Matt-Orbita"
                },
                {
                    "user_id": "Priyam Shah",
                    "user_href": "/profile/Priyam-Shah-54"
                }
            ]
        }
    ]
}