{
    "title": "Why don't people like Nickelback? - Quora",
    "tags": [
        "Nickelback (band)",
        "Hate",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ryan Stubbs",
                "href": "/profile/Ryan-Stubbs-5"
            },
            "answer_text": "This isn’t just a problem with Nickelback. Really, this is my feelings on probably 75% of modern bands. Nickelback just happens to be one of the most successful culprits, so everyone is piling on them. When people say their songwriting is “formulaic”, they have no idea how right they are. As a professional composer and songwriter myself, I know all of the tricks and formulas, and these guys stick to them like glue. I can almost always listen to a song, that i’ve never heard before, and predict things like, when the vocals will first enter the song, after the first line or phrase, I can usually predict every single note of the next 2 lines. Within a single line after hearing the first few notes, I can usually predict half of the rest of the notes that will finish the line. I know they will most likely be using the 1, 4, 5, and 6 minor chords. I can usually predict when they will change to each one. when the chorus will come in. the fact that on the last few words of the chorus, the band will drop out, so that the singer can sing the the “lyrical hook / catchphrase / title of the song” and everyone can hear it clearly, then there will be probably 1 measure of pause, a drum fill, and then right into the minor chord to start Verse 2. I know either the Bridge or a guitar solo is coming 3/4 of the way through the song, and sometimes I can predict what chord that will start on too. You can even predict the rhythm of the rhyme scheme in like 5 seconds. Basically for a hugely popular Rock Band that comes on the radio every other song, they are SUPER BORING. I don’t enjoy being force fed, super boring stuff. it’s the difference between arts and crafts. Art requires EXCEPTIONAL imagination, creativity, a new perspective, and a certain striving for greatness. Only the artist could’ve created what they did. While Crafts, on the other hand. anyone can learn to do, and they don’t require very much imagination or originality. it’s more like a paint by numbers thing. I live in Nashville, and this town’s bread and butter is the paint by numbers craft of song writing. This city is full of Craftsmen, but not a whole lot of Artists. Basically Nickelback writes Country ballads, but since they use distorted guitars and are angsty, they get passed off as a Rock Band. There are formulas for writing songs. even formulas for writing a catchy hook, ( “catchy” and “good” are not always the same thing, btw. “It’s A Small World After All” is catchy. No one would argue that it’s good.” ) And don’t get me wrong, there is a perfectly good reason these formulas exist. They work every time. They’re generally pleasing. But the fun of it, is listening to people come up with new variations on these formulas. when you’re expecting to hear the typical, but then the Artist surprises you with a subtle twist, or some sparks of imagination, that you didn’t expect. Something only that Artist could have thought of. it doesn’t even have to be a huge, revolutionary, new idea. just something small or subtle, anything, that makes you feel like you haven’t already heard this song 1,000 times already. This is not just a Nickelback problem. This is a modern music problem. It’s funny that their singer married Avril Lavigne too, because her songs might be the most formulaic I’ve ever heard. I actually use her first hit single “Complicated” to teach my students about the formulas and how to use them in songwriting. It blows their minds how strictly her songs adhere to the Law of 2’s and 3’s. And don’t even get me started on the one note, immediate rhythmic repetition, formula for a Catchy Hook. It’s mind numbing. Again, I don’t hate them for perfecting the formulas. I just hate being force fed them on the Radio all the time. I feel like we should be encouraging artists to be more imaginative. Here’s my question about Nickelback though, … If they are a Rock Band, why are all of their songs on the radio, mid tempo, sad sack, power ballads? shouldn’t they kick a little more ass than that? ",
            "date": "Answered November 21, 2016",
            "views": "3",
            "upvotes": " View 21 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Duc Quang",
                    "user_href": "/profile/Duc-Quang"
                },
                {
                    "user_id": "Steve Skepnek",
                    "user_href": "/profile/Steve-Skepnek"
                },
                {
                    "user_id": "Liam Skerjanec",
                    "user_href": "/profile/Liam-Skerjanec"
                },
                {
                    "user_id": "Ben Jackson",
                    "user_href": "/profile/Ben-Jackson-431"
                },
                {
                    "user_id": "Karlo Serrano",
                    "user_href": "/profile/Karlo-Serrano"
                },
                {
                    "user_id": "Jeff Brooks",
                    "user_href": "/profile/Jeff-Brooks-22"
                },
                {
                    "user_id": "Antonia Marwinda",
                    "user_href": "/profile/Antonia-Marwinda"
                },
                {
                    "user_id": "Leszek Antoni",
                    "user_href": "/profile/Leszek-Antoni"
                },
                {
                    "user_id": "Joseph Charles",
                    "user_href": "/profile/Joseph-Charles-7"
                },
                {
                    "user_id": "Vasudha Bhandari",
                    "user_href": "/profile/Vasudha-Bhandari"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Compton",
                "href": "/profile/Michael-Compton-8"
            },
            "answer_text": "The problem is, I think, multi-faceted. The first is that Nickelback is actually a talented rock band that can perform anthemic arena rock with the best of them - and they hit this stride in an era where those types of bands had kind of burned out their welcome with singles that you simply couldn't get away from. (Creed, incidentally, had this same problem.) It also didn't help them that after their first two albums, a lot of people started to notice that they were formulaic: listen to \"How You Remind Me\" and then \"Someday\" and you might not be able to tell which song is which, despite different lyrics. It certainly didn't help their reputation that they were associated with bland, uninteresting, consumer friendly radio rock - or that they accepted and ran with this like it was a flag. At the core of it, though - I think the reason why Nickelback garners so much hate isn't because of all the \"bad\" but because there simply isn't more \"good.\" They aren't a bad band - you certainly can't accuse them of a lack of talent or even a lack of showmanship on stage. Chad Kroger can sing. They have songs that, even if you hate them, you have to admit are catchy and have great hooks. (And even as someone who doesn't particularly like Nickelback, their tribute to Dimebag's death in the song \"Side of a Bullet\" is phenomenal.) But in it's own way, that's the worst problem - they're not bad enough to dismiss out of hand, they aren't good enough to want to listen to. They're like a burrito microwaved for just long enough to barely be edible, but then marketed to the populace as the best Mexican food you've never tried. It isn't \"Wow, this sucks!\" so much as \"This is it?\" Mediocrity in music is worse than being bad - because it means you had the talent to be better and you settled with a sound that was passable. ",
            "date": "Updated April 16, 2019",
            "views": "402",
            "upvotes": " View 243 Upvoters",
            "upvoters": [
                {
                    "user_id": "Steve Skepnek",
                    "user_href": "/profile/Steve-Skepnek"
                },
                {
                    "user_id": "Nick Wooley",
                    "user_href": "/profile/Nick-Wooley-1"
                },
                {
                    "user_id": "Jack Murphy",
                    "user_href": "/profile/Jack-Murphy-337"
                },
                {
                    "user_id": "Marius Houghton",
                    "user_href": "/profile/Marius-Houghton"
                },
                {
                    "user_id": "Raka Satria",
                    "user_href": "/profile/Raka-Satria-4"
                },
                {
                    "user_id": "Maria Zampella",
                    "user_href": "/profile/Maria-Zampella"
                },
                {
                    "user_id": "Jim Ghivizzani",
                    "user_href": "/profile/Jim-Ghivizzani"
                },
                {
                    "user_id": "Igni Grand",
                    "user_href": "/profile/Igni-Grand"
                },
                {
                    "user_id": "Kittyok Fung",
                    "user_href": "/profile/Kittyok-Fung"
                },
                {
                    "user_id": "Mark Robson",
                    "user_href": "/profile/Mark-Robson-92"
                }
            ]
        }
    ]
}