{
    "title": "Why is it racist to think afro-textured hair isn't good hair? - Quora",
    "tags": [
        "Afro",
        "Natural Hair",
        "Racism Against Black People",
        "Black People",
        "Racism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sonya Abarcar",
                "href": "/profile/Sonya-Abarcar"
            },
            "answer_text": "What's not good about it? It's wonderful. Think about it. If I wanted my hair to stand straight up in a mohawk, I don't need gel or any other products, I can just comb it straight up and it'll stay there all day long. I can braid it, lock it, and twist it with no problems.  It's super curly so I can wear it in a variety of styles or with one or two passes with a flat iron, I can wear it stick straight, to where it falls down my back. Or I can braid my hair up and wear a protective style, (our strands are pretty delicate) and throw a nice wig over it and BAM! Looking good! What's not good about this.....   My hair straightened.   Me wearing a lace front wig. They are expensive but a great alternative for protective styling.   My lovely 'fro! I just pick it out and GO!!   My hair in a bun. I had to straighten my hair, which takes forever, but once i'm done, I bun it up, get in the wheelchair, and start my lovely day!   A more recent picture of my 'frohawk. I knitted that shawl too. LOL   A really expensive lace front wig! Lupus Awareness!   My hair in braids; on my way to work for the Chicago Transit Authority...bus driver on the #66 Chicago! This was in 2009.   My hair in Bantu knots 2011. Days after my lupus diagnosis. Bantu knots make your hair curly without the use of damaging heat. Afro textured hair needs heat to make the hair straight, but because our strands are fragile, heat also destroys the hair and it'll break off. This leads to people thinking that black women can't grow hair because they wear so many wigs.  Due to the fragility of the strands, and some pressure to \"conform\" from both sides ( our old school parents and society) black women wear wigs to cover their own hair. Some, like myself, wear them for protective styling. It gives my strands a break. Since I'm disabled and no longer able to work, I keep my hair in cornrows and throw on my lace front wigs when I go out. But my own hair is long, thick, and gorgeous! But many people just see ONE side to an issue and put two and two together making six. They simply don't see the whole picture. A lot of Black women have damaged their hair. But that doesn't mean our hair  can't grow. With the exception of disease, all hair grows about the same rate. It's just that our strands are more fragile and vulnerable to damage quickly.    My own hair. This is the most current picture that I have of my hair. It's pretty long and very thick. It also holds a curl beautifully, which is something that women with pin straight hair have issues with. Curls don't last long, the straighter the hair. I don't have that issue. Again, I can wear a mohawk all day long and all I have to do is brush my hair straight up. It won't move LOL. I don't know of anyone else that can do that.  So my hair does things that other hair types can't do. It's versatile and beautiful! I have to treat it delicately because the strands can be fragile, however, it thrives with moisture and attention. So, I believe my hair is beautiful and unique and I wouldn't trade it for anything in the world.  So my hair is good hair. Whether you think that \"nappy\" hair isn't good hair, is just an opinion. I'd like to know what are you basing that from. Because our hair is so unique and so versatile, I don't see how we don't have \"good\" hair in some people's eyes. One can argue just on the points that I've made alone makes black/afro textured hair \"good\".  What makes some hair \"good\" and other hair \"bad\"? Manageability, looks, thickness? I wouldn't say that it's racist to think that nappy hair isn't good hair, however I find it incredibly biased because what constitutes good hair? If good hair is versatile hair, then \"nappy\" hair is good hair. If good hair is pin straight to you, then \"nappy hair\" wouldn't fall in that category. I love my hair and I believe that my hair is good hair. So I would say broaden your horizons a bit more. ",
            "date": "Answered September 25, 2015",
            "views": "116",
            "upvotes": " View 174 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jada Winters",
                    "user_href": "/profile/Jada-Winters-4"
                },
                {
                    "user_id": "Anthony Ramos",
                    "user_href": "/profile/Anthony-Ramos-69"
                },
                {
                    "user_id": "Zilrael",
                    "user_href": "/profile/Zilrael"
                },
                {
                    "user_id": "Treasure Okpa",
                    "user_href": "/profile/Treasure-Okpa"
                },
                {
                    "user_id": "Matthieu Bazile",
                    "user_href": "/profile/Matthieu-Bazile"
                },
                {
                    "user_id": "Tavai Bailey",
                    "user_href": "/profile/Tavai-Bailey"
                },
                {
                    "user_id": "Mope Abimbola",
                    "user_href": "/profile/Mope-Abimbola"
                },
                {
                    "user_id": "Angel Daniella",
                    "user_href": "/profile/Angel-Daniella"
                },
                {
                    "user_id": "Sasha King",
                    "user_href": "/profile/Sasha-King"
                },
                {
                    "user_id": "Chris Briggs",
                    "user_href": "/profile/Chris-Briggs-38"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rhonda Mitchell",
                "href": "/profile/Rhonda-Mitchell"
            },
            "answer_text": "This falls under intra-personal racism. Intra-personal communication is our internal conversations. Intra-personal racism is an internalization of biases, prejudices, emotions, attitudes, thoughts and beliefs that confirm stereotypes, and those thoughts beliefs and emotions become part of our internal conversation, our feedback loop. In the case of hair, it's respectability politics gone awry.  According to NPR journalist, Karen Grigsby Bates,\" For decades, calling a black woman's hair nappy was a deep insult. Ms. Schooler-Ukpabi [owner of \"Oh! My Nappy Hair!\" a salon that caters to natural African American hair] says that aversion to phenotypically sub-Saharan African hair was part of black Americans' embarrassment over our enslaved past, a time when black was often equated with semi-human.Nappy became offensive because it was a reminder of a time.  Ms. Schooler-Ukpabi goes on to say that, \"Apparently somewhere we figured that the tighter the curl, the more we wanted to hide, because we were looking to be a part of the European world. We wanted - it was acceptable to have straight hair.\"  However your hair grows out of your head is good hair. Healthy hair is good hair. Clean hair is good hair.  To say that nappy hair isn't good hair happens only when you compare it to the aesthetics of beauty that are currently in practice, and confirm the intra-personal internal feedback loop. ",
            "date": "Answered September 25, 2015",
            "views": "11",
            "upvotes": " View 58 Upvoters",
            "upvoters": [
                {
                    "user_id": "Treasure Okpa",
                    "user_href": "/profile/Treasure-Okpa"
                },
                {
                    "user_id": "Tavai Bailey",
                    "user_href": "/profile/Tavai-Bailey"
                },
                {
                    "user_id": "Angel Daniella",
                    "user_href": "/profile/Angel-Daniella"
                },
                {
                    "user_id": "Sasha King",
                    "user_href": "/profile/Sasha-King"
                },
                {
                    "user_id": "Amaka Nzenaguorae Dawn",
                    "user_href": "/profile/Amaka-Nzenaguorae-Dawn"
                },
                {
                    "user_id": "Beth Dash",
                    "user_href": "/profile/Beth-Dash-1"
                },
                {
                    "user_id": "Jada Winters",
                    "user_href": "/profile/Jada-Winters-4"
                },
                {
                    "user_id": "Ray White",
                    "user_href": "/profile/Ray-White-131"
                },
                {
                    "user_id": "Edward Pinkney",
                    "user_href": "/profile/Edward-Pinkney-1"
                },
                {
                    "user_id": "Brayden Rice",
                    "user_href": "/profile/Brayden-Rice-4"
                }
            ]
        }
    ]
}