{
    "title": "Why don’t people listen to me but listen to others who say the same thing? - Quora",
    "tags": [
        "Listening",
        "Understanding Human Behavior",
        "Interpersonal Interaction"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hilary Donovan",
                "href": "/profile/Hilary-Donovan-1"
            },
            "answer_text": "Why don’t people listen to me but listen to others who say the same thing? I have found over the years that it’s true that people will listen to some people and not to others or I’ve had this experience—I’ll say something and the person repeats what I’ve said almost verbatim but acts as though it was her idea. (My doctor comes to mind.) When my husband was alive, he told me something kind of quirky and interesting that a colleague of his whom I knew had said. We’d refer to the idea and laugh many times over several weeks. I have no memory of what it was, but I thought it was clever. Then one day he admitted that it was his idea—that his colleague hadn’t said it. I said, “Why did you pretend that it was his?” He replied, “I figured you’d respect the idea more if it was coming from him and not me!” I could hardly believe this and didn’t understand how I’d led him to believe that I’d be more respectful of an idea if it came from someone other than him. However, I imagine that he might have been more respectful of an idea if I told him that it came from someone he had high regard for. I think that when you have a very close, intimate relationship you’ve seen the other person at their absolute worst. So you might have a tendency to respect the ideas of people whom you haven’t seen at their worst—people who still haven’t fallen off their pedestals. One of my brothers and I love to reminisce about my mom and the respect she had for certain people’s ideas and the lack of respect she had for others’ ideas. My brother and I were at the bottom of the totem pole. My mom’s brother held a high position in the hierarchy, one of my brothers was also very high up—they probably vied for top billing. However, her beautician probably rated highest of all. Her hairdressers changed throughout her life, but each one was highly regarded by my mom. She never had a critical word to say about her hairdressers. Beauticians talk to a lot of people and pick up a lot of knowledge along the way—they can be very charming. They had my mom believing they could do no wrong. I think it’s human nature. Maybe we all have this way of respecting the opinions of certain people to a degree, but some people seem to have this idiosyncrasy to the extreme. ",
            "date": "Answered June 6, 2018",
            "views": "14",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Madelyn Vandecasteele",
                    "user_href": "/profile/Madelyn-Vandecasteele"
                },
                {
                    "user_id": "Emma-Kate Panuccio",
                    "user_href": "/profile/Emma-Kate-Panuccio"
                },
                {
                    "user_id": "Sarah Myslis",
                    "user_href": "/profile/Sarah-Myslis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marius Wrobel",
                "href": "/profile/Marius-Wrobel"
            },
            "answer_text": "Oh I know what you mean! That’s the same with me sometimes. I would love people to listen to each other more. It would make this world a much better place :-) Do these people trust you emotionally? If they do, they will likely listen to whatever you have to say - if they don’t, then it just doesn’t matter, what you say. I learned a lot from this TED-Talk here - in short: “People don’t buy what you do, they buy why you do it!” Take a look: “How great leaders inspire action” https://www.ted.com/talks/simon_sinek_how_great_leaders_inspire_action ",
            "date": "Answered June 6, 2018",
            "views": "460",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amy Kay",
                    "user_href": "/profile/Amy-Kay-103"
                },
                {
                    "user_id": "Abha Pol",
                    "user_href": "/profile/Abha-Pol-1"
                },
                {
                    "user_id": "Emma-Kate Panuccio",
                    "user_href": "/profile/Emma-Kate-Panuccio"
                }
            ]
        }
    ]
}