{
    "title": "Why did Lennon write better songs after The Beatles, and Paul with The Beatles? - Quora",
    "tags": [
        "Paul McCartney",
        "John Lennon",
        "Music Composition",
        "The Beatles (band)",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Duncan Thorburn",
                "href": "/profile/Duncan-Thorburn"
            },
            "answer_text": "I do agree with the writer of the question, John Lennon most certainly did write the better Songs, for my taste, sold more when he was alive. Although Paul McCartney announced the End of the Beatles, Paul was the least equipped to go Solo. George Harrison had only been allowed one or two songs per album on the Beatles Albums, so fitted a Home Recording Studio, that was of a Professional standard. He had been collecting his songs, for many years, which could be released at any time, but possibly because of problems with Beatles contracts, he didn't. George Harrison’s first solo album “All Things Must Pass”, was a Box Set, of high quality songs, and many of them. George was only twenty seven when the Beatles split, and looked to be able to carve out a great solo career. Everyone thought Paul McCartney would be the strongest Solo Career, but Paul’s output was very much the Beatles, when the Beatles came together to do an Album, Paul’s songs were the one’s they worked on first. Sgt Peppers was possibly the only exception, were the songs were done alternating, from John to Paul’s Songs, then George. John Lennon complained on many occasions, they all were tired when they came to work on his Songs after Paul’s Songs. John sighted this as a main reason for the Beatles split. It was not, who ran Apple, the Beatles Company, was the real reason. John Lennon worked on the Two Virgins Album, starting during and after the Sgt Peppers Album but with just Yoko and him, in a little back room at EMI, with different tape decks. It is the ONLY Album I have ever returned to the Music Shop I bought it from, it was that bad. It was a series of sounds, with Yoko screeching like a banshee. I heard the Lennon quote of, “if he put out an Album of farting, the public would buy it”. This made me quite angry, because I was following British Folk, and they struggled to earn a living, while doing incredible songs, and guitar instrumentals, I just thought it totally unfair. George Harrison had a massive row many years later with John Lennon, when John was in his “Lost Weekend”, actually a year long fallout with Yoko, who had chosen May Pang, as a Yoko look-a-like partner, for John. Quite the little bully in the relationship then, but was invited to a Gig where John was, saw the loneliness in his eyes, and got back together with him, that John just accepted. George had said, after the Beatles split, he had helped John out, by playing on his Albums when asked, but now George’s solo career was going down the plug hole, John wouldn't do just a few live appearances with George, on his Tour of the USA. It was George screaming at John, at the top of his voice. May Pang asked why John was so quiet in the row? John replied, “because he knew how hurt George was, at his Solo career failing so badly”. John’s view was that was not his fault, it was George’s problem, only he wasn't going to say that to George. It has been said, that The Travelling Wilbury’s was a way for George to start again, after the failure of his Solo Career. I think George just wanted to be in a Band again, and this was a way. Now to the reasons why John was successful at selling Albums, except for The Two Virgins, that is conveniently forgotten about by everyone now. Well one reason was Paul put out a single “Give Ireland back to the Irish, Don’t make Them Take it Away”. It was Banned by the BBC, which usually meant everyone would buy it, Fans did, but were insulted at the contents, especially as the IRA were bombing us. Again, no one likes to mention this single, because it does not fit the nice Beatles history. Also the surname McCartney is a traditional Irish name, the Word Association Test of mixing McCartney Beatles, to The Irish Question, IRA murders, is NOT a Market Man’s Wet Dream. It was a big mistake. On the quality of Lennon’s Songs, to McCartney’s Songs, after the Beatles split, I would point out, that Lennon had George and Ringo’s help, when asked for. So it’s the Beatles without Paul really, but the Songs for my taste, and ideas of Song Writing, were better. The change from Melodic Songs, to Riff Based Songs, was a Beatles development. I watched a BBC Documentary on the Guitar Riff, through the sixties on, which doesn't mention the Beatles once. For any sixties music documentary not to mention the Beatles is amazing, but it’s true, the Beatles were not a Riff Based Band. This is not to say they didn't have some Riffs, more eventually in the Beatles career, towards the end. This is because, the Beatles did something incredible, which is why we are all still talking, and writing about them. This incredible thing was Doh, Ray, Me stuff, that was earth shattering in it’s originality. Compared to the Blues, Rock, moving into Heavy Metal, Riff based music, the times was famous for the creation of, The Beatles were unique. Music split into many different types because of Riff based music, only the Beatles went against this historical reality, they did do more Rock, Blues type Songs towards the end of their Beatles output, but even that was melodic more than Riff based. You might question which is more musically great, melody compared to the Riff based music developed at the time, and since. For me, it’s the Beatles Melody. If you pick up the Beatles original Song Book, the one with the wrong chords, for simplicity, that came out at the time, one page equals one song, the Melodies come out and Sing to you. After all these years, still those Songs have more energy, soul, character, and plain old fashioned Genius, than any Songs now, or at the time. 220 of the Best Songs ever wrote, recorded, and performed. Are Riffs easier than Melody? Yes, and so is the working method of a Band. A Riff Based Band can come together in the studio, to put an Album together quicker, and easier than putting Melodies together, that is hard work. It is forgotten how hard the Beatles worked on Singing, it was total slave labour. They realised and appreciated that the Song was judged on the quality of the Vocals, non-musicians relate to the vocals, more than the instruments. George would help other Bands by dropping in on their recording sessions. He could get a Band working on their vocals just getting it right, for twelve hard hours, and even longer. Everyone said it was worth it in the end, but it does upset a lot of non-vocal mainly guitarists, to work on vocals. It was because it’s Beatles George doing the asking, that got them through it, so respected was he, and all the Beatles are by other Musicians. Melodies are also thought to be “a Bit Soft”, now-a-days, a bit dated, it’s just that no one can do them as well as the Beatles. If you can, even if you know nothing about Song Writing, have a go at writing a Song, it will show you, melodies are very difficult, especially new, different Songs. The idea then that it can be enclosed by musicians, making a great Song, is simply not true. Try it, Song Writing is not, easy money. ",
            "date": "Updated May 23, 2020",
            "views": "97",
            "upvotes": " View 50 Upvoters",
            "upvoters": [
                {
                    "user_id": "Henrik Johansson",
                    "user_href": "/profile/Henrik-Johansson-23"
                },
                {
                    "user_id": "Brian Gold",
                    "user_href": "/profile/Brian-Gold-15"
                },
                {
                    "user_id": "Charles Blankenship",
                    "user_href": "/profile/Charles-Blankenship-11"
                },
                {
                    "user_id": "Mike Lawrie",
                    "user_href": "/profile/Mike-Lawrie-3"
                },
                {
                    "user_id": "Jack Wells",
                    "user_href": "/profile/Jack-Wells-65"
                },
                {
                    "user_id": "Michael Rowlands",
                    "user_href": "/profile/Michael-Rowlands-13"
                },
                {
                    "user_id": "Brian Shaffner",
                    "user_href": "/profile/Brian-Shaffner"
                },
                {
                    "user_id": "Ilija Duni",
                    "user_href": "/profile/Ilija-Duni"
                },
                {
                    "user_id": "Gary Spinelli",
                    "user_href": "/profile/Gary-Spinelli-2"
                },
                {
                    "user_id": "Brian Nealon",
                    "user_href": "/profile/Brian-Nealon-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Virgil",
                "href": "/profile/David-Virgil-1"
            },
            "answer_text": "Surely you're joking. Paul had far more hits after the Beatles than John. Maybe I'm Amazed, HiHiHi, Jet, Uncle Albert, Live And Let Die, Mull of Kintyre, Listen To What The Man Says, My Love, Juniors Farm, So Bad and so many more. Paul is in the Guiness Book of World Records for being the greatest modern composer of all time backed by the number of hit songs. Paul did more by himself and Wings than John ever did by himself and The Plastic Ono Band. John did write some great songs after the Beatles but not as many as Paul. What I find funny is the fact that John used to bitch about many of Paul's songs for being too soft and being ballads and yet Double Fantasy is full of songs like that. Beautiful Boy, Kiss Kiss Kiss, Dear Yoko, etc. If Paul would have written a song like Woman with the Beatles John would have called it rubbish. They were both great songwriters but as a whole Paul wrote better songs than John after the split. I agree a few of Johns songs were more gritty than Paul's. No doubt both were great songwriters and during their time with the Beatles both wrote fantastic songs. After the Beatles both continued to do so but Paul wrote many more songs and had more hits than John. One thing I find amusing is the fact that John used to sing Paul’s songs after the break up. On You Tube there is a video of a recording at Johns apartment in New York where he sings several of Paul’s songs. He knew all the lyrics. It was hilarious listening to it. This was done during John being a house husband. Anyone questioning if they liked each other should listen to this. ",
            "date": "Updated March 13, 2020",
            "views": "43",
            "upvotes": " View 66 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gauravi Singh",
                    "user_href": "/profile/Gauravi-Singh-7"
                },
                {
                    "user_id": "Goffe Torgerson",
                    "user_href": "/profile/Goffe-Torgerson"
                },
                {
                    "user_id": "Jim Deferio",
                    "user_href": "/profile/Jim-Deferio-1"
                },
                {
                    "user_id": "Lakshmy Kurup",
                    "user_href": "/profile/Lakshmy-Kurup"
                },
                {
                    "user_id": "Chris Delorme",
                    "user_href": "/profile/Chris-Delorme-1"
                },
                {
                    "user_id": "Apollo C Vermouth",
                    "user_href": "/profile/Apollo-C-Vermouth"
                },
                {
                    "user_id": "Edmund S Villnave",
                    "user_href": "/profile/Edmund-S-Villnave"
                },
                {
                    "user_id": "Chrissy Wheeler",
                    "user_href": "/profile/Chrissy-Wheeler-4"
                },
                {
                    "user_id": "Taylor Bachelor",
                    "user_href": "/profile/Taylor-Bachelor-1"
                },
                {
                    "user_id": "Michael Rowlands",
                    "user_href": "/profile/Michael-Rowlands-13"
                }
            ]
        }
    ]
}