{
    "title": "Why didn't Blue Oyster Cult become a mega band like Black Sabbath, Journey, Aerosmith, and other groups with similar talent? Were they just too science fictiony? - Quora",
    "tags": [
        "Blue Öyster Cult",
        "Black Sabbath (band)",
        "Hard Rock Music",
        "Classic Rock Music",
        "Heavy Metal (music)",
        "Bands (music)",
        "Rock Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matt Aliberti",
                "href": "/profile/Matt-Aliberti"
            },
            "answer_text": "Blue Oyster Cult is a criminally underrated band. I can count on one hand the songs that i dislike, their catalog is full of interesting, edgy well crafted songs that span across the entire genre of rock. They are more than Don't Fear the Reaper and Burning for You, which accounts for 95 percent of the BOC the average classic rock station will play. Those songs are awesome, I consider Reaper a masterpiece, but there's so much more to hear. They are excellent live, even to this day. I first saw them in 1983 on the Revolution by Night Tour, and I've seen them maybe 8 or nine times since. In the 70s, they were the pioneers of true laser light technology as a part of their shows. They also had a giant fire breathing Godzilla and predated Rob Halford with riding a motorcycle on stage. They were highly influential to future rockers and bands like Metallica and Iced Earth have covered their songs. Bonnie Tyler had a hit with a BOC cover, Goin Through the Motions. Buck Dharma is one of the greatest lead guitarists in rock. His leads are fluid and intricate, yet they don't just blather fast notes. He can shred, but only if it serves the song. I personally loved Joe Bouchards bass lines. The Bouchards were also excellent musicians and songwriters. Like other great bands, they had multiple lead vocalists, it's hard to get bored with that variety. In my opinion, BOC should be in the Hall of Fame However, there are reasons why BOC did not get their due. Sometimes strengths are double edged swords. One is the interesting lyrics. Sandy Pearlman and Richard Meltzer did a lot of lyrics for the band (Sandy was there manager for a long time too), and their style was definitely highbrow, so they didn't always connect with the masses. There were more sci-fi and fantasy themes, less get the girl stuff. It's almost a hard rock Steely Dan (another personal favorite). Not everyone gets it. The 4 lead vocals are also in that category, I love it, but some like to hang their hats on one. Eric Bloom is the main vocalist, but Buck has the hits Reaper, Burning and a lot of the deeper radio hits Dancing in the Ruins, Shooting Shark and the later Harvest Moon. Joe Bouchard sang and Albert Bouchard sang a lot of the quirkier tunes from behind the drums. I think singing drummers are fab, but it is harder to connect with audiences. I tend to really like the Post-Al Bouchard albums, but any true fan knows that the band wasn't really the same after he left during the Fire of Unknown Origin tour. The songwriting wasn't the same. The sound was not the same. TRBN had those dated electronic drums, Club Ninja used some outside the circle songwriters which probably didn't fit as well. Personnel issues started, a little too much partying, Al gone, Joe in and out,Al back then out, Allen Lanier needed rehab, and then back before passing away. BOC also wasn't a great MTV band, their videos were pretty cheesy (I love em, but that's me). Take Me Away is such a great song, but the video is just silly. Same for Shooting Shark and Dancing in the Ruins. Finally, they didn't get a lot of label support, there was mismanagement at one point Pearlman managed Sabbath and BOC which resulted in the famed Black and Blue tour, but caused rifts. Lack of label support meant less exposure and radio support, which was a shame. BOC should have been bigger. They were highly influential, listen to Ghost and note some parallels. Metallica cites them as an influence and Cliff Burton sometimes gigged in a BOC tshirt. They may have been too cool. My advice, listen to Secret Treaties, Agents of Fortune, and Fire of Unknown Origin. Then check out the rest, you won't be disappointed. They still tour, its Eric and Buck leading BOC, Al and Joe teaming up with Dennis Dunaway of Alice Cooper in Blue Coupe, as well as solo stuff. Check it out! EDIT 10/10/20 BOC just released The Symbol Remains, their first studio album in 20 years! It really rocks… Eric really shines and Buck has many highlights too. Their “new\" guitarist, Richie Castellano absolutely rocks and does lead vocals on a few tracks. It's such an amazing meld of modern and classic hard rock. Check THAT out! ",
            "date": "Updated October 10, 2020",
            "views": "216",
            "upvotes": " View 175 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chuck Finley",
                    "user_href": "/profile/Chuck-Finley-144"
                },
                {
                    "user_id": "Eden Long",
                    "user_href": "/profile/Eden-Long-2"
                },
                {
                    "user_id": "John C",
                    "user_href": "/profile/John-C-25"
                },
                {
                    "user_id": "Brian Abraham",
                    "user_href": "/profile/Brian-Abraham-45"
                },
                {
                    "user_id": "Mark Perrett",
                    "user_href": "/profile/Mark-Perrett-5"
                },
                {
                    "user_id": "Ian Babey",
                    "user_href": "/profile/Ian-Babey"
                },
                {
                    "user_id": "Alan Long",
                    "user_href": "/profile/Alan-Long-76"
                },
                {
                    "user_id": "Steve Coffey",
                    "user_href": "/profile/Steve-Coffey-2"
                },
                {
                    "user_id": "Aebel Kavoo",
                    "user_href": "/profile/Aebel-Kavoo"
                },
                {
                    "user_id": "Christopher Leete",
                    "user_href": "/profile/Christopher-Leete"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ramakrishnan Parthasarathy",
                "href": "/profile/Ramakrishnan-Parthasarathy"
            },
            "answer_text": "No garage punk, proto-punk or punk rock band (or, to take it even further: no rock band) wrote better and more memorable riffs than Blue Oyster Cult. No one had a more intriguing sound that was dirty when required and deliciously evil at will. In fact, the best of Blue Oyster Cult constitutes a distilled lesson in the dark depths of the “alternative.” Of course, there was much more to them with the dripping psychedelia, boogie, the jazzy drumming, the encircling keyboards and so on. No weird band rocked more and was more tuneful. The problem with Blue Oyster Cult is that the talents in the initial lineup were spread across the entirety of the personnel. It looked like everyone had a stab at writing songs, with no autocratic leader to do things only his/her way. Buck Dharma, despite all his guitar talents, had no gift of writing songs of intrigue, so this was left to the Crawdaddy critic Richard Meltzer and the conceptualizer that was Sandy Pearlman. Eric Bloom was more of a simpleton and the Bouchard brothers had voices that added to things along with their instrumental talents. The communal approach to the writing (and rewriting) in the early albums had an unstructured feel to it, save for genius occasions like the one-two punch that is “Flaming Telepaths” transitioning into “Astronomy.” Band members could be added and excluded at will in this merry-go-round. Allen Lanier brought in colour and Patti Smith sort of practiced her early vision with the band. The critics also wanted Blue Oyster Cult to be popular. The musical chair precluded any coherent vision for being popular and the band took the ill-advised route of playing arena rock with endless boring guitar solos (save a few that were great testaments to Buck’s playing): a la Aerosmith, Journey, Kansas, REO Speedwagon et al. Blue Oyster Cult were far more talented than these other mediocrities. And the sci-fi got worse and velveeta with the 80s. The target audience was just wrong, and the band could easily be out-cheesed or out-manoeuvred by corporate organization in rock music. No rock band has tunes matching the biker-greatness that is “Transmaniacon MC” or the maundering boogie of “Before the Kiss, A Redcap” and lyrics that even out-weirded serious madcaps of the times. I just wish that Richard Meltzer, Sandy Pearlman and the Bouchard brothers had continued to maintain the singular cultdom and not have this apathy of seeing collective genius go to rack and ruin. The best of Blue Oyster Cult deserves to be classified among unique stuff like the 1967–70 era Captain Beefheart & the Magic Band or The Residents. The polish got them Agents of Fortune right, but it was more like a B-grade version of the much later Roxy Music’s Avalon than the fascinating For Your Pleasure, if such a comparison could be afforded. ",
            "date": "Answered July 9, 2018",
            "views": "3",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alexander Winkler",
                    "user_href": "/profile/Alexander-Winkler-3"
                },
                {
                    "user_id": "John C",
                    "user_href": "/profile/John-C-25"
                },
                {
                    "user_id": "Christopher Leete",
                    "user_href": "/profile/Christopher-Leete"
                },
                {
                    "user_id": "Thomas Snerdley",
                    "user_href": "/profile/Thomas-Snerdley"
                },
                {
                    "user_id": "Gary Luecker",
                    "user_href": "/profile/Gary-Luecker"
                },
                {
                    "user_id": "Stefan Pociask",
                    "user_href": "/profile/Stefan-Pociask"
                },
                {
                    "user_id": "PG Clarke",
                    "user_href": "/profile/PG-Clarke"
                },
                {
                    "user_id": "Benjamin Adler",
                    "user_href": "/profile/Benjamin-Adler"
                },
                {
                    "user_id": "Tim Larsen",
                    "user_href": "/profile/Tim-Larsen-29"
                },
                {
                    "user_id": "Arthur Quincy",
                    "user_href": "/profile/Arthur-Quincy"
                }
            ]
        }
    ]
}