{
    "title": "Why is K-Pop trash? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Thomas Agustinus",
                "href": "/profile/Thomas-Agustinus"
            },
            "answer_text": "Good question, this is gonna be a long one. A few reasons. 1.THE GODDAMN STANS!! i have never seen a fandom so trashy before. They obsess over idols and refuse to see the dark truths behind the industry. They are delusional to the fact that BTS does plastic surgery even though they advertise ppl to “love yourself” when clearly they aren’t doing that.2.THE TRASH MUSIC I’ve heard utter trash music before (new Selena Gomez songs) but nothing will compare to Jennie’s SOLO. AND EVERY SINGLE SONG IS A CARBON COPY OF IT! It’s repetitive and it’s made for sex appeal not quality. Why else would the fanbase be drooling about the people dancing instead if the songs itself? The lyrics are bad, they’re not even deep. I won’t point the argument that we can’t understand the lyrics (because i listen to jpop) at least jpop has better lyrics than kpop.3. THE LACK OF RESPECT FANS HAVE i come from the anime community and i can tell you that the kpop fandom is the most disrespectful fandom I’ve ever seen. Worse than Fortnite and yes, worse than anime. The toxicity levels in the kpop fandoms are like anime waifu wars times 1000. Picture this, you’re at home browsing through social media and Kobe Bryant has just passed away (RIP love you Mamba) suddenly someone on twitter posts a fancam of Blackpink saying “Kobe wouldn’t have died if he’d stanned Loona”. WHAT FUCKING DISRESPECT IS THAT?? Do y’all have any respect for tragedies like the Kyoto Animation fire or Kobe Bryant dying? Maybe even Etika? What kind if Devil spawn would think up of such a thing?4. DICTATORSHIP AGENCIES I know quite a bit on this because i have kpopper friends. The agencies are dictators. According to Tiffany Young, they pushed her so damn hard that even “break” was reading scripts fir radio shows. Like, you’re pushing teenage boys and girls that are not even legal, to perform onstage, do sexy moves that are borderline perverse and exposing them to rapists and pedos? Worse is that they barely have any contact with their family and their school friends. AND FANS CHOOSE TO DENY THIS!!!in summary, i am disgusted with this fandom. The world is better of without kpop as a genre. Edit: there is proof that they have done plastic surgery in case you guys were wondering: The K-Pop Plastic Surgery Obsession ",
            "date": "Updated May 13, 2020",
            "views": "43",
            "upvotes": " View 61 Upvoters",
            "upvoters": [
                {
                    "user_id": "C T",
                    "user_href": "/profile/C-T-1080"
                },
                {
                    "user_id": "Erika Court",
                    "user_href": "/profile/Erika-Court-1"
                },
                {
                    "user_id": "INTPorn",
                    "user_href": "/profile/INTPorn"
                },
                {
                    "user_id": "Aamir Mohammed",
                    "user_href": "/profile/Aamir-Mohammed-45"
                },
                {
                    "user_id": "Nabil Hashim",
                    "user_href": "/profile/Nabil-Hashim-4"
                },
                {
                    "user_id": "NAng GN",
                    "user_href": "/profile/NAng-GN"
                },
                {
                    "user_id": "Cathy Serel",
                    "user_href": "/profile/Cathy-Serel"
                },
                {
                    "user_id": "Anthony Thomas-Garrett",
                    "user_href": "/profile/Anthony-Thomas-Garrett"
                },
                {
                    "user_id": "Kyi Win Htin",
                    "user_href": "/profile/Kyi-Win-Htin"
                },
                {
                    "user_id": "Elbert Exists",
                    "user_href": "/profile/Elbert-Exists"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dasha Yu",
                "href": "/profile/Dasha-Yu-3"
            },
            "answer_text": " (I can’t find any good questions to answer and I’ve sorta lost motivation to write on Quora, so don’t mind me using recycled memes to make up for the time I’ve been away) Today, we shall discuss why “k-pop is trash.” As you will later on notice, I am talking to myself…..totally not losing my sanity. tHe ObSeSsIVe 14 yEaR oLd sTaNsObviously, everyone who listens to a certain type of music is a crazy delusional teenage white girl. Yup, totally not stereotyping a genre and totally not generalizing an entire age group. oMfG sAraNghAe mE opPar1!11!11  tHe iDoLs alL hAve pLaStiC sUrGeRy, sO thEy’Re FaKeOf course, 100% of all South Koreans have gotten plastic surgery. And undoubtedly, that is a bad evil thing since celebrities doing whatever they want with their bodies because they have the money and availability of good surgeons is morally and ethically wrong. But then again, when American celebs get it, it’s totally fine because at least they’re “hot.”  tHe maLes LoOk FemInIne…says the guy who doesn’t accept the fact that people have different music preferences and then goes, “wHy can’t I gEt a giRlfRieNd.” I wonder why. I don’t know, maybe it’s because you can’t acknowledge that Eastern Asians have different beauty standards than Westerners?  tHey’Re aLl gAyOh really? Last time I checked, most Koreans are prejudiced and traditional, so they’re heavily against the LGBT community. You really think they would accept a gay idol without cursing them out on social media? And since when was “gay” an insult?  tHeY weAr mAkeUpok and?  cRiNgeY yELlOw cOiN sLot EyEs. sTuPid cHiNg cHongS tHat eAt dOgs… Eating dogs is illegal in a lot of parts of Asia now. Do your research before you accuse a whole race of eating d o g s. And since you’re the expert on Asians all of a sudden, might as well remember that ch*nk is a slur while you’re at it.  tHeY aLl LoOk The SaMetheIr mUsIc and DaNciNg sUckS. LyRiCs Don’T mAke sEnSe aNd cHoReO sUcKs toOtHeY LiP sYnCbuahaha you’re funny.  wOw yOu’rE so ToXicyessir, I’m 100% toxic for defending the K-pop fans who got bashed in the comment sections of answers talking sh*t about their music taste. But yEs, I acknowledge that Stan Twitter is fucked up and full of delulus who say “mAyBe hE wOuLd bE aLive if hE sTanNed LooNa.” We all take full responsibility for not being able to tell them to stop since we obviously have full control over what others do, and we also take the blame for obsessive fanwars and crazy stans who make up 25% of our species. But then again, generalizing millions of K-pop fans based off a social media platform and cursing them out is also toxic beheavior-  - - - - - - - Ayo remember all these memes you got sent by your “friends” as a “joke” all the time? They be calling me a crazy delulu but sends me these. The hypocrisy is amazing-           But then again:  - - - - - - - Pfftt, the amount of upvotes some hate answers have on here is disgusting. Imagine taking the time out of your life to curse out a genre of music just because you disapprove of it. K bai hoes.     tehe ",
            "date": "Answered October 27, 2020",
            "views": "57",
            "upvotes": " View 456 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ayesha Shaikh",
                    "user_href": "/profile/Ayesha-Shaikh-241"
                },
                {
                    "user_id": "Scrap Baby",
                    "user_href": "/profile/Scrap-Baby"
                },
                {
                    "user_id": "Potato Plep",
                    "user_href": "/profile/Potato-Plep"
                },
                {
                    "user_id": "Lara Jae Dee",
                    "user_href": "/profile/Lara-Jae-Dee"
                },
                {
                    "user_id": "Min Suga",
                    "user_href": "/profile/Min-Suga-311"
                },
                {
                    "user_id": "Amber Crossing",
                    "user_href": "/profile/Amber-Crossing-1"
                },
                {
                    "user_id": "Lilly Takagi",
                    "user_href": "/profile/Lilly-Takagi"
                },
                {
                    "user_id": "Krishay N",
                    "user_href": "/profile/Krishay-N-1"
                },
                {
                    "user_id": "Aviram Swain",
                    "user_href": "/profile/Aviram-Swain"
                },
                {
                    "user_id": "Varshini",
                    "user_href": "/profile/Varshini-77"
                }
            ]
        }
    ]
}