{
    "title": "Why do people like Kanye West? - Quora",
    "tags": [
        "Kanye West (musician)",
        "Hip Hop Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kimberly Alexander",
                "href": "/profile/Kimberly-Alexander-24"
            },
            "answer_text": "As a person that has seen more episodes of Keeping up with the Kardashians than I am comfortable admitting, I feel I can answer this. He seems like…a person? Like, really. His antics on screen, from messing with Taylor Swift, to hopping on stage and interupting people, to selling a white t-shirt for $120 Kanye West APC's $120 Plain White T Shirt Sells Out To telling people he is a literal god, he doesn’t seem to act like a person. But…he is. He seems smarter than we give him credit for (he knew his fans would buy a shirt with nothing on it for $120. He understands his audience at least) and he’s a legitimate great dad, from what I remember. He cares about family, leaving in the middle of one of his shows when Kim had that whole robbery thing go down, to getting along with most (if not all) of Kim's family (and they are hard to get along with) He’s nuts, I’m not ignoring that. He has a bigger-than-average ego, even when compared to other rappers and artists, and again, has a habit of getting himself into crazy antics. But I do not hate his guts. As a musician, I think he’s better than most of the garbage on the radio, and I’d 100% rather listen to him than 90% of all the “gangsta rap” out there right now. I wouldn’t call myself a “fan” not in the slightest, but what I’ve heard of his I’ve approved of. His albums aren’t all “bitches and hoes” anthems. They are about him talking about himself (no surprise) most of the time. So I’m neutral about Kanye West. I don’t know if he’s president-worthy (he said once he was running for president in 2020. West v. Trump. I swear to christ, if now’s not the best time for a one-way ticket to Europe, I don’t know what is) but what’cha gonna do? ",
            "date": "Answered October 16, 2017",
            "views": "25",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tania Clifford",
                    "user_href": "/profile/Tania-Clifford-1"
                },
                {
                    "user_id": "Star Lord",
                    "user_href": "/profile/Star-Lord-432"
                },
                {
                    "user_id": "David Balme",
                    "user_href": "/profile/David-Balme"
                },
                {
                    "user_id": "Gary Nguyen",
                    "user_href": "/profile/Gary-Nguyen-12"
                },
                {
                    "user_id": "P Bee II",
                    "user_href": "/profile/P-Bee-II"
                },
                {
                    "user_id": "Irvin L. Ortega",
                    "user_href": "/profile/Irvin-L-Ortega"
                },
                {
                    "user_id": "Roxanne Smith",
                    "user_href": "/profile/Roxanne-Smith-16"
                },
                {
                    "user_id": "Lebogang Nkai Ratsoana",
                    "user_href": "/profile/Lebogang-Nkai-Ratsoana"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Bahry",
                "href": "/profile/David-Bahry"
            },
            "answer_text": "If we're talking about people who might vote for him, no idea. But if we're talking about music: because it's good and creative, and because his style keeps evolving. A neat thing you can pay attention for is how he uses the human voice, not just in his raps but even in his beats. See for example these two early songs, whose beats are both built out of vocal samples (also showcasing his famous soul music influence): Jesus Walks  Hey Mama  For a taste of how his sound evolved from then: Say You Will (influenced the lower-key, more pensive-emotional kind of rap you sometimes hear now)  Blame Game (decadent piano+cello; also features a filthy, hilarious Chris Rock skit)  New Slaves (raw, industrial)  Kids See Ghosts (dark, ethereal)  Closed on Sunday (spiritual)  Also, he just has a lot of drive, and that's inspiring. E.g. people thought he should stick to producing and would never make it as a rapper, but he did; people thought he'd flop when he tried to join the high-end fashion world, but he didn't; etc. Heck, his first single as a rapper, called “Through the Wire,” was rapped through a wired-shut jaw from the car accident that in retrospect changed his life:  ",
            "date": "Updated September 14, 2020",
            "views": "456",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Barnaby Collins",
                    "user_href": "/profile/Barnaby-Collins"
                },
                {
                    "user_id": "Beautiful",
                    "user_href": "/profile/Beautiful-64"
                }
            ]
        }
    ]
}