{
    "title": "Why does my vocal condition change throughout the day, especially for falsetto? - Quora",
    "tags": [
        "Falsetto",
        "Singing Voice",
        "Voice",
        "Singing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Beth R.S.",
                "href": "/profile/Beth-R-S"
            },
            "answer_text": "One thing could be how you are warming up--if you aren't warming up gently, that could be part of the issue. You can warm up by singing very softly, humming, lip buzzing (blowing air out through your lips), doing glides up and down the scale, doing \"sirens\" (this is what my teacher calls them, no idea of the proper name, but starting at a low or high note and just gliding very gently up or down to a different tone, no need to accurately 'sing' notes while doing this). I find that sirens done softly are one of the best warms up for me as a soprano, so you may find that helpful when you're trying to sing falsetto. Absolutely do not \"push\" your voice in that part of your range as you warm up. Don't try to sing loudly or even overly softly, just do what's comfortable. Do targeted practicing after warming up--if there's a portion of your piece that involves falsetto, only practice that a few times, and then move onto something else to give your voice a break. For example, on a piece with a lot of difficult passages, I will practice daily but only lightly sing through a section I am learning maybe three times before moving onto something else. I don't want to \"over practice\" and make the piece uninteresting. If I limit myself, I sustain interest. I'd also suggest avoiding caffeine for a week or so, if you possibly can, to see if that helps. When I was taking hour-long weekly lessons, I not only avoided caffeine on lesson and performance days (and the day before), I also avoided dairy about 24 hours before my lessons, as that seemed to cause more phlegm, but now that I am older and only taking lessons every other week, I am not being so rigid. I do still avoid caffeine in the few hours before my lessons, and I avoid fizzy drinks on the day of my lessons (personal preference, but I have noticed that even burping lightly affects my vocal quality). But it could definitely be vocal fatigue, as others here have suggested. You may not be tired, per se, but your vocal folds may be. Are you singing a lot during the day and exhausting your voice in this area of your range? I'd suggest taking it easy on that part of your range, and if you need to practice in that range, limit it to 30 minutes a day, or even 15 minutes twice a day. If you can go a few weeks without experiencing the \"glitches,\" then you could add an extra five minutes to each practice session.  ",
            "date": "Answered February 25, 2016",
            "views": "569",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Swessinger",
                "href": "/profile/Mark-Swessinger"
            },
            "answer_text": "Fatigue could be a cause, but it is more likely that your body changes minute by minute.  Vocal music is created through the use of you body, and in every second there a at least a million things going on within it. Chemical reactions, gas exchange, digestion, cognitive function, electrical impulses.  Let's face it. It's tough to be a singer and have to rely on an instrument that inconsistently reliable at best. When a pianist places a finger on a key, a guitarist places her hand on the neck, a clarinetist blows and holds his hand properly, then a consistent sound is created. As singers, all we have to rely on is a sound technique, developed over years of study, with patience and practice.  Learn to be consistent in your singing technique, and it should not fail you, regardless of your temperature, aches, or las night burrito.  ",
            "date": "Answered February 22, 2016",
            "views": "951",
            "upvotes": "0"
        }
    ]
}