{
    "title": "Why do people tolerate lip syncing in major concerts? - Quora",
    "tags": [
        "Lip Synching",
        "Live Music",
        "Concerts",
        "Fraud"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bill Smith",
                "href": "/profile/Bill-Smith-345"
            },
            "answer_text": "The first point to consider is a lot of people and particularly young people lose all sense of reality and proportionality, when they are around a celebrity/musician they admire. This effect, what ever you want to call it, aids in the belief that most people don't believe their favorite acts do it. This translates to not believing it, unless given undeniable proof and even then, they will defend it, saying it was just this one occurrence. When Milli Vanilli got caught. I thought it was abundantly obviously weren’t doing their own singing, as their accents at the time were too heavy to pull it off. It is one thing for mild accents and stutters to disappear, it is another when they that accent was so unique and pronounced you initially questioned if it was English he was speaking. The masses however, clearly felt differently and the uproar it caused was the shocking part to me, as I assumed everyone was in the know. Clearly they weren’t. Also, singing every night (when on tour) is actually quite hard on the voice. Even Michael Jackson in \"This is it\" video says to the young girl with the strong voice, I have to save my voice, I can't do that anymore and he wasn't attending rehearsals daily. It is not uncommon for singers to lose their voice temporarily from overuse. Another common issue is nodules developing on vocal chords (affecting voice quality and potential health as it can become cancerous) for those that sing live routinely. If the next date is the following night in your city are they going to cancel the concert? Highly unlikely, as those dates are booked months in advance and are hard to reschedule. There is a lot of pressure for acts to perform on the stated time and date. Also, a lot fans want their acts to dance while they sing. While some of that is possible if the dancing is minimalistic. The boy band acts of the past (and many others) that often employ heavily laden dance choreography, cloth changes just can't be done, while at the same time maintaining voice control. Just try jumping up and down for 1 to 5 minutes while singing your favorite song and see how much your voice waivers. Now imagine doing that over a period of as much as two hours. All the special training and being physically fit won't allow you to overcome that. I don't have an special behind the scenes access to prove this but I'm sure the vast majority of acts employ this at some level while on tour, some more than others. So the question of why they tolerate it is a mute point because for the most part they are blissfully unaware and aren’t going to take the time and effort to investigate. One must also consider the ramifications if they were to make it a requirement to publish this information. If you think about it logically. if you knew they singer was just lip syncing, would you pay the steep ticket prices just to be in the presence of a performer? That would be essentially what was happening as you can hear a studio copy at home far cheaper. So don’t look for it to become a requirement to publish this information. ",
            "date": "Updated September 18, 2020",
            "views": "12",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Renato Tunes",
                    "user_href": "/profile/Renato-Tunes"
                },
                {
                    "user_id": "Peter Vilkin",
                    "user_href": "/profile/Peter-Vilkin"
                },
                {
                    "user_id": "Christian Browning",
                    "user_href": "/profile/Christian-Browning"
                }
            ]
        },
        {
            "author_info": {
                "name": "Katie Nguyen",
                "href": "/profile/Katie-Nguyen"
            },
            "answer_text": "I don't think an audience ever tolerates lip synching, but I think there also comes a point where you just accept it.  I've seen Britney Spears live twice now and anyone that has seen her can pretty much confirm that she is a pro lipsyncher. She is, however, a phenomenal performer. The dancing, the stage, the outfit changes - it's all a part of what makes going to her concerts such a great experience. I was just 9 years old when I saw her debut \"...Baby One More Time\" tour and I don't remember going and trying to pay attention as to whether she \"sang\" a song correctly or if it sounded just like a backing track or the same as on her album. Instead, I remember going with my dad, getting dressed up in a plaid skirt and pigtails, and ready to see my favorite teen pop idol!  At the end of the day, it didn't matter that much if she was lipsynching or not because I was singing all of Britney's songs as loud as I could anyways. ",
            "date": "Answered February 15, 2015",
            "views": "381",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Priya Rayat",
                    "user_href": "/profile/Priya-Rayat"
                },
                {
                    "user_id": "William Chen",
                    "user_href": "/profile/William-Chen-6"
                },
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                },
                {
                    "user_id": "Sumi Kim",
                    "user_href": "/profile/Sumi-Kim"
                },
                {
                    "user_id": "Elynn Lee",
                    "user_href": "/profile/Elynn-Lee"
                },
                {
                    "user_id": "Jacqueline Nguyen",
                    "user_href": "/profile/Jacqueline-Nguyen-3"
                },
                {
                    "user_id": "Diana Tan (陈丽梅)",
                    "user_href": "/profile/Diana-Tan-陈丽梅"
                },
                {
                    "user_id": "Vivek Shanmugam",
                    "user_href": "/profile/Vivek-Shanmugam"
                },
                {
                    "user_id": "Yair Livne",
                    "user_href": "/profile/Yair-Livne"
                },
                {
                    "user_id": "Andrew Chao",
                    "user_href": "/profile/Andrew-Chao"
                }
            ]
        }
    ]
}