{
    "title": "Why do bands sound better in the studio than live? - Quora",
    "tags": [
        "Bands (music)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mika Busch",
                "href": "/profile/Mika-Busch"
            },
            "answer_text": "I would posit that you aren’t listening to talented bands. 8 D Seriously, though… in the studio, the band generally has the opportunity to record dozens of takes of each song, dozens of takes of each aspect of each song (vocals, drums, bass, each guitar, each other instrument, each guitar solo, etc.) and then mix the best of the best into one song. Then they can mix the individual levels and aspects, adjusting the base or pitch or whatever else it is they do… I can’t be specific, my brother is the musician… but the point is, they can control every little detail to make each song “perfect.” Some bands even use session musicians to cover for less than top quality band members. Live… that is, real live performances… are only as good as the musicians themselves and can be affected by personal matters. The singer might have a hoarse voice, the drummer might strain a muscle, the guitarist might have an inconvenient paper cut… heck, when I saw The Candy Snatchers, their bassist had quit a week earlier and the guitarist’s girlfriend was playing bass. Basically, live… sh*t happens. But the highest quality musicians are often better live than they are in the studio. King Crimson would be one obvious example. The Velvet Underground would be another. I think maybe Led Zeppelin (never much got into them) and some other classic rock bands would definitely fall into that category. Lou Reed and John Cale solo tours, Can, the tours Brian Eno did with 801… All that was before my time, of course, but I can tell you definitively that many late 80s and 90s bands were better live than in the studio. Ani Difranco, Guitar Wolf, Oingo Boingo, Moby, No Means No, Tori Amos, Dead Voices on Air, Sister Machine Gun, The Legendary Pink Dots, Bright Eyes, Boris the Sprinkler, Helios Creed, Kid 606… it all boiled down to one of two things. Can they play their instruments? and/or Does the live performance add a certain energy to the sound? So, punk bands often sound better live because punk music is meant to be loud and (sometimes) sloppy… and talented musicians often sound better live because you get their true performance, not some calculated version designed to be “perfect” and often “perfect” for as many listeners as possible. These days… well, I’m not a kid any more and don’t often go to concerts. I think my last one was around 2005, not counting people I know. So, if today’s music is better in the studio than it is in the live, all I can really say is… well, listen to better music and get offa my lawn! 8 D Peace be with you, my friend. ",
            "date": "Answered May 25, 2020",
            "views": "138",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Peter Losh",
                "href": "/profile/Peter-Losh"
            },
            "answer_text": "Are you referring to music back in the day or the music of today? There's a big difference. Back in the day, when actual musicians actually sang and played their instruments, most live performances sounded ragged and thin compared to studio recordings which were clean, richer and complex, overdubbed, and enhanced by various recording techniques. Jimi Hendrix and Jimmy Page were known for their mastery in the studio, and their studio recordings nearly always sounded “better” than live performances. With most live pop music today, you're not listening to a live performance at all, but a highly processed concoction of pre-recorded, lip-synced, auto-tuned, and looping computerized tracks. It's the musical equivalent of junk food. It sounds “better” because it's played at deafening volume, accompanied by an elaborate visuals, and amplified by crowd excitement. ",
            "date": "Answered May 23, 2020",
            "views": "110",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Robert Hall",
                    "user_href": "/profile/Robert-Hall-481"
                }
            ]
        }
    ]
}