{
    "title": "Why is rock n' roll also called the devil's music? - Quora",
    "tags": [
        "Rock Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Parson Nylon",
                "href": "/profile/Parson-Nylon"
            },
            "answer_text": "It might sacrifice you to that which doesn’t love you in return. The musicians often do drugs and act promiscuously. And the lyrics are often about doing drugs and acting promiscuously. The reason why those things are satanic is they sacrifice you to things that don’t love you back. Pleasure and loud chorus aren’t defined as satanic in the Bible, actually the opposite is true. You know those rock concerts? Those are great things. You see people waving their arms and signalling the singers and trying to get close, and you see them screaming their affection. You see that people have an urge to outlet affection and energy and passion. But, after the show and after every one of the great many concerts I’ve been to, you see the drinks and the alcohol and the people laughing without knowing why it’s funny and falling asleep and waking, disorientated and heartbroken and waiting for the next one. I used to think that stoning was a terribly misplaced rock n roll stereotype but now, I’ve found that these things happen. I think there’s new ground to cover in rock n roll. Sometimes people holler, “Sex, drugs and rock n roll” but other times, people holler, “Peace, love and rock n roll” What creates peace and love in this society? Real and assured peace and love? There needs to be a foundation for peace and love that isn’t reliant on material or even, on people. What’s missing is God. If we involve God who the Bible says lasts and loves us back, with pure love, that would then be un-satanic. It’s not a music problem. ",
            "date": "Answered November 10, 2019",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ethan Hein",
                "href": "/profile/Ethan-Hein"
            },
            "answer_text": "Racism. Rock and roll was originally an African-American music. Every black music style is vilified as a threat to our nation's youth until it's completely co-opted by white musicians, at which point it becomes innocuous and \"classic.\" This 1921 article from Ladies Home Journal asks, Does Jazz Put the 'Sin' in Syncopation? Now they play jazz at Lincoln Center and Carnegie Hall. Rock has similarly become safe enough to be embraced by extreme religious conservatives. Here's Mike Huckabee sitting in with Def Leppard:    Right now, there's considerable moral panic over hip-hop, but already, respectability is starting to creep in around the edges. No doubt, a generation from now, hip-hop will be totally anodyne, and America will have moved on to hate and fear whatever black kids are enjoying. ",
            "date": "Answered July 8, 2015",
            "views": "95",
            "upvotes": " View 40 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michiel Lombaers",
                    "user_href": "/profile/Michiel-Lombaers"
                },
                {
                    "user_id": "Falafel Dürüm",
                    "user_href": "/profile/Falafel-Dürüm"
                },
                {
                    "user_id": "Marty Qatani",
                    "user_href": "/profile/Marty-Qatani"
                },
                {
                    "user_id": "AMANUEL TESFAY",
                    "user_href": "/profile/AMANUEL-TESFAY-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/XOR-Xor-3"
                },
                {
                    "user_id": "Sergio Romero",
                    "user_href": "/profile/Sergio-Romero-7"
                },
                {
                    "user_id": "Goutam Gokul",
                    "user_href": "/profile/Goutam-Gokul"
                },
                {
                    "user_id": "Luca Dornelles",
                    "user_href": "/profile/Luca-Dornelles"
                },
                {
                    "user_id": "Alexander Chiltern",
                    "user_href": "/profile/Alexander-Chiltern"
                },
                {
                    "user_id": "Anirban Roy",
                    "user_href": "/profile/Anirban-Roy-74"
                }
            ]
        }
    ]
}