{
    "title": "Why do you like musicals? - Quora",
    "tags": [
        "Broadway Productions",
        "Musical Theatre",
        "Movies"
    ],
    "response": [
        {
            "author_info": {
                "name": "Freya Amanda",
                "href": "/profile/Freya-Amanda-1"
            },
            "answer_text": "My parents broke up when I was 4, and neither of them had a lot of money when I was growing up. Every Friday my Dad would pick me up and we’d go to the local charity shop and buy a second hand movie on VHS (it’s all he could afford). Then we’d watch it on Saturday night and I’d go back to my mum’s on Sunday. One Friday we went in and I chose the film ‘Annie’ - the 1990s Disney version. I was obsessed with it. My dad and I would sit and watch it every weekend for months, I sang the songs all the time, I got a red-headed barbie doll on one of our trips to the charity shops, and I used it to act out the scenes pretending the doll was Annie. A few months later we go into the charity shop again and I choose Joseph and the Amazing Technicolour Dreamcoat - I loved it even more than Annie. I loved the fact that it was ALL singing with no dialogue, 6 year old me found it fascinating. To this day my favourite musicals are sung-through, Les Mis, Falsettos, Hamilton, Hadestown, A New Brain… Anyway, every Saturday we’d watch Annie in the afternoon (and I’d usually act out the scenes) and Joseph in the evening, snuggled up on the tiny sofa we had. I was usually half on my Dad’s lap as the sofa was small and I’ve always been a cuddler. My dad started getting me other musicals on video - we got the original 1980s Annie, Oliver, Grease, Hairspray, Sound of Music etc. As I grew up I never really grew out of musicals, and when I got older I started watching and listening to live musicals on YouTube. It’s just always felt like this special thing. I have precious memories from my early childhood of watching musicals with my dad, and nobody I knew liked them as much as me - especially as I became a teenager. I live in the middle of the English countryside, so most teenagers aren’t too interested in showtunes. It felt like my own little world. No matter what was happening I could stick on a broadway soundtrack and be whisked away to a beautiful story told through powerful music. Now over half of the albums on my phone are original broadway/west end recordings, and my parents save up to take me down to London regularly to see my favourite musicals. So far I’ve seen Hamilton, Lion King, Wicked, The Book of Mormon and Les Mis, and I’m going to see Hadestown at Christmas. Every time I fall in love with a new musical from listening to the soundtrack, I wait until the weekend to share it with my dad, and if I can find a bootleg we’ll hook it up to the TV and watch it together. We watch Falsettos pretty regularly as it’s one of my all time favourites and has a HD recording. Plus there’s nothing more special than that feeling in the theatre. I honestly can’t explain it but it’s so different to watching a film. I don’t think you can fully appreciate how it feels unless you’re a theatre lover yourself. I love musicals for the memories. I love musicals for the story. I love musicals for the songs, the meaningful lyrics, the raw talent of the actors. The world it creates in your head, the choreographed group dances, the community feel with other fans. The experience when you sit down in the theatre, knowing that the next 3 hours of magic will never be recreated again. Every show is different, even if just by a finger out of place or a slip on a lyric. I just love musicals. Why? Because they’re musicals. ",
            "date": "Answered October 3, 2018",
            "views": "43",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alexander Sheppard-Reid",
                    "user_href": "/profile/Alexander-Sheppard-Reid"
                },
                {
                    "user_id": "Zia Halawa",
                    "user_href": "/profile/Zia-Halawa"
                },
                {
                    "user_id": "Fengario Swift",
                    "user_href": "/profile/Fengario-Swift"
                },
                {
                    "user_id": "AJ LUTHRA",
                    "user_href": "/profile/AJ-LUTHRA"
                },
                {
                    "user_id": "Christina Drossos",
                    "user_href": "/profile/Christina-Drossos-1"
                },
                {
                    "user_id": "Fener Abdallah",
                    "user_href": "/profile/Fener-Abdallah-1"
                },
                {
                    "user_id": "Jorge Suarez",
                    "user_href": "/profile/Jorge-Suarez-6"
                },
                {
                    "user_id": "Maryan St Claire",
                    "user_href": "/profile/Maryan-St-Claire"
                },
                {
                    "user_id": "Mitaali Shukla",
                    "user_href": "/profile/Mitaali-Shukla"
                },
                {
                    "user_id": "Sanjay Pavan",
                    "user_href": "/profile/Sanjay-Pavan-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kathryn Keck",
                "href": "/profile/Kathryn-Keck-1"
            },
            "answer_text": "This is such a simple answer but: they just make me happy. There’s something about a great harmony or high-energy dance break that just makes me straight-out giddy. I think it has a lot to do with the fact that they remind me of my childhood. My mom was a high school music teacher so I spent a good amount of my childhood sitting in rehearsals or backstage or in the audience of her students’ productions. Also, when it came to music that got played in the car or over the speakers in the house, it was either showtunes or 80s rock. It’s no surprise that I ended up loving showtunes more than any other genre of music. I was also a serious dancer as a child, so I appreciate the choreography of musicals. Basically, going to a musical or watching one on tv takes me back to the simple happy days of childhood. I crave theatre the way some people crave alcohol or chocolate. I’ve watched the live recording of Newsies on Netflix three times in the last four days, and I’d still, without hesitation, pay to see it on stage. And Newsies is far from my favorite show (though I will say, the energy and charisma of the cast is unmatched by almost any other show I’ve seen). If they recorded Spring Awakening or The Color Purple, I’d probably watch it every day. When the 25th anniversary concert of Les Miserables was released on iTunes when I was in high school, I’d watch it every day when I got home while I did my homework. Nothing in the world gives me the breathless, giddy, can’t-stop-smiling feeling that musicals give me. ",
            "date": "Answered October 5, 2017",
            "views": "21",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Keck",
                    "user_href": "/profile/John-Keck-2"
                },
                {
                    "user_id": "Nicole Goh",
                    "user_href": "/profile/Nicole-Goh-10"
                },
                {
                    "user_id": "Holly Root-Gutteridge",
                    "user_href": "/profile/Holly-Root-Gutteridge"
                },
                {
                    "user_id": "Mohit Kumar",
                    "user_href": "/profile/Mohit-Kumar-1652"
                }
            ]
        }
    ]
}