{
    "title": "Why does music make us feel so many emotions? - Quora",
    "tags": [
        "Evolutionary Psychology",
        "Positive Psychology",
        "Understanding Emotions",
        "Emotions",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Devon Mc Arthur",
                "href": "/profile/Devon-Mc-Arthur"
            },
            "answer_text": "There’s the science and then the nostalgia, the reminiscing, the thoughts that pull at our heart strings.   The way music works in our brain is the same way language is processed, basically using syntax the same way our brain uses the mirror neurons, this mirror neuron is what fires when animals see other animals do something and then we copy it, so the emotion that connects the song to our brain is the same beat that will follow it, I’m not calling anyone an animal here, unless you purr or growl.. Then you’re on your own. Then there’s the limbic system which sorts a variety of functions including emotion, behavior and memory. So our brain is literally firing off as music plays no matter what music it is, our brain works on overdrive understanding what music is, better than we can express it . Our responses to music come from expectation and then resolution, by this we have memories attached to different types of music we’ve already heard. It has been proven that people with autism can have their limbic systems activated while listening to music. So even they can feel the emotion music carries. The same as our ancestors have been playing music for more than we have known. In Germany recently they found a flute which is older than 40 000 years old. See, music is a part of us, can’t escape the rhythm!   An old flute with the memories of old human civilizations. https://www.nytimes.com/2012/05/29/science/oldest-musical-instruments-are-even-older-than-first-thought.html No matter where we go, there will always be art that resembles music. Now art and music have a high correlation, some would contest that music is art... It may trigger deeply suppressed emotions and grant us the ability to feel those hidden feelings, and achieve an emotional epiphany. Whereas rock music can make us feel haррier inside as we release the anger, we listen to sad music and for whatever reasons, makes us sadder, but it feels really good to let out those emotions that have been built up from inside of us. We don’t want to explode form bottled uр emotions. This is why sometimes we cry when we hear a song not knowingly until afterwards. Some of us even get Goosebumps while listening to music, music resonates within our soul… If you go to any Jazz club you can’t help but feel a part of the theme and feel as if you’re the bees knees or even better, Frank Sinatra owning the club. We do need to feel at least once in a while, otherwise we may all just be androids and superhuman beings… may sound cool for now but trust me, it’s not. Tried it. With music we feel connected . On our first date with our first soul mate, there was that one song that came on the radio that you both knew that when it came on again (later in life) it felt either really good or didn’t make us feel too happy. Sadness if it’s gone, happiness if you’re celebrating 40 years or I might-add sadness again! But you certainly resonate with the passion you felt at that time. What haррens when you meet someone for the first time, we almost judge them by character from the music they listen to. So we find out what they listen and its the oррosite of what you listen to and immediately feel some type of way but that’s because of your individual feelings towards that genre. There’s the deep seeded love when listening to romantic music… the indie music that makes us what to take a road-trip with our best friends, the rock and roll where we want to jump and down, the jazz for when we are American gangster and hiр hop for when we are actually gangsters (Jokes)and classical for when we study. There’s no hate on any type of music, but the best music is what makes us feel something we can’t put into words as easy as it is to sing the song at the top of our lungs. ",
            "date": "Answered July 16, 2020",
            "views": "221",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Susan Altman",
                    "user_href": "/profile/Susan-Altman-7"
                },
                {
                    "user_id": "Patricia Falanga",
                    "user_href": "/profile/Patricia-Falanga"
                },
                {
                    "user_id": "Pramodya Thilakarathna",
                    "user_href": "/profile/Pramodya-Thilakarathna"
                }
            ]
        },
        {
            "author_info": {
                "name": "Madhuri Sen",
                "href": "/profile/Madhuri-Sen-2"
            },
            "answer_text": "That's something that is not very understood in it's details, but has indeed been the subject of much research - and is certainly a complex process. Simplistically speaking sounds create associations - the same as other sensory input data, especially such as smell does. But sound also additionally may have some evolutionary basis being integral to survival mechanisms for pretty much all sentient beings - over other sensory input other than visual perhaps.  These are the details as per some more recent research published on Page on www4.lu.se:  Juslin & Västfjäll (2008) suggested the following six mechanisms Brain stem reflex refers to a process whereby an emotion is induced by music because one or more fundamental acoustical characteristics of the music are taken by the brain stem to signal a (potentially) important and urgent event. All other things being equal, sounds that are sudden, loud, dissonant, or feature fast patterns induce arousal in the listener. The responses reflect the immediate impact of simple auditory sensations. Evaluative conditioning (EC) refers to a process whereby an emotion is induced by music simply because this stimulus has been paired with other positive or negative stimuli. For instance, a specific piece of music may have occurred repeatedly together in time with a specific event that always makes you happy such as meeting your best friend. Over time, through repeated pairings, the music itself will, eventually, arouse happiness even in the absence of the friendly interaction. Emotional contagion refers to a process whereby an emotion is induced by music because the listener perceives the emotion expressed in the music, and then ‘mimics’ this expression internally, which by means of either peripheral feedback from muscles, or a more direct activation of the relevant emotion representations in the brain, leads to an induction of the same emotion. Visual imagery refers to a process whereby an emotion is induced in a listener because he or she conjures up visual images (e.g., of a beautiful landscape) while listening to the music. The emotions experienced are the result of 14a close interaction between the music and the images. Listeners appear to conceptualize the structure of the music in terms of a metaphorical, nonverbal mapping between the music and image-schemata grounded in bodily experiences; for instance, hearing the melody as “moving upward”. Listeners react to the mental images much in the same way as they would to the corresponding visual stimuli in the “real” world (e.g., reacting positively to a beautiful nature scene). Episodic memory refers to a process whereby an emotion is induced in a listener because the music evokes a memory of a particular event in the listener’s life (often referred to as the “Darling they are playing our tune” phenomenon). When the memory is evoked, so is also the emotion associated with the memory, and this emotion may be relatively intense – perhaps because the psychophysiological reaction pattern to the original event is stored in memory along with the experiential contents. Music expectancy refers to a process whereby an emotion is evoked in a listener because a feature of the musical structure violates, delays, or confirms the listener’s expectations about the continuation of the music. Thus, for example, the sequential progression of E-F# sets up the expectation that the music will continue with G#. If this does not happen, a listener familiar with the musical idiom could become, say, surprised. The expectations are based on the listener’s previous experiences of the same style of music. ",
            "date": "Answered November 6, 2014",
            "views": "22",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aaron Young",
                    "user_href": "/profile/Aaron-Young-30"
                },
                {
                    "user_id": "Muthu Kumar Chandrasekaran",
                    "user_href": "/profile/முத்துக்குமார்-சந்திரசேகரன்-Muthu-Kumar-Chandrasekaran"
                },
                {
                    "user_id": "Dusan Melentijevic",
                    "user_href": "/profile/Dusan-Melentijevic"
                },
                {
                    "user_id": "Josh Alexandre",
                    "user_href": "/profile/Josh-Alexandre"
                },
                {
                    "user_id": "Tf McDonald",
                    "user_href": "/profile/Tf-McDonald"
                },
                {
                    "user_id": "Lu Laverde",
                    "user_href": "/profile/Lu-Laverde"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/James-184"
                }
            ]
        }
    ]
}