{
    "title": "Why do rappers get diamonds placed on their already expensive watches? - Quora",
    "tags": [
        "Diamond Industry",
        "Jewelry Industry",
        "Luxury Watches",
        "Diamonds",
        "Watches",
        "Hip Hop and Rap Artists"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kameron Brooks",
                "href": "/profile/Kameron-Brooks-3"
            },
            "answer_text": "They want the watch to be as flashy as possible. This is called Blinging out the watch. If you take something very expensive and cover it in expensive things it becomes even more expensive right..? Nope. Here is a funny story about a watch like this that I came across when I was managing a pawn shop. A guy once pawned Breitling Bently, completely iced out in diamonds. It was a Breitling, which is not the most high end watch but it is pretty expensive. This watch was covered by about 10cts of diamonds (some as big as 0.15cts each). He pawned it for more than $10,000 (I do not remember exactly how much). It was in there for years, he eventually went to prison and couldnt pay on it any more. When it came time to sell it, No watch dealer would buy it. We tried for months to sell that thing, online, to customers, to dealers, even the the jewelry store that blingged it out. The best offer we ever got was around $2000. To this day, it sits there. A shining, stainless steel and diamond conversation piece. Interesting to all but too rediculous looking to sell. Stripped of its luxury watch value. ",
            "date": "Answered March 19, 2019",
            "views": "535",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Chris Bracher",
                    "user_href": "/profile/Chris-Bracher"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Perreaux",
                "href": "/profile/David-Perreaux"
            },
            "answer_text": "The wealthy rappers don't tend to do that. From my general observations, only the rappers who want to create the illusion that they are wealthy tend to do that and many of them have a net worth of <$150,000 USD in contrast to the actual wealthy rappers who don’t get diamonds put on their already expensive watches whose net worth extends into the tens and even hundreds of millions of USD. Also the wealthy rappers can afford brand new Piaget watches that cost more than most of the “blingy” rappers total net worth. Also, the diamonds used by the new jack, “perpetrating a fraud”, rappers typically are the cheap man-made, factory manufactured types as opposed to the much more expensive natural diamonds. Or as E-40 put it in his song, “Who You Talking To”, When it comes to my jewelry, it's done rightThese rappers got y'all fooled with their diamonds, Them ain't real, them moissanites. ",
            "date": "Updated May 31, 2019",
            "views": "333",
            "upvotes": " Answer requested by Joey Mikhail"
        }
    ]
}