{
    "title": "Why does Trump have 'accordion' hands? - Quora",
    "tags": [
        "Accordions",
        "Donald Trump's Hair",
        "Gestures"
    ],
    "response": [
        {
            "author_info": {
                "name": "Charlie Anderson",
                "href": "/profile/Charlie-Anderson-12"
            },
            "answer_text": "I’m not going to be sarcastic about this. I think people in general that do this are struggling to explain themselves convincingly with words. What I mean is there are multiple possibilities as to the ‘why’ of it. It’s not embellishing emphasis, for example how Italians are stereotyped for gesturing while talking if they are passionate about something. In the case of accordion hands, the motion is not really helping to describe a shape or a concept; no matter who was doing it. In Trump’s case, it’s like he’s flailing to make his point and it comes across exhibiting some frustration. The motions get wider the more he’s challenged and he hates that. Notice when he steps back from a lectern, he often twists side to side and gazes out at the room or his eyes get droopy. He’s not the center of attention for that time and that drives him to distraction. Anyway, to me it’s a distraction/frustration motion he’s come up with and it has become automatic now. On the other side there is Nancy Pelosi who’s been called out for her “jazz hands” and she does frequently use one hand or the other to gesture but it’s more subtle than pumping your arms in and out and in and out and in and out on the squeezebox all night. ",
            "date": "Answered April 6, 2020",
            "views": "13",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Scott Connelly",
                    "user_href": "/profile/Scott-Connelly-1"
                },
                {
                    "user_id": "Kathy Houk",
                    "user_href": "/profile/Kathy-Houk-2"
                },
                {
                    "user_id": "Peter van Loon",
                    "user_href": "/profile/Peter-van-Loon"
                },
                {
                    "user_id": "Del Spence",
                    "user_href": "/profile/Del-Spence-1"
                },
                {
                    "user_id": "Sloan Scott",
                    "user_href": "/profile/Sloan-Scott-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Greg Pfeifer",
                "href": "/profile/Greg-Pfeifer-4"
            },
            "answer_text": "It goes along with his half whispering voice. Like he’s saying something so important that it is a secret and we should listen closely to it to make sure we hear it. He moves his hands thinking it emphasizes what he is saying like it is important and possible show his words mean action. Nothing can be further from the truth as far as I’m concerned. I don’t listen to him. The CORONA-19 virus is dangerous and has been ever since we heard of it existing. Something like this could happen at any time and we should always have plans and manning to contend with outbreaks. People should understand the gravity of the situation and not be jerked around by a president trying to make it not seem as bad as it is just to keep popularity points. or possibly he is just that stupid, either way he is unfit to serve. ",
            "date": "Answered April 6, 2020",
            "views": "695",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alice Kizas",
                    "user_href": "/profile/Alice-Kizas"
                },
                {
                    "user_id": "Dustin Paulson",
                    "user_href": "/profile/Dustin-Paulson"
                },
                {
                    "user_id": "Dale Goldfarb",
                    "user_href": "/profile/Dale-Goldfarb"
                },
                {
                    "user_id": "Elizabeth Snell",
                    "user_href": "/profile/Elizabeth-Snell-14"
                },
                {
                    "user_id": "Joan Aiken",
                    "user_href": "/profile/Joan-Aiken-1"
                }
            ]
        }
    ]
}