{
    "title": "Why are horror movies so fun to watch? - Quora",
    "tags": [
        "Horror (genre)",
        "Horror Movies",
        "Evil",
        "Hollywood",
        "Movie Recommendations",
        "Movies"
    ],
    "response": [
        {
            "author_info": {
                "name": "IJ Wilson",
                "href": "/profile/IJ-Wilson"
            },
            "answer_text": "Because they involve an element of risk. Will I’ll be able to handle what I am seeing - or will it frighten me too much? It’s like standing close to the edge of a cliff, and looking over, to see how much it affects you. Also, when a horror movie has a good story, and we relate to the characters, then we care about what happens to them — even if it is the monster! The group experience of watching horror is also what makes it fun. Every enjoyable experience you’ve had with a horror film, is usually with a friend, or a group of friends, when you can laugh and joke and yell at the screen - and see who jumps the most at the crucial scenes; then talk about it afterwards. You mostly watch horror films as a teenager - and that’s the time in your life when you are actively chasing ‘thrills’. People that don’t find horror films fun, or exciting, will avoid them. ",
            "date": "Answered December 27, 2018",
            "views": "805",
            "upvotes": " Answer requested by Makayla O’Brien",
            "upvoters": [
                {
                    "user_id": "Stig Riesto",
                    "user_href": "/profile/Stig-Riesto"
                }
            ]
        },
        {
            "author_info": {
                "name": "Douglas Rose",
                "href": "/profile/Douglas-Rose-12"
            },
            "answer_text": "It’s like a roller coaster or other fair ride (only safer!) We like thrills and adventure. And unlike a ride at the fair, if it gets too intense we can walk out or turn off the DVD player. It’s a safe “ride” usually. It also allows us to let off steam and scream in a socially appropriate/approved way. ",
            "date": "Answered December 28, 2018",
            "views": "99",
            "upvotes": " View 1 Upvoter "
        }
    ]
}