{
    "title": "Why can you sing the right notes and not blend? - Quora",
    "tags": [
        "High Notes",
        "Singing Advice",
        "Singing Tips",
        "Singing Voice",
        "Singers",
        "Voice",
        "Singing",
        "Musicians",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Courtney Powers",
                "href": "/profile/Courtney-Powers-9"
            },
            "answer_text": "Sung tones have qualities other than pitch. One is timbre, (pronounced tam’-ber) which is the waveform shape. It’s the main reason a trumpet doesn’t sound like a flute, even on the same note. If one of the singers has a very penetrating timbre, it will not mix well with others even when the pitch is correct. For lyrics, the accent really matters, as well. A New Englander will not blend well with a group of Southerners, for instance. People’s perception of pitch varies, as well, with some particularly sensitive persons able to differentiate even-tempered and other temperaments. (Those who are this sensitive are, of course, very obnoxious to those of us who can’t hear the difference.) A tone-deaf person, which for one with perfect pitch means almost all of us, may think they are on pitch while being gratingly off pitch to those who can hear the difference. Those even slightly tone-deaf think they are right on pitch when they are not, and the bad blend can only be heard by those who have that degree of tone sensitivity. As my own tone sensitivity is only mid-ling, I learned the trick of listening for the beat of harmonics to detect whether I was “blending” properly, thus increasing my ability to detect slight variance in pitch. I found I have the tendency to sing a bit flat if I don’t compensate, which was important in my youth, as the female voice I was most often paired with belonged to a girl whose voice, if she didn’t watch it, tended to sharp just a hair. Since otherwise we were almost a perfect match, we usually were paired anyway for duets, musical roles, and other performances. ",
            "date": "Answered December 3, 2019",
            "views": "88",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mark Andrews",
                    "user_href": "/profile/Mark-Andrews-56"
                },
                {
                    "user_id": "Tom Slocombe",
                    "user_href": "/profile/Tom-Slocombe"
                },
                {
                    "user_id": "Gaitsiri Mongkolsmai Lin",
                    "user_href": "/profile/Gaitsiri-Mongkolsmai-Lin"
                },
                {
                    "user_id": "John O'Neal",
                    "user_href": "/profile/John-ONeal-29"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sharon Metzger",
                "href": "/profile/Sharon-Metzger-4"
            },
            "answer_text": "It is a practice of being “in the mix\" or blending depending on what part you are singing . For example, if you have four parts going, the lead or melody singer’s voice is the out front voice. That is why it is the “lead\". Behind that sound is the tenor (high voice), bass ( low voice) and baritone ( voice that fills in the holes of sound that are left open and need to be filled. )Having sung most of these parts, to me, the baritone part was the hardest to sing. Our group jokingly called it “the garbage part\"! Keep in mind that those three parts ( tenor, baritone and bass) need to be blended with the lead so that no one part is more dominant than the others to create a beautiful full blending of voice. Well, the lead is slightly more out there at times. Overall though, the hardest part is learning to sing with each other without one part being more dominant than the rest. It was very difficult at first for me as I was a solo theater singer having to learn to sing the baritone part. Try flipping parts around to see what creates your best sound. Not only do you learn your part but everyone else's. And your strongest possibly most musically adept person will end up as the baritone! It's a dirty job but someone has to do it! If you really want to hear how much that part counts sing one song without their presence. You will never be satisfied with just three parts again.well, you might be satisfied at 3 part singing but if you want to really impress your audience..go 4. Reactions will go from “ oh,nice! “ to OMG..that was Amazing!!! “ Best of luck! ",
            "date": "Answered December 6, 2019",
            "views": "71",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mark Andrews",
                    "user_href": "/profile/Mark-Andrews-56"
                }
            ]
        }
    ]
}