{
    "title": "Why do artists release singles after the album? - Quora",
    "tags": [
        "Music Albums",
        "Artists and Creative Professions",
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Whelton",
                "href": "/profile/Mark-Whelton-3"
            },
            "answer_text": "Cannot answer with regard to today’s music scene but in the past it has been to generate additional album sales. With regard to most radio stations the programmes with the highest audiences, breakfast and driving home times, have always taken their play lists from single releases. Therefore if you want to get played, release singles. How many times have you heard a single on the radio by an artist that you are unfamiliar with and think that’s quite good. Then another track gets released and you think the same. By the third release you buy the album. I am sure I bought “Jagged Little Pill” on that basis The question is, are some of the most successful selling albums due to the quality of the music or due to how many singles are released from it. I believe it could be the latter otherwise “Greatest Hits” compilations would not be many very credible artists best selling album. ",
            "date": "Answered September 15, 2020",
            "views": "402",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mara Waldmann",
                    "user_href": "/profile/Mara-Waldmann"
                },
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ilias Koutromanos",
                "href": "/profile/Ilias-Koutromanos-1"
            },
            "answer_text": "This is the most common technique for major record companies and artists to promote songs individually. They focus on certain songs and they usually create music videos and invest significant amounts of money in marketing and plugging those songs on the radio. The expected result though is the general promotion and the increase of sales of the album itself. In the recent years where audience can buy or stream songs individually, the notion of album releases is fading. ",
            "date": "Answered June 9, 2020",
            "views": "457",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                },
                {
                    "user_id": "Mark Joseph",
                    "user_href": "/profile/Mark-Joseph-39"
                }
            ]
        }
    ]
}