{
    "title": "Why aren't Japanese drama as popular as Korean drama? - Quora",
    "tags": [
        "Japanese Drama",
        "Television Dramas (Asian)",
        "Korean Dramas",
        "Television Dramas",
        "Drama (genre)",
        "Fame and Mass Popularity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Do",
                "href": "/profile/Michael-Do-2"
            },
            "answer_text": "As a long time anime fan and also a big Korean drama fan. It does baffle me why J-dramas hasn’t catch the same popularity like their Korean and Taiwanese counterpart are getting outside of Asia. I can probably give 3 factors why J-dramas aren’t globally well-known outside of Asia like their Korean counterpart: Factor 1: Accessibility issuesThis is what tick off fans of Japanese pop culture that want to watch J-dramas. For the last few years streaming sites that catered to fans of Korean dramas like Crunchyroll, Dramafever, and Viki hasn’t picked up the most popular J-dramas for international fans outside of the US. I remember Dramafever had a forum (before they removed it) and there were 2 topics from DF users regarding why the J-dramas catalog is too small compared to their Korean counterpart, and why J-dramas aren’t being picked up for international streaming on the same level and pace as their Korean and Taiwanese counterpart did. That’s one of the reason why J-dramas hasn’t gone global like their Korean counterpart. Accessibility is one of the issues, it’s not only J-dramas that suffer from this but J-pop also suffer from this issue too: Japanese Entertainment 101: Accessibility - OneHallyu Blog! Answerman - Why is it so tough to buy Japanese digital media downloads? Answerman - Why Do Japanese Companies Block Trailers From Other Countries? Answerman - Why Would A Japanese Publisher Restrict Exports? So yes, accessibility is one of the reason why J-drama is not popular outside of Asia. Factor 2: K-dramas fans are the toughest audiences to get them to watch other Asian dramas and that include J-dramasThis is the sad truth but majority of K-drama fans won’t branch out to other Asian dramas (with the exception of Taiwanese dramas) and that include J-dramas: Why do you think people prefer watching K-Dramas over J-Dramas, C-Dramas, TW-Dramas? - Movies & Television 5 Most Common Comments about Non-Korean Drama Why do people usually choose K-dramas over J-dramas? This is sad but true. Also I think you’re bringing up the question: Why do K-drama fans branch out to Taiwanese dramas, but not Japanese dramas? Well this answer may interest you and I’ll quote from another topic I wrote: Michael Do's answer to Could China ever produce high-quality TV shows and films that could attract audiences beyond Asia? The only Chinese drama that is popular and gaining a big audiences outside of Asia is Taiwanese dramas. Why do majority of K-drama fans watch Taiwanese dramas but not Mainland Chinese dramas? I can cite multiple reasons: Taiwanese dramas international fanbases existed before K-drama and K-pop became popular.Taiwanese rom-com are similar to their Korean counterparts. So many K-dramas fans can become fans of Taiwanese dramas easily.Taiwan cashed in on the K-drama fad first (I think around 2008 or 2009). Mainland China didn't cash until last year. So that explain why there's less fanbases for Mainland Chinese dramas. I mean for example, the hit sensational drama Nirvana in Fire on Viki didn't attract the same audiences that watch period K-dramas.Taiwan had also remake couple of K-dramas, one of them You're Beautiful got remade into Fabulous Boys. Also Park Shin Hye’s cameo in the Taiwanese remake was alone enough to attract international fans of the original drama to watch the Taiwanese remake. So this led to many K-drama fans branching out to Taiwanese dramas.Speaking of remake, Taiwan allowed Korea to remake 3 of their hit dramas. Taiwan knew that K-pop/K-drama fans would branch out to Taiwanese drama by allowing these 3 hit Taiwanese dramas to get Korean remake. This paid off and I found out a lot of people that watch the Korean remakes ended up watching the Taiwanese originals.So yes, that is the only explanation why K-drama fans would branch out to Taiwanese dramas but not J-dramas. Both Taiwanese dramas and Korean dramas are similar when it come to romance and stuff like that. Factor 3: Not marketing or cashing in on the K-drama popularity or pandering to the K-drama fanbasesSo remember I told you accessibility is the main issues? Yeah turns out that Japanese companies that made these dramas don’t market them to international audiences outside of Asia. I was told that Japanese marketing is not as good as their Korean or Taiwanese counterpart. I was also told that Japanese companies aren’t very good when it comes to marketing: Why Japanese Companies Struggle with Marketing Because of that, they don’t understand the international market like the way South Korea and Taiwan understood. So that’s one of them. Also Japan didn’t take advantage of the K-drama popularity that happened in area like the Middle East and Latin/South America. I mean read this: Kdrama’s Popularity Soars In Latin America And Cuba Korean dramas find new market in Central, South Americas 'Secret Garden' becomes first Korean soap opera aired in Argentina and look at these video:      This is how popular and well-known Korean dramas are in Spanish-speaking countries in Latin/South American countries and it won many of these audiences and that’s how K-pop music became so popular in that particular continent: K-Pop in South America. Why so Famous? | Soompi Forget Politics, Let’s Dance: Why K-Pop Is a Latin American Smash | TIME.com Meet Latin America's Teenage Korean Pop Fanatics South Korea launches 'K-pop academy' in Mexico - BBC News How Latinos Became K-Pop's Second Biggest Fanbase in the US After K-dramas and K-pop became really popular in Latin/South America, Taiwan took advantage of K-drama popularity. Have a look what happened: Politically ignored Taiwan practices soap opera diplomacy, in Spanish The Fierce Wife' to air in Latin America TV drama exports Taiwan culture, soft power to Latin America Another Taiwanese TV drama to be aired in Latin America soon | Culture | FOCUS TAIWAN - CNA ENGLISH NEWS To quote the LA Times article: Taiwan and Hong Kong have long been dominant forces in Asian pop culture, Fung said. But Korean dramas and music have in recent years taken over, in part thanks to government support. South Korea began to organize the support and export of cultural products. Government-sponsored creative content agencies evaluated South Korean TV shows, pop songs, films and books and identified the best markets to export them to, Fung said. The result has been an unprecedented boom of Korean cultural exports — Korean cosmetic products in Chinese makeup stores, K-pop concerts in Latin America and endless plays of the Korean pop hit \"Gangnam Style\" in nightclubs all over the world. The Taiwanese government is following South Korea's example, Hsia said. \"The Fierce Wife,\" its creators say, was created to compete with Korean dramas. Set TV and the Taipei Economic and Cultural Office could not provide statistics showing how well the show is performing in Latin America, but in Honduras and Argentina, the show was so popular that it returned for a second run. Set TV is considering introducing four other Taiwanese dramas to Spanish-speaking audiences this year. And though \"The Fierce Wife\" may be a Taiwanese show created in the style of a Korean drama, it has the soul of a telenovela, said Luis Cardenas, director of programming at LATV, the network that owns KJLA. The Fierce Wife is not the only Taiwanese dramas to get a Spanish dub, I found out other Taiwanese dramas has also gotten Spanish dub and shown in Latin/South America, take Office Girls (or “Chicas de Oficina” in Spanish) for example:   Office Girls became one of the few Taiwanese dramas that became so popular with Spanish-speaking fans that are also fans of Korean dramas: Interesting Ratings The telenovela “Chicas de Oficina” was one of the most requested telenovela by Latin Media Corp’s clients at Natpe. “Chicas de Oficina” already has been broadcast by US Hispanic & Latin American cable. All of social media exploded with the excellent feedback from the viewers and even when the telenovela was not yet finished, they were already asking for it to be rebroadcast again. The success has had an impact that it has already been sold to countries like Chile and Ecuador, and as the press rolls, deals are being signed in other countries. So yes, Spanish-speaking K-drama fans branch out to Taiwanese dramas with no problem. I read report that there’ll be probably be more Taiwanese dramas getting Spanish dub and shown in Mexico, and Latin/South America like for example, Love me or Leave me is also reportedly getting a Spanish dub under the title, YO, TE AMO:  So all of you are asking this: Has any J-dramas ever gotten dub in Spanish and been shown in Latin/South America? The sad true answer to this is no and I can’t find any record of Japan taking advantage of K-drama popularity by having their J-dramas dub in Spanish and show it in Latin/South America. I mean I never seen the J-drama, 1 litre of Tears getting a Spanish dub despite it’s popularity in Asia 10 years ago. I mean that J-drama could’ve appeal to fans of Korean and Taiwanese dramas in Latin/South America if they had allow that drama to license and dub for Spanish-speaking audiences today. But no, Japanese production company miss that chance to cash in on the K-drama popularity. So Japan had a miss opportunity to expand their pop culture beyond anime and manga. So how could J-dramas gain the same type of international popularity like Korean and Taiwanese dramas are getting? Well, that’s the million dollar question. I could list some ideas that might help: Make the popular J-dramas more accessible to international audiences. Give the streaming right to Dramafever, and Viki. The J-dramas that are based on anime/manga should be given priority.Japanese companies should take the Latin/South American market seriously given that Taiwanese dramas are catching up to their Korean counterpart in term of popularity. Also Japan should take the Middle Eastern market since Korean dramas are popular in that region.Make more romance drama that can resonate to fans of K-drama and Taiwanese dramas.Japanese companies should remake well-known K-dramas and market that Japanese remake of that well-known K-drama to the international audiences. In other word, if you want to pander to K-drama fans, they have to remake/adapt that well-known K-drama to that same audiences if you want K-drama fans to branch out to J-dramas. That’s what Taiwan did and it worked, and now many K-drama fans branch out to Taiwanese dramas because Taiwan know how to pander to that international audiences. I expect if Japan did the same, it might get a lot of K-drama fans to branch out to J-dramas. I mean Japan remake You’re beautiful, and they recently remake Misaeng. The Japanese remake of a famous K-drama could get international fans of K-drama to branch out to J-dramas. I look at other K-dramas and see some that could be remade into Japanese setting:Kill me, Heal me:  That one was so popular with international fanbases, and the plot is very unique, I don’t know which J-drama had something like this. Maybe Japan could do a remake of this. Just for added measure to ensure K-drama fans do watch the remake, I want Hwang Jung-Em, and Ji Sung from the original drama to make a cameo or guest star in the Japanese remake. Think of it like how Park Shin-Hye cameo in the Taiwanese remake of You’re Beautiful got many K-drama fans to watch the Taiwanese remake. Healer:  The drama’s plot is so unique, I heard report about countries outside of Asia wanting to remake this drama because of the uniqueness of the drama’s plot. Maybe a Japanese remake could work well. Just make sure Ji Chang Wook from the original drama is given a cameo in the Japanese remake as a way to make sure it pander to K-drama fans outside of Asia. Legend of the Blue Sea:   This drama is not only getting popular in South Korea, but it’s getting a lot of positive reception amongst international fanbases of K-dramas. I find the plot to be interesting and also unique, the drama’s plot is hard to find in J-dramas. So maybe a Japanese remake could be possible. Again, have Lee-Min Ho and Jun Ji-hun make a cameo in the Japanese remake as eye-grabber for K-drama fans outside of Asia. Orange Marmalade:  A lot of time we’ve seen well-known manga becoming K-dramas like for example, Boys over Flowers, and Itazura Na Kiss. But I never seen Korean webtoon/webcomic getting a J-drama adaptation, doesn’t mean it could happen in the future. Orange Marmalade from KBS was based on the webcomic of the same name. This drama like most K-dramas became very popular with international K-drama fandom outside of Asia. So maybe a Japanese remake/adaptation could be perfect for this webtoon. I mean the plot can work in a Japanese setting and even the original webtoon feel like a manga when you read it. So a Japanese remake is possible. Just for added measure and fanservice purpose, I want Seolhyun (who played the main character in the original drama) to guest star (and reprise her role from her Korean role) as Baek Ma-ri for 1 episode who goes to Japan as a foreign exchange student in the Japanese remake befriending her Japanese counterpart in the Japanese remake. That would be the best fanservice to get K-drama fans outside of Asia a reason to watch the Japanese remake. If Japan was to remake these well-known K-dramas I listed above and market it to international audiences outside of Asia and toward K-drama fans, then these same fans of K-drama and Taiwanese dramas will branch out to J-dramas. That can help J-dramas get international audiences of K-drama to watch J-dramas. I hope my long post is worth reading. ",
            "date": "Updated March 11, 2017",
            "views": "192",
            "upvotes": " View 53 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Real Gammer",
                    "user_href": "/profile/Real-Gammer-2"
                },
                {
                    "user_id": "Eunmi Park",
                    "user_href": "/profile/Eunmi-Park-8"
                },
                {
                    "user_id": "Juan Reynoso",
                    "user_href": "/profile/Juan-Reynoso-1"
                },
                {
                    "user_id": "Jennifer Wallace",
                    "user_href": "/profile/Jennifer-Wallace-286"
                },
                {
                    "user_id": "Aranov B",
                    "user_href": "/profile/Aranov-B"
                },
                {
                    "user_id": "Jessica Igarashi",
                    "user_href": "/profile/Jessica-Igarashi-2"
                },
                {
                    "user_id": "Latanya Joseph",
                    "user_href": "/profile/Latanya-Joseph"
                },
                {
                    "user_id": "Dango Onigiri",
                    "user_href": "/profile/Dango-Onigiri"
                },
                {
                    "user_id": "Fildzah Hazimi Nauli",
                    "user_href": "/profile/Fildzah-Hazimi-Nauli-1"
                },
                {
                    "user_id": "M. Reiza Syafiqri",
                    "user_href": "/profile/M-Reiza-Syafiqri"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alisa Wong",
                "href": "/profile/Alisa-Wong-3"
            },
            "answer_text": "My two cents on what I've experienced, is that Japan has the mindset of keeping certain things to themselves in order to keep it under their control. Their dramas and movies have taken longer to license and many of us overseas fans rely on fansub forums to watch them. It doesn't help that dramacrazy and many other popular sites from the late 2000’s and early 2010’s have shut down. Japan likes avoiding unlicensed things going on with their film/music industry. You can hardly find a full length, HD, official music video by a japanese artist on YouTube. They're all cut off after a minute, and the qualities are low. Whereas, you can see how much the K-Pop entertainment companies want to get their exposure out there, especially on the west’s most popular platform, YouTube, and are capitalizing on the Hallyu wave. Their artists and company make more money from overseas sales too. You can also watch K-dramas licenced on overseas platforms like Netflix now. However, Japan’s main reluctance to branch out could possibly be tied to the political party in power in recent years, which is a whole other story.. There’s a formula that Kdramas follow, and it’s usually eye candy. Japanese chars tend to look more humble and down to earth, but the eye candy is what attracts many people. The eye candy is a whole package including glamorous sets, clothes, pretty boys, pretty girls, fancy food, and heartwrenching or catchy music. Another thing to note is that the dynamic of Japanese storytelling is a bit different from Korean storytelling, though, it may be starting to change in recent years. Japanese stories have traditionally followed a protagonist that is placed into a situation. Korean stories would follow the situation that surrounds leads and side characters. It's a little hard to explain, but if anybody else can follow up on this idea, or correct me if I'm saying it wrong, that would be much appreciated, as I read something about this years ago and don't remember how to phrase it. I believe because there really is a difference in the way dramas are setup, though, there is definitely a preference of one over or more than the other. ",
            "date": "Updated December 5, 2016",
            "views": "75",
            "upvotes": " View 27 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mapalo Thomas",
                    "user_href": "/profile/Mapalo-Thomas"
                },
                {
                    "user_id": "Azalea Juliane",
                    "user_href": "/profile/Azalea-Juliane"
                },
                {
                    "user_id": "Victoria Persinger",
                    "user_href": "/profile/Victoria-Persinger"
                },
                {
                    "user_id": "Lani Cook",
                    "user_href": "/profile/Lani-Cook-1"
                },
                {
                    "user_id": "MeMe BSB",
                    "user_href": "/profile/MeMe-BSB"
                },
                {
                    "user_id": "Ken Fehling",
                    "user_href": "/profile/Ken-Fehling"
                },
                {
                    "user_id": "Naureen Khan",
                    "user_href": "/profile/Naureen-Khan-41"
                },
                {
                    "user_id": "Hanin Abdu",
                    "user_href": "/profile/Hanin-Abdu"
                },
                {
                    "user_id": "Vijaya Yadav",
                    "user_href": "/profile/Vijaya-Yadav-30"
                },
                {
                    "user_id": "Evelyn Medrano (에벨 린 메드 라노)",
                    "user_href": "/profile/Evelyn-Medrano-에벨-린-메드-라노-イヴリンメドラーノ"
                }
            ]
        }
    ]
}