{
    "title": "Why didn't Ian Gillan record more albums with Black Sabbath? - Quora",
    "tags": [
        "Ian Gillan (singer-songwriter)",
        "Black Sabbath (band)",
        "Heavy Metal (music)",
        "Rock Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Rimer",
                "href": "/profile/Michael-Rimer-2"
            },
            "answer_text": "Gillan sang on Born Again, Black Sabbath's 11th album (August 1983). Famous for having an even worse album cover than the Sabotage cover.  Gillan left Deep Purple in 1973, but in 1983 there was a strong vibe that the Deep Purple line-up from 1969–1973 featuring Gillan (and commonly known as the Mark II line up) would reform. This happened in 1984 with the Perfect Strangers album. He couldn't be in Sabbath and Purple at the same time and so that's why he left and didn't do more albums with Sabbath.  Tony Iommi knew it was going to be a shot stint with Gillan at the time and it was just luck that he was free in 1983. Sabbath got a rated singer, Gillan got work. Gillan also hated having to sing Iron Man (as did Dio). He refused to learn the words and instead had them on paper that was taped to the stage. Legend has it that sometimes the dry-ice machine would come on during Iron Man. This would make Gillan have to swoosh the smoke away frantically so he could see the words and sing them.  As an aside, what the world got from the Gillan era was Spinal Tap's inspiration for the small Stonehenge joke. On Sabbath's Born Again tour their henge props was so big they didn't fit into many of the venues they played. A mix up with the measurements on the napkin so they were bigger than intended. Look at the picture below- they're about twice the height of the real monuments!  Fun fact. Sabbath's next album was Seventh Star (1986) with Glen Hughes singing. He got punched in the throat a few shows into the tour for Seventh Star and was replaced by an American singer called Ray Gillen. Here is a picture of Glen Hughes and Ray Gillen taking a selfie with an 80s mic:  Gillen left Sabbath before their next album, Eternal Idol, was released and his vocals were redone by the next singer, Tony Martin. In the space of three or so years, Sabbath had two singers called Gillan (albeit with slightly different spellings).  ",
            "date": "Updated June 6, 2019",
            "views": "993",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tim Larsen",
                    "user_href": "/profile/Tim-Larsen-29"
                },
                {
                    "user_id": "Patrick Stott",
                    "user_href": "/profile/Patrick-Stott-4"
                },
                {
                    "user_id": "Rich Finley",
                    "user_href": "/profile/Rich-Finley-3"
                },
                {
                    "user_id": "Cieran Loughran",
                    "user_href": "/profile/Cieran-Loughran"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marcelo Soares",
                "href": "/profile/Marcelo-Soares-1"
            },
            "answer_text": "As Ian tells it, he signed the contract after a booze night with Tony Iommi.  He was on leave, having disbanded his own band, Gillan, to have throat surgery. His former band mates at Gillan never seemed to forgive him for joining Sabbath not long after that. What no one tells for sure is how much this was intended to fill Ian's calendar. This is how he tells it in interviews: \"I was at a kind of loose end anyway, having just finished with my own band and Purple not really being anything viable at the time. So we set a one-year plan, and it was to do an album and a tour. Nobody knew what was gonna happen, so we pitched up and I pitched my tent, literally, at the old manor in Oxfordshire. And we made an album. The backdrop to this were the talks to re-form Deep Purple in 1984. Reunions to discuss that are mentioned since the late 70s, but everyone was busy doing something else. In 1983 and 1984, the other Deep Purple members finished their commitments (Lord with Whitesnake, Blackmore and Glover with Rainbow, Paice with Gary Moore). Gillan's last gig with Black Sabbath happened on March 4, 1984.  Ritchie Blackmore and Roger Glover did their last Rainbow gig in March 13, 1984.  Jon Lord's last gig with Whitesnake was on April 16, 1984.  Ian Paice left Gary Moore also in April of 1984, but I don't have the date of his last gig.  In April of 1984, they all met for talks in Kentucky. In May they were rehearsing in Vermont, and so Deep Purple had a reunion. The Deep Purple reunion, 1984  ",
            "date": "Answered March 5, 2019",
            "views": "19",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Patrick Stott",
                    "user_href": "/profile/Patrick-Stott-4"
                },
                {
                    "user_id": "Tony Baron",
                    "user_href": "/profile/Tony-Baron-2"
                },
                {
                    "user_id": "Andy Kincaid",
                    "user_href": "/profile/Andy-Kincaid-4"
                },
                {
                    "user_id": "Chester Blount",
                    "user_href": "/profile/Chester-Blount"
                },
                {
                    "user_id": "Rich Finley",
                    "user_href": "/profile/Rich-Finley-3"
                },
                {
                    "user_id": "Michael Rimer",
                    "user_href": "/profile/Michael-Rimer-2"
                },
                {
                    "user_id": "Dave Hodgkinson",
                    "user_href": "/profile/Dave-Hodgkinson-1"
                },
                {
                    "user_id": "Neil Sarver",
                    "user_href": "/profile/Neil-Sarver"
                }
            ]
        }
    ]
}