{
    "title": "Why does more and more new music sound soulless, like a perfected machine that sounds good but has no personality (I know there are exceptions)? - Quora",
    "tags": [
        "New Music",
        "Sound",
        "Music Recommendations",
        "Music Industry",
        "Character and Personality",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tyler Rutland",
                "href": "/profile/Tyler-Rutland-4"
            },
            "answer_text": "Well, one reason why is because the music industry is being driven by greed, instead of something more virtuous. When humans are driven by greed or any kind of lower power, then there will be a certain reduction in the life of their psyche/feelings, and as a result, they will lack the ability to tell when their own music productions sound “too good” or too perfect. This is because a driving force of greed or desire to become famous seals humans off from aspects of their own psyche, and these parts of the psyche have to do with human warmth and so on. Modern technology can, nevertheless, be used to make music which sounds lively and warm. It’s just that the person creating it has to care about using it for that, and they generally speaking have to love the act of creating something great and worthy in the first place. In simpler words, when someone is just being driven by greed or desire to become famous, then the question they may ask themselves as they create music is, “Does this sound polished enough to sell?” and so they can easily over-polish it and buff out all the warm imperfection. But someone who is mostly concerned to create music that is worthy in itself, will tend to be more concerned about it sounding warming and alive, and so they’ll work harder to polish it not too much and not too little, but rather just the right amount so that it sounds professional and good but not overly processed and cold. And of course, to polish a song correctly so as to bring out its life and warmth can add many, many hours to the production, and when we’re talking about the modern music industry, it just wants to bang out hit after hit and it doesn’t really want to spend all that extra time making the modern music sound really alive and warming, when a “just fine” production will sell just fine and earn billions of dollars of revenue. ",
            "date": "Answered April 10, 2020",
            "views": "87",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Carter Hughes",
                    "user_href": "/profile/Carter-Hughes-8"
                },
                {
                    "user_id": "Maya Tsou",
                    "user_href": "/profile/Maya-Tsou-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emanuel Schmidt",
                "href": "/profile/Emanuel-Schmidt-3"
            },
            "answer_text": "That depends what you mean by new music. I am going to answer your question as if you mean popular music. Pop music is produced according to a formula for success and popularity. It must include a familiarity component. This includes a chord progression that is almost exclusively based on a variant of vi-IV-I-V. Melodies must be quickly learnable and singable, so they are super simplistic, often including no more than 3 notes. Text written by Max Martin, the producer / songwriter guru of the pop stars, has been shown to be at a language level of around 4th to 6th grade, often even around first grade. Since pop music is digitally produced and listened to on digital devices, it is compressed and loses both color and dynamics. Pop music is increasingly made using only digital sounds and no longer employs the use of instruments played by musicians. That means you lose expressiveness and emotion, and the fact that sounds are often used by several different musicians makes it sound samish (for example, the electronic marimba sound or the sounds used by Alan Walker and Avicii) Singers almost exclusively use autotune / melodyne, which removes character and expression along with the wrong notes they sing. Rhythms are used repetitively across songs. The clave (or rather the front part of it), is use din practically every pop song from Shawn Mendes to Ed Sheeran. The form (structure) of pop songs follows a formula, again to make it instantly accessible. Lastly, the digitization and digital sales of music on demand as well as streaming (Spotify) have rendered income from recordings for musicians virtually meaningless. This means that creating new music becomes a cost-cutting exercise and songs are released one by one on Youtube or Spotify merely as teasers for people to go see the act live. That’s where much of the money is. Unfortunately, when you go see them live, they are still using autotune or even lip syncing. ",
            "date": "Answered April 10, 2020",
            "views": "46",
            "upvotes": "0"
        }
    ]
}