{
    "title": "Why is the D string on a guitar the most likely to break? - Quora",
    "tags": [
        "Guitar Strings",
        "Acoustic Guitars",
        "Guitarists",
        "Playing Guitar",
        "Learning to Play Musical Instruments",
        "Guitars",
        "Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Geoff Arnold",
                "href": "/profile/Geoff-Arnold-2"
            },
            "answer_text": "Having played guitar for over 53 years now… the D string has been one of the LEAST likely to break. Hi E, yep. Being the thinnest, it would be expected to break most frequently. But that’s interestingly not the case. B string, yep. I used to break this one on my electric rather frequently. But I found it was the bridge saddle that was the culprit. A little attention every month and that problem went away. G string, yep. This string gets the most abuse on electric, bending a lot, so you expect it to break. It does. A string, yep. Pounding out rhythms puts a lot of stress on this poor child. So it will break. Lo E, yep. Pounding out rhythms here, too, it’s going to happen. But the D string… it just does it’s job without complaining and breaks quite infrequently. Way back in the 1980s, I used one brand of strings exclusively. But there was a time, in around 1985, they had a problem with their smaller string production, the .011 string in particular, which I used. It broke so regularly that I got fed up and changed brands. I never went back. I changed to another brand that has been proved by over 25 years’ use to be so consistent that I see no reason to change. Same for my acoustic, which I’ve been using the same brand since 1995. They are so consistently good, I have no reason to change anything here either. On both acoustic and electric, for me, I rarely break strings anymore, and haven’t for the past 20 years or so. Part of the reason is the quality of the strings I use. But, too, my touch and approach are less brutal than in years past, so I put less stress on the strings. That and, when performing regularly, I change strings frequently, and do bridge maintenance as frequently, to be sure burrs and other little things that will help strings snap are not present. If your D string is breaking a lot, you need to look at your nut and your bridge, even your tuning peg - depending upon WHERE the break is occurring. Something is wrong and needs to be addressed. The way you string a guitar, at the peghead, can be a big factor. Your bridge can be a big factor (burrs and other junk), and the nut can also contribute. Regular maintenance by your guitar tech will help cut down on this problem - especially if you bring it to his attention, then he’ll focus on fixing that issue. So maybe you have a very heavy strum, like a friend of mine, who breaks acoustic strings regularly, like every single week - I’m not kidding. I spoke to him about his strum, that he can lighten up and let the PA do the work for him. But he just doesn’t want to deal with it. So he gets mad every single time - refusing to fix the problem, which is his strumming habits. And I just shake my head. A simple fix and he is just not ever going to change it. So he’ll break strings in rehearsal, and then 20 minutes later during performance (it happens frequently). He goes to his backup… and may break a string there, too. Look at your technique. Look at the maintenance aspect. Look at the physical parts (tuning peg, nut and bridge saddle). It is one of these. ",
            "date": "Answered March 24, 2019",
            "views": "49",
            "upvotes": " View 21 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Keilhofer",
                    "user_href": "/profile/Michael-Keilhofer-1"
                },
                {
                    "user_id": "David Whitmore",
                    "user_href": "/profile/David-Whitmore-43"
                },
                {
                    "user_id": "Franklin Bryant",
                    "user_href": "/profile/Franklin-Bryant-1"
                },
                {
                    "user_id": "Tom Wipf",
                    "user_href": "/profile/Tom-Wipf-1"
                },
                {
                    "user_id": "Gary Ciminelli",
                    "user_href": "/profile/Gary-Ciminelli"
                },
                {
                    "user_id": "Nevi Løvfelt",
                    "user_href": "/profile/Nevi-Løvfelt"
                },
                {
                    "user_id": "Floyd Freud",
                    "user_href": "/profile/Floyd-Freud"
                },
                {
                    "user_id": "Simon Lee",
                    "user_href": "/profile/Simon-Lee-259"
                },
                {
                    "user_id": "Uğur Haspolat",
                    "user_href": "/profile/Uğur-Haspolat"
                },
                {
                    "user_id": "David Rak",
                    "user_href": "/profile/David-Rak-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Colin Yates",
                "href": "/profile/Colin-Yates-3"
            },
            "answer_text": "It looks from the various answers that this varies on a guitar to guitar basis. I do in fact have my D string break much more often than the other strings - and I know why… I play classical guitar. EBG are single nylon monofilament like fishing line. I have no recollection of one of these breaking in decades of playing. I'm sure its happened, but I don't remember an occasion. I replace these strings when I think they are sounding dull or if I want to try some fancy “carbon” strings or something. DAE strings are nylon core wound with metal wire. The core is not a single monofilament - it is many narrow strands of nylon monofilament packed together. The D string is of course the thinnest core wound with the thinnest wire. Now most people seem to prefer the sound of new bass strings, but I find them too twangy. I prefer the more mellow sound of older bass strings - so I keep them on for a long time. After a while I can see the winding on the D string wearing away over the most commonly used frets. At a certain point I can see the nylon strands where the winding has gone. At this point the individual nylon strands are going to give up quickly, and it is time to change the D before it breaks. If I am diligent I will change all six strings - but usually I find myself hunting through bag after bag with just five strings in them. Guess which is the missing string… ",
            "date": "Answered April 3, 2019",
            "views": "234",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tjaart Lemmer",
                    "user_href": "/profile/Tjaart-Lemmer"
                },
                {
                    "user_id": "Jason Gassman",
                    "user_href": "/profile/Jason-Gassman-1"
                }
            ]
        }
    ]
}