{
    "title": "Why do people see creepy things in video games at 3 A.M.? - Quora",
    "tags": [
        "Video Games"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sasha Shurkin",
                "href": "/profile/Sasha-Shurkin"
            },
            "answer_text": "Ok, this kind of thing only happens for one reason: YouTube clickbait. This 3am trend has been on YouTube for a while and has started dying off (thankfully). I highly doubt anything happens at 3am in any game unless if its programmed to. There is a secret in one of the Animal Crossing games that if you have the TV on at a specific time, images of aliens show upon the TV screen:  That can be classified as something spooky at 3am but this was a secret and it was programmed. Again, the 3am trend started on YouTube to get clicks and lure young impressionable kids to get views and ad revenue. Rumors about weird shit happening in a game can be easily searched up and either be confirmed or only speculation. ",
            "date": "Answered March 31, 2018",
            "views": "833",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mike Shurkin",
                    "user_href": "/profile/Mike-Shurkin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Oosthuizen",
                "href": "/profile/Matthew-Oosthuizen-1"
            },
            "answer_text": "There is nothing magical or supernatural about playing games at 3 in the morning regardless of any superstitions all have been proven false, hoaxes or have no proof what so ever. Some games do program in specific events to happen at a specific time or date but that’s the same as google changing its picture on its homepage on Christmas for effect. The only other reason is if someone is very sleep deprived and is very gullible, superstitious(same thing) and is vulnerable to their mind playing tricks on them in which case they make their own stories and images up from imagination. If you are talking about any streaming sites or videos that’s easily explained as a way to attract more viewers for more income due to the fact people are curious about the unknown but a quick study will prove its false most people will try to prove it’s real and just do the same game again tomorrow without any traumatic experiences affecting them. ",
            "date": "Answered April 4, 2018",
            "views": "677",
            "upvotes": "0"
        }
    ]
}