{
    "title": "Why didn’t Eminem release the King Mathers album? - Quora",
    "tags": [
        "Eminem (musician)",
        "Music Albums",
        "Rap Music",
        "Hip Hop and Rap Artists",
        "Hip Hop Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Banana",
                "href": "/profile/John-Banana-3"
            },
            "answer_text": "The album was a real thing but the title was rumored to be called King Mathers started by fellow Shady artist Cashis and many people online. In between 2005–2007 he was recording material. The only confirmed/EXTREMELY likely songs to be on the album are: Careful What You Wish For The Apple 50 Ways Syllables GOAT It’s Been Real The album was never released because in December 2007 he overdosed on pills after becoming depressed from losing his best friend Proof (There were more reasons but that’s the main one) so he was sent to the hospital where he nearly died. When he came back he still struggled with drugs but finally in 2008 decided to go to rehab and get clean. Ever since April 20th, 2008, Eminem has been clean and he basically had to restart his career. Also, he had to re-learn how to rap after he was in the hospital and his body started shutting down. When you are that close to dying you can’t talk, can’t move, etc. This is partly why his voice is different combined with age after his overdose. Moving into 2009 he was clean and had a clear head with new ideas and style musically. He avoided using material from his ‘dark days’ during his addiction. He completely made new material for his album Relapse. He wanted to make music in his new head space so he scrapped a lot of what he was working on because it didn’t fit his new style, it was low quality, it was made while he was very drugged up, and the music reminded him of his depressing addiction era. For the most realistic recreation of this album (With songs from 2005–2007 combined with the leaked songs of King Mathers) check out this! :  ",
            "date": "Answered January 9, 2019",
            "views": "33",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sergeant Argubright",
                    "user_href": "/profile/Sergeant-Argubright"
                },
                {
                    "user_id": "Adharsh Sharma",
                    "user_href": "/profile/Adharsh-Sharma-2"
                },
                {
                    "user_id": "Ryan Sheppard",
                    "user_href": "/profile/Ryan-Sheppard-22"
                },
                {
                    "user_id": "Carlo Stan",
                    "user_href": "/profile/Carlo-Stan"
                },
                {
                    "user_id": "Kisan Lal",
                    "user_href": "/profile/Kisan-Lal-8"
                },
                {
                    "user_id": "Chris Cartell",
                    "user_href": "/profile/Chris-Cartell"
                },
                {
                    "user_id": "Sailaja Kl",
                    "user_href": "/profile/Sailaja-Kl"
                },
                {
                    "user_id": "Alicia Cusumano",
                    "user_href": "/profile/Alicia-Cusumano-2"
                },
                {
                    "user_id": "Pavlo Cjura",
                    "user_href": "/profile/Pavlo-Cjura"
                },
                {
                    "user_id": "Matt Dowling",
                    "user_href": "/profile/Matt-Dowling-30"
                }
            ]
        }
    ]
}