{
    "title": "Why did Steve Jobs name the brand 'Apple' and why is the logo an apple with a bite taken out of it? - Quora",
    "tags": [
        "Steve Jobs",
        "Logos",
        "Brands and Branding",
        "Startup Founders and Entrepreneurs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alicia Brown",
                "href": "/profile/Alicia-Brown-41"
            },
            "answer_text": "One of the many sidebars to media coverage of the death of Steve Jobs in October 2011 was an old question: Where did the name Apple Computer come from? Lots of speculation has floated by: Jobs & Wozniak wanted their startup to be in front of Atari in the phone book.They wanted distance from the cold, complicated imagery created by other computer companies at the time – with names such as IBM, Digital Equipment and Cincom.It was a tribute to Apple Records, the music label of the Beatles.For solid answers, it’s always a good idea to go to the founders. In the just-published Steve Jobs biography, Jobs told Walter Isaacson he was “on one of my fruitarian diets” and had just come back from an apple farm, and thought the name sounded “fun, spirited and not intimidating.” Writing in his 2006 book iWoz: Computer Geek to Cult Icon, Apple’s co-founder Steve Wozniak explains it this way: “It was a couple of weeks later when we came up with a name for the partnership. I remember I was driving Steve Jobs back from the airport along Highway 85. Steve was coming back from a visit to Oregon to a place he called an “apple orchard.” It was actually some kind of commune. Steve suggested a name – Apple Computer. The first comment out of my mouth was, “What about Apple Records?” This was (and still is) the Beatles-owned record label. We both tried to come up with technical-sounding names that were better, but we couldn’t think of any good ones. Apple was so much better, better than any other name we could think of.” His concerns turned out to be justified. Apple Computer, Inc. was sued by Apple Records over trademark violations in 1989. In a 2006 interview with an MIT newspaper, Wozniak was asked again about the rationale behind the Apple name. Wozniak confirmed that it was Job’s creation, and that he came up with the name after spending a few months working on an apple orchard. “After trying to think of better and more technical names, both Jobs and I realized that Apple was a good fit,” he told the newspaper. A book titled Apple Confidential 2.0: The Definitive History of the World’s Most Colorful Company says that both Wozniak and Jobs tried out alternate brand names such as Executex and Matrix Electronics, but they didn’t like anything as much as Apple Computer. Order Your Copy Of: Brand Aid, second edition, A Quick Reference Guide to Solving Your Branding Problems and Strengthening Your Market Position  Branding Strategy Insider is a service of The Blake Project: A strategic brand consultancy specializing in Brand Research, Brand Strategy, Brand Licensing and Brand Education ",
            "date": "Answered March 2, 2016",
            "views": "151",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lars Poulsen",
                    "user_href": "/profile/Lars-Poulsen-2"
                },
                {
                    "user_id": "Juliana Sepulveda",
                    "user_href": "/profile/Juliana-Sepulveda"
                },
                {
                    "user_id": "Geetanjali Verma",
                    "user_href": "/profile/Geetanjali-Verma"
                },
                {
                    "user_id": "Peter Villevoye",
                    "user_href": "/profile/Peter-Villevoye"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raj Kosaraju",
                "href": "/profile/Raj-Kosaraju-1"
            },
            "answer_text": "Steve Jobs vision for the next generation computer was so far ahead that it was mind boggling for everyone. No one could think that far into the future, but he did, and hence his most quoted saying is also the most fitting one for his own life.   Steve Jobs (1955-2011). Photo: Publicity So, while we worship some of the technological advances gifted to us by He could have dismissed the creation myths inspired by his company, but he chose not to. More than most, he appreciated the value of a beautiful story. According to Steve Jobs, the company's name was inspired by his visit to an apple farm while on a fruitarian diet. Jobs thought the name \"Apple\" was \"fun, spirited and not intimidating\" Apple's first logo, designed by Ron Wayne, depicts Sir Isaac Newton sitting under an apple tree. It was almost immediately replaced by Rob Janoff's \"rainbow Apple\", the now-familiar rainbow-colored silhouette of an apple with a bite taken out of it. Janoff presented Jobs with several different monochromatic themes for the \"bitten\" logo, and Jobs immediately took a liking to it. However, Jobs insisted that the logo be colorized to humanize the company. The logo was designed with a bite so that it would not be confused with a cherry. The colored stripes were conceived to make the logo more accessible, and to represent the fact the Apple II could generate graphics in color. This logo is often erroneously referred to as a tribute to Alan Turing, with the bite mark a reference to his method of suicide. Both Janoff and Apple deny any homage to Turing in the design of the logo.Apple, we never really knew how it came to be what it is today. Just the transitional journey of the logo shows how Apple has kept evolving- to date. ",
            "date": "Answered April 14, 2015",
            "views": "609",
            "upvotes": " View 24 Upvoters",
            "upvoters": [
                {
                    "user_id": "Juan Manuel Oropeza",
                    "user_href": "/profile/Juan-Manuel-Oropeza"
                },
                {
                    "user_id": "Brandon Washington",
                    "user_href": "/profile/Brandon-Washington-85"
                },
                {
                    "user_id": "Khaked Jamal",
                    "user_href": "/profile/Khaked-Jamal"
                },
                {
                    "user_id": "Donna Valerius",
                    "user_href": "/profile/Donna-Valerius"
                },
                {
                    "user_id": "Dave Baldwin",
                    "user_href": "/profile/Dave-Baldwin-35"
                },
                {
                    "user_id": "Eyram Awuyah",
                    "user_href": "/profile/Eyram-Awuyah"
                },
                {
                    "user_id": "David Waring",
                    "user_href": "/profile/David-Waring-3"
                },
                {
                    "user_id": "Sreekar Sai",
                    "user_href": "/profile/Sreekar-Sai-9"
                },
                {
                    "user_id": "Danny Panettieri",
                    "user_href": "/profile/Danny-Panettieri"
                },
                {
                    "user_id": "Roger Whitcomb",
                    "user_href": "/profile/Roger-Whitcomb"
                }
            ]
        }
    ]
}