{
    "title": "Why did the band “Breaking Benjamin” choose that name? - Quora",
    "tags": [
        "Breaking Benjamin",
        "Band Names",
        "Bands (music)",
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aja Steidl",
                "href": "/profile/Aja-Steidl"
            },
            "answer_text": "Back in the days before their fame, Breaking Benjamin was a band playing in bars at open mic nights. One fateful event, the leader, Benjamin Burnley, asked someone at the bar to borrow their mic, as he hadn’t brought one himself. The man obliged and the gig ensued. During the performance, sir Ben Burnley got so into the spectacle that he threw the mic stand down and the mic broke. The man who lent him the mic berated him: “Don’t go breaking other people’s things!” Sir Ben found that statement to be an intriguing one. He played around with it for a moment, before deciding on adding “breaking” before his name. Thus was born the name of the band, Breaking Benjamin. (I read this story about 3 years ago, so details are a bit fuzzy in places, but the message remains the same.) TL;DR: Breaking Benjamin came from Ben breaking a borrowed mic. ",
            "date": "Answered April 8, 2019",
            "views": "315",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lydia Kina",
                    "user_href": "/profile/Lydia-Kina"
                },
                {
                    "user_id": "Vivek Wagaj",
                    "user_href": "/profile/Vivek-Wagaj-1"
                },
                {
                    "user_id": "Damian Aguilera",
                    "user_href": "/profile/Damian-Aguilera"
                },
                {
                    "user_id": "Maddie Kaylor",
                    "user_href": "/profile/Maddie-Kaylor"
                }
            ]
        },
        {
            "author_info": {
                "name": "Conrad Pat",
                "href": "/profile/Conrad-Pat"
            },
            "answer_text": "The name was chosen due to the fact that the lead singer, Benjamin Burnley was playing somewhere one night, and Benjamin broke the mic, to which the owner of the venue went out on stage and said the following “Thanks to Benjamin for Breaking my fucking mic!” And so the name Breaking Benjamin was born from that sentence, somehow. ",
            "date": "Answered April 7, 2019",
            "views": "37",
            "upvotes": " Answer requested by Mirza Ibn-e-Dara"
        }
    ]
}