{
    "title": "Why do folk songs not change the key signature? - Quora",
    "tags": [
        "Traditional Music",
        "Folk Music",
        "Signatures",
        "Music Recommendations",
        "Musical Instruments",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Laurence Payne",
                "href": "/profile/Laurence-Payne"
            },
            "answer_text": "Because the definition of a folk song is a simple, short melody improvised by someone with no musical training and no desire to extend it into a longer, more structured piece. Perhaps someone will come up with an example of folk music that DOES have a key change. I’ve heard some Russian stuff that is intriguingly fluid between minor and major modes (though that wouldn’t be written with ever-changing key signatures). And once folk music gets ‘collected’ and written down, the line between ‘folk’ and ‘composed’ can get blurred. But, generally, folk music keeps it simple. ",
            "date": "Answered October 7, 2020",
            "views": "47",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dennis Bruns",
                    "user_href": "/profile/Dennis-Bruns-5"
                },
                {
                    "user_id": "Nolly Prado",
                    "user_href": "/profile/Nolly-Prado"
                },
                {
                    "user_id": "Kurt Jevin Castromayor",
                    "user_href": "/profile/Kurt-Jevin-Castromayor"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Elwood",
                "href": "/profile/Paul-Elwood-3"
            },
            "answer_text": "Well I dunno for sure, but my guess is, to keep them fairly simple. A musically simple song, more people can enjoy enjoy it. They can sing them or hear the song’s story without being distracted by unnecessary musical ornamentation (like a key change). Think about holiday songs like “joy to the world”: that goes “do te la so fa me re do” which is just “do re me” backward. It’s a generality but I’d say folk songs are not musically nuanced on purpose so more folks can enjoy them. Just my opinion, I’d be interested to hear somebody else’s. ",
            "date": "Answered October 6, 2020",
            "views": "14",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dennis Bruns",
                    "user_href": "/profile/Dennis-Bruns-5"
                },
                {
                    "user_id": "Hanny Malaga",
                    "user_href": "/profile/Hanny-Malaga"
                }
            ]
        }
    ]
}