{
    "title": "Why do people hate Justin Bieber? - Quora",
    "tags": [
        "Justin Bieber (musician)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lars Grem",
                "href": "/profile/Lars-Grem"
            },
            "answer_text": "Unfortunately, he himself worked to achieve this. Maybe he became famous too early. Let's remember his actions : Racist jokes Bieber often makes racist statements and very nasty jokes. By the way, including because of this, the American authorities refused to extend the visa. Bad attitude to fans It is enough to remember this photo :  Relationship to your favorite animals. Bieber had a monkey (from the family of Capuchin), said that he was very attached to it, but as it turned out, the young man easily refused it: when in Germany he was not allowed to Board the plane with the animal (the animal documents were not in order), he just left the monkey at the local zoo. And in all that time, I've never tried to get her back.  Constant problems with the police Canadian singer is always in conflict with law enforcement: it violates the rules of the road, dangerously drifting by car, then drawn into a fight and beats a few people. He once beat up one of his German fans.  Attitude to the press This photo was taken after Bieber ran over the photographer. Few people believe that the hit-and-run was accidental…  Strange clothing style Perhaps this is the most harmless reason — the style of clothing. For celebrities, clothing is part of the image, so the costume for the red carpet is always chosen carefully.. Bieber doesn't seem to know (or ignore) about this .  Attitude to neighbors Justin decided to\" tell \" his neighbor about his feelings and threw 20 eggs at the door of his house. The police arrived in time, so the remaining Arsenal was not used. Bieber was obliged to pay a fine of 80 thousand dollars and spend a few hours of community service.  But I think that maybe this guy can change and become an example of a cultured and educated person. ",
            "date": "Answered November 28, 2018",
            "views": "158",
            "upvotes": " View 92 Upvoters",
            "upvoters": [
                {
                    "user_id": "Krithika V",
                    "user_href": "/profile/Krithika-V-36"
                },
                {
                    "user_id": "Alessa Star",
                    "user_href": "/profile/Alessa-Star"
                },
                {
                    "user_id": "Dave Barry",
                    "user_href": "/profile/Dave-Barry-59"
                },
                {
                    "user_id": "Ryan Chandler",
                    "user_href": "/profile/Ryan-Chandler-12"
                },
                {
                    "user_id": "Amulya A",
                    "user_href": "/profile/Amulya-A-14"
                },
                {
                    "user_id": "Riya Mishra",
                    "user_href": "/profile/Riya-Mishra-182"
                },
                {
                    "user_id": "Kev Abra",
                    "user_href": "/profile/Kev-Abra"
                },
                {
                    "user_id": "Alessia Bocc",
                    "user_href": "/profile/Alessia-Bocc"
                },
                {
                    "user_id": "Tahmida Isma",
                    "user_href": "/profile/Tahmida-Isma"
                },
                {
                    "user_id": "James William",
                    "user_href": "/profile/James-William-380"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abdullah Khan",
                "href": "/profile/Abdullah-Khan-504"
            },
            "answer_text": "I am another huge hater of Justin Bieber.Even I hate Miley Cyrus,his wanna be look alike.I like his song Baby which got 6 million dislikes of YouTube but still I hate this man because I am a fan of One Direction,Ariana Grande etc.The reasons why I hate him. 1:The Nude Controversy:Sorry guys.The nude controversy has been deleted from Instagram and it was very disgusting we all know that.The controversial made people really disgusted like he is doing it in the public.That buttock photo in which he was smoking,his ass was blurred thanks to the censors. 2:Talent:He has no talent in his voice.Nor a good actor or singer.His masterpiece films Never Say Never and Believe both have 1.6 star rating on ImDb.Both movies had played his masterpiece of crap acting.Another thing he is not even an actor. 3: Baby song:I like this song but it was better that is was not him who sung that song.His voice was just like a teenager girl was singing.What a disgusting voice.But still Sorry has been a Blockbuster. 4:As a role model:Guys control yourselves,this picture is absolutely horrible.He is just looking Miley Cyrus without makeup.His looks are so bad that nobody likes him.  5: The controversy with Anne Frank:When Justin Bieber had visited the Anne Frank House in Germany the victim of Holocaust,it became a controversial moment.He wrote: “Truly inspiring to be able to come here. Anne was a great girl. Hopefully she would have been a belieber”. He took a lot of criticism for this message; mostly the last sentence, “hopefully she would have been a belieber”. “I hope this historical figure would have approved of my life’s work”. Still, those who wanted to get angry found their ammunition. Don’t get me wrong, it was a stupid thing to write, but definitely not something that should have been this newsworthy. This was a senseless thing in the Museum Guest Book. 6:The controversial letter he wrote to Heavy Metal Fans:The letter he wrote to the Heavy Metal Band fans was making the Heavy Metal’s die hard fans die hard haters of JB because the letter was very bad.He wrote: The are one of the 4 bands who invented a whole new genre called Thrash Metal. These were the comments from Heavy Metal Fans to Justin Bieber: 1- He sounds like a girl, I don’t care.He sings only about girls, I don’t care.His music is crap, I don’t care.Stupid girls like him, I hardly give a damn.But wait! What! He’s criticizing metal listeners! That’s the most disgusting thing ever. Criticizing bands like Metallica and Megadeth! Dear Justina Beiber, what Metallica has achieved, you can’t achieve even if you live for 500 years. You are the biggest insult to music! A piece of garbage in the beautiful garden of music! 2- Okay, he cited James Hetfield of Metallica. One of the few people who can actually sing and a person who has the best voice when we talk about metal. No, wait, there are thousands more people that sing better than this little mutt, Including:Me. (And I’ll admit, I am a girl, who doesn’t sing well, but better than JB)You.Your dad.A cat being strangled.So JB has no rights whatsoever to say, James Hetfield. There you go. And, I’d also like to say: Justin sounds like nails on a chalkboard. 3- Hell no that’s one thing him criticizing metal its even worse he’s criticizing Metallica ill kick his ass. Personally these comments were written on TopTens. 7)Violence against Paparazzi:The paparazzi members dislike Justin Bieber because of violent ego against them. Justin Bieber is just another example of a young man, full of testosterone and money, who has gotten fed up a few times and taken some swings at people. While most of the incidents could have been avoided, no matter how thick-skinned someone is, imagine dealing with the constant harassment Bieber does. You’d want to hit people too. ",
            "date": "Updated June 22, 2017",
            "views": "986",
            "upvotes": " View 418 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rishi Kar",
                    "user_href": "/profile/Rishi-Kar-7"
                },
                {
                    "user_id": "Jeffrey Lin",
                    "user_href": "/profile/Jeffrey-Lin-55"
                },
                {
                    "user_id": "Alakh Sinha",
                    "user_href": "/profile/Alakh-Sinha-6"
                },
                {
                    "user_id": "Alessa Star",
                    "user_href": "/profile/Alessa-Star"
                },
                {
                    "user_id": "Dave Barry",
                    "user_href": "/profile/Dave-Barry-59"
                },
                {
                    "user_id": "Akhilesh Manchikanti",
                    "user_href": "/profile/Akhilesh-Manchikanti-2"
                },
                {
                    "user_id": "Sydelle Way",
                    "user_href": "/profile/Sydelle-Way"
                },
                {
                    "user_id": "Wulan Novia Palupi",
                    "user_href": "/profile/Wulan-Novia-Palupi"
                },
                {
                    "user_id": "Chhavi Chaudhary",
                    "user_href": "/profile/Chhavi-Chaudhary-59"
                },
                {
                    "user_id": "Moses Lalmuanpuia",
                    "user_href": "/profile/Moses-Lalmuanpuia"
                }
            ]
        }
    ]
}