{
    "title": "Why did Joni Mitchell say that Bob Dylan is a plagiarist? - Quora",
    "tags": [
        "Joni Mitchell",
        "Bob Dylan (musician)"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Stewart",
                "href": "/profile/David-Stewart-8"
            },
            "answer_text": "Joni has always been a bit weird and prickly. She went further than calling him a plagiarist in the interview, what she really said was \"Bob is not authentic at all. He’s a plagiarist, and his name and voice are fake. Everything about Bob is a deception. We are like night and day, he and I\" Joni has never really liked Bob much which most people have put down to professional jealousy. There have been a lot of attempts to present her as The Female Dylan which understandably annoys her as she likes to be considered an artist in her own right (and who could blame her). She's never really liked him even though he gave her a spot on the Rolling Thunder Revue tour which helped to boost her career. Bob and Van Morrison shared a bill for a short tour in 1998 and apparently the three didn't get along at all.  The most telling quote Joni gave about Bob comes after they performed together in 1994 \"On the third night they stuck Bob at the mic with me and that’s the one that went out on tape. And if you look closely at it, you can see the little brat, he’s up in my face — and he never brushes his teeth, so his breath was like… right in my face — and he’s mouthing the words at me like a prompter, and he’s pushing me off the mic. lt’s like he’s basically dipping my pigtail in ink.\"  The plagarism quote comes at a time when Joni revived her recording career after an effective retirement. Bob had released a string of albums which were incredibly well received and were huge sellers. Several of them were on Rolling Stone magazines list of the 500 best albums of all time. Suddenly Bob wasn't just a nostalgia act he was considered relevant to the times and his knew albums were eagerly anticipated and devoured. MItchell's return to recording was greeted well but didn't recieve the glowing tributes Bob did. It appears she wanted some of the adulation Bob enjoyed as not just an elder statesman but as a contemporary recording artist as well and was annoyed she didn't get it.  As Andy Lohr has said, Bob borrows phrases and expressions from artists he's admired and things he's been reading. He's always done it and has always been open about it. Sometimes he quotes things that are more obscure but frequently his reference points are easier to spot. Michael Gray's book Song and Dance Man went to pains to document the references Dylan has included from the Old and New Testament long before his born again albums. Quite why this should annoy Ms Mitchell who comes from the same folk tradition Bob does is a bit of a mystery.  Joni and Bob are both considered fairly difficult people to get along with but Bob has always played his cards close to his chest and doesn't like talking about other people in derogatory terms. Mitchell however has always been a fairly bitter person and more than happy to vent. Finally there are those who believe Joni's dislike of Bob stretches way back to the seventies. Check out this video from The Band's Last Waltz. Everyone joins the group and Dylan onstage for a final rendition of I shall Be Released. It's clear a great time is being had by all. Neil Young (who has never held back in his admiration of Dylan) is clearly loving being onstage with Bob but keep your eyes on Joni who is standing next to him. She never cracks a smile and looks bored and annoyed throughout.     ",
            "date": "Answered April 29, 2012",
            "views": "3264",
            "upvotes": " View 342 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sebastian Natera",
                    "user_href": "/profile/Sebastian-Natera"
                },
                {
                    "user_id": "George Uman",
                    "user_href": "/profile/George-Uman"
                },
                {
                    "user_id": "Kamran Hamid",
                    "user_href": "/profile/Kamran-Hamid-11"
                },
                {
                    "user_id": "Jim Loomis",
                    "user_href": "/profile/Jim-Loomis-2"
                },
                {
                    "user_id": "Bruce Briscoe",
                    "user_href": "/profile/Bruce-Briscoe-1"
                },
                {
                    "user_id": "Wayne Ferrel",
                    "user_href": "/profile/Wayne-Ferrel"
                },
                {
                    "user_id": "Danny Corso",
                    "user_href": "/profile/Danny-Corso"
                },
                {
                    "user_id": "Melanie Johnson",
                    "user_href": "/profile/Melanie-Johnson-40"
                },
                {
                    "user_id": "Oliver Austin",
                    "user_href": "/profile/Oliver-Austin"
                },
                {
                    "user_id": "Victoria Loch",
                    "user_href": "/profile/Victoria-Loch"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bruce Morgen",
                "href": "/profile/Bruce-Morgen"
            },
            "answer_text": "More than one of Joni Mitchell’s observations have some merit. First of all, Bob Dylan is a fiction of his own creation who spent years creating a persona that has nothing to with his actual origins and personal experiences, so it’s understandable that she casts severe doubt on his being “authentic.” Second, a great many of his songs — including most of those written before he went introspective with the “Another Side Of Bob Dylan” LP and then mostly electric with “Bringing It All Back Home” — comprise his (brilliant!) lyrics set to traditional folk tunes, some of them literally centuries old, which in the mind of a highly original songwriter like Joni Mitchell would comprise a sort of plagiarism. Moreover, Dylan wears his influences — ranging from Bobby Vee and Woody Guthrie to Bertold Brecht and Jack Kerouac — on his sleeve, whereas Ms. Mitchell’s creativity seems to spring from some sort of mysterious wellspring of innovation and passion, with no discernible direct influences, That said, there may be more than a little jealousy involved in Ms. Mitchell’s statements and attitude — after all, she is a unique and astonishingly talented artist whose work bespeaks a very high level of musical and poetic depth and sophistication, but she has not been nearly as influential as Bob Dylan, to a large extent because so much of her work is very difficult to cover effectively whereas Dylan’s ouvre is accessible to artists at virtually every level of talent and proficiency, from garage band screamers and karaoke wannabes to the likes of Johnny Cash, Stevie Wonder, Tim O’Brien, Joan Osborne, and Sarah Jarosz, to name just a few. ",
            "date": "Updated September 8, 2019",
            "views": "14",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Soe Htike",
                    "user_href": "/profile/Soe-Htike-18"
                },
                {
                    "user_id": "Robert Spencer",
                    "user_href": "/profile/Robert-Spencer-130"
                },
                {
                    "user_id": "Keith Terrent",
                    "user_href": "/profile/Keith-Terrent"
                },
                {
                    "user_id": "Lucretia Cohen",
                    "user_href": "/profile/Lucretia-Cohen"
                },
                {
                    "user_id": "Charlie Bell",
                    "user_href": "/profile/Charlie-Bell-6"
                },
                {
                    "user_id": "Marco Evangelista",
                    "user_href": "/profile/Marco-Evangelista-1"
                },
                {
                    "user_id": "Gail Light",
                    "user_href": "/profile/Gail-Light"
                },
                {
                    "user_id": "Gordon Glenn",
                    "user_href": "/profile/Gordon-Glenn"
                },
                {
                    "user_id": "Graham Kilgallen",
                    "user_href": "/profile/Graham-Kilgallen"
                },
                {
                    "user_id": "Dan Miller",
                    "user_href": "/profile/Dan-Miller-691"
                }
            ]
        }
    ]
}