{
    "title": "Why is Uganda not developed? - Quora",
    "tags": [
        "Undeveloped Country"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ajena Jafar",
                "href": "/profile/Ajena-Jafar"
            },
            "answer_text": "Uganda is developing.  Uganda attained independence from British colonial rule in 1962 and enjoyed sustained economic development up to 1971. During this time under the governance of Prime Minister and later President Milton Obote, the country prospered in trade driven by Indian businessmen, excelled in Education with Makerere University being the leading research institution in Africa, as well as in infrastructure. Most of Uganda's infrastructure was developed around this time. Unfortunately, the same can not be said about leadership and politics, which was characterized by chauvinism and nepotism. The political mistakes in this period paved for an era (1971–1986) of political and civil instability, and economic decline caused by poor governance and civil unrest and conflict. Between 1971 and 1986, Uganda experienced minimal development and maximum damage to its institutions, plunder of natural resources such as wildlife which were almost poached to extinction, trade was crippled by the expulsion of the Asian businessmen by H.E President Gen. Idi Amin, and civil rights abuse and civil unrest caused by two coups and numerous rebellions in different parts of the country. The actions taken in the 1971–1986 period had far-reaching consequences to Uganda's; economy, reputation, and confidence (national pride). Most of it is still felt to date. In 1986, H.E President Yoweri Kaguta Museveni, a young revolutionary, took over power and set forth a period of radical recovery, which has seen the rebirth of a resilient country. Some of the actions taken in this period include; institutional development and liberalization of the economy, reinstatement of monarchs and chiefdoms free education, military discipline, multi-party system of governance, expansion of Parliament for increased representative, conservation and breeding of wildlife, aggressive foreign policy including recall and compensation of Asian families that lost their assets and businesses, end of the 50 plus years of conflict in Uganda, which ushered in a period of slow but sustained economic development. Thirty-three years later, still under M7's rule and the economy is still progressing slowly! However, corruption levels have significantly increased, and state institutions have been repurposed to protect and further entrench the NRA/M regime. That said, Ugandans are an optimistic bunch. Our country is very blessed with abundant natural resources that, if well utilized, will propel us back to the top where we belong! We have abundant tourism resources, recently discovered and are about to starting mining and exporting oil; we have a very young educated and entrepreneurial population who are ready to move our country forward. Uganda is developing! FOR GOD AND MY COUNTRY ",
            "date": "Answered November 23, 2019",
            "views": "398",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Mosco",
                    "user_href": "/profile/Michael-Mosco"
                },
                {
                    "user_id": "Timothy Galabuzi",
                    "user_href": "/profile/Timothy-Galabuzi"
                },
                {
                    "user_id": "Carlos Carbajal",
                    "user_href": "/profile/Carlos-Carbajal"
                },
                {
                    "user_id": "Osuna Yusufu",
                    "user_href": "/profile/Osuna-Yusufu"
                },
                {
                    "user_id": "Vernon Matthews",
                    "user_href": "/profile/Vernon-Matthews-8"
                },
                {
                    "user_id": "Penny Williams",
                    "user_href": "/profile/Penny-Williams-145"
                },
                {
                    "user_id": "Marjorie Thompson",
                    "user_href": "/profile/Marjorie-Thompson-321"
                },
                {
                    "user_id": "Kabz Mish",
                    "user_href": "/profile/Kabz-Mish"
                },
                {
                    "user_id": "Vivek Agarwal",
                    "user_href": "/profile/Vivek-Agarwal-46"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dihfahsih Mugoya",
                "href": "/profile/Dihfahsih-Mugoya"
            },
            "answer_text": "Uganda was considered by Churchill as the pearl of Africa because of natural endowments it had. Uganda would have developed into a more prestigious country that is able to contribute a lot to development of the whole world if Ugandans had corrupt free minds. Its corruption that has hindered development in Uganda right from the leaders up to subjects, everyone considers how does he benefit other than how does the country benefit, this has kept our country poor and under developed. Leaders who don't want to leave power, you can't have a leader in power for 35years and you think of developing because this leader has out lived his purpose and has no new ideas of development to offer for the country. For God and my country ",
            "date": "Answered November 22, 2019",
            "views": "108",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mutesi Hillary",
                    "user_href": "/profile/Mutesi-Hillary"
                },
                {
                    "user_id": "Grace Castro",
                    "user_href": "/profile/Grace-Castro-36"
                },
                {
                    "user_id": "Craig Castillo",
                    "user_href": "/profile/Craig-Castillo-3"
                },
                {
                    "user_id": "Cameron Simpson",
                    "user_href": "/profile/Cameron-Simpson-53"
                }
            ]
        }
    ]
}