{
    "title": "Why are females sexualized in pop music? - Quora",
    "tags": [
        "Pop Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Collette Mclafferty",
                "href": "/profile/Collette-Mclafferty"
            },
            "answer_text": "It comes down to one thing: money. Sex is always a no-brainer in commercial pop music. It will stand the test of time and attract eyeballs. There will always be a need for the newest pop star to “one up” the last one. The music industry is also made up of about 10% of leaders and 90% followers. Britney Spears brought unprecedented sales into the pop world and completely changed the game with her Disney-to-Vegas Stripper aesthetic (for the record I love both Britney and Vegas Strippers, so that is not a dis…just an observation). While Madonna paved the way, Britney created a movement and a machine. For all my 80’s babies out there, remember when this was actually pushing the envelope? How shocking this was at the time?  Then….remember how shocking it was a couple decades later when Britney and Madonna kissed during the same song?  This shocked the world at the time, but now girl on girl is a standard theme in pop music videos. Jo Lo. Iggy Izaela  Christina Agularia’s “Dirrty” was shocking at the time and now reads tame in comparison.  I want to comment on Annon’s answer saying that the singers choose this. My answer is it is not that simple. I invite you to read Collette Mclafferty's post in Fallopian Tubes about my brief stint in the pop world. Although I was on a much smaller label, I encountered pressure to hyper sexualize my image way outside of my comfort zone. Because I was signed much older then most singers (30), I had the life experience to decide that it wasn’t for me. However, I had to fight for weeks and weeks with my record label just so I wouldn’t have to hump a phallic shaped pillow covered in baked beans in my music video (They wanted me to spoof Ann Margaret in “Tommy”, I was cool with everything except gyrating on the pillow. I was told that we would deal with it on the set. The fact that I wouldn’t do it was seen as a big deal. I would have hours long conversations about this with my label and it would suck the life out of me. I can see how for a young artist it is just easier to play ball, especially when millions of dollars are at stake. For every pop star, there is a team of countless people crafting the image. Managers, Agents, A and R, wardrobe, brands that the pop star is associated with. Britney Spears changed the game for women in pop for better or worse… it brought the age of the singer down significantly, while hypersexulaizing the performer. The Disney-to-hypersexulaized pop singer has become somewhat of a prototype. When performers get signed these days, they are usually extremely young and have not learned to stand up for themselves just yet. When I started out in the business, 15 was considered “too you g” by many labels, now it is the norm for a new pop artist. The “transformations” of these singers are carefully orchestrated by a team of people calling the shots. There is usually a lot of money riding on these singers and in some cases the young pop singers are managed by their parents. We are talking beach houses, mansions, expensive cars and college educations ride on the artists ability to sell and “play the game”. In the pop world, lables like to go for a sure thing. Can the singer choose to not play ball with this image? Of course, but the label can also choose to drop or even worse, shelve the artist. They can contractually tie up the artist so they can not release music elsewhere, but also not have their music out at all. Kesha is a great example of this (although I am rooting for her comeback!)  I was speaking with someone who claimed to be friends with the man who masterminded Miley Cyrus’s “transformation”. He told me that Miley had zero input into it and just did what she was told. I have absolutely no idea if that is true or not however Kesha did confirm that she had no creative control over her career. From Rolling Stone: You don't have creative control now? \"Not really. What's been put out as singles have just perpetuated a particular image that may or may not be entirely accurate. I'd like to show the world other sides of my personality. I don't want to just continue putting out the same song and becoming a parody myself. I have so much more to offer than that and I can't wait till the world really gets to hear that on the radio.\" — Kesha in Rolling Stone, October 2013 It is rare for singers to admit that in interviews, as they have to please their labels when they do press. They are linked with “media coaches” who teach them how to give the correct answers that align with the image that the record label wants them to have. It should be noted also that misogyny in the music industry is very real. In the pop world the shots are often being called by much older men. Even Britney Spears herself has spoken up on this. From Britney Spears: \"A Lot Of Sex Goes Into What I Do\" “A lot of sex goes into what I do. But sometimes I would like to bring it back to the old days when there was like one outfit through the whole video, and you’re dancing the whole video, and there’s like not that much sex stuff going on, said Britney. “It’s about the dance and it’s about being old school, it’s like keeping it real and just making it about the dance. I’d love to do a video like that.” Then there is the market research and the “cool hunters” who confirm that the age demographic that this music is marketed to want this. This is all very carefully calculated. From PBS: Watch The Full Program In short, as long as the public keeps buying it, the record labels will keep selling it. Anonymous also writes this: There are successful female pop artists like Natalie Merchant, Tracy Chapman and Joni Mitchell who don’t portray themselves as sex objects. While this is very true, one thing Annon doesn’t realize is these artists all broke out before over sexualization became standard practice in the pop music world. The machine that exists today, didn't exist yet. I love Natalie, Tracy and Joni, but they are from a business model of yesteryear. If they were just coming out today, they would be on indie labels or would be putting their music out DIY. The major record labels would pick them up once they had a proven track record of sales. My hope however is that as more artists speak out about what goes on behind the scenes that the over sexualization will become played out. I love to see a sexy artist, but only if they are enjoying themselves and truly in their element. Some of these artists are not in control of their image, they are just doing what they are told. ",
            "date": "Answered January 10, 2017",
            "views": "71",
            "upvotes": " View 28 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dana George",
                    "user_href": "/profile/Dana-George-31"
                },
                {
                    "user_id": "James Harper",
                    "user_href": "/profile/James-Harper-123"
                },
                {
                    "user_id": "Idan Ofek",
                    "user_href": "/profile/Idan-Ofek-2"
                },
                {
                    "user_id": "Erick Anderson",
                    "user_href": "/profile/Erick-Anderson-19"
                },
                {
                    "user_id": "Wydianne Van Megen",
                    "user_href": "/profile/Wydianne-Van-Megen-2"
                },
                {
                    "user_id": "Sarah Chester",
                    "user_href": "/profile/Sarah-Chester-27"
                },
                {
                    "user_id": "Ninette Dismon",
                    "user_href": "/profile/Ninette-Dismon-1"
                },
                {
                    "user_id": "Mikhail Nitko",
                    "user_href": "/profile/Mikhail-Nitko"
                },
                {
                    "user_id": "Shreya Swaminathan Harita",
                    "user_href": "/profile/Shreya-Swaminathan-Harita"
                },
                {
                    "user_id": "Kyla Coleman",
                    "user_href": "/profile/Kyla-Coleman-1"
                }
            ]
        }
    ]
}