{
    "title": "Why do BTS seem so distant and really muted around each other now? Why do Jungkook and Taehyung seem so serious around each other now? What happened within the group? - Quora",
    "tags": [
        "Kim Taehyung (BTS Member)",
        "Jungkook (BTS Member)",
        "BTS (K-pop group)",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mingyun Seo-Bang",
                "href": "/profile/Mingyun-Seo-Bang"
            },
            "answer_text": "Oh my goodness, it must be because they had a lovers' quarrel or they're fed up with fan fiction and shipping, yes? NO! Let me say that again, NO! NO! NO! Big Hit has not ordered them to stay away from each other, managers are not keeping them apart. Taehyung just lost his grandfather. This was the man who gave him his name and raised him. This was the man who fed him and loved him. This was the man he loved. His grandfather died in the middle of a tour, a tour that he had worked towards for years. He went home, said goodbye to one of the father figures in his life and then had to immediately join the tour again and pretend everything was just peachy. I mean he didn't have any choice, yes? How dare he put his feelings above everyone who purchased tickets to see him? How could he let down his members and grieve for the man who raised him so soon after losing the grandmother who raised him? Jungkook has had accidents on this tour. It's taken a toll on his body. Also, and I am relaying information given by my colleagues, the MGA performance with Charlie Puth was a disaster. There were issues backstage, there were issues with sound and music, there were issues with the stage. Jungkook felt he did not do his best and disappointed fans. It was made worse watching his members struggle on a song they've sung dozens of times. There may have even been disappointment with Charlie himself. He's also not obligated to act like a giddy school boy when girl groups are performing. More than likely he was sitting there agonising over what a mess the night had been. Lastly they've been touring for months. Sleeping in vans, planes, hotels. Eating hotel food. Not being close to their loved ones and friends. They're TIRED. They're tired and they start the tour up again in 3 days. They don't like to disappoint their fans. ",
            "date": "Updated November 13, 2018",
            "views": "184",
            "upvotes": " View 1.5K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Isabel",
                    "user_href": "/profile/Isabel-745"
                },
                {
                    "user_id": "Sophia Suave",
                    "user_href": "/profile/Sophia-Suave"
                },
                {
                    "user_id": "Elaine Nguyen",
                    "user_href": "/profile/Elaine-Nguyen-92"
                },
                {
                    "user_id": "Ann Mary",
                    "user_href": "/profile/Ann-Mary-349"
                },
                {
                    "user_id": "Jnwo Zu",
                    "user_href": "/profile/Jnwo-Zu"
                },
                {
                    "user_id": "Nasteho Houssein",
                    "user_href": "/profile/Nasteho-Houssein-2"
                },
                {
                    "user_id": "Cherry Kanbara",
                    "user_href": "/profile/Cherry-Kanbara"
                },
                {
                    "user_id": "Rimi",
                    "user_href": "/profile/Rimi-58"
                },
                {
                    "user_id": "Shreya Agarwal",
                    "user_href": "/profile/Shreya-Agarwal-671"
                },
                {
                    "user_id": "Iva Simonovska",
                    "user_href": "/profile/Iva-Simonovska"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nora White",
                "href": "/profile/Nora-White-23"
            },
            "answer_text": "Nothing really happened with their relationship… They are all still friends if you were wondering. I do think that because of the rise in fame and popularity they are all trying to maintain the group image without causing too much of a scandal. It really is hard when the whole world is constantly looking at you and you need to act a certain way even if your private life is now pretty much non-existant. So obviously they can't really play around like they used to. It is tiring because they legit put their soul into their work because they put high standards on themselves in order to produce quality content. They respect their fans even though many times they have experiences with saesang fans. It is hard to continue to have respect for your fans if many times they intrude your privacy. I'm glad that because of the saesang fans they have not judged the entire fan base. They are put in a spot that they can't even retaliate if something is done to them coz if they do it would cause a scandal. I myself feel frustrated hearing about this and i can't even imagine how they handle all of this while focusing on the next big thing to achieve. They are the first group from korea to become so famous world wide. So they literally represent their country. So they have that kind of pressure as well. They work themselves so much that I worry about them at times. They can't even take time to think about their personal life and always beat themselves up for their shortcomings. If I ever could get to meet them I just want to give them all a hug for doing so well so far. They seriously are the nicest and the most hardworking people I know. I know the other Fandoms always tell us that we keep bragging about how hardworking they are and that every trainee and Kpop idol has to work hard. But I seriously can't find anyone this sincere towards their work. Even though they got so much fame and popularity BTS still remain so humble. They really deserve all the good things in the world and I hope that they have people that takes good care of them. I'm also glad that bighit takes such good care of them. It isn't an easy task to manage the time and energy of BTS especially now since they are famous worldwide. I pray that the world is more understanding of them and treats them like a human being. I pray that they all can smile at the end of the day. I pray that the ARMY takes care of them just like how BTS takes care of ARMY. I pray that they live a long and happy life. ",
            "date": "Answered November 14, 2018",
            "views": "252",
            "upvotes": " View 150 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ann Mary",
                    "user_href": "/profile/Ann-Mary-349"
                },
                {
                    "user_id": "Jack Come Back",
                    "user_href": "/profile/Jack-Come-Back-1"
                },
                {
                    "user_id": "Kyanna Kok",
                    "user_href": "/profile/Kyanna-Kok"
                },
                {
                    "user_id": "The Dragon Egg",
                    "user_href": "/profile/The-Dragon-Egg"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Ashley-3914"
                },
                {
                    "user_id": "Imee Vito",
                    "user_href": "/profile/Imee-Vito"
                },
                {
                    "user_id": "Zion Breggs-Park",
                    "user_href": "/profile/Zion-Breggs-Park"
                },
                {
                    "user_id": "Elizabeth Oseni",
                    "user_href": "/profile/Elizabeth-Oseni"
                },
                {
                    "user_id": "Chuqiao Wang",
                    "user_href": "/profile/Chuqiao-Wang-7"
                },
                {
                    "user_id": "Isabella Strbik",
                    "user_href": "/profile/Isabella-Strbik"
                }
            ]
        }
    ]
}