{
    "title": "Why is Diana Ross not in the Rock and Roll Hall of Fame as a solo artist? She's in as a member of the classic Diana, Mary & Flo lineup of The Supremes. But she had a long, successful career after going solo. - Quora",
    "tags": [
        "Florence Ballard",
        "Mary Wilson (singer)",
        "The Supremes",
        "Diana Ross",
        "Motown",
        "Rock and Roll Hall of Fame",
        "Rock and Roll Music",
        "Pop Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Gordon",
                "href": "/profile/William-Gordon-108"
            },
            "answer_text": "I have a couple of theories here…one that could be related to the other: 1) It could be that Hall of Fame officials didn’t like the fact that ROSS didn’t show up for the Supremes’ induction. Why induct her TWICE ? She probably wouldn’t show up for THIS one, either. 2) Ross has a bad reputation for being a DIVA . A lot of people at Motown simply didn’t like her because of it. She and Mary Wilson hadn’t talked in years…and the only time they DID share a stage, during Motown 25, there was an incident , where Ross pushed Mary onstage…and grabbed the mike…so that SHE could introduce Berry Gordy, who was seated in the audience, after MARY had already done so. ROSS was also a no-show during the filming of the Supremes’ 2006 Motown DVD. MARY introduced all of the tunes …and did the narratives and song histories.  It has been a long known fact that Mary blames ROSS for Supreme FLORENCE BALLARD’S DOWNFALL….and subsequent REMOVAL from the group…which eventually led to her death. Since then , ROSS had pretty much washed her hands of The Supremes…and Mary had washed HER hands of ROSS. She said in an interview, that she wasn’t even told of the possible “reunion” until the wheels had already began to turn…and the plans had already been put in place. Mary thought this was disrespectful of HER legacy as an ORIGINAL MEMBER…and the comparatively small amount that SHE would get compared to ROSS made things even WORSE. Many other people in the industry feel the same…so to give ROSS a second induction is something that quite probably WON’T happen. MARY WILSON accepts induction for THE SUPREMES into The Rock and Roll Hall of Fame…accompanied by Florence’s daughter , LISA. Diana was a NO SHOW. (1988)  MARY on with Bryant Gumbel on THE TODAY SHOW (1990)  MARY on THE TALK ( 2020)  MARY REMEMBERS and DEFENDS FLORENCE (2020)  MARY on DIANA ROSS (Several interviews)  ",
            "date": "Updated September 16, 2020",
            "views": "182",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Brown",
                "href": "/profile/David-Brown-737"
            },
            "answer_text": "Well that’s a good question. It’s also questionable as to why she’s never won a competitive Grammy (neither solo, nor with the Supremes), especially since she’s churned out plenty of the kind of pap Grammy voters love (“Endless Love” anyone? UGH) My best guess is for the same reason that Cher, Bette Midler, Barbra Streisand, solo Phil Collins, Mariah Carey and Whitney Houston are not in: the RnR HOF tends to look down on “old-school pop singers.” She has had a number of hit singles, but she had very few classic albums, Diana and The Boss being the main ones. The HOF largely looks at albums. Amongst many critics who pay attention to innovation, influence and relevance, Ross has always been too lightweight in all three categories. Also: one can surmise that she’s made a few enemies in the industry, thanks to a Diva attitude. Also, there’s the affair she had with Motown founder Berry Gordy, and in return, the favors he showered her with, from promoting her into a solo career to roles in movies produced by Motown. (some in which she performed well like Lady Sings the Blues, and some she was ill-suited for, like The Wiz.) People tend to frown on you when your success seems to come through suspect means. Famously, Mary Wilson has been Ross’ strongest detractor, casting aspersions on both her talent and definitely her character. It has been implied by many that Ross and Gordy bear some responsibility for the tragic life and death of The Supremes Florence Ballard. And then there was that ersatz Supremes reunion which struck a bad note with many. In recent years, her image has been somewhat refreshed to that of Living Legend; she’s one of our last links to that old fashioned showbiz era and is still touring yearly well into her 70s. But the RnR HOF may remain out of reach. ",
            "date": "Updated May 2, 2019",
            "views": "536",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Karl Rooney",
                    "user_href": "/profile/Karl-Rooney-5"
                },
                {
                    "user_id": "Stu Midge",
                    "user_href": "/profile/Stu-Midge"
                }
            ]
        }
    ]
}