{
    "title": "Why did Michael Jackson disapprove of Naomi Campbell yet she epitomised everything he liked in a woman physically? Was she too young for him to have an interest in her? - Quora",
    "tags": [
        "Naomi Campbell (English model)",
        "Michael Jackson (musician)",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marina Gkane",
                "href": "/profile/Marina-Gkane"
            },
            "answer_text": "Naomi Campbell said that Michael was very sweet, down to earth and humble. Michael Jackson said that Naomi was perfect but he didn’t like doing that stuff if he didn’t mean it. By that he meant that he didn’t like casual sex without feelings. The video is based on the idea of a dance off of two lovers, simulating the act of sex, while she urges him to tell everyone about their love affair while he hesitates and he wants to keep it in the closet. Originally, the song was supposed to be a duet between Michael Jackson and Madonna but they didn’t agree artistically thus they never collaborated together. In addition, Michael Jackson didn’t like Madonna, he thought she was rude and not a nice person. He did the duet with Princess Stephanie Grimaldi instead, who was also a big fan of his. However, the song was re recorded with Naomi’s vocals. The video was banned due to its sensual scenes in South Africa. Physically, Naomi epitomised not only what Michael Jackson wanted but what every man did and does i might add. But, there is more than physical attraction. Naomi was sexually aggressive and while filming she whispered in Michael’s ear ‘’ i want to suck your d..ck’’. Michael then complained to Karen Faye who told him ‘’ go tell Naomi i said she can’t do that’’. Then, they had a food fight. However, Naomi has fond memories of Michael and she cried when she was shown the footage when she was interviewed recently. She has recently posted this on twitter.   Michael Jackson was presented with an award by Naomi Campbell in Monaco in 1996 ",
            "date": "Answered September 6, 2018",
            "views": "28",
            "upvotes": " View 67 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lejah",
                    "user_href": "/profile/Lejah"
                },
                {
                    "user_id": "Ava Morgan",
                    "user_href": "/profile/Ava-Morgan-58"
                },
                {
                    "user_id": "Michael Dessy",
                    "user_href": "/profile/Michael-Dessy"
                },
                {
                    "user_id": "Aaliyah Brown",
                    "user_href": "/profile/Aaliyah-Brown-180"
                },
                {
                    "user_id": "Elaine Stephanie Elvin",
                    "user_href": "/profile/Elaine-Stephanie-Elvin"
                },
                {
                    "user_id": "Billy Biden",
                    "user_href": "/profile/Billy-Biden"
                },
                {
                    "user_id": "Dave Barry",
                    "user_href": "/profile/Dave-Barry-59"
                },
                {
                    "user_id": "Trent Zizzle",
                    "user_href": "/profile/Trent-Zizzle"
                },
                {
                    "user_id": "Mohammad Daniyal Bhat",
                    "user_href": "/profile/Mohammad-Daniyal-Bhat-2"
                },
                {
                    "user_id": "Eliana Dobbs",
                    "user_href": "/profile/Eliana-Dobbs-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lex Glitter",
                "href": "/profile/Lex-Glitter"
            },
            "answer_text": "He loved Naomi Campbell. They worked well on set together, and often teased each other with pranks. She was not too young for him, as he was involved with Diana Ross in his youth and loved her a lot. He definitely had an interest in Naomi, but there is nothing available to tell if they dated, were intimate or anything else. He probably admired her professionalism on set. ",
            "date": "Answered June 25, 2019",
            "views": "32",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Leda Peni",
                    "user_href": "/profile/Leda-Peni"
                },
                {
                    "user_id": "Charles J Lewis",
                    "user_href": "/profile/Charles-J-Lewis-1"
                },
                {
                    "user_id": "Franklin Bryant",
                    "user_href": "/profile/Franklin-Bryant-1"
                },
                {
                    "user_id": "Michael Dessy",
                    "user_href": "/profile/Michael-Dessy"
                },
                {
                    "user_id": "Aaliyah Brown",
                    "user_href": "/profile/Aaliyah-Brown-180"
                },
                {
                    "user_id": "Tony Baron",
                    "user_href": "/profile/Tony-Baron-2"
                },
                {
                    "user_id": "Trent Zizzle",
                    "user_href": "/profile/Trent-Zizzle"
                },
                {
                    "user_id": "Sarah Johnson",
                    "user_href": "/profile/Sarah-Johnson-2181"
                },
                {
                    "user_id": "Marina Gkane",
                    "user_href": "/profile/Marina-Gkane"
                },
                {
                    "user_id": "Linda Hopkins",
                    "user_href": "/profile/Linda-Hopkins-37"
                }
            ]
        }
    ]
}