{
    "title": "Why is it so rare for white men to like black girls and eventually marry them? I've always wanted to pursue a relationship with a white man but most don't view marriage as an option. - Quora",
    "tags": [
        "Interracial Marriage",
        "White Women",
        "Interracial Dating and Relationships",
        "White People",
        "Black People",
        "Racism",
        "Race and Ethnicity",
        "Marriage",
        "Dating Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arthur Ort",
                "href": "/profile/Arthur-Ort-2"
            },
            "answer_text": "We’re out there, promise. While I can’t answer for everyone I’ll give you my thoughts on it as we’ve got a few years under our belt. I’d say by and large it’s cultural and is learned, or unthought, behavior. It was quite a shock to my family when we first started dating and at one point I had to make a choice between them and her. I chose both. And it worked. Fear on many levels was at the root of it, not some ingrained and immovable racism. I think it has a lot to do with ‘outside the box’ thinking and exposure. It’s generally a cultural ‘norm’ that we don’t stray far from what we experience and what’s expected whether intentionally or out of simple proximity. Most of us like sheep do what we know. This isn’t necessarily a bad thing but it can be a tough nut to crack. I’ve always been rebellious and found the cultural norms claustrophobic so was always open to things outside of what I knew. I suppose had I been exposed to a more diverse community (and not just stereotypes learned through entertainment media) while growing up it would not have been such a big deal. I can’t speak for all but the first time my wife smiled at me I was smitten. It was instant. It took me a few months and some guts to finally ask her out but it was a whirlwind once I did as we were so incredibly different in so many different ways. Race, depending on where you live, is so much more than just skin color. What is behind the skin color makes all the difference in the world. She is from Jamaica and within her family race wasn’t (and isn’t) a big deal. Jamaica’s motto is: ‘Out Of Many One People’ (ironically, perhaps, very much like E Pluribus Unum) but when she was transplanted to the East Side of Youngstown at age 14 she encountered culture shock of her own. As a preacher’s kid she has an even more unique perspective on race. Then you take a guy like me from a small suburb, almost farm country, very much not churched and you can imagine the fireworks. We’ve been together for 25 years, 19 of those as husband and wife, and I can’t imagine my life otherwise. Our differences, though we often collide, have enabled us to grow into something beautiful.  ",
            "date": "Updated July 4, 2020",
            "views": "128",
            "upvotes": " View 234 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ansell Ogbonnah",
                    "user_href": "/profile/Ansell-Ogbonnah"
                },
                {
                    "user_id": "A StoryTeller",
                    "user_href": "/profile/A-StoryTeller-1"
                },
                {
                    "user_id": "Jarrett Montgomery",
                    "user_href": "/profile/Jarrett-Montgomery-1"
                },
                {
                    "user_id": "Alyn Hill",
                    "user_href": "/profile/Alyn-Hill"
                },
                {
                    "user_id": "Lasonya Jordan",
                    "user_href": "/profile/Lasonya-Jordan-3"
                },
                {
                    "user_id": "Diane Kipp",
                    "user_href": "/profile/Diane-Kipp-2"
                },
                {
                    "user_id": "Makayla Moody",
                    "user_href": "/profile/Makayla-Moody-5"
                },
                {
                    "user_id": "Chris Figueredo",
                    "user_href": "/profile/Chris-Figueredo-2"
                },
                {
                    "user_id": "R. F. John Holtzen III",
                    "user_href": "/profile/R-F-John-Holtzen-III"
                },
                {
                    "user_id": "Bonnie Mawrie",
                    "user_href": "/profile/Bonnie-Mawrie"
                }
            ]
        },
        {
            "author_info": {
                "name": "Greg Weinstein",
                "href": "/profile/Greg-Weinstein-4"
            },
            "answer_text": "I’m Jewish, so not “white,” but not black, either. I dated a black woman in college (though she didn’t live in the same city, it was a long distance relationship with high long distance bills, as this was the early 90’s). She was beautiful and artistic. She was my friend‘s cousin, and he brought her when he came to spend the day with me, my family, and a college friend I’d brought home for the weekend. I really liked her, on an emotional and physical level. But she was very into Christianity, and as a Jew I wasn’t interested in that. She wouldn’t let it go, over and over she’d want to know why I “couldn’t be a Christian and a Jew at the same time,” and didn’t accept my refusal. We talked for hours every day, I went to visit her twice and we stayed at my hotel together. I asked her to be my girlfriend, and she said she was flattered, but no. I was pretty hurt at this rejection, and backed off from talking to her as much. She called me a few days later and said she loved me. I was still hurt, and told her I loved her, but as a friend. I don’t know if I would have handled it differently at a different stage in life, but she was only the third girl I’d seriously dated, and I didn’t see a future with the religious difference. Maybe I did the right thing, who knows. A couple months later I graduated college, and was at home wondering what to do next. Her cousin called me on New Year’s Eve and invited me over to celebrate, and said she’d be there. We had a nice night together, the three of us, and she and I shared the couch. After we said goodbye, I never spoke to her or saw her again. No bad feelings, just no future. I eventually drifted away from her cousin, and he and I haven’t talked for over a decade, so I have no idea where she is. I hope she’s doing well. If things (especially the religion) had been different I could’ve seen marrying her and having kids, but that ended up happening with someone else. P.S. My cousin married a black woman, and they just had their first kid a few months ago. ",
            "date": "Answered May 7, 2020",
            "views": "25",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sulejman Bosnian Colombian",
                    "user_href": "/profile/Sulejman-Bosnian-Colombian"
                },
                {
                    "user_id": "Bonnie Mawrie",
                    "user_href": "/profile/Bonnie-Mawrie"
                },
                {
                    "user_id": "Lynnsley York",
                    "user_href": "/profile/Lynnsley-York"
                },
                {
                    "user_id": "Soma Chakraborty",
                    "user_href": "/profile/Soma-Chakraborty-171"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/XtrWolf"
                },
                {
                    "user_id": "Akash Tayde",
                    "user_href": "/profile/Akash-Tayde-15"
                },
                {
                    "user_id": "Fatoumatta Touray",
                    "user_href": "/profile/Fatoumatta-Touray-12"
                },
                {
                    "user_id": "Bob Bruno",
                    "user_href": "/profile/Bob-Bruno-2"
                },
                {
                    "user_id": "Phaedra Brooks",
                    "user_href": "/profile/Phaedra-Brooks"
                },
                {
                    "user_id": "Alyssa Mew",
                    "user_href": "/profile/Alyssa-Mew-1"
                }
            ]
        }
    ]
}