{
    "title": "Why do K-pop idols that are not Korean receive so much hate? - Quora",
    "tags": [
        "Korean Ethnicity and People",
        "K-Pop Idols",
        "South Korea",
        "Hate",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Min SuSu",
                "href": "/profile/Min-SuSu-1"
            },
            "answer_text": "I’m not very sure about this but I think this is because of “racism” in K-Pop. As we all know racism has existed a long time ago in many Western areas. But through times, racism has fade away slowly. Asia is divided into many regions, which one of the weakest religion in development in including Southeast Asia. We got a lot of non-Korean K-Pop members in this religion, example Lisa from BlackPink. I think one of the reasons, is her beauty. Her beauty isn’t the same as the other Koreans, so that may make some other people think anything that is negative about her. And maybe others that influenced her like her country, culture,… There could be many ways. But I think the main reasons, is the hater themselves. As me myself who got a friend who is Korean, she told me that Koreans aren’t really open to other countries. For example, us Vietnamese really appreciate the Korean visitors. But in reply, when I went to Korea as a visitor. I don’t see there open spirits and positivity, that might be why. It also happens with other countries from other places as well. But not all Koreans are so, so don’t worry my friend. If you get to know them well and is open to them, you will find them really nice. In my opinion, K-Pop racism is a big problem for idols who are in another region. But, for now let’s just don’t think about it too much. Racism isn’t good, the haters will think about how wrong they are for hating them, and how great the idols are. ",
            "date": "Answered June 5, 2019",
            "views": "209",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Crystal Simpson",
                    "user_href": "/profile/Crystal-Simpson-65"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suru Euphoria",
                "href": "/profile/Suru-Euphoria"
            },
            "answer_text": "Actually I am new here ..and I would like to answer this according I think I think may be people had fit in their mind that K-pop idol members should be Korean as it belongs to them, and if any non Korean idol appears they might not like it…..but people should understand many famous K-pop group has non Korean members although they are from their neighbouring countries For eg Japan, Thailand etc…. Hope you got what I am saying and may be this is helpful….. Sorry if I made any mistake 💜 ",
            "date": "Answered July 17, 2020",
            "views": "22",
            "upvotes": "0"
        }
    ]
}