{
    "title": "Why did Metallica become a grunge band in the 90s? - Quora",
    "tags": [
        "Grunge",
        "Grunge Music",
        "Metallica (band)",
        "1990s Music",
        "1990s",
        "Bands (music)",
        "Rock Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matt Aliberti",
                "href": "/profile/Matt-Aliberti"
            },
            "answer_text": "I don’t see them as a “grunge” band at all- even during their Load/ Reload years. They did evolve as all bands that want to remain relevant do, and the grunge movement was at its apex. The Load/ Reload albums are really underrated and I feel are solid hard rock metal albums at a time when most metal bands were breaking up or on life support. The difference between their 90s albums and their stuff from the 80s was that it wasn’t “Thrash metal”, they took a turn at The Black Album and it was there that they transitioned from a thrash band to a more mainstream metal outfit. Load and Reload was just an extension of this transformation and obviously a few steps further away from their Thrash roots. The followup 2003’s St. Anger was far worse than the Load era stuff. They have since took a few steps back to their roots with Death Magnetic and Hardwired. I’m not going to put LULU in their mix- that was a collaboration and not a Metallica album proper. So in short, they never became a “grunge band”, they just incorporated some of the sounds of the day into their mix, moved toward a more radio friendly style of metal, which widened their reach and made them much more money. ",
            "date": "Answered June 9, 2019",
            "views": "477",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dan Johnson",
                    "user_href": "/profile/Dan-Johnson-102"
                },
                {
                    "user_id": "Benjamin Adler",
                    "user_href": "/profile/Benjamin-Adler"
                },
                {
                    "user_id": "Jon Madden",
                    "user_href": "/profile/Jon-Madden-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Smith",
                "href": "/profile/William-Smith-826"
            },
            "answer_text": "I don't know if I'd consider their 90s work grunge, but I'd say they, like their contemporaries in the Big 4, had to adapt to a changing musical climate. Thrash metal was out. Grunge, alternative rock and groove metal were in, death metal and black metal were too dark and brutal for the forefathers to tap into and nu metal was just around the corner. Metallica had just peaked with their stripped down Black Album (an album so successful that the residuals alone ensured Jason Newstead he would be rich for the rest of his life), so why ruin a good thing? Why not instead build on that foundation and embrace a sort of softer sound to be continue to be kings of the court as opposed to out of touch thrashers who are being left behind? But like I said, it wasn't just them: Anthrax dabbled in alternative and groove metal styles in “Stomp 442” and “Volume 8”, Slayer toyed with nu metal with “Diabolus in Musica,” and Megadeth strove for that number 1 hit via a radio rock approach with “Cryptic Writings” and “Risk.” Testament was really the only band to have any major artistic merit during those times, working with death metal on “Demonic” and a fusion of death, thrash and even a minor black metal vibe in “The Gathering.” In her end, though, you adapt or die. ",
            "date": "Updated June 25, 2020",
            "views": "135",
            "upvotes": "0"
        }
    ]
}