{
    "title": "Why are most rappers broke? - Quora",
    "tags": [
        "Philosophy of Art",
        "Rapper",
        "Rap Music",
        "Hip Hop and Rap Artists",
        "Hip Hop Music",
        "Music Industry",
        "Wealthy People and Families",
        "Musicians",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Greenan",
                "href": "/profile/Michael-Greenan"
            },
            "answer_text": "i don't know any rappers I'd call broke,and it seems they have more money than some other artists with all there big houses,expensive cars and the like ,but maybe there not as rich as they make out to keep their gangsta images intact,but I'd never say any successful rapper is broke lthough most often them started out that way and maybe some of the less known rappers are,but to say a rapper is broke sounds wrong to me and i can't think of one who is,here is some successful rappers worth today, Dr dre $856 million,eminem $210 million,Nas $80 million and the list goes on to give known rappers earnings of hundreds of millions of dollars each,and i don't think this is even the total amount their worth when you endorsements,concertsetc but i just added some to show that rappers are far from being skint(i wish i was that skint) ",
            "date": "Answered April 22, 2019",
            "views": "884",
            "upvotes": " Answer requested by Littlehood Drexler"
        },
        {
            "author_info": {
                "name": "Travis Mlea",
                "href": "/profile/Travis-Mlea"
            },
            "answer_text": "What I think about most broke is that they lack what we call the sign of respect in the game. Infact for being a rapper is not easy because sometimes it is a way that you rhyme also the way you connect the beat as well. Let's talk about the marketing stuff, there should be an adequate management as well not the fake ones who pretend so much. ",
            "date": "Answered October 10, 2020",
            "views": "46",
            "upvotes": "0"
        }
    ]
}