{
    "title": "Why do people stop playing musical instruments? - Quora",
    "tags": [
        "What Causes X?",
        "Motivation",
        "Learning to Play Musical Instruments",
        "Understanding and Maintaining Motivation",
        "Musical Instruments"
    ],
    "response": [
        {
            "author_info": {
                "name": "Allan Newstadt",
                "href": "/profile/Allan-Newstadt"
            },
            "answer_text": "I do believe I have a pretty unique reason for stopping, half way through my first piano lesson( at the age of four). My mom, a fairly accomplished pianist and music teacher had noticed my fascination when she was teaching my two elder sisters. She promised to start teaching me when she next had a chance! A day or two later, an extremely excited 4 year old sat beside his mother for a brief music theory lesson ( I could read and write pretty well already ) and then we got down to the GOOD STUFF, Scales. I could hardly stop myself bouncing up and down with excitement, when my dad walked in! My dad, a hard drinking, hard living, decorated WW2 fighter pilot lived most of his life with one huge fear. He was convinced that his youngest child ( that’s me) was going to turn out gay. I have absolutely no idea where this came from, perhaps from the PTSD that he carried around, unacknowledged, his entire life. One look at his overly excited son, happily plunking away at the keys next to his mother and he fucking lost it. All I can recall is him screaming at my mom that she was the reason I was going to turn out gay and if she ever tried to teach me again, he would smash her beloved piano and burn the remains in the fireplace. I do believe I got a lick or two from his leather belt across the bum for my part of “ the turning gay conspiracy “. This probably sounds horrific now, but that was life in the early ‘60s. Most of us went through it and came out pretty unscathed. My love of music has persisted until today, infact it is one of very few passions I still retain. My ability to create music died a cold, miserable and lonely death, over half a century ago. Just Incase anyone has read this far, or even cares, I grew up totally heterosexual. I married the woman I love,had two great kids and lived a pretty great life, despite serious injury and a dread disease. Not learning to play an instrument is probably my one great regret. I guess it could have been a damned lot worse! ",
            "date": "Answered March 1, 2019",
            "views": "35",
            "upvotes": " View 24 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jade Smith",
                    "user_href": "/profile/Jade-Smith-885"
                },
                {
                    "user_id": "Surabhi Pandey",
                    "user_href": "/profile/Surabhi-Pandey-126"
                },
                {
                    "user_id": "Rinsanga Hmar",
                    "user_href": "/profile/Rinsanga-Hmar"
                },
                {
                    "user_id": "Joshua Schneider",
                    "user_href": "/profile/Joshua-Schneider-58"
                },
                {
                    "user_id": "Wayne Dallas",
                    "user_href": "/profile/Wayne-Dallas"
                },
                {
                    "user_id": "Albert So",
                    "user_href": "/profile/Albert-So-10"
                },
                {
                    "user_id": "Sagar Chowdhury",
                    "user_href": "/profile/Sagar-Chowdhury-8"
                },
                {
                    "user_id": "Goh Kawai",
                    "user_href": "/profile/Goh-Kawai"
                },
                {
                    "user_id": "Adrian Moreno",
                    "user_href": "/profile/Adrian-Moreno-52"
                },
                {
                    "user_id": "Bijan Rajaie",
                    "user_href": "/profile/Bijan-Rajaie"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emily Fisher",
                "href": "/profile/Emily-Fisher-32"
            },
            "answer_text": "As a kid I woke up one day determined to play the flute, so signed up for lessons at school.  At the first lesson we were just supposed to blow into the separated mouthpiece, learn to make a nice clean sound with it. Within minutes, the whole class was happily blowing away, but I couldn't get the damn thing to make any sound at all. We were supposed to blow into the mouthpiece all week long and return the following week as old pros. I tried for hours a day, and could never get it to make any but an air sound. It seemed particularly absurd because I'd always been good at blowing sounds in bottles, in acorn tops and chapstick lids, could blow a ram's horn and conch shell. Even our play air rifle could produce some good sounds. My difficulties with the flute's separated mouthpiece became so frustrating that I decided to move along. I knew how to read music from playing piano, and had easily picked up the recorder, so I started making some nearly silent finger tap music, since I found that, unlike with a recorder, when you pressed on the flute's keys they made a tiny version of the sound the flute would make if using those keys while blowing in it. I dragged out my music books and simply used the same fingering as with a recorder, even though I knew I'd had a B recorder -- until my brother busted it over my head -- and this was a C flute (or vise versa), but close enough. When I got to my lesson the next week, I still couldn't get the mouthpiece to do anything, but I could finger play a lot of Beatles songs, and a few classical pieces like Clair de Lune and Fur Elise, low and tiny, as if for mice. For 2 weeks, as the rest of the class struggled to learn to read music, and played Mary Had a Little Lamb with actual blown air and simple fingering, I continued my useless attempts to get my mouthpiece to perform, while becoming proficient with the fingering and the teeny ghost music. The night before my third lesson l decided maybe the flute needed a good cleaning, one beyond what its simple furry brush could supply. I can't explain this next part, because it's not like I was 5 years old, I was in 7th grade. In fact, hmm, maybe I was high, because that was the year I started smoking pot and that could explain it. I mean how would the inside of the flute even be dirty, since I wasn't blowing into it? Still, I knew what needed to be done, so I dampened a wad of toilet paper, wrapped it around the furry brush and gave the inside of that flute a good cleaning. Then I pulled out the brush... which came out minus the toilet paper that was by then a wet shredded mess, jammed into every part of the flute, clogged inside the keys. In those days, 1967, mononucleosis was the thing. We'd just begun kissing, and it was referred to as The Kissing Disease (how quaint!), kind of a rite of passage. When someone didn't show up at school, week after week, it was always whispered that they had mono. And so that's what I‘d have, since no amount of sticking the flute in the heater vent seemed to be helping. It actually got worse as the toilet paper dried. I told my friends to tell the music teacher I had mono, so I just had to make sure not to venture anywhere near the music room. I thought that would give me enough time to remedy the situation, but I never could, and all attempts made everything worse; the green felt pads were, by then, destroyed. In the end I had to tell my parents what was going on, which not only got me grounded, but I had to work off the cost of the flute. When I finally returned to class with my tail between my legs and showed the teacher the mess I'd made, he laughed, and said it was pretty clear on day one that I was never going to play the flute. He praised my diligence for the fingering mouse music, and told me I have clarinet lips. My adventure with the clarinet didn't happen for another 15 years, but that's a tale for another day. That one ended better for the clarinet than for me. ",
            "date": "Answered January 27, 2019",
            "views": "137",
            "upvotes": " View 349 Upvoters",
            "upvoters": [
                {
                    "user_id": "Luis Gallardo",
                    "user_href": "/profile/Luis-Gallardo-31"
                },
                {
                    "user_id": "John Tomczyk",
                    "user_href": "/profile/John-Tomczyk-5"
                },
                {
                    "user_id": "Harrison Boyle",
                    "user_href": "/profile/Harrison-Boyle"
                },
                {
                    "user_id": "Glen Gerhard",
                    "user_href": "/profile/Glen-Gerhard"
                },
                {
                    "user_id": "Sara Zivkovic",
                    "user_href": "/profile/Sara-Zivkovic-3"
                },
                {
                    "user_id": "Betty Lei",
                    "user_href": "/profile/Betty-Lei-2"
                },
                {
                    "user_id": "Isabela Castillo",
                    "user_href": "/profile/Isabela-Castillo-7"
                },
                {
                    "user_id": "Jim Ghivizzani",
                    "user_href": "/profile/Jim-Ghivizzani"
                },
                {
                    "user_id": "Dianne Bird",
                    "user_href": "/profile/Dianne-Bird"
                },
                {
                    "user_id": "M. A. Steinberger",
                    "user_href": "/profile/M-A-Steinberger"
                }
            ]
        }
    ]
}