{
    "title": "Why do you think K-pop stans get a bad rep and do they deserve it? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Steve Miles",
                "href": "/profile/Steve-Miles-74"
            },
            "answer_text": "Fandoms that are female dominated gets hated on and belittled. Every single one of them. Hilarious almost, how nowadays plenty grown men will puff their chest and say The Beatles are the only good band when they were indeed a teen crazed boy band pretty similar to all the kpop groups. Kpop fandoms are still overwhelmingly female. They buy more and attend more shows. This is simply statistics. So they will get a bad rep just for that already. Women and girls being enthusiastic about anything is immediately seen as obsessive and crazy. I can't quite explain to you why, since I think plenty of guys have a Posterwall of their favorite Sportsplayers and somehow that's not crazy. Secondly, we all have to admit some fans are really out of hand. Stalkers, violence, fights, these all occur. Again, hooligans exist in sports and that's somehow okay but I digress. It's hard for people to relate to a passion that they don't have. Seeing young people bend backwards twice just to buy a cardboard piece with a photo printed on it or insulting each other just for clicks, if taken out of context then it surely has to seem bad. But as with sports fans, there are the terrible ones and the ones that just have nothing but love. Either way, unrelated people will feel weirded out by it because they're too narrow minded to see how kpop can be someone's passion. ",
            "date": "Answered January 12, 2020",
            "views": "69",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kazumi Hatake",
                    "user_href": "/profile/Kazumi-Hatake"
                },
                {
                    "user_id": "Stan Loona",
                    "user_href": "/profile/Stan-Loona-158"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emmanuel Smith",
                "href": "/profile/Emmanuel-Smith-93"
            },
            "answer_text": "The delulus (short for delusionals) And the crazy fans. My answer on this is No. In band, our conductor used to say that “,A band is only as good as it's worst player\". This sentence applies to any groups in general, not just music. A group's reputation is only as good as the reputation craziest, most vile, terrible member of that group. Since BTS has over 20 million fans just on INSRAGRAM, which is crazy because barely any of their fanbase has that app, that says something about the magnitude of korean music. And they're just one group of artists in the korean music industry. Since Latin music artists and other musics don't even come close to the magnitude of fans of their language musics, and Americans tend to think anything in English is superjor because they're *American* and *America* is great and even if they're in a foreign country they'll call the citizens foreigners when they are the foreigner- I'm getting off track (I'm American and proud but ashamed of my stupid people). But because of that, I'm assuming that there's WAY more bad eggs in the group of Kpop fans than any other musics, like Latin or Apop (American Pop) fans. Due to Americans thinking they're better than everyone else and thinking they're more popular as well, they assume Kpop fanbases are VERY small and composed of ALL the BAD EGGS that they see on the internet, usually Instagram and usually delulus or solo stans, saesaengs and stalkers, or fans like the many crazy fans of 1D (a good group, sadly, as an Directioner, the MAJORITY of their old fanbase was actual crap in the day) or similar groups. It's really sad that the loudest people are the only ones that get heard. ",
            "date": "Answered January 11, 2020",
            "views": "87",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kazumi Hatake",
                    "user_href": "/profile/Kazumi-Hatake"
                },
                {
                    "user_id": "Himadri Panwar",
                    "user_href": "/profile/Himadri-Panwar-2"
                }
            ]
        }
    ]
}