{
    "title": "Why do DJs make so much money? - Quora",
    "tags": [
        "Disc Jockeys"
    ],
    "response": [
        {
            "author_info": {
                "name": "Trebor Clarke",
                "href": "/profile/Trebor-Clarke"
            },
            "answer_text": "As earlier answers suggest the top few percent make big money. The rest of us I would suggest are experiencing and industry where wages are going down or remaining static. There are a few reasons for this. In the good old days, 20 years ago, I was paid an hourly rate, the amount isn’t important… but it was good money by today’s standards. Dj’s were pretty rare and Vynil records cost a lot of money to buy, a12″ inch import could set you back as much as £10 even as long as 20 years ago. So there was a small pool of people actually djing. Most who broke into clubs were pretty good but the raw material eg records were expensive therefore wages were pretty good. Fast forward to the 21st Century and the cost of music has come down considerably. Assuming you pay for your music as little a 99 pence a track. Big difference from £10! The other problem is digital djing. I don’t knock it I use it myself… it’s far easier to carry a pen drive with music than record bags…. The problem in a nutshell is you can learn to Dj in 5 minutes with software or the sync button. This ease of learning doesn’t filter out the ones who are not very good… in the days of Vynil it took months if not years before you could play in a club or bar and by process of natural selection people who weren’t very good fell by the wayside. So as a consequence, the not very good. In an attempt to get a paying gig will often offer to work for free or play in return for drinks. Which in turn is preventing the dj’s who are good from earning a living wage. In central London right now… if you were starting out as a new Dj you would be lucky if you received £100 for a 7hour set. At the turn of the century a 6 hour set would pay you anything from £120 to £250. There is no DJ union that I know of so this is a position that is unlikely to change. Wannabes are destroying the industry. I consider it a privilege to play in any venue, the fact I’m paid to do it is a bonus, I’m lucky in that I have a full time job that pays well… however, when you look at the cost of transport, parking, food and purchasing equipment and music. There really isn’t much left from the money that we are paid. We can stop this. Stop illegal downloads of music. Stop playing for free or offering to play for drinks… even you want to be dj’s… just don’t do it. If your going to be in the industry earn your right to be here like all of us had to. We formed a union or organisation that campaigned for better conditions. Trust me 6 hours on your feet with no toilet fag or food Break is not for everyone. I will get off my soap box now ",
            "date": "Answered December 19, 2017",
            "views": "31",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Drew Smith",
                    "user_href": "/profile/Drew-Smith-511"
                },
                {
                    "user_id": "Ben Yetton",
                    "user_href": "/profile/Ben-Yetton"
                },
                {
                    "user_id": "Christine Kenanda",
                    "user_href": "/profile/Christine-Kenanda"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christian Dechery",
                "href": "/profile/Christian-Dechery"
            },
            "answer_text": "Wait, what? Which DJs are you talking about here? The top 0,0001%? Yes, they make money, and it is no different from any other entertainer, they fill up venues and generate revenues for producers and promoters. Why shouldn't they get big bucks? But this question is waaaaaaaaaaaaaaaaay off considering the activity of DJing as a whole (even if you consider only professional DJs). I personally know about 100 DJs (about half of them really good) who cannot even makes end meet, and all of them have other jobs to support themselves. It is very very very common for DJs not getting paid at all to play at parties or festivals. I suggest you change your question because it is assuming something incredibly false. ",
            "date": "Answered April 29, 2014",
            "views": "23",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Apollon",
                    "user_href": "/profile/Michael-Apollon-3"
                },
                {
                    "user_id": "L D",
                    "user_href": "/profile/L-D-321"
                },
                {
                    "user_id": "Jake McNamara",
                    "user_href": "/profile/Jake-McNamara-6"
                }
            ]
        }
    ]
}