{
    "title": "Why do people hate video games for no reason? - Quora",
    "tags": [
        "Playing Video Games",
        "Video Game Industry",
        "Hate",
        "Games",
        "Video Games",
        "Understanding Human Behavior",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alessandro Carbonin",
                "href": "/profile/Alessandro-Carbonin"
            },
            "answer_text": "As for any other question about hate that involves the words “for no reason” attached to it, the answer is only one: ignorance. Those who hate something and can’t give you a logic reason behind their hate never took the time to research the subject of their hate and form an autonomous opinion on it, but most likely just follow the “hate train” started by someone who’s just as ignorant on the subject as them, or has ulterior motives to publicize their hate (most of the time financial ones). That’s when you’ll see slogans pushed like gospel that state facts that have been numerous times disproven by scientific research, like “video games are a waste of time”. This particular claim has been subject to scientific studies, and have turned out to be not only false, but the opposite of the scientific fact: playing video games keep the brain active, improve reflexes and help stimulate logical thinking ( The Good, Bad, and Ugly of Video Games ).In the end videogames, like everything else, has pros and cons, and like everything else has to be used responsibly. A kid can become aggressive and violent playing violent video games, but that’s why ESRB, PEGI, and all other rating agencies put age restrictions on videogames and basically all media. If you’re a waste of air as a parent and let your 10 years old play Doom, it’s your fault at that point, not the video game’s one. But a kid can also be playing on a swing, fall and split his skull open, yet I never heard anyone organize protests and hating on swings. Why? Because people know swings, know how they work and what are the risks of their use. But they don’t know video games, and it’s way easier to hate than to try and understand them. ",
            "date": "Answered October 18, 2020",
            "views": "85",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Matt Jackson",
                    "user_href": "/profile/Matt-Jackson-280"
                },
                {
                    "user_id": "Alberto Josef Guerrero",
                    "user_href": "/profile/Alberto-Josef-Guerrero"
                },
                {
                    "user_id": "Roman Camp",
                    "user_href": "/profile/Roman-Camp-1"
                },
                {
                    "user_id": "Ash Summers",
                    "user_href": "/profile/Ash-Summers"
                },
                {
                    "user_id": "Aidan Bishop",
                    "user_href": "/profile/Aidan-Bishop-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ru Nacken",
                "href": "/profile/Ru-Nacken"
            },
            "answer_text": "This question in unanswerable. You are asking what the reason is for hating video games that is not a reason. What people are you talking about specifically? People who are afraid that it'll turn kids into violent monsters? Or people who hate consoles because they are pc users? Or what? ",
            "date": "Answered October 18, 2020",
            "views": "66",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tony Paeno",
                    "user_href": "/profile/Tony-Paeno"
                },
                {
                    "user_id": "John Efekodo",
                    "user_href": "/profile/John-Efekodo"
                }
            ]
        }
    ]
}