{
    "title": "Why is the sound so bad at live concerts? - Quora",
    "tags": [
        "Live Music",
        "Concerts",
        "Sound"
    ],
    "response": [
        {
            "author_info": {
                "name": "Derik Henderson",
                "href": "/profile/Derik-Henderson"
            },
            "answer_text": "I just now found this question, so pardon my tardiness. Why is the sound so bad at live concerts? A lot of great answers, but here is my take. The sound of concerts became horrible sounding when the kick drum or bass sound became the focused part of the show. No longer is the clarity and quality of the vocals the main priority. An easy way to understand this is picturing a modern mixing board. Let’s say it’s a decent 32 channel board with many pages for opening bands or artist. Each channel controls a certain microphone or input from an instrument/amplifier. Take a look at it, what would you most likely see? Channel number one should be labeled for the main vocals, but I could bet you it’s not. It’s labeled “kick drum”. Everything else on that board follows in importance to mixing the show. Vocals should be number one. It should be the main point of going to a concert, to see your favorite artist/band perform. Unfortunately, what we have is bass on steroids killing the clarity of everything else on stage. Smeared, harsh, distorted, bottom heavy, and just a total dog turd (yes I’m being so scientific with that one) are the usual response from concert goers. It’s not cool, it’s not hip, it just sucks. I’m am so tired of going to concerts and being utterly depressed by the sound quality. It doesn’t matter if it’s hip hop, hard rock, heavy metal, or any genre of music that is taxing on speaker systems, will you sound engineers please lay off the damn bass? I want midbass punch in the chest, not my ears bleeding from being stabbed over and over from a piss poor excuse of a sound engineer. And please don’t cry about, oh it’s the venue that’s not designed for a good sound. With today’s amazing sound processing and amazing speaker driver elements, there is no excuse to make any building or outdoor area sound great. It’s the job of the sound engineer to use what they have at hand and make it work. Otherwise they are just wasting the advancements in modern concert systems. My last rant, if you please, stop the marketing insanity from pro audio equipment manufacturers. Stop building speaker systems that need a massive amount of processing to sound good. Go back to the ole drawing and start engineering speaker systems that sound great with minimal processing. Like, I don’t know, horn speaker systems. Yes they are big and bulky, but they sound good. 250,000 concert attendees never complained about a small horn system and just 30,000 watts to power it all. Everyone could hear just fine, and no one complained that it was harsh or distorted or smeared sounding. That was called Woodstock. ",
            "date": "Answered August 22, 2018",
            "views": "979",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Daniel Ball",
                    "user_href": "/profile/Daniel-Ball-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nick du Plessis",
                "href": "/profile/Nick-du-Plessis"
            },
            "answer_text": "There are a ton of contributing factors. I’m assuming that amplification is being used. This is true for most non-classical and non-jazz events, but if you are wondering about bad sound in a natural acoustic environment, that calls for an answer that is at least twice as long. The mixing board is located in a bad place, which causes the lead sound person to make incorrect assumptions about what sounds good to the hall at large. Modern mixing boards have a slick tablet interface, which means that the mix can be adjusted while walking around the hall. If I have a choice, I try to spend at least part of a concert standing right next to the board - at least I’ll hear what is optimal according to what the sound person who is listening at that location thinks. Monitors are inadequate or other issue with the performers hearing themselves. Sometimes the monitor mix is skewed. Sometimes the communication between the stage and sound person is bad, resulting in grumbling and playing louder or deferring to the marquee performer as an improvised solution. Faulty approach. Assuming a good PA system, there’s no need for a row of overdriven Marshall stacks on stage. Run a line out of the guitar amp to the mixer or mic the amp, have a backup plan, and let the sound person handle it. Too much “rock and roll attitude” when it comes to volume levels. At some point, sound waves don’t have a chance to die out or go anywhere, so all you get is a mush of overtone-laden noise. I realize this comes with the territory sometimes. Sub-optimal performance space. It might be a great place to park airplanes, but not such a great place for live music. Poorly mic’d drums. I’m no expert in the dark art of mic’ing drums for recording or performance. Few people are, which is why records today sound the way they do, with too-perfect, spliced-together drum tracks. Anyway, sometimes sound techs get lazy and don’t set up as many mics as they should. Or the mixer has a small number of channels. Smaller rock venues are notorious for being cheap. Or, there’s some insistence that the wrong mic for the job is really the right mic - so you end up with a poor snare sound, a poor bass sound, and a bunch of noise from the guitarist bleeding into every open mic. Poor mic technique by singers. I realize that sometimes singers can’t hear themselves (see the item about monitors.) But I often notice an inappropriate closeness between the mouth and the mic when the singer is vocalizing at a strong dynamic level. The result is pitch-challenged and distorted. Fortunately, not everyone cares about sound quality. Adrenaline, attitude, and energy are typically just as high, if not higher, on the list of music fans’ priorities. But a good system in a good space that is conscientiously run by a good crew can make a special night even better. ",
            "date": "Updated January 4, 2018",
            "views": "34",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ja Xerxes",
                    "user_href": "/profile/Ja-Xerxes"
                },
                {
                    "user_id": "Jason Jackson",
                    "user_href": "/profile/Jason-Jackson-121"
                },
                {
                    "user_id": "Michael Koeberg",
                    "user_href": "/profile/Michael-Koeberg"
                }
            ]
        }
    ]
}