{
    "title": "Why do I feel like crying, when I'm alone, for no particular reason? - Quora",
    "tags": [
        "Loneliness vs. Solitude",
        "Mental Health Advice",
        "Cognitive Psychology",
        "Solitude",
        "Crying",
        "Loneliness",
        "Mental Health",
        "Emotions",
        "Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lydia Dotres Lerner",
                "href": "/profile/Lydia-Dotres-Lerner"
            },
            "answer_text": "You might be lonely. You may not process it as that but your visceral reaction tells you something is missing or making you sad, particularly or only when you are alone. Maybe you know the reason but acknowledging it will result in cognitive dissonance. You don’t want to accept the reason, whatever it is. We try to bury sadness. The best thing you can do is go out and be around people and see if that helps. If you moved to a new area make friends or join an exercise class or a friendly gym where people smile and say hello. You might just be depressed about a circumstance, unhappy with your career or sometimes we aren’t sure if we should proceed with a new relationship or hold off. There are no real answers to the human condition but sometimes our own minds are our worst enemies. Try not to overthink and find something to do, some activity that you enjoy that will distract you. Unfortunately or fortunately, depending upon your serotonin levels, if you see a psychologist most likely they’ll give you an anti-depressant as first line of defense. Sometimes it’s nothing to do with chemical imbalances, it could be a disappointment of some kind or totally situational. Your boss tortured you in some hurtful way. You may be mourning a loss of a job or a relationship or second guessing yourself. Things have a way of revealing themselves. Your body is talking to you and your mind will catch up soon. By the way I am not telling you NOT to see a psychologist. Everything takes time. Sometimes you may need anti-depressants. Some people like cognitive therapy where you just try to change your thinking. Usually these folks are not extremely depressed and don’t feel hopeless; they want a simple solution. Others like to dig into parental relationships and try to figure themselves out. It’s very hard to be totally objective about yourself under the best circumstances, when you are sad, it’s harder still. When I’ve been sad it’s because I’m disappointed in myself or others whether it is work related or personal. I’m sad that I’ve had friends that have died too young and I miss them. Friends I’ve known most of my life. However I’ve moved and made new friends but there’s nothing like the friends that you knew when you were young. They know you to the core. New friends won’t replace those who have gone but if they make me laugh and I like them it makes me happy to meet new people that are genuinely good people. New relationships can also be fun particularly at the start when you view new people with rose colored glasses. Sometimes this can lead to disappointment or a long lasting relationship based on trust and people who have each others’ backs through thick and thin, but sometimes things can turn really sour and it’s best to move on. A sour mate is no fun but stand by them if they are going through a hard time. Then you might be able to remain friends. You are sad about something and like others have said, you’ll figure that out soon. We all feel that way for a time because we’re human. Just go out and be around people and smile. It will help. Things will improve just get out of your own head a bit and get a change of scenery. Over thinking can be bad for your health! I like getting out of my place or going away in winter and I ALWAYS seem to feel better. Most of us if not all of us, have had some sad times. Some days are better than others. The winter is hard too because it’s colder and gets dark early. Good time to read a good book or go to a movie. It’s very common for people to see movies alone these days, no different watching TV alone or Netflix alone but it provides a change of scenery and laughing with others or being scared together if the movie is a thriller. I’ve had a tumultuous year myself. Things are improving. There is a light at the end of the tunnel but you won’t necessarily find it sitting at home alone. Humans need to be around other people. We are social animals. Even extremely anti-social types get bored with themselves even though they may blame others for their boredom. Let’s face it, we are complex beings! It might help you to join a support group for depression. If you have health insurance, check with your plan. Some sponsor support groups. I know that Kaiser does but they aren’t in many states. It may help to see that you are not alone and there are some very accomplished people that do not even seem depressed. Perhaps it’s because they are around others going through some tough times as well and are happy to find some compassionate people. ",
            "date": "Updated June 18, 2018",
            "views": "256",
            "upvotes": " View 31 Upvoters",
            "upvoters": [
                {
                    "user_id": "BeautybyMartikaa BeautybyMartikaa",
                    "user_href": "/profile/BeautybyMartikaa-BeautybyMartikaa"
                },
                {
                    "user_id": "Alyssa Cooper",
                    "user_href": "/profile/Alyssa-Cooper-75"
                },
                {
                    "user_id": "Arpit Das",
                    "user_href": "/profile/Arpit-Das-38"
                },
                {
                    "user_id": "Makiya Harris",
                    "user_href": "/profile/Makiya-Harris"
                },
                {
                    "user_id": "Johanne Sotingco",
                    "user_href": "/profile/Johanne-Sotingco"
                },
                {
                    "user_id": "K.hyn",
                    "user_href": "/profile/K-hyn"
                },
                {
                    "user_id": "Simran Santosh Kadam",
                    "user_href": "/profile/Simran-Santosh-Kadam"
                },
                {
                    "user_id": "James Paterson",
                    "user_href": "/profile/James-Paterson-15"
                },
                {
                    "user_id": "Maame Adwoa",
                    "user_href": "/profile/Maame-Adwoa-20"
                },
                {
                    "user_id": "Vishnu Prabhu",
                    "user_href": "/profile/Vishnu-Prabhu-62"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fahad Israr",
                "href": "/profile/Fahad-Israr"
            },
            "answer_text": "Here is Why You Cry for No Reason Feeling a range of emotions is a natural part of the human experience. From happiness to anger to sadness, emotions are your mind's way of responding to life's events, and on their own, they're perfectly healthy. Even anger has its place, and while many people show inappropriate anger, there are times when anger is necessary and justified. All emotions play a role in your wellbeing. But when you start to feel like you need to cry for what feels like no reason, it may be a sign that you're suffering from anxiety. Why Anxiety Can Make You Cry Anxiety can be an overwhelming condition - more than people realize. There are millions of people living with anxiety disorders that are able to handle themselves every day. These people often feel like, while their anxiety is affecting their life, it's still manageable. But the more a person struggles with anxiety, the harder it may be to manage those emotions. Anxiety puts the body under tremendous stress, and it takes energy and resources to reduce that anxiety. Anxiety can be powerful - so powerful that the stress of it is essentially providing your body with a non-stop barrage of physical and mental symptoms. Symptoms don’t always generate further emotions, but they are wearing and reduce the ability to cope and tolerate the experience. Anxiety Can Cause Mild to Severe Depression Anxiety, while a separate disorder, can affect your social life, your work life, and your ability to find joy in activities. It also puts a great deal of stress on your mind and body. Anxiety may reduce your involvement in activities that would usually give you pleasure and fulfilment. If this continues over time this can lead to feelings of depression.in -&nbspThis website is for sale! -&nbspDepression Resources and Information. fact, depression is often a comorbid diagnosis with anxiety, and in many cases, the anxiety comes first and contributes to the development of depression. Anxiety may not necessarily cause long lasting depression, but the stress on your brain and the feeling of constant fear and fatigue can often lead to temporary feelings of low mood, and thus crying. From Crying to Apathy In a way, it's almost advantageous that you're able to cry. Crying is actually a natural stress reliever. When you cry, you're letting out emotions. By triggering a crying reaction, you may be helping to reduce your stress levels. There are those that may struggle with other emotions. Some people's anxiety is so strong it leads to emotional numbing - or the inability to feel emotions. These people may cry less, but they also are unable to experience any happiness or joy. They generally experience one constant feeling of negativity each and every day, shutting themselves off from all emotions. As they have become so used to blocking out emotions, when something tips them over their emotional threshold and they cry, it may feel like it has come from \"nowhere”. Crying During Anxiety Attacks It's also not uncommon to feel like crying before, during, or after an anxiety attack. Anxiety attacks are single moments of overwhelming fear and panic. Many people feel impending doom, as though they are about to die. As a result, they respond by crying, because that's a natural response to a feeling of intense dread along with the physiological reaction that occurs during a panic episode. After an anxiety attack is over, others may find themselves still experiencing these intense emotions, often about the helplessness they felt during the attack. Panic attacks are so intense, that when they're over a feeling of needing to cry is natural and expected. Not everyone cries after anxiety attacks, but the intensity makes it natural to feel like crying. Why Do I Cry So Much? It's one thing to feel the need to cry after a particularly hard day. But some people feel that they need to randomly cry, and others are shocked at how uncontrollable their tears are. It is as though a waterfall is coming from their eyes, sometimes at \"surprising\" times. That instinct is often just emotion that is trying to find its way out. Anxiety is excitatory to the body - it activates your fight or flight system. Your desire to cry may be related to the way your body is reacting to that system, where the intense emotions and stress during that time overwhelm the body.. Fear is scary, and your \"flight\" mode may be triggering your body to produce large amounts of tears as a way to let out that stress. For some crying may also become a habitual response. Once you become used to crying as a way to relieve anxiety stress, you may develop a habit of crying when you experience that stress in the future because it provides emotional relief. Physiology of Crying - a Self Soothing Behavior? Why do we cry? Scientists are not entirely sure why we cry. In an area near your eye is the lacrimal system. One part of the system creates tears. The other part lets the tears free by draining the liquid near the eye. These tears keep your eyes hydrated when you blink. They also cover your eyes during allergies. But what we are most interested in is why strong emotions release tears (known as psychic tears), and surprisingly scientists are still not entirely sure. There are some signs that indicate that tears are meant to play a role in stress relief. For example, when you cry, your tears release leucine enkephalin, a natural painkiller. Other researchers have looked at whether or not crying is a self-soothing behavior capable of cooling the body temperature and triggering coping mechanisms. If you are interested in a long, complex read about the self-soothing nature of crying, the following research paper is quite interesting. Is crying a self-soothing behavior? So the truth is that we do not entirely know why we cry exactly, but we know that there are many potential signs that crying is simply a great way to cope with significant emotion. And when a person has anxiety, crying may be a much needed coping response. But I Just Want to Cry! It is important for us to point out that there is nothing wrong with crying. It is not a weakness nor a flaw. When we discuss how to \"control\" and \"prevent\" crying for those that have anxiety, we are not implying that you should hold it all back. Indeed, to treat your need to cry, you need to… Let Yourself Cry Many people wonder how to stop themselves from feeling like they need to cry. But the reality is that you shouldn't - if you need to cry, you should cry. This may go against your instinct, but one of the issues that leads to more intense anxiety is holding back your emotions. There are two reasons for this: Your emotions are your body's natural coping mechanism. While it's true that some emotions can feel as though they are irrational, when the feeling is there it's usually because your body needs to do it to feel better. Crying will almost always help.Holding back emotions also takes energy. You have to focus your energy specifically on trying not to cry, which means that you are forced to dwell on the way you feel for longer, which only serves to increase stress and anxiety.When you feel like you need to cry for no apparent reason, then the crying itself can be judged as irrational. But that doesn't mean you don't still need to cry. If your body is telling you to cry, then allowing yourself to cry is better for your stress coping than trying to prevent it. Preventing the Crying Feeling Remember - you shouldn't stop yourself from crying. Cry as much as you need to, so that you can let out the feeling of needing to cry. Whether you need to randomly cry, or you are struggling with anxiety and another condition (such as loss, grief, PMS, pain, etc.), or you are so overwhelmed with anxiety the tears just flow out, you should still let yourself cry for as long as you need to. In order to \"stop\" crying, you have to take action before the urge to cry occurs. The only way to prevent the crying feeling from anxiety and stress is with anxiety prevention. You need to control the extent of your anxiety and how you react to it emotionally. Then you'll be able to reduce the way your mind responds emotionally. Thanks: Alexandra Richards,PhD,Clinical psychology. Micah Abraham,Bsc,Psychology. ",
            "date": "Answered September 16, 2018",
            "views": "664",
            "upvotes": " View 79 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Devasheesh Mishra",
                    "user_href": "/profile/Devasheesh-Mishra"
                },
                {
                    "user_id": "Disha Paithankar",
                    "user_href": "/profile/Disha-Paithankar-2"
                },
                {
                    "user_id": "Ann Arnott",
                    "user_href": "/profile/Ann-Arnott-3"
                },
                {
                    "user_id": "Shradha Tewari",
                    "user_href": "/profile/Shradha-Tewari"
                },
                {
                    "user_id": "Priyanka Uppar",
                    "user_href": "/profile/Priyanka-Uppar"
                },
                {
                    "user_id": "Vilas Dhunde",
                    "user_href": "/profile/Vilas-Dhunde"
                },
                {
                    "user_id": "Alyssa Cooper",
                    "user_href": "/profile/Alyssa-Cooper-75"
                },
                {
                    "user_id": "Maria Echica",
                    "user_href": "/profile/Maria-Echica"
                },
                {
                    "user_id": "Arpit Das",
                    "user_href": "/profile/Arpit-Das-38"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/STREAM-ON-BY-BTS"
                }
            ]
        }
    ]
}