{
    "title": "Why are Tony Kakkar song lyrics so disgusting? - Quora",
    "tags": [
        "Indian Music",
        "Bollywood Music",
        "Song Meanings",
        "Song Lyrics",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Malkeet Singh",
                "href": "/profile/Malkeet-Singh-106"
            },
            "answer_text": "Because he has no talent, skills to write and even sing. Money does everything. Put some flashy things in the music videos, cars, 2 peiece girls, some tik tok stars and you got the hit song. Actually it’s not that his songs are bad. Actually the young audience has no fucking clue what is real music. So these 3rd class songs are in demand nowadays. So singer does what public likes. In today’s world none of the singer is interested to create something new. All they do is just copying the proven model. They are fucking super afraid to try new things because in the end they are not in the game to make good music, instead they are in the game just to earn money and fame. That’s it. Check the lyrics of his song. Dheeme dheema. Kudi toh chocolate late hai late hai. Coca cola tu. What the fuck is this, Making 3rd class, non sense music is new trend, because is current audience are asshole. They have fucking no clue about anything. This is new normal. ",
            "date": "Answered September 24, 2020",
            "views": "102",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Devesh Raj",
                    "user_href": "/profile/Devesh-Raj-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kim Jisoo",
                "href": "/profile/Kim-Jisoo-139"
            },
            "answer_text": "I honestly don't know what he thinks while releasing senseless songs with cringy lyrics. I think it's mainly because the repeated, addictive beats he uses works well with the general public and youth. Therefore people don't usually pay much attention to the lyrics cause they love his beats and maybe, composition. I'll give you examples of his lyrics with meanings: Na Samajh Tu Coca ColaDon’t think of me as Coca-ColaMain Toh Whiskey Di BotalI am a bottle of WhiskeyMera Ek Sip Hi Hai KaafiOnly one sip of mine is enoughHone Ko Na Shot Ho TalTo become totally intoxicatedChakhna Mana Hai, Rukna Mana HaiIt is forbidden to taste, it is forbidden to stopMujhe Peele Zara Aa TuCome and just drink me . . . June ki garmi bhi tujhse kaam hai Even the summer of June seems cooler than you Teri hotness number one hai Your hotness is number one Tujhko jo chhu le jal ke khatam hai Whoever touches you would burn and die Tam hai.. tam hai.. tam hai Bachega bachega kaise bachega How’d someone survive from you? Karega karega kuch bhi karega I’d do anything Tujhko to pakka chhu ke marega I’ll definitely touch you and then die Jawani teri karti shikaar hai Your youth hunts guys Jawani teri karti shikaar hai Your youth hunts guys Chabbish tarikh se chadeya bukhar hai Your fever has overtaken me since 26th of this month Jawani teri bijli ki taar ae Your youth is an electric wire . . . Thandi thandi beer piyenge dono photo kheech ke We'll drink cold beer and click photos Goa wale beach pe, rani aankhen meech ke We'll wink our eyes on the beach of Goa Thandi thandi beer piyenge dono photo kheech ke We'll drink cold beer and click photos . . . I mean, I know that this is a free country and we have freedom of speech but still!!!!! Writing lyrics depends on you but even while writing such lyrics, one should keep in mind that young children and youth gets easily influenced by such lyrics. Now that I think from his perspective, it's not really his fault. He is getting money and fame from these songs so he'll definitely keep making music that works for him. What I actually feel bad about is that these autotune people get more recognition rather than actually talented artists. It actually depends on us whether to like his cringy lyrics or not. It also depends upon us whether we get influenced by such people or not. Regards❤️. ",
            "date": "Answered September 29, 2020",
            "views": "226",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aditya Singh",
                    "user_href": "/profile/Aditya-Singh-8778"
                },
                {
                    "user_id": "Aditya Singh",
                    "user_href": "/profile/Aditya-Singh-2102"
                },
                {
                    "user_id": "Arjun Khatri",
                    "user_href": "/profile/Arjun-Khatri-12"
                },
                {
                    "user_id": "Lily Hawthorne",
                    "user_href": "/profile/Lily-Hawthorne-6"
                },
                {
                    "user_id": "Shubhendra Singh",
                    "user_href": "/profile/Shubhendra-Singh-99"
                },
                {
                    "user_id": "Sania Khan",
                    "user_href": "/profile/Sania-Khan-578"
                },
                {
                    "user_id": "Catherine Teresa",
                    "user_href": "/profile/Catherine-Teresa-7"
                }
            ]
        }
    ]
}