{
    "title": "Why do some artists release new music by surprise while some make announcements well in advance? - Quora",
    "tags": [
        "New Music",
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hervé Maas",
                "href": "/profile/Hervé-Maas-4"
            },
            "answer_text": "Well, it depends upon what kind of releases you mean. If you were more specific by who you mean, I could give you a better answer. But, the answers given here already pretty much explain it from a marketing standpoint. But really, if you dig a little, you can find out an upcoming releases “proposed” date. I will offer another reason that’s more true today than it’s ever been. Most artists don’t make money off their releases. Even ones by extremely popular artists. This has to do with the amount of promotion the label they’re signed to has provided. In most major label contracts, promotional costs and lots of other little goodies, are the financial responsibility of the artist. On small D.I.Y. labels it’s the opposite, but the smaller ones sometimes offer little if any promotion. So you can see how your question can have many different answers. But for both, the main source of income is tied up in merch, you know, those t-shirts, stickers, and posters you see at live shows or even on the web. So, it can be advantageous to have a ‘secret’ release that’ s only available during tour or only through the artist directly (or near directly) The only way a fan can get it is going to the show itself or buying it a later date from someone who flips it at a higher price on the internet. These tend to be self-released recordings that avoid direct problems with the label. They tend to be released in small quantities. Later they will either become a well-sought after release or get re-released by the very label that the group is signed to. Usually, including a small difference (like track listing, cover artwork, vinyl color) than the original pressing. I hope this helps a little. Take care. ",
            "date": "Answered September 14, 2018",
            "views": "91",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tony Thompson",
                    "user_href": "/profile/Tony-Thompson-44"
                },
                {
                    "user_id": "Aubrey Peele",
                    "user_href": "/profile/Aubrey-Peele"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ted Boucher",
                "href": "/profile/Ted-Boucher"
            },
            "answer_text": "Others make good points. It's about marketing, at least sort of. And usually, \"surprise\" isn't what it's about. The thing is, when music is released, the prince and princess don't just step out onto the balcony, open the cage, and let it fly to all the corners of the kingdom. Somebody has to sit down, work up a marketing and distribution plan, put together a timeline and schedule, hire everyone that's needed to make it work, and, most important. get the money to pay for it all. (they also have to coordinate this stuff with the tour, because that's really what it's all about) All this stuff costs a lot, often as much, or more than recording the music in the first place. Some artist have the \"support\" for this, others don't. And sometimes, the support was \"reassigned to other projects\" (this is a phrase used in the industry that means \"you're getting stiffed\"). So what seems like a \"surprise\" release is really just a release that didn't get marketing support, for whatever reason. ",
            "date": "Answered September 22, 2018",
            "views": "42",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Aubrey Peele",
                    "user_href": "/profile/Aubrey-Peele"
                }
            ]
        }
    ]
}