{
    "title": "Why is everyone so in love with Arijit Singh? - Quora",
    "tags": [
        "Arijit Singh (singer)",
        "Indian Singers and Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "AJ Styles",
                "href": "/profile/AJ-Styles-71"
            },
            "answer_text": "Ok,Why everyone loves Arijit Singh… Here are some keypoints:- (Sorry for my bad english) He has mesmerizing voice.His voice texture is unique.His voice is unique.Most importantly,he is verstaile. He can sing song like Sajde(Kill Dill) as well as he can sing Palat(Hero)…He can sing Phir le aaya as well as Tum hi ho..etc,etc….His voice,the lyric of songs are of great quality. Lyric of most of his songs are pretty good,you can feel the lyrics,it directly touches the heart of listener.Most of people from the industry always praised him as a great singer as well as a great person too.He behaves well with his fans.He is still a man to earth,even being a #1 singer of India(Bollywood Industry).Overall,he is complete musician. He believes in hardwork. He ia versatile. His voice touches heart directly. He is a good man. ",
            "date": "Answered August 20, 2018",
            "views": "485",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Saurav Jha",
                    "user_href": "/profile/Saurav-Jha-324"
                },
                {
                    "user_id": "Liton Roy",
                    "user_href": "/profile/Liton-Roy-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mindd Itt",
                "href": "/profile/Mindd-Itt"
            },
            "answer_text": "Short Answer because he has a voice that resonates with the large number of Indians who have been brought up in ‘only Indian’ families that foster on drama and bollywood which is inherently melodramatic. And in Ramadhir Singh’s words “SAbke dimag me apni apni picture chal rahi hai aur sab us picture ka hero banna chahte hain”, toh jab us hero (aaj ke melodramatic londe) ko chhota mota se leke bada ya bahut bada koi bhi dukh hota hai….. woh apne aapko ranbir kapoor samajhne lagta hai aur leke baith jata hai……Arijit Singh ko jaise unke Grandparents Mukesh ko leke baith jate the aur unke Parents Kumar Shanu ko. har generation me aisa hota hai ek singer who feeds on emotional melodrama inherent in Indian society. P.S.- I have nothing against Arijit or his fans. This is just an answer written light- heartedly. In fact I too listen to Channa Mereya when my gf pushes me away in bed. LOL ",
            "date": "Answered December 11, 2017",
            "views": "243",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bullo Oka",
                    "user_href": "/profile/Bullo-Oka"
                }
            ]
        }
    ]
}