{
    "title": "Why is it so hard to sell books on amazon? - Quora",
    "tags": [
        "Amazon (company)",
        "E-Commerce"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shirley Thomas",
                "href": "/profile/Shirley-Thomas"
            },
            "answer_text": "It might be because your novel is not something people want to buy. Now don’t get me wrong. The assessment has nothing to do with the quality of your writing. What a lot of self publishers don’t realize at the beginning is that novels people want to buy are not necessarily the best written books, not necessarily well promoted books, not necessarily the books that talk about the most viral thing of the year (or month or whatever), not the most original novels ever written, nothing remotely close to what most aspiring writers imagine people are looking for. After rent, transportation and food, what is something that you buy and have to return regularly to buy again and again? For some people it might be cigarettes; for me it is this brand of ready-to-drink tea that is local to my country. For yet some others, it is coffee from that place with green mermaid (?) logo. Readers are not so different animals. I buy quite a diverse set of books every month - but the staple remains the same, psychological thrillers. Some month I have literature, some month I have women’s lit, yet some other month I have satire and dark humor. But I can’t go without psychological thrillers. I am lucky enough that these days I can indulge myself as far as reading is concerned. Other people might be on a budget and guess what, their money will always go to those staple books. And I am sorry to say, those books are mostly genre fictions, top three of which (as far as I know) are romance, science fiction and fantasy. I might be intrigued by a well promoted book but if it is not a genre I am interested in (psychological thriller, satire, historical fiction) I am not reaching for my wallet. I’ll find someone to lend it to me, or go to the library. People are willing to part with money when they know what they’re going to get. For a lot of readers, they want a couple of hours lost in stories, ones that follow a certain structures and framed in a familiar shape, written in a voice they like and entertaining. There is a certain degree of consistency that we look for in our reading materials.  The above is one of the biggest reasons a novel is not selling on Amazon. I won’t be talking about most aspects of marketing as you seem to be well caught up with them. (I must mention though that a good looking cover does not always mean an effective one. You want a cover that screams your genre, and clearly display the title of your book and your name, even in thumbnail.) Now if your novel happens to be in a genre that people are willing to pay to read, another thing you might want to do is write another book. In fact, write more books. It’s not easy for readers to give a chance to a new writer but the likelihood that they do increases when they see you have several titles out. Again, consistency.  Take a gander around the market and check out your competitors. You know best which ones are aiming for the same audience you are targeting. Zero in on the successful authors in your genre; figure out what they are doing that you are not, and decide if your novel (or future ones) can be improved that way. Good luck! ",
            "date": "Answered July 6, 2016",
            "views": "965",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nupur Chowdhury",
                    "user_href": "/profile/Nupur-Chowdhury-1"
                },
                {
                    "user_id": "Ryan Loftus",
                    "user_href": "/profile/Ryan-Loftus-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ndayishimiye Boaz",
                "href": "/profile/Ndayishimiye-Boaz-1"
            },
            "answer_text": "There are a few factors that go into how you want to go about selling books on Amazon. First off, you need to figure out what type of book seller you would like to become. Here are a few examples: The College Student who sells their textbooks after each semester.This type of seller is very typical. As opposed to selling the textbooks that they had purchased only a few months earlier back to their college bookstore for 10% of what they paid, they sell them on Amazon and receive about 50% of what they paid.The Thrift Shopper who sacrifices their time for low profitsThese people often finds themselves at flea markets, garage sales or Goodwills and has the time to sort through thousands of books. It is not unlikely to see a person utilizing the Amazon app from their smartphone scanning piles of books to find those one or two books that are \"gems\".The Extra Cash SellerHave an abundance of books collecting dust around the house? Why not make a few dollars from them and place them in the hands of those who will appreciate them.The Not Playing Games SellerThis is what I would like to elaborate on.The first 3 sellers from the list above utilize very straight forward strategies. Buy a few books for very low prices, list them to Amazon, and ship them when they sell. The \"Not Playing Games Seller\" is much more in depth, however, much more financially rewarding. One thing anybody who begins selling books on Amazon has to know is that for every 1 book that you are able to sell for even just a few dollars, there are a hundred that are \"penny books.\" Penny books are books that are literally a penny + $3.99 shipping. The large book companies flood the book market with their overstocked books where the demand does not equal the supply and they wish to get rid of these books as fast as possible. Many believe that they do not make money off of these books, however, they actually do. First off, when utilizing the \"media mail\" shipping service via USPS, they can often ship the books for much less than the $3.99 credit received for shipping charges. In addition to the small direct profit, it adds to their shipping volume, which in turn allows them to receive reduced negotiated rates with the well known shipping companies. Okay, so as a serious book seller what you want to do is focus on books with the highest demand, the cheapest prices, and the fastest turnover rate. Nothing fits this description more than college textbooks. At the end of every college semester, there are an incredible amount of students who have absolutely no use for countless textbooks that will be in high demand in just a few months by the next batch of students coming in. When these new students have the options of paying (for examples sake) $100 for a book from their college bookstore versus $65 for a \"used-very good\" copy from Amazon, it is a no brainer. If the capital is available, I would highly recommend obtaining every textbook you are able to get your hands on. If you really would like to scale it, as I had, I would also recommend investing in a barcode scanner. As opposed to listing each book one by one, a great alternative to this tedious process is the bulk inventory loader. This is a lifesaver. You may come across bulk books for free or extremely cheap that are pre-UPC's, therefore unable to be scanned with a barcode scanner. Many deem these worthless, as looking them up on Amazon would include typing in every detail about the book and an insane amount of time. There is a great solution to this, though. Amazon's image recognition software is one of the most powerful solutions available to consumers. Unfortunately, the Amazon Seller app does not contain this powerful tool. The consumer application does contain it, though. A great solution I have found is to rapidly scan the books utilizing the image recognition software and then adding any books of value to a \"wish list\". From there, the URL's from the wish list must be extracted. Take the link of your Amazon wish list that is filled with the valuable books you have acquired and paste it into Import IO . This is a free web-scraping solution. From there, you are able to take the scraped information that has been turned into a .csv file and import it into Excel. Every Amazon product has a 10 digit code known as an ASIN. For books, it is usually the ISBN number. In order to bulk upload books, this 10 digit number must be extracted. This number is found in every URL.   Now that we have all of the URL's extracted into excel or Google Sheets, we must seperate them. To do this, the \"MID' function works great. Here is a custom formula to do so. =MID(A1,SEARCH(\"DP/\",A1)+3,SEARCH(\"/ref\",A1)-(SEARCH(\"DP/\",A1)+3)) Take this formula, and paste it into \"B1\" and then drag it down to the end of the URL list.  Take a minute and clean the list up and you will end up with this:  This is a very short list simply for examples sake. Realistically, the process would be most beneficial when extracting the ASINS from hundreds or thousands of URLS. Hope this helps. ",
            "date": "Answered May 29, 2019",
            "views": "542",
            "upvotes": "0"
        }
    ]
}