{
    "title": "Why am I no longer interested in listening to music? - Quora",
    "tags": [
        "Music Suggestions",
        "Interests (emotion)",
        "Listening to Music",
        "Music",
        "Psychology of Everyday Life",
        "Interpersonal Interaction"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eduardo Mora",
                "href": "/profile/Eduardo-Mora-1"
            },
            "answer_text": "You know, this happened to me too, and when I tried to find an explanation for it, my conclusion was that... when I used to listen to a lot of music, it wasn't like background music, I really connected with it, the lyrics, what it made me feel, etc. But it was during a period of my life where everything was more 'romantic' in a way, because I was full of hopes, dreams, heartbreak, you know... typical adolescence stuff. Then as I got older, I got a lot more on my mind, and all that 'romance' started to fade away while I focused on 'important' stuff. So in a way, my life became a bit dull. And as such, I didn't really connect to music in the same way I did before, because most of it didn't really make sense in my current situation. I grew older, and I couldn't really relate to it in the same way I did before.  When I listen to the stuff I listened when I was younger, my feelings are kind of a 'current' version of what I felt before, and sometimes I feel overwhelmed by the sensation of wanting to feel that way again. And that's great, because it reminds me of what's really meaningful to me, even if I can't pay full attention to it, as I did before when I was a full time romantic daydreamer, because now I have to focus on other stuff.  (This is also why I have a hard time liking new music, because everything I relate to music that makes me feel great, is stuff I felt before and feelings that I cherish, and it's not that easy to find stuff that really resonates with me at this moment) But it's there, and it's great that it is there and I can go back to it when I feel like I need to feel that way, or take a break from the 'important stuff'. It just can't be a full time thing now. ",
            "date": "Answered May 10, 2015",
            "views": "97",
            "upvotes": " View 62 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Not-Given-44"
                },
                {
                    "user_id": "Kamil Nidamudin",
                    "user_href": "/profile/Kamil-Nidamudin"
                },
                {
                    "user_id": "Zayn Awas",
                    "user_href": "/profile/Zayn-Awas"
                },
                {
                    "user_id": "Ayush Mishra",
                    "user_href": "/profile/Ayush-Mishra-1380"
                },
                {
                    "user_id": "Vineet Dhawan",
                    "user_href": "/profile/Vineet-Dhawan-5"
                },
                {
                    "user_id": "Parul Sharma",
                    "user_href": "/profile/Parul-Sharma-931"
                },
                {
                    "user_id": "Jasmine Styles",
                    "user_href": "/profile/Jasmine-Styles-2"
                },
                {
                    "user_id": "Yansi Dhattarwal",
                    "user_href": "/profile/Yansi-Dhattarwal-1"
                },
                {
                    "user_id": "Diane Rama",
                    "user_href": "/profile/Diane-Rama"
                },
                {
                    "user_id": "Taruna Priya",
                    "user_href": "/profile/Taruna-Priya"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tony deAraujo",
                "href": "/profile/Tony-deAraujo-1"
            },
            "answer_text": "Honestly, it lost its charm. Back in my twenties, going to purchase electronics was a major event. I still remember having to make an appointment with a sound engineer, which interviewed me and customized my soon to be home stereo. Going to the music store was also a very pleasant event as we always went with friends. Then, back home, we sat down, listened to music and discussed musicians and playing techniques. Once they stuffed a million songs into a tiny box that could fit in my pocket,  it lost that je ne sais quoi. It wasn’t by accident. First, music doesn’t sound right anymore. There’s no vibration, which was part of the appeal. Second, the science of selling songs standardized in such a way that brought innovation to a halt. Third, sound sampling has killed the musician. Now they all sound alike. Listening to music is a social event. Using headphones may work sometimes, but aside from the tiny sound, it kills a lot of the fun we used to have when listening together with friends. I haven't sat down with friends for the simple pleasure of listening to a piece of music in more than two decades. ",
            "date": "Updated October 1, 2019",
            "views": "4",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mick Dante",
                    "user_href": "/profile/Mick-Dante"
                },
                {
                    "user_id": "Vineet Dhawan",
                    "user_href": "/profile/Vineet-Dhawan-5"
                },
                {
                    "user_id": "Philip Kuruvilla",
                    "user_href": "/profile/Philip-Kuruvilla"
                },
                {
                    "user_id": "TINUADE ADEBIYI",
                    "user_href": "/profile/TINUADE-ADEBIYI"
                },
                {
                    "user_id": "Alex Cisneros",
                    "user_href": "/profile/Alex-Cisneros-12"
                },
                {
                    "user_id": "R.R. Leah",
                    "user_href": "/profile/R-R-Leah"
                },
                {
                    "user_id": "Beverly Cobb",
                    "user_href": "/profile/Beverly-Cobb"
                },
                {
                    "user_id": "Rahul Ranot",
                    "user_href": "/profile/Rahul-Ranot"
                },
                {
                    "user_id": "Aaron",
                    "user_href": "/profile/Aaron-983"
                },
                {
                    "user_id": "Curtis Harter",
                    "user_href": "/profile/Curtis-Harter"
                }
            ]
        }
    ]
}