{
    "title": "Why are there 13 main Greek gods and goddesses? - Quora",
    "tags": [
        "Deities (gods)",
        "Greek Mythology",
        "Mythology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eric Christian Hansen",
                "href": "/profile/Eric-Christian-Hansen"
            },
            "answer_text": "13 may be relative to the original 12 Apostles of Jesus Christ. Matthias was later added to replace Judas the Traitor. Paul of Tarsus was not an Apostle as he met none of the criteria for apostleship spelled out for us in the first chapter of Book of Acts (NT). [FYI - Book of Revelation mentions only 12 Apostles of the LAMB i.e. The Eleven + Matthias] How do the Greek gods/goddesses/Gods cross-reference to those of Christianity? Maria Magdalene (i.e. Hera), Joan of Arc (i.e. Iris), Elijah (i.e. Apollo). Zeus(Jesus) is a High God, not a god. Mary Magdalene (Hera) is his wife, and Joan of Arc(Iris) his personal messenger and bearer/guardian of the Most High God’s eternal Rainbow ARC of the Covenant between both Himself and mankind and the beasts of the earth. [FYI - The Greek word “iris” carries the dual meaning: Rainbow/Messenger. It is used twice in the New Testament - Revelation chp 4 & 10] I am not sure if Joan of Arc(Iris) is reserved for Zeus(Jesus) to be his wife, if Zeus(Jesus) so desires, or if she is free to marry a God, god, or human? Joan(Iris) is a virgin, but I am not sure if she is a PERPETUAL VIRGIN? [FYI, a god or goddess is a clone of a God, but is not the fullness of that God. They may be called a Child of God as opposed to a child of Adam and Eve.] Michael the Arc Angel, highest ranking angel, addresses Joan of Arc (Iris) as: “Jehanne the Maid, Child of God” — 15th century quote, Arc Angel Michael - commander of the armies of heaven. Joan of Arc’s real name is Jehanne Sybille Darc, which I interpret to mean “A prophetess, highly favored of Almighty God, who comes from the place of the rainbow [in heaven]”. ",
            "date": "Updated May 16, 2020",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jen Eric",
                "href": "/profile/Jen-Eric-4"
            },
            "answer_text": "After the Titans were overthrown, the Olympian council was set up. It was with 12 major gods, but disregarded Hades, as he got his own throne in the Underworld. Here were the original 12: Zeus, Poseidon, Hera, Demeter, Hestia, Athena, Ares, Hephaestus, Hermes, Apollo, Artemis, Aphrodite. That means no Hades. But then Dionysus was born and stormed Olympus. They couldn’t just add an Olympian position, so somebody had to step down. Hestia did, and instead became the guardian of Olympus itself. So there are actually 14 major gods and goddesses: Zeus, Poseidon, Hera, Demeter, Athena, Ares, Hephaestus, Hermes, Apollo, Artemis, Aphrodite, and Dionysus are on Olympus, and Hades and Hestia are the two coolest gods and yet aren’t on Olympus. ",
            "date": "Answered February 21, 2018",
            "views": "10",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Decio Filho",
                    "user_href": "/profile/Decio-Filho"
                },
                {
                    "user_id": "Emilio Diaz",
                    "user_href": "/profile/Emilio-Diaz-52"
                },
                {
                    "user_id": "Dajohnnie Sanders",
                    "user_href": "/profile/Dajohnnie-Sanders"
                },
                {
                    "user_id": "Ryann Bong",
                    "user_href": "/profile/Ryann-Bong"
                },
                {
                    "user_id": "Titus Bobby",
                    "user_href": "/profile/Titus-Bobby"
                },
                {
                    "user_id": "Dripta Bhattacharjee",
                    "user_href": "/profile/Dripta-Bhattacharjee"
                },
                {
                    "user_id": "Edson Maese",
                    "user_href": "/profile/Edson-Maese-1"
                },
                {
                    "user_id": "Grant Draus",
                    "user_href": "/profile/Grant-Draus"
                },
                {
                    "user_id": "Sandesh Balan",
                    "user_href": "/profile/Sandesh-Balan"
                }
            ]
        }
    ]
}