{
    "title": "Why can't planes have two armrests between the seats? - Quora",
    "tags": [
        "Airline Fleets",
        "Airplanes",
        "Airlines"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dipayan Ghosh",
                "href": "/profile/Dipayan-Ghosh-9"
            },
            "answer_text": "I agree with the answers here. Aircraft seats have evolved from being for the elite to transporting cattle from point A to point B. More seats (hopefully leading to more people) you can fit inside an aircraft, lower is your unit cost which translates into a healthier bottom line. So adding an extra armrest between seats will result in reducing one seat per row in an average narrowbody aircraft. Consider Indigo's 180 seats A320 with 6 abreast seating. Putting an extra armrest will reduce the seating to about 150. That's 30 potential customers gone with the wind. Apart from the seat count, weight is also an important consideration. Below is an extract from The New York Times But even specks of dirt are considered culprits. American and Southwest are washing a handful of jet engines each night, a process that used to happen only during thorough maintenance overhauls. Southwest figures it has already saved $1.6 million in fuel costs since April by reducing the drag caused by dirt and debris. American, for one, expects to save roughly $330.7 million this year, or about 3.5 percent on a total fuel bill that will approach $9.26 billion.A number of airlines are flying their planes somewhat slower in order to save fuel — 480 miles an hour, for example, instead of the usual cruising speed of 500 m.p.h. Five years ago, Delta estimated the flying time from Los Angeles to Atlanta at 4 hours, 12 minutes; now it is 4 hours and 18 minutes at a lower speed. (The airline has not changed its timetable, which sets aside about four and a half hours for the trip, including taxiing time.) Up in the cockpit, Delta is studying whether it is feasible to divide the heavy pilot manuals required on each flight between the captain and first officer, so pilots are not toting duplicate sets of five or six books that each weigh about a pound and a half. Eventually, the airline wants to eliminate printed manuals and display the information on computer screens, a step the government would have to approve. “That’s very much where we want to go,” said Gary Edwards, Delta’s director of flight control. “That’s the wave of the future.” Passengers may notice other changes. Airlines including Delta are swapping heavier seats for models weighing about 5 pounds less. American is replacing its bulky drink carts with ones that are 17 pounds lighter. The airline said that move will help save 1.9 million gallons of fuel a year, on top of the 96 million gallons it is saving through other means.Water is another target. Northwest is putting 25 percent less water for bathroom faucets and toilets on its international flights, Mr. McGraw said. Most planes had been returning from long flights with their tanks half full, an unneeded expense given that water weighs 8.3 pounds a gallon and a gallon of jet fuel is 6.8 pounds.“Every 25 pounds we remove, we save $440,000 a year,” Mr. McGraw said. Airlines also are trying to cut fuel consumption at the airport. Most now run their planes’ electrical systems at the gate by plugging them into outlets, rather than running the engines. “We’re really fine-tuning to get to that sweet spot of efficiency,” said Mr. Edwards of Delta. Northwest has studied everything from providing customers with packing tips to serving soda from two-liter plastic bottles rather than individual cans. But it decided that customers would balk at that idea. “They like the can,” Mr. McGraw said. “They want the can.” Hope this answers your question. ",
            "date": "Answered February 13, 2015",
            "views": "906",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harsh Kandpal",
                    "user_href": "/profile/Harsh-Kandpal-6"
                },
                {
                    "user_id": "Jacob Shane",
                    "user_href": "/profile/Jacob-Shane-1"
                },
                {
                    "user_id": "Gerard Marszałek",
                    "user_href": "/profile/Gerard-Marszałek"
                },
                {
                    "user_id": "Eva Luna",
                    "user_href": "/profile/Eva-Luna-11"
                },
                {
                    "user_id": "Varad Joshi",
                    "user_href": "/profile/Varad-Joshi"
                },
                {
                    "user_id": "Jasmine Singh",
                    "user_href": "/profile/Jasmine-Singh-9"
                },
                {
                    "user_id": "Neha Tirkey",
                    "user_href": "/profile/Neha-Tirkey-2"
                },
                {
                    "user_id": "Kasturi Patra",
                    "user_href": "/profile/Kasturi-Patra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Capt. Gaurav Sawaai",
                "href": "/profile/Capt-Gaurav-Sawaai"
            },
            "answer_text": "Technically airliners, they dont want to have even one single armrest. The one arm-rest is provided as a partition between the two seats, else the other passanger may try to be extra cozy. In order to avoid conflict on-board, they made the partition between seats and hence we got one arm-rest in between. Now, airliners want to cut-off extra weight to keep aircraft as light as possible to increase payload in order to generate maximum revenue. Secondly, to keep the comfortable space for the movement of meal- torllies they need enough space. If you want to have two arm-rest, you can fly in business class, there you can enjoy comfortable seating as well as airliner will be happy to be profitable by selling that extra armrest space. ",
            "date": "Answered February 13, 2015",
            "views": "565",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aidan Sigurdson",
                    "user_href": "/profile/Aidan-Sigurdson-1"
                },
                {
                    "user_id": "James Robbins",
                    "user_href": "/profile/James-Robbins-29"
                },
                {
                    "user_id": "Saagar Dhawan",
                    "user_href": "/profile/Saagar-Dhawan"
                }
            ]
        }
    ]
}