{
    "title": "Why do some white people copy black hairstyles, like afros? - Quora",
    "tags": [
        "Afro",
        "Copying",
        "Racism Against Black People",
        "Race Relations",
        "White People",
        "Black People",
        "Racism",
        "Race and Ethnicity",
        "Understanding Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Frederica Potter",
                "href": "/profile/Frederica-Potter"
            },
            "answer_text": "Take the modifier out of the question: Why do people copy hairstyles (like afros)? Well, probably because these people have not yet internalized that they should categorize poeple according to aspects such as race and thus do what we are told by modern advertisments to do: Copy what you like. So, some will see an elaborate plaited hairstyle such as some characters in “Viking” wear and copy them, if they are white, they are “allowed” to do so. Others will see a hairstyle of their favorite musician or actor or their friend or some random person in the street who happens to be black and think the same thing as the first person, “great hairstyle, I would like to try it on myself!” Note that in the first example, there is no aspect or idea of “stealing” involved (but were are getting there - some folks now claim that French plaits originated in Africa and are thus off-limits for white people….), but the idea of stealing is assumed (by some? most? I don’t know) in the second example. What is to be done? We are encouraged to separate people in different groups such as race, nationality, religion etc. and ONLY do or develop what other people of our group have done before. This will work in some areas such as hairstyle but very badly in other areas such as music or literature if we are not to move towards completely separated societies where people in the US have never and will never read books by people from, say France. Different culture, no appropriation here. And of course, there will be fewer ideas as there will be less inspiration due to less exposure to diverse ideas (diverese simply meaning from a lot of people with different backgrounds, not strictly from a lot of people from different races). Cultures will again become “exocit”, meaning hard to understand for outsiders due to no chance of exposure to them through media due to strict separation and aim to keep cultures “clean”, which by the way was also an objective of the Nazis which makes me always very uneasy about this aspect of the whole idea of cultural appropriation. The idea was as far as I know originally applied to people living secluded from the poeple who exploited them, not people living in their society. There is a difference between a completely isolated culture with no outside contact and “explorers” taking their medical plants or jewllery and selling it in, say, the US - and US citizens prohoiting other US citizens with roughly the same culture, the same expore to education and media from doing something that is not too far removed from their daily life, i.e. imitating a hairstyle (or other non-commercial things) they might see every day. ",
            "date": "Answered December 4, 2018",
            "views": "976",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Austin Hornsby",
                    "user_href": "/profile/Austin-Hornsby-3"
                },
                {
                    "user_id": "Dani Vézina",
                    "user_href": "/profile/Dani-Vézina"
                }
            ]
        },
        {
            "author_info": {
                "name": "Krysti Crawford McCord",
                "href": "/profile/Krysti-Crawford-McCord"
            },
            "answer_text": "I'm confused. What if we have naturally curly hair? Like, very curly… We can't let it be natural? So we'd have to put a straightener on it so it's not like an Afro. Do you own straight hair too? What about wigs and tracks and extensions? You own that, as well? Imma let you in on a lil secret—-Every culture has “changed” their hair, styled their hair, adorned their hair, added hair, cut hair, etc. since the beginning of time. I'm not gonna argue who came first because you'll have me in the Caucasus Mountains eating my family (I'm guessing and I'm in a mood of some sort.) This was meant only slightly snarky, but mostly for funny. :D My point is: black folks don't “own” the Afro. Yes, there are a lot of non-black folks with kinky curly hair that will fro up quick if not straightened. Don't get me wrong, it is a predominantly black style. I think natural black hair is gorgeous! I just wish things like this would not be something to fight about. My question is: if you were in America and saw a white lady wearing a t-shirt with a big picture of Africa on it, would you say something to her? She can't possibly know about African pride right? My point is: you have no idea she might have been in the middle of the struggle with Apartheid, civil unrest, wars, killings, etc. You don't know her story. Stop assuming that every white person you meet is the same. You don't know their story just like they don't know yours. ",
            "date": "Answered May 25, 2017",
            "views": "14",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shewolf51",
                    "user_href": "/profile/Shewolf51"
                },
                {
                    "user_id": "Aniya Elmore",
                    "user_href": "/profile/Aniya-Elmore"
                },
                {
                    "user_id": "Austin Hornsby",
                    "user_href": "/profile/Austin-Hornsby-3"
                },
                {
                    "user_id": "Susan Rivers",
                    "user_href": "/profile/Susan-Rivers-3"
                },
                {
                    "user_id": "Toluwani Akinwande",
                    "user_href": "/profile/Toluwani-Akinwande"
                },
                {
                    "user_id": "Joseph Lemire",
                    "user_href": "/profile/Joseph-Lemire"
                },
                {
                    "user_id": "Dani Vézina",
                    "user_href": "/profile/Dani-Vézina"
                },
                {
                    "user_id": "Linda Lennon",
                    "user_href": "/profile/Linda-Lennon-1"
                },
                {
                    "user_id": "Salina Marcella",
                    "user_href": "/profile/Salina-Marcella"
                }
            ]
        }
    ]
}