{
    "title": "Why do people like rap music? - Quora",
    "tags": [
        "Why Is X So Popular?",
        "Rap Music",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Noah Temple",
                "href": "/profile/Noah-Temple"
            },
            "answer_text": "It's hard for me to choose one thing, so I'll say a few. First of all, it gives a new spin to lyricism (see Eminem or Tech n9ne) that nothing else has so far. It introduces a cool (no offense to poets out there) sounding version of poetry. Second, freestyle rapping, when done regularly, can drastically increase your ability to think on the spot without hesitation, as well as keep going when you slip up. It also gives you a cool thing to do at parties or impress people with. I've actually had a few people be really impressed that I could do it so well, even though I would consider myself mediocre at best. Anyone who likes rap should give freestyling a try. Yes, you will fellate sizeable phallus at first, but it's still pretty motherfuckin fun! There's this spark that I always felt I had inside of me, waiting to be ignited. Whenever I would play an instrument or listen to music, especially rap, I would feel the spark there, but it was dull. It didn't feel like it was at its full potential. Then, once I got a decent baseline of skill at freestyling, it felt… indescribably amazing. Like it was what I was meant for, you know what I'm sayin? I felt like the spark fucking exploded! Like I had finally found what I was good at. Not just decent, I felt like it was exactly what my brain was designed for. It felt so natural, and I was naturally more adept at it than others. But enough bragging. Freestyling, in my opinion, is a must do. It should be on your “bucket list”. Once you get the hang of it, the feeling is like noting else. It feels as good as being high, even for someone, such as myself, with an anxiety disorder. You don't think about what they care about you, or what could go wrong! You think of the possibilities and what could go right! As you can tell, I really do love rap. I would feel incomplete without it. I wouldn't know what to do. ",
            "date": "Updated December 20, 2017",
            "views": "49",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "GunRhymez Media",
                    "user_href": "/profile/GunRhymez-Media"
                },
                {
                    "user_id": "Aniket Ghosh",
                    "user_href": "/profile/Aniket-Ghosh-170"
                },
                {
                    "user_id": "Aditya Sivakumar",
                    "user_href": "/profile/Aditya-Sivakumar"
                },
                {
                    "user_id": "Josiah",
                    "user_href": "/profile/Josiah-120"
                },
                {
                    "user_id": "Vance Boyd",
                    "user_href": "/profile/Vance-Boyd-1"
                },
                {
                    "user_id": "Brendan Lounsbery",
                    "user_href": "/profile/Brendan-Lounsbery"
                },
                {
                    "user_id": "Rajesh Kannan",
                    "user_href": "/profile/Rajesh-Kannan-140"
                }
            ]
        },
        {
            "author_info": {
                "name": "Angel Lopez",
                "href": "/profile/Angel-Lopez-534"
            },
            "answer_text": "Rap has been one of the greatest influences of life to many people. Especially myself personally, I would go through a tough time, but listening to many people who can relate to everybody through their songs, it’s just something that you can only experience through only doing it. It gives you a sense of comfort and it just makes you think that everything will be okay. Also many people that I know also love the message / story that the rapper or artist is trying to convey. Take for example the song “Gang Related” by Logic, besides being a great song just overall a great listen. It talks about the type of struggles he grew up with such as abuse, drugs within his household, and the violence he had to witness. This story shows us the very nature of what a normal human can possibly live in. And aside from that, many people can relate which can connect so many people. But overall it shows that rappers are still people like us with real world problems and that is something that all of us that at least once in our lives can relate to certain song. Aside from that you also have some of the more generic reasons for why people like rap. Some of these reasons are that “The beat is good”, or even “It just sounds lit (good/hype)”. And obviously there is so much more reasons why people love rap and some I cannot relate personally or be the greatest fan of, but this just comes to show the relationship between the words and people and the spiritual connection that many experience is just strong. One such example is me typing this when I really should be doing my homework that’s due in the next few days, but just remember that rap although sounding weird and sometimes even like ”Why did you even make that?”, we can have some sort of connection to the song and that is what makes the power of rhyme so beautiful. ",
            "date": "Answered May 26, 2019",
            "views": "26",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Michael Moccio",
                    "user_href": "/profile/Michael-Moccio-1"
                }
            ]
        }
    ]
}