{
    "title": "Why is blackpink such an amazing group? - Quora",
    "tags": [
        "BLACKPINK"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anandi Datar",
                "href": "/profile/Anandi-Datar-1"
            },
            "answer_text": "Annyeong~ Blackpink has 2 sides and an improved version of 2ne1 , i guess thats y. But just because they are amazing doesn’t mean they are the most succesful. Ofc, thats BTS but then there are the nations gg and bg , EXO and TWICE. They always use a formula that has an EDM based beat which is catchy and cool, their merch is also nice. Their songs are always or mostly a bop and get tons of views by starving blinks. THATS ALL Have a bacon  bye~ ",
            "date": "Answered October 7, 2020",
            "views": "89",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lisa Johnson",
                    "user_href": "/profile/Lisa-Johnson-2278"
                },
                {
                    "user_id": "Shayla Caldwell",
                    "user_href": "/profile/Shayla-Caldwell-5"
                },
                {
                    "user_id": "Katelyn Liu",
                    "user_href": "/profile/Katelyn-Liu-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ana Lin",
                "href": "/profile/Ana-Lin-18"
            },
            "answer_text": "Nice Question! First of all the group has amazing members. Also all the members are beautiful. They were from the incredible YG entertainment where G-Dragon, iKON, BigBang, Yang Hyun-suk, Treasure, 2NE1, CL, PSL, Teddy Park. There entertainment has a lot of really good artists. Blackpink is also in the YG family which has a lot of artists of YG counting G-Dragon! They are also really good because dduddudu has 1.3B viewers and they’re youtube channel has over 50M Subs or more or less I could be wrong. Last but not least they are all really nice. ",
            "date": "Answered October 24, 2020",
            "views": "32",
            "upvotes": "0"
        }
    ]
}