{
    "title": "Why don't all professional singers make great singing teachers? Why are some good teachers but why are some not? - Quora",
    "tags": [
        "Music Teachers",
        "Singers",
        "Voice",
        "Singing",
        "Music Industry",
        "Teachers",
        "Teaching",
        "Musicians",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Greg Moore",
                "href": "/profile/Greg-Moore-15"
            },
            "answer_text": "Teaching is a special ability that crosscuts all human endeavors. It seems to be born into a person - good teachers may (and many do) profit from study in “how”, but poor teachers tend to remain poor teachers, even with a pile of education degrees and credits. Hmm… to a degree, this is a characteristic shared with singers! But the two abilities do not match one-for-one. The most common difficulty is that singers do not know exactly how they got their superb voice; and often they developed so quickly, and received so much approval from their teachers, friends and peers, that all they have to go by is their own experience. A voice teacher needs to have a closer relationship with the student than teachers in other subjects. Thus the fine singer should be personable, free of condescending words or mannerisms, unambiguous in their personal behavior, encouraging, and at the same time have a keen analytical sense. The teacher should also be able to put a lock on those stories of world tours and their fine old teacher at Juillard, and another lock on their own voice, so the session doesn’t become a display case for their own talent, but is devoted to developing the student. In general, it is little different from the baseball players who hits four hundred home runs, and then is made manager by an idiot team owner. The guy is used to being applauded just for stepping out of the dugout, and now he is booed when the team loses; he doesn’t know how to punch a little single to score a runner, or how to steal a base. The team holds on to this miserable creature for a few seasons, and finally promotes him to TV broadcaster, where he regales the public with stories about the old days while not actually giving out any information about the game in progress. ",
            "date": "Answered March 31, 2019",
            "views": "78",
            "upvotes": " Answer requested by Diego Velasco",
            "upvoters": [
                {
                    "user_id": "Rina Claire Green",
                    "user_href": "/profile/Rina-Claire-Green"
                },
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                },
                {
                    "user_id": "Sandra Goodman",
                    "user_href": "/profile/Sandra-Goodman"
                },
                {
                    "user_id": "Diego Velasco",
                    "user_href": "/profile/Diego-Velasco-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevin Richards",
                "href": "/profile/Kevin-Nyc-1"
            },
            "answer_text": "Pavarotti famously said that he’d make a terrible vocal teacher. Why? Because he simply didn’t have enough technical knowledge to do so. I do believe that he would have made a great vocal coach in guiding other singers on performing their repertoire. Professional singers would have the same issue - unless they took some years to get educated on vocal science. Being a professional singer doesn’t automatically qualify one to teach others; teaching is another skill all its own. That’s why some are good at it and others are not. Any moron can make a YouTube video and call themselves a “vocal coach” by watching another singer and give you their “opinion” or “reaction”; but can they actually teach someone else? Doubtful. Some of the greatest teachers in the world are all unknown - but they had the teaching skills to inspire others to greatness. And most of them were NOT outstanding people in that chosen field. Somebody taught Serena and Venus Williams to play tennis; does anyone know their name? Nope? Some of the greatest coaches in baseball, hockey, soccer etc., were never outstanding players in the game themselves. As in any teaching profession, there are effective and non-effective ones. It’s down to that person’s ability to translate the nuances of singing and the underlying technique into something tangible, something someone else can easily understand and digest; and that is where the real skill lies. ",
            "date": "Answered March 31, 2019",
            "views": "582",
            "upvotes": " View 4 Upvoters"
        }
    ]
}