{
    "title": "Why are slurs bad? - Quora",
    "tags": [
        "Slurs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aiysha Mustapha",
                "href": "/profile/Aiysha-Mustapha"
            },
            "answer_text": "Andrea Raethka wrote: “An ethnic or racial slur is a \"term designed to insult others on the basis of race, ethnicity or nationality.\" Some words may not by themselves be inherently bad, but when put together or used in a connotation to put down a person on the basis of race, automatically transform into a racial slur. For instance the word \"dirty\" is not particularly offensive out of context, but if you preface, for instance, the word \"Jew,\" it then very much so becomes a part of an offensive racial slur.” -Andrea Raethka, ROC Published 9:28 a.m. ET Jan. 29, 2014 | Slurs are a form of coded language, a way in which to call someone something without saying it. For example the N-word is a word that was created for a black person or person of African descent. It has no origin other than being used to characterize an entire ethnicity of people as lazy, ignorant, dirty, unclean, unkept and the list goes on. All these negative words seem as though this person is very savage and incapable of emotion, intelligence and the like. The usage of the word is unclear as many detest it altogether while others allow usage based on ethnicity. However the latter know that saying it leads to altercation sometimes physical. So instead of calling a person the N-word they use “thug” “ghetto…” etc. Slurs are rude and offensive and only further perpetuate racism through derogatory language and divisiveness. Literally allowing ignorance to manifest and grow. In other words slurs are insults, if you must ask why they are bad clearly someone has never told you their purpose and what they are in plain language which means you are being taught to embrace racism and implicit bias, free your mind. ",
            "date": "Answered January 21, 2019",
            "views": "98",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Charles Wilson",
                "href": "/profile/Charles-Wilson-215"
            },
            "answer_text": "Slurs hurt people emotionally & spiritually. The hurts clog the brain and hearts of the recipient so work and study and reaction and thinking and judgement suffer. The soul, emotions, spirits, hearts are similarly damaged. This affects folks’ attitudes, friendliness, acceptance, cooperation,, receptiveness, humor, warmth, love and teamwork suffer and diminish. Humanity and human advancement suffer. ",
            "date": "Answered January 27, 2019",
            "views": "35",
            "upvotes": "0"
        }
    ]
}