{
    "title": "Why do I feel depressed after yoga? - Quora",
    "tags": [
        "Yoga",
        "Coping and Living with Depression",
        "Understanding and Improving Mental Health",
        "Depression",
        "Mental Health"
    ],
    "response": [
        {
            "author_info": {
                "name": "Philippa",
                "href": "/profile/Philippa"
            },
            "answer_text": "One could say that it is part of the natural process of purifying your mental state of being. Throughout our lives, we tend to harbor many unconscious physical habits and mental thoughts that shape how we experience life. Often we will avoid situations and people that make us feel uncomfortable. It is the same with our thoughts. We will tend to repress within ourselves, thoughts that make us feel dull and dark. Yoga is a practice that awakens our awareness and makes us more conscious of our body and mind. Therefore, it is natural during or after the practice that we are more ‘aware’ of feelings, thoughts and areas of the body that perhaps we were not so consciously in tune with before. Particularly if you’ve had depressing thoughts for many years, the practice will naturally seek to bring these thoughts to your attention as part of the process of “letting go”. It is purification, not just on a physical level, on a mental level also. Somewhere in your mind or body, you may have been ‘storing’ these thoughts and now it is time for these ‘thoughts’ to be mindfully examined and released with a sense of self-compassion. See if you can practice ‘witnessing’ the thoughts and feelings that arise after class without identifying them. Rather than thinking, “I feel bad” or “I feel depressed”, acknowledge the feelings for what they are, but do not tell yourself that “I” am feeling them. See the feelings as clouds, arising, but then passing away. As you continue to practice yoga, in given time, you will notice these feelings shift and evolve. In my early years of practice, I cried many times during yoga classes. I see in retrospect that this was part of releasing old emotional energy that had been ‘stored’ in my ‘unconscious’ state. I feel completely different after each class, but now, no matter what feeling arises, the practice of mindful detachment has helped me incredibly in life, both on and off the mat. Namaste. ",
            "date": "Answered May 24, 2017",
            "views": "77",
            "upvotes": " View 27 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lekha Cheruku",
                    "user_href": "/profile/Lekha-Cheruku"
                },
                {
                    "user_id": "Kam Kalen",
                    "user_href": "/profile/Kam-Kalen"
                },
                {
                    "user_id": "Shorouq Mekky",
                    "user_href": "/profile/Shorouq-Mekky"
                },
                {
                    "user_id": "Duan Trinity",
                    "user_href": "/profile/Duan-Trinity"
                },
                {
                    "user_id": "Astrid Underlid",
                    "user_href": "/profile/Astrid-Underlid"
                },
                {
                    "user_id": "Siwar Salam",
                    "user_href": "/profile/Siwar-Salam"
                },
                {
                    "user_id": "Max Lyman",
                    "user_href": "/profile/Max-Lyman-1"
                },
                {
                    "user_id": "Amelia Topper",
                    "user_href": "/profile/Amelia-Topper-3"
                },
                {
                    "user_id": "Supriya Medsinge",
                    "user_href": "/profile/Supriya-Medsinge"
                },
                {
                    "user_id": "Carlos Díaz",
                    "user_href": "/profile/Carlos-Díaz-24"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jamie Brown",
                "href": "/profile/Jamie-Brown-150"
            },
            "answer_text": "If by “yoga” you mean the whole spiritual practice, asana, pranayama and meditation, as opposed to mere physical exercise as it is taught in most western gyms and studios, the practice can dredge up unpleasant memories and emotions that come to the surface in the purification process and need to be released. This shall pass and eventually the pain will melt into bliss. But if by “yoga” you mean the physical exercise class taught by a gorgeous, thin, young, blonde, busty, long-legged teacher with perfect glowing skin who can stand smiling with one leg hooked behind her head, and similarly thin and talented classmates who look great in their expensive yoga outfits, doing difficult poses while you are in pain trying to force your body into contortions and still keep your balance wearing your old sweats that make your normal body fat bulge out - then you are depressed because you are judging yourself against an unrealistic image that is being promoted by the “yoga” industry that is not in fact yoga at all. And you may well end up injured. ",
            "date": "Answered May 9, 2018",
            "views": "25",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kerry Anderson",
                    "user_href": "/profile/Kerry-Anderson-149"
                },
                {
                    "user_id": "Mark Jacob Acosta",
                    "user_href": "/profile/Mark-Jacob-Acosta"
                },
                {
                    "user_id": "Sarah Price",
                    "user_href": "/profile/Sarah-Price-339"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Ola-186"
                },
                {
                    "user_id": "Jill Bamford",
                    "user_href": "/profile/Jill-Bamford"
                },
                {
                    "user_id": "William Jackson",
                    "user_href": "/profile/William-Jackson-277"
                },
                {
                    "user_id": "Johnny Dee",
                    "user_href": "/profile/Johnny-Dee-23"
                }
            ]
        }
    ]
}