{
    "title": "Why is singing so hard? - Quora",
    "tags": [
        "Singers",
        "Singing",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jessica Toller",
                "href": "/profile/Jessica-Toller"
            },
            "answer_text": "Singing boils down to three basic things: • The air you send the vocal cords • The muscles of the cords to resist the air • The resonance to enhance the resulting sound wave It would seem pretty easy, wouldn’t it? Three simple things you need to work with: air, cords, resonance…yet why is it often so hard to sing? It is because these three things have so many variables, and yet they all need to coordinate together in very precise ways. You need to send air, but the right amount of air at the correct airflow, to the vocal cords. The vocal cords need to coordinate intricate muscle adjustment not only for pitch, but also for the correct amount of resistance to the flow of air coming up from the lungs. Another issue for the vocal cords are the almost automatic involvement of muscles that are meant for swallowing, not singing. Keeping these muscles passive while singing takes practice. You then need to adjust your vocal amplifiers, or resonators, of your throat and mouth to the exact size and shape to not only gives you the vowel you need, but to also interact properly with the sound wave. Get this part wrong and you mess up everything you’ve done before. Yep, you can adjust the air and vocal cords correctly, but an improper vowel shape can send the whole operation sideways. Will Singing Always Be This Hard? Well, yes and no…but a bigger no. Here’s what’s great about singing – when you start getting everything aligned, the system seems to take over and drive itself. Have you ever hit a note that sounded amazing, yet felt effortless? That’s the magic place, as I like to call it. The effortlessness can be so profound that it can confuse us. In fact, often the first reaction is it can’t be right because it’s TOO EASY!!! The ease is caused by natural forces in singing that help reinforce each other. Let’s look at a perfectly sung note: You send the right amount of air from the lung to the vocal cords, not over-pushing with abdominal muscles, as so many singers end up doing. This air then helps bring the coordinated vocal cords together by the natural vacuum that is created by the air passing them. There is no need for over-use of vocal muscles, or the unneeded swallowing muscles. You are allowing natural forces to assist you. Then an even more amazing thing happens: The air molecules are compressed by the closed vocal cords and turned into sound waves – the compressed molecules spring forth when released and begin quickly vibrating. These vibrating molecules enter your throat and mouth, which are perfectly adjusted to boost these molecules. The air molecules begin to vibrate more intensely as they bounce around inside the correctly adjusted resonators. In fact, they get so much intensity that they start to create a traffic jam of energy – energy that needs to go somewhere. And where does this energy go? Well some of it goes out the mouth to the listener. But HERE’S the REALLY COOL part! Some of the energy goes back down and presses on your vocal cords… Which makes it easier for them to resist the air… Which means you don’t have to push as much air… And the energy helps regulate cord closure and airflow – so the whole system is working in harmony with itself… So you SOUND AMAZING!!!! This is the magic of good singing! It will give you great tone, easy high notes, extended rage, eliminate cracking, in fact getting your system to coordinate in this way will eliminate almost any issue you can think of. It’s not a secret, it’s not a special system…it’s SCIENCE! You can be a better singer; you just need to become a more informed one. ",
            "date": "Answered November 22, 2016",
            "views": "13",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ronald Brown",
                    "user_href": "/profile/Ronald-Brown-76"
                },
                {
                    "user_id": "Siena Wheeler",
                    "user_href": "/profile/Siena-Wheeler"
                },
                {
                    "user_id": "Adnane Mestour",
                    "user_href": "/profile/Adnane-Mestour"
                },
                {
                    "user_id": "JL",
                    "user_href": "/profile/JL-99"
                },
                {
                    "user_id": "Tziyon Yeung Tee Ann",
                    "user_href": "/profile/Tziyon-Yeung-Tee-Ann"
                },
                {
                    "user_id": "J Tiki",
                    "user_href": "/profile/J-Tiki"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jennifer Palus",
                "href": "/profile/Jennifer-Palus"
            },
            "answer_text": "If you find singing difficult, I would guess it is because you are thinking too hard and actually getting in the way of the natural process. As other responders have said, singing is all about sending a consistent flow of air through your vocal folds… and it’s air (or rather the lack of supported breathing) that can make it seem hard to sing. Consider when you’re talking with your friends — you have likely never once had to stop and think “Oh, I should breath now or I will run out of air.” And yet most of us are able to speak a complete thought without gasping or taking a breath in an odd place (like the middle of word!)…yet when we sing, we sometimes enter this strange place where breathing is something we have to THINK about and suddenly we push too far or stop in a place that hurts the meaning of the song lyric. Find a community chorus or choir and hand out with other singers, notice how the best singers are usually the most relaxed - there is no tension in their neck, lips, or tongue. It appears effortless and, when you’re in the zone, it feels effortless. Practice and some good instruction will be the best recipe for you to improve and find the joy in relaxed, air-driven singing. ",
            "date": "Answered November 23, 2016",
            "views": "470",
            "upvotes": " Answer requested by David Garcia"
        }
    ]
}