{
    "title": "Why do younger people say that modern music sucks? - Quora",
    "tags": [
        "Modern Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Scott Kiddle",
                "href": "/profile/Scott-Kiddle"
            },
            "answer_text": "Clarifying question - how do you mean “modern music”? To which genre do they refer? Do they refer to what’s being played on commercial radio? Some other medium? I’ve been a semi-professional musician for many decades and have observed much musical evolution and have been deeply dismayed myself at much of what is on the radio. As an older guy, I would say that “modern music sucks”, in many ways. Three shifts took place that caused me to lose interest in “modern music”: 1) guitarists stopped truly crafting beautiful solos, 2) lyrical themes started getting uglier, more vulgar, and more violent, and 3) songwriters stopped writing really great melodies. I can definitely speak to why younger people are saying the music of preceding generation sucks, though. I was in the category of “younger people” many years ago and felt that my parents’ music was dull and boring. When I became a parent and my own children became musically aware, they felt that my music was dull and boring. I suspect that theme has played out for as long as humans have enjoyed music and each generation compares what is hip to them to that of preceding generations. It is amusing, however, to see the resurgence in interest in some older bands/musicians. Case in point is Carlos Santana. Santana was hip back in the 1970’s (my day) and somehow his career was revived in the late 1990’s and he was hip again. I took my young teen sons to a Santana concert during that resurgence and they were shocked to notice that Dad could sing along to so many of the songs being performed. ",
            "date": "Updated October 10, 2019",
            "views": "37",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rich Clark",
                    "user_href": "/profile/Rich-Clark-57"
                },
                {
                    "user_id": "Adham Esam",
                    "user_href": "/profile/Adham-Esam-2"
                },
                {
                    "user_id": "Umberto Darmi",
                    "user_href": "/profile/Umberto-Darmi"
                },
                {
                    "user_id": "Cindy McIntosh",
                    "user_href": "/profile/Cindy-McIntosh-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Patrick",
                "href": "/profile/Patrick-552"
            },
            "answer_text": "I, in behalf of the younger people who claims that modern music sucks, would like to give an immense stress to the aforementioned emphasized words that NOT ALL modern music sucks, they were just given much exaggeration to call out such epidemic. I, given the society’s general perspective, think that critically-acclaimed music was given less regard by our modern society in general, but usually called the good one. The good ones were given the negligence by the people in which eventually drowning and filling themselves with the commercially-encouraged modern music, in this case, often called the bad one. To further justify my claim, not all bad music are commercially successful and vice versa. The primary problem with most of the bad music today is that it fails to capture the essence of music as what it should and meant to be. Popular modern musicians lack their in-depth correlation in their role in our society given the amount of power money can offer. The what-they-so-called art in their music is not inherent in its premise, but rather in the sheer lack of passion in making their music from conceptualization to the final output as well as in the lack of understanding of what is actually bland and what isn't. Now, as part of the younger ones, we need to explore and discover of what each one of us think what a good music is. It is in our act to support those musicians who wholeheartedly poured their effort and passion in making such meaningful music. To conclude, fair judgment is ours to make and we must act accordingly. ",
            "date": "Answered January 2, 2018",
            "views": "26",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Polojärvi Jaakko",
                    "user_href": "/profile/Polojärvi-Jaakko"
                },
                {
                    "user_id": "Aia",
                    "user_href": "/profile/Aia-8"
                },
                {
                    "user_id": "Christian Browning",
                    "user_href": "/profile/Christian-Browning"
                },
                {
                    "user_id": "Rosa Yzaguirre",
                    "user_href": "/profile/Rosa-Yzaguirre"
                },
                {
                    "user_id": "Timur Rvachov",
                    "user_href": "/profile/Timur-Rvachov-1"
                },
                {
                    "user_id": "Milan Zemanec",
                    "user_href": "/profile/Milan-Zemanec-1"
                }
            ]
        }
    ]
}