{
    "title": "Why do we get goosebumps when we hear a song we really like? - Quora",
    "tags": [
        "Goose bumps",
        "Psychology",
        "Songs",
        "Emotions",
        "Music",
        "Understanding Human Behavior",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Norman Graham",
                "href": "/profile/Norman-Graham-6"
            },
            "answer_text": "We have all had experiences in our lives that stand out as memorable moments. We also create mental markers in our minds to help us recall those events. What environment or song was playing when these events happen. A special song at a high school prom, a first kiss. Background music when we meet a famous person, or when a friend or loved one dies. All is recorded in our minds. When we hear certain songs at various times it triggers those memories and can make us happy or sad. I knew a couple (Both Deceased now) who’s favorite song was Jefferson Starship’s “Nothing’s Gonna’ Stop Us Now” They had that song played at their wedding and when they renewed their vows. Both had mental and physical handicaps but they were a married couple and they were happy. When the woman died, her husband would cry every time he heard that song. Then he was found dead in his house almost 2 years later when an ex-wife came to check on his well-being. Then he was with his beloved spouse in death. Neither one was very old and I have some fond memories of them. We’d play cards ( My wife and I) and do things together and they were a lot of fun. Now, when I hear that song on the radio I think of them and the good times. I don’t cry. I am happy to think that even though they both had issues and the odds were against them because of their handicaps, they made it together! Even in death! ",
            "date": "Answered August 3, 2019",
            "views": "218",
            "upvotes": " Answer requested by Lalita Limpichart"
        },
        {
            "author_info": {
                "name": "Sheri Birk",
                "href": "/profile/Sheri-Birk"
            },
            "answer_text": "So, when a person gets goosebumps, it’s the skin reacting to a response in the nervous system. If you’re getting the goosebumps when you hear a song, it is a physical reaction to something within your body. Scientists have said that people that get goosebumps from listening to music are more in touch with their emotions that those that don’t. ",
            "date": "Answered August 3, 2019",
            "views": "24",
            "upvotes": "0"
        }
    ]
}