{
    "title": "Why do people hate Taylor Swift? - Quora",
    "tags": [
        "Taylor Swift (musician)",
        "Hate"
    ],
    "response": [
        {
            "author_info": {
                "name": "Natasha Yadav",
                "href": "/profile/Natasha-Yadav-12"
            },
            "answer_text": "Her dating life. The singer-songwriter’s dating life has been in news since her first song released. She wrote Tim McGraw about her then boyfriend who was going to college in another state. Taylor was only 16/17 when she wrote this. Since then her personal life has been a public fodder. Some of the famous men she has dated are Joe Jonas, Taylor Lautner, John Mayer, Jake Gyllenhaal, Conor Kennedy, Harry Styles, Calvin Harris and Tom Hiddleston. She is currently dating British actor Joe Alwyn for more than an year.Most of her relationships haven’t lasted more than three months. This has earned her the reputation of a serial dater.She publicizes her relationships. She likes to be seen with her man. Her PR team tips off the media about her whereabouts.She victimizes herself always. She blames, degrades, humiliates her exes in her songs. She portrays herself too innocent and calls out the men trouble.That Kanye-episode. Remember the time ‘Ye dropped his single ‘Famous’ and rapped about having sex with her? “I made that bitch famous”, is one of the lines. While Taylor belittled him for such derogatory lyrics, Kanye revealed that he had in fact made her listen to the song beforehand. His wife, reality star Kim Kardashian later posted video snippets of the same. Taylor’s goody-good reputation was gone.She is accused of having a fake friend-circle. Once upon a time, before the Kanye-Taylor 2.0 feud, Taylor was photographed too often with her girl gang that comprised of Victoria’s Secret models, actresses and singers. There were photos of them shopping, eating out, celebrating Fourth of July at her Rhode Island mansion, and they even shot for her Bad Blood video. Taylor was accused of hiring successful, tall, slim models into her group. When the feud between Kanye and her took storm most of her friends kept numb and didn’t support her publicly. Soon the group fell. These days her friend circle has reduced in number.She dated Calvin Harris for 15 months. During their time they both worked on a song called This Is What You Came For. Harris produced the song while Rihanna sang it. Taylor wrote the song under a pseudonym and even gave background vocals. But as soon as they split and the song became popular she revealed the same. Why do this anonymously when you want to take credit later? This led to Harris and Taylor having a bad blood.She cheated on Calvin Harris with Tom Hiddleston. In her song Gorgeous she sings And I got a boyfriend, he's older than us/He's in the club doing, I don't know what/You're so cool, it makes me hate you so much, hinting at the same.She exposed her affair with Hiddleston too much, globe-trotting with him, celebrating Fourth of July together, and kissing on the rocks.No matter how many charities she does, there’s no denying she is paparazzi hungry. Her PR team keeps her in news. She is polished in every photos - how? She’s always prepped for them!She shades other celebrities. She has a history of bad blood with Katy Perry, Kim Kardashian, Nicki Minaj, Tiny Fey and Amy Poehler, Camilla Belle, most men she has dated, and several others.Accusations of being a fake feminist. Taylor has been accused of fake feminism several times. Reason? She didn’t stand up for Kesha when she took Dr Luke to court for raping her. She tries to maintain a clean image and stays away from taking sides.She kept silent during the elections. Unlike other celebs that openly supported Hilary Clinton against Donald Trump and urged their fans to vote for her, Taylor stayed silent on the issue.",
            "date": "Answered January 30, 2019",
            "views": "425",
            "upvotes": " View 162 Upvoters",
            "upvoters": [
                {
                    "user_id": "Niharika Sinha",
                    "user_href": "/profile/Niharika-Sinha-78"
                },
                {
                    "user_id": "M.ABDULLAH BAIG",
                    "user_href": "/profile/M-ABDULLAH-BAIG"
                },
                {
                    "user_id": "K Satya Durga Sravanthi",
                    "user_href": "/profile/K-Satya-Durga-Sravanthi"
                },
                {
                    "user_id": "Tina",
                    "user_href": "/profile/Tina-1949"
                },
                {
                    "user_id": "Good Vibes",
                    "user_href": "/profile/Good-Vibes-357"
                },
                {
                    "user_id": "Kamesh Viruzz",
                    "user_href": "/profile/Kamesh-Viruzz"
                },
                {
                    "user_id": "Nilan Bagchi",
                    "user_href": "/profile/Nilan-Bagchi"
                },
                {
                    "user_id": "Carra Jean",
                    "user_href": "/profile/Carra-Jean"
                },
                {
                    "user_id": "Josiah Rivera",
                    "user_href": "/profile/Josiah-Rivera-18"
                },
                {
                    "user_id": "Tanawat tamee",
                    "user_href": "/profile/Tanawat-tamee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Isaac Wess",
                "href": "/profile/Isaac-Wess"
            },
            "answer_text": "Undeserving Accomplishments.  At the 58th Annual Grammy Awards, Swift won Album of The Year for her 5th studio album titled 1989. Though I’m personally not surprised because the Grammys have historically made silly, almost laughable choices, their decision made very little sense. 1989 wasn’t astounding on any front. The lyrics and perspectives were nothing new for her. Swift brought next to nothing refreshing to the 1980’s synth-pop sound she borrowed from. I enjoyed the album but Swift and her team crafted catchy, accessible music. Nothing more. Kendrick Lamar’s To Pimp A Butterfly was clearly the better album. It didn’t sell as well, but it blew Swift, and really any prominent album of 2014-15 out of the water lyrically, creatively, and stylistically. What’s so surprising is that Lamar won every Rap-related category, even beating out popular rap artists Drake and J. Cole. But suddenly when his album was competing for Album of The Year, sales must’ve been a factor because that’s that only reason why 1989 could’ve won. A far more challenging and forward-thinking listen, TPAB was considered the #1 album of the year by 51 different publications and is the most critically acclaimed album of the decade so far. But then again, you can’t be upset with Taylor for the winning the Award. She makes the music. Someone else makes the decision. It’s not her fault she won.  That Whole Kanye West Situation.  I wasn’t really following what exactly occurred but in February 2016, rapper Kanye West released an album called The Life of Pablo. The track-listing included a song titled “Famous” in which Kanye West said: For all my Southside niggas that know me best I feel like me and Taylor might still have sexWhy? I made that bitch famous (Goddamn)I made that bitch famous For obvious reasons, this caused a controversy and media frenzy. West and his wife, Kim Kardashian, quickly replied stating that he had an hour long conversation with Swift in which he asked for Swift’s permission of the lyrics and she approved it. Taylor’s representatives vehemently denied such claims, citing that they didn’t know about the moment in which he refers to her as a “bitch” and that West only asked Swift to release the song on her twitter account, which she apparently refused. She also apparently warned West about releasing a song with such a strong misogynistic message. Kim Kardashian eventually revealed the video of the phone-call. Swift appeared to have been aware of every lyric and happily agreed. Though the video is limited, it was never confirmed West asked Swift to release the song on her twitter account, or that Swift warned Kanye about the misogynistic tone to his lyrics. Following the media frenzy, Swift reportedly said “I don’t understand why Kanye West, and now Kim Kardashian don’t just leave me alone.” Though Swift or West is yet to disclose the full details of the incident, it’s obvious she tried to portray herself as a hero but looked more like a duplicitous serpent.  Average Musical Skills.  I want to start off by saying that I don’t think of Swift as some lucky, talentless pop-star who makes totally flavorless, formulaic, forgettable music. I don’t think of her as joke of an artist either. I think she possesses legitimate talent. But what is Swift even really that good at? I’m not talking about intangibilities like writing lyrics that resonates with her fan-base. I’m discussing skills that can be evaluated somewhat objectively. Swift, as a vocalist, lacks range and power. To me ears, the tonality of her voice isn’t that distinct. Her song-writing skills are good, but she doesn’t really explore creative ways to discuss her topics related to romance and heartbreak. Swift is a music producer in the weakest sense, but even if she truly was, the production, specifically on 1989 is nothing more then well-arranged. It’s not intricate, challenging, or ambitious in any way. As a pianist and guitarist, she’s only decent. I don’t even find her music marked by strokes of uniqueness, like Lorde or even Charli XCX. For a superstar, Swift has just competent skills across the board.  Those are all the reasons I could think of. ",
            "date": "Updated December 14, 2018",
            "views": "221",
            "upvotes": " View 144 Upvoters",
            "upvoters": [
                {
                    "user_id": "K Satya Durga Sravanthi",
                    "user_href": "/profile/K-Satya-Durga-Sravanthi"
                },
                {
                    "user_id": "Jasmine Malik",
                    "user_href": "/profile/Jasmine-Malik-18"
                },
                {
                    "user_id": "Yến Đặng",
                    "user_href": "/profile/Yến-Đặng-11"
                },
                {
                    "user_id": "Kamesh Viruzz",
                    "user_href": "/profile/Kamesh-Viruzz"
                },
                {
                    "user_id": "Nilan Bagchi",
                    "user_href": "/profile/Nilan-Bagchi"
                },
                {
                    "user_id": "Carra Jean",
                    "user_href": "/profile/Carra-Jean"
                },
                {
                    "user_id": "Joe Heene",
                    "user_href": "/profile/Joe-Heene"
                },
                {
                    "user_id": "Chelsey Bhushan",
                    "user_href": "/profile/Chelsey-Bhushan"
                },
                {
                    "user_id": "Simone Tsoi",
                    "user_href": "/profile/Simone-Tsoi"
                },
                {
                    "user_id": "Rebecca Kang",
                    "user_href": "/profile/Rebecca-Kang-2"
                }
            ]
        }
    ]
}