{
    "title": "Why are the earphones used by musicians during concerts are used for? - Quora",
    "tags": [
        "Earphones",
        "Concerts",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eric Lund",
                "href": "/profile/Eric-Lund-15"
            },
            "answer_text": "Mostly they are listening to a mix of click track, themselves and the lead vocal so they can make sure they are playing in time, in tune and in the right place! Here’s an example of what a drummer might hear:  [I don’t know these guys, I just found the video on YouTube but it’s not a million miles away from the sorts of mix I’ve given to other drummers at other gigs]. Using In Ear Monitors allows the band to listen to things the audience can’t hear, which wasn’t possible when we used just big monitor speakers on the front of the stage, which the front few rows of audience would hear perfectly well. The most common thing the band will hear that the audience won’t is the click track and this allows the band to stay in time with pre-recorded tracks that they are playing along to. This would normally include extra keyboard lines and often extra backing vocal tracks. Sometimes there’s virtually a full orchestra on there which the audience think is coming from the keyboard player - it’s not because (s)he’s doing the piano and/or Hammond organ line. Sometimes we use click tracks even when there’s no pre-recorded backing on there, just because the song works best at a very specific tempo. This is particularly true for accompanying dancers who need the music to go at the right speed for them to dance to. Sometimes bands will use IEMs even if they’re not playing to a click, just because the monitor mix hits their ears direct, without being mixed in with all the other musicians’ monitors or the noise of the audience or any other distraction. People usually find they listen at lower levels with IEMs than with floor monitors, so it’s good for their health too. ",
            "date": "Answered January 20, 2017",
            "views": "71",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tony Shen",
                    "user_href": "/profile/Tony-Shen-64"
                },
                {
                    "user_id": "John Doe",
                    "user_href": "/profile/John-Doe-27916"
                },
                {
                    "user_id": "Gautam Sardana",
                    "user_href": "/profile/Gautam-Sardana-1"
                },
                {
                    "user_id": "Lael T. Mark",
                    "user_href": "/profile/Lael-T-Mark"
                },
                {
                    "user_id": "Nathan Avery Drake",
                    "user_href": "/profile/Nathan-Avery-Drake"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gary J Brunclik",
                "href": "/profile/Gary-J-Brunclik"
            },
            "answer_text": "There are a number of reasons people use IEM’s Other wise known as in ear monitors. First being saving your ears. And your voice. When you have a good monitor engineer and you get used to wearing IEM’s you can get a really good mix. This also helps the Front of House Engineer because guitar cabinets (which are typically the loudest on stage) can be relocated under the stage, behind the stage, which serves two purposes. One it makes the stage look cleaner and therefore set pieces to make the stage look cool can be utilized, plus the cabinets being off stage and pointed away from the crowd allow the players to get that get crunchy sound at high volume without drowning the stage in guitar. The FOH engineer doesn't have to fight stage volume with the PA. Makes for a much cleaner mix. Second of all with a good monitor engineer the singer or whoever else is wearing IEM’s can get a custom mix without the bleed of instruments. Guitars can be panned left and right so can any instrument. That sets an actual stereo mix for the wearer and the instruments are splayed across a stage in the natural way you would hear them out front. The guitar player on stage right has his guitar straight up, the other guitar player stage left is panned left. The singer can pan guitars left and right, keyboards left and right even drummer pan their drums so when they roll around the kit it follows the panning left to right. All this with the greatest advantage of saving your ears from high volume causing hearing loss, tinitus, and other related problems. And you can add reverb for depth, some ambience mics that face the crowd to pick up the crowd (you lose some spatial harmony because your ears are now full and kind of cutting off ambient noise around you. There are all some great advantages to wearing them. One of the biggest is that singers don’t have to scream as loud and can generally hit better pitch with a good IEM mix. Virtually everyone wears them now including the technicians backstage so they can hear their principals mix and fix stuff they hear going wrong. ",
            "date": "Answered March 1, 2018",
            "views": "24",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lisa Steiner",
                    "user_href": "/profile/Lisa-Steiner"
                },
                {
                    "user_id": "Tim Broberg",
                    "user_href": "/profile/Tim-Broberg"
                },
                {
                    "user_id": "Carl Lambie",
                    "user_href": "/profile/Carl-Lambie"
                }
            ]
        }
    ]
}