{
    "title": "Why do video editors prefer macOS over Windows? - Quora",
    "tags": [
        "Video Editor",
        "macOS (operating system)",
        "Video Editing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aristobulus Lam",
                "href": "/profile/Aristobulus-Lam"
            },
            "answer_text": "I think the most people prefer macOS over Windows is because of the brand image and the terrible pricing strategies on Adobe’s side. Let me explain. When you get things from Apple, you know that it’s going to work. It is downloadable from the Mac App Store so you know that you won’t be scammed. Apple has the strong brand image that Adobe can only dream about. Also, there’s price. Final Cut Pro costs $299 while Adobe Primiere Pro costs $19.99 every month. For $299 you get a lifetime license for Final Cut Pro including future upgrades but on the Adobe side it only gives you around 15 months of Primiere Pro. Final Cut Pro also offers built-in effects and animations save for really complicated ones but on Adobe you need to get After Affects and Primiere Pro to achieve the same thing. It is also insanely cheap if you are using it for school. The Pro education pack includes Final Cut Pro (video editing), Logic Pro (sound editing), Motion (graphics), Compressor (file conversion) and MainStage 3 (further sound editing) for $199. Adobe cannot compete with this pricing. On the free side, iMovie is included with MacOS so you don’t have to settle with free versions of editing tools that lock you to a certain resolution or frame rate. ",
            "date": "Answered January 30, 2018",
            "views": "208",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Valentin Ionaș",
                    "user_href": "/profile/Valentin-Ionaș-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hrisheekesh Sharma",
                "href": "/profile/Hrisheekesh-Sharma"
            },
            "answer_text": "Final cut X This is a great video editor, and dominated the industry till Final cut X was released. Its still a good editing software just that they messed up. What makes this a reason ? Well its only available for Mac. Film School Majority of the film school which provide laptops , usually provide mac. This may lead to people just continuing with mac as they just dont want change and if they learnt with Final cut you has reason #1 to not change. Hardware Now this may if you consider desktops, you can build a better custom rig at the same price of a imac or trash can. However we can agree that imac or the mac pro is pretty good (rendering , processing etc) so people may just buy a ready made setup like a imac which is trust worthy instead of building a pc (Rare cases). However many own a macbook probably the best portable editing workstation, this may be another reason. (However there are better laptops than a macbook) Blind Few people are blinded by the brand. (personal opinion) I feel that this is what apple does…it doesnt go out of its way to advertise but you have these customers who cant shut their mouth about great their apple product is (which may be true to some extent but i disagree). So this probably creates that thought that apple is superior and people may tend to use a mac as its a trend ? Bottom line : Its all about personal preference. An editor will chose the software or os or setup he is comfortable with to give his best result. ",
            "date": "Answered January 28, 2018",
            "views": "107",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ashwin S H",
                    "user_href": "/profile/Ashwin-S-H"
                }
            ]
        }
    ]
}