{
    "title": "Why can't BTS have girlfriends? - Quora",
    "tags": [
        "BTS (K-pop group)",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Min Suga",
                "href": "/profile/Min-Suga-311"
            },
            "answer_text": "Ok, so I am Korean and I know many saesangs..( I myself am not a saesang, I don't like seasangs tbh, I get all these info because my cousin sister is a saesang ), Some level 4 and level 5 saesangs told me that six BTS members ARE currently dating..they also said that some of the members broke up ( because of the pressure of work ), but again started dating from 2018/2019..one of the hyung line member broke up this year, as saesangs said.. They got to know that Namjoon, Jk and Tae are dating since 2017..... Saesangs also said that Dispatch was supposed to expose one of the member this October but Bighit is paying dispatch, so I don't think BTS will be exposed any time sooner..now listen, these are all the information I got, its not 100℅ proven but we will make ourselves look stupid if we say they don't have gf or they never dated..its not possible, like come on, they are guys in their 20's..they do have a love life.. ",
            "date": "Answered September 4, 2020",
            "views": "260",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Guljar Singh",
                    "user_href": "/profile/Guljar-Singh-44"
                },
                {
                    "user_id": "Myuri Navaratnam",
                    "user_href": "/profile/Myuri-Navaratnam"
                },
                {
                    "user_id": "Ei Sora",
                    "user_href": "/profile/Ei-Sora"
                },
                {
                    "user_id": "Jyotshna Chauhan",
                    "user_href": "/profile/Jyotshna-Chauhan-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lil- Bug",
                "href": "/profile/Lil-Bug-4"
            },
            "answer_text": "Because as K-Pop stars, they Must keep up their Appearances. I believe that if they end up getting Girlfriends, they will start losing fans, as well as K-Pop stans wanna see their Bias single. Plus I also believe if they got girlfriends they wouldn’t get as many songs Recorded and Published, as they would be Too busy. (my Thoughts, I know that Many kpop artists who have Gotten Girlfriends/Boyfriends normally end up getting kicked out of Bands and Losing company Production!) ",
            "date": "Answered August 17, 2019",
            "views": "159",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Guljar Singh",
                    "user_href": "/profile/Guljar-Singh-44"
                },
                {
                    "user_id": "🌸 sugainmytae 🌸",
                    "user_href": "/profile/sugainmytae"
                },
                {
                    "user_id": "Haley Sullivan",
                    "user_href": "/profile/Haley-Sullivan-38"
                }
            ]
        }
    ]
}