{
    "title": "Why do some Turks from the Black Sea say that they didn't know Armenians, when the Hemshin people are there? - Quora",
    "tags": [
        "Armenian Ethnicity and People",
        "Armenia",
        "Turkish Ethnicity and People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cem Arslan",
                "href": "/profile/Cem-Arslan-2"
            },
            "answer_text": "Because they don’t. For one, the Hemshin population of Turkey is effectively confined to the provinces of Rize and Artvin. The two ‘Black Sea Regions’ according to the NUTS(Nomenclature of Territorial Units for Statistics) system are comprised of a total of sixteen provinces including these two. That’s fourteen provinces full of ‘Turks from Black Sea’ who likely never even saw a Hemshin before. Even in these provinces it isn’t a lot. These two provinces have a population of nearly half a million people, and the Hemshin population of Turkey is just 21.000. That’s four percent of the population in Rize and Artvin: it’s highly likely many of the people there didn’t meet a Hemshin either. Then there is the question: Are Hemshins Armenians? They are of Armenian origin, that is known historical fact, but for centuries they intermingled with Laz and Turkic populations. Over time, they evolved into a distinct culture of their own. A lot of Hemshins do not even acknowledge their Armenian origins, and a good deal of those who do acknowledge it no longer see themselves as Armenian. Some of the remaining who acknowledge themselves as Armenian place little value or emphasis on it: you could know one for years before learning he considers himself an Armenian. The Hemshins are few enough as-is, before adding the criterias of not only considering himself Armenian and placing enough importance on that to make it known to people. That’s how many Hemshins out there? A thousand? That’s why some Turks from Black Sea say they didn’t know Armenians. They don’t. ",
            "date": "Answered July 13, 2018",
            "views": "36",
            "upvotes": " View 37 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gün Arslanyıkar",
                    "user_href": "/profile/Gün-Arslanyıkar"
                },
                {
                    "user_id": "Süleyman Akhan",
                    "user_href": "/profile/Süleyman-Akhan"
                },
                {
                    "user_id": "Aliye Solaker",
                    "user_href": "/profile/Aliye-Solaker"
                },
                {
                    "user_id": "Floki Vilgerðarson",
                    "user_href": "/profile/Floki-Vilgerðarson-1"
                },
                {
                    "user_id": "Kutluk Ozguven",
                    "user_href": "/profile/Kutluk-Ozguven"
                },
                {
                    "user_id": "Ayse T. Dogu",
                    "user_href": "/profile/Ayse-T-Dogu"
                },
                {
                    "user_id": "Aykut Saribiyik",
                    "user_href": "/profile/Aykut-Saribiyik"
                },
                {
                    "user_id": "Toğrul Dzhabrailov",
                    "user_href": "/profile/Toğrul-Dzhabrailov"
                },
                {
                    "user_id": "Talha Yalta",
                    "user_href": "/profile/Talha-Yalta"
                },
                {
                    "user_id": "Osman Aydin",
                    "user_href": "/profile/Osman-Aydin-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Batuhan Yıldız",
                "href": "/profile/Batuhan-Yıldız-3"
            },
            "answer_text": "It’s because even most of the Hemshin people say that they didn’t know Armenians. Hamshenians are living in Eastern Black Sea region and even there, they’re not well known due to their dwindling numbers.  Photo by Umut Kaçar Also most of Hamshenians, as most of the time very devout Muslims, reject Armenian identity with religious reasons. It’s very common for Eastern Black Sea people who actually talk a local language (Laz, Georgian, Romeika, Hamshenian) define themselves as Kypchak Turks. That’s not true of course. I heard this claim from a very close Hamshenian friend of mine too. I was shocked a little bit of course and even that I tried to prove that the language his grandfather speaks is an Armenian dialect he rejected these and accused me with being a seperatist. As a Turk it was a little bit tragicomic to me, but my countrymen are very famous with their stubbornness and patriotism so… Eastern Black Sea region is mostly very religious and patriotic. For a great majority of inhabitants, Turk equals to Muslim and Armenian/Greek equals to heathen. Lazs and Georgians are more okay with their ethnicity. ",
            "date": "Answered July 29, 2018",
            "views": "26",
            "upvotes": " View 27 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jane Doe",
                    "user_href": "/profile/Jane-Doe-5456"
                },
                {
                    "user_id": "Ayse Bulan",
                    "user_href": "/profile/Ayse-Bulan"
                },
                {
                    "user_id": "Aliye Solaker",
                    "user_href": "/profile/Aliye-Solaker"
                },
                {
                    "user_id": "Oguzhan Sengul",
                    "user_href": "/profile/Oguzhan-Sengul"
                },
                {
                    "user_id": "Kanbur",
                    "user_href": "/profile/Kanbur"
                },
                {
                    "user_id": "Floki Vilgerðarson",
                    "user_href": "/profile/Floki-Vilgerðarson-1"
                },
                {
                    "user_id": "Kristian Minasyan",
                    "user_href": "/profile/Kristian-Minasyan-1"
                },
                {
                    "user_id": "Nöktah Lehman",
                    "user_href": "/profile/Nöktah-Lehman"
                },
                {
                    "user_id": "Toğrul Dzhabrailov",
                    "user_href": "/profile/Toğrul-Dzhabrailov"
                },
                {
                    "user_id": "Talha Yalta",
                    "user_href": "/profile/Talha-Yalta"
                }
            ]
        }
    ]
}