{
    "title": "Why is Nicki Minaj such a good rapper? - Quora",
    "tags": [
        "Nicki Minaj (musician)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Derek Ahlswede",
                "href": "/profile/Derek-Ahlswede"
            },
            "answer_text": "I'd say it's the combination of growing up with a drug addicted father and studying singing and acting at La Guardia high school. Hip hop, in a large way, is an expression of the troubles and adversity one has experienced in life (until you can hopefully rap about how you have overcome those troubles and are now successful). Keep in mind, this is a similar upbringing to Tupac Shakur, who also studied the arts in a New York high school and grew up with an addict parent. I'm not comparing the two any further than that, but it makes sense to me that the combination of extreme family challenges, plus the opportunity to hone the expression of the feelings that those challenges have produced, makes for a good formula for being a good rapper. If you're quite attractive on top of that, it exponentially adds to the odds of success. ",
            "date": "Answered August 3, 2014",
            "views": "24",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Marcus Evans",
                    "user_href": "/profile/Marcus-Evans-141"
                },
                {
                    "user_id": "Kerdija Styles",
                    "user_href": "/profile/Kerdija-Styles"
                },
                {
                    "user_id": "Chirag Burad",
                    "user_href": "/profile/Chirag-Burad"
                },
                {
                    "user_id": "A Minaj",
                    "user_href": "/profile/A-Minaj"
                },
                {
                    "user_id": "Alex Hazard",
                    "user_href": "/profile/Alex-Hazard-1"
                },
                {
                    "user_id": "Christopher Ike",
                    "user_href": "/profile/Christopher-Ike"
                },
                {
                    "user_id": "Peter Victorian",
                    "user_href": "/profile/Peter-Victorian"
                },
                {
                    "user_id": "Artavion Cook",
                    "user_href": "/profile/Artavion-Cook"
                },
                {
                    "user_id": "Delaney Hart",
                    "user_href": "/profile/Delaney-Hart"
                },
                {
                    "user_id": "Katy Donahue",
                    "user_href": "/profile/Katy-Donahue"
                }
            ]
        },
        {
            "author_info": {
                "name": "Reginald Slater",
                "href": "/profile/Reginald-Slater-1"
            },
            "answer_text": "Nick Is something else most people see songs like anaconda and stupid hoe but I see songs like dear old Nicki,superbass,and the night is still young. Nicki is better and More successful than most and all the female rappers and most of the male ones . Nicki can sing play instruments and more and did I mention she can act. The rap game has been brainwashed by whores like bad Barbie and cardi b. Those are not rappers there strippers and payola using sluts. I think Nicki is the most and best female and probably male rapper. Her abuse form her father and the trama is what make her raps and lyricism is what makes her raps a success and my favorite rapper. love 💕 you 👸 ",
            "date": "Answered July 22, 2020",
            "views": "202",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Faduma Abshir",
                    "user_href": "/profile/Faduma-Abshir"
                }
            ]
        }
    ]
}