{
    "title": "Why has Jennie from blackpink come out with a solo song? Is she going to leave the group? - Quora",
    "tags": [
        "BLACKPINK",
        "K-Pop",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anhushree Munees",
                "href": "/profile/Anhushree-Munees"
            },
            "answer_text": "I would say “no” as most of the kpop idols these days release their solo songs to express their individual talents . As a group they all outshine equally and as a an individual a whole new character is been exposed .As a soloist a different way of singing (vocals, rapping ), Acting ,Dancing and lyrics are clearly seen. This can be noticed in JENNIE’s SOLO where she gave her best act . In addition to it , this can also be a new challenge — as being a soloist is where you have to express only yourself but as a group member you have to all participation equally and there are not much hurdles .So maybe for gaining a new experience idols might do so (just a small guess). When it comes to Company point of view this might be a trick to capture many people's heart or way to expand YG base by promoting solo albums for the idols . Recently BLACKPINK has started gaining more popularity and their fanbase BLINKS are increasing worldwide just like BTS (well I am a An ARMY and BLINK too).So maybe by making BLACKPINK to promote solo albums they might gain more popularity . Plus blackpink was created in such a way where LISA ,JENNIE, ROSE,JISOO are westernized more and the group is totally perfect with visual rapping vocals and dance ..this benefits them a lot and they are succeed in bringing a change in kpop more different from other female bands. By promoting solo albums doesn't mean they disband from the group . It is like an hobby or a secondary backup career for them . Also it us a new way to outcast their individual hidden talents …and grow more .  ",
            "date": "Answered November 18, 2018",
            "views": "13",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mohammad Nadeem",
                    "user_href": "/profile/Mohammad-Nadeem-263"
                },
                {
                    "user_id": "Lindsey Lee",
                    "user_href": "/profile/Lindsey-Lee-144"
                },
                {
                    "user_id": "Jennie Robinson",
                    "user_href": "/profile/Jennie-Robinson-24"
                },
                {
                    "user_id": "Nomy Ml",
                    "user_href": "/profile/Nomy-Ml"
                },
                {
                    "user_id": "Soodie Sooh",
                    "user_href": "/profile/Soodie-Sooh"
                },
                {
                    "user_id": "Eden Mcleod",
                    "user_href": "/profile/Eden-Mcleod-2"
                },
                {
                    "user_id": "Deepa Sharma",
                    "user_href": "/profile/Deepa-Sharma-194"
                },
                {
                    "user_id": "Kwon Jiyoon",
                    "user_href": "/profile/Kwon-Jiyoon"
                },
                {
                    "user_id": "Kila Mel",
                    "user_href": "/profile/Kila-Mel"
                },
                {
                    "user_id": "Priscilla Rios",
                    "user_href": "/profile/Priscilla-Rios-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jung Taehee 정태희",
                "href": "/profile/Jung-Taehee-정태희"
            },
            "answer_text": "You probably thought this since her solo m/v came out today. (BTW plz watch her mv)  But like the other answer, members of groups can be a solo artist without disbanding from their group. This is actually beneficial to them as once their group disbands, they have a second career they can continue on (i.e. Hyuna). So, no she isn’t planning to leave BlackPink (which honestly makes no sense, since BP is doing extremely well as of right now, despite only coming back with only a couple of songs) And another thing to note, Jennie is one of the first members of BlackPink to have a solo, but YG has plans to have all the other members immediately debut as solo-artists, not just Jennie’s.  ",
            "date": "Answered November 12, 2018",
            "views": "101",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lindsey Lee",
                    "user_href": "/profile/Lindsey-Lee-144"
                },
                {
                    "user_id": "Nomy Ml",
                    "user_href": "/profile/Nomy-Ml"
                },
                {
                    "user_id": "Soodie Sooh",
                    "user_href": "/profile/Soodie-Sooh"
                },
                {
                    "user_id": "Eden Mcleod",
                    "user_href": "/profile/Eden-Mcleod-2"
                },
                {
                    "user_id": "Ishanee",
                    "user_href": "/profile/Ishanee"
                },
                {
                    "user_id": "Kwon Jiyoon",
                    "user_href": "/profile/Kwon-Jiyoon"
                },
                {
                    "user_id": "Priscilla Rios",
                    "user_href": "/profile/Priscilla-Rios-15"
                },
                {
                    "user_id": "Ishani Sahoo",
                    "user_href": "/profile/Ishani-Sahoo"
                },
                {
                    "user_id": "Jeremy Jayanto",
                    "user_href": "/profile/Jeremy-Jayanto-1"
                },
                {
                    "user_id": "Emma Neel",
                    "user_href": "/profile/Emma-Neel-1"
                }
            ]
        }
    ]
}