{
    "title": "Why are IZ*One's Korean comeback songs so much better than their Japanese ones? - Quora",
    "tags": [
        "IZ*ONE",
        "K-Pop",
        "Japan",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Luna Duwalls",
                "href": "/profile/Luna-Duwalls"
            },
            "answer_text": "I think it is because Iz*One’s Japanese music is really J-pop, different from their Korean releases that are K-pop. Although many k-pop groups release Japanese-only songs, in my opinion they are still what you would call K-pop in Japanese. Iz*One’s Japanese music is different from them, as it is made by Akimoto Yasushi a.k.a. the creator of the 48 groups and their music, which is actual J-pop. Iz*One has released Korean versions of their Japanese songs, Neko Ni Naritai and Gokigen Sayonara. A lot of Wiz*Ones have said that the Korean versions sound better, and this might be because the way Korean songs and Japanese songs are mixed/edited etc are different from each other. Many people have said that they liked Iz*One’s Korean releases better, as their Japanese songs sound old/messy etc. So you are not alone. However, most of these people are not Japanese. To the Japanese general public, Iz*One’s songs seem to be mostly good. I guess this is because a. It is J-pop, naturally fitting the Japanese people’s preferances more. b. Japanese people do not care too much about the sound or the meanings behind lyrics, like if there is a deep meaning behind something they will appreciate it, but if not then it’s okay even if it doesn’t make sense. (This is just my opinion, yes I am Japanese but not too knowledgeable on the typical Japanese way of thinking so don’t come for me.) I will conclude that you find Iz*One’s Korean songs better because the Japanese style does not suit your preferances. There is no ‘good’ or ‘bad’ to music, it depends on the person’s opinion. ",
            "date": "Answered December 1, 2019",
            "views": "209",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Starr Vasquez",
                    "user_href": "/profile/Starr-Vasquez-4"
                },
                {
                    "user_id": "Everest Wicca",
                    "user_href": "/profile/Everest-Wicca"
                },
                {
                    "user_id": "Samuel McCredie",
                    "user_href": "/profile/Samuel-McCredie"
                },
                {
                    "user_id": "Kripa Shrestha",
                    "user_href": "/profile/Kripa-Shrestha-44"
                }
            ]
        },
        {
            "author_info": {
                "name": "Teana Chan",
                "href": "/profile/Teana-Chan"
            },
            "answer_text": "Probably because you just prefer Kpop over Jpop music. Believe it or not, Jpop actually has a distinct sound/style too and the Japanese songs IZ*one releases are done as if they were a Jpop group (and not just korean songs translated in to Japanese). So it’s not that the Korean ones are better per say, just your music taste preference is geared towards the Kpop style of music they release. Hopefully that makes sense! ",
            "date": "Answered July 17, 2019",
            "views": "201",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Starr Vasquez",
                    "user_href": "/profile/Starr-Vasquez-4"
                },
                {
                    "user_id": "Kripa Shrestha",
                    "user_href": "/profile/Kripa-Shrestha-44"
                },
                {
                    "user_id": "Matthias Lyan",
                    "user_href": "/profile/Matthias-Lyan"
                }
            ]
        }
    ]
}