{
    "title": "Why do ARMYs keep streaming BTS music videos? Like, trying to get it to 30m or so by watching the MV a few times. Aren't they basically making fake records? - Quora",
    "tags": [
        "BTS Songs",
        "Music Videos",
        "BTS (K-pop group)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ela Jackson",
                "href": "/profile/Ela-Jackson-1"
            },
            "answer_text": "Well, you’re tehnically right. The views and the records are in the end fake because fans just keep streaming 24/7 to break youtube or other meaningless records imo which ultimately brings no one nowhere. Even if they don’t like the song, hardcore fans blindly stream and praise everything their favourites do which is ridiculous to me. Not liking a song that an artist releases that someone is a fan of does not equal that person hating them, it equals them having an opinion and a normal way of processing what they like or don’t like! A perfect example is, currently the most viewed video if I’m not wrong, Despacito which people didn’t stream on purpose. It has that amount of views because people from all around the world actually loved the song and it was played everywhere for so long that it started to get annoying. That’s why it got a lot of awards and was recognized worldwide. On the other side you have a heap of opinionless stans who sit around and stream a song for who knows how long for a song that they don’t even know if they like (probably not). They try to break youtube records and what happens in a few months? The song is forgotten and was never even a hit because it just wasn’t that good but hey- at least it has a large amount of views right? Smh Then again, the actual fake records would be considered ones that are made by bots or paid so it’s really a matter of opinion of what someone views as fake. The only thing that I have to emphasize is the fact that ARMYs are definitely not the only ones doing it like this question seems to indicate. It’s a well known thing amongst all k-pop fans- how do you think Blinks made it to almost 500 million views in a month on Blackpinks newest comeback song? Streaming. That’s why you have timings of when everything is released so that the fans can know when to start streaming. ",
            "date": "Answered August 21, 2020",
            "views": "159",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Scarlett Lee",
                    "user_href": "/profile/Scarlett-Lee-66"
                },
                {
                    "user_id": "Sze Sze Lui",
                    "user_href": "/profile/Sze-Sze-Lui"
                }
            ]
        },
        {
            "author_info": {
                "name": "Monty Dhiman",
                "href": "/profile/Monty-Dhiman-9"
            },
            "answer_text": "This is because Bts is highly discriminated among the artists. They are not considered as artists by many of the media and some people in the West. So when a western artist relases a project their fans don't need to worry about views and streaming because they get instant radio plays and they instantly feature in number of articles. But Bts has to do something really big for recognition. That's why Bts and Army have to work extra hard. Youtube views are the only thing we can do since they get very minimal to zero radio play. They aren't fake views. You saying like we bots or something. For your information Bts has the biggest fandom in the world. So when Bts works and practice hard for 18 hours, Army also works hard to get them recognition. Because that what is in our hands. ",
            "date": "Answered August 22, 2020",
            "views": "32",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Y. C. Huang",
                    "user_href": "/profile/Y-C-Huang-3"
                }
            ]
        }
    ]
}