{
    "title": "Why did so many rock and roll stars use lyrics with Satan so often? - Quora",
    "tags": [
        "Rock Stars",
        "Rock and Roll Music",
        "Song Lyrics",
        "Rock Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jessica Parkerson",
                "href": "/profile/Jessica-Parkerson-1"
            },
            "answer_text": "Well in my personal opinion I honestly believe they were paying homage to their lord. I have always loved rock music and still do, even as a Christian, but it is crazy to me how many songs were my absolute favorite's that are about the devil! I didn't even realize what I was listening to until I got older. I learned that rock music may have seemed very innocent from the beginning but look how it has progressed and morphed into what it is today. I think Robert Johnson was the first one to sing about selling his soul at the crossroads. By the end of his life he became paranoid that the hounds of hell were actually after him and this was like in the 1950's! If you look at the king of rock and roll, Elvis, whom supposedly sang gospel music sometimes really was the one who brought sexual dancing into the music industry. Yes it was all pop tart and would seem laughable today because it seemed so innocent to the dancing that is acceptable today but back then that was a big deal and the Christian's knew it and protested against it. I'd say they were right cause look at the stupid nasty dancing we have today like twerking, freak dancing, Harlem shake and so forth. It's like a new level of stupidity for dancing. But I digress. There is something hypnotic about rock and roll and how it can induce feeling's of awe, worship, anger, revenge, lust, abuse, selfishness and so forth. Are these not things that coincide with the devil? Rolling stones: Please to meet you, hope you guess my name. Marilyn Manson, Judas priest, Ozzy, and many contemporary rock bands. On a conspiratorial note I'd like to add that Christian rock music seems to be growing more dark and selfish every day and I wouldn't be surprised if the songs they sing may actually be to the devil. But then again, that's just my opinion so don't freak out on me folks. I made the mistake of making a comment about how I think Bruce Springsteen's music sucks and actually received death threats over it. Kinda funny though how people worship these singers....so star struck. ",
            "date": "Answered September 22, 2016",
            "views": "43",
            "upvotes": " Answer requested by Jacob Blaustein",
            "upvoters": [
                {
                    "user_id": "Stan Sinitsky",
                    "user_href": "/profile/Stan-Sinitsky"
                },
                {
                    "user_id": "Vivian Tan",
                    "user_href": "/profile/Vivian-Tan-46"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carlo Mazzini",
                "href": "/profile/Carlo-Mazzini"
            },
            "answer_text": "Is Bram Stocker a devil worshipper because he wrote “Dracula”? Is Saint-Saens a devil worshipper because he composed the Danse Macabre? Oh, I forgot! The Bible ALSO mentions Satan way too many times! And all of his pals! It’s art and representation. Tells nothing about the people. Alice Cooper uses a lot of what some would call “satanic stage”, despite being a devout Christian, and doing a lot of charity work. More than some churches do. He said once: “It’s a stage, it’s a play. It’s like watching a horror movie”. So, why? Because they are artists and they have the license to do it. As any of us does. Nothing wrong about it. Here’s a letter from my favorite drummer, who is a member of my favorite band: Rock Groups Hardly Satanistic And I like this line, which is great for the bogus link you are putting as a comment: “I don't wish to offend anyone's genuine beliefs, as it is a fundamental tenet in my philosophy that people should believe what they choose to believe. It must be stated, though, that when you've \"got\" religion, like Siddhartha, you find it everywhere you look. And when you've got evil, you'll find it everywhere you look, too.” There you go. ",
            "date": "Answered September 23, 2016",
            "views": "487",
            "upvotes": " View 2 Upvoters"
        }
    ]
}