{
    "title": "Why do rappers like 6ix9ine and Lil Pump say the N-word and get away with it even though they aren't even black? - Quora",
    "tags": [
        "Lil Pump",
        "Rap Music",
        "Hip Hop and Rap Artists"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jason Todd",
                "href": "/profile/Jason-Todd-137"
            },
            "answer_text": "This is news to me. Randy Johnson’s answer seems to fit the best. We have come a long way since Eminem, who may be the only major rapper (post-NWA) to never use the N-Word. I have long theorized that he does use it in speech only amongst his homeboys in D-12, who are all Black. As shocking as he liked to be on record, even early-2000s Eminem knew better than to get on that third rail. But we’ve got a new generation out there now, and though I’m not nearly as immersed in hip-hop today as I was 10, 15 years ago, there are two dynamics that appears to be at work here: One: as I said, I’ve kind of aged out of the current genre of “Soundcloud” or “mumble-rap” And I would gather that most of us who came of age in the Public Enemy/Ice Cube/Ice T/EPMD era or the Eminem/Outkast/DMX/Jay -Z era similarly, just don’t pay a lot of attention to hip hop these days. So whereas it would have been front page news if Eminem said N-word in 2000, we’re not going to know who 69 or Lil Pump are in general, let alone if they said N-word. They are not on the national radar like Em or JayZ were so their controversies don’t really register with us. Two: We’ve traversed a couple of generations since Richard Pryor proclaimed he was never going to say “Nigger” again. (The irony is that Pryor did more to popularize “N-Word” than anyone.) Since then, “Nigger” transmogrified into “Nigga”. “Nigger” with the *ER* was an explicit racist statement usually uttered by Whites. “Nigga” or “Niggaz” has transformed into two meanings today: a) a still derogatory statement, utilized by Blacks to describe someone who is a thug or criminal; someone from the streets. At its most benign, it has applied to the stereotype of the lazy, ignorant black man on the couch all day. ( In a more genteel era the words “hooligan”, “scofflaw” and “ne’er do well” were used.) Of course, like Pryor, the word is is often used by some to describe themselves. Listen to “Real Nigga Roll Call” (by Lil Jon and Ice Cube) In the first part of the song, Lil Jon uses “Nigga” to describe both himself AND his enemies. The difference is HIS “Niggas” are pros, and the others are scrubs. The meaning is clear. In the second part, Ice Cube punctuates every line with “Nigga” he’s alternately describing himself, his enemies, his friends, snitches, or just using it as an exclamation. Again, the meaning is never in doubt. Of course, amongst a certain caste/generation of Blacks, it’s still derogatory, still used to describe those unruly elements from the streets. Chris Rock’s brilliant (but unsettling) riff on “Niggaz vs Black People” remains a case study to this day. Upper- and Middle-class blacks, West Indians, Native Africans — these people are not “Niggaz” in that pejorative. (Side: The fact that that routine has become appropriated by white nationalists in the years since is a meta side dish to the whole conversation. So too is the art of co-opting slurs in general; “Queer” used to be the worst thing you could call a gay man. Now it’s been irretrievably stolen to the point where it’s in the title of TV shows.) b) A general statement: this is where it gets tricky and why the word can have a different usage with Gen X and Millennials. Anyone can be a “Nigga” regardless of race. An action movie star, an athlete (“damn look at my nigga go!!”) It has devolved, in that sense, to the same level of “guy” “dude” “amigo” “asshole” “generic person in a crowd” and so on. Like “fuck” it has become a versatile word with a myriad of usages. The flip on that is that versatility inevitably becomes co-opted by people who may or may not be familiar with the full history of the word. Which is where it becomes problematic. Most times, the aim of the word is rarely in doubt. I personally remember being called a “Nigger” exactly once in my life. It was tossed at me by a white kid in the Catholic school I went to in the 80s. His meaning was explicit, direct, dehumanizing and with zero camaraderie in mind. I have never forgotten it. Now I’m sure I’ve been called “Nigga” by others in my personal life: friends, cousins, even my mother or father have shouted it at me when upset with something I did. But I don’t have any specific recollections of those instances because they meant nothing to me. In my culture, I have heard the word regularly. In casual conversation in my neighborhood, at cookouts, even in church. But that one, single use of “Nigger” with an “ER” hurled at me in oral violence — THAT moment is frozen in time for me and probably will be forever. So there is a definite difference. Other people have used the N-word who are not White, yet are not African-American: DJ Khaled (Palestinian), Rihanna (Bahamadian), Cardi B (Dominican) and so on. It tends to float right past the intended listener though, because, whether used as a pejorative or in the general, it’s not used in a particularly violent manner. Those three examples and, (I’m guessing) 69 and Lil Pump are part of that culture. They grew up hearing that word in their environments. No doubt though, things get dicey when we get into the word being used by whites — outside the realm of artistic endeavor. The most common example being whites singing along — word, for word — with a song that contains “Nigga”. We’ve seen this in youtube videos of suburban girls doing it. And recently there was that incident at the Kendrick Lamar show with Lamar seemingly perplexed that a white person would use the word. So there’s still questions about “Nigger” and “Nigga” that cry out for context and civility. But I think 69 and Lil Pump are safe. Whoever they are. ",
            "date": "Updated September 23, 2019",
            "views": "654",
            "upvotes": " View 76 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cameron Bentley",
                    "user_href": "/profile/Cameron-Bentley-19"
                },
                {
                    "user_id": "Rohit Gejje",
                    "user_href": "/profile/Rohit-Gejje"
                },
                {
                    "user_id": "Dillon Jeffrey",
                    "user_href": "/profile/Dillon-Jeffrey"
                },
                {
                    "user_id": "Randy Wes",
                    "user_href": "/profile/Randy-Wes"
                },
                {
                    "user_id": "Crispy",
                    "user_href": "/profile/Crispy-82"
                },
                {
                    "user_id": "Joey Lin",
                    "user_href": "/profile/Joey-Lin-52"
                },
                {
                    "user_id": "Gaurav Gupta",
                    "user_href": "/profile/Gaurav-Gupta-3005"
                },
                {
                    "user_id": "Aditya Vishwakarma",
                    "user_href": "/profile/Aditya-Vishwakarma-207"
                },
                {
                    "user_id": "Paul Peter Davey",
                    "user_href": "/profile/Paul-Peter-Davey"
                },
                {
                    "user_id": "Travis Donley",
                    "user_href": "/profile/Travis-Donley"
                }
            ]
        },
        {
            "author_info": {
                "name": "Randy Johnson",
                "href": "/profile/Randy-Johnson-1"
            },
            "answer_text": "They’re Latino, Puerto Rican and Cuban respectively, and probably grew up in urban environments where it’s common for the youth to use the word amongst each other, regardless of race. ",
            "date": "Answered September 5, 2018",
            "views": "41",
            "upvotes": " View 37 Upvoters",
            "upvoters": [
                {
                    "user_id": "A Day In The Life Of Richie Gillham",
                    "user_href": "/profile/A-Day-In-The-Life-Of-Richie-Gillham"
                },
                {
                    "user_id": "Alejandro De Olivera",
                    "user_href": "/profile/Alejandro-De-Olivera"
                },
                {
                    "user_id": "Wendy Wei",
                    "user_href": "/profile/Wendy-Wei-58"
                },
                {
                    "user_id": "Metcalf John",
                    "user_href": "/profile/Metcalf-John"
                },
                {
                    "user_id": "Gabriel Elkind",
                    "user_href": "/profile/Gabriel-Elkind-1"
                },
                {
                    "user_id": "Revenge Storm",
                    "user_href": "/profile/Revenge-Storm-3"
                },
                {
                    "user_id": "Melissa Foster",
                    "user_href": "/profile/Melissa-Foster-153"
                },
                {
                    "user_id": "Bryanna Lopez",
                    "user_href": "/profile/Bryanna-Lopez-3"
                },
                {
                    "user_id": "Joey Lin",
                    "user_href": "/profile/Joey-Lin-52"
                },
                {
                    "user_id": "Gaurav Gupta",
                    "user_href": "/profile/Gaurav-Gupta-3005"
                }
            ]
        }
    ]
}