{
    "title": "Why do I hate horror movies? - Quora",
    "tags": [
        "Movie Advice",
        "Horror (genre)",
        "Horror Movies",
        "Hate",
        "Movies",
        "Psychology of Everyday Life",
        "Interpersonal Interaction"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Kay",
                "href": "/profile/Jeff-Kay"
            },
            "answer_text": "Why do I hate horror movies? My question to you is, why are you asking this here? Really, everyone has different likes and dislikes for different reasons. I can’t begin to know why you like or hate something without actually knowing you, first. But, for the sake of an answer, here are a few possibilities… Horror is scary. Some people don’t like the feeling of being scared. They’re either sensitive to suspense, gore or frightful images, or they may have had an experience in their life that makes fantasy seem real.Horror is boring. Some people love RomComs. I simply despise them. They bore me, and I haven’t found one I’ve liked yet. My grandparents never watched horror, not because it frightened them, but because they simply weren’t interested.You simply haven’t found the type of horror you do like. There are number of sub-genres of horror, each with a different type of element. Creature features, ghost stories, slashers, aliens, body, thriller and many more. To make things even more complex, horror genres are often mixed with each other, AND even with other types of non horror, such as romance, drama, comedy, etc… You may yet find something you do like.You’ve simply told yourself you hate horror. Yeah, this happens. It’s like the kid I knew in grade school who said they didn’t like sugar (claiming they’d never tasted it). You haven’t really experienced a horror movie, or you’ve only seen one or more that were bad representations for you, so you’ve lumped the whole genre under your “hate” category.I don’t really know which one of the above fits the OP best, but I’m betting at least one hits the mark. ",
            "date": "Answered June 11, 2016",
            "views": "105",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Derek Bowen",
                    "user_href": "/profile/Derek-Bowen-1"
                },
                {
                    "user_id": "Stig Riesto",
                    "user_href": "/profile/Stig-Riesto"
                },
                {
                    "user_id": "Stephanie Poppe",
                    "user_href": "/profile/Stephanie-Poppe"
                },
                {
                    "user_id": "Nolan Surach",
                    "user_href": "/profile/Nolan-Surach"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex Marin",
                "href": "/profile/Alex-Marin-8"
            },
            "answer_text": "Well, why do you hate horror movies? Some people enjoy being terrified. The adrenaline, the atmosphere, the thought that you could die at any time could be very exciting for many. Our minds don’t realise it’s only a TV screen, since that’s a ridiculously new thing. Most like being afraid. Fear keeps us running. Small fears, like spilling our coffee, or bigger fears, like spilling nuclear waste into a massive bin of puppies. Imagine how bad that would be! I certainly wouldn’t want to irradiate some poor innocent puppies. Or, obviously, big fears that affect us more dirrectly, like having personal objects of value stolen. Or losing a limb. Or your life. Imagine how bland a truly perfect life where absolutely nothing would go wrong be! A world where literally everyone has the same opinions, and enjoy literally every single ounce of their lives. No wishes to be richer, live in another country, state, city or whatever. Others do not like to be afraid. Some people generate antibodies when they generate adrenaline, meaning that their body doesn’t like it. It’s the closest you’ll get to an adrenaline allergy, and it might influence you to dislike being scared Or you find the idea of a extremely cliche group doing cliche stuff in a movie dumb. ",
            "date": "Answered July 3, 2016",
            "views": "64",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hannah Lee",
                    "user_href": "/profile/Hannah-Lee-168"
                }
            ]
        }
    ]
}