{
    "title": "Why can't I hear my voice when I'm singing? - Quora",
    "tags": [
        "Singing Voice",
        "Voice",
        "Singing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Masimba Sitima",
                "href": "/profile/Masimba-Sitima-1"
            },
            "answer_text": "My opera teacher gave me a fantastic tip, it may be different if you’re singing amplified music (with a microphone) but I’m sure it applies none the less. Do not try to listen to your voice as you sing, instead focus on sensations e.g can you feel any strain in your throat, do you feel constricted in any way, this would indicate that you are doing something wrong and in that case it’s a good idea to get a teacher to listen to you in person and give you the correct guidance. If you fall in the habit of listening to your own voice you end up pushing and straining, you’ll find yourself unable to sing in some venues. Consider that your voice does not sound the same to your audience as you perceive it, I know in my case as a Spinto tenor that my voice sounds small to me when I’m singing above Ab4 to C5 but that’s not case in reality as it carries with plenty of ring known as squillo which I can feel in my head but can’t hear. Another tip is to try and imagine the note before you sing it, this is where ear training and good intonation are your friends. You want to be confident that the note will be correct before you even open your mouth, this requires fine control of your instrument. When you try to listen to yourself as you sing, you’re effectively catching up, trying to fix a note you’ve already sung when you should be thinking about the next one, this takes away from the feeling and emotion which is really what singing is all about. Good luck! ",
            "date": "Answered January 28, 2019",
            "views": "791",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Giang Hoang",
                    "user_href": "/profile/Giang-Hoang-16"
                },
                {
                    "user_id": "Kyle Hill",
                    "user_href": "/profile/Kyle-Hill-40"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arthur Raisfeld",
                "href": "/profile/Arthur-Raisfeld"
            },
            "answer_text": "People hear their own voices in two different ways - through the air by using their ears and through the bones in the head which transmit deeper tones. This is why people often don’t recognize their own recorded voices. That said, unless you are part of a very loud chorus or are playing the music you are singing along to VERY loudly, you should be able to hear your own voice. If you are playing your background music this loudly then stop! It may take a while but you will certainly damage your hearing. If this is not the case then you should be evaluated by an ENT who will probably have an audiologist administer a hearing test. ",
            "date": "Answered May 26, 2018",
            "views": "406",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Delilah Harris",
                    "user_href": "/profile/Delilah-Harris-2"
                },
                {
                    "user_id": "Bob Blechinger",
                    "user_href": "/profile/Bob-Blechinger"
                }
            ]
        }
    ]
}