{
    "title": "Why is the Gibson Les Paul Better than the Fender Stratocaster? - Quora",
    "tags": [
        "Gibson Les Paul",
        "Fender Stratocaster",
        "Gibson Guitars",
        "Fender Guitars",
        "Electric Guitars",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Martin Turner",
                "href": "/profile/Martin-Turner-57"
            },
            "answer_text": "The Stratocaster and the Les Paul helped to define the sound of rock and pop music since the 1960s. For the Les Paul sound, a Les Paul is far better than a Stratocaster. For the Strat sound, a Stratocaster is better. There are actually many guitars out there which are better than either of them, or can sound like either, or a mixture of both. The two guitars are archetypes, heritage guitars. There are some crucial differences which make them better than each for being what they are: Les Paul has a shorter scale length, for a deeper sound and easier bending, Strat has a longer scale length for a brighter sound and strings that return more quickly, perhaps for faster playing. Les Pauls have a thicker, heavier neck, at least on some models. Strats have a thinner neck. I always feel that you play ‘on’ a Strat neck, but ‘into’ a Les Paul neck. Strats have bright, single coil pickups. Les Pauls have deep, humbucking pickups with a warm, powerful sound. Strats have three pickups, Les Pauls have two. But Les Pauls have a tone control and a volume control for each pickup, and they work a little better. The bridge pickup on the Strat is harder to work with, which has led to many signature sounds developed. Strats have a tremolo arm, Les Pauls are heavier and have longer natural sustain. Strats have good access right up the neck on both sides, but they have a bolt-on neck, so there’s a place you have to work around. Les Pauls have a glued-on neck, with less of a heel, but less access from both sides.  I’ve been on the point of buying a Les Paul a few times, and always bought something else (or nothing else). Epiphone kindly sent me one of their Les Pauls, which I tend to lend out to people. There are many other guitars which do the Les Paul job better than the originals, in the sense that they also come equipped with coil-splitting so that they can get the ‘Strat’ sound. Actually, current Les Pauls, unless you are buying a complete reissue, also come with coil splitting and even phase splitting. But they still never feel and look like Strats.  I guess some people are conformists, and others are non-conformists, or anti-conformists. If I see someone playing a guitar make I don’t recognise, I’m really interested to find out more. If I see them with a Gibson Les Paul, or a Fender Stratocaster, I’m fine with it, but it doesn’t tell me much about them as an individual. If I see someone playing an unusual guitar (not necessarily a strangely shaped one) I always want to ask: why did you choose that particular guitar?  The guitars I play tend to be more Les Paulish than Stratish, but whenever I’ve been handed someone else’s Les Paul to play, it always feels a bit like playing someone else’s prized possession. Whenever I’ve been handed a Strat to play, I’ve instantly felt at home on it. Maybe it’s because I’m less used to that kind of guitar. But Strats are generally thought of as more ergonomic than classic Les Pauls.  As an object of desire, a Les Paul has more work on it, and is a ‘better piece of furniture’. But, then, they cost twice as much.  It’s your money. Take a choice and enjoy. ",
            "date": "Answered August 25, 2019",
            "views": "312",
            "upvotes": " View 146 Upvoters ",
            "upvoters": [
                {
                    "user_id": "James Kuczero",
                    "user_href": "/profile/James-Kuczero"
                },
                {
                    "user_id": "Ira Van den Heuvel",
                    "user_href": "/profile/Ira-Van-den-Heuvel"
                },
                {
                    "user_id": "William Scroggie",
                    "user_href": "/profile/William-Scroggie-2"
                },
                {
                    "user_id": "Michael Bellaria",
                    "user_href": "/profile/Michael-Bellaria"
                },
                {
                    "user_id": "Gary Beals",
                    "user_href": "/profile/Gary-Beals-1"
                },
                {
                    "user_id": "Greg Livorsi",
                    "user_href": "/profile/Greg-Livorsi"
                },
                {
                    "user_id": "Randolph C Henson",
                    "user_href": "/profile/Randolph-C-Henson"
                },
                {
                    "user_id": "Douglas Holden, Jr.",
                    "user_href": "/profile/Douglas-Holden-Jr"
                },
                {
                    "user_id": "Joe Mirino",
                    "user_href": "/profile/Joe-Mirino"
                },
                {
                    "user_id": "Dewey Smith",
                    "user_href": "/profile/Dewey-Smith-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elton Edgar",
                "href": "/profile/Elton-Edgar-1"
            },
            "answer_text": "This, my Quora questioner friend, is something no sensible guitar player should ask. Honestly, it’s akin to asking “Why is the color blue better than red?”. The answer to both, of course, is…it’s not. The flaw in the question relates directly to what’s being compared. Both are useful in different ways and are wholly dependent on their intrinsic characteristics…which the other doesn’t have. The guitar player and in turn a musician really is the crux of the matter. He/she is in essence a painter that uses sound producing musical instrument instead of paints and brushes as a means of expression. So, to say that one sound (Gibson Les Paul) is better than another (Fender Stratocaster) is conveying a severe limitation on the tools, palette and capabilities a musician could use to create their masterpiece. A Les Paul has a sound that is different than a Strat and vise versa. Because of those differences both are incredibly useful in diversifying the shape and sound of a song or piece of music. To somehow convince yourself that one will always be superior to the other would be like painting, but only in shades of orange because orange has been decided as “the best color”. The result would be something like:  Ehhh…interesting for a minute to a very niche audience…but, boring as hell in the long run to just about every person on Earth. Opening up your palette a little:  Yeah, it’s not everyone’s cup of tea, but it pops. Crack that palette a little wider and you might get:  Which is…just…wow. I hope this helps. ",
            "date": "Updated December 8, 2016",
            "views": "15",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Wayne Knazek",
                    "user_href": "/profile/Wayne-Knazek-1"
                },
                {
                    "user_id": "James Rendell",
                    "user_href": "/profile/James-Rendell-3"
                },
                {
                    "user_id": "Patrick Hopkinson",
                    "user_href": "/profile/Patrick-Hopkinson"
                },
                {
                    "user_id": "Thomas Offill",
                    "user_href": "/profile/Thomas-Offill"
                },
                {
                    "user_id": "Jonathan Ankin Dranoff",
                    "user_href": "/profile/Jonathan-Ankin-Dranoff"
                },
                {
                    "user_id": "Jesse Sutton",
                    "user_href": "/profile/Jesse-Sutton-8"
                },
                {
                    "user_id": "Norm LeDonne",
                    "user_href": "/profile/Norm-LeDonne"
                },
                {
                    "user_id": "Marco Antonio",
                    "user_href": "/profile/Marco-Antonio-301"
                },
                {
                    "user_id": "Alex Johnston",
                    "user_href": "/profile/Alex-Johnston-39"
                },
                {
                    "user_id": "Dino Mackay",
                    "user_href": "/profile/Dino-Mackay-1"
                }
            ]
        }
    ]
}