{
    "title": "Why does K-pop have such strong roots in R&B? - Quora",
    "tags": [
        "R&B Music",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mira Kim",
                "href": "/profile/Mira-Kim-32"
            },
            "answer_text": "It all started in 1992.The sun had risen in South Korea for the first time in decades; the first truly peaceful and democratic elections, held in late summer, would soon usher Kim Young-sam into the presidency. GDP was growing at a brisk clip, well over 7% in some years, and the average Korean youth had enough disposable income to begin purchasing pop music easily. K-Pop, at the time, however, was nothing special, nothing memorable. Into this morning calm burst 서태지와 아이들 (Seo Taiji and the Boys), dropping like a bomb a combination of a very danceable, hip-hop inspired beat, a catchy chorus, and some decent flow: 난 알아요 (I Know!).  This song went on to dominate the charts at #1 for the entire summer. To say that this was a sea change is an understatement. The music industry (and I do mean industry) saw an opportunity like nothing before, and within a year, more and more groups that borrowed heavily from hip-hop and R&B began to populate the charts. *** Let's rewind a bit: I love/hate the '80s.In the '80s, South Korea was in perpetual twilight. The economy was booming, but people lived under the iron-booted foot of a dictatorship. Strongman after strongman had ruled the nation ever since its inception in the 1940s; governments changed by assassination, a brief civilian interlude, and then a coup. Wealth remained concentrated in the hands of the generals of industry, the cronies of the dictators. But the youth were tired of it. Protests were a regular occurrence; at least once a summer, students would pour out and demonstrate, demanding democracy. As the '80s dragged on, they became even more desperate, more rage-filled, a matter not helped as everyone remembered the horrors of the Gwangju massacre. The students and demonstrators had a few things on their side, though: with the coming 1988 Seoul Olympics, it was impossible for the government to continue as it had, not with the world watching; with Reagan's refusal to support Marcos, it was clear that the dictator could not last. Those youth that weren't at home were studying and living abroad--mostly in America. The Diaspora.Not only did they mostly live in America, most lived in LA, living and working with the huge African-American population of the region, a mixture that would prove explosive in 1992, with a number memorialized in the community as 4/29. In the '80s, however, many of the diaspora ran stores in the underserved Black communities, selling groceries, sundries, or anything else that would move, including mixtapes. Surrounded by the protest-themed, experimental, golden age of hip-hop of the time, Koreans would send these tapes back home to their friends and relatives, influencing a whole generation of musicians. Back in the old country...That strain of protest music found fertile ground in a youth already predisposed towards all things American; American troops introduced breaking, which began to catch on in the counterculture. As an outlet of inchoate frustration, hip-hop and remix culture began to entwine itself everywhere. *** Back to the future, Gangnam StyleIn 2012, the Korean Wave inundated mainstream consciousness through Psy and his inescapable summer hit, Gangnam Style  Quickly racking up over a billion YouTube views on his official video alone, with innumerable others on subbed copies in a plethora of languages. It is impossible to deny the hip-hop influences in the song, but it would be incorrect to say that's all there is there: it borrows liberally from dance pop and electronica, to say the least, much like most modern Western pop music. The song's success immediately spawned an interest in K-Pop, in particular in many other K-Pop artists that seem to be the diametric opposite of Psy: slickly manufactured to hit all the right notes and tastes, like a cheeseburger and coke, as can be seen with Girls' Generation--cute here:  and racy here, in a song originally written for Ke$ha:  Or, for those whose tastes run towards the other side, thought a bit on the vamp/camp end, Big Bang:  Remember when I said music industry earlier, with emphasis on the industry? Let's take a look at where that came from. *** The crisis, and the power of industry.In 1997, five years after Seo Taiji and the Boys introduced a revolutionary new sound, they'd broken up. They'd gone full experimental, incorporating gangster rap, rock, and heavy metal, and the fans were not ready to follow.  Meanwhile, the Backstreet Boys, N'Sync, and any number of copycats were criss-crossing the globe and dominating charts everywhere, with their slick marketing, good looks, magnificent choreography, and catchy songs.  Korea had its confidence shaken with the economic crisis, known locally as the IMF crisis; massive conglomerates collapsed, the currency fell dramatically, and with it went the complacency. It reminded industry that it needed to not only do well in the protected shores of home, but compete globally, so Samsung and LG began their ascents into premier electronics companies; Hyundai went back to the drawing board and began focusing on quality over quantity in its automobiles, and invested ever more into developing high-tech shipbuilding. In this environment, some daring entrepreneurs decided to borrow heavily from the success of American R&B groups such as Destiny's Child, TLC, and the aforementioned boy bands, merge it with the hip-hop influenced music popular in Korea at the time, and add a dash of the exploding popularity of breaking as choreography. Groups would be built, created from whole cloth, becoming idols for a nation hungry for entertainment. DJ DOC, primarily a rap group, found success starting around this time with dance songs such as:  Sechs Kies and H.O.T. would hew closer to the \"boy band\" aesthetic, but their songs would frequently display heavy hip-hop influence:  But ballad singers and girl groups like Fin.K.L. would see more of the R&B influence (just wait until one of the singers starts her belt near the end!):  These groups proved popular at home--and with the diaspora abroad. What's more, some of the diaspora would come home, expressly with the intent of joining one of the new groups being made, bringing with them even more Western musical influences. What's more, these groups made money. Lots of it. So much so that several record labels would start becoming as influential and dominant as the Hollywood studios in the silent film era, among them SM Entertainment, JYP Entertainment, and YG Entertainment. The more money these companies got, the more money they spent in training and molding the new groups. The more popular those groups got, the more time the companies started spending on marketing them and tweaking them to better fit the audiences. Like Samsung, LG, Hyundai, and the other chaebol, Korea began to throw money towards experimenting, quality, and fast iteration--pop music was no different. It began to pay dividends. *** Hallyu.Hallyu, or \"the Korean Wave\", has been around a while, even if mainstream America hadn't heard of it, in part due to the language barrier. The combination of high production values, affordable cost for distribution rights, photogenic stars, and, in the case of television shows and movies, culturally accessible morality, led to Korean pop culture to start becoming a major export for the nation. At first, K-Pop targeted markets close to shore; many artists began to learn Japanese and Chinese to make albums in the native tongues of their overseas audiences. In many cases, the music they made was different enough from local pop music to attract interest from pure novelty, and their catchiness made them stars. During this time, artists such as BoA found much success in Japan, with Latin-influenced songs such as Valenti:  Rain found success too:  (Yes, this is the same Rain that Stephen Colbert had a feud with: Rain Dance-Off) In many cases, K-Pop also offers something different--for instance, in Japan, female idols which aren't necessarily \"cute\". For comparison, the difference between AKB48 (the former) and Girls' Generation (the latter) is staggering:    Stark differences like that seem to have pushed J-Pop idols in a wholly different direction; separated about a decade apart, compare J-Pop's Ayumi Hamasaki (former) with Namie Amuro (latter)     In every case, the music industry back in Korea found that the hip-hop sound sold, and sold well, and it became a sound they got hooked on. *** Good artists copy. Great artists steal.South Korea today is a relatively young country that has all the arrogance and energy of its youth. Every company seems to think that it can charge in and dominate an industry; Samsung, for instance, is doing to SSDs what it did to mobile phones five years ago, televisions ten years ago, and memory chips fifteen years ago. It's the same with K-Pop record labels. They've hired American choreographers who have worked with artists such as Beyoncé and bought songs written by hit songwriters. They're releasing new groups month to month, expecting some to fail and then refining the formulas that work. In other cases, they throw anything onto the wall and see what sticks: the recent popularity of \"cute\" girl group Crayon Pop's electronic/dance song 빠빠빠 (Bar Bar Bar), for instance, suggests that plain hip-hop influence isn't really driving K-Pop as much these days:  They will take this, and iterate on it over and over until it stops working, before trying something else. That isn't to say that hip-hop culture and breaking are gone from the Korean mainstream; it's there, still, just not nearly as dominant in K-Pop. After all, when beatboxing and breaking show up in a commercial for a real estate developer...  *** A brief note: the Korean language seems to lend itself fairly well to the act of rapping--it is *very* easy to form rhymes, for one, due to the way phonemes are assembled.  *** One final note: just because most visible K-Pop is manufactured and hip-hop influenced doesn't mean that Korea doesn't have a growing indie music scene, centered around Hongdae; for electronica, there's Idiotape, and for soft rock, there's Busker Busker; for more punk, there's Cherry Filter. Additionally, there are a lot of (purer) hip-hop/rap groups still around, even if they don't necessarily get as much air time as K-Pop itself: Epik High, Drunken Tiger, Jinusean, and Dok2, for instance. There are some more experimental ones outside of that, too: Clazziquai and Yukari come to mind. *** Edit 2015-11-16: updated videos, fixed typos. ",
            "date": "Updated November 26, 2015",
            "views": "83",
            "upvotes": " View 64 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jeremy Markeith Thompson",
                    "user_href": "/profile/Jeremy-Markeith-Thompson"
                },
                {
                    "user_id": "Arsène Hodali",
                    "user_href": "/profile/Arsène-Hodali"
                },
                {
                    "user_id": "Christina Gillam",
                    "user_href": "/profile/Christina-Gillam"
                },
                {
                    "user_id": "Toby na Nakhorn",
                    "user_href": "/profile/Toby-na-Nakhorn"
                },
                {
                    "user_id": "Shawn Turner",
                    "user_href": "/profile/Shawn-Turner-18"
                },
                {
                    "user_id": "Sundus Ansari",
                    "user_href": "/profile/Sundus-Ansari-3"
                },
                {
                    "user_id": "Carmen Hoo Jia Wen",
                    "user_href": "/profile/Carmen-Hoo-Jia-Wen-1"
                },
                {
                    "user_id": "Monz125 .",
                    "user_href": "/profile/Monz125"
                },
                {
                    "user_id": "Georgia Koutsopoulos",
                    "user_href": "/profile/Georgia-Koutsopoulos"
                },
                {
                    "user_id": "Gilbert Beilschmidt",
                    "user_href": "/profile/Gilbert-Beilschmidt-28"
                }
            ]
        }
    ]
}