{
    "title": "Why is BTS ARMY so defensive of BTS? - Quora",
    "tags": [
        "Kim Taehyung (BTS Member)",
        "The BTS Fandom",
        "BTS (K-pop group)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tomu Vanamo",
                "href": "/profile/Tomu-Vanamo"
            },
            "answer_text": "I was going to ask this myself. But yes I am an ARMY and multiple times some my friends say that their other friend groups do not like BTS, making me angry and defensive. Also inaccurately my little brothers friend just came to visit and said “Do you listen to that Japanese band called Dynamite, with one blue-haired, they have a Fortnite consert today”. And I knew from the beginning he meant BTS but just didn’t want to say as it was so wrong. I think one reason on the top of all already said is how personal it feels. I listen to many many bands butoverall kpop and especially BTS is in it with their personalities, cibtacting fans as people not just music makers. So when somebody says they don’t like them I start ti quetion why wouldn’t somebody like those people. And want to defend them, even if the point would be that the genre is just wrong. I know there are bands or artist taht I can day I don’t like but it feels like its on a different level. BTS has Antis, those who systematically hate, downvote, harras and complain. I just don’t listen to that certain rap genre I don’t like. And maybe question. But usually not even out loud. So we are defensive for we need to be. Also, its the “kpop is one genre” problem where as an ARMY I have got so much from listening to this band, that if somebody refuses just because the genre, I kind of want to provide second try. Lastly it is for we see how unfair the world can be to non-english speaking bamd in the American centered music industry. If we defend maybe a show host will too, instead of dismissing them. Or someday the radios will play even older korean song from them. ",
            "date": "Answered September 26, 2020",
            "views": "115",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Meena",
                "href": "/profile/Meena-338"
            },
            "answer_text": "I want to keep my answer very short and simple. when I was not an army I dint know about their struggles or anything and blindly disliked them and my friends would always just ignore me or try explaining to me what really happened but I never bothered but when I became an army I found out how much they struggled. Namjoon had an option to go solo when the boys were not doing well in the industry but he still picked them over his career. Yoongi who was scammed by people when he was younger when he sold his music his parents dint support him. J-hope left the grp but came back because of trust. Jungkook who was so small and went far to train and left his family. each member had so many struggles before they even got to debut and when they finally did they dint receive love but received so much hate despite getting all the hate they continued to trust each other and work their way to reach a happy end and they started making music that people found that helped them mentally. They went thru so much pain and yet made music for their fans to help them they taught their fans how to love themselves how they can speak themselves after doing all this their fans made a bond with BTS. they are thankful for how much BTS helped them how much bts made them laugh and smile in the worst time ever. So we armys protect and get defensive of the boys cause we don't want to hear things that previously hurt them so much we want to protect them from the hate its a small way of saying you protected us so we will protect you ",
            "date": "Answered October 14, 2020",
            "views": "75",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dianne Alex",
                    "user_href": "/profile/Dianne-Alex"
                },
                {
                    "user_id": "Tejaswini Karthik",
                    "user_href": "/profile/Tejaswini-Karthik-1"
                },
                {
                    "user_id": "Nhyca Fernandez",
                    "user_href": "/profile/Nhyca-Fernandez"
                },
                {
                    "user_id": "Peehu Saraogi",
                    "user_href": "/profile/Peehu-Saraogi"
                }
            ]
        }
    ]
}