{
    "title": "Why are African-Americans called ‘African-Americans’ and not just Africans? - Quora",
    "tags": [
        "African American Experience in the United States of America",
        "African American Culture",
        "African-American History",
        "Africans",
        "African Americans",
        "Black People",
        "Africa",
        "American Ethnicity and People",
        "Race and Ethnicity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Candice Addison",
                "href": "/profile/Candice-Addison-3"
            },
            "answer_text": "African Americans is an umbrella term for black people residing in North America ( particularly the United States). The term was coined by Rev. Jesse Jackson in the 1980’s and it over took the less desirable terms like Negro or Colored. The term African American may mean Black Americans who’s family have resided in the U.S. since the 18th century ( most popular association), African born in America, Caribbeans born in America, all black persons born in America fall under the umbrella term African American. The term A.A. does have its controversies with various black diaspora groups. Some African Americans don’t liked to be coined African American. Some Africans feel that its a misnomer as 4th Gen plus black Americans have no ties to Africa. Some Caribbeans feel it takes away their Caribbean heritage. However, I personally love this term. Ideally, people born in America should be identified as strictly American but that will never happen. Although many black people have been in America far longer than those who came at the turn of the century via Ellis Island, they are still stigmatized as outsiders. However, no matter where you go in the World, if you are black people will assume you are African. I literally have experience this when traveling to Europe. So personally, I have embraced it and take pride in it. Besides, there is nothing wrong with being African or African American! My ancestors were fully African and without them, I wouldnt be here today. For most people in the World their nationality comes first but Black people don’t have that luxury, their ethnic race comes first then their nationality. Why you ask? Because that is just the way of the World. Maybe this will change someday ( I doubt it) but this has put alot of things in perspective for me. I am African American! What does that mean? It means I am African first, African Always and then I am American. My ancestors have been in the U.S. since 1812 that I am aware of but I have no problem being called African because I am mostly and because the moment I step in a non- black foreign country (outside America), that is what most people think I am. I take pride in all of it. Being African, Being African American because all of it is apart of me. Different people have different perspectives but I love both of the titles.. 😘😘  ",
            "date": "Answered April 13, 2020",
            "views": "787",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kari Bradley",
                    "user_href": "/profile/Kari-Bradley-16"
                },
                {
                    "user_id": "Joseph Spear",
                    "user_href": "/profile/Joseph-Spear-3"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Idy-Udoma"
                },
                {
                    "user_id": "Malik Brooks",
                    "user_href": "/profile/Malik-R-Brooks"
                },
                {
                    "user_id": "Dee Lewis",
                    "user_href": "/profile/Dee-Lewis-82"
                },
                {
                    "user_id": "Pike Lynch",
                    "user_href": "/profile/Pike-Lynch"
                },
                {
                    "user_id": "Mahlatse Dukes",
                    "user_href": "/profile/Mahlatse-Dukes"
                },
                {
                    "user_id": "Robyn Esto",
                    "user_href": "/profile/Robyn-Esto"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nebojath Davis",
                "href": "/profile/Nebojath-Davis"
            },
            "answer_text": "Because we are neither one of those … we are hebrew Israelites, that's who came on those cargo slave ships to America, the Hebrew Israelites are the so called African Americans, and not the “Africans” they are the children of Ham they are not the same as the children of Shem which blood line goes to Isaac Jacob and the12 tribes of Israel, and for the record the messiah name is not Jesus his name in the Hebrew language is “Yahawashi”.  ",
            "date": "Updated September 13, 2020",
            "views": "304",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Roger Louis",
                    "user_href": "/profile/Roger-Louis-5"
                },
                {
                    "user_id": "Leon Barker",
                    "user_href": "/profile/Leon-Barker-14"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/William-Max-Jr"
                }
            ]
        }
    ]
}