{
    "title": "Why did Ke$ha go to rehab? - Quora",
    "tags": [
        "Kesha (musician)",
        "Drug Rehabilitation",
        "Singers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Asif Ahsan Khan",
                "href": "/profile/Asif-Ahsan-Khan"
            },
            "answer_text": "Ke$ha, now Kesha, checked into a Physical Medicine and Rehabilitation center in 2014 to deal with an Eating Disorder and possible Depression, reportedly [1](weight problem) brought on by her producer's criticism. That's all I knew.   And also that as part of her post-rehab fresh start, she changed her name! Dropped the Dollar sign \"$\" from her name. She also changed her Twitter handle to signify the new beginning. Instead of the previous @Ke$haSuxx, now she Tweets under the handle @KeshaRose on Twitter. | See: Kesha drops '$' from her name  But I also looked it up a little. I've put together an informative timeline below: Kesha's mother Pebe Sebert confirmed that the eating disorder Kesha was suffering with is bulimia nervosa and that she had been struggling with it since she was signed. She also alleged that Dr. Luke was partly the cause of Kesha's eating disorder, saying that Luke had allegedly told her to lose weight after he signed her, comparing the shape of her body to a refrigerator. Sebert asserted that this had caused Kesha's disorder to worsen. Kesha had completed her treatment on March 6, 2014, after spending two months in rehab. | See: Wikipedia: Kesha | Related link you should see: Ke$ha's Mom Blames Singer's Eating Disorder On Her Advisors  via ABC News  TMZ claimed to have first reported the news On January 3, 2014, (1/3/2014 8:20 PM PST):  Ke$ha -- In Rehab For Eating Disorder. And that the singer had checked into the the same rehab facility which Demi Lovato entered in November 2010, as she checked into Timberline Knolls Residential Treatment Center, the rehab facility in Lemont, Illinois. | See: MTV's report: Ke$ha Checks Into Rehab For Eating Disorder. After that headlines flooded the internet!  The Guardian reported on Monday 6 January 2014 08.46 GMT that, Two months after beginning treatment for for anorexia and bulimia, Ke$ha has reportedly completed the program and changed her musical alias to match her real first name – just plain Kesha. People (magazine) on 03/08/2014 AT 12:15 PM EST also confirmed that the 'Ke$ha to Kesha' - change is “official”.   On march 7, 2014, Kesha posted a photograph of herself smiling on the beach, with dyed red hair and a shirt reading \"IMA SURVIVOR\" on Twitter. [2]  Rolling Stone (magazine) July 11, 2014. Six months after Kesha entered a Chicago-area rehab center to get treatment for an eating disorder, the singer has opened up about the experience. In an in-depth op-ed piece for Elle UK, copied on the forum Atrl, she recounted the feelings that led to her eating disorder, her fears while getting treatment and how she ultimately found acceptance of herself. \"That first day at the treatment center was the scariest of my life,\" she wrote. Read more: Kesha Opens Up About Her Eating Disorder and Experience in Rehab \"I convinced myself that being sick, being skinny, was part of my job,\" the pop star writes. Rolling Stone (magazine) July 11, 2014. See this for more info:  Signs That Ke$ha Was Struggling Before Rehab as reported by People (magazine). On 10/16/2014 TMZ reported: Kesha -- I Spilled Sex Secrets About Dr. Luke to Rehab Doctors  via Wochit.com  Thank you, Asif Ahsan Khan  Also See:  Ke$ha Thanks Fans For Support From Rehab, Asks For Their Teeth As Well Footnotes[1] Did Ke$ha Go To Rehab For Eating Disorder Because Producer Dr. Luke Said She Wasn't 'Skinny Enough?'[2] kesha on Twitter",
            "date": "Answered March 20, 2016",
            "views": "22",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kelly Klass",
                    "user_href": "/profile/Kelly-Klass"
                },
                {
                    "user_id": "Rebecca Baldwin",
                    "user_href": "/profile/Rebecca-Baldwin-8"
                }
            ]
        }
    ]
}