{
    "title": "Why did Ariana Grande start her career as a singer? - Quora",
    "tags": [
        "Ariana Grande (actor, musician)",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Azza Paterson",
                "href": "/profile/Azza-Paterson"
            },
            "answer_text": "For a young woman, Ariana Grande's story is lengthy, but I'll give a summary, I am a closet fan of Ariana lol. Arian was born in Boca Ratan, Florida, she kept her mum's surname, Grande. Her mum is or was a businesswoman who encourage her love of singing, Ariana is a short woman, obvious Latina features and started doing stage work, television work, in particular Victorious where she became popular. She recorded a 2011 album, followed by a 2013 album where one track entered the Top Ten charts. Through collaborations with Nicki Minaj she gained more popularity. She is a friendly outgoing girl with a great personality and smile. Her television appearances on the Jimmy Fallon show (on YouTube to view) shows she can act an does some pretty impressive voice imitations of other popular rnb divas. Social Media such as Twitter and Instagram have made her even more popular, she is watched by millions of fans. As we know from recent media stories, An Islamic State bomb attack during her London concert brought her to tears, she cancelled the rest of her concert dates but in a show of love and solidarity she return to England within 2–3 weeks to give a free concert for English fans. Miley Cyrus and other artist performed as well…..That pretty well reassures me that Ariana Grande is a living legend in recent times. Hope this helps. Aaron Paterson - Australia ",
            "date": "Updated July 13, 2017",
            "views": "28",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Spotify Stan",
                    "user_href": "/profile/Spotify-Stan"
                },
                {
                    "user_id": "Arthi Sreya",
                    "user_href": "/profile/Arthi-Sreya-1"
                },
                {
                    "user_id": "Sophia Li",
                    "user_href": "/profile/Sophia-Li-146"
                },
                {
                    "user_id": "Melvin Thakkar",
                    "user_href": "/profile/Melvin-Thakkar"
                },
                {
                    "user_id": "Zamani Ngidi",
                    "user_href": "/profile/Zamani-Ngidi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harold Hill",
                "href": "/profile/Harold-Hill-18"
            },
            "answer_text": "For real? Why don’t you just look up her bio? ",
            "date": "Answered May 5, 2018",
            "views": "180",
            "upvotes": "0"
        }
    ]
}