{
    "title": "Why are musicians so dark and moody? - Quora",
    "tags": [
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Randall Peede",
                "href": "/profile/Randall-Peede"
            },
            "answer_text": "I will assume that you are referring to personalities first and then compositions.First, many places that musicians play are reasonably happy places. I have done jazz, studio and orchestral work. I am degreed in Music. Before we stepped on stage, we were not much different than an NFL locker room. We laughed a lot. There are also famous descriptions of typical players. During intermission, the violinists are discussing bowing decisions. The brass players are looking at the new flute player and saying \"Damn!\" to each other. The percussionists may be calling in bets to their bookies. Is that a joint that I see? These people make $50-$200k/year including teaching and studio work.Next we have your basic \"garage band that made good\" or individual guitarist or keyboardist or maybe a drummer that also plays one of the two. or both. They are not a \"name\" band or performer. Many times they have to pay to play at a club. That's right, not just for free, but \"pay to play\". This is depressing. And you can't make a living off of 1 cent streaming downloads. You either live somewhere really cheap or have a \"day\" job. So you can't make money playing live or downloads, how about album/CD sales. What album/CD sales? The record company is not likely to spend much money promoting you.If you want to count DJ's, a few make money.There are always the \"1 in a billion\", Beyoncé, Usher, Pharrell of the Hip-Hop and EDM market. If you're a rapper, you work for free for way too long. These people are like NBA stars. Your chances of making it are seriously slim unless have serious talent or are well-connected.You can do film/TV/game/jingle composing. A handful of people per city make a living at that. The biggies get called first, like John Williams. If they teach and you're student, you can get some doors opened and then you had better be damned good. You need serious people skills too.Most composers will reflect the world around them in their music. If they're poor and see the injustice around them, they feel powerless and either depressed or angry (see alt-rock, punk rock, etc.). Don't forget to look at 100+ year old Russian orchestral compositions. There's some seriously depressing work there. Russia wasn't a generally a happy place in those days.Lastly I want to address perfection. You can't have it. You try constantly, but fail (at least in your mind). Nothing you do is ever good enough for you. I remember asking one of my professors in college, \"What do you do when you realize that no matter how good you get, there's someone out there who can kick your butt?\"He said, \"I get drunk and hit it again tomorrow\". I will add: \"You may be better than me right now, but you can't have ALL the gigs at once. There's room for me.When I get depressed. I work on something else. ",
            "date": "Answered September 19, 2017",
            "views": "16",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Steven Barnes",
                    "user_href": "/profile/Steven-Barnes-99"
                },
                {
                    "user_id": "Taylor Lee",
                    "user_href": "/profile/Taylor-Lee-339"
                },
                {
                    "user_id": "Adam Ramirez",
                    "user_href": "/profile/Adam-Ramirez-27"
                },
                {
                    "user_id": "Annissa Teo",
                    "user_href": "/profile/Annissa-Teo"
                },
                {
                    "user_id": "Cas Spencer",
                    "user_href": "/profile/Cas-Spencer-1"
                },
                {
                    "user_id": "Agustín Greif",
                    "user_href": "/profile/Agustín-Greif"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jazz Etienne",
                "href": "/profile/Jazz-Etienne"
            },
            "answer_text": "Okay, so first of all, that is a broad sweeping assumption that does not hold true for every musician, but I know a lot of musicians who, at the very least, have a dark and moody side, including myself. *This applies more to commercial music like rock, metal, etc, rather than classical and jazz or genres of that style.* So, for starters, most of the musicians that I know or know of (again, myself included), while they may have come from musical households, got into music for a reason. My two younger siblings have a small appreciation for music but aren’t as passionate and ensnared by it as I am. I have friends that got into music after the death of a loved one, or after being bullied for years, or to deal with any range of inner battles. I know musicians who are loners and others who are outgoing extroverts. I know a lot of musicians who struggle with mental illnesses including depression and anxiety (such as myself, many of my friends, and many well-known artists like Kurt Cobain, Josh Dun, Tyler Joseph, Gerard Way, etc). I know musicians that have struggled with addictions. The music industry is a fascinating hellhole. You have talented people stuck playing clubs and touring to make little or no profit, and at the same time, you have delinquent teenage girls getting famous over something dumb and getting a record deal. Talented artists are stuck in bad conditions doing what they love because they love it, and having to do jobs they might love or hate to make ends meet. I’ve had conversations with local musicians I look up to, about using kitchen chairs or stools in a drum set because an actual drum throne is more than one can easily afford. By all accounts, we get into the art already moody and down, and it lifts us up to help us cope, but at the same time, it’s an expensive art. I wouldn’t trade it for the world, but it is a hard industry to survive in. ",
            "date": "Answered January 28, 2018",
            "views": "913",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Taylor Lee",
                    "user_href": "/profile/Taylor-Lee-339"
                },
                {
                    "user_id": "Marvin Giang",
                    "user_href": "/profile/Marvin-Giang"
                }
            ]
        }
    ]
}