{
    "title": "Why do K-pop fans hate BTS for no reason? - Quora",
    "tags": [
        "K-Pop Fans"
    ],
    "response": [
        {
            "author_info": {
                "name": "Danny Berry",
                "href": "/profile/Danny-Berry-46"
            },
            "answer_text": "Now I have been reading the answers under this question and I find them really cute 🥰 but since we are talking about fandoms and only blaming one without acknowledging the toxic behavior from other fandoms, let get started shall we? and a 1, a 2, a 123 GO!  Slide to the left…  Slide to the right  take it back now ya’ll!  One hop this time!  two hop this time!  hey Macarena!  if you love me let me gOOOOOOOO!  *salsa dance*  who can say where the road goes…  I feel good!  *hammer time*  Now not nice…  *says they don’t need help but proceed to thank literally everyone fandom besides ARMYs*  Welp    so what you just witnessed is someone basically slandering an army by saying that they commented horrible things when that wasn’t true.   and here we have a similar case of a blink pretending to be an army, post horrific things, and giving ARMYs a bad rep. This is not the first time or the only case, my darlings 💅🏻  now kids, that is really not nice  smh  ouch…  Ah of course …  Weverse was literally FLOODED with stays and monbebes begging for help but hey, when an army offers to help, ya’ll reject them so…..also please stop coming to BTS. Leave them alone and stop being fucking disrespectful.  oh yes the blink case….  wowserz  ⬇️   the latest news: December 2019      This takes me back to that hurtful time when BTS knew they were being called Plagiarism boys. This is too much.  ⬇️  now, I shall be back for more because I’m that petty. Don’t miss me too much 🥰 Edit: i know Im gonna have people in the comments trying to defend their fandom, do what you want but it takes common sense to know that no, not the whole fandom is toxic and no where am I saying all kpop fans are 100% trash but if some of you can trash my fandom and bring up every crap they have done wrong (in which they have of course) then I can do the same. In this day and age of kpop, every bad comment, every insult, goes mainly towards ARMYs well now you can see that, ARMYs aren’t the only ones. If this what it takes for kpop fans to own up to their crappy behavior then alright. If you aren’t of course, a kpop fan who doesn’t behave in this toxic way, don’t worry this isn’t directed at you. You good ",
            "date": "Updated January 5, 2020",
            "views": "55",
            "upvotes": " View 169 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rounak Sen",
                    "user_href": "/profile/Rounak-Sen-8"
                },
                {
                    "user_id": "Marvheen Theodore",
                    "user_href": "/profile/Marvheen-Theodore"
                },
                {
                    "user_id": "Yoona Chen",
                    "user_href": "/profile/Yoona-Chen-1"
                },
                {
                    "user_id": "Karry",
                    "user_href": "/profile/Karry-38"
                },
                {
                    "user_id": "Nivedita",
                    "user_href": "/profile/Nivedita-190"
                },
                {
                    "user_id": "Samantha Park",
                    "user_href": "/profile/Samantha-Park-65"
                },
                {
                    "user_id": "Mochi Jimin",
                    "user_href": "/profile/Mochi-Jimin-46"
                },
                {
                    "user_id": "Kim Jisoo",
                    "user_href": "/profile/Kim-Jisoo-165"
                },
                {
                    "user_id": "Sophia Grace",
                    "user_href": "/profile/Sophia-Grace-149"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/InsfiresArmy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mingyun Seo-Bang",
                "href": "/profile/Mingyun-Seo-Bang"
            },
            "answer_text": "After struggling they literally became popular overnight. Western artists want to collaborate with them. Namjoon has already collaborated with several western artists and there's actually a list now. Their CEO is savvy, smart and talented and has promoted them western style rather than the Korean way, allowing the members to write, produce, and choreograph. Soon, they will also be directing their music videos. Koreans who are into Kpop take stanning a group quite seriously. It's frowned upon to be a multi-group fan. If you try to join multiple fan clubs and you are found out, often you are banned permanently from both fandoms. If you are a member of a fan club, you are expected to be all in. Other fandoms, 2 in particular, don't like that BTS is so popular in the west. They dislike them so much that they have started rumours, sent petitions, asked to have them removed from music performances, accused them of fraud. It also didn't help that the agency of one of these groups whose fans have been particularly nasty was found to have paid a broadcasting station to cut BTS performances whenever they were on, to never hire them to MC, and to allow very few ARMY in the recordings when they had a comeback on this particular broadcasting station. Music programs and music awards are neither fair nor balanced in Korea. When BTS finally started getting awards on their talent, suddenly the system was unfair. Awards and music programs couldn't get by with accepting payments from agencies to keep groups off shows or paying for their groups to win the most prestigious awards. Other fandoms couldn't stand the fact that they came from a tiny agency. In Korea most small agencies are corrupt. They're fronts for criminals and use their trainees for illegal activities. You'll also hear all the stories about how absolutely horrible ARMY as a fandom is. That's total bullshit. Want to know the first rule of being in ARMY? If you disparage other groups, if you start rumours that harm members of other groups, if you slander, you are permanently banned. All the shit that ARMY has been accused of, 99.99% has been traced back to antis, other fandoms. So if you hear that it is all the fault of Bangtan's fanclub from others who choose to reply that's balderdash and baloney. I'll just add this. Speaking as a Korean fan, Koreans are passionate when it comes to loving something or someone. Many of us are just batshit loonys. It's nothing new. Go take a look at when the Beatles played at Shea Stadium in New York. Elvis as well. Girls fainting, crying, tearing their hair and clothes. For every ARMY there is another person who loves another group just as passionately and some are quite willing to do anything to make a rival look bad. ",
            "date": "Answered August 12, 2018",
            "views": "3",
            "upvotes": " View 52 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kim Ngân",
                    "user_href": "/profile/Kim-Ngân-102"
                },
                {
                    "user_id": "Audrey Canton",
                    "user_href": "/profile/Audrey-Canton"
                },
                {
                    "user_id": "LEELAMMA MATHEW",
                    "user_href": "/profile/LEELAMMA-MATHEW-11"
                },
                {
                    "user_id": "Random Singer",
                    "user_href": "/profile/Random-Singer"
                },
                {
                    "user_id": "Andrea Sullivan",
                    "user_href": "/profile/Andrea-Sullivan-72"
                },
                {
                    "user_id": "Ruheen Gupta",
                    "user_href": "/profile/Ruheen-Gupta"
                },
                {
                    "user_id": "Jinsun Bauer",
                    "user_href": "/profile/Jinsun-Bauer"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/M-Q-175"
                },
                {
                    "user_id": "Nooreen Razi",
                    "user_href": "/profile/Nooreen-Razi"
                },
                {
                    "user_id": "Aflin Demi",
                    "user_href": "/profile/Aflin-Demi"
                }
            ]
        }
    ]
}