{
    "title": "Why do audio CDs from the past have low volume? - Quora",
    "tags": [
        "Audio and Acoustical Engineering",
        "Compact Discs (CDs)",
        "Audiophiles",
        "Music Production",
        "Audio",
        "Rock Music",
        "Music Industry",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "JG McLean",
                "href": "/profile/JG-McLean"
            },
            "answer_text": "Because they have greater dynamic range.   Put another way, the loudest parts of both older and newer CDs have the same amount of \"volume\" (peak sound level).  But on newer CDs the peaks are less peaky and the average sound level is much higher.    These two images (taken from This Wikipedia page under Wikimedia licence) illustrates this phenomenon using two different versions (the original 1983 CD and subsequent 2000 remaster) of ZZ Top's song \"Sharp Dressed Man\":    -    The red and blue bars represent the instantaneous signal level of the two channels over the course of the song.  Note that in the remastered version, the average signal level is obviously much higher, and this will make this version sound significantly louder than the older version.   However also note that the differences between the peaks and valleys of the remastered version are much smaller; this means that, for example, the snap of the snare drum (which is creating the momentary peaks in the original version) will be less prominent compared to the surrounding sound and provide less musical \"feel\" to the track.  The effect of the contrast between loud and soft is known as dynamics and the amount of dynamics is known as dynamic range.   This tradeoff between dynamics and overall volume is one of the most important decisions an engineer or producer must make when creating a master recording.  Too much dynamic range and the overall recording will be very \"quiet\" but the loud parts may be intrusive when the amplification is sufficient to hear the quiet parts.  Too little dynamic range and the music sounds \"loud\" but loses impact and can be fatiguing to listen to.     As I discussed in JG McLean's answer to Is it true that record players have the best sound quality, as compared to cassettes and digital music? Comparatively analyze the various different digital sound formats.,  in the early days of CD engineers were determined to make use of all the dynamic range that the CD format allows (and early-adopter audiophiles wanted to hear it).   In some cases this led to recordings that were great in an audiophile environment but were too quiet overall and too dynamic for use in many situations (such as in a car where there is a lot of background noise).   So as time went on the average recording levels crept up and up; the advent of MP3s and personal audio players -- where simply turning up an amplifier to account for the overall level differences was not feasible and different tracks were juxtaposed randomly --  increased the perception that \"louder was better\".   Eventually nearly all popular recordings have come to be mastered at \"brick wall\" levels (where the signal levels are effectively maxed out at all times).   This trend towards less and less dynamic range and greater and greater average signal levels has been dubbed the Loudness war and has been loudly decried by audiophiles and recording engineers.   So one way to look at older CDs is not that they are \"quiet\" but that they are dynamic.  If you have access to a good sound system you might try simply turning up the overall volume to compensate for the lower average levels, and listen for the differences in the experience provided by greater dynamic range.  Just remember to turn the volume back down before the next Katy Perry track comes on. ",
            "date": "Answered January 8, 2014",
            "views": "137",
            "upvotes": " View 76 Upvoters ",
            "upvoters": [
                {
                    "user_id": "John Wicks",
                    "user_href": "/profile/John-Wicks-12"
                },
                {
                    "user_id": "J M Sharma",
                    "user_href": "/profile/J-M-Sharma"
                },
                {
                    "user_id": "K.C. Cheng",
                    "user_href": "/profile/K-C-Cheng-1"
                },
                {
                    "user_id": "Artistic Dream",
                    "user_href": "/profile/Artistic-Dream-1"
                },
                {
                    "user_id": "Daisy Hudson",
                    "user_href": "/profile/Daisy-Hudson-3"
                },
                {
                    "user_id": "Walt Borys",
                    "user_href": "/profile/Walt-Borys"
                },
                {
                    "user_id": "Marcelo Chaves",
                    "user_href": "/profile/Marcelo-Chaves"
                },
                {
                    "user_id": "Kameron Woodley",
                    "user_href": "/profile/Kameron-Woodley-1"
                },
                {
                    "user_id": "Mario Hunstorfer",
                    "user_href": "/profile/Mario-Hunstorfer"
                },
                {
                    "user_id": "Joshua Wolfe",
                    "user_href": "/profile/Joshua-Wolfe-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "Larry English",
                "href": "/profile/Larry-English-3"
            },
            "answer_text": "that is not true if you do find examples, it is only because someone decided to make them different volumes..  there is nothing inherent about being 'from the past' that affects the volume loud ones were made then, 'quiet ones' are made now and no, they don;t fade out as they get older, either... wle   Use correct spelling and grammar and clear formattingLearn more about what a helpful answer looks like Use correct spelling and grammar and clear formattingLearn more about what a helpful answer looks like Use correct spelling and grammar and clear formattingLearn more about what a helpful answer looks like ",
            "date": "Answered January 22, 2016",
            "views": "15",
            "upvotes": "0"
        }
    ]
}