{
    "title": "Why does NCT keep getting hate? - Quora",
    "tags": [
        "NCT Dream",
        "NCT (KPop)",
        "Hate"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lee Hyuck",
                "href": "/profile/Lee-Hyuck"
            },
            "answer_text": "Okay this is a question that really hit me I'm not gonna lie and made me so sad.Lately the hate towards NCT has been increased drastically and without any real reasons.The boys are working their asses off and working so hard for all of us and what they get?More and more hate.Why tho?They didn't do anything wrong.Some people hate to see their popularity and fame rising and it really shows. Nct was mocked when they first debuted and were called SM's flop and stuff like that(like Exo but you see where they are right now) but lately and especially after Superhuman and 127's promotions in USA they have been gaining a lot of popularity and new fans. SuperM also helped with that. So gaining more fans and supporters means gaining more haters too and I totally understand that. But in the past few months and especially after Kick it they literally blew up,breaking record after record and that made many haters angry. The thing that made me so sad and disappointed was the situation after Ridin and Punch. Haters started spreading rumors the exact same day that Nct Dream's comeback ‘Ridin' was released about Jaemin. The dating rumors are not something bad at least to me and I believe that most Nctzens agree(especially the international ones).Idols are humans too and deserve to experience love as much as you do and there's absolutely nothing wrong with it. But we all know that dating rumors are a big fat no especially for obsessed fans and the Korean ones too who are quick to unstan and send hate even towards their faves just because they are having a relationship. With that being said those who spread the rumors knew exactly what they were doing,wanting to make the group lose fans,views etc. Fortunately the comeback was very successful the Dreamies won awards and broke records within minutes so that didn't affect them.Or did it?Jaemin was seen making mistakes during the live stages ,which is very rare so I would say that all this hate affected him(especially when some of the ‘fans' wanted him to leave the group).Moving on,during the time that Jaemin's dating rumors were released Taeyong's past scandal magically surfaced again.Now,I'm not gonna say what I think about the whole situation and If he did it or not but he has apologized so many times and seeing him during that live crying and apologizing broke my heart.We've all made mistakes in the past and we are all regretting them so just let him live he knows if he did it or not and he's been reflecting on his actions for so many years and even wrote a song about that(yestoday was a masterpiece) so stop making him feel bad like you're all angels that haven't done something wrong in your life. Next,is Jaehyun's Itaewon ‘scandal'.Jaehyun and some of the ’97 liners-Eunwoo,Jungkook and Mingyu- went out during the Corona virus and Dispatch ‘accidentally’(note the sarcasm)released the information days before Nct 127's comeback ‘Punch'. The thing is that as many people have stated that at the time they went out the measures weren't that strict and shops and restaurants were open.The virus outbreak came some days after and they obviously wouldn't know that. So practically they did nothing wrong or ‘illegal’. But still,Jaehyun(and Eunwoo) wrote a letter for the fans that were ‘insulted’ and ‘hurt' by his horrible and irresponsible actions(note the sarcasm here too)I've seen many people still sending hate towards him and asking for him to leave the group. In a recent interview I watched in KBS World Jaehyun was standing in the back whereas he's always in the front usually next to Taeyong.He didn't talk like at all and he only spoke when the interview was ending.You could tell that he was sad and didn't smile even once and that make me really really sad. During the vlive they recently did he was also in the back and didn't talk much. With all these things being said I think that we all understand that there are people trying to make the group lose fans and popularity just because they see that they're doing great.I don't believe that it's a coincidence that everytime they have a comeback rumors are getting spread days before it. So in conclusion people stop sending hate not only towards Nct but towards any other group. You may have favourites,we all do but that doesn't mean you should try and harm a group or a fandom just because you don't like them or because they might be doing better than the groups you like.All idols have worked and trained so hard for their dreams and we should respect them whether we stan them or not. ",
            "date": "Answered May 23, 2020",
            "views": "429",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Baby Vamp",
                    "user_href": "/profile/Baby-Vamp-1"
                },
                {
                    "user_id": "Scarlet Celeste",
                    "user_href": "/profile/Scarlet-Celeste-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Billy-714"
                },
                {
                    "user_id": "Smrti A.P",
                    "user_href": "/profile/Smrti-A-P"
                },
                {
                    "user_id": "Ava Peaches",
                    "user_href": "/profile/Ava-Peaches"
                }
            ]
        }
    ]
}