{
    "title": "Why are filler tracks included on an album? - Quora",
    "tags": [
        "Music Production",
        "Music Albums",
        "Music Industry",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matthew Russell",
                "href": "/profile/Matthew-Russell-5"
            },
            "answer_text": "My understanding is that \"filler\" is a disparaging term for material on an album that isn't deemed to be of the same standard as the better stuff on the same record. It's the tracks that are there to \"make up the numbers\" and bring the album to an acceptable length to be called an album rather than an \"EP\". I don't think any but the most cynical or burned-out artists knowingly put \"filler\" on their albums, and I don't think anyone involved in the production of an album would use the term. It's an invention of music journalists whose job it is to evaluate the quality of the music an artist produces. How do some tracks end up being considered \"filler\"? Well, for one thing, the term is entirely subjective, so what a reviewer calls \"filler\" might be the same stuff the artist is most proud of, or what some listeners like best. Maybe a song contains ideas that an artist isn't equipped to realize in the way they'd like to at the time, so the ideas in a track outstrip the performance, or the recording.  The cases where the label seems to fit best are those where a looming deadline for a release has caused an artist to opt to release older material that had previously been passed over for release, or to quickly write extra songs in the studio. Of course, in order for this stuff to count as \"filler\", it still has to be rubbish, and it might be that the opposite is true. An artist might spend months perfecting a song, only to have it savaged by fans and critics alike, then write a smash hit song in the time it takes to sing it. They may find that the songs they didn't want to release, fearing that they weren't very good, are the ones that are most warmly received when they do see the light of day. ",
            "date": "Answered January 7, 2014",
            "views": "18",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dino Prime",
                    "user_href": "/profile/Dino-Prime"
                },
                {
                    "user_id": "Min Paing Myat Thu",
                    "user_href": "/profile/Min-Paing-Myat-Thu"
                },
                {
                    "user_id": "Rafael Allen Castor",
                    "user_href": "/profile/Rafael-Allen-Castor"
                },
                {
                    "user_id": "Adrian Yap",
                    "user_href": "/profile/Adrian-Yap-5"
                },
                {
                    "user_id": "D. Ghosh",
                    "user_href": "/profile/D-Ghosh"
                },
                {
                    "user_id": "Ellis Loke",
                    "user_href": "/profile/Ellis-Loke"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert L Gerrard",
                "href": "/profile/Robert-L-Gerrard"
            },
            "answer_text": "Are filler tracks common in most albums? I’m not so sure about “filler tracks”, although sometimes, in my judgement, it seems there was ALMOST an album’s worth of good material, but another track was needed and none was really up to scratch, leading to the least of the available evils being released to make up the length. I do believe that far too often there is filler INSIDE tracks. The most obvious example of that is excessively repeated choruses, closely followed by extended repetitive instrumental sections. It’s so easy to adjust the length of a track when it’s digitally recorded - just copy a section, insert empty space, and paste. To my ears it’s VERY obvious when that has been done. It’s lazy, boring, and frankly dishonest because the listener is paying for that effortless dodge. I know of one instance where the filler was added for a seemingly illogical reason. A track was too long… too many verses. The lyric was long, telling a story, there was no way to cut it down. The solution was to take a track that wouldn’t make the album on its own, paste it in before the last verse, making it an instrumental solo section - adding almost three minutes to the length of the track, but distracting the listener from the number of similar verses they had already heard by presenting something surprisingly new. When the last verse arrived, it was like a welcome homecoming. Definite filler, but used to GOOD effect. ",
            "date": "Answered September 22, 2018",
            "views": "870",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Roy Bungle",
                    "user_href": "/profile/Roy-Bungle"
                }
            ]
        }
    ]
}