{
    "title": "Why do Instacart shoppers get paid less than minimum wage? - Quora",
    "tags": [
        "Labor and Employment Law",
        "Instacart ",
        "Economic Effects of Minimum Wage Laws",
        "Labor Economics",
        "Minimum Wage",
        "Grocery Shopping",
        "Wages and Hourly Wages",
        "Salaries for Specific Jobs and Careers",
        "Salaries and Wages"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Cherry II",
                "href": "/profile/Paul-Cherry-II"
            },
            "answer_text": "The short answer is because the company does not compensate for any of the expenses that an employer has to and they do not offer even minimum wage on 50% of their batches. The shopper is responsible for wear and tear on their personal vehicle (brakes, tires, oil changes, equipment failure), gas, car insurance (regular and delivery), health insurance, and taxes (income, employment, and self employment). In the three years I worked for them my pay was always changed without any warning or input for two raises (one of which I got by moving to a higher paying zone) followed by fifteen reductions. Every time after the first two raises they would give a minor concession to a complaint we had about our pay along with a reduction to the main pay. A lot of the shoppers do not do the basic math of what the job costs as they see the money coming in and ignore the current and future expenses. ",
            "date": "Answered May 6, 2019",
            "views": "142",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Marie Duvall",
                    "user_href": "/profile/Marie-Duvall-1"
                },
                {
                    "user_id": "David Pryor",
                    "user_href": "/profile/David-Pryor-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Johnathon Sigward-Waters",
                "href": "/profile/Johnathon-Sigward-Waters"
            },
            "answer_text": "Because it’s independent contractor work and you can choose to either accept the job or not. If you think you’re worth more than minimum wage don’t take it. If you think you can do it faster than the person declining it and it actually isn’t minimum-wage for you because you’re good at the job and can do it faster than sure maybe do it. If it’s so low nobody will do it. I personally have never done an Insta cart order that wasn’t worth it for me and it definitely wasn’t under minimum wage. Not since the first few I did that took me a long time because I didn’t know the layout of the store. I’ve done hundreds of jobs now and I can tell you that my average hourly rate which is just my earnings divided by my active hours is over $30 which includes tips. ",
            "date": "Answered April 19, 2020",
            "views": "73",
            "upvotes": " Answer requested by David Pryor"
        }
    ]
}