{
    "title": "Why do artists make music videos? - Quora",
    "tags": [
        "Music Videos",
        "Music Industry",
        "Musicians",
        "Videos"
    ],
    "response": [
        {
            "author_info": {
                "name": "Maurice Hissink",
                "href": "/profile/Maurice-Hissink"
            },
            "answer_text": "While making a great song is important for musicians, making a video that goes along with a song will help in different ways. First and most obvious, it will add an extra layer to the music/song. If you have a great video, it will really enhance the overall music experience. Second, from a marketing perspective, you can reach a larger audience. Visuals tend to attract more than sound alone, so adding that awesome music video to your music will attract a broader audience, if use on the right platforms. In the end, I think that the first statement should be the most important. Only add a video to your music if it really means anything. Have fun and keep creating awesome music! Maurice from AniMouseMusic.com ",
            "date": "Answered February 26, 2018",
            "views": "3",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sriyaa Srinivas",
                    "user_href": "/profile/Sriyaa-Srinivas"
                },
                {
                    "user_id": "Faith Snyder",
                    "user_href": "/profile/Faith-Snyder-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jamout.co",
                "href": "/profile/Jamout-co"
            },
            "answer_text": "Music videos are a great way to show a visual interpretation of the song. It's also a good way for artists to further market a single, that could potentially garner more fans to either purchase or listen to the album or single. Some songs have a deeper meaning to the artists themselves who would want to demonstrate this in a way that's easy for fans to interpret. A good example of this is the video for “Cardinals” by the Wonder Years. If you haven’t seen it, I suggest you check it out for great use of symbolism to really evoke emotions regarding the subject matter of the song itself. I hope this helped! ",
            "date": "Answered March 5, 2017",
            "views": "25",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pasquale Perrone",
                    "user_href": "/profile/Pasquale-Perrone-1"
                },
                {
                    "user_id": "Kolade Adewoye",
                    "user_href": "/profile/Kolade-Adewoye"
                }
            ]
        }
    ]
}