{
    "title": "Why does music have an emotional connection to people? - Quora",
    "tags": [
        "Understanding Emotions",
        "Emotions",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Holger Morlok",
                "href": "/profile/Holger-Morlok-1"
            },
            "answer_text": "Few people even don’t have any relation to music at all.Music has the power to bring up strong emotions within; some people use it even to change their mood. To the better, for example. Do you know that sometimes you are angry, you might also bring up a tune that sounds angry to you and take a bath in those emotions? I think everyone that likes music can relate to that. As well as remembering events, waypoints in your life where something changed.For example, the loss of a good friend, and you’re reminded of this friend by a specific melody. Either that stirs up those emotions again, maybe you listened together with the friend the last time. Or it evokes a particular emotion. We experience emotions every day.And many things we do are the result of an emotion.Furthermore, many things we do that are manifested in the surface may be a result of what we want to feel inside. Also, movies we watch as well not only because of the stories but because of the emotional ride the movie creators take us on. And also for sure, for instance, you can imagine women saying: “This movie was wonderfully sad…” Why does music talk to our emotional side?Why do we feel the urge to move when hearing music? And furthermore, the bass may tickle you in the stomach or in your belly, when you’re in the club. Some relaxing music of yoga and meditation may support the relaxing feeling you’ll get. P.S.: Tell me, is there any greater emotional supercharge for you than music?For sure there might be. But I guess many can relate.That a lot of events of their lives music was also in there as well. ",
            "date": "Answered October 28, 2019",
            "views": "440",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chris Cameron",
                "href": "/profile/Chris-Cameron-55"
            },
            "answer_text": "People remember events through music, A time, place something that happened it's always been that way. That's why music is so important right down to what's played at our funerals words and music are so intangled in our brains. A song can make us laugh or cry just the first few bars… power! that's why music and people have such a connection. We could not live without music! TV yes but not music, some need it to help with they emotions music is the world… that's music not fame. ",
            "date": "Answered December 23, 2017",
            "views": "201",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alex Palumbo",
                    "user_href": "/profile/Alex-Palumbo-3"
                }
            ]
        }
    ]
}