{
    "title": "Why do some people not like 'Gangnam Style'? - Quora",
    "tags": [
        "Gangnam Style (2012 song)",
        "PSY (musician)",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kimi Ya",
                "href": "/profile/Kimi-Ya"
            },
            "answer_text": "This is a hard one to answer, because everyone has a different taste in music. For some people, it doesn’t suit their taste. For others, they simply don’t like k-pop. Others may not like PSY (the artist) in general, they may not like the style of music, the lyrics, music video, song title, etc etc. The list goes on and on. If you really want to find out, then ask one of these people who doesn’t like Gangnam Style. ",
            "date": "Answered December 16, 2018",
            "views": "154",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Fiona Wangari",
                    "user_href": "/profile/Fiona-Wangari"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Warrior-AJ"
                }
            ]
        },
        {
            "author_info": {
                "name": "Seth Winters",
                "href": "/profile/Seth-Winters-2"
            },
            "answer_text": "When the song first came out, it was pretty good, but since Paul Walker passed away, we've had more meaningful songs (Wiz Khalifa and Charlie Puth See you again). Gangnam Style actually has every right to be disrespected as it has no meaningful lyrics. I'm glad we finally got a music video that beat Gangnam Style with the number of views. See you again has over 3.9 billion views Despacito music video has well over 5 billion views (still in number one). Luis Fonsi - Despacito ft. Daddy Yankee Wiz Khalifa - See You Again ft. Charlie Puth [Official Video] Furious 7 Soundtrack PSY - GANGNAM STYLE(강남스타일) M/V Gangnam Style in third place now with 3.2 billion views. ",
            "date": "Answered December 16, 2018",
            "views": "568",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sophie Tongtong",
                    "user_href": "/profile/Sophie-Tongtong"
                }
            ]
        }
    ]
}