{
    "title": "Why is contemporary art important? - Quora",
    "tags": [
        "Contemporary Art",
        "The Arts"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kerry Andrew",
                "href": "/profile/Kerry-Andrew"
            },
            "answer_text": "I will admit to being a more of a lover of Renaissance and Baroque Art, but I finally came to appreciate the place Modern Art has come to represent an previous era. Therefore, I believe Contemporary Art to be incredibly important to today’s society. Just like Modern Art before it, there’s a reason that contemporary art isn’t revered by society: they don’t understand it… yet. The truth of the matter is the diverse perspectives that are expressed through contemporary art are incredibly valuable to society, and reflect the many changes that we’ve had both in philosophy and in science over the course of our lifetimes. One thing is always going to be true: contemporary art is a snapshot of what it was like to live in our present day society, which is going to be valuable in the history of art. Below are three ways in which contemporary art help us to learn new diverse perspectives about the world we live in. 1. Abstract Impressionism: During the 1940’s and 1950’s, artists like Jackson Pollock focused on a new movement of contemporary art called abstract expressionism. Through these paintings, they expressed the spontaneity in subjective emotions. It originated in New York but has permeated artistic culture to the point where it’s one of the most relevant movements today. Abstract expressionism is incredibly important to the way that people see each other today. 2. Pop Art: The introduction of mass media, artistic culture has responded to the inundation of information across the world with art that reflects that. By holding a mirror up to society reflecting what mass media does to culture, the pop art movement is one of the most important critiques of modern society that exists today. Study artists like Andy Warhol if you want a look into the pop art movement, and the diverse perspectives that it has to offer the world. 3. The Extension of Postmodernism: Because it's focused on logic and rationality, the postmodern era, has provided arguments that the basic structure of logic and rationality is in itself, illogical. This was reflected in the diverse perspectives of art through several mediums, including people mourning the fact that their may be no absolute truth in the world. If you want to see the reflection of how some philosophers are debunking the basis of our rationality, you need to look no further than postmodern art, which seeks to tear down those constructs. Overall, Contemporary Art deserves our respect. The artistic era that we are currently in is incredibly important. In fact, it may be the most important era that there ever has been in art. By creating new pieces through postmodernism, abstract expressionism, and pop art, we are doing an incredible job of holding up a mirror to science, philosophy, and society. There has never been a time where art is more important than it is now (which is decried by every generation.) Go to an art exhibition to bask in the glory of all of the things that contemporary artwork has to offer you. Not only will you learn a lot of new things about the artistic world, you’ll also see the true beauty that contemporary art has to offer, which, believe it or not, can improve your quality of life substantially. ",
            "date": "Answered February 3, 2018",
            "views": "94",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Trixie",
                    "user_href": "/profile/Trixie-83"
                },
                {
                    "user_id": "Shannon Culverhouse",
                    "user_href": "/profile/Shannon-Culverhouse"
                }
            ]
        },
        {
            "author_info": {
                "name": "Angela Cockayne",
                "href": "/profile/Angela-Cockayne"
            },
            "answer_text": "Contemporary art embraces the idea that art is not separate from life or the world we live in. A work may often be more to do with what the work is about rather than what it looks like. Contemporary art practice has become an exchange, a juncture, or intervention for reflective encounter between the artist and spectator rather than an image or object we expect to admire. An artwork can communicate at a different level beyond words. Contemporary Art allows a viewer to think for themselves, as a conduit the work offers the viewer scope to fill in the missing gaps and engage in a new narrative the work might evoke- thus creating dialogue, new responsibility and new potential ownership of an idea. The Death of the Author 1967 by Roland Barthes has played a significant role in contempoary art criticism exploring where meaning resides- in a negotiated space between the viewer and the artist- the art work is the entity for communication. It has the power to convey a language beyond text, non-verbal leakage and potential universal understanding. Contemporary art patrols a shifting territory; it embraces narrative, subjectivity, memory, emotion, intellect and kitsch. It’s outrageous, shocking, and sensational to quote tabloid press. It’s animals in formaldehyde and vacuum cleaners covered in cigarettes. It is photo realist painting. There is no common style or medium, its figurative, its abstract, deeply personal, appropriated ready to go, its hand crafted, its lens based, text, installation, performance. Its eye candy and conceptual in the same instance, its fun and ironic sometimes simultaneously. We can judge Modernism as a two horse race; painting and sculpture. Contemporary art movements since 1970 ( Post-Modernism): Environmental Art, Land Art,Op Art, Kinetic Art, Light ArtPerformance, Live Art, Body Art, HappeningsProcess Art,Photorealism, HyperrealismNeo Geo, Neo Abstraction, Neo-Expressionism,Installation Art,Text and Image,Video Art, Digital Art,Abject Art,Fine Art in Context,Political Art, Graffiti Art,YBA,Postmodern FeminismPostmodern Multi-Culturalism,Conceptual AbstractionArt POST MEDIUM Contemporary art practice could be defined as inclusive; politically correct, non-elitist, it says as much about what it is not as what it is. Context, language and philosophy can determine what art is- open ended, and ambiguous. It can be simultaneously simple and complex, and can be extremely difficult, which may at first glance seem alienating. Sometimes the work is as much about philosophical discourse as the visual representation which is why we must avoid using a yardstick to pre-judge an art work. The difficulty becomes when we can define the avant-garde it is no longer the avant-garde. A possible role of the artist is to redefine what art is, free from constraint pushing the boundaries of the cultural canon. If science, or “truth’ gives us fact and evidence to solve questions, art creates curiosity, it asks more questions rather than gives answers, creating space for ambiguity, new narratives, and scope for many ‘truths’. With technological advancement of the democratised access of the Internet perhaps we can now facilitate worldviews exploring our natural curiosity through creativity and the rational. Now in the 21st century, we can investigate and explore a global dialogue between different disciplines of the Arts and Science, and embrace our cultural environment through collaborative partnership in context of current ethical debate. The biologist Edward O Wilson suggests we will only realise our full potential when we have such a consilience of interdisciplinary practice and dialogue. ",
            "date": "Updated August 29, 2017",
            "views": "357",
            "upvotes": " View 20 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Joana Tabinas",
                    "user_href": "/profile/Joana-Tabinas"
                },
                {
                    "user_id": "Renelyn Pin",
                    "user_href": "/profile/Renelyn-Pin"
                },
                {
                    "user_id": "Jxcnco Fajardo",
                    "user_href": "/profile/Jxcnco-Fajardo"
                },
                {
                    "user_id": "Eman Adian",
                    "user_href": "/profile/Eman-Adian"
                },
                {
                    "user_id": "Miguel Iza",
                    "user_href": "/profile/Miguel-Iza"
                },
                {
                    "user_id": "Marhaifa Madjid",
                    "user_href": "/profile/Marhaifa-Madjid"
                },
                {
                    "user_id": "Crystal Camille",
                    "user_href": "/profile/Crystal-Camille-2"
                },
                {
                    "user_id": "Ma.sheila Baguio",
                    "user_href": "/profile/Ma-sheila-Baguio"
                },
                {
                    "user_id": "Shannon Culverhouse",
                    "user_href": "/profile/Shannon-Culverhouse"
                },
                {
                    "user_id": "Jessalyn Gapusan",
                    "user_href": "/profile/Jessalyn-Gapusan-1"
                }
            ]
        }
    ]
}