{
    "title": "Why do some people dislike Iggy Azalea? - Quora",
    "tags": [
        "Iggy Azalea (musician)",
        "Why Do People Hate X So Much?",
        "Hip Hop Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Craig Debrah",
                "href": "/profile/Craig-Debrah"
            },
            "answer_text": "There are various reasons for people's open dislike for Iggy. Personally, I like fancy and thought her verse on T.I's \"no mediocre\" was really good. But aside from this, I find the rest of her stuff trash. Generally, she really is not a good lyricist or rapper. None of her lines jump out and make you say wow. Her flows are basic at best and is nothing special. This is part of the reason why she is so disliked. She is generally not a special rapper, yet she has attained star status. Why you ask? Is it because she's white? Who knows. Another reason could be that she's... fake. Her accent is totally made up and some of the things she raps about isn't real at all. But hey listen, if 90% of what ALL rappers rapped about was true, let's just say life would be wholly different to what it is now. I mean, Rick Ross was a Prison Officer for goodness sake, whilst claiming to be selling cocaine. He is as fake as it gets, yet he gets not the same amount of vitriol as Iggy. At the end of the day, music is entertainment and doesn't necessarily have to be real. If Lil Wayne had shot as many people as he claims to have shot, he'd go down as the world's deadliest serial killer. Iggy shouldn't be singled out for not being real, when she is a) surrounded by people in the same industry who aren't real either, b) its entertainment, she doesn't have to be real. The deepest issue as to why people dislike Iggy is the notion of cultural appropriation. Iggy Azalea is currently being seen as appropriating black culture for her own gain. Now I personally feel people do have a point here, in the past we've seen black culture dismissed and deemed as crap, then suddenly a white person starts doing the exact same thing and is then praised as innovative and a ground breaker. See Jazz music and Rock and Roll as an example. People feel the same is being done here. Rappers are seen as vulgar, misogynistic and generally undesirable. A white rapper (Iggy) suddenly does it and all of a sudden she's seen as the next big thing in some corners. Azaelia Banks has had several pops at her for this on twitter and she seems to have a point at times. Iggy seems to be taking from black culture without giving anything authentic or original black. Her silence on what was going on in Ferguson back in August/September was deafening. Personally, I dislike Iggy's music for just being a trash rapper with no deeper element to it whatsoever. ",
            "date": "Answered March 8, 2015",
            "views": "84",
            "upvotes": " View 28 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sabrina A",
                    "user_href": "/profile/Sabrina-A-101"
                },
                {
                    "user_id": "Alexa Tapia",
                    "user_href": "/profile/Alexa-Tapia-1"
                },
                {
                    "user_id": "Efrain Calixto",
                    "user_href": "/profile/Efrain-Calixto"
                },
                {
                    "user_id": "Lav Rao",
                    "user_href": "/profile/Lav-Rao"
                },
                {
                    "user_id": "Trisha Rahma",
                    "user_href": "/profile/Trisha-Rahma"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Leo-Proctor"
                },
                {
                    "user_id": "O.J. Gillom",
                    "user_href": "/profile/O-J-Gillom"
                },
                {
                    "user_id": "Gabriella Inka",
                    "user_href": "/profile/Gabriella-Inka"
                },
                {
                    "user_id": "Hashim Iqbal",
                    "user_href": "/profile/Hashim-Iqbal-7"
                },
                {
                    "user_id": "Terrice Kimble",
                    "user_href": "/profile/Terrice-Kimble"
                }
            ]
        },
        {
            "author_info": {
                "name": "Keely Davis",
                "href": "/profile/Keely-Davis"
            },
            "answer_text": "In this day in age, Iggy Azalea represents everything that is wrong with the American music system. In a time where black artists are ridiculed and shamed for acting the same way she does, Iggy is making millions. The problem is that she is becoming rich and famous off of a style that was invented and popularized through blood, sweat, and tears by black artists, and now it seems as if it is being repurposed by this outsider. To be completely honest, most of this is most likely the doing of T.I. As his prodigy, Iggy, or should i say Amethyst (since that is her real name), has been crafted into the perfect black rapper. The only issue with this is that she's white. Many will cry out about how this sentiment is racist and so on and so forth, but it is the truth. T.I. didn't form her in any way different than his black prodigies, bringing us to this harsh reality. Ultimately it comes down to the fact that she is capitalizing off of this form of music that many blacks can't even make money off of because of the limitations of race in America. If Iggy was a black artist, she would have been written off a long time ago as any old rapper, but since she is a pretty white girl, she is said to be \"revolutionary\" in the world of rap. Personally, I'm glad that a female rapper is finally getting some sort of recognition, but I just wish it was on better terms. ",
            "date": "Answered February 22, 2015",
            "views": "29",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Albani Godette",
                    "user_href": "/profile/Albani-Godette"
                },
                {
                    "user_id": "Sabrina A",
                    "user_href": "/profile/Sabrina-A-101"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Leo-Proctor"
                },
                {
                    "user_id": "Dhruv",
                    "user_href": "/profile/Dhruv-34"
                },
                {
                    "user_id": "James Geschwindt",
                    "user_href": "/profile/James-Geschwindt"
                },
                {
                    "user_id": "Terrice Kimble",
                    "user_href": "/profile/Terrice-Kimble"
                },
                {
                    "user_id": "John Dalton",
                    "user_href": "/profile/John-Dalton-31"
                },
                {
                    "user_id": "Joyce Zeegers",
                    "user_href": "/profile/Joyce-Zeegers"
                },
                {
                    "user_id": "Carol Elizabeth Hoskins",
                    "user_href": "/profile/Carol-Elizabeth-Hoskins"
                },
                {
                    "user_id": "Naya",
                    "user_href": "/profile/Naya-16"
                }
            ]
        }
    ]
}