{
    "title": "Why do the most famous saxophone players choose to play the Selmer Mark VI saxophone? - Quora",
    "tags": [
        "Selmer Mark VI Saxophone",
        "Saxophone Players",
        "Saxophones",
        "Jazz Music",
        "Learning to Play Musical Instruments",
        "Musical Instruments",
        "Fame and Mass Popularity",
        "Musicians",
        "Celebrities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Campbell",
                "href": "/profile/Tom-Campbell-1"
            },
            "answer_text": "Thanks for the A2A, Dab. First, remember that there were lots of Mark VIs, and that the early runs of their 30 year existence were probably the best. The reason I say there were a lot is that, like almost every instrument company, Selmer tinkered with the design throughout the product’s history. There’s no canonical version. You might play one made in 1954 with an F# key that sounded worse than a 1955 without the F# key (for non-sax players, the high F# key is the subject of almost as much mysticism as a violin’s E string and opinions on its necessity can differ violently). In general, they had some improvements on their predecessors like a better octave key, pretty good build quality, and a rich, consistent tone often described as dark. Most saxes made in the last 30 years are based on the Mark VI design. I suspect a high-end Yamaha at say $7,000 is every bit as good as a $20,000 vintage Mark VI and maybe even better, but I have no proof other than the fact that instruments made of brass get fatigued in a way that, say, guitars and violins don’t. Me personally… I’m afraid to find out! I’m probably not a good enough sax player to tell, thank heavens. Example: I have a $2,000 soprano sax by Canonball and I have a $300 Chinese soprano. I like the Chinese one better. I have an old Bundy student alto I got for $50 and a Yamaha Q Series alto that cost me $300. They both seem excellent to me, and Charlie Parker’s son, also a sax player, actually played my Bundy at several gigs. He loved it. The Q series was not well reviewed, but I enjoy it immensely (for the price, which was a third of what it went for new). My favorite sax is a C Melody by Conn, and that 100 year-old thing was probably not considered great even when it was new. Yet I have a ball with it. Since I have enough expensive hobbies (see Tom Campbell's answer to What makes an expensive piano expensive?), I am afraid that if I played a Mark VI I would learn why they’ve got that rep. So I’m not even going to pick one up! I want to remain happy in my ignorance. ",
            "date": "Answered February 25, 2020",
            "views": "157",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Deborah Dobbs",
                    "user_href": "/profile/Deborah-Dobbs-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Hall",
                "href": "/profile/Bill-Hall-23"
            },
            "answer_text": "There is no scientific evaluation method for determining what saxophone, or any musical instrument, is the best. Therefore, when choosing a particular brand or model of any musical instrument, the musician must listen to the opinions of other musicians and determine what he feels is best for him/her. Part of the reason many players consider the Mark VI to be the best is because of its reputation. In the early part of the 20th century, Selmer began to make improvements to the saxophone that made it easier to play, and to have more of what we now consider to be its modern sound. This was culminated, in many musician’s opinion, by the Mark VI. Then Selmer produced the Mark VII, which had a little bit different sound than the Mark VI. It was considered by many musicians to be a negative change. I think that’s where a lot of the source for the myth of the Mark VI came from. It was considered to be the peak of saxophone design in many musician’s opinions. I have never played a Mark VI, and I haven’t played many models of saxophone, so my opinion comes from my limited experience and from what I hear and read. There aren’t many people who can afford to try a very large sample of different saxophones, though, so everyone has limited experience. Many musicians say that the Mark VI is the best saxophone ever made. I have read that there are good ones and bad ones, and that the good ones are great. I have also read that they have their quirks and downsides. Saxophone key mechanisms have, at least in some musician’s opinion, improved, and it is said that newer saxophones have better keying mechanisms than a Mark VI. Selmer also makes the Reference 54, which is intended to be a copy of a 1954 model Mark VI. Opinions vary on whether it accomplishes this goal. Other sax manufacturers have copied many of the features that Selmer introduced. In fact, some horns are considered by many to be copies of a Mark VI. Yanagisawa is in this category. I know one professional who had played a Mark VI for many years who bought a Yanagisawa tenor, and he said that the Yani “blew away” his Mark VI. And, on the other side of the fence, I met a musician who played a Selmer Balanced Action, and in his opinion, it was better than a Mark VI. The bottom line: In my opinion, the decision to use a Mark VI is based on reputation and limited experience. ",
            "date": "Answered December 28, 2019",
            "views": "151",
            "upvotes": "0"
        }
    ]
}