{
    "title": "Why does the music sound loud in darkness? - Quora",
    "tags": [
        "Loud Noises",
        "Sound"
    ],
    "response": [
        {
            "author_info": {
                "name": "Avo Mokka",
                "href": "/profile/Avo-Mokka"
            },
            "answer_text": "This is an interesting issue. There are 2 main reasons: 1- Your sense of hearing is not distracted by sight, so you are deeper concentrated on what you hear. Sounds seems louder. This is the simple approach. 2- If you are in the dark, it means you are alone, or accompanied by very quiet people. Also usually it means you don’t have any noise in the room. Therefore your hearing threshold goes very low. You can hear low sounds because they are not masked by others and more importantly because of the way your hear works. The hear recognizes the pressure waves that constitute sound, only when they are above the noise threshold (the dense environmental pressure of air in the room). Loudness is the difference between the noise floor and the average amplitude (pressure) of the sound waves. Meaning you hear sound when its’ pressure in dBs, is higher than the atmosphere pressure (at least) and the presence of movements and noise in the air increases the pressure so it masks the music lowest sounds. Another sound masking mechanism: movements divert the direction of the pressure waves in the air, thus reducing its relative pressure and distorting its frequency (Doppler Effect), so turning part of the music into noise. So it is physically true. Music in the dark is usually louder and better defined. ",
            "date": "Answered March 7, 2018",
            "views": "13",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aqilah Puteri",
                    "user_href": "/profile/Aqilah-Puteri"
                },
                {
                    "user_id": "Jan Mhyl Cuizon",
                    "user_href": "/profile/Jan-Mhyl-Cuizon"
                },
                {
                    "user_id": "Christopher Longoria",
                    "user_href": "/profile/Christopher-Longoria-2"
                },
                {
                    "user_id": "Cindy Ferguson",
                    "user_href": "/profile/Cindy-Ferguson-2"
                }
            ]
        }
    ]
}