{
    "title": "Why is a 55 gallon drum more than 12,700 cubic inches when measured and converted? - Quora",
    "tags": [
        "Unit Conversions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tim Caufield",
                "href": "/profile/Tim-Caufield-1"
            },
            "answer_text": "The “nominal” size- or commonly used term- is 55 gallons, but the actual capacity varies by manufacturer. This is kind of like a piece of lumber being called a “two by four” but not actually measuring 2 inches by 4 inches in cross section. My thought on barrels would be that a “55 gallon” drum is actually a bit over-sized, so that 55 gallons of oil or similar liquids (which expand and contract significantly when warmed or cooled during transport) can change in volume and not burst the drum or otherwise distort the drum shape if the ambient temperature changes. Even water increases in volume when it freezes, so if you put 55 gallons of water into a 55 gallon drum, and it ends up freezing, there is room for it to expand and not burst the drum. Cans of soda are typically filled pretty much to the top. Try leaving an unopened can of soda in your car overnight in freezing weather, and see what happens if there is not room for expansion. ",
            "date": "Answered January 4, 2018",
            "views": "394",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Don Shiner",
                    "user_href": "/profile/Don-Shiner"
                }
            ]
        },
        {
            "author_info": {
                "name": "Loring Chien",
                "href": "/profile/Loring-Chien"
            },
            "answer_text": "HOw are you measuring a 55 gallon drum? If you pour 55 321 cu inch gallons into it it should be right - 12,705 cu inches. If you take the external dimensions (is that what you mean by measuured?) then you have a complex shape that can lead to problems if you don’t analyze it perfectly. The dimensions of a 55 gallon drum are usually the envelope dimensions, in other words the size of a cylinder it will slide into. But a drum usually has a wide lip and some strengthening ribs that add to the exterior dimensions but actually subract from the interior dimensions. The the exterior diameter is such and such and the exterior height is such and such then the interior volume will be less, due to the thickness of the walls and the relief of the walls between the ribs.  See how the ribs subtract from the interior volume? ",
            "date": "Answered January 5, 2018",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Naraina Damle",
                    "user_href": "/profile/नारायण-दामले-Naraina-Damle"
                }
            ]
        }
    ]
}