{
    "title": "Why does K-pop suck? - Quora",
    "tags": [
        "Music Industry",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Maya Miller",
                "href": "/profile/Maya-Miller-63"
            },
            "answer_text": "Well, it depends on what you mean by k-pop. The industry? The music? The fans? The idols? When it comes to the industry, there’s a LOT of reasons it sucks. Where do I start? Profiting off of vulnerable teenagers? Overworked and exploited idols? Harsh beauty standards and diets? Mental health problems? Mistreatment of foreign idols? Unfair line distribution and screen time, toxic fandoms, lawsuits? There’s so much wrong with the industry, but that’s true of any industry anywhere. ESPECIALLY entertainment fields. I’m sure there are people who are a lot smarter and a lot more well-researched than me who have talked about the problems within the industry, so I’m not going to talk too much about it. If you mean the music and the idols? Well, let’s be honest here, not all of the music is good, and not every single idol is a good, talented person. But for the most part, k-pop really isn’t as cringe-worthy or weird as people think it is. If it doesn’t fall to your personal taste? Completely fine! Nothing wrong with that. But art is subjective, and if it’s something that other people enjoy, I don’t see the point in going around saying it sucks. Especially when most idols are so hardworking and talented. If you mean the fans….. well, I won’t argue with you. The fans suck. K-pop fandoms can be great in a lot of ways, but there’s also a TON of toxicity, which again, I’m sure someone much smarter and more well-researched than me has talked about before. ",
            "date": "Answered September 9, 2020",
            "views": "298",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alexander Safonov",
                    "user_href": "/profile/Alexander-Safonov"
                },
                {
                    "user_id": "Mickey Brex",
                    "user_href": "/profile/Mickey-Brex"
                }
            ]
        },
        {
            "author_info": {
                "name": "Quynh-Nhu Nguyen",
                "href": "/profile/Quynh-Nhu-Nguyen-42"
            },
            "answer_text": "I don’t think that K-pop itself sucks. But rather a lot of the things that are connected to it. Examples: Fandom warsBeauty standardSaesang fansExtortion of IdolsBlacklisting by companies(JYJ’s situation got a Korean law named after them.)Working to death(“Perfect is not enough. Like greed it’s limitless.”)Malicious commentsMental health problems(Became undeniable due to events in the recent years)Rigged award shows(MAMA is the icon for this)Difference in treatment/respect depending on popularity(An idol stated once that the same people treated her differently depending on for which group she promoted. When she was part of I.O.I, people treated her respectfully. When she was with back with her original group, people ignored her.)“Don’t mention/praise Japan even though we get a lot of money from there and it’s one of the easiest places for our idols to vacation in.”(This isn’t mentioned directly but that message is often spread. Japan feels like a taboo topic at times. But yet it can’t be denied that it’s a rather rich neighbour where Idols can easily go to whenever extra money is needed or a “foreign” travel blog should be filmed.)“Witchhunts”(Everything is labeled as “evil” as long as the target still appears in public. TOP was criticized for being dressed properly for his court appointment. Seungri was criticized when he visited his teacher during the recognized Korean holiday “Teacher’s day” and currently for not being “restrained” despite complying with everything that court wants from him.)“The most famous one is the scapegoat”(“The Secret Chatroom Scandal”: Jung Joon-youn was the worst one and it was mainly his scandal. Yet Seungri was named every single time, even when the article didn’t mention him except for the headline or introduction.)Double-standards regarding genders(During sexiness, women are bad. During surprise pregnancies, men are bad.)The overshadowing of other genres(Some people label other genres as unimportant due to not being K-pop.)The that “only one group exists”(Some people act as if K-pop=BTS. Other groups/artists do exist.)“That everything originates from K-pop”(“BTS” in movie captions generally stands for “Behind the scenes”. This term is older than the K-pop group.)",
            "date": "Answered January 13, 2020",
            "views": "653",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sapnil Rc",
                    "user_href": "/profile/Sapnil-Rc"
                },
                {
                    "user_id": "Julia (Xi) Menna",
                    "user_href": "/profile/Julia-Xi-Menna"
                },
                {
                    "user_id": "Mya Marshall",
                    "user_href": "/profile/Mya-Marshall-12"
                }
            ]
        }
    ]
}