{
    "title": "Why do white (Caucasian) blues and jazz musicians always wear hats? - Quora",
    "tags": [
        "Jazz Musicians",
        "Blues Music",
        "Jazz Music",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Fred Garvin",
                "href": "/profile/Fred-Garvin-21"
            },
            "answer_text": "I agree with what Willy Bearden said. In addition to that I’ll add the following (it’s my opinion, and I’m certainly no expert): The black blues players from the early 1900s went to a lot of extremes in their dress and style due to the racial prejudices of the era. If everyone at the white clubs you’re playing in are making it plain that “to them” you’re nothing more than a “worthless, simple-minded, guitar-player”, one way to prove otherwise is to look the part of a classy, sophisticate with impeccable taste. Dress for success, in other words. Playing somewhere that makes you walk through the back door because they won’t let you through the front? Having to drink from a different water fountain? You do it with a smile while wearing a classy suit topped off with an awesome hat. And “looking like a stupid share-cropper” is one less bad thing they can say about you… That ability to smile while someone’s putting you down or not even paying you for the night, is the epitome of being “cool”, in fact, that IS being cool. I don’t have a clue if that’s how the whole mystique of the blues being cool got started, but it sounds likely to me. And if white guys (who can’t possibly fully understand) want some of that “cool” to rub off on them, I can certainly understand if they think the easiest place to start would be their wardrobe. But there’s a lot more to the blues than playing notes on a guitar while wearing a great hat. ",
            "date": "Answered August 8, 2019",
            "views": "493",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Scotty Wright",
                    "user_href": "/profile/Scotty-Wright-4"
                },
                {
                    "user_id": "Nelson Vidinha",
                    "user_href": "/profile/Nelson-Vidinha"
                },
                {
                    "user_id": "Sa Cill",
                    "user_href": "/profile/Sa-Cill"
                },
                {
                    "user_id": "Jack Shaw",
                    "user_href": "/profile/Jack-Shaw-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Willy Bearden",
                "href": "/profile/Willy-Bearden"
            },
            "answer_text": "In my opinion, many white Blues musicians and fans like to participate in the “look” of what they perceive to be a cool universe. Blues and Jazz are wide worlds where people can be a member of the club by simply showing up, paying at the door, and showing out. Blues and Jazz have given so many people something to do, something to think about, something to learn, and somewhere to be. It’s a cool thing. ",
            "date": "Answered July 23, 2019",
            "views": "211",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tracy Otts",
                    "user_href": "/profile/Tracy-Otts"
                },
                {
                    "user_id": "John Johnson",
                    "user_href": "/profile/John-Johnson-1566"
                },
                {
                    "user_id": "Nelson Vidinha",
                    "user_href": "/profile/Nelson-Vidinha"
                }
            ]
        }
    ]
}