{
    "title": "Why aren't there desperate single women looking for a relationship although you can find guys complaining about being single all the time? Do all the women get partners without having to try? - Quora",
    "tags": [
        "Single Women",
        "Being Single"
    ],
    "response": [
        {
            "author_info": {
                "name": "Merryl Gross",
                "href": "/profile/Merryl-Gross"
            },
            "answer_text": "The previous answers were spot-on in pointing out that most women are looking for a relationship, and can usually get meaningless sex in most bars by closing time. Most of the men I hear whining about “being single” are complaining about not being able to get meaningless sex when they want it. There is still a significant social stigma against women who just want sex. Those who might be inclined to complain in a manner similar to the guys get called some pretty nasty names. While both sexes risk sexually transmitted disease, women also risk pregnancy. It is much safer for them to seek more permanent relationships than meaningless sex. But it can be pretty exhausting trying to maintain a relationship with someone who puts up with you because then he has a regular source of sex. So put all that together and you realize that women typically have different factors influencing their desire for relationships and sex. It’s no wonder that they complain about different parts of the whole process. Original question: Why aren't there desperate single women looking for a relationship although you can find guys complaining about being single all the time? Do all the women get partners without having to try? ",
            "date": "Answered April 10, 2018",
            "views": "15",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jay Earley",
                    "user_href": "/profile/Jay-Earley"
                },
                {
                    "user_id": "Lynn Kuhlman",
                    "user_href": "/profile/Lynn-Kuhlman"
                },
                {
                    "user_id": "Richard Monks",
                    "user_href": "/profile/Richard-Monks"
                },
                {
                    "user_id": "Zhaki Kodiak",
                    "user_href": "/profile/Zhaki-Kodiak-1"
                },
                {
                    "user_id": "Jef Verstraete",
                    "user_href": "/profile/Jef-Verstraete-1"
                },
                {
                    "user_id": "Protoceratops",
                    "user_href": "/profile/Protoceratops-1"
                },
                {
                    "user_id": "Tom Psillas",
                    "user_href": "/profile/Tom-Psillas"
                },
                {
                    "user_id": "John Hudson",
                    "user_href": "/profile/John-Hudson-199"
                },
                {
                    "user_id": "Zen Sharif",
                    "user_href": "/profile/Zen-Sharif"
                },
                {
                    "user_id": "Anugrah Noinoto Gori",
                    "user_href": "/profile/Anugrah-Noinoto-Gori"
                }
            ]
        },
        {
            "author_info": {
                "name": "Phillip Cole",
                "href": "/profile/Phillip-Cole-15"
            },
            "answer_text": "I’ve noticed that too! Most men are so thirsty now a days. I seriosuly have developed a theory that I believe is, atleast my generatio, as truth and it goes as follows… It is natural for men to be the ones “hunting” and before social media and cellphones creating the ability of instant communication has shown exactly how “thirsty” men are for a variety of reasons but I’ll make it all into one broad generalization. In the past, men didn’t have the ability to talk to the woman he is after at all times, this creating her to think about him and think things that ultimately fueled her attraction for him such as if he was interested or was he going to call and things of that. Without that forcable communication gap, men can’t control themselves, and are generations behind on average when it comes to not seeming to eager. This has also created a trend that I’ve noticed where woman are so constantly praised and gratified mostly by social media by interested men, that it has become normal and for the most part lost its effect to flatter them, and also gives them a reason to not commit to just anyinterested guy, knowing that there are so many out guys who seek out her attention and a relationship with her. I got lucky and was older than my wife, and we were inchighschool, so I didn’t have to do too much, I was an “upper classman” who had many friends, so she elevated me in her mind to someone I was not. Thank goodness!! ",
            "date": "Answered May 30, 2018",
            "views": "3",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richard Shatz",
                    "user_href": "/profile/Richard-Shatz"
                },
                {
                    "user_id": "Jay Earley",
                    "user_href": "/profile/Jay-Earley"
                },
                {
                    "user_id": "Jean Jung",
                    "user_href": "/profile/Jean-Jung-1"
                },
                {
                    "user_id": "Jamal Uddin",
                    "user_href": "/profile/Jamal-Uddin-200"
                },
                {
                    "user_id": "Jake Moorehead",
                    "user_href": "/profile/Jake-Moorehead-2"
                },
                {
                    "user_id": "Jasur Juraev",
                    "user_href": "/profile/Jasur-Juraev"
                },
                {
                    "user_id": "Marl Robin",
                    "user_href": "/profile/Marl-Robin"
                },
                {
                    "user_id": "Moksudul Hoque",
                    "user_href": "/profile/Moksudul-Hoque-1"
                },
                {
                    "user_id": "Altuğ Mert Mısırlıoğlu",
                    "user_href": "/profile/Altuğ-Mert-Mısırlıoğlu-1"
                },
                {
                    "user_id": "Jacky Valdez",
                    "user_href": "/profile/Jacky-Valdez-1"
                }
            ]
        }
    ]
}