{
    "title": "Why is 'Ankita Lokhande' trending on Twitter? - Quora",
    "tags": [
        "Twitter Trends",
        "Twitter Hashtags",
        "Trending Topics (online)",
        "Rahul Gandhi (politician)",
        "Trends",
        "Indian National Congress",
        "Twitter (product)",
        "Politics of India",
        "Social Media"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pooja Bagri",
                "href": "/profile/Pooja-Bagri-20"
            },
            "answer_text": "Ans.Sushant and Ankita met on the sets of Pavitra Rishta and fell in love.  They were in a relationship for more than six years but broke up in 2016. Back then, with rumours and speculatons around their break up, Sushant had put a full stop after he tweeted, \"Neither she was an alcoholic nor I am a womaniser . People do Growapart & its unfortunate. Period!!'  Highlights \"You haven't removed his name from the nameplate,\" wrote Sandip Singh \"I miss those days, when the three of us stayed together,\" he added \"You both are true love,\" he also wrote Ankita took to Twitter to put rumours to rest. She tweeted, \"Don't feel alone I m always there in ur heart ,in ur life ❤️@itsSSR\". Aww...now isn't that adorable? Looks like the 'Kai Po Che' star and his girlfriend and are going rock solid. Now that Ankita has put breakup rumors to rest, we can't wait to see the two tying knot. Meanwhile, click on the next slide to read about celebs who we think should tie the knot soon... 1)Himanshu sharma @itsme_your_himu Ankita I know that Time is very painful for you, but you have to be strong You are a very brave girl and you have to fight for justice for Sushant now. We all your fans and family are with you. we Love you so much and we r alweys with you #AnkitaLokhande #sushantsinghrajpoot   2)Ritwij Pandey @PRitwij It's been 6 days of his demise.. and I am still not be able to come out of it. As I heard in a news that he was missing Ankita Lokhande in his last days.. this thing hit me somewhat differently. I wish they could have talked once. \"काश\"! #AnkitaLokhande #SushantSinghRajput  3)pk @archana_ng Because of  people are spreading this news.and now #toi write that this news has been removed due to inaccurate facts .how can you do this.people are continuously writing abt it. #AnkitaLokhande #FactCheck #ShushantSinghRajput   Source:-Google ",
            "date": "Answered June 20, 2020",
            "views": "58",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shalini Jha",
                    "user_href": "/profile/Shalini-Jha-106"
                },
                {
                    "user_id": "Dr Ranjana Gupta",
                    "user_href": "/profile/Dr-Ranjana-Gupta"
                },
                {
                    "user_id": "Diksha Chatterjee",
                    "user_href": "/profile/Diksha-Chatterjee-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Tista-5"
                },
                {
                    "user_id": "Debadrita Mukherjee",
                    "user_href": "/profile/Debadrita-Mukherjee-21"
                },
                {
                    "user_id": "Apurv Singh",
                    "user_href": "/profile/Apurv-Singh-33"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sumeet Suryodhan",
                "href": "/profile/Sumeet-Suryodhan"
            },
            "answer_text": "  As per Twitter and news sources. Ankita Lokhande is an Indian actress who began her career in television with her breakthrough character in Balaji Telefilms's popular daily show Pavitra Rishta on Zee TV and won various awards for the same. In the year 2016, she broke up with Sushant Singh Rajput. Both of them were dating each other since the time of 'Pavitra Rishta', but after 6 years, they also separated. Sumeet Suryodhan 🤍. ",
            "date": "Answered June 20, 2020",
            "views": "797",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sapna Kumari",
                    "user_href": "/profile/Sapna-Kumari-429"
                },
                {
                    "user_id": "Aishu Gowda",
                    "user_href": "/profile/Aishu-Gowda-27"
                },
                {
                    "user_id": "Amit Togre",
                    "user_href": "/profile/Amit-Togre"
                }
            ]
        }
    ]
}