{
    "title": "Why do we fall in love with things in life? For example, someone loves music, someone being a doctor, etc. Why do I like music and it makes me feel nice? - Quora",
    "tags": [
        "Falling in Love",
        "Understanding Love",
        "Emotions",
        "Love"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jessica Cook",
                "href": "/profile/Jessica-Cook-330"
            },
            "answer_text": "I feel when we can connect with something anything if it's relatable then this is what makes us fall in love it's the relatable connection to it.Then we listen to music sometimes it's the beat connects with how we feel at that moment so it intensifies that which we already feel or sometimes we listen to the lyrics of a song it's relatable of what we've been through in life or what we are currently going through its like somebody is singing your life story. So sometimes when we choose a career like a doctor it relates to when we had an incident in childhood where we felt helpless to help someone so this drives us to help others or we have a need to problem solve and help others and can relate to the medical field.I think in short it's about what's relatable to us and that drives our passions in life and all aspects of it. ",
            "date": "Answered June 3, 2020",
            "views": "33",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Raine",
                    "user_href": "/profile/Raine-105"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Bruss",
                "href": "/profile/John-Bruss-2"
            },
            "answer_text": "We say love but we mean we get attached to these things…they appeal to something pre-existing in us and it is like a mutual greeting. Therefore a certain type of music or profession says “Hello” to everyone but only a few people have a inner response within them that this appeals to and that appeal is like a “Hello” back. It’s the beginning of a relationship.  I hope this helps. ",
            "date": "Answered June 4, 2020",
            "views": "39",
            "upvotes": " Answer requested by Raine"
        }
    ]
}