{
    "title": "Why are low standard videos of Amit Bhadana gaining views on YouTube? - Quora",
    "tags": [
        "Amit Bhadana",
        "Viral Videos",
        "Online Video",
        "Videos",
        "YouTube Videos"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jitin Kumar",
                "href": "/profile/Jitin-Kumar-4"
            },
            "answer_text": "What may seem low standard to you, may not be for others. Amit Bhadana’s viewers are primarily rural, lower-middle class and school children(to some extent). And these sections of society represent major portion of our population. To them he is more relatable and funny than any comedian or channel that produces comedy content. Context of content from the likes of TVF, Screen patti, AIB and stand-up comedians are just out of their range of understanding. Amit Bhadana caters to those people via his videos which should be evident from his videos as well. Titles like Desi this Desi that, exaggerated rural accent and cringey shayari. Amit Bhadana is not the only such channel on YouTube. There’s this one particular comedy video on YouTube called ‘Chotu Ke Golgappe’. In less than 6 months that video garnered about 478million views.That video has nothing except poor script, over acting, bad direction and majority of you who’ll watch it will be like ‘WTF’ by the time video reaches one third of it’s total runtime. But that one video was able to get more views in 6 months than the entirety of AIB and Screen Patti’s views while stand up comedians are light years behind.   Not only this video, the dude has several videos which have crossed 50M+ in views (I checked) but not only I didn’t relate to the content but found it to be utter crap as well, simply because I am not the intended target audience for the video. Rural and Lower-middle class have much more representation on internet than earlier due to onset of cheap data plans (thanks to Jio) and over time we’ll get to see more content targeted to that group of viewers as well. ",
            "date": "Answered July 3, 2019",
            "views": "27",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Punit Sharma",
                    "user_href": "/profile/Punit-Sharma-159"
                },
                {
                    "user_id": "Kanushka San",
                    "user_href": "/profile/Kanushka-San"
                },
                {
                    "user_id": "Sayyed Sam",
                    "user_href": "/profile/Sayyed-Sam-1"
                },
                {
                    "user_id": "Arthur Dsouza",
                    "user_href": "/profile/Arthur-Dsouza-8"
                },
                {
                    "user_id": "Divyansh Agarwal",
                    "user_href": "/profile/Divyansh-Agarwal-83"
                },
                {
                    "user_id": "Nitin Singh",
                    "user_href": "/profile/Nitin-Singh-457"
                },
                {
                    "user_id": "Sanjaya Timilsina",
                    "user_href": "/profile/Sanjaya-Timilsina"
                },
                {
                    "user_id": "Aman Kashyap",
                    "user_href": "/profile/Aman-Kashyap-200"
                },
                {
                    "user_id": "Devendra Choudhary",
                    "user_href": "/profile/Devendra-Choudhary-86"
                },
                {
                    "user_id": "Khushboo Yadav",
                    "user_href": "/profile/Khushboo-Yadav-255"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aryan Arora",
                "href": "/profile/Aryan-Arora-80"
            },
            "answer_text": "Well I know why There are mainly 4 reasons (1) These videos give that rural effect illiterate people dig/like or else good content channels like AIB, Jordindian, Filtercopy, Timeliners, Arre, The ScreenPatti who put a ton times more effort and thinking to it, would have been on trending and also most subbed (2) He doesn't abuse, so a huge audience can actually watch it This is something I would also prefer other channels to do too, or either just censor it to give the same effect as before, and letting a bigger audience to see it (3) He uploads videos on a more regular basis Yes, another thing which really matters. Other Youtubers do not upload so quick to give Quality Content. But Amit just needs to put anything with a new kind of “Clickbait title” and millions of people are ready to watch it. Some watch because there's Amit Bhadana over there and other do to just check why is his video on trending, that happens all the time (4) Jio I think you are enough wise to understand this. This did had some pros but now I feel it's like cancer, anything just surface on the trending section and I'm left thinking why? Internet was so better before this. If you might know the Bobs and vagena meme is grossing across the globe just because of it. I haven't put this comment/answer on a YouTube Comment section because I know I would be thrilled by his illegitimate fans/bathsalts. But I believe there are wise and legitimate people like you on Quora, so here it goes. ",
            "date": "Answered March 7, 2018",
            "views": "36",
            "upvotes": " View 32 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aahana Dambalkar",
                    "user_href": "/profile/Aahana-Dambalkar"
                },
                {
                    "user_id": "Sayyed Sam",
                    "user_href": "/profile/Sayyed-Sam-1"
                },
                {
                    "user_id": "Nitin Gupta",
                    "user_href": "/profile/Nitin-Gupta-1941"
                },
                {
                    "user_id": "Mayank Chauhan",
                    "user_href": "/profile/Mayank-Chauhan-493"
                },
                {
                    "user_id": "Himansu Sharma",
                    "user_href": "/profile/Himansu-Sharma-22"
                },
                {
                    "user_id": "Rudra",
                    "user_href": "/profile/Rudra-265"
                },
                {
                    "user_id": "Jayesh Khemani",
                    "user_href": "/profile/Jayesh-Khemani-3"
                },
                {
                    "user_id": "Chirag Thakkar",
                    "user_href": "/profile/Chirag-Thakkar-86"
                },
                {
                    "user_id": "Devendra Choudhary",
                    "user_href": "/profile/Devendra-Choudhary-86"
                },
                {
                    "user_id": "Khushboo Yadav",
                    "user_href": "/profile/Khushboo-Yadav-255"
                }
            ]
        }
    ]
}