{
    "title": "Why are people obsessed with country music? - Quora",
    "tags": [
        "Country Music",
        "Obsession"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jimmy Dunlap",
                "href": "/profile/Jimmy-Dunlap"
            },
            "answer_text": "Because other mammals, reptiles and birds don't appreciate songs about trucks, cups, barbecue sauce, trucks and boots. Honestly, your question is impossible to answer. Firstly I don't know if people liking it qualifies as an obsession. They're not quite like phish or Grateful Dead fans where they follow the band around the country and see dozens of shows from the same person every year. You could probably make acceptions for people like Willie Nelson etc who play old school (real) country music. Pop country or new country (which is what I assume you are talking about) artists tend to play either the same or very similar set lists all summer long. But generally these days the average music listener isn't trying to appreciate music quality but is rather trying to relate to lyrics. Which is why they like songs about loving a bar or pickup trucks. What's the difference between a jazz guitarist and a country guitarist? The jazz guitarist plays 1000 chords for 3 people, the country guitarist plays 3 chords for 1000 people. Ha! Don't get me wrong, I love blue grass and some real soulful music from Appalachia but when it comes to new country I'm in the same boat as you, I personally don't understand the appeal. However having spent a couple years in customer service dealing with the general population I completely understand why it exists. I'm sure some country fans will now tell me how stupid and narrow minded I am. I'm sorry and I didn't mean to offend your tastes. My very first concert was The Elephant Show in 1988. ",
            "date": "Answered March 2, 2017",
            "views": "942",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alex Johnston",
                "href": "/profile/Alex-Johnston-39"
            },
            "answer_text": "Because good country music is good music, full stop. And if you like country music anyway, you’ll also like the less good stuff. People like music because it answers a need in them. Country music is about the stuff that country music fans care about: domestic troubles; good times; regret; loneliness; God, religion and the afterlife; booze, and how it’s the cause of and solution to all life’s problems; pride in your regional and national identity. It can be about a lot of other stuff too, but those tend to be the big themes. It tends not to ask big questions about what sort of country you’re living in, the way some of the best rap does. It tends not to be about how sexy the singer is (but it will be about how sexy the person being sung to is.) It tends not to be about death and destruction and destiny, the way metal likes to be. (All metal is about grandeur, but the best stuff is genuinely grand with a capital G, and the bad stuff has delusions of grandeur.) My personal opinion is that bad country music tends to be self-satisfied and boring, just like bad metal tends to be silly, and bad pop music tends to be trivial and annoying, and bad rap tends to be lazy and cynical. But the best country music is as good as any music and has virtues that are all its own. ",
            "date": "Answered March 2, 2017",
            "views": "14",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ralph Huisman",
                    "user_href": "/profile/Ralph-Huisman-1"
                },
                {
                    "user_id": "Kaelan Dreyer",
                    "user_href": "/profile/Kaelan-Dreyer"
                }
            ]
        }
    ]
}