{
    "title": "Why is the new Justin Bieber's song not as successful as his previous lead singles? - Quora",
    "tags": [
        "Justin Bieber (musician)",
        "Song Identification",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nuno Gouveia",
                "href": "/profile/Nuno-Gouveia-9"
            },
            "answer_text": "The song is not good enough and it’s quite bad compared to his previous works. “Yummy” song is quite childish and not very good musically or lyrically. It’s quite repetitive and lyrics remind a not very good cartoon song for kids. The video it’s also very childish and not as fun as it was meant to be (at least this time he is in the video but his image is not the best either). Pre-Teens do stream the song a lot but most teens don’t stream it much and adult audience didn’t even listen to it more than once. As track sales are also generated especially by adults and some teens audience (but almost no pre-teens) he is fast forwarding out of iTune charts. His past album had much adult songs as “What Do You Mean”, “Sorry” and “Love Yourself”. Those songs had good lyrics and were even played by Adult Contemporary Radios and Adult Radios becoming big hits on that audience. His new song was banned by those kind of radios that considered the song not adult enough to even be spinned once and he is only played by some teen and pre-teen radios. Instead Adult radios are playing “Sorry”, “Love Yourself” and “I Don’t Care”(his collaboration on Ed Sheeran song) again. MTV is playing the song A LOT but it’s not enough to make it a hit among their audience either as the song is not sticking. The song wouldn’t even be TOP 5 in US and TOP 10 in UK if it weren’t for his 3 big “marketing schemes” on week of released: Talking about his poor health condition and his new illness (the song was not on iTunes TOP 10 anymore and returned to TOP 5 in UK and #01 in US for another 24–36 hours).Asking fans on social media to stream the song as crazy (even using VPNs) so he could get to #01 in US (and lot of pre-teen fans followed his “orders”).Releasing 4 different videos for the song on first week so it could increase video streams for the song artificially among his fans and wider audiences.Some of these “schemes” even made Billboard Magazine re-think chart rules and are changing them so this doesn’t happen again. The problem with those marketing techniques is that the song gets very high on first week and then free falls on second week (in UK was down to #09 on second week and may even be out of TOP 20 on 3rd week - and in US is expected to be out of TOP 5 on second week and probably out of TOP 10 on 3rd week). As most radios take 2 or 3 weeks to decide if the song is being played or not on higher rotation the second week fall make lots of radios reduce the airplay for the song instead of increasing it. Let’s be Honest, Justin Bieber was only very successful worldwide on his solo efforts with those 3 “Purpose” album singles (“What Do You Mean”, “Sorry” and “Love Yourself”). Most of his other solo hits were smaller Hits and his biggest hits are all collaborations with other artists. “Yummy” is a solo effort so it’s doing like his other 7 or 8 solo TOP 10 Hits did (except those 3 #01 songs from his last album). ",
            "date": "Answered January 19, 2020",
            "views": "321",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sarah Sakinah",
                    "user_href": "/profile/Sarah-Sakinah-3"
                },
                {
                    "user_id": "Marina Davis",
                    "user_href": "/profile/Marina-Davis-33"
                },
                {
                    "user_id": "Kara R. Laidlaw",
                    "user_href": "/profile/Kara-R-Laidlaw"
                },
                {
                    "user_id": "Eunice Olave",
                    "user_href": "/profile/Eunice-Olave"
                },
                {
                    "user_id": "Melissa Hecker",
                    "user_href": "/profile/Melissa-Hecker-2"
                },
                {
                    "user_id": "Veronica Ribeiro-Accouche",
                    "user_href": "/profile/Veronica-Ribeiro-Accouche"
                }
            ]
        },
        {
            "author_info": {
                "name": "Veronica Ribeiro-Accouche",
                "href": "/profile/Veronica-Ribeiro-Accouche"
            },
            "answer_text": "It might be because it has been globally criticised, Justin’s fans, market have grown up as has he. The music is suited to someone who is charismatic and can appeal to a wider age group, his age group. The fans have matured and seen that there other styles of songs. Yummy is very repetitive and not likeable. I would not sing about a food order. The melody is not the best; Despacito had an alluring rhythm not to mention even you did not understand Spanish a pleasing sound. He also is not a song writer; if he had he may have been able to turn things around. Today it is extremely easy to change songs whether on Vivo, YouTube, Tik Tok etc and well do you really want to wait to the end of the song? Although he has been ill with Lyme’s disease he should have been advised not have this as the lead song; it’s not the best. ",
            "date": "Answered January 17, 2020",
            "views": "113",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nuno Gouveia",
                    "user_href": "/profile/Nuno-Gouveia-9"
                },
                {
                    "user_id": "Alexander Junior Souto",
                    "user_href": "/profile/Alexander-Junior-Souto"
                },
                {
                    "user_id": "Connie Casella",
                    "user_href": "/profile/Connie-Casella"
                }
            ]
        }
    ]
}