{
    "title": "Why is The Beatles music not that great? - Quora",
    "tags": [
        "Paul McCartney",
        "The Beatles (band)",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Francis Huteson",
                "href": "/profile/John-Francis-Huteson"
            },
            "answer_text": "I might be wrong. However I believe a few people may have misunderstood what the writer ment. The Beatles were and will always be kings of their art. However we also must remember when they recorded their music and the technology of the equipment available to them at the time they recorded their albums and the style of engineering of the time. Abbey road studio was still wearing white coats in the studio. Everything was by the book written by people that recorded with wax not too long before the Beatles came along. The Beatles recorded on 2-track tape machines with I believe 2 1/2 wide tape. which probably why during the remastering of their most recent album releases produced by Giles. He was able to make them sound modern by today’s standard. However during their time. The Beatles records were standards. Listen to other British bands of the time. I listened to the Pete Best combo and the Yardbirds. and found the sound to be harsh to the ears. But that was the standard of the time. By the time they began recording with 4-track recorder, or sync’d to a 2nd 4-track like in Sgt. Pepper, recording technique had grown. Placing mic’s closer to the amps. Closer to the drums. Recording the bass guitar direct to the board onto its own track. Stuff that was “just not done” at the time. And their engineers were getting called to the head office. And then to hi-jack the brand new 8-track to begin recording “Abbey road”. The sound of that album alone is high and above their first album in sound Superiority. . Lennon him self said their earlier albums sounded like crap and wanted to record many of their songs over again. So to answer the question as to why the Beatles music doesn’t sound good. well. Take your phone. Which is still light years ahead of what they had. And record 14 songs. then grab you computer with all today’s modern plug in’s and record the same songs. Then you tell me. why does your music suck. and remember. They recorded together live. No computers. No effects. No pro-tools. I can tell you this. You’ll suck. mahalo ",
            "date": "Answered October 13, 2020",
            "views": "375",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tim Lukeman",
                    "user_href": "/profile/Tim-Lukeman"
                },
                {
                    "user_id": "Ludwig Rapinett",
                    "user_href": "/profile/Ludwig-Rapinett"
                },
                {
                    "user_id": "Ernie Black",
                    "user_href": "/profile/Ernie-Black-3"
                },
                {
                    "user_id": "Sandra Brisebois",
                    "user_href": "/profile/Sandra-Brisebois"
                },
                {
                    "user_id": "Neil Omer",
                    "user_href": "/profile/Neil-Omer-2"
                },
                {
                    "user_id": "David Pericone",
                    "user_href": "/profile/David-Pericone"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nur Lajunen-Tal",
                "href": "/profile/Nur-Lajunen-Tal"
            },
            "answer_text": "No one can answer this question for you but yourself. It’s completely subjective. There is no good or bad music, and only you can decide what is or isn’t great for you, and why. Why do you think The Beatles’ music isn’t that great? I’m sure you have your reasons for thinking that. They’ll be different from the reasons of other people who think their music isn’t that great. Since we’re talking The Beatles, this question is full of answers trying to prove you “wrong,” and that they are great. As expected. Like them or not, they’re probably the most famous band of all time, which obviously means they have a LOT of fans. And fans (of anything) like to think their favourite is the best. Most famous doesn’t necessarily mean best though- there is no “objective best band of all time” and don’t let anyone tell you otherwise. I love The Beatles. I don’t think their music is “not that great,” but I can’t expect everyone to share that opinion. However, the way you worded the question makes me think you’re looking for an objective answer to this question- I’m sorry to tell you that you’re not going to find one by asking other people. Everyone’s opinion on The Beatles (or any artist) is slightly different, and they’re just going to answer with what’s true to them rather than to you. Stick with the answer that’s true to you- it’s YOUR right answer and, love or hate The Beatles, you can only be right in regards to a subjective art form like music. ",
            "date": "Answered October 22, 2020",
            "views": "109",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tim Lukeman",
                    "user_href": "/profile/Tim-Lukeman"
                },
                {
                    "user_id": "Lee Noack",
                    "user_href": "/profile/Lee-Noack-2"
                },
                {
                    "user_id": "Paul Wenman",
                    "user_href": "/profile/Paul-Wenman-1"
                },
                {
                    "user_id": "Glenn Schryver",
                    "user_href": "/profile/Glenn-Schryver"
                }
            ]
        }
    ]
}