{
    "title": "Why do I always see the bad BTS' fans more than I see bad EXO fans? - Quora",
    "tags": [
        "EXO (K-pop group)",
        "Fans and Supporters",
        "BTS (K-pop group)",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dionne Estrada",
                "href": "/profile/Dionne-Estrada"
            },
            "answer_text": "Time to become unbiased now haha. Alrighty, comparatively there are a ton more activities being thrown at BTS’s way since the rise of their fame from their attention on a global scale began during Love Yourself Era. Now, undoubtedly, both groups have massive fandom power, but what made BTS fans stand out is because….well…we just stand out. Think of it this way. Its odd to find a fandom praised first before the group. But all at the same time, the group's presences in mainstream media is because of the Fandom. If you look through most of their early interviews in the US. Aside the common celebrity crush questions, interviewers always asked about what they think about Armys. The thing with business and promotion, is that, the more the company promotes a certain brand, the more people are curious over it. This wasn't the case for BTS. There was no Payola play. Armys, as a fandom grew organically, but it also garnered not only their own reputation but also some rotten fans. Each fandom notably has them, but the main reason that Armys are the most noted with toxic fans, is because we do, in some way represent an image of a fandom. What does that mean? Well, generically, fans are just seen as fans. They aren't as famous as the artists they support. Fans are merely props or numbers that equates to how popular a group is. But clearly there is no solid description that distinguish crazy fan to crazy fan of celebrities. Now, so why do general public or kpop fans see more toxic fans in BTS than EXO? Well let's go back to to my first point, and make our way down. While EXO clearly has their oen individual and group activities, it is BTS that has more attention, but as a more package deal for US media. Armys and BTS are an anomaly. The growth of the fandom and organic leaps to sales and album charting baffles statistics for the standard of kpop. BTS were not joking when they say, Armys work hard, because we as a fandom needed no more promotions from Bighit because we can promote the boys ourselves haha. For those outside the fandom, we do appear like a noisy bunch of fans constantly communicating with each other to vote, stream, or buy albums. But really, its because armys work like the unofficial PR of BTS. Media and the music/entertainment industry find it rather interesting that while all kpop groups have the same fomula of idol groups, like BTS, only a few can match the independency of Armys to get the boys where they are. Its our noise through social media sites to gather together or simply build the community more that makes it prone for other fandoms to point fingers at our bad apples. No doubt Exo-ls matured as a fandom, but Armys are matured as well, it just got bigger through the years. Not only that, EXO-Ls just communicate in a much quieter scale because their communication isn't as flooded and well seen as Armys online. There was a reason why twitter bots block BTS related hashtag 24hrs, its because the bts tag is always trending. Surely, with the large population of Armys use social media round the clock, other kpop fans will see the bad apples of Armys a lot more than bad apples of exo-ls. Give or take, if half of the twitter army population isn't active on twitter, other fandoms can be on the worldwide trends too, or at least the bad apples will be equally noticeable. That's my take on it. ",
            "date": "Answered May 8, 2019",
            "views": "4",
            "upvotes": " View 61 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sio F",
                    "user_href": "/profile/Sio-F"
                },
                {
                    "user_id": "Lili Cho",
                    "user_href": "/profile/Lili-Cho-2"
                },
                {
                    "user_id": "Tharanga Hapuarachchi",
                    "user_href": "/profile/Tharanga-Hapuarachchi"
                },
                {
                    "user_id": "Safirta Fatmarianti",
                    "user_href": "/profile/Safirta-Fatmarianti"
                },
                {
                    "user_id": "Aflin Demi",
                    "user_href": "/profile/Aflin-Demi"
                },
                {
                    "user_id": "Vaishnavi Singh",
                    "user_href": "/profile/Vaishnavi-Singh-593"
                },
                {
                    "user_id": "Nidia Harper",
                    "user_href": "/profile/Nidia-Harper"
                },
                {
                    "user_id": "Jahnabi Sharma",
                    "user_href": "/profile/Jahnabi-Sharma-4"
                },
                {
                    "user_id": "Caroline Summers",
                    "user_href": "/profile/Caroline-Summers-7"
                },
                {
                    "user_id": "Grace Ebojo",
                    "user_href": "/profile/Grace-Ebojo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zeenah Abella",
                "href": "/profile/Zeenah-Abella"
            },
            "answer_text": "The reason for it is because EXO-L already matured regardless of the age since we are already done with those trashy baseless fanwars. EXO-L are focused more on taking care and loving the members than putting their name anywhere since they are already established in the industry. EXO don’t need to prove themeselves from the world because they are loved by many ❤️ As what EXO said “EXOL are our daesangs” and having a stable and loyal fandom means we can always help our boys to be on top and they are always on a different level ❤️ EXO have more genuine and loyal fans unlike BTS who may have the most number of fans in the world but there are a lot of bandwagons claiming themeseleves as fan but ruining the fandoms name. ARMY has a lot imof immature and social media attention seeker fans. Ghey want all credits to BTS which is very pathetic. BTS is not kpop period! I’ve been a fan of kpop for more than a decade and honestly it is my first hearing a fandom go to that extreme which is hilarious I know few people which are my friends who moved on from BTS because of their change of music and their toxic fandom ",
            "date": "Answered May 7, 2019",
            "views": "549",
            "upvotes": " View 32 Upvoters",
            "upvoters": [
                {
                    "user_id": "Matouleibi Thokchom",
                    "user_href": "/profile/Matouleibi-Thokchom"
                },
                {
                    "user_id": "Shalmali",
                    "user_href": "/profile/Shalmali-9"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/ᴸ-Chan-¹²⁷"
                },
                {
                    "user_id": "Sina Bhuju",
                    "user_href": "/profile/Sina-Bhuju"
                },
                {
                    "user_id": "Jirlori Rongpipi",
                    "user_href": "/profile/Jirlori-Rongpipi"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Sana-Maq-2"
                },
                {
                    "user_id": "Nyashadzashe Ncube",
                    "user_href": "/profile/Nyashadzashe-Ncube"
                },
                {
                    "user_id": "Adriel Joseph Islao Dimayuga",
                    "user_href": "/profile/Adriel-Joseph-Islao-Dimayuga"
                },
                {
                    "user_id": "Muskan Verma",
                    "user_href": "/profile/Muskan-Verma-339"
                },
                {
                    "user_id": "Manu Shukla",
                    "user_href": "/profile/Manu-Shukla-11"
                }
            ]
        }
    ]
}