{
    "title": "Why did Divya Khosla Kumar call Sonu Nigam “thankless”? - Quora",
    "tags": [
        "Divya Sharma",
        "Vinod Khosla",
        "Sonu Nigam (singer, actor)",
        "Bollywood Actors and Actresses",
        "Bollywood",
        "Celebrities",
        "Work"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kshitij Kabir",
                "href": "/profile/Kshitij-Kabir"
            },
            "answer_text": "Divya khosla is known for her bold and beautiful look.  After singer Sonu Nigam targeted T-Series head honcho Bhushan Kumar in a video, actor and filmmaker Divya Khosla Kumar has accused him of peddling lies. On her Instagram stories, she said that Sonu was launched by the music label and called him ungrateful.   She wrote on Instagram “Today it’s all about who can run a good campaign.... im even seeing people being able to sell lies & deceits with their strong campaigns.... #sonunigam,” Divya wrote, adding, “such kind of people know how to play with the minds of the audience ..... God save our world !!!” sonunigam ji TSeries ne aapko industry mein break Diya... aapko itna aage badaya .... agar aapko itni hi khundas thi Bhushan se toh phele kyun nahi bole ... Aaj publicity ke liye kyon kar rahe hai ... Aapke pitaji ke khud maine itne videos direct kiye jiseke liye woh Hamesha itne Shukar guzar rehte thee (Sonu Nigam ji, T-Series gave you your first break in the music industry and helped you come so far in your career… If you had an axe to grind with Bhushan, why did you not talk about it earlier? Why are you doing it now for publicity? I, myself, have directed so many of your father’s music videos and he was always grateful for that)... But some people r thankless. #achasiladiyatunemerepyaarka,” she wrote. Source Bhushan Kumar’s wife Divya Khosla lashes out at ‘thankless’ Sonu Nigam, accuses him of ‘selling lies and deceit’ ",
            "date": "Answered June 23, 2020",
            "views": "10",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dhruvik Pankaj Shah (ध्रुविक पंकज शाह)",
                    "user_href": "/profile/Dhruvik-Pankaj-Shah-ध्रुविक-पंकज-शाह"
                },
                {
                    "user_id": "Umang Patel",
                    "user_href": "/profile/Umang-Patel-461"
                },
                {
                    "user_id": "Hcpl Dolly",
                    "user_href": "/profile/Hcpl-Dolly"
                },
                {
                    "user_id": "Alex",
                    "user_href": "/profile/Alex-7483"
                },
                {
                    "user_id": "Hemanth",
                    "user_href": "/profile/Hemanth-390"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shawn Smith",
                "href": "/profile/Shawn-Smith-339"
            },
            "answer_text": "T-series launched Sonu Nigam and gave him his first break to him in the music industry, so according to that, she thinks he should not have said all those things about Bhushan Kumar on his recent video. Sonu should be more grateful foe people who helped him in the initial stage. Basically her logic is straight forward, if someone helps you or gives you an opportunity, you forever should endure abuse and be under their foot as long as they exist, you should never speak up against their harassment. If we go by her logic, we can only assume what all she has gone through and still going through but keeping quiet about it because she doesnt want to be ungrateful. P.S - Sonu Nigam warned Bhushan Kumar to back off and stop spreading lies about him and also counted the number of times Bhushan Kumar came crying to him for help. He also mentioned a particular name of a female model/actress whom he has the video evidence, which would reveal the original face of Bhushan Kumar to the world. He told him that if he wont back off then he will release thar video in his official youtube account in detail for everyone to understand. ",
            "date": "Answered June 23, 2020",
            "views": "483",
            "upvotes": "0"
        }
    ]
}