{
    "title": "Why are Taehyung stans the worst K-pop fans? - Quora",
    "tags": [
        "K-Pop Fans"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joan Park",
                "href": "/profile/Joan-Park-7"
            },
            "answer_text": "Yep, I immediately understand your question. I’ve had the same thoughts with a lot of other idols. Now that BTS are becoming a worldwide sensation, their fan base is increasing. By a HUGE amount. And what does that mean? More fans, older and younger, joining the fan base. No one’s got a problem with that. It’s just the certain immature, naive fans that tick people off. These fans (I would say most of them are pretty young) are the ones who are discovering BTS from their love yourself album. The newbies, I would say. Not all of them are immature, but around 60 percent are. They’re the ones who start fan wars online. Or only choose to stan one member. Or get way too possessive over their bias! And they’re the ones who choose their specific bias based on their looks and popularity. They’re the ones who immediately avert their gaze to the maknae line - Jungkook, Jimin and V. If you think about it, the most mature ARMYS are fans of the hyung line. There could be some newer fans who also stan the hyung line - that’s because they have a pretty mature mindset. Half of the maknae line fandom only exist to kind of idolise their bias because of their visuals and popularity. So, since Taehyung is one of the most popular members, his fandom consists of the really toxic Kpop fans. Now I’m not saying that ALL of the maknae line stans are toxic. I’m just saying that, from personal experience, the more young and naive fans tend to have either Jungkook, Jimin or Taehyung as their bias. ",
            "date": "Answered August 18, 2018",
            "views": "34",
            "upvotes": " View 37 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anna Verlac",
                    "user_href": "/profile/Anna-Verlac"
                },
                {
                    "user_id": "Tanveer Farooqui",
                    "user_href": "/profile/Tanveer-Farooqui-7"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Soni-296"
                },
                {
                    "user_id": "Izzah Fatima",
                    "user_href": "/profile/Izzah-Fatima-8"
                },
                {
                    "user_id": "Ash Sharma",
                    "user_href": "/profile/Ash-Sharma-117"
                },
                {
                    "user_id": "Kashish Talwar",
                    "user_href": "/profile/Kashish-Talwar-11"
                },
                {
                    "user_id": "Harsh Thakur",
                    "user_href": "/profile/Harsh-Thakur-349"
                },
                {
                    "user_id": "Kamariyae Henderson",
                    "user_href": "/profile/Kamariyae-Henderson"
                },
                {
                    "user_id": "Irish R. Limet",
                    "user_href": "/profile/Irish-R-Limet"
                },
                {
                    "user_id": "Jay Jay",
                    "user_href": "/profile/Jay-Jay-2723"
                }
            ]
        }
    ]
}