{
    "title": "Why do rock stars as diverse as Keith Richards, Pete Townshend, Jack Bruce, Angus Young and Rod Stewart hate Led Zeppelin’s music? - Quora",
    "tags": [
        "Jack Bruce (musician)",
        "Angus Young",
        "Pete Townshend (musician)",
        "Rod Stewart (musician)",
        "Keith Richards (musician)",
        "Rock Stars",
        "Led Zeppelin (band)",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carl Garthwaite",
                "href": "/profile/Carl-Garthwaite"
            },
            "answer_text": "I wasn’t aware that any of those people hated Led Zeppelin’s music... However, if they did, I can explain it simply with four words: “Market Share” and “Record Sales”. Let’s suppose you were a member of a really popular band. Your singles and albums are selling well, you have upcoming tour dates, and your future seems secure. Suddenly, seemingly out of nowhere, comes not “just another band”, who may or may not “make it” for the long term, but Led Zeppelin. You don’t mind a few “One hit wonders” coming and going… quickly fading away, and making it even more apparent how great you and your band are… But a band like Led Zeppelin isn’t like that… They are potentially quite dangerous to your long term success. As a talented musician, you see their talent. As someone who has sold lots of records, you instinctively know that their record sales will go huge! Massive! And why wouldn’t they? They filled the “Heavy Blues Rock” niche left behind by Cream breaking up… They are “Heavy” in a time when “Heavy” was really coming into it’s own… They have a fantastic different sound and feel, tight well rehearsed material and they all look like Rock Gods. Their album covers even have an iconic look… Teenage boys of the day love “Heavy” music and are almost invariably fascinated by airships. And the Teenage girls all fantasize about “being with” these mysterious and intoxicating Rock Gods. That’s enough to make any professional band or musician, at or very near the top, review the current performance of their record sales… Then cringe and review their retirement savings. They know right away, that “these guys” are going to be getting a substantial amount of the mostly teenage provided money that they had been living off for years. Much more for Led Zeppelin, and much less for everyone else. This is a serious threat! Time to do some damage control. Time to talk some smack. Time to publicly say that Led Zeppelin is too this, or too that, and not enough this or not enough of that. Their sound isn’t pop enough, it’s too pop. They’re a sellout… They’re too different, not different enough… Their music won’t last long, etc. - Finally adding an “I wish them well” so as not to appear to be a jealous total douche-bag… Desperately hoping the entire time, that your credentials and “insider opinion” will ensure that they’ll go over like a “lead balloon”, in a great ball of flames and ultimately disappear. Sorry… Not this time! Bands always have, still do have, and probably always will have, a very strong inclination toward competitiveness. At all levels from basement bands to the top professionals. It’s not much different than different sports teams talking smack about each other. To win “King of the hill”, you need to stay at the top. And most people, will do or say almost anything to maintain their status. ",
            "date": "Answered June 21, 2019",
            "views": "17",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Treaghy Frantz",
                    "user_href": "/profile/Treaghy-Frantz"
                },
                {
                    "user_id": "Barbara Redeker",
                    "user_href": "/profile/Barbara-Redeker"
                },
                {
                    "user_id": "Charlie Proudman",
                    "user_href": "/profile/Charlie-Proudman"
                },
                {
                    "user_id": "Edith C. DuFoe",
                    "user_href": "/profile/Edith-C-DuFoe"
                },
                {
                    "user_id": "Charlie Martin",
                    "user_href": "/profile/Charlie-Martin-27"
                },
                {
                    "user_id": "Iskender Sonmez",
                    "user_href": "/profile/Iskender-Sonmez"
                },
                {
                    "user_id": "Chris Corallino",
                    "user_href": "/profile/Chris-Corallino"
                },
                {
                    "user_id": "Guy Lewis",
                    "user_href": "/profile/Guy-Lewis-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Newman",
                "href": "/profile/John-Newman-138"
            },
            "answer_text": "I have wondered about this myself for years. I think the honest answer is that they’re simply jealous. All of the names you mention were known musicians, big stars in fact, before Zeppelin started in late 1968. In most cases it had taken them years to achieve success. Then along came Led Zeppelin and redefined what success actually meant. They sold more records, more concert tickets and made more money than any other band outside the Beatles, and they did it far more quickly than anyone else ever had. There is also a certain snobbishness common to people like Townshend and Jack Bruce, who seem to feel that Zeppelin took the ‘pure’ music they had made popular and commercialized it. This is a quite hilarious attitude to take when you consider that every single one of them got their start by copying American blues and rock n roll musicians. Maybe Zeppelin just isn’t Townshend et al’s cup of tea musically, which is fine…but I think the truth is simply that after having the limelight to themselves for years Led Zeppelin came along and pushed them aside. It’s bruised egos, nothing more. ",
            "date": "Answered June 23, 2019",
            "views": "14",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Venkat Agiri",
                    "user_href": "/profile/Venkat-Agiri"
                },
                {
                    "user_id": "Steve Clement",
                    "user_href": "/profile/Steve-Clement-5"
                },
                {
                    "user_id": "Edith C. DuFoe",
                    "user_href": "/profile/Edith-C-DuFoe"
                },
                {
                    "user_id": "Iskender Sonmez",
                    "user_href": "/profile/Iskender-Sonmez"
                },
                {
                    "user_id": "Daniel Besser",
                    "user_href": "/profile/Daniel-Besser"
                },
                {
                    "user_id": "Guy Lewis",
                    "user_href": "/profile/Guy-Lewis-7"
                }
            ]
        }
    ]
}