{
    "title": "Why did Eric Clapton move from the Les Paul to the Stratocaster? - Quora",
    "tags": [
        "Eric Clapton",
        "Les Paul",
        "Fender Stratocaster",
        "Gibson Guitars",
        "Fender Guitars",
        "Electric Guitars",
        "Guitars"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Virgil",
                "href": "/profile/David-Virgil-1"
            },
            "answer_text": "I’m not sure where you got that idea that Clapton’s signature guitar was once a Gibson LP. That’s simply not true. He did use a Les Paul at times along with other guitars including Gretsch and Fender but never really exclusively used a LP. I’ve met Clapton a few times once in 1972 and back stage he was strumming away on an acoustic the first time we met he was play blues songs. He had a few guitars for that show but mainly played the Strat at that show. I saw him again a few years later and once again he used the Strat the most. I once talked to him about guitars and as someone had already mentioned he liked the tone of the LP but what he didn’t like was the weight and during a show it got to be very heavy after a wile. Plus for his style of blues the Strat had a better sound. He did say that in the studio he would use the LP on songs because of the sound and tone but live the Strat was just so much better to play. I will also say he was a great guy as I was really a nobody and was part of the crew setting up for the show. This was before I was in a band myself but I was just starting to play. He actually stopped me because I was rushing around and he told me no need to rush there was plenty of time before it was showtime. I was rushing because my wife was 9 months pregnant and ready to deliver at any time. He asked if I wanted a boy or girl and I said boy. He then asked if I had a name picked out and I said not really and he then said that Eric was a good name. He definitely had a sense of humor. I told him if it were a boy I’d name him Eric. I did have a boy and when I saw Clapton about 2 years later he actually remembered me and at that Time I was in a band. He asked if I had a boy or girl and I told him it was a boy and as promised I named him Eric. He smiled and said good going. I already liked Clapton but after that I was a fan for life. He was just a great and down to earth guy and very genuine. I’m sure between 72 -74 he’d met thousands of people and yet he remembered me and remembered what we had talked about. Since I'm getting comments I feel the need to clarify my answer a little better. I never said that Clapton didn’t use Gibson guitars. the question was about a signature Les Paul. Clapton's first guitar was a 1960 Les Paul but that was stolen in 1966. That does not make it a signature guitar. From 65–70 he used several guitars including a Gibson 335 and that was his primary guitar. Then he had the famous Fool Gibson SG guitar. While these were notable guitars they were not signature guitars. Clapton is best known for Fender Strats and I would say that Blackie would be a true signature guitar. ",
            "date": "Updated June 2, 2017",
            "views": "255",
            "upvotes": " View 108 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Keilhofer",
                    "user_href": "/profile/Michael-Keilhofer-1"
                },
                {
                    "user_id": "Steven Silburn",
                    "user_href": "/profile/Steven-Silburn"
                },
                {
                    "user_id": "Kevin Miller",
                    "user_href": "/profile/Kevin-Miller-141"
                },
                {
                    "user_id": "Matt Jones",
                    "user_href": "/profile/Matt-Jones-782"
                },
                {
                    "user_id": "Harry Peake",
                    "user_href": "/profile/Harry-Peake-6"
                },
                {
                    "user_id": "Luke Buchhagen",
                    "user_href": "/profile/Luke-Buchhagen-2"
                },
                {
                    "user_id": "J C Collins",
                    "user_href": "/profile/J-C-Collins-2"
                },
                {
                    "user_id": "S Karim",
                    "user_href": "/profile/S-Karim-16"
                },
                {
                    "user_id": "Max Michaeler",
                    "user_href": "/profile/Max-Michaeler"
                },
                {
                    "user_id": "Keith Jmesion",
                    "user_href": "/profile/Keith-Jmesion"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Gorman",
                "href": "/profile/Michael-Gorman-12"
            },
            "answer_text": "Eric Clapton is a guitar player, and this means he likes to try out lots of different guitars, effects and build his own sound - it comes with the territory. Being an inquisitive, and creative player Eric tended to try out many different guitars, I saw him playing a Les Paul 3 pickup model for the Disrali Gears sessions, he played a distinctive SG Gibson for quite a while also, the one painted by ‘The Fool’ artist community. A Gibson ES-335 was his guitar of choice around the ‘Wheels of Fire’ album, and he also played a ‘Firebird’ and a Telecaster. Around the 1969 stage, Eric Clapton took a liking to the Stratocaster, I think his very good friend George Harrison may have been the first to get a Strat, and no doubt Eric noodled around on this and decided he liked it. By the time Layla was being produced, Clapton was a full on Strat-man and he put together the now famous ‘Brownie and Blackie’ Strats, ‘Brownie’ being the principal Layla guitar. So, it seems Strats became his focus around the 1967 onward time period, I recall that Eric bought a few Strats on his travels around America and was going to present Jimi Hendrix with one of these, but of course Hendrix had the bad manners to die before Eric could give this to him. This information is readily available online if you research it, lots of stories and accounts from that time, but Eric Clapton did not play a Les Paul exclusively, he played SG, 335, Firebird also, like most guitar players he has played lots of different models and brands. By 1970, Clapton was playing Stratocasters most often. As many guitar players know, Strats are just so versatile, you can get lots of tones and distinctive settings which you just cannot get from Gibson humbucker style guitars, although in my book the 335 is also extremely versatile. As the saying goes, a man’s taste is not open to disputation, Eric Clapton prefers the Strat. ",
            "date": "Answered October 4, 2018",
            "views": "27",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dandada Pierre",
                    "user_href": "/profile/Dandada-Pierre"
                },
                {
                    "user_id": "David Espinosa",
                    "user_href": "/profile/David-Espinosa-49"
                },
                {
                    "user_id": "Richard Cabrera",
                    "user_href": "/profile/Richard-Cabrera"
                },
                {
                    "user_id": "Richie Blankenship",
                    "user_href": "/profile/Richie-Blankenship-1"
                }
            ]
        }
    ]
}