{
    "title": "Why does SoundCloud load songs so slowly? - Quora",
    "tags": [
        "SoundCloud (product)",
        "Social and Online Music",
        "The Internet",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aakash Shah",
                "href": "/profile/Aakash-Shah-11"
            },
            "answer_text": "The main reason behind the slow loading of SoundCloud, is the extensive client side rendering done by SoundCloud. With the advent of dynamic websites, there were trade offs between client side and server side rendering. Soundcloud being a massive streaming platform, wants user to have least amount of interruption. This is the reason, its entire framework is loaded from the server, and then most likely javascripts are responsible for client side rendering. The only issue with this is, that it has a higher boot time, than usual especially for slow internet connections. Honestly, it also matter where you live and which server are you trying to locate. But anyway that is abstracted out. ",
            "date": "Answered May 10, 2017",
            "views": "28",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hevimestar",
                    "user_href": "/profile/Hevimestar"
                },
                {
                    "user_id": "Nima Y",
                    "user_href": "/profile/Nima-Y"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kamil Anonim",
                "href": "/profile/Kamil-Anonim-1"
            },
            "answer_text": "Yeah I’m having similar issues, there must be something wrong on their side. Sometimes, random songs will just start buffering in the beginning/middle of the song for unusual periods of time, even though my internet connection is fine since I can just go to YouTube and watch 1080p videos without any hassle. Got to deal with it, I guess… ",
            "date": "Answered January 3, 2017",
            "views": "2",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chris Rysdale",
                    "user_href": "/profile/Chris-Rysdale"
                },
                {
                    "user_id": "Anas Zeid",
                    "user_href": "/profile/Anas-Zeid"
                }
            ]
        }
    ]
}