{
    "title": "Why are some able to sing four octaves and others can’t? - Quora",
    "tags": [
        "Octave",
        "Singing",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ryan Shivdasani",
                "href": "/profile/Ryan-Shivdasani"
            },
            "answer_text": "Most people can’t. That’s an almost unheard of range. And everyone has a specific range. That’s how it works. -You can increase your range, but 4 octaves is a pipe dream for most people. -and a large range is the last thing that makes a singer great. My personal favorite singers are smarter than they are gifted. I prefer a singer with good phrasing, rhythm, and inflections. Often it’s the singers with the lesser vocal abilities who learn to do the actual things that matter both because they have to, and because they learn to over what for them is a long and grueling process of learning to sing (which they only put themselves through because they are the types of people who are already musical and have ideas and something to say to begin with.) They have to experiment more and work harder, and the end result is an infinitely more interesting and profound artist. This is obviously guys like Bob Dylan, Lou Reed, Kurt Cobaine, Anthony Keidis, Neil Yong, and really most rock singers apart from a few wonders, like Stevie Wonder (just shy of 4 octaves and widely considered to be the best singer in the industry) Freddie Mercury or Steven Tyler. And not everyone agrees, but while I could listen to Bob Dylan hack tunes out all day and night, if you put a Marriah Carrey or Whitney Houston song on in my presence, I’d tell you to turn it off. And you’d either listen or get hurt. And again, 4 octaves is ridiculous. Elvis had a beautiful voice and phenomenal technique and is considered to have had a great range at 2 1/3 octaves. Sinatra also and was just over 2 octaves. Sam Cooke is appropriately considered to have been one of the greatest vocalists of the 20th century with about a 3 octave range. Ella Fitzgerald, who is at the very least one of the most virtuosic jazz singers who ever lived if not the most, did as well. Al Green, Paul McCartney, Robert Plant, and James Brown all had about 3 also. So just 3 octaves is already rare and plenty to work with. There are one of a kind freaks like Bobby McFarren who I believe can do over 6 octaves. But, you know.. aside from the fact that he happens to be great also… who cares? Then you have powerful voices and singers who didn’t have special ranges but did have terrific voices. Bob Marley, Joe Cocker, Marvin Gaye, Nat King Cole, etc etc And then there are the really cool ones.. Billy Holiday only had about an octave and her voice wasn’t particularly full or strong. In fact it was kind of thin and whispy. But her sense for rhythm and phrasing was unmatched, and she’s one of the most celebrating singers ever because of it. Part of what people would say was that she could swing like a trumpet player.. specifically like Louis Armstrong, who had an uniquely awesome voice but definitely very limited range as well. And he also is one of the best jazz singers there’s been. Chet Baker is another one. Nothing special about his voice or range at all, but he was a great musician (trumpet as well) and again he had a great feel and vibe. Hendrix also had great rhythm and sense for phrasing. And his voice was undeniably charming even if he was obviously limited. And you might know the scene where Audrey Hepburn sings Moon River in Breakfast at Tiffany’s and sounded as beautiful as she looked. They wrote that song specifically to accommodate her single octave vocal range. Madonna didn’t have a great range. Or a great voice. Or a great feel or songs for that matter. I’m not sure I understand why she’s a celebrity at all. The list goes on.. but the point is you don’t need a 4 octave range. ",
            "date": "Answered May 20, 2018",
            "views": "13",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mark Howe",
                    "user_href": "/profile/Mark-Howe-19"
                },
                {
                    "user_id": "Coraima Orochena",
                    "user_href": "/profile/Coraima-Orochena"
                },
                {
                    "user_id": "Israel James Cullett",
                    "user_href": "/profile/Israel-James-Cullett"
                },
                {
                    "user_id": "Gillian Louise Omotoso",
                    "user_href": "/profile/Gillian-Louise-Omotoso"
                }
            ]
        },
        {
            "author_info": {
                "name": "Addy Rose",
                "href": "/profile/Addy-Rose-4"
            },
            "answer_text": "It really depends on you. Well, first of all with the way your vocal chords are built. Some are thin, some are thick. Some are short, some are long. This determines whether you can sing higher or lower. I, personally, am a very low singer. But the main reason is because of training. For example, from 2008–2010, Demi Lovato (who has a four octave range) sang from D3 to A5. That's under three octaves! She was still an extraordinary singer, because the size of your vocal range isn't as important as the way you use it. But now, Demi has extended her range to C#3-Eb7, or four octaves, one note and a semitone. Her technique isn't perfect, but it's better now than it ever was. It was also great around 2009 or early 2013, despite her smaller range. Another example is Brendon Urie, who is one note off five octaves. In 2005, when he first started his career, he sang from A2-F#5. Just under three octaves is still impressive, as I mentioned with Demi, but much smaller than what he has now. Now his vocal range spans from D2-C7, or four octaves and seven notes. His vocal technique is great, though his voice has been slightly damaged by smoking, which he has since quit. Most people can't sing with such large ranges, as the average person can only sing 1–2.5 octaves. You can still become successful with a small range, and a lot of popular singers have proven that, e.g. Selena Gomez, Taylor Swift. Selena and Taylor are both pretty good singers (though not perfect, and not as excellent as either Demi or Brendon). If you have a naturally large range (2–3) without training, you might be able to get there one day, but most people can't. It's better to make good use of what range you have than damage your voice trying to sing too high or low. Thanks for the A2A! ",
            "date": "Answered August 8, 2018",
            "views": "16",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amir Aviv",
                    "user_href": "/profile/Amir-Aviv"
                },
                {
                    "user_id": "Mark Howe",
                    "user_href": "/profile/Mark-Howe-19"
                },
                {
                    "user_id": "Abbey Clark",
                    "user_href": "/profile/Abbey-Clark-9"
                },
                {
                    "user_id": "Jay Dutt",
                    "user_href": "/profile/Jay-Dutt-2"
                },
                {
                    "user_id": "Laura Polónyiová",
                    "user_href": "/profile/Laura-Polónyiová"
                },
                {
                    "user_id": "Annika B",
                    "user_href": "/profile/Annika-B-4"
                },
                {
                    "user_id": "Gillian Louise Omotoso",
                    "user_href": "/profile/Gillian-Louise-Omotoso"
                }
            ]
        }
    ]
}