{
    "title": "Why didn't Rick Astley see much success other than with the song 'Never Gonna Give You Up'? - Quora",
    "tags": [
        "Rick Astley (musician)",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ken Eckert",
                "href": "/profile/Ken-Eckert"
            },
            "answer_text": "From what I can tell in interviews and other media, Astley seems like a nice guy, and is perfectly willing to laugh at his 80s dance-cheez debut album and to go along with the Rick-Roll meme. Apparently Astley had little creative control over his early songs, being very young, and tried to take a more adult-contemporary bluesy sound on his third album rather than making Still Never Gonna Give You Up ‘90. I think “Cry for Help” is an excellent song. But the album was otherwise unfortunately forgettable, and Astley wisely bowed out of the music industry, at least for a while. I’ve also read that his hip joints are no longer what they used to be in his dancin’ days.  ",
            "date": "Answered November 10, 2019",
            "views": "103",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Eric Oehler",
                "href": "/profile/Eric-Oehler"
            },
            "answer_text": "He had a few other top 10 singles, but mostly transitioned away from making pop music towards making “blue-eyed soul” music. He retired from the music industry for a while, mostly to spend time with his family. He came back and has released a few more albums in the past 20 years. He’s never enjoyed the pop dominance of the early days, but he still has a fairly large live draw and sells a respectable amount of albums. Unlike many of his contemporaries, he also apparently did not blow his pop millions in his early days, and despite not hitting the top of the charts for decades, he has an estimated net worth of about $16M. So it seems like he’s been pretty successful long-term. ",
            "date": "Answered November 8, 2019",
            "views": "222",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Charles P. Hobbs",
                    "user_href": "/profile/Charles-P-Hobbs"
                }
            ]
        }
    ]
}