{
    "title": "Why is Australia competing in Eurovision? - Quora",
    "tags": [
        "Eurovision Song Contest 2015",
        "Eurovision Song Contest",
        "Australia"
    ],
    "response": [
        {
            "author_info": {
                "name": "Harry Kriewaldt",
                "href": "/profile/Harry-Kriewaldt"
            },
            "answer_text": "I ask myself the same question every year. I get why we were invited the first time (a slight shortage of participants, an anniversary year and so on), but the fact that we keep turning up is a bit silly. Officially, it’s a combination of three things: We’re sufficiently a part of the EBU (who organise the Contest in the same way as the IOC does the Olympics) that we’re allowed in. Since we pay an entry fee and so on, all is well.It’s a tribute to the popularity of Eurovision here. That I can understand, although the popularity of American politics here doesn’t seem to have translated to our ability to vote there. Additionally, the Contest can be popular without our ability to influence the vote.It’s a “proving ground” for the oft-mooted Eurovision Asia. Officially, this is going to happen sometime in October this year, although the same has been suggested before. There’s also no guarantee of how long-lived such an alternative would be (Junior Eurovision seems to have stamina, Türkvizyon didn’t). Perhaps if the Asia one kicks off, we’ll stick to the local area and not try sending anyone to Jerusalem next year.",
            "date": "Answered May 12, 2018",
            "views": "503",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Nick Nicholas",
                    "user_href": "/profile/Nick-Nicholas-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Farnsworth",
                "href": "/profile/Richard-Farnsworth"
            },
            "answer_text": "We were invited back in after being initially invited as a special contestant in 2015. We were originally invited to help celebrate the 60th anniversary. Our Special Broadcasting Service (SBS) helps sponsor the event also. Tbe SBS is government run and caters to the immigrant population, of which a very large number originally came from European locations. I also suspect the SBS pays quite a lot for the privilege. It was WILDY popular back home. WE LOVE Eurovision, and I rather suspect that Eurovision sees Australia as being stragic in order to grow into a more universal “world” competition. We have been voting since 2010 (although our votes did not actually count until 2015) and we came 5th the first year we entered. Australia is not the only non European to have competed - Morocco (Africa) has also competed. Finally, Australians have competed in Eurovision for many years and have been part of other countries entries, either as members of a band or as writers. For example “The New seekers” (UK 1972) had two Aussies, The Shadows (UK 1975) had one Australian member and the song “This is our night” (Greece 2009) was written by two Aussies. Love it  ",
            "date": "Updated May 14, 2017",
            "views": "4",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Princess Starlight",
                    "user_href": "/profile/Princess-Starlight-1"
                },
                {
                    "user_id": "Carina Karlsson",
                    "user_href": "/profile/Carina-Karlsson"
                },
                {
                    "user_id": "Agata Gruse",
                    "user_href": "/profile/Agata-Gruse"
                },
                {
                    "user_id": "Hafizh Wahyu Kusuma",
                    "user_href": "/profile/Hafizh-Wahyu-Kusuma"
                },
                {
                    "user_id": "Amy Whittaker",
                    "user_href": "/profile/Amy-Whittaker-28"
                },
                {
                    "user_id": "Beth Storheim",
                    "user_href": "/profile/Beth-Storheim"
                },
                {
                    "user_id": "Nicholas Stone",
                    "user_href": "/profile/Nicholas-Stone-5"
                },
                {
                    "user_id": "Mark Gallagher",
                    "user_href": "/profile/Mark-Gallagher-28"
                },
                {
                    "user_id": "Anthony May",
                    "user_href": "/profile/Anthony-May-2"
                }
            ]
        }
    ]
}