{
    "title": "Why does Leonard Cohen’s estate not enforce the copyright on “Hallelujah” and stop the many ripoffs which change the lyrics? - Quora",
    "tags": [
        "Leonard Cohen",
        "Copyright Law",
        "Song Lyrics",
        "Songs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andy Hill",
                "href": "/profile/Andy-Hill-8"
            },
            "answer_text": "Travis Casey is right, in terms of the number of verses Leonard composed, the licensing, etc. But its possible that the question is referring to the versions of Hallelujah where the “co-author” (or “charlatan”, “opportunist”, etc) has invented verses out of whole cloth that do in fact alter Leonard’s intentions. I’m only familiar with one, which I accidentally suffered through a couple of years back, which was a fundamentalist religious rendering. The lyric removed every good thing from all 80 of Leonard’s verses and replaced them with high school claptrap. The effect was to remove the beauty and power of the innate ambiguity of the original song. In all of Leonard’s verses of the song that I know, the singer faces or has faced a moral, psychological or spiritual challenge which has left him depleted; and yet after it all, he finds himself inexplicably bowing to the universe and saying “hallelujah”. Without the ambiguity, you’ve got, well, just about everybody else’s writing. Still, having said that, when he was alive, I doubt that Leonard would have been all that offended. I think he had a generous heart and would have been happy that his song was giving joy to a group of people, even though they completely misunderstood the song (or understood it, and thought they could do better). His “estate” on the other hand, is a different thing. My guess is that there aren’t that many of the kind of rendering that I outlined above, and so the offending renderings either fly under the radar or may be serving to contribute to the massive overall popularity of the song, which would be good for the estate. I suppose it’s also good to recall that Leonard himself once suggested a moratorium on covering the song. Of course this was a joke. But it’s fun to unpack this kind of thing sometimes. Perhaps after performing and writing for 40 or 50 years, he wasn’t used having a Brown-eyed Girl sized song in his repertoire. I could imagine that a man of his talents while enjoying the economic fruits of such a labor, may simultaneously have felt that an individual song was overshadowing to some degree an astonishing cumulative body of work. ",
            "date": "Answered December 1, 2018",
            "views": "27",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Leahy",
                    "user_href": "/profile/Michael-Leahy-8"
                },
                {
                    "user_id": "Teva Devere",
                    "user_href": "/profile/Teva-Devere"
                }
            ]
        },
        {
            "author_info": {
                "name": "Travis Casey",
                "href": "/profile/Travis-Casey-4"
            },
            "answer_text": "Because there aren’t any “ripoffs which change the lyrics”. First, the people singing covers are licensing the song properly — they are not “ripping off” the estate. Second, Cohen himself performed the song with many different lyrics. He wrote “around 80 draft verses”, and used different ones in his live performances. He said that “many different hallelujahs exist”, and encouraged people covering it to pick out their favorite ones and use them. Indeed, when John Cale asked Cohen to send him the lyrics, Cohen faxed him 15 pages of lyrics, and told him to pick the verses he liked best. tl;dr: Because this is what Leonard Cohen wanted — for people singing the song to make it their own. ",
            "date": "Answered November 28, 2018",
            "views": "14",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stephanie Vardavas",
                    "user_href": "/profile/Stephanie-Vardavas"
                },
                {
                    "user_id": "Darren Shea",
                    "user_href": "/profile/Darren-Shea-1"
                },
                {
                    "user_id": "Kevin Fong",
                    "user_href": "/profile/Kevin-Fong-40"
                },
                {
                    "user_id": "Alex Johnston",
                    "user_href": "/profile/Alex-Johnston-39"
                },
                {
                    "user_id": "Lenny Rothbart",
                    "user_href": "/profile/Lenny-Rothbart"
                },
                {
                    "user_id": "Gala Christen",
                    "user_href": "/profile/Gala-Christen"
                },
                {
                    "user_id": "Bayden McKenzie",
                    "user_href": "/profile/Bayden-McKenzie"
                }
            ]
        }
    ]
}