{
    "title": "Why are film critics so important? - Quora",
    "tags": [
        "Critics",
        "Movie Critics and Criticism",
        "Movie Business and Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gary Susman",
                "href": "/profile/Gary-Susman-1"
            },
            "answer_text": "Glad you asked, since there are a lot of misconceptions about what a film critic does, even among some actual professional film critics. First, it’s important to distinguish between a critic and a reviewer. A reviewer is a consumer advocate who rates movies for moviegoers who haven’t seen them yet and offers an opinion as to whether the film will be worth their time and money. A critic is someone who analyzes a film for a moviegoers who have already seen it. His or her opinion isn’t meant to be the final word on a film’s worth, but rather a conversation-starter. So, similar but not identical. Even many critics and reviewers miss the distinction, in part because many of them have to do both jobs. It’s also confusing because there is no formal training or licensing required to become a film critic. Especially now, in the Internet era, anyone who wants to self-publish criticism is a critic. That doesn’t make them knowledgeable or qualified, and indeed, the cheapness and glut of opinions has devalued criticism so much that it barely exists as a profession anymore. Newspaper editors look at IMDb and Rotten Tomatoes and think criticism is something anyone can do, so they’ll hire people with no actual background in film scholarship (or even skilled writing) to do it. They wouldn’t try this on the politics beat or the sports page, but in the arts section, it’s apparently just fine to let it be amateur hour. Or worse, movie reviews are now so easy to come by that most papers have laid off their critics and replaced their reviews with syndicated copy or nothing at all. Never mind nuances of local taste or support of local independent theaters, what the Washington Post or Associated Press critic thinks about a movie should be all local readers need to know. The proliferation of criticism on the Internet has also led to a huge consumer backlash against critics. Why should anyone care what those snooty elitists think when we can just get the consensus from Rotten Tomatoes or from our friends? (Of course, the RT scores are averages weighing the opinions of those same snooty critics. And audience scores are highly unreliable because they’re subject to angry mobs (who may not have even seen the movie) review-bombing the system to further a political agenda or enforce tribal solidarity (Team Marvel vs Team DC, for instance). Ideally, however, a critic or reviewer is a professional who takes his or her responsibilities seriously. It’s someone who has a background in film scholarship, who is conversant with the history of film, including film outside of the US, who is capable of analyzing more than just plot and dialogue (but also such cinematic elements as editing, cinematography, sound design, and other subtleties), who has a well-thought out set of aesthetic standards, and who can marshal all of that into a well-written argument about whether a movie does or doesn’t work on its own terms and for its intended audience. Most important, a critic is someone whose sole allegiance is to the art of filmmaking and to those who support it by making great movies or by buying movie tickets. In other words, a critic or reviewer is an advocate for readers who are interested in film in general or specifically films they might go see this weekend. They do not represent the studio, the filmmaker, or even the newspaper/magazine/website they write for. They are not co-opted by the studio marketers (despite the studio’s best efforts to co-opt them); nor do they fear irking a studio that’s also an advertiser at the paper. And while they may have favorite filmmakers whose work they often champion, they’re not afraid to call ’em as they see ’em if a favored filmmaker’s newest work proves a disappointment. If the emperor no longer has any clothes on, it’s the critic’s duty to say so. The reviewer or critic is just there to draw attention to what he or she sees as the best in film and to warn viewers away from the worst. Touting a movie that’s poorly executed or not entertaining on its own terms, even if it’s well-meaning, doesn’t do any favors for the art of film or for readers who might go see something mediocre or awful based on the critic’s recommendation. The critic has to be honest, especially since moviegoers can count on no one else in the movie industry ecosystem to be honest or have their best interests at heart. ",
            "date": "Answered October 11, 2019",
            "views": "402",
            "upvotes": " Answer requested by Ranjith James"
        },
        {
            "author_info": {
                "name": "Michael Mandaville",
                "href": "/profile/Michael-Mandaville"
            },
            "answer_text": "Ahhhh, the world of critics. First let’s look up the definition of “Critic”: critic noun (1) crit·​ic | \\ ˈkri-tik \\ Definition of critic 1a: one who expresses a reasoned opinion on any matter especially involving a judgment of its value, truth, righteousness, beauty, or technique Critics of the new law say that it will not reduce crime. b: one who engages often professionally in the analysis, evaluation, or appreciation of works of art or artistic performancesa literary critica film critica theater critic 2: one given to harsh or captious judgment Second, when you read or take in the judgement of a critic, have you made a comparison between your initial impression of a film, for example, without a critics input - and then compared it to the critics opinion? I think that it’s essential to find the critic with which you agree. I am not saying that living in an echo chamber is a good thing. But in many cases, people do not compare their artistic, political or educational critics with their own values and interests. In the case of movies, I used to follow two critics who, in many cases, enjoyed and appreciated the movies that I would enjoy and appreciate. So when I read their reviews, then I would have a pretty good estimation of my future enjoyment of a film. Why the Critic Mattered: I would spend two hours and $10 of my hard earned money wisely and appreciate its spending on a film that I’d enjoy. Period. Three. In some cases, I would read critics that I would disagree with to hear a different - and probably opposing - point of view. This exercise enables one to flex the brain muscles about differing opinions and critical thinking. I read varying critical essays on film, politics, current geopolitical events and economics. These essays contribute to my ability for critical thinking, problem solving, empathy and more. In some cases, I will read an ‘opposition’ critic and realize that they make some good points. Maybe 20% from my standard opinion but worth considering. Four. Critics - the good ones at least - work within the context of the definition stated above. Ones that are highly knowledgeable about a subject like film, economics, etc., can often use important vernacular, concepts and insights. You learn their ‘language’ and manner of thinking on a subject. expresses a reasoned opinion on any matter especially involving a judgment of its value, truth, righteousness, beauty, or technique Reasoned and judgment are skills that can be cultivated for betterment, each and every day. A critic in the right field should have you improve your own understanding and the ability to convey intelligently a reasoned criticism about a specific subject. Conclusion: Critics can matter. But I think you have to ‘criticize’ the Critic - to find the one you like! ",
            "date": "Answered March 22, 2019",
            "views": "446",
            "upvotes": "0"
        }
    ]
}