{
    "title": "Why does my (singing) voice sound and feel so basic? I don’t feel like it’s that special. - Quora",
    "tags": [
        "Vocal Music",
        "Vocal Performance",
        "Singing Voice",
        "Voice",
        "Singing",
        "Sound",
        "Understanding Emotions",
        "Emotions",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Karen Boyd",
                "href": "/profile/Karen-Boyd-11"
            },
            "answer_text": "I am not sure what you mean by basic? There are many times when basic is better. If your pitch and tone are true, you can sing well with groups. It is important that you know how to open up and support your voice so that it is full and resonant. On the other hand, unless you are a soloist, you need to be careful of vibrato, and excessive styling. I have a sister that will almost never sing “basically”. I means that no one else can sing with her. There is a lot to be said for basic. ",
            "date": "Answered August 28, 2019",
            "views": "47",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                },
                {
                    "user_id": "Jason Gessele",
                    "user_href": "/profile/Jason-Gessele"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brittany Lankford",
                "href": "/profile/Brittany-Lankford"
            },
            "answer_text": "Possibly, you could work on increasing vibrato to add depth. You could also start practicing songs in alternative styles than what you are used to. Perhaps your voice would be perfect for opera, or perhaps for blues, or even for rock, and so on. Once you find the style(s) for you, you can really begin to grow your sounds to include more depth and tonality. Also be sure you’re using your diaphragm and not singing through your nose. One helpful tip is to have people you know who can be honest with you listen to your voice and give you their honest survey of your strengths and opportunities for improvement. It could even be anonymous if you’d prefer it that way. Another thing you can try is recording yourself and playing it back multiple times to get an accurate self-assessment. I also recommend researching “tonality of singing voice” to get an idea of how to change the timbre of your voice. ",
            "date": "Answered August 28, 2019",
            "views": "99",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                },
                {
                    "user_id": "Jason Gessele",
                    "user_href": "/profile/Jason-Gessele"
                }
            ]
        }
    ]
}