{
    "title": "Why do I think sleep paralysis is fun? - Quora",
    "tags": [
        "Sleep Paralysis",
        "Sleep Disorders",
        "Sleep"
    ],
    "response": [
        {
            "author_info": {
                "name": "Avinash Sahu",
                "href": "/profile/Avinash-Sahu-7"
            },
            "answer_text": "Yes it is. Whenever I had sleep paralysis, I just do one thing. Start taking deep breaths. As soon as my breath rate changes, I start to feel as if I am getting separated from my body. Then I can feel as if I am floating and then landing on far far away from my physical body. Then my environment starts becoming clear and I can recognize that this must be a Lucid Dream. Of course it is. I can control what’s happening inside. Sometimes partially and sometimes fully. Overall, I see sleep Paralysis as a gateway to lucid dreaming. Hence Sleep paralysis is fun for me. ",
            "date": "Answered November 9, 2017",
            "views": "17",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stephen Pyles",
                    "user_href": "/profile/Stephen-Pyles-M-D"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Rosie-694"
                },
                {
                    "user_id": "Anjali Raj",
                    "user_href": "/profile/Anjali-Raj-143"
                },
                {
                    "user_id": "Anam Ika",
                    "user_href": "/profile/Anam-Ika-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan McCann",
                "href": "/profile/Dan-McCann-2"
            },
            "answer_text": "Because it is! It’s the best springboard for projecting or lucid dreaming, bar none. Some people have a problem with it because it takes a little practice not to scare yourself, but that’s all that’s going on: you are simply scaring yourself. To get over it, one needs to manage their animal fear and get control of themselves. None of the frightening events they experience are actually happening, but they can be so scary, it’s tough to see that. Once you do, however, all kinds of interesting things can take place. ",
            "date": "Answered July 10, 2017",
            "views": "11",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Frank Coles",
                    "user_href": "/profile/Frank-Coles"
                },
                {
                    "user_id": "Stephen Pyles",
                    "user_href": "/profile/Stephen-Pyles-M-D"
                },
                {
                    "user_id": "Luna Siikavaara-Wester",
                    "user_href": "/profile/Luna-Siikavaara-Wester"
                }
            ]
        }
    ]
}