{
    "title": "Why is it I reach higher notes in head voice than falsetto? - Quora",
    "tags": [
        "Falsetto",
        "Singing Voice",
        "Voice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Timothy Christian Liu",
                "href": "/profile/Timothy-Christian-Liu-1"
            },
            "answer_text": "From what I was taught as a learning singer, that is because falsetto does not have the complete cord closure that the head voice provides. When you utilise your head voice to sing, your overall sound will certainly be thinner than your chest voice but it will still have the full cord closure that will aid you to maintain a connected tone and hence allow you to go higher. On the other hand, falsetto is rather weak and airy, and your vocal folds are only just merely touching each other right on their edges, hence letting a pretty decent amount of air to pass through instead of completely closing to give a rather more firm and decent compression - as a result, it becomes more difficult to sing much higher using this sound. The disconnected nature of the falsetto, however, does not mean that it is invalid artistically because many great singers from the likes of Jeff Buckley and Michael Jackson to Thom Yorke and Chris Martin have used it to amazing effect. If anything, knowing how to sing both in falsetto and head voice will allow more colors and textures that you can experiment with, making you a more versatile singer in the process. At the end of the day, singing is an art and no sound is to be dismissed. ",
            "date": "Answered August 16, 2017",
            "views": "11",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Timi Dare",
                    "user_href": "/profile/Timi-Dare"
                },
                {
                    "user_id": "Mouli Marur",
                    "user_href": "/profile/Mouli-Marur"
                },
                {
                    "user_id": "Gillian Louise Omotoso",
                    "user_href": "/profile/Gillian-Louise-Omotoso"
                },
                {
                    "user_id": "John Wicks",
                    "user_href": "/profile/John-Wicks-12"
                },
                {
                    "user_id": "Esmeralda Rokaj",
                    "user_href": "/profile/Esmeralda-Rokaj"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kegan DeBoheme",
                "href": "/profile/Kegan-DeBoheme"
            },
            "answer_text": "Cord Closure. Falsetto is an improper/lack of complete vocal fold closure, where head voice is a full closure of your cords, albeit with less vocal fold weight than chest, but full voice nonetheless. Falsetto can still be useful in a stylistic sense, but developing control and balance in your head register to achieve a similar sound as falsetto is possible, and likely the healthier option in the long run. The pressure required to sing your highest notes in head voice simply isn’t facilitated by falsetto as you need to full cord closure of chest/head to allow for compression (ie: air pressure) and hence, faster vibration of the cord. ",
            "date": "Answered October 10, 2018",
            "views": "351",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dee nice",
                    "user_href": "/profile/Dee-nice-65"
                },
                {
                    "user_id": "Timothy Christian Liu",
                    "user_href": "/profile/Timothy-Christian-Liu-1"
                },
                {
                    "user_id": "Dajour Thompson",
                    "user_href": "/profile/Dajour-Thompson-3"
                }
            ]
        }
    ]
}