{
    "title": "Why did Kurt Cobain hate Pearl Jam? - Quora",
    "tags": [
        "Grunge",
        "Pearl Jam (band)",
        "Kurt Cobain (musician)",
        "Nirvana (band)",
        "Rock Bands",
        "Rock Music",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Russell Spear",
                "href": "/profile/Russell-Spear"
            },
            "answer_text": "Kurt Cobain didn’t just hate Pearl Jam. Kurt was a man full of hatred, especially hatred for himself and his fans. Kurt Cobain could be a self-righteous, sanctimonious SOB and he demonstrated that when his hatred of Guns n’ Roses led him to announce to the public that people couldn’t like both Nirvana and Guns n’ Roses. Kurt said people had to make a choice: either Nirvana or Guns n’ Roses. Cobain wanted to the opposite of Pearl Jam and he called them “cock rock.” Kurt’s ideal - what he was striving for - apparently was “pussy rock.” As I said, Kurt hated his fans. Why? He hated them because it was because of them that he lost his privacy, it was because of his fans that he felt the pressure of being expected to live up to being “the voice of a generation.” That’s a lot for any man to live up to and for Kurt it was overwhelming. Kurt Cobain never wanted all that fame and attention and he hated his fans for making it so that he had all that fame, all that attention, and Kurt had low self-esteem. No heroin addict can possibly have good self-esteem. Kurt’s low self-esteem made him feel that it was impossible that he could ever live up to their expectations. There’s another part of it that bears mentioning: Kurt’s low self-esteem made him feel that he didn’t deserve all the fame, attention and the level of rock stardom that he had attained. I think he thought he was an OK musician, but he didn’t think he was nearly as great a musicians as he would have to be to be worthy of so much high praise. He had never progressed on the guitar to a level where he could feel good about being compared to the virtuosos of rock guitar. When scoring dope is of greater importance than putting forth the requisite effort required to develop the efficacy needed to become a virtuoso, then becoming a virtuoso never happens. ",
            "date": "Answered October 5, 2020",
            "views": "140",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Peter Bakis",
                    "user_href": "/profile/Peter-Bakis"
                },
                {
                    "user_id": "David Toomey",
                    "user_href": "/profile/David-Toomey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stanley R. Wigglesworth",
                "href": "/profile/Stanley-R-Wigglesworth"
            },
            "answer_text": "Here is the relevant quote from their unofficial official biographer Michael Azerrad: His favorite target is Pearl Jam, also from Seattle, which he accused of “corporate, alternative and cock-rock fusion” in a recent Musician magazine interview. “Every article I see written about them, they mention us, and they’re baiting that fact,” says Cobain, sitting up cross-legged on the bed. “I would love to be erased from my association with that band and other corporate bands like the Nymphs and a few other felons. I do feel a duty to warn the kids of false music that’s claiming to be underground or alternative. They’re jumping on the alternative bandwagon. To put this in context, indie music at that time wasn’t a musical genre — it literally meant independent marginal and marginalized music. So while the concept of “selling out” seems quaint today, it definitely was not, then, and Nirvana being on a major label in and of itself was a source of tension for Kurt, who obviously wanted the band’s music to reach as wide an audience as possible while at the same time maintaining some measure of artistic integrity. So to see his band being linked to Pearl Jam, which is at least stylistically an unchallenging, radio-friendly jock rock outfit, this is obviously going to get Kurt’s goat. To Eddie Vedder’s credit, he tried to use his position and popularity much like Kurt to draw attention to smaller “real indie” bands. By all accounts, they patched things up and Kurt eventually had nothing but good things to say about Vedder as a person. Here’s a pic of Vedder doing a small tribute to Kurt on SNL shortly after his death:  In this video, you can see Eddie express some of the same kind of sentiments and concerns as Kurt:  Not saying that Eddie himself hates Pearl Jam, but he’d likely encourage you to be a bit more adventuresome with your taste in music, as Kurt did. ",
            "date": "Answered October 1, 2020",
            "views": "322",
            "upvotes": " View 99 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tony Baron",
                    "user_href": "/profile/Tony-Baron-2"
                },
                {
                    "user_id": "Benjamin Collet",
                    "user_href": "/profile/Benjamin-Collet-1"
                },
                {
                    "user_id": "Sean Paul Y",
                    "user_href": "/profile/Sean-Paul-Y"
                },
                {
                    "user_id": "Aarlo Venetti",
                    "user_href": "/profile/Aarlo-Venetti"
                },
                {
                    "user_id": "Jackson C. Carpenter",
                    "user_href": "/profile/Jackson-C-Carpenter"
                },
                {
                    "user_id": "Tim Wood",
                    "user_href": "/profile/Tim-Wood-224"
                },
                {
                    "user_id": "Don Torrez",
                    "user_href": "/profile/Don-Torrez"
                },
                {
                    "user_id": "Glen Chen",
                    "user_href": "/profile/Glen-Chen"
                },
                {
                    "user_id": "Matthew Szlaga",
                    "user_href": "/profile/Matthew-Szlaga-2"
                },
                {
                    "user_id": "Jackula",
                    "user_href": "/profile/Jackula-1"
                }
            ]
        }
    ]
}