{
    "title": "Are magic and science related? - Quora",
    "tags": [
        "Magic (illusion)",
        "Magic (supernatural)"
    ],
    "response": [
        {
            "author_info": {
                "name": "John VanValkenburg",
                "href": "/profile/John-VanValkenburg"
            },
            "answer_text": "Kind of. Magic and science are both about controlling the world. Magic is more focused on controlling people and science is more about controlling things. Magic, at its most fundamental,  relies on convincing people that you have control over the world in a way that they don't. This could be an outright lie, a claim of controlling unseen forces, exploiting human fallibility and ego, or just knowing a bit more. The magician then exploits this perception that they have power, usually for money or status. Science is about reliably using things to achieve goals. Bang the right rocks together and you can reliably start fires. Machine and assemble the parts correctly and you can reliably create a flying machine. Using these techniques one can alter their surroundings to better suit themselves. There's some overlap. A magician might use science their audience isn't aware of, and a scientist can find semi-reliable ways to influence people to a desired end. Both are trying to control their surroundings for their own benefit. They're just coming at the problem from different angles. A real pro uses both. Consider the Pyramids. It took science to design  and engineer such massive constructions, and magic to convince people that building a huge rock pile in the desert for a dead guy was a good idea. ",
            "date": "Answered June 7, 2016",
            "views": "15",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nabil Chen",
                    "user_href": "/profile/Nabil-Chen"
                },
                {
                    "user_id": "Sunshine Hernandez",
                    "user_href": "/profile/Sunshine-Hernandez"
                },
                {
                    "user_id": "Mohammad Amaan",
                    "user_href": "/profile/Mohammad-Amaan-Àmäåñ-Sàïfū"
                },
                {
                    "user_id": "Mánuel Kiatoko",
                    "user_href": "/profile/Mánuel-Kiatoko"
                }
            ]
        },
        {
            "author_info": {
                "name": "Johanna MacLeod",
                "href": "/profile/Johanna-MacLeod"
            },
            "answer_text": "Yes. Magick is what we had before we knew to call it science. Magick is just science that is not yet understood. Let’s explore this idea. First, let’s Google the definition of the Scientific Method: “a method of procedure that has characterized natural science since the 17th century, consisting in systematic observation, measurement, and experiment, and the formulation, testing, and modification of hypotheses.” From my own mentors, I was guided to use a personal Book of Shadows. Every Wiccan keeps this journal which includes “a recipe book of how to do spells,” notes on the processes and what the results of spells cast, and more. So in essence, each Wiccan is a scientist about how he or she does magick. We are all finding our own techniques. What works for me may not work for another person. We are all individuals with our own energy signature. About your comment: “I once read (SPOILER ALERT) that Ruby Kane had once told either Sadie or Carter that “magic and science are two dialects of the same language”, what would be the implications if that were literally true?” My first thought about “if that were literally true” is that perhaps there might be some toning down of rhetoric from “the two sides.” It’s not really two sides. Each individual is finding his or her way. Similarly, we all use spoken language in different ways. Some use flowery language; others clip their words. The question is: “Did someone communicate something and did the other person understand?” For example, a scientist would ask: “Is this true?” Then she might set up a double-blind study. She’d have a nurse give out pills: some sugar pills and some a new form of medicine. The nurse would not know which pills were which. So she would be “blind” about the pills. On the other hand, a Wiccan, Sarah, goes to her mentor, who tells her that using a particular money spell will increase her prosperity. In essence, Sarah is trying to replicate the spell (or experiment) her mentor did. Replicating experiments is a vital part of the scientific method. In both the scientific experiment and Sarah’s money spell, both people seek results. Both people will note the results (Sarah will write in her Book of Shadows). Both a scientist and a Wiccan create experiments, note results and then do further testing. Blessed Be, Moonwater ",
            "date": "Answered June 9, 2016",
            "views": "17",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Praatibh Das",
                    "user_href": "/profile/Praatibh-Das"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nicholas Cooper",
                "href": "/profile/Nicholas-Cooper-8"
            },
            "answer_text": "In fact, this is an interesting question, because it touches on the evolution of language. At one time, there were influential people that would use principals that we would now call scientific in ways to manipulate the masses, especially in religious connotations. At that time, magic was considered a word that invoked the idea that someone with an extreme intelligence could manipulate the world around them (i.e. “magi”), providing no semantic difference to what we would call science. In that time, magic could be scientific, or it could be supernatural, as there was no distinction. Around the time of Salem, magic was entirely supernatural, and there was no distinction between good or bad, as all magic was of the devil. To some, science was not understood, and could be of the devil as well. The words meant two things to different types of people: to the uninformed, science could be a word to mean physical phenomena or spiritual phenomena, and magic was entirely spiritual (almost the converse of before). Eventually, in our modern world, we have separated the two concepts in such a way that one means supernatural phenomena, and the other means physical phenomena. However, you can still use the word magic for each. That being said, now that the definition is out of the way, are all supernatural phenomena actually misunderstood physical phenomena? Scientifically speaking, we have no reason to believe otherwise. However, there are many things that we know we don’t know. Occam’s Razor points us toward believing in a physicalist world, but that requires that we hold true to Occam’s Razor. In the end, even if there were things that are “supernatural” to us, one day, we may understand as well, which would re-categorize them. For instance, if we could one day download an app to let us see ghosts through our Google Glass, then it would become normal eventually, and not seem as “supernatural” as it does now. After all, these things must indeed have motives like we do, which can be explained. Edit: Add the following I suppose that we can now define “magic” as “that which we collectively do not yet have the ability to reliably observe, reproduce and or even ask the right questions for” ",
            "date": "Answered June 7, 2016",
            "views": "33",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Armando Irizarry",
                    "user_href": "/profile/Armando-Irizarry-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Cayuqui"
                },
                {
                    "user_id": "Taher Noor",
                    "user_href": "/profile/Taher-Noor"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tomas Murphy",
                "href": "/profile/Tomas-Murphy"
            },
            "answer_text": "\"Any sufficiently advanced technology is indistinguishable from magic\" However, I assume your meaning is different from that. As I am a hopeless idealist who believes magic exists, this is my take: There are certain fundamental rules that exist in the world (the laws of physics, for example). What we call magic and science are different ways of interacting with and understanding them. Magic observes, from outside of the rules. This allows for all the fantastical abilities magic can confer, such as generating enormous electrical charges or healing, but it is hard for \"magical\" people or entities to interact with the world (this is my explanation of ghosts and most supernatural phenomena - and why there are only tales of remarkably strong msgical entities - they are the ones capable of forcefully imposing themselves on this world).Science on the other hand gets its hands dirty, getting inside the machine as it were. We have created numerous amazing devices, and are making more every year. We have to work within the constraints of the laws of physics, but even the weakest of us have a vastly superior ability to affect the world.This world view of mine explains a lot for me, although I understand why people are sceptical. But really, Geran from Belgarath the Sorceror puts it best (slightly paraphrasing here):\"Theres the normal world, where most of us live and very little happens, and theres the world of the gods, where things of monumental importance happen. And thats why you exist - you exist in a middle world, to make sure that what is meant to happen in our world happens at the right time to help the people fighting for us in the world of the gods. Thats why you can do what you can do - to help them, and to protect us\"Although slightly exaggerated from my perspective, the few who were able to do miraculous things (Jesus, Buddha, Mohammed - looking at you) were able to because they had to ensure certain things happened in our world, and in order to protect us. Science can do a lot, but it can't work outside the laws of physics etc.Sorry, I started ramblimg a bit. ",
            "date": "Answered June 7, 2016",
            "views": "633",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Peter Prevos",
                "href": "/profile/Peter-Prevos-1"
            },
            "answer_text": "Magic and science have a double relationship. Magicians use the principles of science to create the illusion of magic and scientists research magic tricks to learn about our mind and many other topics. Magicians use optical illusions, psychology, linguistics, engineering and so on to create the illusion that real magic has occurred. Scientists from many disciples study magic. They want to know how our mind is so easily deceived, how magic tricks can be use to teach or help people heal from illness. The diagram below visualises the relationship between magic and science. The outer circle show the sciences that are involved with magic. Performers use some of these sciences as methods to create the illusion of magic. Scientists in most of these fields research magicians and their performances.  ",
            "date": "Answered December 23, 2018",
            "views": "298",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kitty Randall",
                "href": "/profile/Kitty-Randall"
            },
            "answer_text": "Good discussion from all the contributors. Magick (or some of it) may indeed result from natural processes or phenomena that are simply not explainable YET by science. And some magick is already explainable by science—albeit mostly the “soft” sciences, like psychology and sociology. The problem here is that many “reputable scientists” are not willing to even look at magick, far less study it rigorously. Another difficulty is that the fact of observation affects the outcome of an observed experiment, and that would certainly apply to magick. I know that if I were working a spell and being watched by a skeptic, that would affect my concentration! However, we have lovely fields like quantum mechanics now, and the border between “hard” science and magick becomes more diffuse every day. ",
            "date": "Answered June 10, 2016",
            "views": "717",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ayodele Somotun",
                    "user_href": "/profile/Ayodele-Somotun"
                }
            ]
        },
        {
            "author_info": {
                "name": "Allison McEnnis",
                "href": "/profile/TrumpTight"
            },
            "answer_text": "Yes. Magic is a science. It's the most intellectual and practical activity that needs constant study and experimentation. It utilizes the natural and physical world. It is the most mad science there is. I would say also that it's methodical, it's formulaic, it's specific. I think magic is even more than anything we know , because we are going beyond what is known. We are playing in the negative space and dark matter. We are taking everything that is known and experimenting in that energy that surrounds us all. ",
            "date": "Answered June 11, 2016",
            "views": "162",
            "upvotes": " Answer requested by Joshua Johnson",
            "upvoters": [
                {
                    "user_id": "Woody Thrower",
                    "user_href": "/profile/Woody-Thrower"
                }
            ]
        },
        {
            "author_info": {
                "name": "Craig Wilson",
                "href": "/profile/Craig-Wilson-42"
            },
            "answer_text": "Yes - but how they are related would depend on how you define your terms. Most of the time, most people using the word “magic” are referring either to (a) the supernatural, or to (b) deliberate misdirection for the purpose of making it appear that the supernatural is at work. In those two cases (which should be most cases), magic and science are related by being antonyms. They are polar opposites. ",
            "date": "Answered June 7, 2016",
            "views": "471",
            "upvotes": " Answer requested by Joshua Johnson"
        },
        {
            "author_info": {
                "name": "Ashima Uttham",
                "href": "/profile/Ashima-Uttham"
            },
            "answer_text": "No - in fact they are opposite. In that past, things that could not be explain was thought as “magic” or “magic from God”. Science comes along and verifies that it is from Physics or Nature, and can be described and measured. But, at end of day, science can feel so magical! ",
            "date": "Answered June 7, 2016",
            "views": "274",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "DV Harris",
                "href": "/profile/DV-Harris"
            },
            "answer_text": "Magicians throughout history have always been at the forefront of science, using new principles to improve old illusions or design new ones. A study of the history magic will show how ancient priests used principles of hydraulics to “magically” open & close temple doors (see Hero of Alexandra), or cause fountains to spew forth water, seemingly on command. So, from ancient times, magicians have used the newest and the best scientific principles to impress, motivate, entertain, or scare the populace. ",
            "date": "Answered June 7, 2016",
            "views": "341",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Pankit Chauhan",
                "href": "/profile/Pankit-Chauhan"
            },
            "answer_text": "Do you think magic has science? In short! Yes , they are. ",
            "date": "Answered April 18, 2017",
            "views": "272",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Thommy Saltzherr",
                "href": "/profile/Thommy-Saltzherr"
            },
            "answer_text": "Thanks for the A2A. I would personally say that it is true, there is only a destinct difference between both of them. Magic is unexplained while science explains the previously unexplained.Simply said, magic becomes science once the trick/secret behind it is known. ",
            "date": "Updated March 19, 2018",
            "views": "511",
            "upvotes": " Answer requested by Joshua Johnson"
        },
        {
            "author_info": {
                "name": "John Anderson",
                "href": "/profile/John-Anderson-209"
            },
            "answer_text": "Arthur C Clark is quoted as saying “Any sufficiently advanced technology is indistinguishable from magic” ",
            "date": "Answered June 7, 2016",
            "views": "53",
            "upvotes": " Answer requested by Joshua Johnson"
        }
    ]
}