{
    "title": "Are all stars made up of hydrogen and helium only? - Quora",
    "tags": [
        "Helium",
        "Physics and Chemistry",
        "Hydrogen",
        "Stars (astronomical objects)",
        "The Sun",
        "Cosmology",
        "Astrophysics",
        "Planetary Science",
        "Astronomy",
        "Chemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Utsav Malik",
                "href": "/profile/Utsav-Malik-2"
            },
            "answer_text": "No. The stars are what we call \"cosmic kitchen\" which cooks various elements and to specify them we classify them into various generation of stars  I. First Generation.  The first generation of stars as the name suggests are the first stars that were formed after big bag. During that phase, only hydrogen and helium were prominent in the universe so the first generation stars had only hydrogen and helium. Now as I said stars are cosmic kitchens,  via nuclear fusion, H is now He (Helium) ! Now comes the exciting part ! Supernova! BANG ! goes the star and all the elements cooked inside them are now spread out in the galactic area. II. Second Generation.   you see, the star is like a phoenix it rises from its ashes again. When the matter which was spewed out by GEN 1 stars, new stars are born with these materials. Now the NEW or 2nd gen stars have  H and He, eventually they run out of fuel, become a red giant and in that process H and He form Carbon and Oxygen.  Our sun is a second generation star.  III.Third Generation.After sweeping up C and O the stars have - Hydrogen- Helium - Carbon - Oxygen etc  remember cosmic kitchen ? yup, through fusion, given \"appropriate\" conditions even heavier elements like Silicon are forged in stars and later on in a supernova that Si is turned into Iron.  So all in all, Yes stars do contain H and He but no H and He aren't the only elements inside a star. ",
            "date": "Answered June 24, 2015",
            "views": "48",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Pegotty",
                    "user_href": "/profile/David-Pegotty"
                },
                {
                    "user_id": "Pavan Kumar",
                    "user_href": "/profile/Pavan-Kumar-2990"
                },
                {
                    "user_id": "Lauren Bradley",
                    "user_href": "/profile/Lauren-Bradley-27"
                },
                {
                    "user_id": "George Horn",
                    "user_href": "/profile/George-Horn"
                },
                {
                    "user_id": "Om Jangid",
                    "user_href": "/profile/Om-Jangid-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akash Aggarwal",
                "href": "/profile/Akash-Aggarwal-30"
            },
            "answer_text": "Each and every star contain hydrogen and helium only when they are in their infant stage.The amount of hydrogen a star start with determine its size. During whole of its lifetime a star experience two forces. Gravitational pull which is trying to pull it inwards and a force genrated by fusion of elements in its core which is trying to pull it outwards.  Intresting things happen when a star exhaust its hydrogen. The force due to fusion gets weaker and gravitational pull dominate over it. Thus shrinking the star in its size. In the last stages of its life a star do fusion reaction as much as it can to fight the force of gravity. It makes carbon,nitrogen and then iron. After iron fusion reaction stops and this results in the death of the star. A star as big as our sun can't make elements after iron. (Fun fact: 1 kg iron is sufficient to kill our poor sun if you are able to put it inside its core)However some stars bigger than our sun make rest of the elements of our periodic table in just last few seconds of their life. And after that they result in supernovae. Spreading all the elements in the universe. So ya the gold and diamond ring that you wear was once made in core of a star which was 1000 times bigger than our sun and who died fighting his own gravitational pull.",
            "date": "Answered June 30, 2015",
            "views": "14",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kyle Markestad",
                    "user_href": "/profile/Kyle-Markestad"
                },
                {
                    "user_id": "DuckYcity Momo",
                    "user_href": "/profile/DuckYcity-Momo"
                },
                {
                    "user_id": "Chris Neville",
                    "user_href": "/profile/Chris-Neville-8"
                },
                {
                    "user_id": "Dhruv Gupta",
                    "user_href": "/profile/Dhruv-Gupta-172"
                },
                {
                    "user_id": "Sonam Aggarwal",
                    "user_href": "/profile/Sonam-Aggarwal-11"
                },
                {
                    "user_id": "Amit Doshi",
                    "user_href": "/profile/Amit-2367"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sudarson Nantha",
                "href": "/profile/Sudarson-Nantha"
            },
            "answer_text": "No, they are not.In fact, every single element that you see in the world around you was formed in the core of a star! That's right, the carbon in your body, the iron in your haemoglobin, the silicon in your computer or mobile devide, they were all formed in the cores of stars. Once the hydrogen in the core of a star is nearly exhausted, almost all  naturally occurring elements heavier than helium are created by stellar nucleosynthesis during the star's lifetime and, for some stars, by supernova nucleosynthesis when it explodes. Other than the popular Hydrogen to Helium fusion, a number of reactions take place in stars. Examples of element making (nucleogenesis) reactions:  3 helium atoms fusing to give a carbon atom: 3 @ 4He → 12C  carbon atom + helium atom fusing to give an oxygen atom: 12C + 4He → 16O  oxygen atom + helium atom fusing to give a neon atom: 16O + 4He → 20Ne  neon atom + helium atom fusing to give a magnesium atom: 20Ne + 4He → 24Mg Source: http://sciencelearn.org.nz/Contexts/Just-Elemental/Science-Ideas-and-Concepts/How-elements-are-formed These reactions take place because the core is always under huge pressure and under high temperatures. The temperature in the core region of a star is several million kelvins. Like the above reactions, the elements keep fusing under these extreme conditions to form the 90 natural elements. This periodic table shows where and how these elements were formed.  ",
            "date": "Answered January 16, 2015",
            "views": "12",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dakota Glenn",
                    "user_href": "/profile/Dakota-Glenn-2"
                },
                {
                    "user_id": "XY XY",
                    "user_href": "/profile/XY-XY-25"
                },
                {
                    "user_id": "George Horn",
                    "user_href": "/profile/George-Horn"
                },
                {
                    "user_id": "Zaafal Chrungoo",
                    "user_href": "/profile/Zaafal-Chrungoo"
                },
                {
                    "user_id": "Bharath Srinivas",
                    "user_href": "/profile/Bharath-Srinivas-8"
                },
                {
                    "user_id": "Candeniz Önkol",
                    "user_href": "/profile/Candeniz-Önkol"
                },
                {
                    "user_id": "Tirthankar Goswami",
                    "user_href": "/profile/Tirthankar-Goswami"
                },
                {
                    "user_id": "Ashmita Roy",
                    "user_href": "/profile/Ashmita-Roy-1"
                },
                {
                    "user_id": "Nikhil Prabhu",
                    "user_href": "/profile/Nikhil-Prabhu-1"
                },
                {
                    "user_id": "Jeet Sah",
                    "user_href": "/profile/Jeet-Sah-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhimanyu Susobhanan",
                "href": "/profile/Abhimanyu-Susobhanan"
            },
            "answer_text": "Sudarson Nantha covers most of the points; but I want to add one more. There are no stars which are made of solely H and He. However, the abundance of heavier elements varies greatly. Especially, older stars have much less abundance of heavier elements (called metallicity) than younger ones. This is because when the older stars formed, there was less time for heavier elements to have formed by nucleosynthesis. As the universe ages, the amount of heavier elements in the interstellar medium increases; causing the newer stars to have more metallicity. Existence of stars with almost no metallicity (i.e., they are the earliest stars - also known as Population-III stars) has been hypothesized; but none have been found so far. ",
            "date": "Answered March 6, 2015",
            "views": "16",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ashmita Roy",
                    "user_href": "/profile/Ashmita-Roy-1"
                },
                {
                    "user_id": "Mrinal Saurabh",
                    "user_href": "/profile/Mrinal-Saurabh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shubham Mishra",
                "href": "/profile/Shubham-Mishra-52"
            },
            "answer_text": "well during the early age of star they are only made up of  H&He but as the the hydrogen start getting exhausted then with different combination of  helium and hydrogen during fusion process higher elements start taking birth and this keep on happening till IRON is made .no fusion of iron because it is the most stable element,then by the process called          \"NEUTRON CAPTURE\" other higher ELEMENTS are made in the biggest kitchen of the universe called COSMIC KITCHEN ",
            "date": "Answered June 29, 2015",
            "views": "737",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Emma-1450"
                },
                {
                    "user_id": "Frank Dauenhauer",
                    "user_href": "/profile/Frank-Dauenhauer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ujan Chakraborty",
                "href": "/profile/Ujan-Chakraborty"
            },
            "answer_text": "No. Hydrogen and helium are the primary fuels. As they burn up, various possibilities are there for a star's life. In one particular case (by far the best concerned with this question), the atoms fuse to form heavier atoms like carbon, releasing energy. This will continue as long as fusion releases energy. And how long is that? For that, you need to study the thermodynamics, or rather, energetics, of nuclear processes. Look up the binding energy per nucleon versus atomic number curve. You will see that it peaks at Iron: Iron has more binding energy per nucleon than any other element. So, if fusion occurs after iron, it will absorb energy, rather than release energy. So, elements may fuse up to iron, but fusion of iron to form heavier elements cannot occur inside the star's core to fuel it. When the star explodes in a supernova, a huge amount of energy is released at once. Then, a part of this amount of energy may be absorbed by iron to form more energetic and less stable (nuclear point of view) heavier elements. This is the history of formation of all naturally found elements, in our universe. ",
            "date": "Answered June 26, 2015",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bob Duncanson",
                    "user_href": "/profile/Bob-Duncanson"
                },
                {
                    "user_id": "Pranshu Mittal",
                    "user_href": "/profile/Pranshu-Mittal-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akshay Singh Jamwal",
                "href": "/profile/Akshay-Singh-Jamwal"
            },
            "answer_text": "No, although those are by far the most common. Depending on the mass of the star, nuclear reactions continue to form carbon and, in turn, iron.  It should be noted that carbon stars have been observed while iron stars are hypothetical. Moreover, nuclear reactions within hydrogen and helium stars also create other elements, although these are negligible in comparison. ",
            "date": "Answered January 16, 2015",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ujan Chakraborty",
                    "user_href": "/profile/Ujan-Chakraborty"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tirthankar Goswami",
                "href": "/profile/Tirthankar-Goswami"
            },
            "answer_text": "Yes, but there are also many other elements in stars. All stars begin their life fusing hydrogen into helium. But later on, depending on their mass, they start fusing helium into heavier elements. The most massive stars, and the supernovae that follow their death, create all elements that exist in the universe, including the elements in your own body. ! ",
            "date": "Answered July 1, 2015",
            "views": "146",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Parth Sarthi Sharma",
                "href": "/profile/Parth-Sarthi-Sharma-3"
            },
            "answer_text": "In the beginning of life of a star the star is entirely made up of Hydrogen. But as Hydrogen gains energy(kinetic), it fuses together to make Helium.Now, the Helium also combines to form other elements like Lithium, Carbon,  Magnesium and so on, but once it reaches the Iron stage, it begins to die(as iron is most stable in nucleons vs binding energy graph). ",
            "date": "Answered June 26, 2015",
            "views": "441",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ankit Balodi",
                    "user_href": "/profile/Ankit-Balodi-1"
                },
                {
                    "user_id": "Ujan Chakraborty",
                    "user_href": "/profile/Ujan-Chakraborty"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vishva Doshi",
                "href": "/profile/Vishva-Doshi"
            },
            "answer_text": "No there are other elements too. Once hydrogen and helium are consumed,  further fusion takes place to produce carbon oxygen etc it all stops when iron is formed because iron nucleus is most stable in terms of binding energy. Further fusion would make unstable nucleus and it is not spontaneous. ",
            "date": "Answered June 26, 2015",
            "views": "331",
            "upvotes": "0"
        }
    ]
}