{
    "title": "Are there any real life incidences of time travel? - Quora",
    "tags": [
        "Physics of Time Travel",
        "Time Travel",
        "Time (physics)",
        "Existence Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Harshit Dayal",
                "href": "/profile/Harshit-Dayal"
            },
            "answer_text": "Modern man at 1941 bridge opening A photograph from 1941 of genuine authenticity of the re-opening of the South Fork Bridge in Gold Bridge, British Columbia, was alleged to show a time traveler. It was claimed that his clothing and sunglasses were modern and not of the styles worn in Their Past Lives Here, produced and hosted through investment by the Virtual Museum of Canada. Further research suggests that the modern appearance of the man may not have been so modern. The style of sunglasses first appeared in the 1920s. On first glance the man is taken by many to be wearing a modern printed T-shirt, but on closer inspection it seems to be a sweater with a sewn-on emblem, the kind of clothing often worn by sports teams of the period. The shirt is very similar to the one that was used by the Montreal Maroons, an ice hockey team from that era. The remainder of his clothing would appear to have been available at the time, though his clothes are far more casual than those worn by the other individuals in the photograph. Man met the older himself and recorded itA video uploaded in 2006 shows a Swedish man named Håkan Nordkvist claiming that he had been accidentally transported to 2046 when attempting to fix the sink in his kitchen. There in the future he immediately met who revealed and proved to be himself about 70 years old, and with whom he \"had a great time\". He filmed a short footage of the two smiling and hugging each other and showing the tattoo they had in their right arm. The story was reportedly a marketing campaign promoting the pension plans of the insurance company AMF.  VonHelton Known simply as VonHelton, this enigmatic figure suggests he might be part vampire, but asserts he is 100% time traveler. He has provided proof of his time travel prowess by lining up side-by-side photographs of himself starting in a studio in 1857 England, with stops in 1916 France, 1945 Berlin, and ending in the modern day in front of an American flag. Is he, in fact, a time traveler? Or is his \"vampire gene\" keeping him immortal? Andrew Carlssin He traveled here from the year 2256 and then quickly amassed a fortune on Wall Street. Unfortunately, he was caught and arrested for suspected insider trading. As reported, Carlssin started with an initial investment of $800 and ended with over $350,000,000, which drew the attention of the SEC. Maybe this means that the theory of time travel that supports the idea that you CAN change time, is the right one. John Titor - A time traveller from 2036 (born in 2011)Between 2000 and 2001, an online bulletin board user self-identified as John Titor became popular as he claimed to be a time traveler from 2036 in a military mission. Holding the many-worlds interpretation as correct and consequently every time travel paradox as impossible, he stated that many events which occurred up to his time would indeed occur in this timeline. These included a devastating civil war in the US in 2008 followed by a short nuclear World War III in 2015. In the years following his last posts and disappearance in 2001, the non-fulfilment of his specific predictions made his popularity decrease. Criticism has pointed out flaws in Titor's stories and investigations suggested his character may be a hoax and a creation of two siblings from Florida. To date, the story has been retold on numerous web sites, in a book, in the Japanese visual novel/anime Steins;Gate, and in a play. He may also have been discussed occasionally on the radio show Coast to Coast AM.[3] In this respect, the Titor story may be unique in terms of broad appeal from an originally limited medium, an Internet discussion board. Charlie Chaplin Time Traveler A woman filmed outside the 1928 premiere of Charlie Chaplin's The Circus has convinced many people that time travel is real. The unidentified woman holds her hand up to her ear and talks to somebody, although no one is near her. But wait there were no cell phones in 1928! Could this woman be a time traveler communicating with her contemporaries via mobile phone? Strange.. ",
            "date": "Answered January 2, 2017",
            "views": "136",
            "upvotes": " View 30 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dan Broski",
                    "user_href": "/profile/Dan-Broski-2"
                },
                {
                    "user_id": "Thorsten Kettner",
                    "user_href": "/profile/Thorsten-Kettner"
                },
                {
                    "user_id": "Jennifer Johnson",
                    "user_href": "/profile/Jennifer-Johnson-761"
                },
                {
                    "user_id": "Marcus Titus Aurelius",
                    "user_href": "/profile/Marcus-Titus-Aurelius"
                },
                {
                    "user_id": "Dwayne Vera",
                    "user_href": "/profile/Dwayne-Vera"
                },
                {
                    "user_id": "Nyky Jones",
                    "user_href": "/profile/Nyky-Jones"
                },
                {
                    "user_id": "Mario Micklisch",
                    "user_href": "/profile/Mario-Micklisch-1"
                },
                {
                    "user_id": "Lincoln Varga",
                    "user_href": "/profile/Lincoln-Varga"
                },
                {
                    "user_id": "Goot Noffobe",
                    "user_href": "/profile/Goot-Noffobe"
                },
                {
                    "user_id": "Callum Davies",
                    "user_href": "/profile/Callum-Davies-3"
                },
                {
                    "user_id": "Ames",
                    "user_href": "/profile/Ames-27"
                },
                {
                    "user_id": "Manisha Choudhary",
                    "user_href": "/profile/Manisha-Choudhary-95"
                },
                {
                    "user_id": "Verrah Ochieng",
                    "user_href": "/profile/Verrah-Ochieng"
                },
                {
                    "user_id": "Khaleel Jones",
                    "user_href": "/profile/Khaleel-Jones-6"
                },
                {
                    "user_id": "Tin Tin",
                    "user_href": "/profile/Tin-Tin-692"
                },
                {
                    "user_id": "Ayush",
                    "user_href": "/profile/Ayush-959"
                },
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "Andrea Porter",
                    "user_href": "/profile/Andrea-Porter-84"
                },
                {
                    "user_id": "Bhakti Patanker",
                    "user_href": "/profile/Bhakti-Patanker"
                },
                {
                    "user_id": "Akshat Yadav",
                    "user_href": "/profile/Akshat-Yadav-8"
                },
                {
                    "user_id": "Divyanshu Raj",
                    "user_href": "/profile/Divyanshu-Raj-3"
                },
                {
                    "user_id": "Bhawna Negi",
                    "user_href": "/profile/Bhawna-Negi"
                },
                {
                    "user_id": "Swathi Bhat",
                    "user_href": "/profile/Swathi-Bhat-57"
                },
                {
                    "user_id": "Prashant Sajwan",
                    "user_href": "/profile/Prashant-Sajwan-1"
                },
                {
                    "user_id": "Nico Chae",
                    "user_href": "/profile/Nico-Chae"
                },
                {
                    "user_id": "Tuan Anh Nguyen",
                    "user_href": "/profile/Tuan-Anh-Nguyen"
                },
                {
                    "user_id": "Nagendra",
                    "user_href": "/profile/Nagendra-90"
                },
                {
                    "user_id": "Tanya Dayal",
                    "user_href": "/profile/Tanya-Dayal-2"
                },
                {
                    "user_id": "Ekta",
                    "user_href": "/profile/Ekta-155"
                },
                {
                    "user_id": "Tanya Sinha",
                    "user_href": "/profile/Tanya-Sinha-61"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathan Coppedge",
                "href": "/profile/Nathan-Coppedge"
            },
            "answer_text": "The order has now been modified with better recollection… For the now-electronically-available methods of magical time-travel, see: Principal Method of Time Travel: 84 Related Methods by Nathan Coppedge APPENDIX II, from a book I've written accounting of my time travel experiences, but mostly including a variety of techniques --- one section has 21 to 84 methods by itself, depending on how you look at it, they are related in sets of four. But that's a different section. This is just the appendix II (link to the book below). Dates I've Traveled To: (Sorted appropriately by earliness of the date traveled to, and secondly, order of time-travel events). #5: The Cape Scott Case [12/2005 2nd timeline] - Date of Cape Scott photo (1917?) -Observations: On this date I was visited by Jesus playing the role of a movie producer. I was briefly on the set of some kind of movie. I was asked if I wanted a particular costume, and gave details. Jesus then instructed me to hold onto a particular decorated stick for as long as I could. When I let go, the light became more intense, and I found myself in the awkward position of leaning onto somebody’s lap. I turned around briefly, and saw it was a man with old-fashioned whiskers. I then knew I had traveled significantly far back in time. I looked around, and to my pleasure I saw that everyone in the scene was wearing old-fashioned clothes. We were on a hill. And then, I noticed that my physical features had been somewhat distorted from time-travel. My arms and hands were somewhat more gangly and monstrous-looking, and I could feel my face was not exactly the saeme. In my mind, Jessus asked me if I wanted to stay for the photo-shoot, and I said that I did. The camera flashed, and then I found myself once again in the year 2005. General Importance / Ticket: This scene was evidently arranged by Jesus to provide evidence of time-travelers. #7: The Car: [2013?] - 1972 - Observations: Clothes were faded colors. People were more introverted. People seemed to know that I had time-traveled. Dialogue: Excuse me, I don’t mean to be rude. What year is this? 1972. Impressed? You know he was high! You stumpin’? You jiven’? General Importance / Ticket: ‘Let me out of here’ / Mental thought: I know the word aesthosphere. This is one of the few occasions so far where I successfully traveled quickly into the future afterwards, with the help of a friend who may have been a Djinn (I wished to time travel on this occasion, after I helped my friend get married to her fiancee). #2: The Airplane: Sept 2007 - July 1990 (?) - Dialogue: What year is it? 1990. Holy fuck! What month is it? August! I -- I -- I can’t say what I mean. I really thought it was September, I mean July. My younger brother looked a lot younger than me in this scene---like he used to look back when we were visiting my Dad in Washington, D.C. (In this same scene I witnessed someone fall out of the airlock of the plane without a parachute! I felt guilty because I thought it was because of the chaos of the time-stream). Brian said: “Who is this old guy? who turned my brother into this old guy?” General Importance / Ticket: In both locations I was on an airplane. Apparently, I rode the waves of entropy to seek a nearly identical plane with nearly identical passengers, and then used the shockwave from arriving to boomerang myself immediately back to where I had been. I hadn’t thought of this immediately, but I may have traveled forwards more years than the difference on the way back out. The name of the game was entropy. #4: My Mother: May 25th 2009(?) -12/28/2005 - Dialogue: What year is it? 2005. What month is it? December. Oh well, I guess I time-traveled. Can I open Christmas presents? You already did! And you got a car! Just kidding. But what year is it really? It’s 2005! General Importance / Ticket: A poem, The ripples in the temporal pool / That mean at first / And then forget to mean / Then learn at last to lie or play the fool, combined with invention of perpetual motion at an earlier endpoint and later return point (e.g. by repeating the event, although officially the repeated event had already happened). This time-travel event caused me to repeat many of the same activities, although with greater confidence. #1: My Own Trickery: Oct. 30, 2006 - Oct. 29, 2006 - Observations: On this occasion I believed in inventing perpetual motion. This provided a possible economic motive for the powers that be to lose me from the current dimension of reality. Since it was such a short distance people doubted that I had time-traveled, but were more likely to believe I was doing something illegal. General Importance / Ticket: Invention of a powerful over-unity device. This event became the focal point for future time-travel occasions, which covered more ground from a later position. #3: The Actor: August 5th, 2009 - July 31st, 2009 - Observations: Seemed to occur through someone else’s decision. General celebration and turmoil due to an actor visiting town caused me to be ‘lost in the cracks.’ I had already returned once by this point. General Importance / Ticket: Importance of perpetual motion for government. I conscientiously used perpetual motion as a safeguard against loss of immortality, which caused me to gain almost a week’s time at my own expense. Time travel was made easier because a famous actor was visiting the city, causing chaos. #6: Unknown Date, perhaps 2009 - Feb 6, 2015 and returned. Observations: The trip was an encounter with the avatar of Jesus (who didn’t look exactly like Jesus, I thought). The trip was mysterious, as all I did was see more advanced cellphones, and bang with my hand on an aluminum chimney that was supposed to be on the roof of a building I would later live in. The time travel event was later identified as having occurred within the Feb 6th, 2016 framework of the future, as proven by hearing the same noise from inside the apartment. The avatar’s authenticity seems to be proven by his providing knowledge that I would open a fan cover and rotate the fan counter-clockwise (which I did on that same day), and by his providing me with a differently-gendered avatar or vessel to inhabit during my original trip. This was my only major future travel, other than normal forward-directedness. General Importance / Ticket: A magical avatar assisted me. ----The Dimensional Time Travel Toolkit by Nathan Coppedge: The Dimensional Time Travel Toolkit (The Dimensional Encyclopedia Book 15) 1st, Nathan Coppedge - Amazon.com In general the events point towards the importance of a divine Logos concept, semantics, political influence, and a scarce but possible magic power. See also: EVIDENCE: Till now, what evidence points towards a possibility of someone having time travelled? ",
            "date": "Updated May 29, 2018",
            "views": "66",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Joe Sutherland",
                    "user_href": "/profile/Joe-Sutherland-22"
                },
                {
                    "user_id": "Edward Wingate",
                    "user_href": "/profile/Edward-Wingate"
                },
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "Robert Fiveson",
                    "user_href": "/profile/Robert-Fiveson"
                },
                {
                    "user_id": "John Harris Abraham",
                    "user_href": "/profile/John-Harris-Abraham"
                },
                {
                    "user_id": "Jason De Donno",
                    "user_href": "/profile/Jason-De-Donno"
                },
                {
                    "user_id": "Aniruddha",
                    "user_href": "/profile/Aniruddha-78"
                },
                {
                    "user_id": "Ivan I. Kurdov",
                    "user_href": "/profile/Ivan-I-Kurdov"
                },
                {
                    "user_id": "Charley Moss",
                    "user_href": "/profile/Charley-Moss"
                },
                {
                    "user_id": "San Goshi",
                    "user_href": "/profile/San-Goshi"
                },
                {
                    "user_id": "Rishabh Rathore",
                    "user_href": "/profile/Rishabh-Rathore-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dinesh Budha",
                "href": "/profile/Dinesh-Budha"
            },
            "answer_text": "Yes, there are some stories related to time travelling. Here, I am going to represent some of the real life time travelling incidents .. Pilot Sees a Futuristic Plane This incident was happened when Air Marshal Sir Victor Goddar was sent to inspect an abandoned airfield. When he reached there in very strange condition he saw that the previous abandoned field was now bustling with the mechanics in blue jumpsuits. He saw four planes in Turmac, one of them was of kind he had never seen before. At that time he was pretty familier with all the plane models available at that time. He was shocked at that time and totally confused what was happening with him . But Four years later he was sent back to the airfield. This time he saw that abandoned airfield was full in use, completed with blue jumpsuited mechanics and yellow planes. And sitting on a runway same plane as he saw before and couldn't identify in 1934: a Miles Magister. The Miles Magister was first manufactured in 1937, three years after Goddard first saw it. It is believed in that may be Goddard travelled 3 years in future at that time. Journalist Experiences Air raid 11 years Before it Occurs Journalist J.Bernard Hutton and photographer Joachim Brandt were sent to do story on Hamburg Shipyard in 1932. When they reached there, they realized that they were caught in the middle of air raid. They saw that there was bombing, chaos, gunfire, burning smoke every where. They also snapped some photographs of there. After sometime they saw that everything was normal there, no destruction, no chaos and even no smoke. When they went back to their working place place, they tried to explain everything happened there but no one believed. They even tried to prove themselves by showing the photographs of war zones but everything was normal in the photograph also. But eleven years later, Hutton was really shocked that he read a story about Operation Gomorrah, an air raid on Hamburg in the newspaper. The accompanying photos looked exactly what they had experienced in 1932. Charlotte Warburton Travelled Through Time Without Even Realizing It In 1968, Charlotte Warburton entered a cafe she had never been before. After few days when she tried to go back there, it had vanished. She later knew that, in fact, in that spot, there used to be coffee shop many years ago. It had been repalcd by a supermarket long before that Charlotte claims to have walked in visited it. The man from Taured 1954, a man was stopped by custom officer on Haneda Airport of Tokyo, Japan because he was carrying a passport with stamp of a country that didn't exist. The country's name was Taured, he claimed that the country was in between Spain and France. According to him the country was existed at least 1,000 years where Andorra existed. He also said that he had never heard the name of Andorra. He was given a hotel room and outside his room armed guard were posted. By next morning the man was vanished magically and the passport which was kept on sacurity locker of airport was also gone. Officials never figured out the mystery of man from Taured. Man Who Travelled Back To Time to Become a Wall Street Scam On 28 january, 2003 a man named Andrew Carlssin was arrested for insider trading at the Wall Street. He had made $350 million from the $800 in just two weeks which is nearly impossible. The police arrested him on suspect that he must have had illegal inside information. Later he claimed that he was from the year 2256. Since he was from future he knew exactly how stocks were going to performs. After the bail the man was disappeared from the face of earth and after so many repeated attempts the man couldn't be found. Carlssin predicted the exact date of invasion of US of Iraq. Time Traveller Caught on Camera ? This photo is from the year of 1940s in Gold Bridge, B.C, Canada at the reopening of South Folk Bridge. There were certain crowd at the event. But, in this photo someone doesn't belong.  Isn't that strange ? In a perfectly ordinary gathering he is totally different. He is looking modern at all, fancy goggle, branded T- shirt, coat. Is he from the future at that time ?? The Man Who Met Himself  Unrealistic thing happen with 36 years old Hakan Nordkvist on the 30 August, 2006 while he was passing through tunel of his home to fix some kitchen problems. At the end of the tunnel he realized that he had landed up in future , 2043 in fact because he met himself there, an old man Hakan Nordkvist 72-years-old-self. They even had the same tatto, of course the future guy tatto had little more faded. They even took a selfie together . NOTE : There are many evidences like that in the world, logically they may be time traveller but practically it is not possible now, May be in future it will also be possible coz we know that nothing is impossible. FootnotesTime TravelThe Little Giant Book of Eerie Thrills and Unspeakable ChillsTime slips from KentMan without a Country: Who Was The Mystery Man from Taured?Time Traveler Meets His Future Self and Comes Back with Evidence Caught on Camera!?",
            "date": "Updated March 15, 2018",
            "views": "416",
            "upvotes": " View 154 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Fred Hamilton",
                    "user_href": "/profile/Fred-Hamilton-2"
                },
                {
                    "user_id": "Ashu Bansal",
                    "user_href": "/profile/Ashu-Bansal-8"
                },
                {
                    "user_id": "Mohit Mahawar",
                    "user_href": "/profile/Mohit-Mahawar-27"
                },
                {
                    "user_id": "Kshitiz Tiwari",
                    "user_href": "/profile/Kshitiz-Tiwari-33"
                },
                {
                    "user_id": "Abhishek Awana",
                    "user_href": "/profile/Abhishek-Awana-3"
                },
                {
                    "user_id": "Toon Mania",
                    "user_href": "/profile/Toon-Mania-2"
                },
                {
                    "user_id": "Jennifer Johnson",
                    "user_href": "/profile/Jennifer-Johnson-761"
                },
                {
                    "user_id": "Ashi",
                    "user_href": "/profile/Ashi-83"
                },
                {
                    "user_id": "Hirensinh Parmar",
                    "user_href": "/profile/Hirensinh-Parmar-1"
                },
                {
                    "user_id": "Gautam Kelkar",
                    "user_href": "/profile/Gautam-Kelkar"
                },
                {
                    "user_id": "Lincoln Varga",
                    "user_href": "/profile/Lincoln-Varga"
                },
                {
                    "user_id": "Ames",
                    "user_href": "/profile/Ames-27"
                },
                {
                    "user_id": "Iswarya",
                    "user_href": "/profile/Iswarya-32"
                },
                {
                    "user_id": "Dominick Cicala",
                    "user_href": "/profile/Dominick-Cicala"
                },
                {
                    "user_id": "Khaleel Jones",
                    "user_href": "/profile/Khaleel-Jones-6"
                },
                {
                    "user_id": "Nick Bonino",
                    "user_href": "/profile/Nick-Bonino-1"
                },
                {
                    "user_id": "Karen Marie Mykstu",
                    "user_href": "/profile/Karen-Marie-Mykstu"
                },
                {
                    "user_id": "Tin Tin",
                    "user_href": "/profile/Tin-Tin-692"
                },
                {
                    "user_id": "Ayush",
                    "user_href": "/profile/Ayush-959"
                },
                {
                    "user_id": "Kishore Kumar M",
                    "user_href": "/profile/Kishore-Kumar-M-11"
                },
                {
                    "user_id": "Vaishnavi Hambir",
                    "user_href": "/profile/Vaishnavi-Hambir-1"
                },
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "Ram",
                    "user_href": "/profile/Ram-2104"
                },
                {
                    "user_id": "Mages Waren",
                    "user_href": "/profile/Mages-Waren-1"
                },
                {
                    "user_id": "David Berger",
                    "user_href": "/profile/David-Berger-64"
                },
                {
                    "user_id": "Bhakti Patanker",
                    "user_href": "/profile/Bhakti-Patanker"
                },
                {
                    "user_id": "Matt Coe",
                    "user_href": "/profile/Matt-Coe-9"
                },
                {
                    "user_id": "Alexander Gonzalez",
                    "user_href": "/profile/Alexander-Gonzalez-261"
                },
                {
                    "user_id": "Mia Crites",
                    "user_href": "/profile/Mia-Crites"
                },
                {
                    "user_id": "Abhisek Senapati",
                    "user_href": "/profile/Abhisek-Senapati-1"
                },
                {
                    "user_id": "Priyanshu Bhattacharya",
                    "user_href": "/profile/Priyanshu-Bhattacharya-3"
                },
                {
                    "user_id": "Derek Mason",
                    "user_href": "/profile/Derek-Mason"
                },
                {
                    "user_id": "Monica Kumar",
                    "user_href": "/profile/Monica-Kumar-6"
                },
                {
                    "user_id": "Madan Mohan",
                    "user_href": "/profile/Madan-Mohan-850"
                },
                {
                    "user_id": "Marc Foster",
                    "user_href": "/profile/Marc-Foster-23"
                },
                {
                    "user_id": "Ashutosh Prusty",
                    "user_href": "/profile/Ashutosh-Prusty"
                },
                {
                    "user_id": "Klaus Smith",
                    "user_href": "/profile/Klaus-Smith-6"
                },
                {
                    "user_id": "Mansi Unhelkar",
                    "user_href": "/profile/Mansi-Unhelkar"
                },
                {
                    "user_id": "Udai Lal",
                    "user_href": "/profile/Udai-Lal-8"
                },
                {
                    "user_id": "Ahmet Caliskan",
                    "user_href": "/profile/Ahmet-Caliskan-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marshall Barnes",
                "href": "/profile/Marshall-Barnes-2"
            },
            "answer_text": "The videos that people see on Youtube are all featuring people using devices that today many people are unaware existed and are confusing them with what we have today. On the other hand, time travel is possible and being developed right now. I’m not talking about from anything Einstein came up with, as he didn’t like the idea of time travel and none of the ideas about time travel, stemming from his work, are even practical. Most would require you to have a space program in order to take advantage of the theories. That’s no solution! Everyone who has looked at time travel and was serious, knows that the answers lie in quantum mechanics and information theory. Anyone mentioning Einstein is just advertising that they are hopelessly outdated. John Archibald Wheeler is the main name to know, among others. For critical information on these new developments, read the links below: Why Those 2 Silicon Valley Billionaires Are Wasting Their Time & Money https://www.academia.edu/34658442/CHANGING_WORLDS_LIKE_TV_CHANNELS_Experimental_Proof_of_Parallel_Universes_in_the_60th_Year_of_The_Everett_Wheeler_Hypothesis_Contains_Copyrighted_Material Tim Folger Discovers A Time Machine Before I conclude, I want to address a statement made in another answer - “In all time travel theories allowed by real science, there is no way a traveler can go back in time to before the time machine was built. “This is an example of an amateur who doesn’t know the subject, talking as if he knows what he’s saying when he doesn’t. First of all, this “real science” that he’s talking about is not actually science at all but an unproved idea called a closed timelike curve which no one knows for certain even is possible. It is this geometrical “graph” that cowardly physicists call a “time machine”, when it isn’t. A real time machine is a technology, not a natural occurrence. So, so far, there’s nothing “real” in that statement. Furthermore, the reason that it’s said that you can’t go back in time before the machine existed is that the machine, in this case, is the effect of going back in time - so again, it’s not a machine at all. This is why it has taken so long to make any progress in time travel research because the mainstream science community first threatened physicists that wanted to look into it, and then forced them use and rely on theories that were unsuitable. So you have people thinking that they know what they’re talking about because they read it in some pop sci magazine and it’s all a bunch of crap. End of story… ",
            "date": "Answered September 27, 2017",
            "views": "33",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "Thomas Mulread",
                    "user_href": "/profile/Thomas-Mulread"
                },
                {
                    "user_id": "Wanyoike Evans",
                    "user_href": "/profile/Wanyoike-Evans"
                },
                {
                    "user_id": "Ray Silverio",
                    "user_href": "/profile/Ray-Silverio-1"
                },
                {
                    "user_id": "Rohan Kasliwal",
                    "user_href": "/profile/Rohan-Kasliwal-1"
                },
                {
                    "user_id": "Angele Roy",
                    "user_href": "/profile/Angele-Roy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shubham Bahl",
                "href": "/profile/Shubham-Bahl-4"
            },
            "answer_text": "Sir Victor Goddard Will you believe if I say that you can fly into parallel universe? That must be sounding like a fantasy , but it actually happened. While flying over airbase , he found airbase to be in bad condition. Later on, while flying his biplane, he got into trouble due to harsh weather conditions. To avoid an accident, Sir Goddard decided to fly back to the airbase till the weather cleared out a bit. He spotted mechanics wearing blue overalls working on the yellow planes parked on the runway. The planes were different from the ones in use by the air force back then. Air Force painted all their planes in silver which was different from the previous color , that was yellow. Totally baffled by what was going on, he got the shock of his life four years after. Europe was war torn and he happened to visit Drem again. But this time, he saw everything he saw four years back in 1935. He saw same people in blue overalls servicing yellow planes. 2. The man who met himself  On the 30th of August in 2006, 36-year-old Håkan Nordkvist came back home to find his kitchen flooded with water. He thought of it as a small damage and thought of repairing it own. But when he went inside cabinet , he observed that it continued and he kept crawling. At end of cabinet , he realised that he landed into future. Not only that, he even met his future version and took picture with his future version. They even had the same tattoo. 3. The time travelling hipster  Look at the above photograph carefully. Did you find anything strange with it? The above photo was found on the “Virtual Museum of Canada website” and dates the way back to 1941. This picture is known to be the reopening of the South Fork Bridge in the early 40s in Gold Bridge, B.C, Canada. While it is just another photograph, one cannot help but notice this gentleman in hipster clothes. He doesn't really look like a 'part of the crew' here, does he? Could he have been travelling back in time? 4. The man from Taured This is one of my favourite and curious incidents of time travel. So when at airport police asked his reason for entering county? He replied that he was visiting Japan because of business trip but the movement they checked his passport , his passport showed county “TAURED” which surprised police as there was no country named “TAURED”.  They checked his papers which were completely genuine. He was asked to point out his country on map , in respond to which he pointed finger on “ANDORRA” after that he told officers that map is wrong and instead of “ANDORRA” the name of country should be “TAURED\". He was then asked to stay in hotel and when police opened door of room the man was not found there. Strange thing is that he was staying at flat which was located at top roof and it was having no windows which he could have used to run. So question remains that who was he and how he escaped from room ?  -Namaste from Batman ",
            "date": "Updated July 15, 2018",
            "views": "53",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kshitiz Tiwari",
                    "user_href": "/profile/Kshitiz-Tiwari-33"
                },
                {
                    "user_id": "Ames",
                    "user_href": "/profile/Ames-27"
                },
                {
                    "user_id": "Kartik Kumar",
                    "user_href": "/profile/Kartik-Kumar-107"
                },
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "Udai Lal",
                    "user_href": "/profile/Udai-Lal-8"
                },
                {
                    "user_id": "Harshit Mathur",
                    "user_href": "/profile/Harshit-Mathur-16"
                },
                {
                    "user_id": "Ejaz Nisar",
                    "user_href": "/profile/Ejaz-Nisar"
                },
                {
                    "user_id": "Tejendra Singh",
                    "user_href": "/profile/Tejendra-Singh-10"
                },
                {
                    "user_id": "Jack Sparrow",
                    "user_href": "/profile/Jack-Sparrow-2512"
                },
                {
                    "user_id": "Parag",
                    "user_href": "/profile/Parag-113"
                },
                {
                    "user_id": "Swap",
                    "user_href": "/profile/Swap-34"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nicholas Lee",
                "href": "/profile/Nicholas-Lee-140"
            },
            "answer_text": "There is a video of a modern watch found in an ancient tomb, but could be fake. If you have a time machine, you need to be able to lock up the time period you left from causality effects, effecting it. Imagine if the time machine you had could move things from the past, from the future. Move a quark out of place in an atom in a grain of sand, on a beach 1000 years ago. Something as little as this, is enough to change the whole history of the earth from that point on.  If you watch videos on the grandfather paradox it is a misconception that you can have enough time to stand in front of him to pull the trigger, let alone have a conversation with him.  You cannot go back in time and get the winning lottery numbers, you cannot kill Hitler, stop Pearl Harbor attack, you cannot save JFK, or stop September 11th. You can only change these things if the time machine can lock up causality effects (keep the time period you came from from causality effects effecting it) But the changes would never count in reality you came from, just the other dimension you went back into, and messed around in. If a machine can do something as amazing as recreate the past, then locking up causality should be no problem for the time machine to do. Maybe people from the future go into the past in the technique I described above, or have the technology to view the past from the future on a television monitor, without causing any causality effects. These are the only two ways I can think of that do not effect causality. In another causality experiment I thought if its the interactions with people, and other things which cause causality, then what if you went back in time into a solid thick steel container, that was buried ten miles deep down in the in moons crust, it would be one mile thick in every direction up, down, left, right, forwards, and backwards. So if you go back in time into the container on the moon, it should not create any causality effects, because you do not interact with anything. The ripple effects of causality have been subdued. There would be dampening systems in the container to stop your vibrations, but it may not be enough, and not work at all. Just interacting with the air molecules could be enough to cause causality, even the space in the container. Dark matter, and energy is still not understood, and time travel into the past into the steel container could have an effect on the way dark matter, and dark energy effect other objects, to maybe cause causality.  Unless the aliens have a time machine, but they are not going to share, because we are about money, greed, exciting our excitatory neurotransmitters, and power, and cannot be trusted, even if we can understand the time machine technology they created, if explained to us by them. Aliens explaining how their time machine works to us, It might be like explaining calculus to a ape. Maybe we are just not smart enough to understand it. The most visited place by a time traveler if possible, would be the bookstore depository where Lee Harvey Oswald shot JFK, or the Dinosaur period.   Maybe there is some clues around there of future time travelers, especially in the Zapruder film of JFK being assassinated.  Look at Ronald Mallet's time machine on YouTube, but it can only send information back to the point when it was switched on. There is also this YouTube video below, of Stephen Hawking explaining how to a black hole can be used to time travel into the future, by orbiting the black hole. Hope this helps.  ",
            "date": "Answered August 31, 2016",
            "views": "34",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Conor Sexton",
                    "user_href": "/profile/Conor-Sexton-5"
                },
                {
                    "user_id": "Joe Sutherland",
                    "user_href": "/profile/Joe-Sutherland-22"
                },
                {
                    "user_id": "Parendra Reang",
                    "user_href": "/profile/Parendra-Reang-2"
                },
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "Keval Sanchde",
                    "user_href": "/profile/Keval-Sanchde"
                },
                {
                    "user_id": "Shyamakshi Ghosh",
                    "user_href": "/profile/Shyamakshi-Ghosh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deroan Binder",
                "href": "/profile/Deroan-Binder"
            },
            "answer_text": "Yes. If you have flown on an airplane, driven in a car, walked or have been standing still, you travel forwards in time. Imagine you have two clocks, and you can (somehow) accelerate one clock to 0.99c. Its currently 4pm. You want to accelerate one clock to Jupiter and back at 0.99c (Assuming Jupiter is at its point in its orbit where it is one light-hour away). You send the clock off on its way. After an hour, the clock reaches Jupiter, turns around, and heads back. When it arrives back at Earth, the clock you accelerated to Jupiter will still say its 4pm, but the other clock will say its 6pm, because two hours have passed for you, the observer, on Earth. But for the clock that has accelerated at 0.99c to Jupiter, only nanoseconds have passed. If you were to accelerate the clock to alpha centauri, 4.3 years would have passed in an instant for the clock. TL;DR The faster a clock goes, the slower it ticks for an observer. Of course, since we cant accelerate something to close to the speed of light, these changes in time are very, very small. But you can still detect these changes by using very precise clocks. These atomic clocks work by measuring how many times an atom (Usually Caesium-133) “wiggles” around. These clocks have an uncertainty of one second in 30 million years, and it can measure time down to the nanosecond. So if you were to have two atomic clocks, and you leave one at home and fly in an airplane with another, you will find out that the clocks have different times. This experiment is called the Hafele-Keating experiment, and it was done in 1971 with commercial airliners flying eastwards and westwards. The clock that traveled eastwards was 40 nanoseconds slower, while the clock that traveled westwards was 275 nanoseconds faster. The ISS travels 0.007 seconds in time every 6 months. An object with any mass bends spacetime around it. That means that if you were to orbit a massive star, you can travel several seconds or minutes forwards in time. The best object to do this with is with a black hole. If you have two clocks, and you were to throw one into the black hole, you will notice that the clock will appear to be ticking slower and slower, before it stops and slowly fades away. This concept of time travel is incredibly useful for calibrating clocks on GPS and Geostationary Satellites - working on a satellite project is the only career where you have to work with special and general relativity at the same time. ",
            "date": "Answered December 1, 2017",
            "views": "54",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Goldstein",
                    "user_href": "/profile/Michael-Goldstein-49"
                },
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "Ankit Anand",
                    "user_href": "/profile/Ankit-Anand-530"
                },
                {
                    "user_id": "Payal Patel (ಪಾಯಲ್ પટેલ)",
                    "user_href": "/profile/Payal-Patel-ಪಾಯಲ್-પટેલ"
                },
                {
                    "user_id": "Shweta Ojha",
                    "user_href": "/profile/Shweta-Ojha-28"
                },
                {
                    "user_id": "Rasheed Sk",
                    "user_href": "/profile/Rasheed-Sk-8"
                },
                {
                    "user_id": "Jules No",
                    "user_href": "/profile/Jules-No"
                },
                {
                    "user_id": "Evgeny Stolyarov",
                    "user_href": "/profile/Evgeny-Stolyarov"
                },
                {
                    "user_id": "Ihor Staruch",
                    "user_href": "/profile/Ihor-Staruch"
                },
                {
                    "user_id": "Emi Buliga",
                    "user_href": "/profile/Emi-Buliga"
                },
                {
                    "user_id": "Joshua Fong",
                    "user_href": "/profile/Joshua-Fong-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akshay Prabhakar",
                "href": "/profile/Akshay-Prabhakar-5"
            },
            "answer_text": "Some authors and historians claim that the Nazis have made a time machine named \"Die Glocke\" or \"The Repulsin\" at the end of the world war II. At that time the Allies had invaded Berlin so the scientists who were behind this invention, flew in it and it just disappeared!    The place where it is meant to be placed, in Poland. 2o years later... Kecksburg, Pennsylvania, the date is Dec. 9, 1965: Residents see a ball of fire shooting through the darkening evening sky and then, seemingly, the object ? purportedly shaped like a jumbo-sized acorn after impact ? makes some sort of controlled crash into the woods. From there, the strangeness factor escalates with purported military personnel isolating the area from curious onlookers and toting something out of the locale on a flatbed truck.That was a  metallic, bell-shaped instrument that stood nearly 15 feet tall and 10 feet wide with odd markings along the lower rim. Within was a strange substance known as \"Xerum 525\" that glowed strangely violet when excited and gave off strong levels of radiation. Many of the scientists working on the project died either from radiation sickness or at the hands of SS officers bent of maintaining the projects secrecy.  Some believe, the intense radiation was capable of manipulating time-space for the purposes of time/space travel or to produce anti-gravitational fields. So, that was the Nazi Bell or Die Glocke which crashed in Pennsylvania, USA.The US military officials took it under control and the mystery continues....  ",
            "date": "Answered December 29, 2015",
            "views": "36",
            "upvotes": " View 23 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tin Tin",
                    "user_href": "/profile/Tin-Tin-692"
                },
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "David Berger",
                    "user_href": "/profile/David-Berger-64"
                },
                {
                    "user_id": "Mark Elvidge",
                    "user_href": "/profile/Mark-Elvidge-4"
                },
                {
                    "user_id": "ALL ROUNDER",
                    "user_href": "/profile/ALL-ROUNDER-347"
                },
                {
                    "user_id": "Pål Erland Langsholt",
                    "user_href": "/profile/Pål-Erland-Langsholt"
                },
                {
                    "user_id": "Sonia Tomar",
                    "user_href": "/profile/Sonia-Tomar-10"
                },
                {
                    "user_id": "Karansingh Gill",
                    "user_href": "/profile/Karansingh-Gill-1"
                },
                {
                    "user_id": "James Brown",
                    "user_href": "/profile/James-Brown-2391"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Ivoraymond-M-Series"
                },
                {
                    "user_id": "Mark Ofir",
                    "user_href": "/profile/Mark-Ofir"
                },
                {
                    "user_id": "Divyanshu Raj",
                    "user_href": "/profile/Divyanshu-Raj-3"
                },
                {
                    "user_id": "Marco Barbini",
                    "user_href": "/profile/Marco-Barbini"
                },
                {
                    "user_id": "Hannah Abigail",
                    "user_href": "/profile/Hannah-Abigail-5"
                },
                {
                    "user_id": "Abhishek Bhattacharjee",
                    "user_href": "/profile/Abhishek-Bhattacharjee-13"
                },
                {
                    "user_id": "Sai Meghana",
                    "user_href": "/profile/Sai-Meghana-7"
                },
                {
                    "user_id": "Jeremy Robards",
                    "user_href": "/profile/Jeremy-Robards"
                },
                {
                    "user_id": "Sarthak Walecha",
                    "user_href": "/profile/Sarthak-Walecha"
                },
                {
                    "user_id": "Ishan Singh",
                    "user_href": "/profile/Ishan-Singh-20"
                },
                {
                    "user_id": "Ronnie Grondin",
                    "user_href": "/profile/Ronnie-Grondin"
                },
                {
                    "user_id": "Akash Prabhakar",
                    "user_href": "/profile/Akash-Prabhakar-3"
                },
                {
                    "user_id": "Vikas Patil",
                    "user_href": "/profile/Vikas-Patil-55"
                },
                {
                    "user_id": "NagenDra Babu",
                    "user_href": "/profile/NagenDra-Babu-24"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vivekananda Samantaray",
                "href": "/profile/Vivekananda-Samantaray"
            },
            "answer_text": " The photo was discovered in Lester Ray Peterson’s 1974 book ‘The Great Cape Scott Story’ – a tale of the Canadian region’s history. What has fascinated those who came across this photo is how out of place the ‘surfer man’, as some have called him, appears to be. He is wearing a very baggy t-shirt and shorts, sporting a modern windswept haircut and is clearly at odds with everyone else around him. Looking closer at the people around, the man to his left appears to be utterly stunned by his presence. Further to the right a woman also appears to be pointing her hand at the supposed time traveller, leading many to speculate the man was out of place and out of his time. In fact, it almost looks as though he jumped right into the scene as the photo was taken. Considering that other guys in the picture are also wearing shorts, I'm going to say that he's not a time traveler. “Other than Bill and Ted, what time travellers would think that a t-shirt and shorts would be the best thing to wear when time-traveling into the past anyway?” In either scenario, physicists all agree that it is impossible to travel back in time by our current understanding of the universe and its laws. According to Professor William Hiscock, of Montana State University, we can move forward due to the the time-dilation effect of Special Relativity. Moving backwards however is a dead end. ",
            "date": "Updated December 22, 2018",
            "views": "13",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Fred Wick",
                    "user_href": "/profile/Fred-Wick-1"
                },
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Marsden",
                "href": "/profile/Matthew-Marsden"
            },
            "answer_text": "Is time-travel possible ?(M.Marsden auth ‘abh Timelessness’) This question gets asked a lot on QUORA, so here is my general response. If you would like some specific details please ask a more detailed question – you may find the attached video addresses a lot of time, and relativistic ‘time travel’ issues, in a hopefully more scientific way than most.   Firstly, please note you may get a few answers repeating that Einstein’s Relativity in some way proves time, and suggest time ( as opposed to just space , an rates of change) can be manipulated.  But if you ask for the specific part of Relativity that they think proves time, you will almost certainly find that they have not carefully read “On The Electrodynamics of Moving Bodies” themselves, and cannot show that from the outset the paper does anything other than just ‘assuming’ time.,  (see...   ∆ Relativity - The Electrodynamics of Moving Bodies paper. - A Brief History of Time-lessness - Matt Welcome.) ‘Time-Travel’In my carefully researched opinion, time travel is completely moot, because we have no valid reason, or proof of, the existence of a thing called time.  For there to be any chance of time-travel, e.g. from or to “the future”, you would first need some reason to suspect that a thing or place called “the future” existed, and also some experiment, as per the scientific method, to support your hypothesis. Professor Hawking’s idea of arranging a time travellers party, to see if people might attened ‘from the future’, is rather unscientific because it is pointless expecting people to come from somewhere,(‘the future’) if you have not even established that that place exists. A Simple experiment. Wherever you are, sit and look around you, and ask yourself... “do I see any evidence at all of a ‘future’ ‘arriving’ “? To clarify this question for yourself place any object on a surface and push left to right wit your finger, and look very closely at the object, and ask yourself... “Do I see any evidence at all, whatsoever, that this object is in some way ‘heading into’ a ‘future’ as it moves”? “Do I see any evidence at ll that a ‘future’ is ‘arriving’ as this object moves”? “Do I see any evidence at all, that as this object moves, it in any way at all leave a ’temporal past’ behind it”? “as the object moves, am I actually seeing a ‘temporal past’, affecting a ‘temporal future’ in an infinitely thin ‘present’ “? ... or are you just seeing your finger to the left of the object, pushing it to the right, where your finger touches it? Instead of asking does time exist, or is time travel possible, it may be worth first asking  “If everything in the universe JUST exists, moves, and interacts in all directions, would that be enough to mislead me into assuming there is also a ‘past’, and/ or ‘future”? If you consider the above question carefully you may find what it suggests very interesting, and you may also realise that no other writer on ‘time’ seems to have thought of, let alone considered and been able to disprove the possibility it suggests. So, for the reasons above, and those in the more technical and detailed video below, I would say sadly time travel is entirely moot. yours Matthew Marsden (Auth \"A Brief History of Timelessness\")A Brief History of Time-lessnessA Brief History of Timelessness: Why it's always now, everywhere.A Brief History of Time-lessness (r2): \"Does Time exist?\", \"What is Time?\",\"Is Time-Travel possible?\"   Considering 'time travel'Time Travel,Timeless Answers to Prof Cox's Science of Dr Who:   ",
            "date": "Answered February 7, 2015",
            "views": "63",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "Kendi Ngcobo",
                    "user_href": "/profile/Kendi-Ngcobo"
                },
                {
                    "user_id": "Dinesh Gaud",
                    "user_href": "/profile/Dinesh-Gaud"
                },
                {
                    "user_id": "Stephen M Greenfield",
                    "user_href": "/profile/Stephen-M-Greenfield"
                },
                {
                    "user_id": "Nick Valdez",
                    "user_href": "/profile/Nick-Valdez"
                },
                {
                    "user_id": "Avinash Kumar Mamidi",
                    "user_href": "/profile/Avinash-Kumar-Mamidi"
                },
                {
                    "user_id": "Josh Beam",
                    "user_href": "/profile/Josh-Beam-1"
                },
                {
                    "user_id": "Fenan Mulu",
                    "user_href": "/profile/Fenan-Mulu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nikita Chawla",
                "href": "/profile/Nikita-Chawla-2"
            },
            "answer_text": "Till my sister told me about this incident, I myself was not very convinced of the concept of Time Travel. The Ghost Train Caught in a Time Loop | The Ancient Ones This is one of the most interesting cases like the ones with MH370.  A small excerpt from the above mentioned link: On June 14th, 1911, Italian railway company, “Zanetti” organized an advertising campaign to demonstrate a new type of excursion train. They set up a free trial ride for representatives of the community who were rich and high on the social ladder. One afternoon, a three-car composition with 100 passengers and a crew of 6 left the train station in Rome. The passengers were to see all the local sights. The super long (for its time) 1 meter (3 feet) wide tunnel, carved in the mountains of Lombard, was of particular interest. While waiting to reach the tunnel, passengers were having the time of their life, drinking champagne and sharing gossip… Just before reaching the tunnel the train slowed down and a gust of black smoke went up in the air. The train went into the tunnel and was forever lost…………. Follow the above link for more… http://ancients-bg.com/the-ghost-train-caught-in-a-time-loop/ Video : https://www.google.co.in/url?sa=t&rct=j&q=&esrc=s&source=video&cd=5&cad=rja&uact=8&ved=0ahUKEwjEtqnY94XVAhWIv48KHXNLAVwQtwIIMjAE&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3Dqn6Anx4o83I&usg=AFQjCNFXwI8gQ7FpNFON1C3fzWBBWUoD-Q ",
            "date": "Answered July 13, 2017",
            "views": "51",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Fred Wick",
                    "user_href": "/profile/Fred-Wick-1"
                },
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "Will Grainger",
                    "user_href": "/profile/Will-Grainger-1"
                },
                {
                    "user_id": "Divyanshu Raj",
                    "user_href": "/profile/Divyanshu-Raj-3"
                },
                {
                    "user_id": "Prasanth Venkata",
                    "user_href": "/profile/Prasanth-Venkata-1"
                },
                {
                    "user_id": "Aakash Rohila",
                    "user_href": "/profile/Aakash-Rohila"
                },
                {
                    "user_id": "Pratibha Bhalla",
                    "user_href": "/profile/Pratibha-Bhalla"
                },
                {
                    "user_id": "Anusha Kashyap",
                    "user_href": "/profile/Anusha-Kashyap-1"
                },
                {
                    "user_id": "Vivek Sharma",
                    "user_href": "/profile/Vivek-Sharma-521"
                },
                {
                    "user_id": "Ravi Ujjwal",
                    "user_href": "/profile/Ravi-Ujjwal-2"
                },
                {
                    "user_id": "Sahil Grover",
                    "user_href": "/profile/Sahil-Grover-68"
                },
                {
                    "user_id": "Pratham Hullamballi",
                    "user_href": "/profile/Pratham-Hullamballi"
                },
                {
                    "user_id": "Kartik Lokhande",
                    "user_href": "/profile/Kartik-Lokhande"
                },
                {
                    "user_id": "Saurabh Biyani",
                    "user_href": "/profile/Saurabh-Biyani-4"
                },
                {
                    "user_id": "Vikas Chauhan",
                    "user_href": "/profile/Vikas-Chauhan-47"
                },
                {
                    "user_id": "Ashok Joshi",
                    "user_href": "/profile/Ashok-Joshi-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carol Linn Miller",
                "href": "/profile/Carol-Linn-Miller"
            },
            "answer_text": "No, there isn't, especially when evidence is removed and no one knows where it went and the people who might know how  the evidence  was removed  and who  and why someone removed the evidence are still personally loyal and  silent almost 40 years later.. Where is JFK's  brain, and what happened while  the body  was in transit from love field at Dallas to Dulles AFB in  while Johnson was being sworn in as President on Air Force 1.  Medical technology  in 1963 could NOT have revived JFK. I've wondered about this for almost  52 YEARS and counting. What would YOU accept as evidence of time travelling individuals from the future? Many people deny  physical evidence ALL THE TIME. Even people who have precognitive dreams and flashes that do com tree  YEARS , even DECADES later  cannot explain HOW they do WHAT they do, and that includes  scientists who have had several precognitive  dreams and flashes . what usually happens is we get insulted and harassed and tole we are mentally unstable,  mentally ill,  delusional , out of touch with reality  and we should take our meds. I DO take my meds. I would DIE if didn't take my meds. ",
            "date": "Answered October 31, 2015",
            "views": "24",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhishek Tiwari",
                "href": "/profile/Abhishek-Tiwari-270"
            },
            "answer_text": "Um, Only one evidence till now. Okay I lied. Still there is One hypothesis which has the highest possibility among all the theories to come true. The Higgs singlet is related to another hypothesised particle called the Higgs boson, dubbed \"God's particle\" because it is associated with giving other particles mass, which the 27-kilometre long atom smasher may produce. If the Higgs boson is created, the Higgs singlet may also appear, scientists say. The theory hinges on a subatomic particle called the Higgs singlet, a particle related to the Higgs boson. The catch is it is not yet clear if the Higgs singlet, or even the Higgs Boson, exist at all. Assuming they do, MSNBC reports that time travel for the Higgs singlet would work something like this: [The Higgs singlet] may have a unique ability to jump out of the normal three dimensions of space and one dimension of time that we inhabit, and into a hidden dimension theorized to exist by some advanced physics models. By traveling through the hidden dimension, Higgs singlets could re-enter our dimensions at a point forward or backward in time from when they exited. Of course, sending a single particle backwards or forward in time is far different than hopping in your flying time-DeLorean and zipping off to the 1950s. But scientists believe that Higgs singlets could be used to send messages backwards or forward in time, thanks to the particle's theorized properties. Vanderbilt physicist Tom Weiler says that this limited time travel is the theory's greatest strength, since it avoids paradoxes and does not violate the current understanding of physics. I'm certainly no expert on deep physics, but even Weiler describes the theory as \"a long shot.\" Only time will tell with this theory, and others, as the LHC continues to enlighten and befuddle us as we try to understand the universe we live in. (MSNBC via Engadget) Sources [1] Time travel, God's particle and Higgs singlet: how messages might be sent to the past or future [2] The Mary Sue ",
            "date": "Updated April 11, 2020",
            "views": "37",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shobha Gupta",
                    "user_href": "/profile/शोभा-गुप्ता-Shobha-Gupta"
                },
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Morgan",
                "href": "/profile/Robert-Morgan-46"
            },
            "answer_text": "My answer is not so very wacky.  First, we are all travelling in time - forward - but at the same speed.  So, in effect, time travel exists.  But of course, you mean travelling into the past or into the future faster than each of us is doing at the same time. A few points of concern.  Many argue that there can not be any time travel into the past  because we have not seen evidence of time travellers in our own present.  However, it is possible that we simply have not collectively gotten to that point in the future when we develop time travel. Hence, to me at least, it is possible, even likely, that we may develop some form of time travel into the past.  How that will play out given the logical paradoxes remains to be seen.  In general, nature resolves paradoxes.  It seems to me that time travel into the future is unlikely as the future simply doesn't exist yet.  Hence, we can't go there. We are entering the future together, slowly, minute by minute, and at the same speed. By the way, I sell time machines in SecondLife and Tangle Grid. Of course, you can do in virtual reality that which is not possible in real life (NPIRL). ",
            "date": "Answered July 14, 2014",
            "views": "3",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "Jeremy Robards",
                    "user_href": "/profile/Jeremy-Robards"
                },
                {
                    "user_id": "Olivier Oli",
                    "user_href": "/profile/Olivier-Oli"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jose Maldonado",
                "href": "/profile/Jose-Maldonado-5"
            },
            "answer_text": "Yes! ...and no. Our current understanding of standard model physics doesn't allow for backward time-travel scenarios, in order to avoid a go-back-and-kill-your-granny-and-now-how-can-you-exist paradox. In support of this, you are right. If at anytime in the future this would become possible, then most likely we would have received and evidenced a future visitor by now. Stephen Hawking famously hosted a tongue-in-cheek welcome party for future visitors... And no one showed up. This does not mean that it is proved impossible, just that our understanding is limited and does not support it entirely yet. If travel faster than light were possible, time would effectively pass in reverse. Time travel forward is much more supportable, but the secrets of the fabric of space and time are being probed ever so slowly but surely by some of our finest people, so who knows what we will find out! ",
            "date": "Updated December 2, 2014",
            "views": "3",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arghya Mukherjee",
                    "user_href": "/profile/Arghya-Mukherjee-2"
                },
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "Lorenzo Peroni",
                    "user_href": "/profile/Lorenzo-Peroni"
                },
                {
                    "user_id": "Paul Cutcliffe",
                    "user_href": "/profile/Paul-Cutcliffe"
                },
                {
                    "user_id": "Chris Petrillo",
                    "user_href": "/profile/Chris-Petrillo"
                },
                {
                    "user_id": "Sam Allen",
                    "user_href": "/profile/Sam-Allen-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Haaran Ajgaonkar",
                "href": "/profile/Haaran-Ajgaonkar"
            },
            "answer_text": "Nowadays the technology is so advanced that you can easily upload a fake video regarding time travel and claim it as being real. Now, if you ask me scientifically and logically its very difficult to accomplish this task, as according to relativity to travel through time you need to attain a considerable velocity. Ideally when your speed is approximately equal to 0.5c, the effect is noticeable( that doesn't mean its large). Now to travel considerably through time your speed should be greater than about 0.7c. But according to special relativity an object moving at such high speed tends to gain more mass as its accelerating thus needing more energy than before to maintain the acceleration. You can keep that up till some point after that its impossible to accelerating any further. At one point the mass increases so much that it starts decelerating due to its intense mass. But, you never know what new technique we could achieve to travel through time. Just a 50 years ago no one thought that we would be working on touch screen phones and laptops. We just have to dream big and work towards it. Lastly, I would like to say that time travel is currently being studied and there is no proof of someone travelling through time. ",
            "date": "Answered February 1, 2017",
            "views": "18",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "Sandip Bedare",
                    "user_href": "/profile/Sandip-Bedare"
                },
                {
                    "user_id": "Nilesh More",
                    "user_href": "/profile/Nilesh-More-99"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mohammad Sheikh",
                "href": "/profile/Mohammad-Sheikh-34"
            },
            "answer_text": "Yes, Firstly, this is fairly common with astronauts; infact there are even world records for people who have travelled in time for the Universe Today points out that due to the effects of time dilation, Krikalev (the current record holder) has actually lived for 0.02 seconds less than everyone else on Earth - effectively, he's travelled 0.02 seconds into his own future. The calculation relies on Einstein's theories of relativity, which state that the passage of time is relative, and different, for two objects moving at different speeds or experiencing different levels of gravity. But don't let the word 'theory' fool you - dilation is a real effect, and has been demonstrated in experiments conducted first by flying highly accurate atomic clocks around the world on jet aircraft, and later by GPS satellites which have to be reprogrammed daily to counter the effect. Every astronaut in orbit around the Earth will undergo some level of dilation, since they are travelling at such great speed (7.71 km/s in the International Space Station) for long periods. Secondly, time slows down around wormholes, and if there are two worm holes in close enough proximity, time can reverse too. Therefore the flow varies and therefore that too is evidence of time dialation and this time travel. Lastly, and my favourite one: the multiverse theory. Everything is possible in every other universe. ",
            "date": "Answered May 22, 2018",
            "views": "668",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Constance Rizzonelli",
                    "user_href": "/profile/Constance-Rizzonelli"
                }
            ]
        },
        {
            "author_info": {
                "name": "Graham Partis",
                "href": "/profile/Graham-Partis"
            },
            "answer_text": "There have been some experiments that some people describe as time travel, by reputable  researchers. But these involve sending small things like photons sent back in time fractions of a second. So far (to my knowledge) we have not been able to send people back in time to the distant past. Please visit my site Time.University for a link to work by Seth Lloyd.  I have heard of other people who were trying similar experiments as Seth a while back but at lest one of them went off grid. It is possible someone is using time travel to peek at future stock prices or some similar thing but I dounbt very much that a fully working time machine has been built. In theory it might be done but you might need to invent a way to harvest negative energy in large quantities. Such technology might also be used to build flying cars and taller sky scrapers. Finding a cure for old age might be a simpler task.  ",
            "date": "Answered February 12, 2016",
            "views": "21",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "Jay Murray",
                    "user_href": "/profile/Jay-Murray-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gary Cooke",
                "href": "/profile/Gary-Cooke-22"
            },
            "answer_text": "I’d really love to believe in time travel, it gets me very excited but there’s so many things that would make it impossible to work, even if we found a formula to do it. An example. If I could go back 5 days from now I’d end up just floating in the vacuum of space. The earth (as is everything) is speeding through space, a volume that’s not fully known to us. We can’t say exactly where in space we are because we don’t have a map of the ever expanding universe. It’s not like we can plot coordinates like on earth. So if I went back in time 5 days the earth would be in a completely different place than it is now and although we can say it’s approx ‘x’ miles we have no idea where that is in relation to all of space. So the likelihood of being able to travel back and landing on earth is so unlikely it’s basically impossible. ",
            "date": "Answered July 29, 2020",
            "views": "376",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brian Wells",
                "href": "/profile/Brian-Wells-4"
            },
            "answer_text": "If the first time machine has yet to be built, then no, we wouldn't see visitors from the future among us. The reason for this is because the time machines themselves don't travel through time. They simply provide doorways (wormhole openings) for us to walk through to go a fixed time forward or backward in time. For instance, a time machine with a time difference of one year between its openings would be a \"Year-Ago\" time machine. If you want to go back more than one year, just go through multiple times. But you can't go back further than the time machine existed. And if the time machine is ever destroyed, you can't go to the future beyond that point in time. So, no, until a time machine is actually built, we won't be seeing visitors from the future. ",
            "date": "Answered May 8, 2014",
            "views": "24",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "Chaitanya Arige",
                    "user_href": "/profile/Chaitanya-Arige"
                },
                {
                    "user_id": "Brad Thompson",
                    "user_href": "/profile/Brad-Thompson-232"
                },
                {
                    "user_id": "Jeremy Robards",
                    "user_href": "/profile/Jeremy-Robards"
                },
                {
                    "user_id": "Hamizan Mizan",
                    "user_href": "/profile/Hamizan-Mizan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shaun David",
                "href": "/profile/Shaun-David"
            },
            "answer_text": "Time travel will one day be (maybe already is) possible, but the sense of the phrase will probably alter slightly. We already know how to warp spacetime by adding lots of mass or velocity or by the Alcubiere effect, so an extension of this extrapolated into a seemingly exponential rise in technological prowess may in fact yield results sooner than you'd dare to imagine. The past may be more accessible than we know through a principle that we do not yet have proof for; I imagine though it will only be through observation that we will go there, to start with. We may get there and realise that our own past is so dull and inherently dangerous to tinker with, in comparison to the other places we will be able to visit by then, that we simply won't bother. ",
            "date": "Answered March 20, 2014",
            "views": "12",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "Jihan Trisharoline",
                    "user_href": "/profile/Jihan-Trisharoline"
                },
                {
                    "user_id": "Sam Allen",
                    "user_href": "/profile/Sam-Allen-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Arnold",
                "href": "/profile/Jim-Arnold-17"
            },
            "answer_text": "You pose a very interesting investigation. I had to look this one up. Back in the 1920s there seems to be a number of people caught doing things that are just not done in that era. I just watched a woman walking down the street with what appears to be a cell phone to her ear during a Charlie Chaplin movie. A gentleman in a crowd of people wearing clothes from more modern times (though, it was explained that could have been actually what was worn back then). Still looked too 1980s to me. 5 Pictures And Videos Which ‘Prove’ Time Travel Exists has these pictures and videos. you may want to check them out yourself and make your own judgement. Personally, I believe we do not have this technology just yet. But I can’t help to think there has to be some civilizations far beyond us that have it. ",
            "date": "Answered August 15, 2016",
            "views": "15",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ahmad Shafie H Ibrahim",
                    "user_href": "/profile/Ahmad-Shafie-H-Ibrahim"
                },
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "Joy Nicholas",
                    "user_href": "/profile/Joy-Nicholas-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Phillip Thomas",
                "href": "/profile/Phillip-Thomas-33"
            },
            "answer_text": "Technically the astronauts that went to the moon traveled in time. When they arrived back on earth, they landed in the future. Admittedly it was only factions of a second in the future though. This is due to the theory of relativity where the time passes at different rates relative to the speed at which you travel through space. Due to the speed of the astronauts traveling to the moon and back (also applies to anyone on the international space station) time passes more slowly relativity to time on earth. It can also be said in reverse, to the astronaut time passes faster on earth relative to the astronaut, so when they arrive back to earth they will arrive at some future time. So, yes, a real life example of time travel, that in fact happens quite frequently, but not very exciting as it only relates to a fraction of a second difference. ",
            "date": "Answered September 26, 2020",
            "views": "112",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Al Klein",
                "href": "/profile/Al-Klein"
            },
            "answer_text": "I think, if time travel is developed in the future, the travelers would be conditioned to not be able to leavve any evidence.  They would find themselves unable to say anything that would hint at it. If we lived in the 30s or 40s, I'd look for a man who was well-dressed, but didn't pull his pants legs up when he sat, or a woman who was well-dressed but didn't smooth her skirt when she sat down.  But little things like that (and they may have been too well-conditioned to make slips like that) would be about the only signs. They certainly wouldn't teleport across a busy street or anything obvious like that. ",
            "date": "Answered October 23, 2015",
            "views": "18",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "Molly Martinez",
                    "user_href": "/profile/Molly-Martinez-1"
                },
                {
                    "user_id": "Vasu Kapoor",
                    "user_href": "/profile/Vasu-Kapoor-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sagar Shrivastava",
                "href": "/profile/Sagar-Shrivastava-4"
            },
            "answer_text": "If you are talking about moving faster in time with respect to others then yes, there are a lot of incidences of time travel. This sort of time travel ( or actually I should say time dilation which in a way means slowing of time ) has a very nice explanation and you can calculate it too if you know your velocity wrt some frame of reference. Having this knowledge, I can say that anybody who is moving is travelling slower in time, as the one moving will have time dilated for him. You can read more about this through the twin paradox and a very good example of time travellers would be Muons, which are created in the upper atmosphere and shouldn't survive till the ground ( because of their small lifetime ) but because of their high velocity, their time gets dilated and voila you can detect muons on the ground. ",
            "date": "Answered June 25, 2014",
            "views": "31",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "Pokhrel Pujan",
                    "user_href": "/profile/Pokhrel-Pujan"
                },
                {
                    "user_id": "Graham Partis",
                    "user_href": "/profile/Graham-Partis"
                },
                {
                    "user_id": "Akshay Prabhakar",
                    "user_href": "/profile/Akshay-Prabhakar-5"
                },
                {
                    "user_id": "Amogha Skanda",
                    "user_href": "/profile/Amogha-Skanda"
                },
                {
                    "user_id": "Arabind Swain",
                    "user_href": "/profile/Arabind-Swain"
                },
                {
                    "user_id": "Nairit Dutta",
                    "user_href": "/profile/Nairit-Dutta"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tamilan Creations",
                "href": "/profile/Tamilan-Creations-2"
            },
            "answer_text": "Even though there is no hard evidence holding the event that are claimed to be time traveling still there is some evidence to prove them such as the hipster time traveler where even a child can approve that the dude in the pic is not belonged there and also the people around him just watching him rather than the bridge opening scene as it is the main event and also there is a strong case that is made that there is no one ever lived in the place like him…. To know more view this video on You Tube where these sequences are explained and how an atomic clock can proves that the Time travel is possible ->  ",
            "date": "Answered September 21, 2020",
            "views": "65",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Andy Bradford",
                "href": "/profile/Andy-Bradford-1"
            },
            "answer_text": "Asking me to answer this question is a bit like asking an atheist if there are any real incidences of miracles. All matter travels through time. Every single subatomic particle has a single location in space and a velocity (and possibly other parameters) for every moment in time.  If you believe in the ability to travel back in time then you have to realise that this would mean that every single particle can exist in multiple locations at the same moment in time. This would break most known physics laws. So yes everything travels forward in time, but there are no incidences anywhere of travelling backwards in time. ",
            "date": "Answered February 13, 2016",
            "views": "15",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dmitry Popov",
                "href": "/profile/Dmitry-Popov-6"
            },
            "answer_text": "On 28 June 2009 professor Stephen Hawking organized a party for time travelers but only announced it after the party ended, so that only real time travelers could come. Nobody showed up. Stephen Hawking: 'I Held A Party For Time-Travellers But No One Came' ",
            "date": "Answered August 15, 2016",
            "views": "3843",
            "upvotes": " View 1.3K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Oscar Tercel",
                    "user_href": "/profile/Oscar-Tercel"
                },
                {
                    "user_id": "Bapun Mishra",
                    "user_href": "/profile/Bapun-Mishra"
                },
                {
                    "user_id": "Erkin Aydin",
                    "user_href": "/profile/Erkin-Aydin-1"
                },
                {
                    "user_id": "Lea Pepelko",
                    "user_href": "/profile/Lea-Pepelko"
                },
                {
                    "user_id": "Gunjan Kulkarni",
                    "user_href": "/profile/Gunjan-Kulkarni-7"
                },
                {
                    "user_id": "Fernando Lodeiro",
                    "user_href": "/profile/Fernando-Lodeiro-1"
                },
                {
                    "user_id": "Kolipey Abhishek",
                    "user_href": "/profile/Kolipey-Abhishek"
                },
                {
                    "user_id": "Sahil Ramane",
                    "user_href": "/profile/Sahil-Ramane-1"
                },
                {
                    "user_id": "Juho Leppäaho",
                    "user_href": "/profile/Juho-Leppäaho"
                },
                {
                    "user_id": "Simon Quan",
                    "user_href": "/profile/Simon-Quan"
                },
                {
                    "user_id": "Wan Hafizi",
                    "user_href": "/profile/Wan-Hafizi-3"
                },
                {
                    "user_id": "Gaurav Magar",
                    "user_href": "/profile/Gaurav-Magar"
                },
                {
                    "user_id": "Santhanam Thangavelu",
                    "user_href": "/profile/Santhanam-Thangavelu"
                },
                {
                    "user_id": "Adhityan KV",
                    "user_href": "/profile/Adhityan-KV"
                },
                {
                    "user_id": "Fajar Sutrisno",
                    "user_href": "/profile/Fajar-Sutrisno"
                },
                {
                    "user_id": "Rahul Kakkar",
                    "user_href": "/profile/Rahul-Kakkar-13"
                },
                {
                    "user_id": "Vitesh Bhatia",
                    "user_href": "/profile/Vitesh-Bhatia-1"
                },
                {
                    "user_id": "Alec Milam",
                    "user_href": "/profile/Alec-Milam"
                },
                {
                    "user_id": "Akshit Kanda",
                    "user_href": "/profile/Akshit-Kanda"
                },
                {
                    "user_id": "Chris Nguyen",
                    "user_href": "/profile/Chris-Nguyen-73"
                },
                {
                    "user_id": "Ferdy Arthanto",
                    "user_href": "/profile/Ferdy-Arthanto"
                },
                {
                    "user_id": "Jason Wu",
                    "user_href": "/profile/Jason-Wu-214"
                },
                {
                    "user_id": "Vuthy Reach",
                    "user_href": "/profile/Vuthy-Reach-2"
                },
                {
                    "user_id": "Oliver Leys",
                    "user_href": "/profile/Oliver-Leys"
                },
                {
                    "user_id": "Vyshnav Muthukrishnan",
                    "user_href": "/profile/Vyshnav-Muthukrishnan"
                },
                {
                    "user_id": "Sungsoon Cho",
                    "user_href": "/profile/Sungsoon-Cho"
                },
                {
                    "user_id": "Shubham Chaudhary",
                    "user_href": "/profile/शुभम-चौधरी-Shubham-Chaudhary"
                },
                {
                    "user_id": "Sardor Alamov",
                    "user_href": "/profile/Sardor-Alamov"
                },
                {
                    "user_id": "Cael Kuhlman",
                    "user_href": "/profile/Cael-Kuhlman"
                },
                {
                    "user_id": "Sanjay Singhal",
                    "user_href": "/profile/Sanjay-Singhal"
                },
                {
                    "user_id": "Normas Yakin",
                    "user_href": "/profile/Normas-Yakin"
                },
                {
                    "user_id": "Pratik Jadhav.",
                    "user_href": "/profile/Pratik-Jadhav-23"
                },
                {
                    "user_id": "Himanshu Khanchandani",
                    "user_href": "/profile/Himanshu-Khanchandani-1"
                },
                {
                    "user_id": "Mahesh Thalur",
                    "user_href": "/profile/Mahesh-Thalur"
                },
                {
                    "user_id": "Ege Auger",
                    "user_href": "/profile/Ege-Auger"
                },
                {
                    "user_id": "Justus Westerhoff",
                    "user_href": "/profile/Justus-Westerhoff"
                },
                {
                    "user_id": "Rajeev Chopra",
                    "user_href": "/profile/Rajeev-Chopra-9"
                },
                {
                    "user_id": "Israel A. Vaché",
                    "user_href": "/profile/Israel-A-Vaché"
                },
                {
                    "user_id": "Blane Wilson",
                    "user_href": "/profile/Blane-Wilson"
                },
                {
                    "user_id": "R. Shippas",
                    "user_href": "/profile/R-Shippas"
                },
                {
                    "user_id": "Ashwath S",
                    "user_href": "/profile/Ashwath-S-16"
                },
                {
                    "user_id": "Akhil Koshy",
                    "user_href": "/profile/Akhil-Koshy-6"
                },
                {
                    "user_id": "Sharon Lamb",
                    "user_href": "/profile/Sharon-Lamb-4"
                },
                {
                    "user_id": "Edward Tarr",
                    "user_href": "/profile/Edward-Tarr"
                },
                {
                    "user_id": "Shelly Storm",
                    "user_href": "/profile/Shelly-Storm"
                },
                {
                    "user_id": "Sam Major",
                    "user_href": "/profile/Sam-Major-1"
                },
                {
                    "user_id": "Mark Jiao",
                    "user_href": "/profile/Mark-Jiao-1"
                },
                {
                    "user_id": "Benjamin Heysse",
                    "user_href": "/profile/Benjamin-Heysse"
                },
                {
                    "user_id": "Jo",
                    "user_href": "/profile/Jo-1388"
                },
                {
                    "user_id": "Aditya Gandhi",
                    "user_href": "/profile/Aditya-Gandhi-36"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rick O'Neill",
                "href": "/profile/Rick-ONeill-2"
            },
            "answer_text": "One of these hypotheses was presented to the public in 1934 in a story “Branches of Time” by David Daniels. In his book “Time travel and other mathematical bewilderments” Martin Gardner puts this in like that: “The basic idea is as simple as it is fantastic. Persons can travel to any point in the future of their universe, with no complications, but the moment they enter the past, the universe splits into two parallel worlds, each with its own time track. Read more: http://www.strielkowski.com/news/a-time-travel-paradox-explained/ ",
            "date": "Answered March 31, 2014",
            "views": "3",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "Madhu Rata Rao",
                    "user_href": "/profile/Madhu-Rata-Rao"
                },
                {
                    "user_id": "El Osko",
                    "user_href": "/profile/El-Osko"
                },
                {
                    "user_id": "Neeru",
                    "user_href": "/profile/Neeru-7"
                },
                {
                    "user_id": "Hamizan Mizan",
                    "user_href": "/profile/Hamizan-Mizan"
                },
                {
                    "user_id": "Jackson Kent Rollins",
                    "user_href": "/profile/Jackson-Kent-Rollins"
                },
                {
                    "user_id": "Ruth Scaparre",
                    "user_href": "/profile/Ruth-Scaparre"
                },
                {
                    "user_id": "Sam Allen",
                    "user_href": "/profile/Sam-Allen-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Collins",
                "href": "/profile/Mike-Collins-125"
            },
            "answer_text": "Nope, not a single shred of reliable evidence has ever been found of any being (human or otherwise) travelling through time. Unless, of course, you want to count the everyday “time travel” that we all experience as we naturally and inexorably move from one moment to the next. Travelling through time from the present to the past is, in all likelihood, not allowed by the laws of physics for macroscopic objects like people (or even tiny specks of dust). Being able to do this would violate the fundamental principles of causality and the 2nd law of thermodynamics. Time Machines Would Run Afoul of the Second Law of Thermodynamics [Guest Post] ",
            "date": "Answered September 25, 2017",
            "views": "810",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "Gopal Sankar",
                    "user_href": "/profile/Gopal-Sankar-4"
                },
                {
                    "user_id": "Goku",
                    "user_href": "/profile/Goku-143"
                },
                {
                    "user_id": "Alvin Rodriguez",
                    "user_href": "/profile/Alvin-Rodriguez-3"
                },
                {
                    "user_id": "Ian Hilterbrand",
                    "user_href": "/profile/Ian-Hilterbrand"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nairit Dutta",
                "href": "/profile/Nairit-Dutta"
            },
            "answer_text": "Yes we travel in time everyday when we travel really fast, for example travelling in a train or plane,however the speed is so insignificant as compared to the speed of light that we can hardly feel it.The Gps system is an another example, consists of a network of 24 satellites,each of them are travelling in time,so,we actully adjust the time on earth according to the clock in the satellites,otherwise the accuracy of locations could vary by several km.There are particles in cern super collider which travel in time every day.However travelling backwards in time is a bit tricky as travelling faster than the speed of light is prohibited by the laws of physics ",
            "date": "Answered June 25, 2014",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gaurav Jha",
                "href": "/profile/Gaurav-Jha-50"
            },
            "answer_text": "Yes. Time Travel has already happened. Cosmonaut Sergei Krikalev has already travelled through time Serial ISS resident Sergei Krikalev holds the record for the longest amount of time spent in space with 803 days, 9 hours, 39 minutes under his belt. The ISS travels at around 7.66 km/s when orbiting around Earth, and due to the high speed and length of time which he spent in space, the cosmonaut actually arrived back in Earth 0.02 seconds in the future thanks to Time dilation. ",
            "date": "Answered January 12, 2017",
            "views": "23",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adam Fularz",
                    "user_href": "/profile/Adam-Fularz-1"
                },
                {
                    "user_id": "Chand Kamboh",
                    "user_href": "/profile/Chand-Kamboh"
                },
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "Kishan Vaghela",
                    "user_href": "/profile/Kishan-Vaghela-2"
                },
                {
                    "user_id": "Roopa Ghosh",
                    "user_href": "/profile/Roopa-Ghosh-3"
                },
                {
                    "user_id": "Marc Kerkmann",
                    "user_href": "/profile/Marc-Kerkmann"
                },
                {
                    "user_id": "Vipul Jadav",
                    "user_href": "/profile/Vipul-Jadav-3"
                },
                {
                    "user_id": "Chaitanya Arige",
                    "user_href": "/profile/Chaitanya-Arige"
                },
                {
                    "user_id": "Brad Thompson",
                    "user_href": "/profile/Brad-Thompson-232"
                },
                {
                    "user_id": "Shachi Pancholi",
                    "user_href": "/profile/Shachi-Pancholi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ian Sawyer",
                "href": "/profile/Ian-Sawyer"
            },
            "answer_text": "Not necessarily. If people from our future were only able to travel backwards in time in a parallel universe, in theory they might be able to see us but only as observers, whilst they remained totally invisible to us.   However given the laws of physics, the likelihood of any form of time travel other than forward (as in time dilation) is so remote that it can be totally discounted in any practical sense. ",
            "date": "Answered March 20, 2014",
            "views": "13",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aashish Tripathee",
                    "user_href": "/profile/Aashish-Tripathee"
                },
                {
                    "user_id": "Ruth Scaparre",
                    "user_href": "/profile/Ruth-Scaparre"
                },
                {
                    "user_id": "Stephen Frantz",
                    "user_href": "/profile/Stephen-Frantz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kelly White",
                "href": "/profile/Kelly-White-353"
            },
            "answer_text": "I time travel once a week and post some of them to my youtube channel. (The Woo Woo Channel) Currently the one about the construction of the pyramids in Egypt is the only one that is public. This week we will be doing some things that won’t go public, but next week we will be exploring the mysteries of the Grand Canyon as a follow up to the Egypt trip. I’ll post that one for all to see. ",
            "date": "Answered January 1, 2019",
            "views": "302",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gerald Goll",
                "href": "/profile/Gerald-Goll"
            },
            "answer_text": "     The existence of the universe itself may be evidence of time travel. The real issue is what created the energy inherent in the singularity or whatever it was that caused the Big Bang and  initial creation and expansion of spacetime and what created whatever if was if anything, that preceded that, and what created whatever  preceded that and so on.     Unless the  time can loop back upon itself  in at least one instance, it appears that existence is impossible because something has to create the first \"thing\" / \"energy\".   ",
            "date": "Answered May 12, 2016",
            "views": "920",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shrihari",
                "href": "/profile/Shrihari-15"
            },
            "answer_text": "Caution:Read on your own terms. This may be true and this may not be true. Here are some of the celebrities who look like people similar for past ages. They look similar or they have token travelled. It’s a conspiracy. Mesut Ozil.  Jennifer Lawrence.  Justin Timberlake.  Mark Zuckerberg.   Kaenu Reeves.  John Travolta.  Bruce Willis.  Ellen.  Jay-Z.  ",
            "date": "Answered August 27, 2018",
            "views": "14",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ashi",
                    "user_href": "/profile/Ashi-234"
                },
                {
                    "user_id": "Divyanshu Raj",
                    "user_href": "/profile/Divyanshu-Raj-3"
                },
                {
                    "user_id": "Saloni Sharma",
                    "user_href": "/profile/Saloni-Sharma-364"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Jeffrey",
                "href": "/profile/David-Jeffrey-52"
            },
            "answer_text": "No, as time travel is impossible. The human race is still a childlike race in this universe believing in such fantasies as time travel and non existant gods and if in the future we were visited by a superior race from another world they would look at us as we look at humans a few 1000 years ago. You know, the ones that invented an imaginary god and a fake history for the Hebrew Race that is still believed and worsjipped today. We have hardly advanced have we. So no wonder people believe in time travel ",
            "date": "Answered July 24, 2020",
            "views": "232",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chris Gunter",
                "href": "/profile/Chris-Gunter-7"
            },
            "answer_text": "Whether or not they can be confirmed is a different question, but there are several strange occurrences where future technology seems to show up in dated photos. There’s also some evidence to support Donald Trump being a time traveler. This is a podcast that talks about some possible time travelers in history.  ",
            "date": "Answered January 20, 2019",
            "views": "225",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lucas Leahy",
                "href": "/profile/Lucas-Leahy-1"
            },
            "answer_text": "I am by no mean an expect on this subject but have long thought about the same question. I would imagine and hope that if time travel were possible that disasters would not happen, people from the future would have come back an stopped disasters which involved innocent and unreasoned deaths.  But this is only hypothetical and fictional. I don't believe that time travel is actually physically possible but as I mentioned I am no expert so I could be wrong (and I hope I am wrong because time travel would be very useful). ",
            "date": "Answered March 20, 2014",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "Sam Allen",
                    "user_href": "/profile/Sam-Allen-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rod Maughan",
                "href": "/profile/Rod-Maughan"
            },
            "answer_text": "Yes, you are doing it all your life, you’re doing it right now. We all are. We travel through time since the day we are born. Sci-fi notions of time travel are very unlikely - remember the Earth is moving through space very fast. Not just around the Sun, but the solar system rotates around the galaxy and the galaxy itself is moving through the universe. So in order to time travel, you would also need to travel vast distances in space. Who really knows when, or if ever, we would possess the technology to do so? ",
            "date": "Answered July 17, 2020",
            "views": "523",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "RUMI SHAHARYAR",
                "href": "/profile/RUMI-SHAHARYAR"
            },
            "answer_text": "There are many stories and pictures which claims to be of same person in different eras but these stories are not proved, they are just stories in which two different people’s face are similar but they aren’t same. Our world haven’t witnessed any time traveller yet. This is also a main reason which makes us believe that time travel will not be invented even in future, otherwise we would have definitely witnessed travellers from different timeline. ",
            "date": "Answered January 2, 2017",
            "views": "542",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anubhav Jindal",
                "href": "/profile/Anubhav-Jindal"
            },
            "answer_text": "Scientifically,  we are actually travelling through time each and every moment. The faster you move, the slower the time will pass for you. This is not quite observable because the velocity with which we are able to travel due to technological limitations is quite less as compared to that of light. But offcourse its not zero... so we actually travel time! ",
            "date": "Answered August 13, 2014",
            "views": "737",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "Abhay Singh",
                    "user_href": "/profile/Abhay-Singh-264"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aman Joshi",
                "href": "/profile/Aman-Joshi-74"
            },
            "answer_text": "I don't if these proof are real but I can mention some of them..One being Al Beik videos CD of The Montauk project also you could read about Prestige Nichols. And then you can always search YouTube for 10 strongest signs of time travel and there you go..Although the video on top always amazes me.. But for sure I can't say whether these are real or not.Its for you to think. ",
            "date": "Answered February 1, 2017",
            "views": "381",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Saranya Pawan Kumar",
                    "user_href": "/profile/Saranya-Pawan-Kumar"
                },
                {
                    "user_id": "Philip Thomas",
                    "user_href": "/profile/Philip-Thomas-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Devika Bihani",
                "href": "/profile/Devika-Bihani"
            },
            "answer_text": "One of the most common example for time travel Twin paradoxSuppose among two twins one decided to go to a distant planet , after the journey there will be a time lag, due to which there will be difference in the ages of the two. Hence, one has done the time travel For further calculations plz refer to the following link. Twin paradox - Wikipedia Thanks for A&A! ",
            "date": "Answered February 1, 2017",
            "views": "612",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                }
            ]
        },
        {
            "author_info": {
                "name": "Derek Gould",
                "href": "/profile/Derek-Gould-1"
            },
            "answer_text": "No, except for time dilation when travelling at relativistic speeds. YouTube has some photos and videos showing supposed time travellers, but the credibility of such “evidence” is entirely subjective (eg people wearing what appears to be anachronistic clothing or accessories that don’t belong to that time period, people or objects seemingly appearing out of nowhere, etc). ",
            "date": "Answered September 27, 2017",
            "views": "411",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "Nilesh More",
                    "user_href": "/profile/Nilesh-More-99"
                }
            ]
        },
        {
            "author_info": {
                "name": "Almighty Java",
                "href": "/profile/Almighty-Java"
            },
            "answer_text": "Yes, Recently one reported Man arrested after claiming he traveled from 2048 to warn of alien invasion  as per him next year Alien are going to attack us.  There is one more real incident when man traveled through time and met himself in 2042  Thanks for reading ",
            "date": "Updated October 21, 2017",
            "views": "15",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Wanyoike Evans",
                    "user_href": "/profile/Wanyoike-Evans"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sachin R",
                "href": "/profile/Sachin-R-80"
            },
            "answer_text": "Uptill now their is no hard evidence about time travel. But yes it has happened and many people have experienced it. Even John titors theory was not proved as he abruptly disappeared from the picture while he was in the news. Even now it has been a mystery. ",
            "date": "Answered March 1, 2017",
            "views": "529",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "Vishal",
                    "user_href": "/profile/Vishal-619"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jose Thomas",
                "href": "/profile/Jose-Thomas-48"
            },
            "answer_text": "Yes, You would find a tonnes of videos on YouTube about the evidences of time travel… It’s true that you would find it interesting too, But the authenticity of such videos are still in dark. I personally believe that time travel will be possible in near future. So don’t worry you would also may get a chance to do so!! ",
            "date": "Answered February 1, 2017",
            "views": "287",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                }
            ]
        },
        {
            "author_info": {
                "name": "Animesh Rao",
                "href": "/profile/Animesh-Rao"
            },
            "answer_text": "There have been many people who claim to have travelled in time, especially to the past. But none of these incidents can be verified unless they actually bring an object which can be age tested. Whether you believe them or not is entirely up to you. Time slip ",
            "date": "Answered July 4, 2014",
            "views": "16",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sumanth Kothapalli",
                "href": "/profile/Sumanth-Kothapalli-1"
            },
            "answer_text": "There is a theory, which tells us that, it is possible to travel faster than light or slower than light, but not exactly with the same speed as light. If one can match the speed of light, then it possibly is evidence of time travel. But matching with the speed of light is impossible, so is the non existence of truth in time traveling. ",
            "date": "Answered February 19, 2017",
            "views": "529",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Thommy Saltzherr",
                "href": "/profile/Thommy-Saltzherr"
            },
            "answer_text": "None, there (sadly) is no real scientific evidence that time travel is possible. If we have to follow all information we have then we end up with mysteries that we can’t explain and the laws of physics telling us that that time travel can’t be done. ",
            "date": "Answered August 28, 2017",
            "views": "599",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "Anadi Agnihotri",
                    "user_href": "/profile/Anadi-Agnihotri"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arun Shravan",
                "href": "/profile/Arun-Shravan"
            },
            "answer_text": "scientists atop the international space station are actually ageing slowly than us by micro seconds. To see the effects you must be up there for 100 years but yeah we can say that they do time travel by a fraction of a second every second. https://www.wired.com/2014/11/ti.. ",
            "date": "Answered February 2, 2017",
            "views": "396",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "Parth Tulapurkar",
                    "user_href": "/profile/Parth-Tulapurkar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nandita Verma",
                "href": "/profile/Nandita-Verma-6"
            },
            "answer_text": "Once..to test the evidences of time traveller,Stephen Hawking held a party for time travellers,but no one turned up. I think this link will help you… Stephen Hawking held a party for time-travellers - but no-one turned up... ",
            "date": "Answered February 26, 2017",
            "views": "802",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "Archisman Kar",
                    "user_href": "/profile/Archisman-Kar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kshitij Jhangra",
                "href": "/profile/Kshitij-Jhangra-1"
            },
            "answer_text": "I don't believe in such crap but I have seen a time travel video on YouTube , it's a video shot in 1905 and I m visible clearly in that video with a laptop bag. I am waiting if I will have a chance in near future. But , the idea of time travel is totally crap for me. ",
            "date": "Updated July 16, 2020",
            "views": "791",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marc Schaeffer",
                "href": "/profile/Marc-Schaeffer"
            },
            "answer_text": "Yes! Very slowly by everyone. Unfortunately a lot of time travelers die this way. ",
            "date": "Answered May 22, 2018",
            "views": "191",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "Yuvraj Singh YSB",
                    "user_href": "/profile/युवराज-सिंह-बघेल-Yuvraj-Singh-YSB"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jerry Greelis",
                "href": "/profile/Jerry-Greelis"
            },
            "answer_text": "Impossible yesterday, today or tomorrow.  Incarnation is more probable than any of this nonsense. ",
            "date": "Answered May 10, 2014",
            "views": "189",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cal DeBouvre",
                "href": "/profile/Cal-DeBouvre"
            },
            "answer_text": "Unfortunately, no. The theory is similar to one of the theories about extraterrestrials: either they never came, or they can't or won't interfere with current earth life. ",
            "date": "Answered February 7, 2015",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amrut Rabari",
                    "user_href": "/profile/Amrut-Rabari"
                },
                {
                    "user_id": "Jove Peters",
                    "user_href": "/profile/Jove-Peters"
                }
            ]
        },
        {
            "author_info": {
                "name": "Evelyn Martin",
                "href": "/profile/Evelyn-Martin-19"
            },
            "answer_text": "YES! ",
            "date": "Answered February 22, 2020",
            "views": "75",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vasu Kapoor",
                    "user_href": "/profile/Vasu-Kapoor-1"
                },
                {
                    "user_id": "Josh Beam",
                    "user_href": "/profile/Josh-Beam-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "David R Holt",
                "href": "/profile/David-R-Holt"
            },
            "answer_text": "Of course there are! EVERYONE is traveling forward through time at the speed of 24 hours per day! ",
            "date": "Answered July 24, 2020",
            "views": "98",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Meriwether",
                "href": "/profile/David-Meriwether-2"
            },
            "answer_text": "I traveled FORWARD in time nearly four years and answered this question… *drops microphone* ",
            "date": "Answered July 30, 2020",
            "views": "45",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William John",
                "href": "/profile/William-John-60"
            },
            "answer_text": "We travel forward through time from second to second. Travelling back in time is not possible according to our current scientific knowledge. ",
            "date": "Answered July 29, 2020",
            "views": "48",
            "upvotes": "0"
        }
    ]
}