{
    "title": "Are virtual reality games possible? - Quora",
    "tags": [
        "Virtual Worlds",
        "Augmented Reality"
    ],
    "response": [
        {
            "author_info": {
                "name": "Novica Gijevski",
                "href": "/profile/Novica-Gijevski"
            },
            "answer_text": "Virtual Reality games are already here, we are not talking about possibility - not yet, because VR games already exist and the gaming business is starting to go into another dimension. The future of Virtual Reality gaming is now - for you to get a better knowledge of what's happening now in the VR gaming business, you need to visit THIS LINK. It will present you the present and the future of VR gaming.  Not so long ago, people started to ask themselves - “What will going to happen in future if we already live in it?” - well I have a simple response to that: “Our sense of creating something really advanced has never abandoned us, since the start of our civilization.” While the VR gaming future includes both the advancement of the current technologies and development of brand new technologies, one thing is certain: it’s definitely going to be a fun ride.  VR Gaming Means Business The attention VR gaming is already gaining in the financial realm. It’s great news for everyone. From gigantic technology companies to startups, gamers are exited about the investment in order to improve the quality of their play time. Lets take a short look at some of the VR headsets ... Oculus Rift The Oculus Rift is not only one of the best, but arguably the best VR gaming headset money can buy. The point is that would only be argued by the fans of HTC ViveHTC Vive Vive requires a beefy PC in order to work. HTC Vive is very unique, it uses lasersSamsung Gear VR Samsung has worked so hard in order to offer newcomers a good selection of affordable content. If the Samsung Gear VR does one thing really well, that thing is - it puts the future of VR within reach of the masses Sony PlayStation VR PlayStation may not reshape the future of VR technology, like the previously mentioned headsets in the likes of Rift or Vive, but it is hard to imagine and visualize the future of VR gaming without itGoogle Cardboard VR gaming is not all about performance - it is also about accessibility. Let be honest - nothing makes VR more accessible than the CardboardWe have very bright future ahead with the VR technology, so gaming its just a beginning of the implementation of this great technology. ",
            "date": "Answered September 30, 2017",
            "views": "12",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jeff Flanagan",
                    "user_href": "/profile/Jeff-Flanagan-4"
                },
                {
                    "user_id": "Wheelz",
                    "user_href": "/profile/Wheelz-5"
                },
                {
                    "user_id": "Lily S",
                    "user_href": "/profile/Lily-S-25"
                },
                {
                    "user_id": "Ines De Sousa",
                    "user_href": "/profile/Ines-De-Sousa"
                },
                {
                    "user_id": "Qua Ano",
                    "user_href": "/profile/Qua-Ano"
                },
                {
                    "user_id": "Craig Wilson",
                    "user_href": "/profile/Craig-Wilson-149"
                },
                {
                    "user_id": "Eric Sommer",
                    "user_href": "/profile/Eric-Sommer-11"
                },
                {
                    "user_id": "Caroline Lewis",
                    "user_href": "/profile/Caroline-Lewis-38"
                },
                {
                    "user_id": "Erica Brooks",
                    "user_href": "/profile/Erica-Brooks-30"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Stein",
                "href": "/profile/James-Stein-50"
            },
            "answer_text": "There is not a device that hijacks your brain directly feeding in data that makes you truly feel in all aspects of your humanity like your are somewhere else with full body control-like in SAO. But it doesn't matter. The combination of a headset like Oculus Rift or Vive with motion controllers like Oculus Touch or the Vive wands already feels like SAO. And there are lots of games to play now with motion controllers if you have a Vive, and an insane amount of games coming soon. Check out the newly released Raw Data for an example of how awesome VR games already exist. ",
            "date": "Answered July 15, 2016",
            "views": "429",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "James McNaughton",
                    "user_href": "/profile/James-McNaughton"
                }
            ]
        }
    ]
}