{
    "title": "Are all stars of the same size? - Quora",
    "tags": [
        "Stars (astronomical objects)",
        "Astrophysics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ben Baker",
                "href": "/profile/Ben-Baker-86"
            },
            "answer_text": "I assume that by this you are asking if all stars the same diameter or mass or some other measurement. Physicists hate ‘size'. If that is what your asking, then the answer is no! Stars come in a wide spectrum of mass, diameter and temperature and these differences are Huge and very important. This scale runs all the way from vast red hyper-giants such as V Y Cannis Majoris, the largest known star at 2600 solar radii (thats the radius of our sun). The scale then go down past our sun right to the smallest we know of, EBLM J0555-57Ab which is currently presumed to be an ultracool -dwarph star. Hope this is informative. Ben P.S. I wrote this in bed on my phone so please do mention if there's a mistake anywhere. ",
            "date": "Answered January 18, 2018",
            "views": "928",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "CE Stanley",
                    "user_href": "/profile/CE-Stanley-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hal MacLean",
                "href": "/profile/Hal-MacLean-1"
            },
            "answer_text": "Nope. Have a look here - there are many similar websites showing the same stuff. Our sun is a star and it’s huge, but it’s like nothing at all when you compare it to Arcturus. And Arcturus is like… tiny, compared to Antares! However you describe ‘size’ - and I’m going for the sheer dimensions of it - stars can be absolutely huge, or simply ginormous… or bigger. ",
            "date": "Answered January 18, 2018",
            "views": "306",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gwydion Madawc Williams",
                "href": "/profile/Gwydion-Madawc-Williams"
            },
            "answer_text": "Absolutely not. Ours is one of the bigger type, G-type. But the stars bright enough to be seen with a telescope are mostly even brighter.  ",
            "date": "Answered October 14, 2018",
            "views": "270",
            "upvotes": "0"
        }
    ]
}