{
    "title": "Are we living in an illusion or a reality? - THE KINGDOM OF ATLANTIS - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Michele Puzzolante",
                "href": "/profile/Michele-Puzzolante"
            },
            "answer_text": "We perceive the Physical Reality with our brain and senses and these perceptions are stored in our Mind. My name is Mr. Michele Puzzolante and i have matured more than 30 years experience in Advanced Metaphysics, which is a Body of Knowledge that studies Life, Consciousness, the Mind, Humanity and the Physical Reality. The subject of the YouTube video, you are about to watch, reveals a crucial secret of your life. You should watch it very attentively, for it concerns a subject that is liable to make fundamental changes in your outlook of the material world. The content of this YouTube video is not just a different approach, or a Metaphysical thought, it is a fact which is also proven by science today.  Advanced Metaphysics is a Body of Knowledge that helps Humanity understand what are our origins, who we really are and where we are going. We are creating the largest Community of Metaphysicians on Planet Earth! Please join our Quora Community here: THE KINGDOM OF ATLANTIS Thank you for your support and understanding. Copyright 2020 – Michele Puzzolante – All rights reserved. ",
            "date": "August 5, 2020",
            "views": "54",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Arunachalam Ramasamy",
                    "user_href": "/profile/Arunachalam-Ramasamy-4"
                },
                {
                    "user_id": "Hassan Osagie",
                    "user_href": "/profile/Hassan-Osagie"
                },
                {
                    "user_id": "Chintan Patel",
                    "user_href": "/profile/Chintan-Patel-429"
                },
                {
                    "user_id": "Shayne Quade",
                    "user_href": "/profile/Shayne-Quade"
                },
                {
                    "user_id": "Ilya Steam",
                    "user_href": "/profile/Ilya-Steam"
                },
                {
                    "user_id": "Carter Greber",
                    "user_href": "/profile/Carter-Greber"
                },
                {
                    "user_id": "David Gwartney",
                    "user_href": "/profile/David-Gwartney-1"
                },
                {
                    "user_id": "Takhelchangbam Ravi Sharma",
                    "user_href": "/profile/Takhelchangbam-Ravi-Sharma"
                },
                {
                    "user_id": "Georgina Diane",
                    "user_href": "/profile/Georgina-Diane"
                },
                {
                    "user_id": "Agus Sova",
                    "user_href": "/profile/Agus-Sova"
                }
            ]
        },
        {
            "author_info": {
                "name": "Szabolcs Pap",
                "href": "/profile/Szabolcs-Pap-2"
            },
            "answer_text": "Our perception of reality is probably incorrect to a degree, nobody is an exception. All we know as “reality” is what we managed to perceive as such with our senses. So what is real and what is illusion, from this point of view are dangerously close to one another… Personally, I never touch reality… I difind it waters down the hallucinations. Lol Lemme explain. Some time ago, people asked why my music does not tell about the better world, and well while some songs I like do, the vast and overwhelming majority don't, they only tell of ruin, destruction, suffering, hate and its consequences. Why? I haven't seen the better world yet, so I don't have anything solid to say in a song about it. Currently it's just an illusion, a hallucination, yet I believe we can do a great deal better than this so there. 😁 Cheers Or another way to put it simple and plain (given you know my language)  ",
            "date": "August 5, 2020",
            "views": "116",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sumit Nagrani",
                    "user_href": "/profile/Sumit-Nagrani"
                },
                {
                    "user_id": "Michele Puzzolante",
                    "user_href": "/profile/Michele-Puzzolante"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mary Testin",
                "href": "/profile/Mary-Testin-1"
            },
            "answer_text": "Ironically I think it is both. All of us are biased in some way that creates illusion and distorts reality. That’s the source of conflict. Full reality can only be seen when many people/cultures contribute to the conversation like light hitting a prism and we learn to listen to and respect our perspectives as pointing to something greater than ourselves. ",
            "date": "August 10, 2020",
            "views": "144",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Arunachalam Ramasamy",
                    "user_href": "/profile/Arunachalam-Ramasamy-4"
                },
                {
                    "user_id": "Willa Weiland",
                    "user_href": "/profile/Willa-Weiland"
                },
                {
                    "user_id": "Ben Jackson",
                    "user_href": "/profile/Ben-Jackson-431"
                },
                {
                    "user_id": "David Gwartney",
                    "user_href": "/profile/David-Gwartney-1"
                },
                {
                    "user_id": "Michele Puzzolante",
                    "user_href": "/profile/Michele-Puzzolante"
                },
                {
                    "user_id": "Marcos Aurélio Rondineli de Oliveira",
                    "user_href": "/profile/Marcos-Aurélio-Rondineli-de-Oliveira-1"
                }
            ]
        }
    ]
}