{
    "title": "Are parapsychology and psychology true science or pseudoscience? - Quora",
    "tags": [
        "Parapsychology",
        "Pseudoscience",
        "Psychology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jon Hilderbrand",
                "href": "/profile/Jon-Hilderbrand"
            },
            "answer_text": "Parapsychology is considered pseudo-science because it's results cannot be empirically tested. As Edward Azkarra said,  \"What determines science versus pseudoscience is how the scientific method is applied, in particular, what happens to the hypothesis if the data contradicts it.\" A problem I can see with this is...well, bear with me: Let's say there really are \"ghosts\". Many thousands, perhaps millions of people have seen them...so they say. Some have even seen the same ghost at the same places, but at different times. The problem with applying the scientific method to the study of ghosts is determining first: \"what is the nature of a ghost\"? Whole TV shows have been devoted to parapsychologists and \"ghost hunters\" trying vainly to capture evidence of ghosts. But what if ghosts (again, we are positing that they really do exist) are extra-dimensional or occupy another universe. Most scientists/physicists now recognize at least the possibility of multiverses, some going so far as to say they absolutely do exist. Well, what if beings from those alternate universes, unlike our own, are capable of moving back and forth from their universe to ours? Maybe they cannot control when it happens, maybe they can. So it could be that A. the ghosts refuse to be controlled by our experiments, or B. appear in our dimension so randomly as to make our scientific method unsuitable. Indeed, if it is either of these, it could explain why they appear to some people but not to others. If they are intelligent and can control their interaction, perhaps they know when someone is looking for them to appear, to get on film or audio. And so they just stay away. If they cannot control their appearances, then of all the camera footage ever taken, some might well be showing really ghostly apparitions, but so randomly that it doesn't make sense to us.  Psychology is, I believe, a science. It can tell us what is, what causes (a lot of the time), but not what \"fixes\". That's where psychiatry comes in, and I think it occupies a singular space between science and pseudo-science. Just compare how often the DSM is \"updated\" versus the ICD!  ",
            "date": "Answered April 12, 2016",
            "views": "315",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tim Thorne",
                    "user_href": "/profile/Tim-Thorne-2"
                },
                {
                    "user_id": "Arrigo Sacchi",
                    "user_href": "/profile/Arrigo-Sacchi-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Craig Weiler",
                "href": "/profile/Craig-Weiler"
            },
            "answer_text": "Parapsychology is a real science.  Anyone who tells you otherwise is just ignorant. Really.  You will see people spout off as if they know something about it all the frigging time when in reality they've never looked into it. The main organization for parapsychology is the Parapsychological Association.  It's a real scientific organization that gained membership into the American Association for the Advancement of Science in 1969.  So it's been vetted by the premiere umbrella organization for the sciences as scientific. The argument that psychic ability cannot be tested is patently absurd.  Here you go: http://www.deanradin.com/evidence/evidence.htm  Lots of scientific papers here and that's only a fraction of what's out there. The argument that it has never produced any positive results?  Also nonsense.  Of course they have.  In many areas. The argument that the experiments are sloppy?  Also nonsense.  Psi experiments are roughly 85% double blind.  The rest of the sciences are somewhere under 35%. Effects are due to the file drawer effect?  Nope.  All studies must be pre-registered to prevent that.  (Since the late 70's.) I could present evidence until I'm blue in the face and it won't change the opinions of some people.  They just don't want to believe that science might not agree with their beliefs. ",
            "date": "Answered May 8, 2016",
            "views": "344",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Elad Miller",
                    "user_href": "/profile/Elad-Miller-2"
                },
                {
                    "user_id": "Christo Chiramukhathu",
                    "user_href": "/profile/Christo-Chiramukhathu-1"
                },
                {
                    "user_id": "Ralph Glockemann",
                    "user_href": "/profile/Ralph-Glockemann-1"
                },
                {
                    "user_id": "Andrew Brown",
                    "user_href": "/profile/Andrew-Brown-183"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roberto Vilar",
                "href": "/profile/Roberto-Vilar"
            },
            "answer_text": "It seems that tests to pass messages from military bunkers to atomic submarines proved that \"something\" was effectively passing. However the information were not precise enough to allow a Ohio-class submarine to lunch 24 Trident missiles with 8 multiple independently targetable reentry nuclear vehicles. So the program was abandoned. This is for parapsychology. Psycholgy searchs for paterns to make human behavior predicible at least on a statistical basis. Economics used the conclusion to build more efficient models to manipulate decisions and choices, so yes they are a true science. ",
            "date": "Answered April 12, 2016",
            "views": "153",
            "upvotes": " Answer requested by Arrigo Sacchi",
            "upvoters": [
                {
                    "user_id": "Arrigo Sacchi",
                    "user_href": "/profile/Arrigo-Sacchi-1"
                },
                {
                    "user_id": "Jon Hilderbrand",
                    "user_href": "/profile/Jon-Hilderbrand"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edward Azkarra",
                "href": "/profile/Edward-Azkarra"
            },
            "answer_text": "The simple answer is psychology is a science and parapsychology is a pseudoscience. However, the actual answer is a little tricky. What determines science versus pseudoscience is how the scientific method is applied, in particular, what happens to the hypothesis if the data contradict it. Is the scientific method even used? If a hypothesis from parapsychology is tested, then how was the data analyzed?   Past parapsychology studies were very sloppy. This has lead the entire field to be labeled as pseudoscience. Also, most (if not all?) studies which were conducted rigorously have not measured any psi effect above random chance. People will continue to study psi. Will anything ever be found? I don't know.   ",
            "date": "Answered April 11, 2016",
            "views": "167",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Arrigo Sacchi",
                    "user_href": "/profile/Arrigo-Sacchi-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carlos Pruitt",
                "href": "/profile/Carlos-Pruitt"
            },
            "answer_text": "Parapsychology has not produced the science to prove psychic abilities.  In addition to what others have said, I would like to add that the branch of psychology called anomalistic psychology is growing strong and will probably replace parapsychology.  The definition of anomalistic psychology is: \"the study of human behaviour and experience connected with what is often called the paranormal, with the assumption that there is nothing paranormal involved.\" source: Anomalistic psychology The rise of anomalistic psychology - and the fall of parapsychology? ",
            "date": "Answered April 12, 2016",
            "views": "323",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Arrigo Sacchi",
                    "user_href": "/profile/Arrigo-Sacchi-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Malcolm Sargeant",
                "href": "/profile/Malcolm-Sargeant"
            },
            "answer_text": " Psychology  is a science, Parapsychology is pseudoscience.  ",
            "date": "Answered April 11, 2016",
            "views": "217",
            "upvotes": " View 1 Upvoter "
        }
    ]
}