{
    "title": "Are emission spectra and atomic spectra the same? - Quora",
    "tags": [
        "Spectra",
        "Spectroscopy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vikram Joshi",
                "href": "/profile/Vikram-Joshi-23"
            },
            "answer_text": "Yes. (The wavelength of the light absorbed and the light emitted are same. The spectra looks different which we’ll discuss at the last). First let’s see what these terms mean. I’m assuming you’re referring to the atomic absorption spectra when you mean the atomic spectra. So atomic absorption spectra is one where the outermost electron absorbs energy ( which is less than the ionisation enthalpy) and gets transferred to another outer shell. This is said to be an excited state. The absorption is such that only the light of that wavelength will be absorbed, whose energy is sufficient to shift the electron into the next orbit. Any energy less than that and the electron just ignores it. Now, to lose this excess energy, it emits photons of characteristic wavelength. This gives rise to your atomic emission spectra. So, if there’s no external source for the electron to gain energy, it will give away the energy that it has previously absorbed from transitioning from the Ground State to the Excited State. TL;dr- Energy required for absorption = Energy given out. As E=hc/lambda, atomic emission is same as that of atomic absorption. Regarding the difference, in absorption spectra, your background will be black. In emission spectra, your background will be coloured. It looks something like this -  Hope you’ve understood it. Peace. ",
            "date": "Answered July 16, 2018",
            "views": "201",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aditi Gupta",
                    "user_href": "/profile/Aditi-Gupta-1704"
                },
                {
                    "user_id": "Chinmay Jogdeo",
                    "user_href": "/profile/Chinmay-Jogdeo-2"
                },
                {
                    "user_id": "Punit Begani",
                    "user_href": "/profile/Punit-Begani"
                }
            ]
        }
    ]
}