{
    "title": "Are there any institutions in india to pursue planetary science? - Quora",
    "tags": [
        "Higher Education in India",
        "Planetary Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Manish Selal",
                "href": "/profile/Manish-Selal"
            },
            "answer_text": "If by Planetary Science you mean space science then is of various types: Astronautics/Space TravelAstrophysicsBiology of Other PlanetsGalactic ScienceNon-Earth Planetary ScienceSpace ColonizationSpace DefenseStellar Science A B.Sc or a Bachelor of Engineering degree is required for advanced studies in Planetary sciences.The percentage of marks vary from institute to institute but ,you can expect the minimum percentage for admission to a good institute to start from 55%.As for competitive exams, it also depends from institute to institute.However, clearing entrance exams( such as Joint Entrance Screening Test for advanced course or UGC NET for teaching) is required for post graduate level or Research level course.There are lot of institutes for pursuing planetary science in India. few government institutes are there i am familiar with only two of them. these two are very popular and also have their particular reputation in this field. Indian Institute Of Space Science And Technology -   (Hindi: भारतीय अंतरिक्ष विज्ञान एवं प्रौद्योगिकी संस्थान) (IIST) is a government-aided institute and deemed university for the study and research of space science, located at Valiamala, Thiruvananthapuram, Kerala. It is the first university in Asia to be solely dedicated to the study and research of Outer space. it was set up by ISRO. A P J Abdul Kalam was chancellor of this institute. it offers regular engineering undergraduate, postgraduate and doctorate programmes with focus on space science, technology and applications. University Of Allahabad- The Department of Earth and Planetary Sciences (DEPS) was established in the year 1985. It is a FIST-sponsored Level-II department recognized by the Department of Science and Technology, Govt. of India.  The DEPS is known for its scientific contributions in frontier areas of research in Earth and Planetary Sciences in India and abroad.The adequate research facilities in Earth and Planetary Sciences, A.U. are available in the Department and our University facility to nurture budding Earth and Planetary scientists to purse their studies and research.  The students of this Department have excelled in teaching, research and industry in India and abroad. Various Short Courses and Workshops in Earth and Planetary Sciences and Applied Geo science are conducted by the Department from time to time. This Department is visited by reputed scientists from India and abroad to teach, conduct collaborative research and interact with students in evolving areas of Earth and Planetary Sciences.       Courses provided- M. Sc. (Applied Geology) 4 semesters (Two years)B. Sc. (Mathematics, Physics, Geology) (Three Years)D. Phil.No. of Seats M. Sc. (Applied Geology):15B. Sc.  (Mathematics, Physics, Geology): 38D. Phil.: 6I know about one more The Indian Planetary Society- scientific and industrial research organisation by the government of India. recipient of national award for best efforts in science & technology popularization.  There are two institutes affiliated by this organisation- Charotar Institute Of Science & Technology.Mohanbhai I. Patel Institute of Astronomy & Astrophysics.(MIPIAA).Further more institutes such as- Gujarat University.PG Diploma in Space Science and Applications - Department of Physics, Electronics & Space Science, School of Sciences,Anda Univhrersity offer Post-Master Diploma course in Space Sciences.MSc Space Physics (3yrs). Eligibility: BSc. Diploma in Space Science & Tech. Eligibility: MS (Phs)/MScTech with electronics.MP Birla Planetarium.PG Diploma in Astronomy & Planetary Sciences.Indian Institute of Astrophysics, Koramangala, Bangalore 560034. PhD in Astronomy and Astrophysics, Post-doctoral Fellowships. (http://www.iiap.ernet.in).JNTU College of Engineering, Hyderabad.MSc (Tech) Space Physics).Research Programmes in Astrophysics & Astronomy (Radio Astronomy & Astrophys, Theoretical Phys & Astrophys.Osmania University.MSc (Astronomy)Punjabi University.PG Diploma in Space Sciences.Indian Institute of Science.B.Tech. in AerospaceThis is not completely my answer it is a summarization of details those i have searched regarding your question. I hope these details will help you.. ",
            "date": "Answered April 26, 2016",
            "views": "5",
            "upvotes": " View 23 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mitalee Chavan",
                    "user_href": "/profile/Mitalee-Chavan"
                },
                {
                    "user_id": "Divyanshu Tiwari",
                    "user_href": "/profile/Divyanshu-Tiwari-45"
                },
                {
                    "user_id": "Ragadeepthi",
                    "user_href": "/profile/Ragadeepthi"
                },
                {
                    "user_id": "Asmi Jain",
                    "user_href": "/profile/Asmi-Jain-13"
                },
                {
                    "user_id": "Jonathon Dobson",
                    "user_href": "/profile/Jonathon-Dobson"
                },
                {
                    "user_id": "Akshay Kumar",
                    "user_href": "/profile/அக்ஷய்-குமார்-Akshay-Kumar"
                },
                {
                    "user_id": "Sanjay Nath",
                    "user_href": "/profile/Sanjay-Nath-52"
                },
                {
                    "user_id": "Khusi Hazra",
                    "user_href": "/profile/Khusi-Hazra"
                },
                {
                    "user_id": "Srishtishree Mahapatra",
                    "user_href": "/profile/Srishtishree-Mahapatra"
                },
                {
                    "user_id": "Trupti Chaudhary",
                    "user_href": "/profile/Trupti-Chaudhary-6"
                },
                {
                    "user_id": "Chlm Chlm",
                    "user_href": "/profile/Chlm-Chlm"
                },
                {
                    "user_id": "Selva Kumar",
                    "user_href": "/profile/Selva-Kumar-349"
                },
                {
                    "user_id": "Vivek Patel",
                    "user_href": "/profile/Vivek-Patel-15"
                },
                {
                    "user_id": "Viku Kapruwan",
                    "user_href": "/profile/Viku-Kapruwan"
                },
                {
                    "user_id": "Swati Gupta",
                    "user_href": "/profile/Swati-Gupta-132"
                },
                {
                    "user_id": "Sateshwari Selal",
                    "user_href": "/profile/Sateshwari-Selal"
                },
                {
                    "user_id": "Mickey643",
                    "user_href": "/profile/Mickey643"
                },
                {
                    "user_id": "Pooja Selal",
                    "user_href": "/profile/Pooja-Selal-1"
                },
                {
                    "user_id": "Ritesh Shukla",
                    "user_href": "/profile/Ritesh-Shukla-45"
                },
                {
                    "user_id": "Satyavrat Gaur",
                    "user_href": "/profile/Satyavrat-Gaur-1"
                },
                {
                    "user_id": "Spandan Pandita",
                    "user_href": "/profile/Spandan-Pandita"
                },
                {
                    "user_id": "Rohit Negi",
                    "user_href": "/profile/Rohit-Negi-78"
                },
                {
                    "user_id": "Pavan",
                    "user_href": "/profile/Pavan-293"
                }
            ]
        }
    ]
}