{
    "title": "Are renewable energy technologies really green? - Quora",
    "tags": [
        "Clean Technology",
        "Energy Sustainability",
        "Renewable Energy",
        "Sustainable Technology",
        "Alternative Energy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rob Harris",
                "href": "/profile/Rob-Harris-134"
            },
            "answer_text": "No easy answer as there are several measures of greenness. Hydro energy has an impact on river systems that needs to be at least partially mitigated. Tidal energy can be harvested, but again other considerations like impacts on fisheries and other users of the coastal shoreline are relevant. Wind energy is relatively okay in terms of its environmental impacts, and increasingly environmental cost of production. It does however have a tendency to impact on migrating birds if turbines are located on migration routes. Bio fuel production uses up either food growing land and water, which is increasingly scarce or impacts natural habitat and biodiversity. Biofuel is therefore a niche solution, but can be relatively cheap, efficient and energy rich - particularly important for transport, where at present there are few alternative fuels/ energy sources. Energy from waste is an obvious solution for stand alone small industrial operations and urban centres, particularly if they are already producing methane. Use of solar or other energy source to generate hydrogen fuel could be a low impact solution that would significantly lower carbon emissions as well. Again, the issue is finding an energy source to generate energy - work in progress. Old generation nuclear power plants are relatively energy efficient, but have a big disposal problem so their lifetime environmental cost is high, including their initial construction cost in terms of carbon emissions. New generation plants based on thorium are not yet in production and we aren’t yet sure of the initial carbon emission cost of construction. Use of deep earth temperature differentials on a heat pump principle has real potential for being both efficient and very low in carbon emissions. Ordinary geothermal energy production is relatively cheap and efficient, but found in few places and it has limits on how much a field can be utilised - it suits small population areas like Iceland. Alternatives to fossil fuels as a rule cost in terms of the carbon emission debt when creating the generating and storage equipment. But in general the environmental cost decreases over time as the materials and methods of producing equipment become more efficient and the methods of energy concentration and distribution become more and more efficient, as is occurring with solar at present. The least impact is generated by replacing existing plant and equipment over time as it wears out with much more efficient plant and equipment that uses less energy - likewise the use of insulation in housing. Of course older plant and equipment should ideally be reused or recycled if that is reasonably efficient in energy terms - often it isn’t yet. Another relatively efficient means of gaining more useful energy is improving transmissions to minimize transition losses. This goes hand in hand with having better storage systems like battery banks. Unfortunately batteries are expensive in their environmental impacts. Reducing the amount of rare metals in batteries may improve the overall cost/benefit ratio over time. The main issues with any source of energy is that it costs to extract and use. Even though we think we have sophisticated technology we have a long way to go before we have low impact, high efficiency, low carbon energy sources available when we need them for the populations we have produced. If you want more information on technical efficiencies you might need to go to specialist websites and focus on phrases like energy efficiency and carbon emission sources. The whole field is an expanding one and work in progress. Taking away some of the advantages given to fossil fuel emitters may force the pace along a bit and concentrate everyone’s minds a little more to encourage innovation. ",
            "date": "Answered January 23, 2020",
            "views": "42",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tim Gard",
                "href": "/profile/Tim-Gard-1"
            },
            "answer_text": "They could be … but … Renewable energy as we see it today is an industry that is working with its hands tied behind its back. Think about this a moment. What happens to fossil fuels if renewable energy science comes to the front of the energy industry? The largest financial industry in the history of man will collapse! How could they compete with energy one tenth the cost of their product? Do you really think all these multi millionaires and billionaires will sit quietly while this happens? No. If you look into any of the large corporations pushing wind turbines, solar panels and nuclear energy, you will find huge amounts of fossil fuel investors who decide how these companies will run. And if anyone foolish enough to suggest a redesign that will make renewable free standing they will be thrown out of the board room, and will lose every dime they hold! Think you can change that? Forget it. Once I began talking with investors about new system designs, investors said to me, “It does not matter if your system works or not! If you start putting any serious pressure on this market you will be crushed by Big Oil one way or another, and I will lose every dime I put into it! I have money because I do not make risky investments!” I got the message. Its just fun for me now, I heard the drums. Quora is all I do now. Maybe someone will look at my designs in the future and use them. With my blessing. These people own you! And they will continue to own you as long as you sit and do nothing to change it! Maybe someday, but probably not without social collapse of the world governments as they stand today, will real workable energy be the next world energy source! ",
            "date": "Answered November 2, 2019",
            "views": "127",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Richard Petek",
                    "user_href": "/profile/Richard-Petek"
                }
            ]
        },
        {
            "author_info": {
                "name": "Glen McMillian",
                "href": "/profile/Glen-McMillian-2"
            },
            "answer_text": "Yes, absolutely, BUT renewable energy tech requires paying the entire cost up front, which is a lot….. and which makes it SEEM to be more expensive than conventional tech. But once built, a wind or solar farm runs fuel free for twenty to thirty years before it needs an overhaul job. Just think how much it costs to put gasoline in a car for twenty years, and you will then understand why renewable energy tech REALLY IS GREEN. NO air pollution, no oil, gas, and coal depletion or mining or drilling or hauling or spilling. No accidental fires, well maybe a very few, but not many. In the long run, renewable energy is cheaper, because we are paying a HORRIBLE environmental price due to depending on fossil fuels, and that price will get higher every year until we give them up. No wars about oil and gas. WWII was a RESOURCE WAR. The Axis powers started it MOSTLY in order to seize by force the natural resources, ESPECIALLY oil, that belonged to other countries. We Yankees have been fighting in the Middle East off and on for decades now because we HAVE TO HAVE ACCESS TO that oil……or did up until a little while back, and we will run SHORT AGAIN, in few years, because EVERY oil well and gas well eventually gives up to the point it can no longer produce enough to pay for the cost of maintaining it. ",
            "date": "Answered November 4, 2019",
            "views": "97",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Frank Zucco",
                    "user_href": "/profile/Frank-Zucco"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Reichard",
                "href": "/profile/David-Reichard-10"
            },
            "answer_text": "There are always trade-offs. The main reason that most people are interested in alternate energy is to avoid generating byproducts that cause global warming. To find out if a method is really “green”, one must have a complete picture of everything that goes into producing it, and everything that comes out, including unfortunate disadvantages that advocates don't like to mention. I carefully read any analyses that are critical of a method- that is where you can often hear about problems. Regular energy production using unsustainable resources may still work for a long time, but will eventually be depleted and then we will have to switch to some other methods. One can argue about overall costs and desirability, but the truth will out when someone actually uses those methods. For example, there enough wind farms that we can now begin to see how practical they are. The whole alternate energy situation is developing very rapidly. Experience and continued new developments will have critical influences on just how green the technology is. ",
            "date": "Answered November 4, 2019",
            "views": "79",
            "upvotes": " Answer requested by Shreya Sachdeva",
            "upvoters": [
                {
                    "user_id": "Brian Donovan",
                    "user_href": "/profile/Brian-Donovan-13"
                },
                {
                    "user_id": "Alex Van den Bossche",
                    "user_href": "/profile/Alex-Van-den-Bossche"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Petek",
                "href": "/profile/Richard-Petek"
            },
            "answer_text": "Are renewable energy technologies really green? Of course it is a mixed bag, but comparing to other technologies - absolutely yes. For hydro energy dams and plants have to be built, often it implies some flooding of some area and some earth work to make the river flow in another path. Solar panels have to be built, installed and and the end of their usable life partially recycled and partially disposed. Wind turbines have to be built - and they also won’t last forever. But comparing to everything else - yes, they are green. None of those has any emissions. No CO2, not anything else. Even comparing to nuclear energy which (as we all know) creates nuclear waste - which nobody wants. NIMBY syndrome. Wind turbines have some opposition too, but not nearly as much as nuclear power plants. So are they green? Well let’s put it that way - they are a lot greener than any alternative. ",
            "date": "Answered November 2, 2019",
            "views": "45",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Merv Gibson",
                    "user_href": "/profile/Merv-Gibson"
                },
                {
                    "user_id": "Gordon Stobie",
                    "user_href": "/profile/Gordon-Stobie"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bruce Ewing",
                "href": "/profile/Bruce-Ewing"
            },
            "answer_text": "Not most of them, no. Most “renewable” energy technologies produce no emissions while they are being used. However, to see whether something is truly “green” or not, you have to carefully observe its entire lifecycle — including the entire manufacturing process, typical “costs” of installation, and disposal costs. However, the most important question is: who is it that is telling you that a particular product is green? It’s the corporations that manufacture the product. Are they telling the whole truth? Probably not. It seems crazy to me that the part of the public that tends to distrust corporations the most is also the part of the public that is most gullible when it comes to believing in green energy technologies. ",
            "date": "Answered November 2, 2019",
            "views": "75",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stephen Fish",
                    "user_href": "/profile/Stephen-Fish-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Alder",
                "href": "/profile/Andrew-Alder-8"
            },
            "answer_text": "In that “green” is a political term and to a lesser extent so is “renewable”, yes, almost by definition. Or, if we think of “green” as simply meaning good for the environment and for humanity, which leaves out much of hydro, and “renewable”as simply meaning there’s no danger of the resource ever running out, which includes the better nukes, then yes, again renewable is green. But if we try to mix politics and reality, it gets rather confusing, as some politically green technologies aren’t really renewable, and some politically non-renewable technologies are really very green indeed. ",
            "date": "Answered November 2, 2019",
            "views": "25",
            "upvotes": " Answer requested by Shreya Sachdeva"
        },
        {
            "author_info": {
                "name": "John Hobson",
                "href": "/profile/John-Hobson-32"
            },
            "answer_text": "As technologies which do not consume fossil fuel, they should be, but it is not totally clear cut. Take nuclear fission. It emits no carbon dioxide during its operation but there a lot of carbon emissions associated with its construction and decommissioning, the processing of its fuel and the associated transport of that fuel and of the processing and transport of its waste. Then there is the problem with the radioactivity of that waste. You could argue that nuclear fission is not renewable, since uranium ore is consumed. But the same arguments would apply to nuclear fusion, apart from the radioactivity of its waste. ",
            "date": "Answered November 2, 2019",
            "views": "42",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Raymond Rapisand",
                "href": "/profile/Raymond-Rapisand-1"
            },
            "answer_text": "RE energy like any.other energy generating equipment contains various amounts of embedded carbon components. So no they are are.not 100 % green But since they burn no carbon fuel and have no emissions to produce energy they have a positive energy to carbon ratio. As they become more efficient the positive ratio improves. But the compenents of solar and wind include petroleum by products and . Rare earth.minerals and energy gonsuming processes. The good.news is that both have a positive EROEI that continues to get better. So they have positive ratio. ",
            "date": "Answered November 2, 2019",
            "views": "38",
            "upvotes": " Answer requested by Shreya Sachdeva"
        },
        {
            "author_info": {
                "name": "Bob Whitcombe",
                "href": "/profile/Bob-Whitcombe"
            },
            "answer_text": "Yes and no. On an absolute basis nothing is purely “Green”. On a relative basis, compared to coal as megabad - globally - but even worse for the local environment and people living nearby - and even natural gas - wind and solar are an order of magnitude “greener”. They are also a bit more labor intensive and thus contribute to a higher wage class of jobs than typical energy production jobs. ",
            "date": "Answered November 2, 2019",
            "views": "22",
            "upvotes": " Answer requested by Shreya Sachdeva"
        },
        {
            "author_info": {
                "name": "Dan Abraham Erlich",
                "href": "/profile/Dan-Abraham-Erlich"
            },
            "answer_text": "Most really are…. large wind farms have minimal environmental impact, birds can get killed by the rotating blades when they come in contact with them .. Large solar farms displace green space but generate power… I just drove half way cross Canada - I saw significant installations of both wind and solar farms… ",
            "date": "Answered November 2, 2019",
            "views": "23",
            "upvotes": " Answer requested by Shreya Sachdeva"
        },
        {
            "author_info": {
                "name": "Lynn Allan",
                "href": "/profile/Lynn-Allan-3"
            },
            "answer_text": "Renewables such as wind power, solar cells, hydro-electric, etc. aren’t as “green” as the perception most people have. Also, the USA electrical grid isn’t really ready for huge “farms” of windmills and solar panels out in the middle of nowhere. And Thx! for the A2A. ",
            "date": "Answered November 5, 2019",
            "views": "32",
            "upvotes": " Answer requested by Shreya Sachdeva"
        },
        {
            "author_info": {
                "name": "Liberto Pires",
                "href": "/profile/Liberto-Pires"
            },
            "answer_text": "Even if they are not yet 100% green definitely the renewable energies are the nearest sources of green energies available in our Planet. This comments include the technology to make the energy as green as possible. ",
            "date": "Answered November 21, 2019",
            "views": "10",
            "upvotes": " Answer requested by Shreya Sachdeva"
        },
        {
            "author_info": {
                "name": "Paul Smith",
                "href": "/profile/Paul-Smith-1636"
            },
            "answer_text": "Nothing is perfect, but they are much cleaner than fossil fuels and they are the cheapest form of power and getting cheaper every year. ",
            "date": "Answered November 3, 2019",
            "views": "17",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "David Koon",
                "href": "/profile/David-Koon-3"
            },
            "answer_text": "They are much greener than fossil fuels. For both categories, there will be C02 emissions from the building/manufacture/installation processes. ",
            "date": "Answered November 2, 2019",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Geoffrey Schoelles",
                "href": "/profile/Geoffrey-Schoelles"
            },
            "answer_text": "Depends on your agenda. Every crisis can be capitalized on. If you say the sky is falling enough times, some people will believe you. If billions of dollars are to made selling protective falling sky gear and government can justify new fees, licenses and taxes on those causing the sky to fall, then absolutly the sky IS falling ",
            "date": "Answered November 5, 2019",
            "views": "23",
            "upvotes": " Answer requested by Shreya Sachdeva"
        }
    ]
}