{
    "title": "Are jobless engineers depressed? - Quora",
    "tags": [
        "Unemployment Rate",
        "Engineers",
        "Unemployment",
        "Coping and Living with Depression",
        "Understanding and Improving Mental Health",
        "Depression",
        "Mental Health",
        "Engineering",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Balamurugan Sivaramakrishnan",
                "href": "/profile/Balamurugan-Sivaramakrishnan"
            },
            "answer_text": "Most of the engineer got depressed for not getting respectable job or undermining job working situation. Here i am talking about Indian Jobless people. Most of them trying any job which is not related to their studied branches as well as low salary behavior in small scale industries. Quality of engineers very poor another one of the reasons to get best job as well as Indian produces Quantity of Engineer with out Quality. I strongly believe that which is the , main reasons for AICTE and high education department as well as state policy to open more and more colleges without any facilities. All the Engineers expecting white color job with high salary rather than work hard after completing their degree. Improve the Diversity of Industry open to all state , district and government start-up policy to balanced in all places. I hope once if any branches booming like IT job, all are choosing only that course rather than other coursed. Now i come to depression side, If not getting proper position or job they will get more depression and adjust their life style and also thinking wrong or short cut methods to become quick come up. Depression also lead to stress, frequent masturbating and try to do homosexuality, or addict drinking , smoking, and away from society etc…. I concludes , yes most of them struggle to deal depression and which is extended to settled their age shifted to nearly 30 years , so another problem started in life so on….. ",
            "date": "Answered October 8, 2019",
            "views": "172",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shashikumar V",
                    "user_href": "/profile/Shashikumar-V-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vandana Lekhi",
                "href": "/profile/Vandana-Lekhi"
            },
            "answer_text": "All jobless people are naturally depressed why only engineers . However this depression is for a temporary period and vanishes as soon as one finds employment . ",
            "date": "Answered October 5, 2019",
            "views": "32",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shashikumar V",
                    "user_href": "/profile/Shashikumar-V-12"
                }
            ]
        }
    ]
}