{
    "title": "Are there multiple definitions of science? If so, what are they? - Quora",
    "tags": [
        "Word Definitions, Terminology, and Jargon"
    ],
    "response": [
        {
            "author_info": {
                "name": "Xanda Schofield",
                "href": "/profile/Xanda-Schofield"
            },
            "answer_text": "Yes there are, though the two big ones are mostly distinguished by era (there's really one for the modern age plus some variants). I'm loosely following the structure of Google's definition of science here if you want to follow along: The oldest definition is just knowledge or a way of knowing something. It's not particular on relating to the physical world or using empirical methodologies; by this definition, astrology was as much science as astronomy. This might seem odd, but that's because the word science came from scientia, the word for \"knowledge\" in Latin. The current working definition is much less inclusive by default, as it specifically refers to the study of the physical world using rigorous logical and empirical means of verification. That is, science only allows something to be taken as knowledge if it can be repeatedly observed to be measurably consistently true, or, failing observation, if it can be logically concluded based off of reasoning and already-proven facts, leading to science being viewed as a \"building up\" of knowledge, as scientific facts rely on other scientific facts. The latter use of the word science is relatively young. For a while, the systematic process we think of as science was referred to as philosophy instead. Natural philosophy, the primary precursor of natural and physical science today, was the systematic buildup of knowledge of the natural world through observation and inference. Newton, for instance, would have been referred to by his colleagues as a natural philosopher. While the modern practice of science built up in the 1600's with the Scientific Revolution, it wasn't until the late 1700's to 1800's that science and scientist started commonly meaning what we commonly think of today, as specifically denoting use of observation, mathematics, logic, and the Scientific Method. Both definitions had an adjoining definition of science, which described a particular subfield or method of knowledge. Astrophysics is a science, in that it is a part of science at large which deals with a particular set of related questions. It should also be noted that a science can also be the science which applies to something. So, you could refer to the \"science of flight\", wherein flying itself is not a science, but rather denotes an area of related questions and answers in science. ",
            "date": "Answered June 9, 2014",
            "views": "221",
            "upvotes": "0"
        }
    ]
}