{
    "title": "Are machines that extract water from the atmosphere viable water sources? Is the water they make pure? - Quora",
    "tags": [
        "Atmospheric Water Generation",
        "Properties of Water",
        "Machines",
        "Atmospheric Sciences",
        "Drinking Water",
        "Chemistry of Everyday Life",
        "Science of Everyday Life",
        "Water",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Nierop",
                "href": "/profile/Peter-Nierop-1"
            },
            "answer_text": "I am not sure about viable. The concept that a condensor makes water is known long ago. Yet every single condensor on the market tells the same: do not drink the condense. It seems obvious why. Air is filled with virus, dust, metals, bacteria. Hence the condense water is commonly some gooey slim with foul smell. No doubt you can clean up the biological mess. However metal parts and virus material is too small for simple filters. Another issue is that of cost. Condensors will set you back a 100 or so bucks. Water cleaning is a lot more expensive, but should be 300 to 400 for decent quality. For that amount you can buy two or three years supply of clean and likely superior bottle water. Finally the issue is usage. Condense is natural in rainy areas in which already there is sufficient clean natural water. Not so in dry areas. You can not get condense out of say Arizona most of the year. I live in Abu Dhabi. There are nights where water clouds roll in creating an 80 or 90% humidity. But not during the days. In the end the simple truth is that science just works. And lack of science is what propels complete idiots to create and market things like self filling water bottles like Waterseeer. ",
            "date": "Answered October 24, 2020",
            "views": "49",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Trisha Douglas",
                    "user_href": "/profile/Trisha-Douglas-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ben Waters",
                "href": "/profile/Ben-Waters-49"
            },
            "answer_text": "As long as it is pure (has filters), then yes. It can be an energy intensive process but can output water nonetheless. It is the idea of a dehumidifier however the water that these produce is not actually pure or safe for human consumption. However atmospheric water generators have filters making the water safe for consumption.  However you’re going to need a lot of these ^ + energy plants to have cheap water production from them. So overall, all you need is energy to make water production solutions like desalination and ^ that to be viable; plus filters and pipes and everything else. Edit: Btw, just wanted to point out that the water has to be stored correctly; bacteria and contaminants are another issue. ",
            "date": "Answered October 24, 2020",
            "views": "109",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Peter Nierop",
                    "user_href": "/profile/Peter-Nierop-1"
                },
                {
                    "user_id": "Vincent Maldia",
                    "user_href": "/profile/Vincent-Maldia"
                },
                {
                    "user_id": "Svend-Erik Mortensgaard",
                    "user_href": "/profile/Svend-Erik-Mortensgaard"
                },
                {
                    "user_id": "Trisha Douglas",
                    "user_href": "/profile/Trisha-Douglas-1"
                }
            ]
        }
    ]
}