{
    "title": "Are there scientists whose discoveries are outside of their field? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Bill Hazelton",
                "href": "/profile/Bill-Hazelton-1"
            },
            "answer_text": "Yes indeed. Marie Curie was awarded two Nobel Prizes, one in Physics and one in Chemistry. Richard Feynman had a strong side interest in psychology. Many scientists get an interest outside their main area and bring an outside perspective to it, or they bring in an outside area to their own discipline. In my own case, while my core expertise is in geospatial science, I have also published historical articles, and am currently working on a couple of publications in nursing. ",
            "date": "Answered February 7, 2018",
            "views": "124",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aj.Raymond James Ritchie",
                "href": "/profile/Aj-Raymond-James-Ritchie"
            },
            "answer_text": "This is a product of the foolish idea that there are credentials for being a scientist. Actually there are none except the capacity to publish in international peer-reviewed journals. I write papers about anything I like. One day in Australia I showed some students a MS I had written on Human Red Blood Cells. They were confused: “But you are a Plant Scientist. Who gave you permission to write a paper on red blood cells”. I did not take them seriously. I flippantly told them that if you have a PhD you can write papers about anything you like. Instead of laughing they took in my answer quite seriously. What sort of students are universities producing these days? When you are all grown up you do not have to put up your hand to get permission to go to the toilet. Infantilization is rampant today. ",
            "date": "Answered February 6, 2018",
            "views": "265",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ashiv Hans Dhondea",
                    "user_href": "/profile/Ashiv-Hans-Dhondea"
                },
                {
                    "user_id": "Hans DeCastro",
                    "user_href": "/profile/Hans-DeCastro-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Collis",
                "href": "/profile/Bill-Collis-2"
            },
            "answer_text": "Absolutely! I have a degree in biochemistry but my atomic mass model is more accurate that any other. (says he modestly!) Atomic masses have been intensely investigated for the last 80 years so to succeed you really need new approaches. This is what an outsider can do. Sometimes the people in the field cannot see the wood for the trees. ",
            "date": "Answered February 6, 2018",
            "views": "51",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Weiss",
                "href": "/profile/Michael-Weiss-12"
            },
            "answer_text": "Well, there are many examples of scientific discoveries being made by accident. I suppose some of those would qualify as an “out of field” discovery. Here’s a list of ten such accidents. Thinking more about it, wouldn’t it be impossible for a scientist to make a discovery outside of their field without it being an accident? They’d have to be conducting research and experiments on a topic “outside of their field” to do so, but in that case…it would be their field. ",
            "date": "Answered February 6, 2018",
            "views": "290",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Matthew Oswald",
                "href": "/profile/Matthew-Oswald-3"
            },
            "answer_text": "Alfred Wegener was a meteorologist who discovered Continental Drift; the observation on which the theory of Plate Tectonics is based. ",
            "date": "Answered February 6, 2018",
            "views": "51",
            "upvotes": "0"
        }
    ]
}