{
    "title": "Are nebulas dangerous? - Quora",
    "tags": [
        "Nebulas",
        "Danger and Dangers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Neil Morrison",
                "href": "/profile/Neil-Morrison-14"
            },
            "answer_text": "This one is pretty dangerous - but she’s fictional…  This kind is going to have a combination of temperature, radiation and hard vacuum that will do you no good at all. But they are all at at a pretty safe distance…  So the major threat to your health is probably going to be if you have the misfortune to use the word “nebulas” within earshot of a swivel-eyed, dyed-in-the-wool, classical-trained, Latinist grammar-nazi! You could find yourself getting stabbed with a gladius; strangled with a laqueus; or beaten to death with all six volumes of Gibbon’s History of the Decline and Fall of the Roman Empire - all while being harangued with screams of “NEBULAE! It isn't nebulas - it’s bloody NEBULAE!!!!” Photo credits: Nebula from CBR - The World's Top Destination For Comic, Movie & TV news. Horsehead Nebula by Ken Crawford, CC BY-SA 3.0, File:Barnard 33.jpg ",
            "date": "Answered October 18, 2020",
            "views": "68",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Holly Herring",
                    "user_href": "/profile/Holly-Herring-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thomas Wm. Hamilton",
                "href": "/profile/Thomas-Wm-Hamilton"
            },
            "answer_text": "There are several types of nebulas. Planetary nebulas came into existence when a star went nova. Being nearby when that happened would be inadvisable. But otherwise there is no conceivable reason why anyone would think a nebula dangerous, unless extremely frightened by clouds. A nebula condensing to form a star and planets isn’t dangerous unless it forms a planet hosting flesh eating Znargs ",
            "date": "Answered October 20, 2020",
            "views": "8",
            "upvotes": " Answer requested by Baron Lin"
        },
        {
            "author_info": {
                "name": "Bill Sanders",
                "href": "/profile/Bill-Sanders-50"
            },
            "answer_text": "I don't have any idea what this question means. Nebulas are just area where there is a slightly higher concentrations of gas. They are created when a star ends and expels gas. The closest nebula is the Helix nebula. It is about 600 light years. Is is so far away that it couldn't be dangerous to us even if it wanted to. ",
            "date": "Answered October 17, 2020",
            "views": "45",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Arnav Katepallewar",
                "href": "/profile/Arnav-Katepallewar"
            },
            "answer_text": "First let me tell you what is a nebula. Nebula is giant cloud of dust and gas formed from the gas and dust thrown out by the explosion of a dying star, such as a supernova. We can say that nebula is not as such dangerous as it just an empty space where stars get formed. But it can be dangerous if our spaceship gets damaged in the area of a nebula! ",
            "date": "Answered October 19, 2020",
            "views": "9",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Simon Bridge",
                "href": "/profile/Simon-Bridge-1"
            },
            "answer_text": "Depends, what do you mean by “dangerous”. Nebulas can be very diffuse, so the Earth could fly through one without anyone noticing much. That count? Thing is, everything and anything is dangerous to some extent. ",
            "date": "Answered October 18, 2020",
            "views": "35",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Haynes",
                "href": "/profile/John-Haynes-8"
            },
            "answer_text": "I’m not sure where this question comes from, why anyone would think big clouds of dust or gas several hundred trillions of miles away would be dangerous. That’s all they really are, is clouds of dust and/or gas. ",
            "date": "Answered October 19, 2020",
            "views": "12",
            "upvotes": " Answer requested by Baron Lin"
        }
    ]
}