{
    "title": "As technology advances, will we eventually grow dependent on it to survive? - Quora",
    "tags": [
        "Survival",
        "Technology Trends"
    ],
    "response": [
        {
            "author_info": {
                "name": "Randy Crawford",
                "href": "/profile/Randy-Crawford"
            },
            "answer_text": "Yes, but that problem began long ago. The moment society formed and people began specializing their skills away from hunting and gathering, we became dependent on others for survival — at least a thousand years ago. Today the fraction of humans on this planet who can feed themselves and survive a year without shelter is small, maybe 10%? The extension of this question is, “Is our dependence on tech growing greater day-to-day even now — is the current generation even less likely to survive without it than our parents?” Yes, I think so. Fewer people today know how to learn or perform simple tasks without the internet than did the generation before. With the rise of the ‘Net, we’re losing the ability to communicate with each other directly and learn by interacting with others. And of course, we’re ever more dependent on external resources and services. How many people don’t know how to prepare a simple meal today from scratch ingredients? Or how to make or repair an essential tool used daily (clothes, appliances, car, or house)? Every time our routine is disrupted (heavy snowfall, power outage, flood, hurricane, etc), due to our increasing dependency on tech (and internet), people are likely to have their lives affected more than ever, since they know less than ever how to adapt to sudden change — something that was commonplace back when humans lived off the land and routinely went without food for days. ",
            "date": "Answered January 25, 2018",
            "views": "196",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vipin Nair",
                    "user_href": "/profile/Vipin-Nair-13"
                },
                {
                    "user_id": "John White",
                    "user_href": "/profile/John-White-363"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gary Puett",
                "href": "/profile/Gary-Puett"
            },
            "answer_text": "I think we have already grown dependent on technology for our survival. If for instance the Earth was struck by huge solar flare. Power and Communications would be almost instantly non-existent, newer machines controlled by computer would not run. Going forward in time with no power we would have no water, no sewer, food reserves will last only a few days. A desperate population would take desperate measures against their fellow human beings. This period will not last very long for the above reasons. Life as we know it would come to an end and most of the human race would be wiped out, except for small pockets here and there. This is just one brief explanation of one event there are others that could cause the same outcome. ",
            "date": "Answered January 25, 2018",
            "views": "153",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Neal Allan",
                    "user_href": "/profile/Neal-Allan-1"
                },
                {
                    "user_id": "John White",
                    "user_href": "/profile/John-White-363"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roger Gilmartin",
                "href": "/profile/Roger-Gilmartin"
            },
            "answer_text": "Yes. Remember in the day when the pocket calculator was invented? At first, while it was novel, you would add / subtract / multiply / divide using the calculator, but you would always run the numbers by hand to make sure the calculator’s result was correct. Over time, you accepted the calculator’s result without checking; next, when you did a math problem by yourself, you checked your work using the calculator. Now, sadly to say, some people are unable to do math in their heads without a calculator. If it wasn’t for the calculation for the amount of change you should receive after a cash transaction, the cashiers wouldn’t know how much to return to you. So the process you fear, is already happening. It will only get worse. ",
            "date": "Answered January 25, 2018",
            "views": "207",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tom Kitta",
                    "user_href": "/profile/Tom-Kitta"
                },
                {
                    "user_id": "Taylor Sun",
                    "user_href": "/profile/Taylor-Sun"
                },
                {
                    "user_id": "Neal Allan",
                    "user_href": "/profile/Neal-Allan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathan Ketsdever",
                "href": "/profile/Nathan-Ketsdever"
            },
            "answer_text": "Whats the longest you’ve gone without the internet since 2008?Whats the longest you’ve gone without a mobile phone since 2008?Have you gone longer than two weeks for either?We are unfortunately dependent now given the above. What would it take money wise for someone to pay you to stop using your mobile phone? Again, we’re dependent. ",
            "date": "Answered January 25, 2018",
            "views": "90",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jonathan Kolber",
                "href": "/profile/Jonathan-Kolber"
            },
            "answer_text": "We already are. Shut down any major aspect of it, and most of humanity would perish in short order. Our path forward is not to divorce from technology, but to further merge with it in a way that preserves individual dignity and autonomy, with stronger redundancy against mission-critical bugs, and protections against malware. ",
            "date": "Answered January 25, 2018",
            "views": "289",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rahul Vyas",
                    "user_href": "/profile/Rahul-Vyas-38"
                },
                {
                    "user_id": "David Pearce",
                    "user_href": "/profile/David-Pearce-18"
                },
                {
                    "user_id": "John Arceneaux",
                    "user_href": "/profile/John-Arceneaux-1"
                },
                {
                    "user_id": "Jeff Wilsbacher",
                    "user_href": "/profile/Jeff-Wilsbacher"
                },
                {
                    "user_id": "Joseph Ingram",
                    "user_href": "/profile/Joseph-Ingram-11"
                },
                {
                    "user_id": "Donnie Hill",
                    "user_href": "/profile/Donnie-Hill-3"
                },
                {
                    "user_id": "John White",
                    "user_href": "/profile/John-White-363"
                },
                {
                    "user_id": "Neal Allan",
                    "user_href": "/profile/Neal-Allan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jason Weatherford",
                "href": "/profile/Jason-Weatherford-1"
            },
            "answer_text": "Man has been dependent on technology to survive for a very long time. Using a rock as a tool was once considered technology. The wheel was a marvel of engineering at its time of invention. The steam engine led to the industrial revolution and so forth. The only reason man is on the top of the food chain is technology. ",
            "date": "Answered January 25, 2018",
            "views": "5",
            "upvotes": "0"
        }
    ]
}