{
    "title": "As we all know friction opposes relative motion, but I never understood why do they say relative not just motion? If I write just motion, why would it be wrong? - Quora",
    "tags": [
        "Friction",
        "Motion (physics)",
        "Classical Mechanics",
        "Relativity (physics)",
        "Physics of Everyday Life",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abhinav Singh",
                "href": "/profile/Abhinav-Singh-1585"
            },
            "answer_text": "Suppose a man at rest at T=0 , then after two seconds he starts running with an acceleration of 1m/s^2 .  Then from which force this acceleration came into existence.? That's “friction” which provides this acceleration and thus here the “ friction support the motion of the man” , but when you check this motion at contact point of man's foot and ground then-   (You can visualise that when we moves forward, our foot moves in backward direction.) From the above picture you can see that , the velocity of foot with respect to ground (i.e. relative velocity) is in -x direction , so as we know that- “Friction is a force which opposes relative motion or tendency of relative motion” Hence, here to oppose the relative motion ,friction acts in +x direction and provides the acceleration to the man. Remember that, “Friction may or may not opposes the motion but it always opposes relative motion” ",
            "date": "Answered October 24, 2020",
            "views": "85",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Siya Singh",
                    "user_href": "/profile/Siya-Singh-106"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ajay Shah",
                "href": "/profile/Ajay-Shah-127"
            },
            "answer_text": "When you write motion, you are assuming that one of the surfaces is stationary. Relative motion is a much more generalised term where you don't have to assume anything. It's more scientific also ",
            "date": "Answered October 23, 2020",
            "views": "28",
            "upvotes": "0"
        }
    ]
}