{
    "title": "At any given time, how much of Earth is in daytime, and how much is in nighttime? - Quora",
    "tags": [
        "Daytime",
        "Night",
        "Earth (planet)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Potter",
                "href": "/profile/Mark-Potter-78"
            },
            "answer_text": "The simple answer would be half day and half night. But it depends on what you call day and night. The first thing is the sun is not a point source. The sun is massive, so even from over 90 milion miles away we can see that it is a circle of light, with an angular diameter of about 0.5 degrees. The earth rotates every 24 hours, so the sun appears to do a full circle of 360 degrees in 1440 minutes, and therefore moves 0.25 degrees per minute. It therefore takes two minutes from the leading edge of the sun reaching your horizon to the back edge reaching it. Therefore the sun is visible, in whole or part, for longer than it is hidden. About 4 minutes per day. So if day is defined as being able to see the sun, then slightly more than half of the Earth can see some part of it at any time: 50.12%. More importantly, there is a period when no part of the sun is directly visible above the horizon, yet it still provides enough light that you wouldn't call it nighttime. This is commonly called twilight: “Twilight on Earth is the illumination of the lower atmosphere when the Sun itself is not directly visible because it is below the horizon. Twilight is produced by sunlight scattering in the upper atmosphere, illuminating the lower atmosphere so that Earth's surface is neither completely lit nor completely dark. The word twilight is also used to denote the periods of time when this illumination occurs.” Three periods of twilight are defined: civil twilight (brightest)nautical twilight, andastronomical twilight (darkest).Dawn occurs some considerable time before the sun is even partly visible. Astronomical twilight occurs and can produce enough light that we might say it is no longer night time. These periods are defined by the angle of the sun below the horizon, civil twilight is 6 degrees below, nautical twilight is 12 degrees and astronomical is 18 degrees. So we can estimate that these occur 24, 48 and 72 minutes before the sun is visible. “Lawmakers have enshrined the concept of civil twilight. Such statutes typically use a fixed period after sunset or before sunrise (most commonly 20–30 minutes), rather than how many degrees the sun is below the horizon. Examples include the following periods: when drivers of automobiles must turn on their headlights (called lighting-up time in the UK); when hunting is restricted; when the crime of burglary is to be treated as nighttime burglary, which carries stiffer penalties in some jurisdictions. “The period may affect when extra equipments, such as anti-collision lights, are required for aircraft to operate. In the US, civil twilight for aviation is defined in Part 1.1 of the Federal Aviation Regulations (FARs) as the time listed in the American Air Almanac.” Nautical dawn is so-called because before this time sailors cannot navigate via the horizon at sea as they cannot clearly see the horizon. It is less important now as they navigate by GPS and radar. Traditionally most military attacks at “dawn\" occur at nautical dawn, ie. when the sun is still 12 degrees below the horizon. Soldiers advancing can see the ground in front of them where they are walking, soldiers defending find it difficult to identify targets which are far away. Astronomical dawn is so-called because there may be some light in the sky from the sun, but not sufficient to make it impossible for our eyes and a camera to see the stars. Astronomical dawn has less value for most of us, because light pollution means it becomes difficult to tell the difference between night time and astronomical twilight. In a city or town it is never completely dark even at night. The time for the sun to move the angles mentioned is calculated at the equator on a solstice. Depending where you are in the world and the date compared to the solstices, then the time will vary, quite considerably. It can be very short or very long. In the Northern hemisphere, as an example, the time between astronomical dawn and the sun being visible gets longer during the spring/summer. And the sun being visible gets earlier. This effect is exaggerated the further from the equator you are. Just like the folk above the Arctic Circle can see some part of the sun for 24 hours, it never drops completely below the horizon (“midnight sun\"), many people in the world experience the sun never going more than 18 degrees below the horizon in spring/summer. The effect of this is that there is no nighttime, true darkness. Much of Northern Europe, including the UK experiences this. Around the time of the summer solstice, twilight lasts from sunset to sunrise. It can be difficult to sleep because it remains hot during the night and never gets completely dark. Most of us need blackout blinds or thick curtains. Of course, while this is happening in Northern Europe, it is autumn/winter in the southern hemisphere, and far enough south they are having very short days, and below the Antarctic Circle they will have no sunset or sunrise. Nevertheless, they may still experience some twilight hours, so there is not complete darkness for 24 hours. The effect of this is that more than 50% of the Earth’s surface is between civil dawn and civil dusk, 53.3%. And 56.7% between nautical dawn and nautical dusk. As mentioned, astronomical twilight has little effect for most people, but 60% of the Earth is currently between astronomical dawn and astronomical dusk. Quotes from: Twilight - Wikipedia ",
            "date": "Answered November 30, 2018",
            "views": "12",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jacob Bieker",
                    "user_href": "/profile/Jacob-Bieker-1"
                },
                {
                    "user_id": "William J Hughes",
                    "user_href": "/profile/William-J-Hughes-1"
                }
            ]
        }
    ]
}