{
    "title": "Besides cellulose, what is in paper? - Quora",
    "tags": [
        "Cellulose",
        "Paper",
        "Manufacturing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pierre Smith",
                "href": "/profile/Pierre-Smith-17"
            },
            "answer_text": "Before the industrialisation of paper production the most common fibre source was recycled fibres from used textiles, called rags. The rags were from hemp, linen and cotton.[6] A process for removing printing inks from recycled paper was invented by German jurist Justus Claproth in 1774.[6] Today this method is called deinking. It was not until the introduction of wood pulp in 1843 that paper production was not dependent on recycled materials from ragpickers.[6] To make pulp from wood, a chemical pulping process separates lignin from cellulose fibres. This is accomplished by dissolving lignin in a cooking liquor, so that it may be washed from the cellulose; this preserves the length of the cellulose fibres. Paper made from chemical pulps are also known as wood-free papers–not to be confused with tree-free paper; this is because they do not contain lignin, which deteriorates over time. The pulp can also be bleached to produce white paper, but this consumes 5% of the fibres; chemical pulping processes are not used to make paper made from cotton, which is already 90% cellulose.  The microscopic structure of paper: Micrograph of paper autofluorescing under ultraviolet illumination. The individual fibres in this sample are around 10 µm in diameter. There are three main chemical pulping processes: the sulfite process dates back to the 1840s and it was the dominant method extent before the second world war. The kraft process, invented in the 1870s and first used in the 1890s, is now the most commonly practiced strategy, one of its advantages is the chemical reaction with lignin, that produces heat, which can be used to run a generator. Most pulping operations using the kraft process are net contributors to the electricity grid or use the electricity to run an adjacent paper mill. Another advantage is that this process recovers and reuses all inorganic chemical reagents. Soda pulping is another specialty process used to pulp straws, bagasse and hardwoods with high silicate content. Paper - Wikipedia ",
            "date": "Answered August 4, 2018",
            "views": "49",
            "upvotes": "0"
        }
    ]
}