{
    "title": "Bottles of Hydrogen Peroxide say '3%', but what exactly does that mean? What is the molarity of 3% H2O2? - Quora",
    "tags": [
        "Hydrogen Peroxide",
        "Hydrogen",
        "Chemistry of Everyday Life",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matt Harbowy",
                "href": "/profile/Matt-Harbowy"
            },
            "answer_text": "All five of the other answers are “wrong”, as I detail in my answer to What is 3, 12 and 35% hydrogen peroxide in molar concentration? Not wrong, in the sense that they did something wrong with their equation, but because they assumed the reported concentration on the bottle is exactly what it says it is. And if you read my answer to What chemical do scientists fear the most, you know that just because a bottle is labeled as such doesn’t mean that’s actually what’s in it. Hydrogen peroxide, at any concentration, isn’t stable and slowly “leaks” oxygen in the reaction 2 H2O2 -> 2H2O + O2 So what you need is a procedure to actually quantify how many moles of hydrogen peroxide is present[1] . And if you look into that procedure, you’ll see it can be done with permanganate titration, and even permanganate isn’t stable, either- you need to standardize and normalize your solutions of potassium permanganate, or make them fresh from pure solid. You can get a rough measure of e.g. 3% H2O2 being approximately 0.9M, and you could also round up and call it a “1M” solution for the purpose of estimation. But, dammit, don’t assume that “0.88” or “0.9” or “1.0” is the right answer for any of it. It’s invariably wrong. In all likelihood[2], it is made in an approximate concentration of 25% to 35% and diluted one-to-ten without too strict controls over exactly what the final concentration is. And it’s not always pure, either- it may have some stabilizers or other preservatives in it, like acetanilide[3]. And then it rolls off the line, and immediately begins to lose oxygen. Footnotes[1] Permanganometric titration of hydrogen peroxide[2] https://nzic.org.nz/app/uploads/2017/10/1E.pdf[3] Hydrogen peroxide solution 323381",
            "date": "Answered November 12, 2019",
            "views": "32",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Claudio Giomini",
                "href": "/profile/Claudio-Giomini"
            },
            "answer_text": "It means that 3% of the solution (as weight) is made by H2O2. The rest is H2O (unless there is some stabilizer, that, however, should not affect the composition of the solution significantly). To know the molarity of H2O2 in that solution, you should know the density (aka specific gravity) of the solution. Since the large majotity of it is water, assume, as a first approximation, that the density is 1000 g/Liter. So, 3% of H2O2 means there are 30 g H2O2 in 1000 g of solution, that is in 1 liter of solution. Now, divide 30 g/L by the molar mass of H2O2, which is 34 g/mol, as easily obtainable from the molecular formula. The result is about 0.9 mol/L, which expresses the concentration of H2O2 in the solution under the form of molarity. Do not give the result more significant digits, since the starting one (i. e., 3%) had only one, and also keeping into account the approximations employed in the calculation. ",
            "date": "Updated June 18, 2019",
            "views": "86",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Antonio Daniels",
                    "user_href": "/profile/Antonio-Daniels-3-1"
                },
                {
                    "user_id": "Nomal Jamon",
                    "user_href": "/profile/Nomal-Jamon"
                },
                {
                    "user_id": "Garrett S",
                    "user_href": "/profile/Garrett-S-4"
                },
                {
                    "user_id": "Connor Scott",
                    "user_href": "/profile/Connor-Scott-127"
                },
                {
                    "user_id": "Steven Haddock",
                    "user_href": "/profile/Steven-Haddock"
                },
                {
                    "user_id": "Michael Garlick",
                    "user_href": "/profile/Michael-Garlick-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vasudevan Ans",
                "href": "/profile/Vasudevan-Ans"
            },
            "answer_text": "Concentration of H2O2 is expressed in terms ofVolume StrengthPercentageNormality andMolarityThe four type of concentration are inter- related as given below.1M H2O2 = 2N H2O2 = 11.2- Volume = 3.4% H2O2So 3% H2O2= 3/3.4 x 1= 0.8824 M 3%3% H2O2 = 11.2 x 3/3.4= 9.882- Volume SOLUTION.××××××××××××××××××××××××××××××××××× ( THEORETICAL EXPLANATION)Molecular weight of H2O2= 343% SOLUTION of H2O2 means, the Solution contains 3- g of Hydrogen peroxide in 100- ml of solution.(or) 30- g of H2O2 in 1000- ml of the solution.Therefore Molarity of the solution =30/34 = 0.8824 M============================== H2O2 =======> H2O + ½ O2Therefore 34- g of H2O2 liberates ½- mole of oxygen= 11.2- litres of oxygen at STP.So 11.2- volume= 1M H2O2 &11.2/2 = 5.6- volume = 1N H2O2OK××××××××××××××××××××××××",
            "date": "Answered June 20, 2020",
            "views": "663",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Eduardo Dequilla",
                "href": "/profile/Eduardo-Dequilla"
            },
            "answer_text": "3% weight per/volume of H2O2 means that for each 100 mL of solution there are 3 g of hydrogen peroxide. The molarity is obtained as moles of solute in 1 L (1000 mL) of solution. In your case, 1 L of solution contains 30 g of H2O2 (molar mass = 34.01 g/mol). Therefore, the molarity is (30 g / 34.01 g/mol) = 0.88 M. ",
            "date": "Answered June 5, 2019",
            "views": "27",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Nomal Jamon",
                    "user_href": "/profile/Nomal-Jamon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edward Willhoft",
                "href": "/profile/Edward-Willhoft"
            },
            "answer_text": "3% w/v is 30 g per litre of solution. The molecular weight of H2O2 is 34. Therefore the molarity, defined as the number of moles in a litre of solution, is 30/34 or 0.88 ",
            "date": "Answered June 6, 2019",
            "views": "979",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nomal Jamon",
                    "user_href": "/profile/Nomal-Jamon"
                },
                {
                    "user_id": "Suresh Baabu",
                    "user_href": "/profile/Suresh-Baabu-5"
                }
            ]
        }
    ]
}