{
    "title": "Can an object have kinetic energy as well as potential energy simultaneously? - Quora",
    "tags": [
        "Potential Energy",
        "Kinetic Energy",
        "Energy (physics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "RP Deshpande",
                "href": "/profile/RP-Deshpande"
            },
            "answer_text": "Yes, an object can have both kinetic and potential energy. A plane in flight has kinetic energy due to its velocity, and has potential energy due to its height. A stone vertically throw up is another example. Its kinetic energy gradually gets converted to potential energy as it goes up, and again the reverse as it comes down. You will several examples nature and daily life if you just look around, most common being the birds you see around. ",
            "date": "Answered October 28, 2018",
            "views": "711",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Fred Talbot",
                "href": "/profile/Fred-Talbot-2"
            },
            "answer_text": "YES it is. The rocket is an example The engines accelerate the rocket - kinetic energy is increasing It’s direction is upward, away from the earth - it’s potential energy is increasing This energy, of course, comes from the chemical energy of the fuel. Cyclone Cyd ",
            "date": "Answered October 25, 2019",
            "views": "133",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nrusingha Behera",
                "href": "/profile/Nrusingha-Behera-1"
            },
            "answer_text": "The easiest way to ascertain, as both the energies have the mutual inclusion in existence,the later by its position with respect to another mass in position and the former by its motion relative to the frame containing both of them. ",
            "date": "Answered October 28, 2018",
            "views": "209",
            "upvotes": "0"
        }
    ]
}