{
    "title": "Can scientists ever be certain about their discoveries? - Quora",
    "tags": [
        "Philosophy of Science",
        "Discoveries",
        "Scientists",
        "Scientific Research"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Lucas",
                "href": "/profile/Paul-Lucas-23"
            },
            "answer_text": "Yes and no. Strictly speaking, science cannot “prove”. Science uses 2 forms of logic: inductive and deductive. Neither can “prove” — strictly speaking. Deductive logic can absolutely disprove. So the only “certain” theories in science are the ones that have been falsified: the earth is not flat, the planets and sun do not orbit the earth, proteins are not the hereditary material, there was never a world-wide flood, etc. OTOH, facts are repeated observations. Those are also “discoveries”. Are we certain bone marrow contains mesenchymal stem cells? Yes. Are we certain bone marrow contains hematopoietic stem cells? Yes. Are we certain that HSCs can reconstitute bone marrow after chemotherapy for leukemia? Yes. Are we certain that glucose is metabolized to carbon dioxide and oxygen? Yes. Are we certain that the Bernoulli Principle will provide lift for an airplane? Yes Bernoulli's Principle - Lesson Notice that the last one is a theory. Yet everyone is so certain it is correct that millions of people fly on an airplane every day. No one thinks the discovery is uncertain enough to suggest we give up air travel. For many theories, we have tested them so much that, although strictly speaking we can’t “prove” them, we are certain enough of them to use them as facts in looking for new discoveries. IOW, they are proved beyond any reasonable doubt. Heliocentrism is proved to that extent that we consider it certain, and use it to plot the courses of spacecraft to our moon and more distant planets. That the spacecraft actually arrive at their destination becomes more evidence that the theory is correct. “DNA exists in a double helix” is another theory that is “certain”. Molecular biologists use that constantly to get new discoveries of the enzymes and other mechanisms for DNA replication, epigenetics, etc. Now, you can cherry-pick and misinterpret data to deny any particular theory you want. John Doner gives and excellent example of that. That graph is a composite put together by Nasif Nable based on work by others. Notice that neither temperature nor CO2 have a scale. If CO2 had a scale it would not be linear. The Ordovician has a CO2 of 2240 ppm but the Triassic has 210 ppm. The height at the Ordovician is not 10x the level of the Triassic. Temperature is given as delta temp, not absolute. Nable has manipulated the data to get the effect he wants. When the data is looked at correctly people do see a correlation between CO2 levels and temperature: https://www.geolsoc.org.uk/~/media/shared/documents/policy/Statements/Climate%20Change%20Statement%20final%20%20%20new%20format.pdf?la=en ",
            "date": "Answered May 16, 2019",
            "views": "233",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Susan Cook",
                    "user_href": "/profile/Susan-Cook-19"
                },
                {
                    "user_id": "Mohammed Alshakhas",
                    "user_href": "/profile/Mohammed-Alshakhas"
                },
                {
                    "user_id": "William Mackintosh",
                    "user_href": "/profile/William-Mackintosh-1"
                },
                {
                    "user_id": "Michael Soso",
                    "user_href": "/profile/Michael-Soso"
                },
                {
                    "user_id": "Julien Gravier",
                    "user_href": "/profile/Julien-Gravier"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tony Abdullah",
                "href": "/profile/Tony-Abdullah"
            },
            "answer_text": "Yes indeed. Scientists go to great efforts in order to be certain as regards both discoveries and the theories leading to them whatever the field in question. In medical sciences, for example, double-blind experiments are carried out, often using statistics. The whole procedures are expensive and time consuming. The next time you take a pill, pause a moment, and give thanks for such a wondrous product of human ingenuity. In physics Quantum Mechanics has never, never, never been shown wrong and is responsible for major technological innovations for the benefit of fairly well all mankind. Its just the complexity of the calculations that puts my nose a bit out of joint. So it is that for scientific discoveries those adept in their field are damn near well certain as certainty can ever get. Regards. ",
            "date": "Answered May 8, 2019",
            "views": "239",
            "upvotes": " Answer requested by William Mackintosh",
            "upvoters": [
                {
                    "user_id": "George Branagh",
                    "user_href": "/profile/George-Branagh-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Doner",
                "href": "/profile/John-Doner-7"
            },
            "answer_text": "No. Even with 100% concensus, science has many times been proven wrong. The ancients believed in the Ptolemaic Universe, where the objects in the heavens rotated around the Earth. That was accepted by everybody. Then Copernicus came along and suggested that the objects in the sky rotated about the sun. That took a long time to catch on, but it shows that even a 100% concensus can be wrong. Also, at one time all scientists believed that heavier objects fell faster than lighter ones. Galileo proved that to be false with a very simple experiment. Today, we have scientists who think the tiny bit of CO2 put in the atmosphere by man is heating the planet. The following graph plainly shows that CO2 and temperature are unrelated.  ",
            "date": "Answered May 8, 2019",
            "views": "126",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sudipta Roy",
                    "user_href": "/profile/Sudipta-Roy-1"
                },
                {
                    "user_id": "Bikram Singh",
                    "user_href": "/profile/Bikram-Singh-234"
                },
                {
                    "user_id": "Francisco Toro",
                    "user_href": "/profile/Francisco-Toro-1-1"
                },
                {
                    "user_id": "Scott Currier",
                    "user_href": "/profile/Scott-Currier"
                },
                {
                    "user_id": "Geremy Lawrence",
                    "user_href": "/profile/Geremy-Lawrence-1"
                },
                {
                    "user_id": "Ian Carmichael",
                    "user_href": "/profile/Ian-Carmichael-10"
                },
                {
                    "user_id": "Stelios Pap",
                    "user_href": "/profile/Stelios-Pap-10"
                },
                {
                    "user_id": "Jim Mims",
                    "user_href": "/profile/Jim-Mims"
                },
                {
                    "user_id": "Michele Shipley Klika",
                    "user_href": "/profile/Michele-Shipley-Klika"
                },
                {
                    "user_id": "Patrick Stott",
                    "user_href": "/profile/Patrick-Stott-4"
                },
                {
                    "user_id": "Gordo Wilson",
                    "user_href": "/profile/Gordo-Wilson"
                },
                {
                    "user_id": "Jordan Iga",
                    "user_href": "/profile/Jordan-Iga-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tim Farage",
                "href": "/profile/Tim-Farage-1"
            },
            "answer_text": "It is actually impossible to prove a scientific theory. Theories make predictions, and just one wrong prediction will falsify a theory. Quantum Field Theory (QFT) has been around for about a century, and no experiment has contradicted it. It is a stupendously good theory. And if it ever makes a wrong prediction, physicists will try to come up with a better theory. But even if QFT is shown to be wrong, it will always be considered to be a great theory. ",
            "date": "Answered May 8, 2019",
            "views": "298",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Skippy Valentino",
                    "user_href": "/profile/Skippy-Valentino"
                },
                {
                    "user_id": "Koilaice Krickow",
                    "user_href": "/profile/Koilaice-Krickow"
                },
                {
                    "user_id": "Irina Celarioncko",
                    "user_href": "/profile/Irina-Celarioncko"
                },
                {
                    "user_id": "Cynthie Rudolph",
                    "user_href": "/profile/Cynthie-Rudolph"
                },
                {
                    "user_id": "Patrick Stott",
                    "user_href": "/profile/Patrick-Stott-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gordo Wilson",
                "href": "/profile/Gordo-Wilson"
            },
            "answer_text": "Rule No 1 of Science. Your discovery MUST be capable of being recreated by others, using your method. NB. This does NOT apply to Astronomy. A very dynamic environment . . . . ",
            "date": "Answered May 8, 2019",
            "views": "84",
            "upvotes": " View 5 Upvoters"
        },
        {
            "author_info": {
                "name": "David Chan",
                "href": "/profile/David-Chan-287"
            },
            "answer_text": "No, Science does not deal in absolute truth. It deals in true enough. Read Belief, Proof and Science. ",
            "date": "Answered May 8, 2019",
            "views": "31",
            "upvotes": " Answer requested by William Mackintosh"
        }
    ]
}