{
    "title": "Can food or clothes be contaminated with Covid-19? - Quora",
    "tags": [
        "Contamination",
        "Food Safety",
        "Clothing and Apparel"
    ],
    "response": [
        {
            "author_info": {
                "name": "Justina Syangden",
                "href": "/profile/Justina-Syangden"
            },
            "answer_text": "Definitely Yes! Covid - 19 can land on our clothes, shoes, hair or any other surface and survive for good period of time. Experts have given us heads up that we could find viability of virus Covid-19 on Fabrics/Clothes for hours, upto 24 hours. Although most of the clothes we wear are generally porous, making it harder for the virus to be transmissible, that does not rule out the possibility of contamination. Let’s have a look on how long COVID-19 can fight for its life and stay alive on our different surfaces? On Copper: 4 hours (Note: SARS-CoV-1 lived for 8 hours)On Cardboard: 24 hours (Note: SARS-CoV-1 lived for 8 hours)On Stainless Steel: As many as 72 hoursOn Plastic: As many as 72 hoursOn Glass: Upto 96 hours So we gotta watch out if our outfit has zipper, buttons or some designs made of metals or plastic. The best thing to do is: once we’re exposed outside, remove our outer-wear and shoes before entering our house/apartment/room without removing the mask. Keep those clothes just outside for more than 24 hours, much preferably in sunlight OR, wash them in temperature of 80°F or 30°C and above. ",
            "date": "Answered April 8, 2020",
            "views": "17",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Clyde Charoon (鍾展鵬)",
                    "user_href": "/profile/Clyde-Charoon-鍾展鵬"
                },
                {
                    "user_id": "Vikraant Singh",
                    "user_href": "/profile/Vikraant-Singh-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Wright",
                "href": "/profile/Michael-Wright-902"
            },
            "answer_text": "Yes, it could but you still have to somehow transfer Covid-19 on those contaminated food or clothes into your nose or mouth if what you’re concerned about was getting infected by Covid-19. For your information, coronaviruses such as Covid-19 can’t survive without a live host. Though, they could endure without a live host for a certain limited of time before they’re dead. The amount of times that they could survive without a live host depend on the surface that they’re on and the environment (e.g. temperature, humidity and etc). Covid-19 are also not one of those heat resistant virus. If you cooked your food well done and dry your cloth before you wear it, you’ll be alright. If you need more guarantee, wipe or wash your stuff with alcohol or bleach. As for food, unless someone who is infected cough or sneeze on your food which is cooked well done, it is unlikely for you to be infected from those food. ",
            "date": "Answered February 29, 2020",
            "views": "160",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dave Jones",
                    "user_href": "/profile/Dave-Jones-698"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ed Cook",
                "href": "/profile/Ed-Cook-24"
            },
            "answer_text": "I agree with one of the other answers which states that is ‘can’ live for several days. But bear in mind that only a very small amount of the virus is likely to last that long; so,etching which is not conveyed by the charts shown in one other answer (based on the top charts below which have a log scale). Whilst I will continue to wash or quarantine my shopping, I am aware that the half-life of this virus on the various surfaces is a few hours rather than days (see violin plots at the bottom). [1]  So yes take sensible precautions, but no need for over-anxiety. Footnotes[1] https://www.nejm.org/doi/pdf/10.1056/NEJMc2004973?articleTools=true",
            "date": "Answered April 8, 2020",
            "views": "267",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Amadeo de los Ríos",
                    "user_href": "/profile/Amadeo-de-los-Ríos"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leonora Nicolaysen",
                "href": "/profile/Jane-Doe-5950"
            },
            "answer_text": "Unfortunately, yes. Research is being conducted at warp speed so watch for daily updates. The virus cal live two hours on hard metal surfaces. Much longer than AIDS, for instance. I'm sure information is being sought on viability on permeable surfaces like food and clothing. ",
            "date": "Answered February 29, 2020",
            "views": "63",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dave Jones",
                    "user_href": "/profile/Dave-Jones-698"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yvonne Thompson",
                "href": "/profile/Yvonne-Thompson-2"
            },
            "answer_text": "soap rips it apart, so wash stuff, but yes, each different surface has a different amount of time, the virus can stay in the active state in it, three days, is a generalized idea, with how rooms are kept. but washers and driers are set in such a way that the hot water is hot enough or the heating unit, is hot enough, that the virus should be killed.. all the way broken down, even if the soap missed a particle. ",
            "date": "Answered April 12, 2020",
            "views": "42",
            "upvotes": " Answer requested by Byron Inductivo"
        },
        {
            "author_info": {
                "name": "Avinoam Ben Dor",
                "href": "/profile/Avinoam-Ben-Dor"
            },
            "answer_text": "Yes. ",
            "date": "Answered April 8, 2020",
            "views": "21",
            "upvotes": " Answer requested by Byron Inductivo"
        }
    ]
}