{
    "title": "Can visible light (photons) knock off electrons out of there atoms, if yes why aren't there free electrons every, if not, where does this light go? - Quora",
    "tags": [
        "Photons",
        "Electrons",
        "Atoms",
        "Visible Light"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Reiland",
                "href": "/profile/Robert-Reiland"
            },
            "answer_text": "Yes, but this can't happen with most materials.  The work function of a material is the minimum photon energy needed to knock an electron out of the material.  Here's a list of work functions by material http://hyperphysics.phy-astr.gsu.edu/hbase/tables/photoelec.html .  Sodium, potassium, cesium and calcium all have work functions under 2.9 eV.  Everything else in the list has a work function of at least 4 eV. The highest photon energy in visible light is for violet light at the extreme end of the spectrum.  This is indicated here - Energy of Photon - as slightly more than 3.1 eV.  that means that visible light can be used to knock electrons out of only the four metals listed above.  None of these elements is found uncombined in nature, and that means that visible light isn't producing a lot of free electrons.  The main source of such electrons in our atmosphere are the electrically charged cosmic rays, mostly muons, that regularly produce ions in air. Even in this case the freed electrons don't stay free very long.  Many of them get attached to things like water molecules to produce negative ions, and the resulting negative and positive ions make it possible for sparks to form from static electricity and for lightning strokes to form.  Thanks for asking this.  It's something that I've long wanted to look into and never got to.  ",
            "date": "Answered February 3, 2016",
            "views": "838",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bert Willke",
                    "user_href": "/profile/Bert-Willke"
                },
                {
                    "user_id": "Shrey Patnaik",
                    "user_href": "/profile/Shrey-Patnaik-4"
                },
                {
                    "user_id": "Geovani Lopes Dias",
                    "user_href": "/profile/Geovani-Lopes-Dias"
                },
                {
                    "user_id": "Michael Soso",
                    "user_href": "/profile/Michael-Soso"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Peter-AI-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mudasar Ahmad Tanoli",
                "href": "/profile/Mudasar-Ahmad-Tanoli"
            },
            "answer_text": "Yes. Visble light can knock out electron from there atoms but there some elements those gie up electron by the intraction with visible light eg potassium and cesium etc. ",
            "date": "Answered February 2, 2016",
            "views": "173",
            "upvotes": "0"
        }
    ]
}