{
    "title": "Can you block gravitational waves? - Quora",
    "tags": [
        "Waves (physics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Muhammad Hanif",
                "href": "/profile/Muhammad-Hanif-49"
            },
            "answer_text": "Dear, ken..... I am not a miracle leader or a magician who could stop such waves.........however i can just analyse the possibility of such effort....gravitational waves from my own theory of noorismic field, is caused by heavy masses plus the noorismic field fluctuation.....and we have no mechanism to really stop them working .....we can just make efforts to avoid expected severe consequences through prior predictions......noorismic field is spread every where in the universe so how is it possible to block it functioning...and that's too on a such larger scale....???? .....thanks   ",
            "date": "Answered April 15, 2016",
            "views": "324",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ken Zakreski",
                    "user_href": "/profile/Ken-Zakreski"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rana Adhikari",
                "href": "/profile/Rana-Adhikari"
            },
            "answer_text": "Yes, but the required technology has not yet been developed. The interaction of gravitational waves with normal matter is so weak that it would go through anything we have on the Earth without any significant attenuation. However, with sufficiently advanced technology, one could place an array of black holes between the source of the GWs and the Earth. Black holes interact strongly with GWs and one could design a lattice work of black holes around the solar system to shield us from astrophysical gravitational waves if it became necessary to prevent Earth scientists from doing GW astronomy. ",
            "date": "Answered February 20, 2017",
            "views": "504",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mayank Mukund Bhandare",
                    "user_href": "/profile/Mayank-Mukund-Bhandare"
                },
                {
                    "user_id": "Rachit Bhatia",
                    "user_href": "/profile/Rachit-Bhatia-3"
                },
                {
                    "user_id": "Abhishek Itkikar",
                    "user_href": "/profile/Abhishek-Itkikar-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Barton",
                "href": "/profile/Mark-Barton-1"
            },
            "answer_text": "Not to any useful extent. Considered as a medium for propagating GWs, space is extremely stiff (as it needs to be to transmit waves at speed c), so anything you put in it might as well not be there. ",
            "date": "Answered April 14, 2016",
            "views": "347",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Vanderschel",
                    "user_href": "/profile/David-Vanderschel"
                },
                {
                    "user_id": "Ken Zakreski",
                    "user_href": "/profile/Ken-Zakreski"
                }
            ]
        }
    ]
}