{
    "title": "Can we see Nikola Tesla’s wireless free energy in the future? - Quora",
    "tags": [
        "Free Energy",
        "Nikola Tesla"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jerry Greelis",
                "href": "/profile/Jerry-Greelis"
            },
            "answer_text": "Your current answers are all relying on today’s academia taught science, which everyone knows Tesla openly stated was wrong a century ago and wrong today. I personally do not believe it is totally wrong but definitely totally incomplete. Unless one is using the same science Tesla was using, which by the way was much more closely to what James Clerk Maxwell’s 1865 Electrodynamics Treatise of electricity and magnetism really is, they are only using a subset of reality. This problem stems from the fact that Maxwell was more intelligent than his counterparts back then. He had to use a mathematics (quaternion) to express electricity and magnetism the caveman then and still now could not/cannot comprehend. Why? Couple of reasons, Aether and nonphysical! I know this is outside your question, but needed for my answer. Tesla’s free energy, still alive today I believe when Tesla was talking about free energy (if he ever did) he would have been referring to energy at yours and my finger- tips, not any matter decaying, or water running down a river, or burning bio-fuel for heat, etc. Tesla would have been talking about unlimited energy available everywhere within the entire Universe just waiting for someone to use it. We have this energy source today, or at least some folks believe it exists, it is called Zero Point Energy (ZPE). Let Marc Millis, the former NASA head physicist for Breakthrough Propulsion Project explain this energy source:  It being extremely doubtful there being two of these natural energy sources existing. Tesla’s free energy was more likely the Zero Point Energy Millis was alluding. Millis proposed mining it, Tesla harnessed it and was going to distribute it to both industries and homes. Keep in mind though, in order to harness this ZPE, one needs to use all of Maxwell’s equations, not just some caveman’s subset. Tesla’s distribution system Again here, if we are only using a subset of Maxwell’s (the real) Electrodynamics, the cavemen have to resort to their academia teaching science in trying to understand Tesla’s wireless system. Wireless mean NO WIRES! You and I use all kinds of wireless scenarios today, thanks to Tesla, radio, TV, radar, Bluetooth, wifi, the list is endless; this technology is all based upon Maxwell’s caveman subset of electromagnetic frequencies (EMF) waves. The EMF technology is wireless but has many problems, too many to list in this answer; it would not suffice for transmitting energy throughout the world. Tesla used a different system, and a different median to distribute his energy; aether in the ground! Concluding I believe we are already using Tesla’s free energy today, just not on Earth. The whole reason why we never went to his system in the first place was based upon economic reasons; it would have put the whole world in a deep depression. Today it is still economic, too many folks are making big returns on the caveman technologies in developing energy sources for industry and homes. As long as we can keep the academia teaching the caveman Maxwell subset, those same folks can keep making the ‘big bucks’.  ",
            "date": "Answered October 12, 2018",
            "views": "43",
            "upvotes": " View 19 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Franco Bruno Corteletti",
                    "user_href": "/profile/Franco-Bruno-Corteletti"
                },
                {
                    "user_id": "M Ruhul Amin",
                    "user_href": "/profile/M-Ruhul-Amin-1"
                },
                {
                    "user_id": "Leo Kovačić",
                    "user_href": "/profile/Leo-Kovačić-1"
                },
                {
                    "user_id": "Varun Patil",
                    "user_href": "/profile/Varun-Patil-172"
                },
                {
                    "user_id": "Colin Sanders",
                    "user_href": "/profile/Colin-Sanders-5"
                },
                {
                    "user_id": "Lakshimi Mittal",
                    "user_href": "/profile/Lakshimi-Mittal"
                },
                {
                    "user_id": "Paul Michael",
                    "user_href": "/profile/Paul-Michael-50"
                },
                {
                    "user_id": "Prathamesh Chavan",
                    "user_href": "/profile/Prathamesh-Chavan-38"
                },
                {
                    "user_id": "Vladimir Dubonjic",
                    "user_href": "/profile/Vladimir-Dubonjic"
                },
                {
                    "user_id": "Colin John Cook",
                    "user_href": "/profile/Colin-John-Cook"
                },
                {
                    "user_id": "Steve Purbrick",
                    "user_href": "/profile/Steve-Purbrick"
                },
                {
                    "user_id": "Angupale Bashir",
                    "user_href": "/profile/Angupale-Bashir"
                },
                {
                    "user_id": "My head is spinning.",
                    "user_href": "/profile/My-head-is-spinning"
                },
                {
                    "user_id": "Jamie J. Mogensen",
                    "user_href": "/profile/Jamie-J-Mogensen"
                },
                {
                    "user_id": "Partha Sarathi Mishra (ପାର୍ଥ ସାରଥୀ ମିଶ୍ର)",
                    "user_href": "/profile/Partha-Sarathi-Mishra-ପାର୍ଥ-ସାରଥୀ-ମିଶ୍ର"
                },
                {
                    "user_id": "Mayank Dimri",
                    "user_href": "/profile/Mayank-Dimri-10"
                },
                {
                    "user_id": "Arn Prince",
                    "user_href": "/profile/Arn-Prince"
                },
                {
                    "user_id": "Bo Derek",
                    "user_href": "/profile/Bo-Derek-12"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/yourspiritualdestiny"
                }
            ]
        },
        {
            "author_info": {
                "name": "István G. Kocsis",
                "href": "/profile/István-G-Kocsis"
            },
            "answer_text": "In your question is an assumption that free energy exist and/or somehow connected to Tesla. But it’s not the case as he was much more the father of renewable energy technologies. Tesla’s wireless transmission of electrical energy worked and it have a good chance that we will see it in commercial operation too. But his wireless transmission doesn’t mean literally wireless but one or single wire transmision wich basically differs from RF or electro-magnetic transmission used in present day practice. ",
            "date": "Answered October 5, 2018",
            "views": "117",
            "upvotes": " Answer requested by Amrit Kandel",
            "upvoters": [
                {
                    "user_id": "Sathya Andrew",
                    "user_href": "/profile/Sathya-Andrew"
                },
                {
                    "user_id": "Tom Peracchio",
                    "user_href": "/profile/Tom-Peracchio"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kenneth Lundgren",
                "href": "/profile/Kenneth-Lundgren"
            },
            "answer_text": "Free energy is not possible, much less wireless free energy. Even if usable amounts of wireless energy were possible, would you want to live in a world surrounded by high levels of RF energy. People are afraid of the low levels from cell phones and wi-fi, and the EM fields near power lines. Who would want to live with high level intentional RF fields? ",
            "date": "Answered October 5, 2018",
            "views": "234",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sohail Ahmed",
                    "user_href": "/profile/Sohail-Ahmed-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bruce A McIntyre",
                "href": "/profile/Bruce-A-McIntyre"
            },
            "answer_text": "Energy will NEVER be “free.” ",
            "date": "Answered October 5, 2018",
            "views": "11",
            "upvotes": " View 1 Upvoter"
        }
    ]
}