{
    "title": "Can the nuclei of two atoms touch? What happens if they do? - Quora",
    "tags": [
        "Nuclei (physics)",
        "Atomic Physics",
        "Atoms",
        "Science of Everyday Life",
        "Physics of Everyday Life",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "YoungBlood Bear",
                "href": "/profile/YoungBlood-Bear"
            },
            "answer_text": "Yes and no. Typically no, the electrons around an atom repell those of other atoms very strongly, following the inverse square law, when they get close they push really hard… But it is possible to slam them together so hard that they touch, this is done in two ways, intense pressure like in the center of a star, and by slamming the atoms togetjer really fast- and really fast atoms really translates into having them really really hot. On earth that means millions of degrees and way way hotter than we can make any material hold up. So what happens when they do? It depends, they can explode apart, fuse, or a number of combinations, but buth the right pair example, deuterium atoms-hydrogen with one proton and one neutron, the strong nuclear force which up that close is much much stronger than the static electric force will hold it together and the atoms fuse isnto a single helium atom releasing energy, and this is exactly how stars and our sun produce energy, as well as thermonuclear hydrogen bombs, and with luck, fusion reactors will soon be able to do to generate energy. The amount of energy released in fusing atoms is genuinely massive, and harnessing it is a major goal. Tech Ingredients has a recent video talking in depth aboutb this if you’re interested. Basically since we can’t touch something that hot we have to use magnets to hold it in place and heat it very cleverly, or alternatively use lasers to compress little pellets hard enough to fuse. Additionally there are some other possibilities , for example in a neutron star the forces are so great even without the particles movingbthat fast that the distinction between atoms disappears, and deeper the pressure is so immense the distinction between even the neutrons gets very soupy and confusing… Kurzgesat has a very good video about this aswell ",
            "date": "Answered May 3, 2020",
            "views": "163",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Thomas Bostick",
                    "user_href": "/profile/Thomas-Bostick"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tod Harter",
                "href": "/profile/Tod-Harter"
            },
            "answer_text": "Yes, although the term ‘touch’ is a bit of a misnomer. They can come together, and the result could be any of several things, depending on the energy involved and what species we are talking about. 2 hydrogen atoms, for example, might collide and fuse to form a helium atom. Smash a helium atom into an atom of Plutonium, you might get fission, etc. But it all depends on the energies. The Relativistic Heavy Ion Collider smashes together a variety of nuclei, up to Uranium<->Uranium collisions, at very high energies. The result is a QGP, and both ions are entirely destroyed. Under normal earthly conditions this kind of collision is however impossible. Electrostatic repulsion is too strong. This is why nuclear fusion is very hard to achieve. ",
            "date": "Answered May 3, 2020",
            "views": "95",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Thomas Bostick",
                    "user_href": "/profile/Thomas-Bostick"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pragati Singh",
                "href": "/profile/Pragati-Singh-571"
            },
            "answer_text": "yes the nuclei of two atoms can touch each other .This process is called nuclear fusion reactions in which two atomic nuclei combine to form different atomic nuclei ",
            "date": "Answered May 3, 2020",
            "views": "123",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Thomas Bostick",
                    "user_href": "/profile/Thomas-Bostick"
                }
            ]
        }
    ]
}