{
    "title": "Can diamonds be detected by a metal detector? - Quora",
    "tags": [
        "Metal Detectors",
        "Metal Detecting"
    ],
    "response": [
        {
            "author_info": {
                "name": "Josh Mahias",
                "href": "/profile/Josh-Mahias"
            },
            "answer_text": "This leads to an important point: metal detectors will not detect non metal items such as gemstones, diamonds and pearls. What a metal detector can do is lead you to indicator minerals, which are used by prospectors. Prospectors follow the indicator trail back to gold or the volcanic pipe which may contain diamonds. ",
            "date": "Answered March 22, 2018",
            "views": "724",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sarah Feaster",
                    "user_href": "/profile/Sarah-Feaster-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Penina Winisdatter",
                "href": "/profile/Penina-Winisdatter"
            },
            "answer_text": "No. Not unless they are set in metal fittings. A diamond is mineral, it is carbon. In fact, in a fire, diamonds will actually catch fire and burn! A metal detector works by detecting aberrations in the electromagnetic field, generated by the search coil. a diamond, unset, will not disturb that field any more than a common rock would. ",
            "date": "Answered February 17, 2017",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Christopher John Barrett",
                    "user_href": "/profile/Christopher-John-Barrett"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Patterson",
                "href": "/profile/Richard-Patterson-48"
            },
            "answer_text": "This leads to an important point: metal detector will not detect non metal items such as gemstones, diamonds and pearls. What a metal detector can do is lead you to indicator minerals, which are used by prospectors. Prospectors follow the indicator trail back to gold or the volcanic pipe which may contain diamonds. ",
            "date": "Answered January 1, 2018",
            "views": "340",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sarah Feaster",
                "href": "/profile/Sarah-Feaster-2"
            },
            "answer_text": "Metal detector detect non ferrous or ferrous metal but metal detector can’t detect non metal. Because metal detector make for detect metal objects. Metal Detector detect silver, stile, coins, golds, jewelry etc. I know about it by reading metal detector tips. ",
            "date": "Answered April 19, 2018",
            "views": "467",
            "upvotes": "0"
        }
    ]
}