{
    "title": "Can quantum particles travel backwards in time? - Quora",
    "tags": [
        "Quantum Particles",
        "Quantum Field Theory",
        "Quantum Computing",
        "Time Travel",
        "Time Travel Scenarios",
        "Theoretical Physics",
        "Time (physics)",
        "Particle Physics",
        "Quantum Mechanics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Fred Kuryllowicz",
                "href": "/profile/Fred-Kurylowicz"
            },
            "answer_text": "Yes providing it is within the boundaries REQUIRED by HUP. That is a hard yes. To larger dynamics I think it is extremely likely or at least as likely as the math suggesting antimatter was possible only to be confirmed decades later in experiments. Transactional interpretation - Wikipedia As much as I respect Professor Brewer, I think we have to trust the math regardless of how counter intuitive it is, and sometimes wait for technology’s ability to do the experiment to confirm the math, not the other way around. I remember asking the now Dean of Physics, why if for every force there was an equal and opposite force, why don't sniper rifles in the 50 caliber variant blow off the shooters shoulder, to which he replied do the math! I had naively confused the conservation of momentum with the conservation of energy with the asymmetrical transfer of energy permitted within the first law, sorry third law for the details/spelling Nasiz. if for motion its E>4=…a whole of weird things become possible, and the world is certainly weird enough that it seems to need dark matter and dark energy The energy and momentum eigenvalues of F1 are ¯hw and ¯hk, while the eigenvalues of G1 are 􀀀¯hw and 􀀀¯hk. Therefore, the emission of the composite wave function F1+G1 involves no change in energy or momentum, i.e., no energy or momentum cost. This is to be expected, since the emission process is time-symmetric, and time-symmetric fields should not produce any time-asymmetric loss of energy or momentum the above from : Transactional Interpretation of Quantum Mechanics Chapter in Review of Modern Physics · July 2009 DOI: 10.1007/978-3-540-70626-7_223 CITATIONS 159 ",
            "date": "Answered April 11, 2020",
            "views": "134",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jess H. Brewer",
                "href": "/profile/Jess-H-Brewer-3"
            },
            "answer_text": "In Feynman diagrams, the antiparticles (like positrons) are shown as propagating backward in time. This is a graphical convenience expressing the fact that the integral equations that Feynman diagrams mathematically represent antiparticles as time-reversed. I have spent my professional career working with antiparticles (positive muons), and I can assure you that they do not “travel backwards in time” in the laboratory! ",
            "date": "Answered April 9, 2020",
            "views": "289",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vladimir Petrić",
                    "user_href": "/profile/Vladimir-Petrić"
                },
                {
                    "user_id": "Craig Wilson",
                    "user_href": "/profile/Craig-Wilson-42"
                },
                {
                    "user_id": "Eric Platt",
                    "user_href": "/profile/Eric-Platt-9"
                },
                {
                    "user_id": "Pál Váradi Nagy",
                    "user_href": "/profile/Pál-Váradi-Nagy"
                },
                {
                    "user_id": "Sid Kol",
                    "user_href": "/profile/Sid-Kol-2"
                },
                {
                    "user_id": "Sohail Ahmed",
                    "user_href": "/profile/Sohail-Ahmed-7"
                },
                {
                    "user_id": "Charles Francis",
                    "user_href": "/profile/Charles-Francis-56"
                },
                {
                    "user_id": "Dane Clarke",
                    "user_href": "/profile/Dane-Clarke-1"
                },
                {
                    "user_id": "Suhas S",
                    "user_href": "/profile/Suhas-S-124"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Lazar",
                "href": "/profile/Joseph-Lazar-9"
            },
            "answer_text": "Yes, while it is coherent/plane waves. Spacetime isn’t used for these types of waves. So only virtual/holographic particles can, they will not be physical. The catch is that they will be of all time, forward and backwards. This explains how decoherence can appear to enact preemptively in the delayed choice quantum eraser. ",
            "date": "Answered April 8, 2020",
            "views": "85",
            "upvotes": " Answer requested by Ben Billy",
            "upvoters": [
                {
                    "user_id": "Erik Kofoed",
                    "user_href": "/profile/Erik-Kofoed-2"
                },
                {
                    "user_id": "Maxime Denis",
                    "user_href": "/profile/Maxime-Denis-5"
                },
                {
                    "user_id": "William Mansley",
                    "user_href": "/profile/William-Mansley"
                }
            ]
        },
        {
            "author_info": {
                "name": "H Lee Wieser",
                "href": "/profile/H-Lee-Wieser"
            },
            "answer_text": "Sort of, what happens is that an uneven number of atoms (in the classical sense of the term, more accurately “gravitons,” get left behind in a small fraction of “the past” about 10^-44th of a second, which immediately defines the future) this is the way “the past” defines “the future,” and vice versa. Dependant on how evolved the system is, this can express it's ways in very conclusive or very random ways ",
            "date": "Answered April 8, 2020",
            "views": "65",
            "upvotes": " Answer requested by Ben Billy"
        },
        {
            "author_info": {
                "name": "Charles Francis",
                "href": "/profile/Charles-Francis-56"
            },
            "answer_text": "A positive energy antiparticle traveling forwards in time is mathematically identical to a negative energy particle travelling backwards in time. It can only be observed as a positive energy antiparticle, but the interpretation may be illuminating. ",
            "date": "Answered April 9, 2020",
            "views": "92",
            "upvotes": " View 3 Upvoters "
        }
    ]
}