{
    "title": "Can repulsive gravity exist? - Quora",
    "tags": [
        "Quantum Mechanics",
        "Gravity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Adam Johnston",
                "href": "/profile/Adam-Johnston-17"
            },
            "answer_text": "If the universe is in fact expanding then some outside force is gravitationally pulling at it. God is physics. Why not? He is sustaining and allowing gravity to occur. Science can only replicate what exists with what is coexisting in the same time and universe. Science can only teach us about what we can see, outside of this there is only speculation. There is no scientific explanation for the \"whys\" of this universe and the recorded time, which we have faith we exist in. Why does matter, antimatter or gravity exist? What is the reason for existence, existing. Atheists think they themselves are the reason. But has anyone made himself exist? Can a human being without any experiential knowledge, know if they exist. Everyone knows they exist for a reason and they know the reason, but trick their neurons into only knowing what they can touch. There must be a higher reality and if you are able to perceive the physical world from that vantage point you would be able to understand reality and why it exists. If you created reality and gave it a purpose, then made a part of it different. Like yourself. This part you loved, you were in love with it, you loved it more than yourself and gave it everything it needed or wanted and hung out with it all day. Then it stopped loving you and stopped fulfilling its purpose. You made it like yourself with the ability to choose to do something or not to do something. Then you told your creation one thing displeased you and it chose to do that one thing. And in your nature you could not fill the same space with that which displeased you. You were forced to break the connection between you and your creation. Then it hated you and only wanted to do that which displeased you. Would you still be in love with that part of your creation. Why would you still love it. If you see things from someone else's perspective but are able to not do the things they do, you can understand why you can still love them no matter what they do. Would you give them a way out of their self-inflicted hell? If you became one of your creations, to experience everything they go through. Then you told them if they believed in you again then you would restore them to there original state of being without the want of disobeying. Then they killed you in the worst way they had thought of. And at the same time and place all the wrath that is part of your nature was put on yourself and you experienced the worst thing you could imagine so that those who believed in you wouldn't have to experience it. You do all this for that which you are in love with and it still won't believe. What would you do? Would you rescue those who love you? Then what? The rest is unnecessary. New existence begins and lasts forever. Sorry if that got away from antigravity and such. Just see gravity from its perspective, it wants to do its purpose, leave it alone. Shit flies yo, make what you got work better. ",
            "date": "Answered October 28, 2014",
            "views": "482",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Anhtuan Nguyen",
                    "user_href": "/profile/Anhtuan-Nguyen-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prajwal Rauniyar",
                "href": "/profile/Prajwal-Rauniyar"
            },
            "answer_text": "I can paint you a picture that will help you imagine gravity. Imagine a trampoline and in the middle place a ball. This ball represents a body with mass and the surface of the trampoline is spacetime. Now the ball will bend the surface of the trampoline according to its mass. Smaller balls will bend the surface less and larger ball will bend em more. Now if you put another ball at the vicinity of our first ball due to the \"curvature\" the second ball will fall towards the first one and as they get closer they will move towards each other faster. You have to put energy to separate them. For repulsion our first ball has to bend the surface of the trampoline not downwards but upwards. Something like the ball sticks to the surface and the ball is pulled upwards. This way if you put another ball at the vicinity of the first one they move apart. You have to put energy to bring them together. this is in essence negative gravity. Practically to achive negative gravity two particles have to interact and one of them has to have negative mass. One way to achive negative mass is if that particle is moving backwards in time. That can be achived if the particle is moving faster than light. ",
            "date": "Answered March 4, 2014",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Andalib Warsi",
                    "user_href": "/profile/Andalib-Warsi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hubert Okari",
                "href": "/profile/Hubert-Okari"
            },
            "answer_text": "According to Albert Einstein's general theory of relativity, gravity is as result of the curvature of spacetime fabric. If you jump upwards, spacetime fabric will return you down because you are trying to curve it. Imagine of stretching a rubber band, it always returns to its original length due its elastic recoil. Maybe there are some kind of movements spacetime fabric can either allow, support or resist. I think we don't need to create anti-gravity, what we need is to find one kind of motion which spacetime fabric support thus giving an illusion of anti-gravity. 2. We need to find natural forces that interact with spacetime fabric and then include those forces in that one motion that is supported by spacetime fabric. Professor Eric Laithewaite discovered the one motion that we are looking for and is on an official record. The motion is circular motion. He used a wheel to demonstrate that a rotating wheel felt lighter when lifting it than a stationary one. For the natural force, it has been demonstrated over and over again that magnetism interact with spacetime fabric and that magnetic force is several times stronger than gravity. When a system containing magnetic field is rotated it interact with spacetime fabric thus creating an effect that creates an illusion of anti-gravity.Searl's effect Generator is one of that system. Also a replica of Searl's effect Generator was created by two Russian scientists, Godin and Roschin. Godin and Roschin claimed that at a bove 450 RPMs, their generator appeared to start accelerating without any power withdraw from the power source! At around 580 RPMs, the entire system started to reduce in weight on the weight metre. It continued to reduce in its measurable weight with increase in RPM. Its measurable weight reduced by 35% as per their measurements by the time they stopped the experiment because the system became unstable for running the speed it was not designed for. It seems, we don't need to find some material that is anti-gravity or create anti-gravity. What we need is to create systems that comply with the motion that spacetime fabric can support to give an illusion of anti-gravity. ",
            "date": "Answered November 25, 2018",
            "views": "220",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kirsten Hacker",
                "href": "/profile/Kirsten-Hacker"
            },
            "answer_text": "Charge flowing in a loop will create a magnetic field with a polarity which depends on which direction in which it is flowing. What does mass flowing in a loop do? Do two bodies spinning about the same axis in the opposite direction repel each other? The best way to find out if flowing mass acts like flowing charge would be to mount a few bicycle wheels on a pole such that they can freely slide along their axes. Do they attract or repel depending the direction in which they are spinning? While searching for a picture of such an experiment, I could only find this: https://www.gutenberg.org/files/34268/34268-h/images/fig58.jpg What is that guy doing? https://www.gutenberg.org/files/34268/34268-h/34268-h.htm The second link is an old lecture from 1908. It was given by Prof. John Perry, a student of Lord Kelvin and it makes my heart sing to see how the whole darn thing is written in plain English with no mathematical sophistry whatsoever. Beautiful. When I see a question like this answered only in terms of “mysterious dark energy” and general relativity, I really wonder if the world wars messed up physics in a major way: Why is Einstein so overrated? But maybe I am wrong and “dark energy” is exactly the same thing as the force which keeps a top from tipping over. Each star shooting away from us in the night sky is like a wire carrying electric current in the same general direction. Wires with current flowing in the same direction attract, so mass flowing in the same direction would repel, according to a simple analogy from Gravitoelectromagnetism: Electrons repel, magnets attract and repel, electromagnetic waves make atoms stable Mass attracts, [the gravitational analog of magnets] repels and attracts, gravitational waves make orbits stable Kirsten Hacker's post in A public notepad Thus, the gravitational analogue of magnetism could be the “mysterious dark energy” force which is causing the observed accelerating expansion of our universe. Once you remove the lack of transparency which infects physics today, I think what is underneath is really very simple. It just got lost during the confusion of the last paradigm shift when learning physics became equivalent to learning to think counterintuitively. To understand more about how our theories fit together, see: If a moving electric field produces a magnetic field, does a moving gravity field have it's own \"magnetic equivalent\"? ",
            "date": "Updated June 13, 2017",
            "views": "1",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gian Maria",
                    "user_href": "/profile/Gian-Maria-1"
                },
                {
                    "user_id": "Juan Ignacio Perotti",
                    "user_href": "/profile/Juan-Ignacio-Perotti"
                },
                {
                    "user_id": "Jerold Loyola",
                    "user_href": "/profile/Jerold-Loyola"
                },
                {
                    "user_id": "Charles Bradley",
                    "user_href": "/profile/Charles-Bradley-18"
                },
                {
                    "user_id": "Dilip James",
                    "user_href": "/profile/Dilip-James"
                },
                {
                    "user_id": "Mustafa Kemal Oyman",
                    "user_href": "/profile/Mustafa-Kemal-Oyman"
                },
                {
                    "user_id": "José Esteves B. Rabello",
                    "user_href": "/profile/José-Esteves-B-Rabello"
                },
                {
                    "user_id": "Tim Miller",
                    "user_href": "/profile/Tim-Miller-132"
                },
                {
                    "user_id": "Martin Laurent",
                    "user_href": "/profile/Martin-Laurent-6"
                },
                {
                    "user_id": "Tejasvi Gaurav Mishra",
                    "user_href": "/profile/Tejasvi-Gaurav-Mishra"
                },
                {
                    "user_id": "Soumyaneel Manna",
                    "user_href": "/profile/Soumyaneel-Manna-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Calhoun Waser",
                "href": "/profile/Paul-Calhoun-Waser"
            },
            "answer_text": "I have heard there is repelling gravity. Is this true? Yes. Gravity is associated with mass, they are part and parcel of the same thing. The equations of physics indicate that positive mass would have positive gravity; and negative mass would have negative gravity. Dark energy if made up of negative mass particles, would have negative gravity. The particles that could make up dark energy are negative-imaginary mass neutrinos and neutrino like quantum mechanically symmetric particles. The “cosmological constant” is a mathematical fudge factor that forces our universe to accelerate. This is not the same as negative gravity. It does not obey the equivalence principle postulate of Einstein’s general theory of relativity, because it is not indistinguishable from acceleration. It also does not obey the principles of physics: i.e. conservation of energy, conservation of momentum or Newton’s second principle (the definition of force or mass). This should be more than enough to rule it out completely, once and for all. Negative gravity is consistent with all the principles of physics. ",
            "date": "Answered February 3, 2018",
            "views": "169",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Arthur James Tourot",
                    "user_href": "/profile/Arthur-James-Tourot"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neil Farbstein",
                "href": "/profile/Neil-Farbstein-1"
            },
            "answer_text": "No. Antigravity does not exist. And space drives like Shawyer's EM Drive are not antigravity devices even though they reportedly provide thrust without exhaust in the opposite direction to cause and equal and opposite force to drive them forward.  There have been tests of it on board the Chinese space station and by NASA at the Glenn Space Center, that indicate it works, but they are near the limit of accuracy. In theory, microwaves bounce off the walls of the reaction chamber unevenly and that causes a thrust even though no exhaust comes out.  That violates newton's three laws of motion but its been know for over a century that newton's laws are not complete. Shayer thinks that the special theory of relativity explains the effect completely. Antigravity has not been observed in the lab. The acceleration of galaxies away from each other seems to be caused by an antigravity force called dark energy. But the latest measurements of the Hubble red shift call that into question. The universe's expansion might not be accelerating after all. It might be expanding at a steady rate. ",
            "date": "Answered July 19, 2018",
            "views": "376",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gary Novosielski",
                    "user_href": "/profile/Gary-Novosielski"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wally Watkins",
                "href": "/profile/Wally-Watkins-1"
            },
            "answer_text": "The simple answer is no. The reason is very simple: If you look at the equation of universal gravitational force you will notice that it depends upon mass x mass divided by separation squared. Since (i) mass is always positive (and cannot under any circumstances be negative) and(ii) separation is also positive (and cannot under any circumstances be negative) it means that the attractive force is also always necessarily positive. There is, therefore, no real situation in which anti-gravity can be created. ************************************** If you want to check this out, look at Newton's law of universal gravitation - Wikipedia. It’s a bit technical but gives the basic idea in the first few paragraphs. Some people are a bit confused when they see the vector form of the equation has a minus sign in front of it which they think implies that gravity can be negative. In fact, the minus sign is a mathematical tool and has no physical significance. ",
            "date": "Answered March 19, 2019",
            "views": "104",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Gilmore",
                "href": "/profile/James-Gilmore-24"
            },
            "answer_text": "I'm not going to read through 46 posts with mathematics I can't understand and opinions with no real basis in reality as we know it. But I do remember reading about the Biefeld-Brown effect, artificial gravity, and a Russian whose name I think was Plodnetchev, directional gravity, and a “ map “ of the known universe which seemed to indicate that it was repelling itself on a very large scale. Sorry, I'm tired, and I gave up caring about these things years ago. If one of you bright fellows out there comes up with a cure for aching joints, please let me know. A faster than light drive would be exciting too. I'll bet the Vulcans don't get achy joints. ",
            "date": "Answered February 22, 2020",
            "views": "255",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Simran Preet",
                    "user_href": "/profile/Simran-Preet-110"
                }
            ]
        },
        {
            "author_info": {
                "name": "Max Throm",
                "href": "/profile/Max-Throm"
            },
            "answer_text": "You might be thinking of dark energy (also called the vacuum energy or the cosmological constant). In the twentieth century it was observed that the expansion of the universe was accelerating. This didn't make any sense because gravity should be causing the universe’s expansion to slow down as it pulls everything together. Scientists don't know why the universe’s expansion is accelerating but they know that it is. The vacuum energy is an energy term that is added in to Einstein’s equations so that they model the accelerating expansion accurately. Vacuum energy aside, gravity is still very much an attractive force. ",
            "date": "Updated June 10, 2017",
            "views": "103",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Effy John",
                "href": "/profile/Effy-John"
            },
            "answer_text": "For a repulsive gravitational force, the source of the field must be a negative mass. While several physicists have put forward the idea of negative mass, to try and explain various things like how a wormhole could be produced, or how hawking radiation can slowly destroy a blackhole. Again, all these are just theory, and nobody has actually observed negative mass, but yes, if negative mass exists, then gravity can be repulsive. Otherwise, this would be impossible. Prof. User, could you please explain this in a more elaborate way? My knowledge is highly limited, and I don’t want to give anyone wrong information. ",
            "date": "Answered February 24, 2017",
            "views": "709",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Atharv Rai",
                "href": "/profile/Atharv-Rai-1"
            },
            "answer_text": "Gravity can be understood in simple way like this... Stretch a blancket ( in a way that it is not loose) now put your phone in middle... Now put a marble on blancket, the marble moves towards phone... Now put a stone on blancket, stone moves little towards them but they move more towards the stone... That blancket is space-time curvature... And phone, marble and stone are objects... That curvature which is fomed on the blancket due to these objects is gravity... Ao you see now that anything will move in the direction of deprresion ( net tangential force is in that direction)... So gravity cannot be repulsive ",
            "date": "Answered February 23, 2017",
            "views": "641",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Himanshu Upadhyay",
                "href": "/profile/Himanshu-Upadhyay-140"
            },
            "answer_text": "Many people seem to think NASA has secret training rooms in which gravity can be turned off. Aside from the long-running Anti Gravity column in Scientific American, however, there is no such thing as antigravity. Gravity is a force arising among any two masses in the universe. Our most familiar run-in with it is the attraction that pulls our bodies, our houses and everything else in our lives toward the planet Earth beneath us. Even in orbit, where astronauts do not feel the tug of gravity, it is nonetheless abundantly present. Gravity’s draw is simply masked by the free-falling motion of a spacecraft as it circles the planet. Only way out in deep space, beyond the domain of any planets or stars, can you truly escape gravity. As of yet, no technology exists to neutralize the pull of gravity ",
            "date": "Answered November 25, 2017",
            "views": "552",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Himanshu Tripathi",
                    "user_href": "/profile/Himanshu-Tripathi-157"
                },
                {
                    "user_id": "Himanshu Kumar",
                    "user_href": "/profile/Himanshu-Kumar-742"
                },
                {
                    "user_id": "Soummyy Nayak",
                    "user_href": "/profile/Soummyy-Nayak"
                }
            ]
        },
        {
            "author_info": {
                "name": "Soummyy Nayak",
                "href": "/profile/Soummyy-Nayak"
            },
            "answer_text": "Gravity is a universal phenomena by which to bodies with mass attract each other towards the centre of each other . Gravitational fields are actually region of curvature on sapce time fabrication due to mass where the higher mass attract a lower mass bit more rapidly . To get rid of a universal phenomena isn't possible for Humans yet . But it can happen by planks energy which is the greatest energy of Univers . it contains 19 B volts of potential difference at which the space time fabrication will be destroyed and all know laws of Univers will fail … this is what I can tell . ",
            "date": "Answered November 27, 2017",
            "views": "307",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shreeyash Jejurkar",
                "href": "/profile/Shreeyash-Jejurkar"
            },
            "answer_text": "Anti-gravity also known as non-gravitational field is an idea of creating a place or object that is free from the force of gravity. It does not refer to the lack of weight under gravity experienced in free fall or orbit, or to balancing the force of gravity with some other force, such as electromagnetism or aerodynamic lift. Anti-gravity is a recurring concept in science fiction, particularly in the context of spacecraft propulsion. Examples are the gravity blocking substance \"Cavorite\" in H. G. Wells' The First Men in the Moon and the Spindizzy machines in James Blish's Cities in Flight. In Newton's law of universal gravitation, gravity was an external force transmitted by unknown means. In the 20th century, Newton's model was replaced by general relativity where gravity is not a force but the result of the geometry of spacetime. Under general relativity, anti-gravity is impossible except under contrived circumstances.Quantum physicists have postulated the existence of gravitons, massless elementary particles that transmit gravitational force, but the possibility of creating or destroying these is unclear. \"Anti-gravity\" is often used colloquially to refer to devices that look as if they reverse gravity even though they operate through other means, such as lifters, which fly in the air by moving air with electromagnetic fields. ",
            "date": "Answered November 24, 2017",
            "views": "721",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pankaj Wakchaure",
                    "user_href": "/profile/Pankaj-Wakchaure-2"
                },
                {
                    "user_id": "Prashant Jadhav",
                    "user_href": "/profile/Prashant-Jadhav-287"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Bedford",
                "href": "/profile/Matthew-Bedford-14"
            },
            "answer_text": "Well I've seen some quite compelling footage in the early 90 of something similar, the device was shaped polystyrene with some electronics in side, it seemed to levitate, and when pushed it just kept going following the contours of the quite bumpy landscape, as someone of and electronics persuasion I didn't understand how they did it, and it was way before machines powerful enough for convincing CGI, who knows never seen or heard of it again, but it was certainly compelling, or a well staged hoax. ",
            "date": "Answered July 19, 2018",
            "views": "71",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Davor Dobrota",
                    "user_href": "/profile/Davor-Dobrota"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aaron Dunbrack",
                "href": "/profile/Aaron-Dunbrack-1"
            },
            "answer_text": "The nonlinearities. They’re what make GR so hard - they’re gross, disgusting, and repulsive. In all seriousness, though, you’re probably referring to dark energy. The exact identity of it is unknown, and is tangled in complicated technical details. If it were just a constant of nature (as is an option, albeit an unpopular one due to fine-tuning), then it could arguably be called a “repulsive component of gravity.” If it were (as is the more common perspective) the consequence of a matter field, then perhaps arguably so, but certainly less clearly, and I don’t think it’s true in the sense you’re imagining it, because it’s not really closely intertwined with the gravitational force, per se. ",
            "date": "Answered June 9, 2017",
            "views": "187",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David A. Smith",
                    "user_href": "/profile/David-A-Smith-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frank Instein",
                "href": "/profile/Frank-Instein-2"
            },
            "answer_text": "Theoretically you can i don't know if you can build a non moving anti gravity capsule as in the movies, or any fiction related stuff. Gravity is nothing but a force which is constantly acting on a body, with an equal and opposite force you can repel the forces of gravity on the body/object, thus creating an anti gravity capsule. ( you can create gravity though :Ppretty much what they do in a spaceship, the rotating ring like structures in that of the movies) ",
            "date": "Answered November 23, 2017",
            "views": "263",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shantanu Shikhare",
                    "user_href": "/profile/Shantanu-Shikhare"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ernest W. Adams",
                "href": "/profile/Ernest-W-Adams"
            },
            "answer_text": "You can counter gravity by various means — lighter-than-air craft, wings that generate lift, rocket engines — but you can’t make it go away. Gravity is produced by the way mass interacts with spacetime. The only way to produce anti-gravity would be to create negative mass, and there’s no such thing as far as anybody knows. ",
            "date": "Answered October 17, 2019",
            "views": "919",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abi Owoaje",
                    "user_href": "/profile/Abi-Owoaje"
                },
                {
                    "user_id": "Jon Ljunggren",
                    "user_href": "/profile/Jon-Ljunggren"
                },
                {
                    "user_id": "Scott Lumry",
                    "user_href": "/profile/Scott-Lumry"
                },
                {
                    "user_id": "Lori Procopio",
                    "user_href": "/profile/Lori-Procopio-1"
                },
                {
                    "user_id": "Thomas Bostick",
                    "user_href": "/profile/Thomas-Bostick"
                },
                {
                    "user_id": "Alex Jiménez",
                    "user_href": "/profile/Alex-Jiménez"
                },
                {
                    "user_id": "Harold Sherman",
                    "user_href": "/profile/Harold-Sherman-8"
                },
                {
                    "user_id": "Hunter Brown",
                    "user_href": "/profile/Hunter-Brown-29"
                },
                {
                    "user_id": "Destin Fox",
                    "user_href": "/profile/Destin-Fox"
                },
                {
                    "user_id": "Easten Phillips",
                    "user_href": "/profile/Easten-Phillips"
                },
                {
                    "user_id": "Kennedy Kight",
                    "user_href": "/profile/Kennedy-Kight"
                },
                {
                    "user_id": "Chris Nash",
                    "user_href": "/profile/Chris-Nash-10"
                },
                {
                    "user_id": "Logan R. Kearsley",
                    "user_href": "/profile/Logan-R-Kearsley"
                },
                {
                    "user_id": "Vignesh Kannan",
                    "user_href": "/profile/Vignesh-Kannan-42"
                },
                {
                    "user_id": "Rolando J Rios",
                    "user_href": "/profile/Rolando-J-Rios"
                },
                {
                    "user_id": "Nils Dula",
                    "user_href": "/profile/Nils-Dula"
                }
            ]
        },
        {
            "author_info": {
                "name": "Graham Ross Leonard Cowan",
                "href": "/profile/Graham-Ross-Leonard-Cowan"
            },
            "answer_text": "I think we’ll find at least one way to fake it. The thing itself looks like nonconservation of momentum, which I expect not to happen. Neutrino rocketry, if trillions of watts of neutrino kinetic power could be put into a neutrino beam without the coproduction of more than a watt or two of heat, would be one way for a heavy vessel to lift itself up without appearing to push anything down. Of course it would be pushing the neutrinos down, but they are so little interacting — except with something in the vehicle, of course — that bystanders could walk through the beam without being harmed by it or even feeling it. ",
            "date": "Answered March 19, 2019",
            "views": "142",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Yeshendra Nirmalkar",
                "href": "/profile/Yeshendra-Nirmalkar"
            },
            "answer_text": "Whenever you leave any object freely in the space inside the earth’s atmosphere, the object will fall down to the earth which is due to the gravitational force, it will never rise up. So gravity will always be attractive it would never be repulsive. But gravity can be opposed by any external force which should be greater than the gravitational force if the object needs to move against gravity . ",
            "date": "Answered January 8, 2017",
            "views": "352",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Wendy Krieger",
                "href": "/profile/Wendy-Krieger"
            },
            "answer_text": "The model of gravity that descends from Oliver Heaviside, by Jefimenko, and more recent commenters, indicate tht repulsive gravity exists, and is a consequence of the Minkowski geometry that special relativity gives. Since this model gives something like the observed rotations of galaxies, it requires no 'dark matter' fix. ",
            "date": "Answered October 29, 2014",
            "views": "854",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Justin Jones",
                    "user_href": "/profile/Justin-Jones-9"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Peter-AI-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Siju George",
                "href": "/profile/Siju-George-27"
            },
            "answer_text": "In the standard model for describing fundamental particles and interactions, every particle has an antiparticle. For example, the positron is the antiparticle of the electron. It has identical mass, but has a positive charge. There has been study of a particle called gravitons What Are Gravitons? . And the feasibility of Ant-gravitons existing. How To Build An Anti-gravity Device some Idea about anti-gravity creation ",
            "date": "Answered November 23, 2017",
            "views": "284",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Frank Instein",
                    "user_href": "/profile/Frank-Instein-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Susan Burns",
                "href": "/profile/Susan-Burns-14"
            },
            "answer_text": "Gravitational forces/tensions produce only one kind of field. EM fields, for example, can be shown to oppose gravity. Energetic energy, as in movement, apparently can negate the forces/tensions of gravitational fields. It just depends on how big you need your field to be. It may be possible to produce small energetic particle actions (like plasma) that will negate gravity over given volumes. ",
            "date": "Answered October 27, 2019",
            "views": "34",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brent Meeker",
                "href": "/profile/Brent-Meeker"
            },
            "answer_text": "Why settle for artificial? It is trivially easy to produce “real” gravity not just a simulation. You spin your vessel, like those wheel space stations you see in scifi movies or spin it on a tether to a counter weight. There seems to a failure to recognize Einstein’s equivalence principle. Gravity, like you experience standing the ground, is just an acceleration. It’s the ground pushing up on the bottom of your feet and forcing you to follow a non-geodesic path thru the spacetime that the Earth’s mass has warped. The acceleration you would feel in the spinning spaceship is the same thing. It’s real gravity. ",
            "date": "Answered October 24, 2019",
            "views": "77",
            "upvotes": " Answer requested by Peter Martinson",
            "upvoters": [
                {
                    "user_id": "Liam Miller",
                    "user_href": "/profile/Liam-Miller-34"
                },
                {
                    "user_id": "Tim Miller",
                    "user_href": "/profile/Tim-Miller-132"
                }
            ]
        },
        {
            "author_info": {
                "name": "George Nixon",
                "href": "/profile/George-Nixon-6"
            },
            "answer_text": "How do humans create artificial anti-gravity? The Science Community have no concept that included the fundamental dynamic nature of gravity, which for centuries has been confused with the unknown Gravitational Effect. Therefore, humans have no ability to create anti-gravity. There is a double standard practiced by the science community. Generally there is a desire for a Quantum Field Theory to be developed and they have refused to evaluate the QFT provided by my 38 page E-PUB book titled “Explaining the Fundamental Dynamic Nature of Gravity” Billions of dollars are being spent on the search for Dark Matter and look-alike-Black holes and there is a refusal to pay the 5 dollars US to download a copy of my E-PUB book One download by a respected physicist would either assist humanities understanding of gravity or prove what I have often been referred to - a Crack Pot. ­ ",
            "date": "Answered October 24, 2019",
            "views": "49",
            "upvotes": " Answer requested by Peter Martinson",
            "upvoters": [
                {
                    "user_id": "Ryan Hall",
                    "user_href": "/profile/Ryan-Hall-34"
                },
                {
                    "user_id": "Enrique Casanovas",
                    "user_href": "/profile/Enrique-Casanovas-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Niranjan Kshirsagar",
                "href": "/profile/Niranjan-Kshirsagar"
            },
            "answer_text": "The research is ongoing. Still we are not in condition to say anything specifically about Anti-gravity. Due to expansion of universe physicist have speculated the phenomenon of anti-gravity. There are also two new things called Dark energy and Dark matter. But at present these all are just the names, mankind has no idea what they are!... ",
            "date": "Answered October 3, 2018",
            "views": "50",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Peter Landry",
                "href": "/profile/Patrick-Legland"
            },
            "answer_text": "If correlation is entanglement and entanglement is gravity. Then it stands to reason that the anti expression of correlation would produce Anti Gravity. This expression has the candidates of causation, systems so unrelated that there is no correlation between their components, or perhaps systems only correlated in their imaginary components. I cannot say if any of these candidates are correct or even sensiscal but the notion that anticorrelation whatever that is could cause Anti Gravity seems to be an avenue toward the creation of Anti Gravity. ",
            "date": "Answered October 24, 2019",
            "views": "34",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stephen Perrenod",
                "href": "/profile/Stephen-Perrenod"
            },
            "answer_text": "This is the dark energy, which appears to match a simple coamological constant, with an energy density that is positive, but a pressure that is negative. In the tensor equations of general relativity the negative pressure outweighs the positive energy density because it carries a factor of 3 (3 spatial dimensions) and the net effect is a ‘negative’ or repulsive gravity. See here for a more complete and more subtle discussion: Why Does Dark Energy Make the Universe Accelerate? It wins out because the more space you have the more dark energy, whereas matter dilutes as volume increases. ",
            "date": "Answered June 12, 2017",
            "views": "323",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Marvin Arriola",
                    "user_href": "/profile/Marvin-Arriola"
                }
            ]
        },
        {
            "author_info": {
                "name": "B Jimerson",
                "href": "/profile/B-Jimerson"
            },
            "answer_text": "I FIND THEORIES THAT IDENTIFY G AS THE CAUSE OF HUBBLE RECESSIONAL FLOW TO BE CREDIBLE - PARTICULARLY IN VIEW OF THE FACT THAT G ENCODES HUBBLE VOLUMETRIC ACCELERATION RC^2, WHICH FOLLOWS FROM FRIEDMANN'S EQUATION: DENSITY = 3H^2/4(pi)G. In other words, the primary cosmological impetus is the expansion field defined by G, which is divergent. The reaction of individual masses M to cosmological G field divergence, is the g Field of the individual masses. For a uniform spherical mass of radius r: g =— [4(pi)M]G/4(pi)r^2 which is Newton’s law: g = MG/r^2. ",
            "date": "Answered February 21, 2020",
            "views": "100",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rahul Chaudhary",
                    "user_href": "/profile/Rahul-Chaudhary-514"
                },
                {
                    "user_id": "Frank Instein",
                    "user_href": "/profile/Frank-Instein-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Santosh",
                "href": "/profile/Sandy-1788"
            },
            "answer_text": "Gravity is the sex between core and it's space of each atom, planet and star. Anti gravity means no sex between these two. If there is, no bounding between these two then result will be radiation. So radiation doesn't believe in gravity. Because it is not the core and not the space. Anything made by atoms, does not believe in anti gravity. ",
            "date": "Answered November 24, 2017",
            "views": "142",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Le Roi De Swardt",
                    "user_href": "/profile/Le-Roi-De-Swardt"
                },
                {
                    "user_id": "Harry Keller",
                    "user_href": "/profile/Harry-Keller-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Atul Tiwari",
                "href": "/profile/Atul-Tiwari-104"
            },
            "answer_text": "If body is with the acceleration more than g than we can say that body is in state of anti gravity if u are inside that body then you experience gravity towards upper side,i am not totally sure about this. ",
            "date": "Answered November 23, 2017",
            "views": "160",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jasveen Singh Sandral",
                    "user_href": "/profile/Jasveen-Singh-Sandral"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adam Jacholkowski",
                "href": "/profile/Adam-Jacholkowski"
            },
            "answer_text": "There is no anti-gravity and the only way to compensate it is a free fall like in case of the space (like ISS) station which is permanently falling but never reaching earth surface due to the earth spherical geometry. What is Microgravity? ",
            "date": "Answered October 24, 2019",
            "views": "50",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shriram Ramane",
                    "user_href": "/profile/Shriram-Ramane"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhishek Malapaka",
                "href": "/profile/Abhishek-Malapaka"
            },
            "answer_text": "Anti Gravity chambers can be created and are being created in institutes like ISRO,NASA etc where astronauts train for hours in these compartments so that their bodies gets used to the Zero-Gravity present in their spaceships. If not their bodies will collapse,if suddenly introduced to the 0 gravity space. ",
            "date": "Answered November 27, 2017",
            "views": "132",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Donald Walker",
                    "user_href": "/profile/Donald-Walker-54"
                }
            ]
        },
        {
            "author_info": {
                "name": "Samiran Kulkarni",
                "href": "/profile/Samiran-Kulkarni-1"
            },
            "answer_text": "It can't but we could create micro gravity using machines and scientists are search on Anti graviton that could cancel effect of graviton and there is also theory that Anti matter may have anti gravity but at conclusion till date Anti gravity can't exist or discovered . ",
            "date": "Answered November 25, 2017",
            "views": "50",
            "upvotes": " Answer requested by Bharti Bandawala",
            "upvoters": [
                {
                    "user_id": "Raghav Gade",
                    "user_href": "/profile/Raghav-Gade"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashok Narayan",
                "href": "/profile/Ashok-Narayan"
            },
            "answer_text": "Yes, it does. This is the repulsive force proportional to the mass of the object repelled and proportional to the distance from the repelling mass. It does not depend on the repelling mass. It is on account of the famous cosmological constant. It gave rise to the inflation in the beginning of the universe. Even now there is a small amount of it which is the cause of accelerating expansion. ",
            "date": "Answered March 6, 2018",
            "views": "192",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ryan Hall",
                    "user_href": "/profile/Ryan-Hall-34"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Wiebold",
                "href": "/profile/Jon-Wiebold"
            },
            "answer_text": "To understand how and why repulsive gravity, anti-gravity does not exist is tantamount to understanding something fundamental about gravity. Gravity is not fundamental. Gravity is always proportional to the gradient of time dilation. As such, gravity is the side effect of other phenomena and it does not have a negative aspect. ",
            "date": "Answered December 20, 2019",
            "views": "177",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sitaram Bettadpur",
                "href": "/profile/Sitaram-Bettadpur"
            },
            "answer_text": "Neither Newton's laws nor Einsteins gtr permit such a force. More important, there is no experimental evidence for such s force. ",
            "date": "Answered September 23, 2018",
            "views": "30",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Tejas Chitnis",
                "href": "/profile/Tejas-Chitnis-2"
            },
            "answer_text": "If you mean a force countering gravity then yes. But that would mean an electromagnetic force balancing out. But you cannot create anti gravity fields(where gravitational force does not exist.) ",
            "date": "Answered February 5, 2015",
            "views": "368",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Nrusingha Behera",
                "href": "/profile/Nrusingha-Behera-1"
            },
            "answer_text": "It may be such an inertial force that could act against gravity creating zero gravity or negative gravity bringing the body's motion along inertia. The practicality is to be observed. ",
            "date": "Answered September 23, 2018",
            "views": "40",
            "upvotes": " Answer requested by Noor Arafin"
        },
        {
            "author_info": {
                "name": "Kimber Stout",
                "href": "/profile/Kimber-Stout"
            },
            "answer_text": "There are no theories (so far). Theories require ‘proof’.There are conjectures. Time will tell what to make of them. ",
            "date": "Answered February 21, 2020",
            "views": "11",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Denis Loubet",
                "href": "/profile/Denis-Loubet"
            },
            "answer_text": "Artificial Anti-Gravity would be like trying to stand on the outside curve of a classic rotating space station, and letting the centrifugal force throw you off. ",
            "date": "Answered October 29, 2019",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Swingland",
                "href": "/profile/James-Swingland-1"
            },
            "answer_text": "Do anti-gravity propulsion systems exist? No. There is no experimental or theoretical reasin to believe they are possible. ",
            "date": "Answered October 17, 2019",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Harry Keller",
                "href": "/profile/Harry-Keller-5"
            },
            "answer_text": "They don’t. Gravity is a fundamental property of mass. It cannot be negative, which is what anti-gravity implies. Anti-gravity goes into the heap of science-fiction nonsense (much of science-fiction is not nonsense, but this is) such as FTL travel, time travel, and teleportation of humans. ",
            "date": "Answered October 24, 2019",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nick Curtis",
                "href": "/profile/Nick-Curtis-42"
            },
            "answer_text": "Humans can create the impression of zero gravity with power dives or, in the case if IFLY, with vertical winds tunnels.   ",
            "date": "Answered October 24, 2019",
            "views": "66",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Peter Jackson",
                "href": "/profile/Peter-Jackson-545"
            },
            "answer_text": "Nobody knows. Well, ..almost nobody. But it still can’t yet be done. www.isaacpub.org/images/PaperPDF/TP_100087_2019070910523565700.pdf ",
            "date": "Answered October 24, 2019",
            "views": "17",
            "upvotes": " Answer requested by Peter Martinson"
        }
    ]
}