{
    "title": "Can 'science' and 'humanities' be compared? If so, which is better? - Quora",
    "tags": [
        "Humanities",
        "The Human Race and Condition"
    ],
    "response": [
        {
            "author_info": {
                "name": "Siddharth Baskar",
                "href": "/profile/Siddharth-Baskar-2"
            },
            "answer_text": "These are two different subjects and both covering different aspects. For example Political science talks about the political background of the world and country and on the other hand a subject like biology talks about human body. I believe these subjects can’t be compared but definitely there is a link between the two. Each subject is somehow related to each other. Just like without understanding the population of the country(Geography) you can’t predict the number of people who have suffered from heart attacks in a year (Medical). Which is better? It depends on what you like. If you like to learn about how society changes, reasons for terrorism, role of United Nations in helping developing countries etc then you can choose humanities.But if you like mathematics, eager to learn about chemical reactions and how such reactions cause something new then you are intrested in science.It’s basically your mindset which makes you believe which is easy for you and what is difficult for you. For me it was humanities as I was interested to learn about aspects of our country, world.If you feel confused just flip a coin and when the coin is in air you will know which side to choose. That’s your intrest. When you are intrested and keen to study then you will definitely do well and make things easy be it humanities or science.Cheers :)",
            "date": "Answered June 5, 2018",
            "views": "197",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jyotishmita Kalita",
                    "user_href": "/profile/Jyotishmita-Kalita-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prashant Talreja",
                "href": "/profile/Prashant-Talreja-6"
            },
            "answer_text": "No they cant be compared on the contrary both of them are equally important.. Science makes us libral to think out of the box for the betterment of the society.Moreover it provides us wings of imagination which can lead us to anywhere,anything at any time. Humanities is the art of flying by using the Wings provided by the science.you can fly high if you know the tricks. ",
            "date": "Answered June 5, 2018",
            "views": "201",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jyotishmita Kalita",
                    "user_href": "/profile/Jyotishmita-Kalita-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suresh Sharma",
                "href": "/profile/Suresh-Sharma-646"
            },
            "answer_text": "We can't compare it…..till now. in future both compared where humanity is very low then artificial intelligence. Because AI become super intelligent and we humans are like a 3 year child. ",
            "date": "Answered June 8, 2018",
            "views": "54",
            "upvotes": "0"
        }
    ]
}