{
    "title": "Can a measurement be both precise and accurate? - Quora",
    "tags": [
        "Precision",
        "Accuracy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sid Kemp",
                "href": "/profile/Sid-Kemp"
            },
            "answer_text": "Yes. Precision and accuracy are two separate qualities of a measurement, and both can be improved to a great degree. It is easier to begin with accuracy. Picture an archery target. My measurement is demonstrated by shooting arrows at the target. Accuracy means I am on target. If I am highly accurate, but not very precise, all 10 arrows hit the target, but none hit the bulls eye. If I add precision, all hit the target, and all hit the bulls eye. If I shoot 10 arrows and all hit in a tight circle the size of a bulls eye, but all are, say 10 inches to the left of the actual bulls eye on the target, then I have precision, but not accuracy. Instead of accuracy, I have a bias ten inches to the left. If one works to eliminate bias and improve accuracy, one can reach a point of being on target with an incredible degree of precision. This is necessary in the manufacture of electronic components. For example, when we produce a flat-screen TV, millions of transistors must all be made so precisely and accurately that each one works. If one fails, then a pixel of the TV will not work. For a longer explanation of bias vs. accuracy and imprecision vs. precision, read my book Business Statistics Demystified. For a detailed explanation of how great accuracy and precision can be achieved through quality management and quality engineering, read my book Quality Management Demystified. ",
            "date": "Answered November 25, 2018",
            "views": "32",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joshua Gaoat",
                    "user_href": "/profile/Joshua-Gaoat"
                },
                {
                    "user_id": "Jaylah Carter",
                    "user_href": "/profile/Jaylah-Carter-2"
                },
                {
                    "user_id": "Erica Abad",
                    "user_href": "/profile/Erica-Abad-1"
                },
                {
                    "user_id": "Vea Caballero",
                    "user_href": "/profile/Vea-Caballero"
                },
                {
                    "user_id": "Audrey Godinez",
                    "user_href": "/profile/Audrey-Godinez"
                },
                {
                    "user_id": "Aleksandar Panovski",
                    "user_href": "/profile/Aleksandar-Panovski-1"
                },
                {
                    "user_id": "Peachez Chan",
                    "user_href": "/profile/Peachez-Chan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Bauer",
                "href": "/profile/Jon-Bauer-25"
            },
            "answer_text": "To be useful a measurement must be precise AND accurate. Measuring something to the last thousandth of an inch (precision) using a device with a built-in error (accuracy) of 1/10th of an inch (tape measure for example) makes the result questionable, if not useless. A measurement or machined dimension is only as precise as the least accurate operation. “Design it with a computer, measure it with a laser, mark it with chalk and cut it with an axe.” Old Engineering proverb. OK, in my college days “laser” was “micrometer” or perhaps “Grade 0 gage blocks”. ",
            "date": "Answered July 12, 2020",
            "views": "950",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Robert Mueller",
                    "user_href": "/profile/Robert-Mueller-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Khenan Mak",
                "href": "/profile/Khenan-Mak"
            },
            "answer_text": "Yes, it can:  [1] Footnotes[1] ExtremeTech - ExtremeTech is the Web's top destination for news and analysis of emerging science and technology trends, and important software, hardware, and gadgets.",
            "date": "Answered September 14, 2020",
            "views": "283",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Al Cohen",
                "href": "/profile/Al-Cohen-11"
            },
            "answer_text": "Of course it can. A measurement may be precise but inaccurate, imprecise but accurate, neither, or both. ",
            "date": "Answered July 12, 2020",
            "views": "655",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Danney Barr",
                "href": "/profile/Danney-Barr"
            },
            "answer_text": "Yes! ",
            "date": "Answered September 13, 2019",
            "views": "541",
            "upvotes": "0"
        }
    ]
}