{
    "title": "Can energy be stored? - Quora",
    "tags": [
        "Alternative Energy",
        "Energy (physics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Md Shah Alam",
                "href": "/profile/Md-Shah-Alam-33"
            },
            "answer_text": "We take it for granted that electricity will flow to our light bulbs, computers and microwaves at exactly the moment we need it. We owe that reliability to the electric grid, a vast and complicated machine that constantly adjusts to balance the supply of electricity coming in from power plants, wind turbines and solar panels with the demand from customers. To keep the grid humming, electricity has to be tucked away for times when demand exceeds supply. That’s especially true for renewable power — demand is sometimes greatest when the wind isn’t blowing or the sun isn’t shining. Right now, only about 2 percent of the electricity that can be generated can be stored on the grid. With more renewables coming online, more storage is needed, and soon. California has even mandated that 1,325 megawatts of energy storage be added to the grid by 2020. The race is on to find new and better ways to stash power. Scientists and entrepreneurs are already testing new technologies and improving old ones to expand capacity and bring down costs. “There’s going to be a shakeout, as to which technologies are truly ready,” says Jeff Chamberlain, executive director of the Joint Center for Energy Storage Research based at Argonne National Laboratory. “It’s going to be a blood bath for the technologists.” 1. Compressed Air Energy Storage (CAES) How it works: At times of low energy demand, motors powered by electricity or natural gas compress air and pump it into an underground cavern, abandoned mine or other large confined space. Later the air is released and heated. As it expands, it drives a turbine to make electricity. Pros: Proven. Cities and mining operations have been using CAES for decades. It’s relatively cheap, and it involves no toxic materials. Cons: Requires a cavern or other suitable space.  2. High-Speed Flywheels How it works: When demand is low, electricity is sent to a motor that accelerates a cylinder spinning in a case, which is vacuum-sealed to reduce friction. When electricity demand is high, the resulting kinetic energy is converted back to electricity. Pros: Responds almost instantly to changing energy needs. Cons: Stored energy lasts only about 15 minutes, good just for short bursts. 3. Pumped Hydro How it works: Electricity is used to pump huge volumes of water from a lower reservoir to an upper one. When energy is needed, the water is released to flow through turbines, generating electricity. Ninety-five percent of stored energy currently on the grid is in pumped hydro. Pros: Can store large amounts of energy — 10,000 MWh in a reservoir a kilometer in diameter and 25 meters deep. Storage installations last a half-century or more. Cons: Requires space for a deep reservoir, and water to fill it. Low storage capacity despite the large volume of water involved. 4. Vehicle-to-Grid How it works: Electric vehicles can double as batteries plugged into the grid, saving up power at night when electricity demand is low. Then they can send electricity back to the grid at peak times. An aggregator pools the power into one large source. Pros: Can be used anywhere there is a parking spot and a plug. Owners can receive compensation for energy sent back to the grid under utility companies’ net metering policies. Cons: Extra charging and discharging can wear out the battery sooner. Feeding the grid could drain the battery, requiring it to be recharged before driving. 5. Rail Energy Storage How it works: Electric trains loaded with rocks or dirt travel up a slope when electricity demand is low. Then when electricity is needed, the rail cars slide back down the hill, and a regenerative braking system makes electricity as they go. The longer the slope, the better. Pros: Can release large amounts of power quickly. Technology is proven, and plans are in the works for a 50-MW rail energy storage system in Nevada attached to California’s grid. Cons: Lots of space and a hill are needed, and it works only in certain remote locations. 6. Solid Electrochemical Batteries How it works: Batteries basically store and then release energy by sending ions through chemical compounds between negative (anode) and positive (cathode) terminals. Pros: Proven. Solid batteries have been around for more than 200 years, but advances in the materials and chemistry of lithium ion and other batteries have made them much more efficient and effective. They can be used anywhere. Cons: Expensive and store relatively small amounts of energy. Safety risks, including fires  7. Flow Batteries How it works: Flow batteries work in a similar way to typical solid batteries, but they can store exponentially greater amounts of energy since the chamber where the electrochemical reaction occurs is attached to large tanks that hold electrically charged liquid. The fluid in one tank has a positive charge, and the fluid in the other tank is negatively charged. Pros: Large amounts of electricity can be released quickly. Cons: Space is needed to store the large tanks of liquid. Risk of pollution from leaking and sometimes unreliable.  8. Molten Salt Storage How it works: When demand is low, mirrors reflect sunlight onto tanks of molten salt, heating them almostto 1,000 F. When demand is high, the salt’s heat turns water into steam to drive a turbine, making electricity. Pros: Proven. Molten salt thermal storage is used at large-scale solar installations attached to the grid. Cons: Need lots of space for tanks.  9. Thermal Energy Storage How it works: When demand is low, electricity is used to freeze or chill water that is stored in tanks on rooftops or inside buildings. Then at peak demand times, the ice or cold water is used to cool air for large office or industrial buildings, meaning they need much less power from the grid. Pros: Simple thermal energy storage — hauling ice into the city to cool buildings — has been used for centuries. Thermal is among the cheapest types of energy storage. Cons: Cooling buildings is only helpful in the summer. ",
            "date": "Answered May 11, 2018",
            "views": "110",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Hitesh Bhandari",
                    "user_href": "/profile/Hitesh-Bhandari-30"
                }
            ]
        },
        {
            "author_info": {
                "name": "Moshe Nazarathy",
                "href": "/profile/Moshe-Nazarathy-1"
            },
            "answer_text": "Energy can be stored - in particular be grateful for it whenever you charge your cellular phone. Energy storage is ubiquitous around us - e.g. as as potential energy mechanically, e.g. lifting a weight up, or chemical energy storage in a battery (be it rechargeable or not), or the energy of the sun is stored in the plants and subsequently in the oil that the plants turn into, or electrically by running a current in a coil (magnetic energy) or by charging a capacitor (electrical energy). The stored energy may subsequently be released (i.e. turned into other forms of energy), e.g. when the uplifted weight drops and picks up speed, when the energy stored into the iPhone generates sound energy and electromagnetic energy (waves), when the capacitor or coil discharges and the current causes heating or some other action, when the tree or oil burns and releases heat energy (kinetic motion on a micro-scale). The name of the game in “green technology” is efficient energy storage, e.g. hydrogen cells or better batteries. ",
            "date": "Answered December 30, 2016",
            "views": "505",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Doug Millhoff",
                "href": "/profile/Doug-Millhoff"
            },
            "answer_text": "Energy can be stored in many ways. Energy is stored in wood and coal and petroleum and methane, released as heat and lightwhen we burn it. Energy is stored when you fill a balloon or canister with compressed air. Energy is stored when you charge a battery. Energy is stored when you wind-up a rubber band. Energy is stored when you dam up a river. Energy is stored when you lift a weight. Energy is stored when you shine a light on glow-in-the-dark material. Energy is stored in hydrogen and helium and other fusable atoms, released in stars as heat and light. When a star collapses and explodes, some of that energy is stored in uranium produced by that explosion. If energy couldn’t be stored, life would not exist and you would not be here to use stored energy to post this question on Quora. ",
            "date": "Answered August 19, 2017",
            "views": "187",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "George Davros",
                "href": "/profile/George-Davros"
            },
            "answer_text": "There are several ways energy can be stored, but first the equations: E= mc^2 and…., Total Energy = potential/stored energy (PE) + kinetic energy (KE) also…, there are 2 types of stored energy - gravitational (G) and electromagnetic (EM) Examples: 1. A book placed on a table - push the book off and stored energy is converted into kinetic energy due to gravitational stored energy. 2. Water from the ocean which evaporates due to energy stored in the sun and is transformed into rain which fills reservoirs and provides a power source in the form of kinetic energy from turbine generators. 3. Nuclear weapons where stored energy in the form of energy stored in the mass of a nucleus is converted into kinetic energy. BTW: the sun is actually gravitational energy (G) which then gets converted into photons, also known as (EM) type energy. In conclusion: Total Energy = G + EM = PE + KE. And the stored portion is just the inactive form of the other. ",
            "date": "Answered August 19, 2017",
            "views": "904",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sangram Sundaray",
                    "user_href": "/profile/Sangram-Sundaray-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dennis Yoj",
                "href": "/profile/Dennis-Yoj"
            },
            "answer_text": "Yes it can but not easy for the householder. Commercially they can pump water up a hill to a lake when there is a lot of power available, maybe in the wee hours. Then let it flow down and turn a generator. Householders can charge a bank of batteries, then use them as a power source but probably will have to use an inverter to convert to AC at 120/240. Getting the frequency right too is important. ",
            "date": "Answered August 3, 2018",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rugada Manikanta",
                "href": "/profile/Rugada-Manikanta"
            },
            "answer_text": "Big Yes for Storing Small quantity of energy Big NO For Storing Large quantity of energy we can store Energy in battery in small quantity. we cant store large quantity because of it required hues space to build. for this tesla coming they already established in Australia some other process there these are not much reliable Compressed Air Energy Storage, High-Speed Flywheels, Hydro Reservoir, ",
            "date": "Answered May 12, 2018",
            "views": "69",
            "upvotes": " Answer requested by Quora User",
            "upvoters": [
                {
                    "user_id": "Parth Parikh",
                    "user_href": "/profile/Parth-Parikh-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pradeep Rathi",
                "href": "/profile/Pradeep-Rathi-1"
            },
            "answer_text": "Yes, we can and we always do. When you pump water to overhead tank you have stored energy (electricity neeeded) in form of Potential Energy. We store electrical energy in form of chemical energy in rechargeable batteries. Chemical and potential energy is probably most common way of storing energy. ",
            "date": "Answered May 12, 2018",
            "views": "72",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/RANJITHKUMAR-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashish Kori",
                "href": "/profile/Ashish-Kori"
            },
            "answer_text": "Hello Ranjithkumar… Of course we can store energy. We are using mobile/laptops because we’ve stored electrical energy in its batteries. You’re typing this question bcz you have stored energy from food within you. You’ve stored chemical energy in your bike/car as fuel. You’ve stored chemical energy in the cooking gas cylinder. You’ve stored potential energy in the water tank above. These and many more. We might use that stored energy in its other form. See around yourself you’ll get many examples. PEACE OUT !!! ",
            "date": "Answered May 11, 2018",
            "views": "86",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ahmed Burak Tapan",
                    "user_href": "/profile/Ahmed-Burak-Tapan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sai Raja Gudepu",
                "href": "/profile/Sai-Raja-Gudepu"
            },
            "answer_text": "yes but in only few ways.when we say energy it means a broad term . energy has various types like solar energy ,wind energy mostly the name used is derived from the source .we can store energy in some form like in charges between plates(capacitor), battery,mostly these all store energy in form of current ",
            "date": "Answered May 12, 2018",
            "views": "53",
            "upvotes": " Answer requested by Quora User"
        },
        {
            "author_info": {
                "name": "Prasoon Singh",
                "href": "/profile/प्रसून-सिंह-Prasoon-Singh"
            },
            "answer_text": "Energy stored in batteries are being used in general . But there are so many types of energy we can store. 1 pressure energy 2. Vaccum energy . 3 . weight lifted energy 4.energy collected in form of water in dams. 5 . pressed spring as spring watches have. 6.fuel of all kind 7 . Human mind in deep rest. ",
            "date": "Answered May 16, 2018",
            "views": "19",
            "upvotes": " Answer requested by Quora User"
        },
        {
            "author_info": {
                "name": "Jim Rhodes",
                "href": "/profile/Jim-Rhodes-16"
            },
            "answer_text": "Do you own a cell phone, have you every used a flashlight, have you ever driven a motor vehicle? All of these make yse of batteries, which store energy to be used on demand. There are many other ways to store energy. A fuel tank for an engine, a reservoir for a hydroelectric plant are just a few examples. ",
            "date": "Answered August 3, 2018",
            "views": "60",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vignesh Rajendran",
                "href": "/profile/Vignesh-Rajendran-42"
            },
            "answer_text": "Yes. A capacitor. What does it do? A car battery, a remote battery, a pressure cooker… Energy is every where. We can use it and convert it…But can never create or destroy. ",
            "date": "Answered May 12, 2018",
            "views": "100",
            "upvotes": " Answer requested by Quora User"
        },
        {
            "author_info": {
                "name": "Siddharth Mishra",
                "href": "/profile/Siddharth-Mishra-181"
            },
            "answer_text": "Energy can be stored because when you will study Quantum Mechanics then you will know that Mass is the concentrated form of energy ",
            "date": "Answered December 1, 2016",
            "views": "103",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Rory Young-Sang",
                "href": "/profile/Rory-Young-Sang"
            },
            "answer_text": "Yes! E=mc². ",
            "date": "Answered August 5, 2018",
            "views": "6",
            "upvotes": "0"
        }
    ]
}