{
    "title": "Can we change our nature and how? - Quora",
    "tags": [
        "Nature",
        "Self-Improvement",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kiran Katawa",
                "href": "/profile/Kiran-Katawa"
            },
            "answer_text": "Yes Asha. I would put it little differently: One can get in touch with the real nature and come out the non-working beliefs about self/others and world, which one is holding on to. The first step for any change is understand where you’re. You need to create an awareness about yourself and learn about the methods and tools, which let you know where you’re. You may have to attend some personality, behavioural classes or read books; Now, once you understand, first thing to answer is: Is it really required for you to change the nature? What’s wrong with the current nature? I think these initial steps are enough to put you on the journey of change. Note that this is not a black and white, fixed in stone approach. You’ll keep getting the answers from within, as you start pealing the layers of your personality. ",
            "date": "Answered October 18, 2019",
            "views": "533",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "George David",
                "href": "/profile/George-David-48"
            },
            "answer_text": "Yea.. we can change our nature.. But we cannot change our surrounding.. And u can change ua nature… U must be very flexible to change ua nature.. u wannu accept ua faults without any egos.. be matured.. listen patiently.. and then talk.. U must learn patience first.. very precious thing.. live for ua SELF.. ",
            "date": "Answered February 24, 2017",
            "views": "361",
            "upvotes": " Answer requested by Mahaveer Chauhan",
            "upvoters": [
                {
                    "user_id": "Rohini",
                    "user_href": "/profile/Rohini-143"
                },
                {
                    "user_id": "Mahaveer Chauhan",
                    "user_href": "/profile/Mahaveer-Chauhan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Indra Neel",
                "href": "/profile/Indra-Neel-9"
            },
            "answer_text": "Hi Mahaveer, thank you for A2A. Yes we can. I’d say the best way is to observe and understand the positives we are capable of exhibiting or expressing through our own being. Once we’re clear, we should start implementing it. When you think about it, it’s the basics that parents teach a child. ",
            "date": "Answered February 24, 2017",
            "views": "537",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Itaf Hussain Mansuri",
                    "user_href": "/profile/Itaf-Hussain-Mansuri"
                },
                {
                    "user_id": "Gaurav Belkhede",
                    "user_href": "/profile/Gaurav-Belkhede"
                },
                {
                    "user_id": "Aditya Jha",
                    "user_href": "/profile/Aditya-Jha-422"
                },
                {
                    "user_id": "Shobhit Chawla",
                    "user_href": "/profile/Shobhit-Chawla-6"
                },
                {
                    "user_id": "Praful Jha",
                    "user_href": "/profile/Praful-Jha-1"
                },
                {
                    "user_id": "Upasana Sahu",
                    "user_href": "/profile/Upasana-Sahu-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Uday Kumar",
                "href": "/profile/Uday-Kumar-1435"
            },
            "answer_text": "It's just changing the way you see the things.If you dwell on negative you will see it as negative. If you see it as positive you get positive results. Change your self-talk ,you will speak to yourself daily without your conscious. It will impact on your life . So choose positive self talk with yourselves. Change your thoughts. Watch your thoughts, for they become words. Watch your words, for they become actions. Watch your actions, for they become habits. Just change your thinking pattern ,to see the change you want. ",
            "date": "Answered February 24, 2017",
            "views": "487",
            "upvotes": " Answer requested by Mahaveer Chauhan"
        },
        {
            "author_info": {
                "name": "Sahana Nagaraja",
                "href": "/profile/Sahana-Nagaraja-2"
            },
            "answer_text": "Be optimistic.Think positive. Get rid of negative thoughts and people from your life.Have self confidence.There's a thin line between self confidence and over confidence. Beware of that. Set your goals.Work hard towards achieving them. Don't let anything or anyone distract you from your goals.Always compete with yourself.Be a better person that you were yesterday.Be calm.Spread love and happiness unconditionallly. The more you give, the more you get.Accept failure and success equally.Learn from your mistakes.Let go of things which don't belong to to you.Be thankful to god for this beautiful life.Thanks for the A2A @Mahaveer Chauhan !! ",
            "date": "Answered February 24, 2017",
            "views": "2",
            "upvotes": " View 6 Upvoters "
        }
    ]
}