{
    "title": "Can science prove the existence of an intelligent world that rules our universe? Split of Theory of everything - Quora",
    "tags": [
        "Theories of Everything (physics)",
        "Existence",
        "The Universe",
        "Intelligence",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Werner",
                "href": "/profile/Mark-Werner-4"
            },
            "answer_text": "Science doesn’t “prove” much of anything….. Leave that to the mathematicians. Science deals with the observable and testable, and offers the best possible explanation of how things work. In regards to your question, there is no evidence whatever of an “intelligent world” that would somehow “rule the universe”. If anyone is ruling us, they haven’t bothered to tell us about it. As to the “theory of everything”…. Again, people misunderstand this. The “Grand Unified Theory” is just the attempt to theoretically reconcile the four forces of the universe….. Electromagnetism, gravity, and the strong and weak nuclear forces. At present, we can reconcile Electromagnetism and the nuclear forces, but not Gravity. But that’s all it is… Not “Everyhting”…. Just the four forces. ",
            "date": "Answered October 24, 2020",
            "views": "35",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anders Rehnberg",
                "href": "/profile/Anders-Rehnberg"
            },
            "answer_text": "We have NO evidence, observations or experiments that point to this. We have no hypotheses, theories or research giving us reason to believe this is true. We see no logical or rational reasons to contemplate this line of inquiry. Therefore, no scientists are pursuing these ideas until, and if, compelling reasons materialise. Sorry, we just have to live with this current chaotic, non-predestined universe :):) ",
            "date": "Answered October 24, 2020",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alistair Riddoch",
                "href": "/profile/Alistair-Riddoch-1"
            },
            "answer_text": "Cant control a universe in any way that could relate to a human life. Information propagates too slowly for any kind of centralized universal overseers to receive and react to real time events happening billions of light years away. Which is the flaw in all the theorized deities and creators that make or designed the universe, and also “lord” over it. There is no physics which facilitates any of that being possible. ",
            "date": "Answered October 24, 2020",
            "views": "32",
            "upvotes": "0"
        }
    ]
}