{
    "title": "Can soap be used to identify water as hard or soft? - Quora",
    "tags": [
        "Soft Water",
        "Hard Water",
        "Soaps"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shravani I.S",
                "href": "/profile/Shravani-I-S"
            },
            "answer_text": "Find a clean glass or plastic bottle with a tight-fitting cap. Fill the bottle 1/3 full with water straight from the faucet (should be about 8 to 10 ounces). Add 10 drops of dish washing liquid; use pure liquid soap (not \"detergent\") and shake well for at least 10 seconds. Set the bottle down and observe the results: If the soapy solution foams up quickly, creating a lot of suds, and the water below the suds layer is relatively clear, you probably have at least fairly soft water.If the solution does not foam up well, creating only a shallow layer of suds, and the water below the suds is cloudy, you likely have hard water.",
            "date": "Answered November 16, 2017",
            "views": "339",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "M Tayyab Aleem Gill",
                    "user_href": "/profile/M-Tayyab-Aleem-Gill"
                },
                {
                    "user_id": "Malcolm Sargeant",
                    "user_href": "/profile/Malcolm-Sargeant"
                },
                {
                    "user_id": "Jeff Barber",
                    "user_href": "/profile/Jeff-Barber-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Goodman",
                "href": "/profile/Robert-Goodman-15"
            },
            "answer_text": "Not only identify, but quantify! It's a standard test. You can look up a formula to make your own test solution. I've done it in the lab with my chem students as an addition to their water analysis experiment. I made a non-quantitative but uniform dilution of Liquid Ivory soap (a discontinued product, not their dishwashing liquid nor their current hand wash) in deionized water, then titrated a known volume of test water with it, pipetting the soap solution in and shaking. I do it once to get a rough end point when suds start to form, then another more slowly to get an accurate end point. Then I standardize the soap solution by similarly titrating with a known volume of a magnesium chloride solution of known concentration sold as a dietary supplement. That gives me the total \"hardness\" equivalents concentration in the water sample. I use that to caculate the concentration of sodium being put into the water by the PortaSoft unit to \"soften\" it completely. Water \"hardness\" is conventionally expressed in English units in terms of equivalent grains of CaCO3 per gallon. ",
            "date": "Answered November 16, 2017",
            "views": "211",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sean McKiernan",
                    "user_href": "/profile/Sean-McKiernan"
                }
            ]
        },
        {
            "author_info": {
                "name": "mynn",
                "href": "/profile/mynn"
            },
            "answer_text": "yes, soap can be used to identify hardening or softening of water. if soap get easily dissolve in water, it means water is soft and vise versa. ",
            "date": "Answered November 16, 2017",
            "views": "26",
            "upvotes": "0"
        }
    ]
}