{
    "title": "Can photon particles, i.e. light, produce sound? - Quora",
    "tags": [
        "Light (physics)",
        "Photons",
        "Speed of Light",
        "Waves (physics)",
        "Visible Light",
        "Relativity (physics)",
        "Sound",
        "Particle Physics",
        "Physics of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Apurv",
                "href": "/profile/Apurv-57"
            },
            "answer_text": "Suppose a big tree falls in a forest nearby. Will there be a sound? For someone who was standing in front of tree - Sound was terrible.For someone who is sitting in his living room close to the forest - Sound was faintly audible.For someone residing in other city - No sound was audible.Sound is produced, when anything vibrates. And here the word “anything” literally means anything. Even a thing as small as an atom produces sound while vibrating and that sound is called as “Phonon” (basic unit of sound in quantum physics) Sadly, human ears can only hear sound ranging from 20 HZ to 20,000 HZ. Also, there should be a presence of at least one of the medium - be it Solid, liquid or gas, which can transfer the vibration to human ear from the source of sound. Sound can't travel in vacuum. Now we should analyze how a photon interacts with matter. When a photon interacts with matter, there are mainly three possibilities - The photon may pass through the matter without interacting with the material particles - in this case no sound will be produced.The photon collides with material particle, submit it's entire energy to particle and itself vanishes - in this case, sound will be produced.The photon collide with material particle and gets scattered by transferring a part of its energy to material particle - in this case also, Sound will be produced.The real question here is - whether a “Photon” can produce sound which is loud enough for human ear to sense? The energy of photons are measured in electron-Volts (1 eV = 1.602 × 10 ^ (-19) Joules) So you can imagine how intense an electromagnetic wave should be, to hit some particle and produce detectable sound. Theoretically - the answer is YES. Practically - it is not desirable. Unless you devise a system which has relevance of producing sound using light. Regards Apurv  Image source: http://www.sprawl.org ",
            "date": "Answered July 21, 2020",
            "views": "483",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Swãyam Sitāra",
                    "user_href": "/profile/Swãyam-Sitāra"
                },
                {
                    "user_id": "Bhushan N",
                    "user_href": "/profile/Bhushan-N-11"
                },
                {
                    "user_id": "Aniruddha Trivedi",
                    "user_href": "/profile/Aniruddha-Trivedi-3"
                },
                {
                    "user_id": "Gautam Shah",
                    "user_href": "/profile/Gautam-Shah-63"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kim Aaron",
                "href": "/profile/Kim-Aaron"
            },
            "answer_text": "Can photon particles, i.e. light, produce sound? Yes. Sort of. Some decades ago, I was doing some wind tunnel experiments and needed to create a pulsed sheet of laser light across the wind tunnel to freeze the action. I used an argon ion laser that pulsed ten times a second. Each pulse lasted about 50 ns. The average power of the laser was 2 W. That’s means each pulse had 0.2 J of energy. During the short time of each pulse, the power of the laser was 0.2 J/ 50 ns = 4 MW. When I needed to check the alignment of the laser to make sure the beam coming out was close to circular, I’d put some photosensitive paper inside a transparent plastic envelope and swing it through the beam. I’d get a series of burn marks on the paper and it would make a fairly loud TAC TAC TAC sound as each pulse of energy hit the paper. You could say that the sound was due to rapid vaporization of the chemicals on the paper just due to the rapid release of energy. Maybe the photons, per se, didn’t make the noise. But they certainly caused the noise. ",
            "date": "Answered July 20, 2020",
            "views": "189",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "José Esteves B. Rabello",
                    "user_href": "/profile/José-Esteves-B-Rabello"
                },
                {
                    "user_id": "Nick Kirby",
                    "user_href": "/profile/Nick-Kirby-9"
                },
                {
                    "user_id": "Nishantt Nagarajan",
                    "user_href": "/profile/Nishantt-Nagarajan"
                },
                {
                    "user_id": "David Wilmshurst",
                    "user_href": "/profile/David-Wilmshurst"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Fell",
                "href": "/profile/Andrew-Fell-2"
            },
            "answer_text": "This is just a reasoned answer but if a crookes radiometer can create mechanical movement directly from sunlight then it might be a brave person to say that light can’t produce sound come to think of it, as a curious youngster did you ever use a magnifying glass to make ants sizzle and pop? ",
            "date": "Answered July 20, 2020",
            "views": "146",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Eli Pasternak",
                "href": "/profile/Eli-Pasternak"
            },
            "answer_text": "Yes it can. Photons carry momentum therefore photons hitting an object can cause it to vibrate and produce sound. A single photon of light is too weak to cause audible sound but a bunch of them can do it. ",
            "date": "Answered July 20, 2020",
            "views": "51",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Nick Kirby",
                    "user_href": "/profile/Nick-Kirby-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "D Gokul",
                "href": "/profile/D-Gokul"
            },
            "answer_text": "Yes definitely, light can produce sound . but, it's not easy .it occurs at peak stage then the particles are able to vibrate the objects then we can hear the sound produced by light ",
            "date": "Answered July 20, 2020",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jonathan Hardis",
                "href": "/profile/Jonathan-Hardis"
            },
            "answer_text": "“Can photon particles, i.e. light, produce sound?” If you include “making a mirror vibrate at audio frequencies,” then yes. That’s one of the limiting factors of LIGO. LIGO R&D ",
            "date": "Answered July 21, 2020",
            "views": "13",
            "upvotes": " Answer requested by Nick Kirby"
        },
        {
            "author_info": {
                "name": "Jørgen Dal",
                "href": "/profile/Jørgen-Dal-1"
            },
            "answer_text": "An example of modulated light varrying sound signal is found in old films with a parallel visual soundtrack. Sound film pioneers Petersen and Poulsen:  ",
            "date": "Answered July 20, 2020",
            "views": "49",
            "upvotes": " Answer requested by Nick Kirby"
        }
    ]
}