{
    "title": "Can you state and explain Coulombs law in electrostatics? Explain it mathematically for two point charges. Does the form depend on the system of units? - Quora",
    "tags": [
        "Coulomb's Law"
    ],
    "response": [
        {
            "author_info": {
                "name": "Max Throm",
                "href": "/profile/Max-Throm"
            },
            "answer_text": "Coulomb’s Law is F=kq1q2r2F=kq1q2r2. This equation gives the value of the force FF between two point charges of charge q1q1 and q2q2, respectively. rr is the distance between the two point charges. kk is a constant called Coulomb's constant. The units for electromagnetism are a lot different than for mechanics. Say I wanted to go from meters-kilograms-seconds (MKS) to centimeters-grams-seconds (CGS) for Newton's Law. Using F=maF=ma, force is measured in kilogram meters per second squared or the newton. To convert a given force to CGS units, I would have to multiply by 1000 to make kilograms grams and then multiply by 100 to make meters centimeters. The unit of force in the CGS system is called the dyne (one gram centimeter per second squared). From this you can find that 100,000 dynes equals one newton. For electromagnetism it gets a little trickier. Converting to CGS from MKS and vice versa isnt just multiplying by some power of ten. In the SI system of units, current is the fundamental unit. Its definition leads to constants in Maxwell's equations and Coulomb's law. Coulomb's constant is k=14πε0k=14πε0 where ε0ε0 is the permittivity of free space. In the MKS system, k≈9⋅109k≈9⋅109. However, in Gaussian CGS units charge is the fundamental electromagnetic unit and is defined by setting k=1k=1. This means that ε0=14πε0=14π. In Gaussian units, Coulomb's law equals F=q1q2r2F=q1q2r2. However again, there is another type of CGS units called Lorentz-Heaviside units. Charge is still the fundamental electromagnetic unit but instead of k=1k=1, k=14πk=14π so Coulomb’s Law reads F=14πq1q2r2F=14πq1q2r2. ",
            "date": "Updated June 8, 2017",
            "views": "25",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Golam Salem",
                    "user_href": "/profile/Golam-Salem"
                },
                {
                    "user_id": "Rakesh Kumar",
                    "user_href": "/profile/Rakesh-Kumar-7099"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maths Tutor",
                "href": "/profile/Maths-Tutor-4"
            },
            "answer_text": "this video explains Coulombs law of electrostatics mathematically with worked examples  ",
            "date": "Answered February 7, 2018",
            "views": "326",
            "upvotes": "0"
        }
    ]
}