{
    "title": "Can fixed dogs go into heat? - Quora",
    "tags": [
        "Dog Health",
        "Canine Veterinary Medicine",
        "Veterinary Medicine"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lois Harford",
                "href": "/profile/Lois-Harford"
            },
            "answer_text": "It used to be that when a female dog was spayed, a full hysterectomy was what was automatically done. Uterus and ovaries removed. Today, there are some situations where a female is “spayed”, but only her ovaries are removed, so no eggs are produced, so she won’t go into heat, and the hormones are no longer produced, so the uterus atrophies on its own. It’s somewhat less invasive, so easier recovery, but is only appropriate for young dogs. Not all vets do this, and it isn’t appropriate in all cases, so one should listen to their vet’s rationale. Either way, if she goes into heat, it is usually because some ovarian tissue has been left behind, and the vet needs to know about it. The pet can’t get pregnant, but if it’s causing chaos around your home, or on walks, that can be problematic! Hormones can take a little while to completely disappear, so a female can still smell attractive to a male for 3 or 4 weeks after a spay, possibly a bit more. You’d want to protect her while she is still relatively recently post-surgery. After that, though, you’d want to ask the vet if something’s wrong. ",
            "date": "Answered December 26, 2017",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kimberly Thompson",
                    "user_href": "/profile/Kimberly-Thompson-123"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jake Vinson",
                "href": "/profile/Jake-Vinson-2"
            },
            "answer_text": "99% of the time I would say no they should not. However, there are multiple ways to “spay” a dog. They are all different in some fashion and could've resulted in (your?) dog going into heat. standard practice for a spay is an ovariohysdirectomy. Ovario refers to the ovaries, hyst refers to the uterus, and ectomy meaning to surgically remove. This means that in this process, the entire reproductive tract is surgically removed from the animal including the ovaries (which are responsible for the hormonal changes that causes heat). However, if the removal was incomplete or for some weird reason an ovary was left either on accident or under the assumption that it did not exist, and enough of the uterus was left intact (again highly unusual, I've never heard of this happening) then the dog could still cycle. 2 other methods of “spaying” is an ovariectomy (removal of the ovaries) or simply tying the Fallopian tubes. Again, In either case if done improperly you now have an intact reproductive tract that can cycle if ovaries remain or if an egg manages to get through the tie. If your dog is still cycling after being spayed I wouldn't worry about it much more than maybe the surgeon missed something. I would advise you to get it looked at though, a dogs risk for cancer in the reproductive tract increases exponentially with each heat cycle. ",
            "date": "Answered December 12, 2016",
            "views": "16",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chris Freeman",
                    "user_href": "/profile/Chris-Freeman-66"
                }
            ]
        },
        {
            "author_info": {
                "name": "Meila Torris",
                "href": "/profile/Meila-Torris"
            },
            "answer_text": "Well from my experience as a vet I've seen most (a large sum) of dogs even cats that get fixed still go into heat. Why? Once a dog starts and continues they begin to like the feeling and get used to it so they continue to do it even though they're fixed. Ist normal but should stop in less than 6 to 9 years.(this is a average number from the dogs I treat) not all dogs go into heat if you get them spayed or neutered correctly some people do the fastest one and it doesn't really stop their pets from going into heat ",
            "date": "Answered December 26, 2017",
            "views": "413",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Katie Bjorkman",
                "href": "/profile/Katie-Bjorkman"
            },
            "answer_text": "No an altered female dog should not be able to go into heat. Heat in a female dog is due to hormonal changes in the dog’s body caused by the ovaries. During spaying, the ovaries (along with the uterus) are removed. It is possible, though quite rare, for a fixed female to get an infection if a small “stump” of uterus was left when she was spayed. This is very dangerous for her and veterinary attention should be sought at once for any discharge from that part of her. ",
            "date": "Answered December 11, 2016",
            "views": "547",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Suzanne Reiter",
                    "user_href": "/profile/Suzanne-Reiter-1"
                },
                {
                    "user_id": "Donna Pringle",
                    "user_href": "/profile/Donna-Pringle-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bette Stalford",
                "href": "/profile/Bette-Stalford"
            },
            "answer_text": "Firstly, and call me pedantic, dogs do not have seasons, bitches do. After spaying, which involves a complete hysterectomy they do Not, but there are rare cases where the vet leaves an ovary behind, Not intentionally, they just forget to count. The ovary can migrate to other areas, but it still emits pheranomes which make dogs think the bitch is in season. When one of our Sam bitches was spayed, due to pyo, she came in from the garden one night and lost blood, and it wasn't simply from the stump, when cleaning up I found an ovary which had been left behind, which she had “ blown\", I wrapped it in cling film and put it in the freezer, then took it to the surgery next day, and presented it to the senior partner. Our bill for the spaying was cancelled as a result. ",
            "date": "Answered August 20, 2019",
            "views": "307",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Michael Thomas",
                    "user_href": "/profile/Michael-Thomas-629"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Wallen",
                "href": "/profile/James-Wallen-1"
            },
            "answer_text": "If the process was correctly performed, no. There might be a pseudo-heat but the female simply lacks the ability to go into heat and conceive. There simply should not be the fluid droppings that indicate heat. That doesn't mean she won't ever act like she is in heat or that the males won't try to mount her from time to time to time, but she shouldn't allow a male to do that normally. ",
            "date": "Answered December 26, 2017",
            "views": "221",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Suzanne Reiter",
                    "user_href": "/profile/Suzanne-Reiter-1"
                }
            ]
        }
    ]
}