{
    "title": "Can matter exist without energy? - Quora",
    "tags": [
        "Matter (physics)",
        "Existence",
        "Energy (physics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christopher Johnson",
                "href": "/profile/Christopher-Johnson-604"
            },
            "answer_text": "Can matter exist without energy? Since a particle of matter is an energetic excitation in a quantum field, energy is needed for matter to exist. Matter is not made of energy, but does have energy in the form of mass energy. This energy can be converted and released as other forms of energy, as shown by Einstein’s famous equation, e=mc2 (energy equals mass times the speed of light squared). It is a misconception that there are things that are made of energy, and another misconception that there can be pure energy. ",
            "date": "Answered November 28, 2019",
            "views": "195",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Bass",
                "href": "/profile/Michael-Bass-116"
            },
            "answer_text": "No. And not for lack of trying. You ever hear of a Bose–Einstein condensate? The fifth state of matter, after plasma, a BEC is a really, REALLY cold solid. For decades scientists have been trying to create a BEC with a temperature of 0 Kelvin. They’ve gotten close. But an object with absolutely no heat might very well be impossible. Certainly we’ve never observed it. And since all matter has a temperature of >1 Kelvin, all matter that we know of has at least some energy. And that’s just heat. There’s also the nuclear forces and all that. But let’s focus on the obvious. ",
            "date": "Answered March 24, 2020",
            "views": "194",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jason Skelly",
                    "user_href": "/profile/Jason-Skelly-3"
                },
                {
                    "user_id": "Christine Shultz",
                    "user_href": "/profile/Christine-Shultz-3"
                },
                {
                    "user_id": "Dan Conlin",
                    "user_href": "/profile/Dan-Conlin-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adam Jacholkowski",
                "href": "/profile/Adam-Jacholkowski"
            },
            "answer_text": "Matter is a condensed form of energy which means that matter and energy are only two sides of the same entity so cannot be separated. Any particle has minimum of its energy in a reference system in which it is at rest. The only exception is a photon which carries energy but has no rest mass. Mass-energy equivalence ",
            "date": "Answered March 16, 2019",
            "views": "177",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bob Everton",
                "href": "/profile/Bob-Everton-1"
            },
            "answer_text": "No. Matter and energy are the same thing. If you put matter or energy into nothing both will decay. ",
            "date": "Answered May 29, 2020",
            "views": "38",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William Kelleher",
                "href": "/profile/William-Kelleher-4"
            },
            "answer_text": "No. If you mean “matter” to mean mass, then for a given mass the energy is E=mc^2. ",
            "date": "Answered March 19, 2019",
            "views": "75",
            "upvotes": "0"
        }
    ]
}