{
    "title": "Can you prove E=mc^2 mathematically? - Quora",
    "tags": [
        "Mass Energy Equivalence",
        "Relativity (physics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kiran Benny",
                "href": "/profile/Kiran-Benny-4"
            },
            "answer_text": "E=mc^2 is one of the most famous equation of all time. To understand this equation first we need to know about special relativity.One of the consequence of special relativity is that mass appears to increase with speed.The faster an object goes,the heavier it seems to get. there is an equation connecting our current mass ,speed and mass at that speed. it is given by, M =M1/(sqrt(1-v^2/c^2)) where M is the relativistic mass,ie the mass at the sped we are travelling. M1 is the rest mass(at stationary) v is the speed at we are travelling c ,the speed of light. This is a table showing the relativistic increase in mass in relative to the speed of light .Here the mass of an object is kept as unity ,it cannot bbe below the unity.  we see that as speed increases -the mass increases, so more energy is required to move that object. we have Kinetic Energy, KE =1/2 mv^2 So this is the condition for which the increse in kinetic energy occurs.  From our mass -velocity equation M =M1/(sqrt(1-v^2/c^2)),M and c are relative in some way.consider that the V is very low ,then we can express the mass increase in mc^2 term .so this incremental value will be add on with total KE. So E=1/2 mv^2+mc^2 or E-mc^2=1/2 mv^2 this result is fine for low speed. We know that at low speed Kinetic energy is approximately equals to E-mc^2 ie, Relativistic kinetic energy=E-mc^2 or E=Relativistic kinetic energy +mc^2. so the Relativistic energy has two parts a)Relativistic kinetic energy which depend on the speed of the object, b)mass increase which does not depends on the speed of the object.Both these parts are a form of energy.we can simplify the equation by considering a zero velocity for the object. then, Relativistic kinetic energy =0 then E=0+mc^2 or E=mc^2 ",
            "date": "Answered August 11, 2018",
            "views": "21",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Reeja Saju",
                    "user_href": "/profile/Reeja-Saju"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashok Ghai",
                "href": "/profile/Ashok-Ghai-1"
            },
            "answer_text": "This equation is one of the basic ingredients of formation of universe and corresponds to the basic consciousness that created the universe. I do not know if can be mathematically proved? But there was a cosmic phenomenon that told Einstein about this ‘Energy Equation’. A representative of those cosmic powers who created life on earth contacted Helena Blavatsky more than one hundred years back. That cosmic power told many secrets of universe to Helena, and urged her to form an organisation for giving the cosmic knowledge to the mankind. Thereafter, Helena Blavatsky, with help of Colonel Olcott (first president of Theosophical Society) and Father Leadbeater (a clairvoyant) formed this society known as Theosophical Society. Annie Besant was the second president of the society, which is known as treasure trove of cosmic knowledge. The society published a book named ‘Secret Doctrine’. This book was published many years before Einstein put forward Energy Equation and Theory of Relativity, that were already explained in this book. Einstein’s niece told the researchers that Einstein read these theories in this book. However, Einstein was a brilliant scientist in his own right, and was perhaps destined to carry on further research for opening the secrets of science for the humanity. ",
            "date": "Answered January 2, 2018",
            "views": "12",
            "upvotes": " Answer requested by Nitin Kumar",
            "upvoters": [
                {
                    "user_id": "Gudapati Lokesh",
                    "user_href": "/profile/Gudapati-Lokesh-1"
                },
                {
                    "user_id": "James Boakes",
                    "user_href": "/profile/James-Boakes"
                },
                {
                    "user_id": "Ashutosh Bhatt",
                    "user_href": "/profile/Ashutosh-Bhatt-40"
                },
                {
                    "user_id": "Kudrat Ansari",
                    "user_href": "/profile/Kudrat-Ansari-4"
                },
                {
                    "user_id": "Shivani",
                    "user_href": "/profile/Shivani-471"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charles Michael Turner",
                "href": "/profile/Charles-Michael-Turner"
            },
            "answer_text": "Surface area = pi x r^2. This is the surface area of a circle. There is a math / physics law called the square-cube law and it shows that a surface area expansion is the squared law and a volume expansion is the cubed law. When radar is used the radius is changed to Range (R^2) and in physics the range is set at infinite so the speed of light is used (c^2). e= mc^2 is therefore a standard surface area transfer of energy in which the intensity at any point obeys the inverse square law. In practice, when you are at a bonfire and you are hot, if you double your distance the intensity decreases 4 times. When reading, if you bring a light twice as close, the brightness increases four times. note: What I find interesting is that all dipole force goes by the inverse cube law. So an easy fix to create the theory of everything is to recognize that the inverse cube law is a volume increasing law. So at a dipole, energy is phase changing to the radiating fabric of space, the gravitational field. Photons therefore are the force carriers and hop on board the radiating gravitational field, radiating at the speed of light and therefore these photons are responsible for concentrating the force of gravity to be like the force of radar using the inverse square law x the inverse square law. This also means that masses are in a state of static equilibrium with two hidden processes happening simultaneously as masses energy levels stay in a constant state of static equilibrium. Radiating gravitational fields with photons hopping on board obey Newton’s laws of motion as all substance does. Gravity and dark matter reactions actions and are due to each mass radiating its own local laws which never stop being local laws as they radiate out and when fields of low energy collide they unite into a single larger field. the expanding net wave theory, copyrighted and all rights are reserved. ",
            "date": "Answered May 26, 2020",
            "views": "209",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joe Chang",
                "href": "/profile/Joe-Chang-44"
            },
            "answer_text": "E=MC^2 is BS. Einstein and all scientists don't know what exactly is energy yet. Anything quantum is BS. It is important to realize that in physics today, we have no knowledge of what energy is. We do not have a picture that energy comes in little blobs of a definite amount. It is not that way. -Feynman All these fifty years of conscious brooding have brought me no nearer to the answer to the question, “What are light quanta?” Nowadays every Tom, Dick, and Harry thinks he knows it, but he is mistaken. - Einstein ",
            "date": "Answered June 16, 2020",
            "views": "165",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "AM Ghazi",
                "href": "/profile/AM-Ghazi"
            },
            "answer_text": "The proof of this famous equation comprises several steps. According to Plank’s Equation: E = hf E = h(c/λ ) as c=fλ E = Pc as momentum= h/λ E = (mc)c as momentum= mv in this case v=c Finally, E = mc^2 ",
            "date": "Answered June 2, 2018",
            "views": "17",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Enoch Jebin",
                    "user_href": "/profile/Enoch-Jebin"
                },
                {
                    "user_id": "Ashutosh Bhatt",
                    "user_href": "/profile/Ashutosh-Bhatt-40"
                },
                {
                    "user_id": "Nitin Kumar",
                    "user_href": "/profile/Nitin-Kumar-1762"
                },
                {
                    "user_id": "Altamash Iqubal",
                    "user_href": "/profile/Altamash-Iqubal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Utsav Chaubey",
                "href": "/profile/Utsav-Chaubey-2"
            },
            "answer_text": "pls see in pic in  this famous equation E=mc^2 can be proved by using integration and differentiagion method. Here e is energy m is mass and c ^2 is speed of light using this equation Einstein showed the relationship between the mass and energy. and according to the theory of relativity nothing can travel higher than the speed of light. which values 299729458m/s ",
            "date": "Answered January 3, 2019",
            "views": "290",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Srinivas Charlu",
                "href": "/profile/Srinivas-Charlu-3"
            },
            "answer_text": "This equation was derived from the Stress energy tensor by Max von Laue in 1911. More generally , the expression for the energy of an isolated particle with mass m and momentum p is E**2= p**2c**2+m**2c**4. (double star meaning raised to the power). Hence for a particle with nil momentum E=mc**2. ",
            "date": "Answered January 2, 2018",
            "views": "421",
            "upvotes": " View 4 Upvoters "
        },
        {
            "author_info": {
                "name": "Vendicar Kahn",
                "href": "/profile/Vendicar-Kahn"
            },
            "answer_text": "No. At least in the sense that the axioms of mathematics are not equivalent to the laws of physics. Mathematics in itself says nothing about the physical world. ",
            "date": "Answered October 19, 2020",
            "views": "20",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vikram Zaveri",
                "href": "/profile/Vikram-Zaveri-1"
            },
            "answer_text": "You can find the proof at following sites. http://www.emc2-explained.info/Emc2/Derive.htm#.W20f1CQzbIU https://arxiv.org/ftp/physics/papers/0308/0308039.pdf https://en.wikipedia.org/wiki/Mass%E2%80%93energy_equivalence ",
            "date": "Answered August 10, 2018",
            "views": "571",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sarthak Singh",
                "href": "/profile/Sarthak-Singh-103"
            },
            "answer_text": "Yes  ",
            "date": "Answered January 1, 2018",
            "views": "577",
            "upvotes": "0"
        }
    ]
}