{
    "title": "Can someone simplify polar vs nonpolar molecules? - Quora",
    "tags": [
        "Polar Bonds",
        "Chemical Polarity",
        "Covalent Bonds",
        "Molecules",
        "Physical Chemistry",
        "Chemistry of Everyday Life",
        "Science of Everyday Life",
        "Organic Chemistry",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brady Williams",
                "href": "/profile/Brady-Williams-3"
            },
            "answer_text": "Polar means that a molecule has a separation of charge over space. A bond is polar if the two atoms involved are of different electronegativities. Technically this means that any bond between atoms that are not identical is polar, but from a practical standpoint, we generally think of a bond as polar if the two atoms are far apart on the periodic table. The larger the charge separation (or dipole moment), the more polar the bond. The C-H bond in organic molecules is somewhat an exception in that the two electronegativities are quite close so the bond polarity is low. For molecules, one also has to consider whether the bonds are symetrical. Thus a molecule like carbon dioxide is nonpolar despite the highly polar C=O bonds because the two are symetrically disposed around the carbon. Similarly, carbon tetrachloride is nonpolar because of symetry, but chloroform, dichlormethane and chloromethane are all polar because the bond dipoles do not cancel out. ",
            "date": "Answered September 7, 2019",
            "views": "117",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sarvesh Rawat",
                    "user_href": "/profile/Sarvesh-Rawat-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amir Nadeem",
                "href": "/profile/Amir-Nadeem-30"
            },
            "answer_text": "Polar molecules occur when there is an electronegativity difference between the bonded atoms. eg H2O,.. Nonpolar molecules occur when electrons are shared equal between atoms of a diatomic molecule H2,N2,O2 etc ",
            "date": "Answered January 6, 2020",
            "views": "103",
            "upvotes": " Answer requested by Sarvesh Rawat"
        }
    ]
}