{
    "title": "Could elementary particles be entire universes? - Quora",
    "tags": [
        "Parallel Universes",
        "Multiverse",
        "Particle Physics",
        "The Universe"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Rice",
                "href": "/profile/Robert-Rice-23"
            },
            "answer_text": "The universe is as exponentially large as it is infinitesimally small! I get where you’re going with this. I suppose the answer would be “almost definitely not.” But 100 years ago, we didn’t know there was anything smaller than an electron and now we know that is absolutely false. Quarks and Leptons are the smallest particles of an atom and are considered the building blocks and are incredibly much smaller than an electron. Quark > Electron > Atom > Molecule > Rock > Planet > Solar System > Solar Cluster > Galaxy > Galaxy Cluster > Universe What goes before Quark? That is unknown but perhaps not unknowable. ",
            "date": "Answered October 21, 2016",
            "views": "275",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jules Opeth Manson",
                    "user_href": "/profile/Jules-Opeth-Manson"
                },
                {
                    "user_id": "Isaiah Alexander-de Haan",
                    "user_href": "/profile/Isaiah-Alexander-de-Haan"
                },
                {
                    "user_id": "Chandrashekar Simha",
                    "user_href": "/profile/Chandrashekar-Simha"
                },
                {
                    "user_id": "Isaac Recinos",
                    "user_href": "/profile/Isaac-Recinos"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ken Walter",
                "href": "/profile/Ken-Walter-1"
            },
            "answer_text": "Stephen King wrote something like this in the Dark Tower series. A swirling Universe in the center of the Rose that was the Key to all Universes or something like that. If you want to really reach and say there are an infinite number of Universes then each one would contain an infinite number of particles and we get into an absurdity of possibilities where even the impossibilities become possibilities, but maybe that's the point. What's inside an atom? Let's smash it and find out. That was impossible once. It wasn't even what Atomists were thinking 2K years ago when they said things were made of things called atoms. Ok tangent done, sorry. Elementary particles by definition can't be universes. They are what make up other things, unless we are completely wrong about basically our entire understanding up to this point. That's beyond my realm of entertainable possibilities. ",
            "date": "Answered February 11, 2017",
            "views": "230",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Oem Trivedi",
                    "user_href": "/profile/Oem-Trivedi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frank Postava",
                "href": "/profile/Frank-Postava"
            },
            "answer_text": "Thanks a tough one on the theoretical side…Horton hears a Who…(no disrespect implied). We believe we found the basic building blocks of realty, so did the scientists that found the atom. Have we found the Elementary particle? IMHO, no. They gave us the standard model…now the think they found another particle not in the standard model…dark matter particle ??? My point, assuming universes expand, the Elementary particle in question would either have to expand or contain a capsule to contain the expansion as mention in another answer below. We just have to see what the LHC tells us, or the newer theorized linear accelerators yield. Just think, if you are correct, we may be destroying entire civilizations. Oh well…. ",
            "date": "Answered September 9, 2016",
            "views": "265",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Isaiah Alexander-de Haan",
                    "user_href": "/profile/Isaiah-Alexander-de-Haan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shyam Kumar",
                "href": "/profile/Shyam-Kumar-300"
            },
            "answer_text": "Inside their component design’s they may exhibit a inner chamber within which the mechanism of the cosmos or the reality construct - the universe - could be structured and inflated within an encapsulation into a bubble universe. Meaning there is a hidden portion in the variational framework or a buried structure that relatively encapsulates the construct within its bubble cosm. ",
            "date": "Answered July 15, 2016",
            "views": "161",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Isaiah Alexander-de Haan",
                    "user_href": "/profile/Isaiah-Alexander-de-Haan"
                },
                {
                    "user_id": "Frank Postava",
                    "user_href": "/profile/Frank-Postava"
                }
            ]
        },
        {
            "author_info": {
                "name": "Logan DeBusk",
                "href": "/profile/Logan-DeBusk"
            },
            "answer_text": "Elementary particles are particles with no known sub units, but there COULD be thousands upon thousands of sub units. Although, as of now there is a very very small chance that elementary particle contain entire universes. ",
            "date": "Answered February 19, 2016",
            "views": "177",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Isaiah Alexander-de Haan",
                    "user_href": "/profile/Isaiah-Alexander-de-Haan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edward Richard",
                "href": "/profile/Edward-Richard-3"
            },
            "answer_text": "No; for the simple reason that they are elementary particles. Therefore nothing is smaller. Another simple reason is that they would still be constituent particles of this universe. ",
            "date": "Answered July 13, 2016",
            "views": "129",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Isaiah Alexander-de Haan",
                    "user_href": "/profile/Isaiah-Alexander-de-Haan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lukas Obermajer",
                "href": "/profile/Lukas-Obermajer"
            },
            "answer_text": "As far as we know, this is impossible. We haven't yet encountered any sign of this, and it's estremely unlike to be discovered. It is possible, but the chances are pratically zero. ",
            "date": "Answered March 9, 2016",
            "views": "128",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Isaiah Alexander-de Haan",
                    "user_href": "/profile/Isaiah-Alexander-de-Haan"
                }
            ]
        }
    ]
}