{
    "title": "Could communism work if human behavior was different? - Quora",
    "tags": [
        "Behavior",
        "Communism",
        "Behavioral Psychology",
        "Social Psychology",
        "The Human Race and Condition",
        "Politics",
        "Understanding Human Behavior",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bill Puka",
                "href": "/profile/Bill-Puka"
            },
            "answer_text": "If human nature was better, we could achieve communism without even calling it communism. First distinguish state communism, which has tended toward brutal, near genocidal dictatorship (in the cases of Stalin and Mao for example), and non-state communism. The latter I’d call a system of communitarian social ethics with overly social utopian economic principles found in Fourie especially. “Communism, utopian and Scientific is a good exposition of these sources. The ethic of such non-state communism is very close to the ethic believed to exist in early Chirstian communities where private property was shared and equality striven for, especially for women. This is why there is such a literature of Christian socialism such as found in Catholic social theory, and later, liberation theology. Marc’s writings in the 1844 manuscripts lay out some of the ideas involved, before he decided on state communism and his statist and deterministic socioeconomic views. If only the anarchist Bakunin had beat him out at the First International for leadership of the communist party. ",
            "date": "Answered January 3, 2020",
            "views": "66",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Adhitya Ram",
                    "user_href": "/profile/Adhitya-Ram-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Silas Amaro",
                "href": "/profile/Silas-Amaro"
            },
            "answer_text": "Theoretically, communism is a classless system where essentially everything including all means production belongs to the public, a complete inverse to complete capitalism, the entire economy is controlled by privately-owned companies (who were often monopolies). (definition based off of Karl Marx theories) However, Karl Marx’s theoretical communism has never successfully been implemented in society, because there is no “blueprint” for a successful working communist society. As Thomas Hobbes (an Enlightenment philosopher from Britain) believes, “all humans are naturally greedy and evil”. Humans are not great at sharing. Communism is solely based on sharing. You see, it’s not exactly ideal. BUT if human behavior was different, and humans were less greedy (as not as stupid as some previous communist leaders have been), a Marxist communistic society could be successful. Yake Sakura ",
            "date": "Answered January 3, 2020",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stephen Godek",
                "href": "/profile/Stephen-Godek"
            },
            "answer_text": "It would depend upon how different and in what ways. If people did not fall so easily into behaving greedily or in self-serving ways, perhaps Communism might work. If people did not need to be mobilized to act in the interests of their communities, perhaps communism might work. If human leaders did not allow power to corrupt their decision-making processes with power seeking, perhaps Communism might work. If large nations could organize themselves without strong central governments, communism, as we have seen it implemented, would not even be necessary as a democratic socialism would accomplish everything communism promises to deliver. ",
            "date": "Answered January 5, 2020",
            "views": "16",
            "upvotes": " Answer requested by Keala Anderson",
            "upvoters": [
                {
                    "user_id": "John Mostler",
                    "user_href": "/profile/John-Mostler-1"
                },
                {
                    "user_id": "Raul Alonso",
                    "user_href": "/profile/Raul-Alonso-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jane Nutter",
                "href": "/profile/Jane-Nutter"
            },
            "answer_text": "There are a few possible differences that would make it possible for communism to work: Our bodies are all controlled by a single hive mind (see A Wrinkle in Time).We don't respond to incentives. Would probably require a world without evolution.We are all addicted to work to the point that we are willing to compete for the toughest jobs, or obsessed with minimalist consumption, or both.We are all addicted to volunteer work/charity.Unfortunately it's difficult to get the later two without the second. If the world didn't have the laws of conservation of mass and energy, things might be different, but in this universe, communism is screwed. ",
            "date": "Answered January 5, 2020",
            "views": "33",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "James Russell",
                "href": "/profile/James-Russell-309"
            },
            "answer_text": "Instead of changing humans to match a flawed economic system, why not use an economic system that already matches human behavior? I cease to be amazed at all the convoluted logic contortions that the leftists put us through to try to justify socialism and communism and make excuses for why they have not worked out well. Why keep trying to make them work? The world appears to have settled on various forms of capitalism as the one that works and produces wealth. If we need to raise taxes and to provide for those who cannot provide for themselves, we simply need to vote and then do it if we have the votes. ",
            "date": "Answered January 3, 2020",
            "views": "56",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tom Krop",
                "href": "/profile/Tom-Krop-1"
            },
            "answer_text": "I believe that that would be the only way to make it work. Like that movie Equilibrium. A world, where nobody wants to achieve, nobody wants to get ahead, nobody wants anything for himself, nobody is susceptible to corruption. Corruption of human mind is the biggest downfall of communism, as well as socialism. And that is why it never worked, and never will. ",
            "date": "Answered January 6, 2020",
            "views": "6",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marcus Lester",
                "href": "/profile/Marcus-Lester-2"
            },
            "answer_text": "Communism and capitalism are exactly alike in one respect: both think that a very few of the “right” people can do a better job of running the political economy than can the rest of us. The difference is that communists think government leaders are better, while capitalists think corporate leaders are better. Both of them are wrong. Life’s more complicated than that. And if you think I’m wrong about the capitalists, then you know nothing of the drive to monopoly. They always cover up that one as much as they can, but it’s the central goal of all capitalists — to kill or eat the competition until there is no competition left. Contrary to the propaganda, capitalism destroys competition. That’s the point. ",
            "date": "Answered January 3, 2020",
            "views": "18",
            "upvotes": " Answer requested by Keala Anderson"
        },
        {
            "author_info": {
                "name": "Izzy Shae",
                "href": "/profile/Izzy-Shae"
            },
            "answer_text": "Absolutely not !!! Communism abolishes the marriage, the family unity, abolition of all private property. Not just the \"means of productions \". As killmunists like to talk about so darn much. It calls for the abolition of inheritance, self acquired inheritance, relations and property. The abolition of all inheritance, relations, and the abolition of individuality, freedom and rights !!! ",
            "date": "Answered January 3, 2020",
            "views": "81",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anthony Congdon",
                "href": "/profile/Anthony-Congdon"
            },
            "answer_text": "Communism or perhaps more accurately communitarianism worked very well for the Aboriginal people of Australia for many tens of thousands of years. All property was communal property and the fruits of their labour was shared among the tribe according to need. So yes it could work, but the organisation of human society into small groups would be essential for this to work. ",
            "date": "Answered January 10, 2020",
            "views": "8",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marc Lambert",
                "href": "/profile/Marc-Lambert-9"
            },
            "answer_text": "Yes, often communism began with goodness based intentions as in Russia, then Stalin lost all his goodness with high use of his faulty right anxious/negative brain and it became evil communism. If all human maximised use of the their left logical/positive brains so their goodness/oneness/inner happiness a new system would form naturally, EGMi maximises left brain use if can give the first goodness based world democracy. ",
            "date": "Answered January 3, 2020",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Glen Welton Smith",
                "href": "/profile/Glen-Welton-Smith"
            },
            "answer_text": "Probably not as communisms core assumption about the nature of value is incorrect. I suppose everyone could have the same values but that probably violates the benefit freedom has to society. ",
            "date": "Answered January 3, 2020",
            "views": "18",
            "upvotes": "0"
        }
    ]
}