{
    "title": "Could objects beyond our event horizon, that we cannot see, accelerate toward us, and come into view? - Quora",
    "tags": [
        "Event Horizons",
        "General Relativity",
        "Black Holes",
        "Relativity (physics)",
        "Gravity",
        "Cosmology",
        "Astrophysics",
        "Astronomy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Mulcahy",
                "href": "/profile/Michael-Mulcahy-20"
            },
            "answer_text": "Not in our expanding universe. Our horizon is a horizon because everything beyond it is expanding away from us at greater than the speed of light. So if something somewhere beyond, accelerated, even reaching near light speed it could never be seen by us because (from our perspective) the part of the universe this something (or someone!) is in is rushing away from us at more that the speed of light so they could never reach the horizon. Before you object that nothing can travel faster than light, this speed limit does not apply to the universe itself (for example the early inflation of the universe after the big bang occurred at much greater than light speed). We today can only see what things looked like in the past. When we look at very distant galaxies we see them as they were billions of years ago not as they are now. Intrepid astronomers in those far distant galaxies would see our milky way galaxy as it used to be before the solar system ever existed. Given aeons of time those far distant galaxies will disappear from view over the horizon and as the universe approaches heat death only our local gravitationally locked structures will be visible as the substance of the universe rushes away from us. ",
            "date": "Answered October 21, 2020",
            "views": "32",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Kelly",
                "href": "/profile/John-Kelly-370"
            },
            "answer_text": "Could objects beyond our event horizon, that we cannot see, accelerate toward us, and come into view? Unlikely, to say the least.The problem is that if an object is beyond our event horizon then it exists in a portion of spacetime that is expanding away from us as fast; or even faster than the speed of light. (Spacetime itself is not bound by the speed of light - objects/energy within spacetime IS bound by (c))! In other words - suppose you have a spacecraft that is approaching us at (c)… (Yes, I know, 9.999999blah blah blah… but THIS one is coming at us at (c))… So there it is, streaking along like an exocet, only faster and aimed straight at the bullseye… which also just happens to be US! OMG!!!… What TF are we gonna do? This will be the end of civilization as we know it, etc.! CHILL!Take it easy! - No matter how fast the thing is heading towards us it can NEVER reach us… SPACETIME itself is pulling it away from us every bit as fast as it is travelling towards us - so, in effect it is absolutely stationary with respect to us! Have you ever had the fun of walking down an upcycling escalator?That is what happens… nothing! Problem solved!No little green men! Cheers! ",
            "date": "Answered October 21, 2020",
            "views": "49",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Frederick Potter",
                "href": "/profile/Frederick-Potter"
            },
            "answer_text": "The reason that we cannot see things beyond a certain point is because at that point, the universe is expanding faster than the speed of light. So before you point out that nothing can travel faster than the speed of light, the caveat is that nothing can travel through space-time (the “fabric” of space) faster than the speed of light. However, space-time itself can expand faster than the speed of light and also did so immediately after the “Big Bang” during the period referred to as inflation. So it would require an object to travel faster than the speed of light through space-time before it could come into view from beyond what you call our “event horizon”. Perhaps there is some undiscovered physics that will allow such “warp” speed, but if it were an alien spacecraft, it would be so tiny that we would not be able to detect it at that distance ",
            "date": "Answered October 21, 2020",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Mooney",
                "href": "/profile/Michael-Mooney-59"
            },
            "answer_text": "It’s possible in a cosmology of many cosmoi like ours as “bubbles” in an infinite cosmic foam, the universe. Each could be expanding like ours, so those in closest proximity to ours would eventually come into view and “mingle” with the stuff we can see moving away. However all cosmology beyond our event horizon is speculative. ",
            "date": "Answered October 21, 2020",
            "views": "23",
            "upvotes": " Answer requested by Don Herbison-Evans",
            "upvoters": [
                {
                    "user_id": "Pramodya Thilakarathna",
                    "user_href": "/profile/Pramodya-Thilakarathna"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anders Rehnberg",
                "href": "/profile/Anders-Rehnberg"
            },
            "answer_text": "I will have to assume you are talking about the expansion of the universe and the ‘horizon’ 47 bn light years away. The answer is NO as it would require speeds in excess of light speed. Our horizon is DEFINED as where the speed of any object recedes at light speed, so anything further away than the horizon recedes at MORE than light speed. ",
            "date": "Answered October 22, 2020",
            "views": "30",
            "upvotes": " Answer requested by Don Herbison-Evans"
        },
        {
            "author_info": {
                "name": "Reza Sanaye",
                "href": "/profile/Reza-Sanaye"
            },
            "answer_text": "“Horizon” in Prof Einsteins’ Relativity comes to be hermeneutically known as that portion of spacetime that is expanding away from. Problem with this Einsteinian understanding of the world is the very bizarre amalgamation of the Entity of Space with the Entity of Time.And then , wonder of wonders : this Hybrid thing getting away from us ! Einstein was wrong to decide to adopt Spacetime from Minkowski into his own Relativity. Wronger than that is for us to , first , reify this , and then : to start expanding upon its back-acceleration !! Time and space are , by the very definition and by their own nature , two absolutely differing entities [this is in case we do not deny that “time” exists , as a relatively great many of fringe physicists, many of them my own friends , believe . . . . ] So to sum up : your query is “by default” absurd , Sir . . . . . . ",
            "date": "Answered October 21, 2020",
            "views": "213",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Adam Jacholkowski",
                "href": "/profile/Adam-Jacholkowski"
            },
            "answer_text": "I do not think so. The event horizon is not a simple sphere due to spread of the velocities of different celestial bodies so it is hard to define what is on our or opposite side of the event horizon. Event horizon - Wikipedia ",
            "date": "Answered October 21, 2020",
            "views": "57",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Norbert Székely",
                "href": "/profile/Norbert-Székely-2"
            },
            "answer_text": "No, because stuff on our event horizon is actually rushing away with more than the speed of light due to the huge amount of space creation between us and them. There is no way for an object as distant as being outside of our event horizon to overcome that high velocity. ",
            "date": "Answered October 22, 2020",
            "views": "19",
            "upvotes": " Answer requested by Don Herbison-Evans"
        },
        {
            "author_info": {
                "name": "Mike Cavedon",
                "href": "/profile/Mike-Cavedon-189"
            },
            "answer_text": "Yes. Objects from outside of our event horizon could be traveling towards us and wind up within our event horizon. The light from that object would take a long time to reach us. ",
            "date": "Answered October 21, 2020",
            "views": "30",
            "upvotes": " Answer requested by Don Herbison-Evans"
        },
        {
            "author_info": {
                "name": "Brent Meeker",
                "href": "/profile/Brent-Meeker"
            },
            "answer_text": "The event horizon is defined as the place where the expansion of space is moving things away from us at the speed of light. So to move toward us across the event horizon would require something to move faster than light. ",
            "date": "Answered October 21, 2020",
            "views": "18",
            "upvotes": " Answer requested by Don Herbison-Evans"
        },
        {
            "author_info": {
                "name": "Jeff Koch",
                "href": "/profile/Jeff-Koch-30"
            },
            "answer_text": "No. The space between us and those objects is expanding faster than light. So nothing from that region can ever come into view. ",
            "date": "Answered October 22, 2020",
            "views": "12",
            "upvotes": " Answer requested by Don Herbison-Evans"
        }
    ]
}