{
    "title": "Could the poles recover its ice, once the humans disappear? - Quora",
    "tags": [
        "North Pole",
        "Ice",
        "The Human Race and Condition"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eryk Bottomley",
                "href": "/profile/Eryk-Bottomley"
            },
            "answer_text": "Climate is cyclical regardless of what humans do. You may have heard of dinosaurs in Antarctica: they were not living on top of ice fields at -50 degrees. There simply wasn’t any ice at either pole at the end of the cretaceous period (65M years ago). Antarctica didn’t start to freeze over until about 35M years ago and didn’t reach its current state until 10–14M years ago. The Arctic polar ice is even less stable and was entirely absent during the Eemian interglacial only 130000 years ago before expanding to cover most of North America and Northern Europe during the last glacial period. We are currently in another interglacial, but a cooler one than the Eemian since the Arctic ice is still there. Obviously none of the above changes had anything to do with humans. So, there are two fairly strong predictions one can make: In the short term (several dozens of millenia) the interglacial will end and a full glaciation of the northern hemisphere will return with obvious catastrophic consequences.In the medium term (several dozens of millions of years) it is likely that the himalayan weathering CO2 sink will stop distorting the climate and cretaceous conditions will return eliminating all ice at both poles.In the ultra-short term (decades) global warming is a problem for us and other species, but over a 100000 year timeframe we’re going to have to decide if we sacrifice North America and Europe entirely (with knock on climatic effects elsewhere) or else avert glaciation with some serious greenhouse engineering, involving deliberate CO2 and methane release on a vast scale. Either way the second eventuality will arise. Once India stops mountain building in Asia both polar ice caps are probably going to melt. ",
            "date": "Updated April 9, 2017",
            "views": "142",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chaitanya Arige",
                    "user_href": "/profile/Chaitanya-Arige"
                },
                {
                    "user_id": "Agustín Vivancos",
                    "user_href": "/profile/Agustín-Vivancos"
                },
                {
                    "user_id": "David Hansel",
                    "user_href": "/profile/David-Hansel-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tiana Ewing",
                "href": "/profile/Tiana-Ewing"
            },
            "answer_text": "Yes, the poles would recover its ice, but probably after a long period of time, and it coming back wont have much to do with humans. Let me tell you something, climate change is very normal. The Earth has gone through 7 recorded galacial changes throughout its young lifetime. While humans do play a role in the play of global warming, it’s only a medium amount. Most climate changes is due to a slight change in the Earths orbit. While we do play a large contributing factor to climate change, with or without humans it will happen anyway. Go to NASA’s webpage on Climate Change, what it is and how we affect it. https://climate.nasa.gov/ ",
            "date": "Answered April 8, 2017",
            "views": "74",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chaitanya Arige",
                    "user_href": "/profile/Chaitanya-Arige"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tim Farage",
                "href": "/profile/Tim-Farage-1"
            },
            "answer_text": "If humans disappear, who cares about the polar ice? Animals and plants don’t care. And they will adapt to whatever changes occur. Of course, a species can go extinct, but that always happens. The Earth was created for we humans so that we could learn to love each other, and help each other, and to eventually create a Golden Age. Without humans, why does any of this matter? Once the Sun burns our, all will be gone. Unless we have immortal souls that will continue their growth toward God even if our universe ceases to exist. ",
            "date": "Answered April 8, 2017",
            "views": "76",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chaitanya Arige",
                    "user_href": "/profile/Chaitanya-Arige"
                },
                {
                    "user_id": "Agustín Vivancos",
                    "user_href": "/profile/Agustín-Vivancos"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anthony O'Dugan",
                "href": "/profile/Anthony-ODugan"
            },
            "answer_text": "If Mother Earth knows one thing, it's how to survive. Regardless of our disregard or egos, her survival and repair instinct are infinitely greater. So, yes, most assuredly. ",
            "date": "Answered April 8, 2017",
            "views": "28",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Agustín Vivancos",
                    "user_href": "/profile/Agustín-Vivancos"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Twane",
                "href": "/profile/Mark-Twane-2"
            },
            "answer_text": "Theoretically… Maybe. The ozone is already repairing itself mysteriously. If humans were to disappear, then the ozone would develop faster and repair itself. ",
            "date": "Answered April 8, 2017",
            "views": "13",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Chaitanya Arige",
                    "user_href": "/profile/Chaitanya-Arige"
                }
            ]
        }
    ]
}