{
    "title": "Did Einstein have any ideas about how or why the Big Bang occurred? - Quora",
    "tags": [
        "The Big Bang",
        "Big Bang Cosmology",
        "Albert Einstein (physicist)",
        "The Universe"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Stuart Papworth",
                "href": "/profile/Michael-Stuart-Papworth"
            },
            "answer_text": "Yes. He believed that an all powerful creator created the universe, not necessarily in an instant in time, and it was his (Einsteins) job to find out how he did it. Hence, his work that consumed the latter part of his life in trying to find the Grand Theory of Everything. Unfortunately, despite using every bit of his intellect, Einstein never came close to figuring it out. There was a reason for this. The trouble is with human reasoning. We don’t know what we don’t know. This may seem like an obvious statement. But let us assume that there are many forces and fields in, and around, our universe, of which we have no idea, and cannot even imagine. Let us consider one possible force. Taking the simplest atom, hydrogen: what keeps the electrons in motion. I am not talking about relative masses and energies, I am talking about motion, or dynamic forces. You see, the atom is a machine in a universe full of machines. And all, yes all, machines have losses. So, for an atom to be stable for billions of years, it requires dynamic forces, external to the actual atom. And of course, this applies to every atom in the universe. The implications of this are profound. It means that our universe is actually controlled by forces outside of it. Now, Einstein had some ideas about this, but the idea means that it is impossible to come up with a Grand Theory of Everything, using forces of which we are presently aware. But if anyone could ever come close to figuring things out, it would have been Einstein, maybe collaborating with Nikola Tesla, James Clerk Maxwell, and Isaac Newton. ",
            "date": "Answered March 29, 2020",
            "views": "106",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Naeeim Ab",
                    "user_href": "/profile/Naeeim-Ab"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Mozina",
                "href": "/profile/Michael-Mozina"
            },
            "answer_text": "No, in fact Einstein was quite surprised by the revelation of redshift. Prior to Hubble’s discovery of redshift and additional galaxies, the prevailing belief was that we lived inside of a static, (single) island galaxy universe. Einstein introduced his non-zero constant into GR in an attempt to explain a ‘static” universe that didn’t collapse under it’s own weight. When he found out about Hubble’s discovery, he set his constant back to zero and claimed stated that the introduction of his non-zero constant into GR theory was his ‘greatest blunder’. Today that non-zero constant is associated with ‘dark energy’. When Einstein was first introduced to Lemaitre’s “big bang” concept, and the notion of ‘space expansion”, he called it ‘abominable physics’ and he initially rejected the concept. Only after meeting with Lemaitre did he eventually come to accept the model. ",
            "date": "Answered March 28, 2020",
            "views": "93",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Barry Goldberg",
                    "user_href": "/profile/Barry-Goldberg-1"
                },
                {
                    "user_id": "Stephen Mann",
                    "user_href": "/profile/Stephen-Mann-G"
                }
            ]
        },
        {
            "author_info": {
                "name": "Douglas Noble",
                "href": "/profile/Douglas-Noble-1"
            },
            "answer_text": "That is one of those big philosophical questions that has no answer and never will. Have read number of biographies of Einstein and he was never big on answering why questions unless it directly related to the determinism of cause and effect. He was a believer in God at some point in his life but his insights on that are no more profound than anyone else. He once suggested that quantum theory based on probability didn't sit correct with him because he believed that God “wouldn't play dice with the universe.” However, that doesn't tell you why it all started. ",
            "date": "Answered March 28, 2020",
            "views": "111",
            "upvotes": "0"
        }
    ]
}