{
    "title": "Did Thomas Edison invent the light bulb or did someone else before him? - Quora",
    "tags": [
        "Thomas Alva Edison",
        "History of Inventions",
        "Light Bulbs",
        "Inventors",
        "Invention and Inventions",
        "Electricity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard Smith",
                "href": "/profile/Richard-Smith-818"
            },
            "answer_text": "Did Thomas Edison invent the light bulb, or did domeone else before him Swan did before him. This is the text from the first paragraph of Edisonn’s Invention, Patent # 223,898: Be it known that I, THOMAS ALVA EDDISON, of Menlo Park, in the State of New Jersey, United 8ates of America, have invented an improvement in Electric Lamps, and in the method of manufacturing the same, (Case No. 186) of which the following is a specification. In the text, he freely admits it is an improvement on an existing Lamp. But who improved on the bulb by having a screw base with a centre contact? That is where it gets sticky. ",
            "date": "Answered January 1, 2019",
            "views": "155",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kelly La Rue",
                "href": "/profile/Kelly-La-Rue"
            },
            "answer_text": "Though Thomas Edison is usually credited with the invention of the light bulb, the famous American inventor wasn't the only one who contributed to the development of this revolutionary technology. Many other notable figures are also remembered for their work with electric batteries, lamps and the creation of the first incandescent bulbs. Who Invented the Light Bulb? ",
            "date": "Answered January 1, 2019",
            "views": "82",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Barbara Lancaster",
                    "user_href": "/profile/Barbara-Lancaster-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kenneth Lundgren",
                "href": "/profile/Kenneth-Lundgren"
            },
            "answer_text": "Edison developed the bulb with the intention of making it a commercial success. He needed a bulb with sufficient life time, but he also realized it had to have a high resistance so it could operate at a fairly high voltage, namely 110V. And it had to be affordable. If the bulb were made to operate at 6 or 12V, it would require massive copper wiring. A 12V system would require wires 10X the diameter of a 120V system; that’s 100x as much copper. So he need a long thin filament that wouldn’t easily break or burn out. Edison also developed the entire infrastructure, with power plants, bulb factories, switches, fuses, etc. Early Light Bulbs ",
            "date": "Answered January 1, 2019",
            "views": "401",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Patrick Earley",
                    "user_href": "/profile/Patrick-Earley-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alan Dicey",
                "href": "/profile/Alan-Dicey"
            },
            "answer_text": "It is generally accepted that Joseph Swan, from my home town of Sunderland, invented the electric light bulb independently, at the same time as Edison. Both were granted patents in 1879 in their respective home countries. Swan’s patents lead to Edison and Swan merging their companies in the UK, forming the Edison and Swan Electric Light Company, producing light bulbs and later valves and cathode ray tubes under the Ediswan and Mazda trade names. ",
            "date": "Answered January 5, 2019",
            "views": "85",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Krijgsman",
                "href": "/profile/Mark-Krijgsman"
            },
            "answer_text": "No he did not, swan invented it, and edison improved on the invention. To put it simple Edison made the bulb be capable of being mass produced and last longer then the original bulb by swan. So someone else invented it before him, he improved on it, hll even the patent in his name says its an improvement and edison also admitted it as such,. ",
            "date": "Answered January 5, 2019",
            "views": "37",
            "upvotes": " Answer requested by Steven Wright",
            "upvoters": [
                {
                    "user_id": "Jason De Donno",
                    "user_href": "/profile/Jason-De-Donno"
                }
            ]
        },
        {
            "author_info": {
                "name": "Curt Weinstein",
                "href": "/profile/Curt-Weinstein"
            },
            "answer_text": "There were light bulbs around before Edison’s light. In Europe, some guy even beat (so they say) Edison to the Edison bulb. The arc-vapor bulb predated Edison’s bulb. It was too bright. Edison’s vacuum carbon bulb was just bright enough. Edison took credit for the double “vacuuming” of the bulb. When you pumped the air out of the bulb, it would yet burn up. Burning up meant oxygen was being used? By double pumping the air out of the bulb, the air “dissolved” in the glass came out. ",
            "date": "Answered January 1, 2019",
            "views": "70",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jim Mowreader",
                "href": "/profile/Jim-Mowreader"
            },
            "answer_text": "Thomas Edison developed the first light bulb that lasted long enough to be practical. There were several light bulbs before Edison’s bulb, but they burned out so quickly it was more practical to stick to carbide lighting. ",
            "date": "Answered January 1, 2019",
            "views": "34",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jeff Kenny",
                    "user_href": "/profile/Jeff-Kenny-10"
                },
                {
                    "user_id": "Patrick Earley",
                    "user_href": "/profile/Patrick-Earley-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Youle",
                "href": "/profile/Eric-Youle-1"
            },
            "answer_text": "No Edison did not invent the light bulb what he did do was to discover a carbon fibre that lasted long enough to offer s practical light source This was quickly supercrded by metal Filomena bulbs ",
            "date": "Answered May 4, 2019",
            "views": "33",
            "upvotes": " View 2 Upvoters"
        }
    ]
}