{
    "title": "Did gravity exist before the universe or was it created along with it? - Quora",
    "tags": [
        "Gravity",
        "The Universe"
    ],
    "response": [
        {
            "author_info": {
                "name": "Scott S Gordon",
                "href": "/profile/Scott-S-Gordon"
            },
            "answer_text": "The creation of gravitational field occurred when energy made the jump to the G2 Gordon Energy State. The G2 Gordon Energy State is when G = 2 in the GOD Equation:  A particle with E2 energy associated with mass (m2) existing in the E0 energy of spacetime must create a gravitational field. There is no way around it. The universe existed before the big bang where all the energy in the universe was E0 energy in the form of a 2D spatial dimensional spacetime of the parallel planar universe. Gordon’s Theory of Everything shows that once G2 particles are created, they must contain mass (No Higgs Boson required for assembly). The reason why all the newly created matter in the universe was able to be forced outward was because there was a force much stronger than gravity and that was the E0 energy gradient in the newly form 3D spacetime created during the big bang. Over time the huge E0 energy gradient decreased and the E0 energy gradient of gravity was able to pull adjacent nearby particles containing mass together. Gordon’s Theory of Everything provides the missing foundation on which all of physics needs to be rebuilt on. ",
            "date": "Answered July 29, 2016",
            "views": "742",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Horia Tudosie",
                    "user_href": "/profile/Horia-Tudosie"
                }
            ]
        },
        {
            "author_info": {
                "name": "Doug Snell",
                "href": "/profile/Doug-Snell"
            },
            "answer_text": "JJ, you write ‘Is the law of gravitation destined to be the same it is now or would it be any different if the universe turned out to be different.’ Understanding turns ‘out to be different’, not the universe… The universe is what it is. Like a woman, it wants to be known, but it is not going to just write all about itself in a book so we can just read it and know. No, the universe is there plain as the sun, waiting to be figured out; but astro-cosmo-science just can not understand her/it, yet. Gravity is a force, and it is reliant on mass/volume of matter to give rise to it-gravity. Gravity is king in my ToE. And perhaps the big bang happened as no remaining gravitational objects were outside the one remaining singular mass, causing a reaction-explosion-spreading. Gravity is different than light in that gravity does not curve etc, nor does gravity get bent back to ‘no escape’ as light does at an event horizon of a black hole: gravity effects light yet light has little effect on gravity. Science claims gravity and light have the same speed, yet, perhaps they just can’t see gravity act any faster than light allows it observed. Perhaps gravity can be faster than light while science’s (misunderstanding) postulate of light says ‘nothing is faster than the speed of light’. To simplify the universe, I think of just a few priorities, 1-matter=mass, 2-gravity, 3- proximity-location; the rest is elementary/chess…..and Gravity is king. douG ",
            "date": "Answered July 30, 2016",
            "views": "14",
            "upvotes": " Answer requested by Joseph Joshy",
            "upvoters": [
                {
                    "user_id": "Tina Dao",
                    "user_href": "/profile/Tina-Dao-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kenan Mckinnon",
                "href": "/profile/Kenan-Mckinnon"
            },
            "answer_text": "Conventionally its theorized that Gravity is the result of mass in space “warping the space time fabric” , resulting in time dilation around the object resulting in what we know as gravity. So the question goes back to that old saying “if a tree falls in the forest and no one is around to here it does it make a sound?” Well in the case, if the theory holds and there was only one singular mass of super dense energy before the Big Bang the gravity would only have existed in the minute point in space and no where else. BUT we know now that what gravity is and what is appears to be could be different, as we have other forces almost twin to gravity like centrifugal force which exists even in deep space non effected by super massive bodies where you will still experience a force acting upon you when you move relative to your motionless point in space, plenty of experiments done on the ISS where they are in microgravity. So if not gravity still something( which I believe to be the same force) is acting upon this universe even when gravity, as conventionally thought, would not be taking place. ",
            "date": "Answered July 29, 2016",
            "views": "563",
            "upvotes": " Answer requested by Joseph Joshy",
            "upvoters": [
                {
                    "user_id": "Joseph Joshy",
                    "user_href": "/profile/Joseph-Joshy-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeffrey Werbock",
                "href": "/profile/Jeffrey-Werbock"
            },
            "answer_text": "The universe is not a creation. It exists in the only moment there is, Now. Because space rolls, we perceive motion and that induces our sense of time. Energy cannot be created, it has no time. Gravity is not a force, it’s an effect of rolling space which forces everything to be on a convergence course. Imagine two entities aware of each other but not aware of their sideways motion toward a common, distant convergence point. They will both be convinced of some mysterious force drawing them toward each other. To get a better grasp of this principle, please view this animated video:  ",
            "date": "Answered March 12, 2018",
            "views": "107",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Yncas",
                "href": "/profile/Yncas"
            },
            "answer_text": "Nothing existed before the big bang (as far as we know) and I would really like to clarify what I mean by nothing. When I use the word nothing, I mean it in the most literal sense. When you go into outer space, you are in a vacuum. Everything is black and you can see starts off into the distance. There is no atmosphere, this is what most people think of when they here the word nothing; this is not what I mean. In a vacuum, there is still space-time, quantum fluctuations, spatial dimensions, forces such as gravity. Before the big bang, there was none of this. I would also like to clarify what dimensions are. The amount of dimensions = the amount of coordinates you need to specify a unique point in space.  The picture above illustrates spatial dimensions, our universe only has three of these (as far as we know). Before the big bang, there was none of this. Even asking what it looked like before the big bang is meaningless because there was nothing there to look at, no space for anything to exist in. ",
            "date": "Answered August 16, 2016",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Doerfler",
                    "user_href": "/profile/David-Doerfler"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhishek Rohilla",
                "href": "/profile/Abhishek-Rohilla-13"
            },
            "answer_text": "No,it didn't existed before big bang and it was created after a very very very short time after big bang and it was created at the same time with strong nuclear force,you can learn about it in the field super symmetry breakdown, the two forces strong nuclear force and gravity were same at a time and were separated after big bang ",
            "date": "Answered July 29, 2016",
            "views": "471",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dick Wheeler",
                    "user_href": "/profile/Dick-Wheeler-1"
                },
                {
                    "user_id": "Mike Jackson",
                    "user_href": "/profile/Mike-Jackson-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rafe Rakaro",
                "href": "/profile/Rafe-Rakaro"
            },
            "answer_text": "Gravity is the consequence of distortions in spacetime, caused by mass. Is that a ‘force’, I’m not so sure. Hence, before the BB, no mass = no gravity, although I accept the potential for gravity to exist I think that the BB happened within our ‘universe’ (which pre-existed). I think that the consequences of mass distorting spacetime will always be the same, so no, gravity will never be ‘different’, within our universe. as to another ‘imaginary universe, I don’t have a clue? rafe ",
            "date": "Answered July 29, 2016",
            "views": "194",
            "upvotes": " Answer requested by Joseph Joshy and Joey Harrison"
        },
        {
            "author_info": {
                "name": "Floyd Baker",
                "href": "/profile/Floyd-Baker-8"
            },
            "answer_text": "Gravity, aka electromagnetic attraction, originates in the atom. There was no gravity before the universe. But that point is moot as the universe itself has been in existence forever. The Big Bang is a big farce. And in fact it is at the moment being replaced by the big bounce. IMHO ",
            "date": "Answered November 5, 2018",
            "views": "44",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jan Layton",
                "href": "/profile/Jan-Layton"
            },
            "answer_text": "Gravity did not exist before the Big Bang. Nothing did. Gravitation will never change in our universe, according to Einstein. If the universe turned out to be different, we would not know if gravity would be unlike ours unless we were there. ",
            "date": "Answered August 7, 2016",
            "views": "261",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Wayne Francis",
                "href": "/profile/Wayne-Francis"
            },
            "answer_text": "General Relatively (GR) works with an empty universe. One way to think about it is does sound exist if there is no medium? I say our universe supports it. The physical laws support it even if there was no mass/energy to produce it. ",
            "date": "Answered July 29, 2016",
            "views": "447",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Roger Pearlman",
                "href": "/profile/Roger-Pearlman"
            },
            "answer_text": "with it, but took a bit before defined/distinct from the other forces in nature..reference RCCF framework ",
            "date": "Answered March 15, 2018",
            "views": "49",
            "upvotes": "0"
        }
    ]
}