{
    "title": "Difference between old literature and modern literature? - Quora",
    "tags": [
        "Classic Books and Major Works",
        "English Literature"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tim Rupp",
                "href": "/profile/Tim-Rupp-1"
            },
            "answer_text": "What’s the difference between an old car and a modern car? A modern car may have all of the conveniences, gadget and modern technology that make driving more pleasurable, but older cars still have their appeal and allure, particularly if they are a popular brand or one that evokes memories in us. In fifty years time, however, a modern car may be classed as old! On a slightly technical note, I haven’t actually heard of a period in literature that has been defined as ‘old’. It may make answering this question easier if we could establish what is meant by the term ‘old’ literature. Modern literature is normally used as a term that covers writing from the middle of the nineteenth century until today. The change is marked when the style of writing and the freedom of expression moved away from the styles that had gone before. As a phrase it lacks meaning when a lot of critics refer to periods as ‘Nineteenth Century Literature’, ‘Twentieth Century Literature’, Twenty-first Century Literature’. Prior to the mid-nineteenth century, literature was not ‘old’. There was ‘Classical Literature’, ‘Elizabethan Literature’, ‘Tudor Literature’, ‘Eighteenth Century Literature’, ‘Mediaeval Literature’ etc. but not ‘old’ literature. To lump the entire world of writing into two chunks (modern and old) is a disservice to the study of literature and to the writers of the different period. Literature has gone through many changes and each stage in the development of literature has its own set of features and forms that each have merit in their own right. Everything written before 1880 shouldn’t just be dismissed as ‘old’! ",
            "date": "Answered August 21, 2020",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Md Maksud",
                "href": "/profile/Md-Maksud-45"
            },
            "answer_text": "\"The sort that snatches my heart, insults me, catches my spirit, awakens me from obliviousness and advises me that writing has the force and puzzle of a monster,\" says the Melbourne-based writer, whose own novel, The Enlightenment of the Greengage Tree (Europa Editions) does precisely this as it catches the zeitgeist of Iran following the foundation of an Islamic state.  Set in Tehran during the main decade of the 1979 Islamic Revolution, Azar's epic is a fine case of the brilliant utilization of enchantment authenticity. Described by the apparition of a 13-year-old young lady, Bahar, it recounts to the tale of a scholarly group of five constrained to escape their home in Tehran for Razan, a far off town, with the expectation that they will be saved the strict frenzy overwhelming the nation. They in the end surrender to the monstrosities executed by the fundamentalist system. Inhabited by the living and the dead, people and jinns, fireflies and dragonflies, spirits and diviners, supernatural animals and mermaids, the novel opens with Roza, the mother, achieving illumination on the tallest greengage plum tree in the forest of their home on a slope sitting above the 53 places of the town. She does that at the specific second on August 18, 1988, when her child, Sohrab, blindfolded and with his hands bound behind his back, is hanged without a preliminary in the wake of being in imprisonment for a long time. The following day, he is covered with many other political detainees in a long pit in the deserts south of Tehran, \"with no sign or marker in case a relative come years after the fact and tap a stone on a tombstone and mumble there is no god except for God.\" As the novel advances we find how the family's fates are profoundly snared in the situations that develop throughout the decade and get a brief look into the rule of fear released by the mullahs at the command of Ayatollah Khomeini, the incomparable strict pioneer of the Islamic Republic of Iran, who came to control subsequent to toppling Shah Mohammad Reza Pahlavi of Pahlavi administration.  \"A month after the finish of the eight-year Iran-Iraq war, in the late spring of 1988, in excess of 5,000 rivals of the Islamic system were executed in the jails without preliminary or by fast and unjustifiable preliminaries. From that date until today, the system has never authoritatively recognized the slaughter. Furthermore, because of restriction, it has never been an aspect of the Iranian writing,\" says Azar, underlining that off-base political frameworks take a bigger number of lives than the Covid. Written in Persian yet never distributed in Iran however it is accessible on certain sites, the novel catches the turbulent social and political real factors of Iran through a fragile mix of its exemplary narrating styles — fantasies, legends and people conventions. It was converted into English and distributed in Australia in 2017 by a little distributer, Wild Dingo Press. After it was shortlisted for the 2018 Stella Prize, the US, UK and Italy rights were offered to Europa Editions and the book was distributed abroad in January this year. This is the first occasion when that an Iranian writer has been assigned for the International Booker Prize. Notwithstanding, it is improbable that the novel will actually be distributed in Iran. The American interpreter of the novel, who regularly goes to the nation, has decided to stay mysterious. Azar, who functioned as a columnist in Iran and secured get-togethers, was put in jail a few times until she was constrained to escape the nation and move to Melbourne in 2011. For Azar who is additionally the principal Iranian lady to have caught a ride the whole length of the Silk Road, the Booker International selection was a fantasy worked out. What's more, however the honor inevitably went to Marieke Lucas Rijneveld's The Discomfort of Evening, the novel's accessibility and acknowledgment in the West methods English perusers will find anew the profundity and essentialness of Iran's rich history of exemplary writing and culture.  Azar's emphasis is on featuring the destiny of people under tyrannical systems. For the novel, she drew on the accounts of a considerable lot of her companions who lost a few relatives and it is brimming with occurrences and scenes that depict the outrages of the system in grisly detail. In a passage following Sohrab's hanging, Azar expresses: \"In the next days, the quantity of individuals executed expanded so much that bodies heaped high in the jail back yard and started to smell, and Evin's ants, flies, crows, and felines, who hadn't had such a gala since the jail was manufactured, licked, sucked and picked at them insatiably. Adolescent political detainees were conceded an acquittal by the Imam in the event that they discharged the last shot that would put the denounced out of their wretchedness. With wounded faces, shuddering hands, and jeans doused with pee, many thirteen and fourteen-year-olds, whose lone wrongdoing hosted been taking an interest in a get-together gathering, perusing restricted leaflets, or dispersing flyers in the road, discharged the last shot into faces that were in some cases despite everything watching them with jerking understudies.\" For the moms, much the same as Sohrab was to Roza, their children were \"the climax of pulses, wants, cherishes and trusts\" that they had persevered through as long as they can remember just to lose them at long last. When Sohrab is hanged, the family observes \"a feeling of misery\" saturating the very cells of their being. Their dad, Hushang, requests that they compose anything to grapple with the misfortune. However, with each word they resolve to paper, they get that, as opposed to what their dad accepted, \"culture, information, and craftsmanship retreat notwithstanding brutality, the blade and fire — and for a considerable length of time after stay desolate and quiet.\" Bahar lets us know: \"It had happened ordinarily previously, during the years following the Arab success of Persia in the seventh century, for instance, a period the researcher Abdolhossein Zarrinkoub called 'the two centuries of quietness.'\" Azar says that a little minority in Iran, including her own family, accepts that the Shah's system was substantially more reformist, present day, and devoted than the Islamic system. \"History has basically demonstrated the equivalent to the Iranian public,\" she says, including how, for as far back as 20 years, since the primary enormous scope show, known as \"College Dormitory Demonstrations\" (Kouy-e Daneshgah) in 2000, individuals the nation over have held a great many tranquil exhibitions against shamefulness, segregation, politicized Islam, monetary debasement, political defilement, suppression of dissenters and oversight. \"Be that as it may, not even in one case has the system reacted emphatically to these fights and the a lot of these fights has been just capture, detainment and execution,\" she says. In the novel, Azar proposed to be a storyteller of a small level of Iranian dissenters in the 1979 upheaval who casted a ballot \"No\" to the Islamic Republic in the 1980 submission; the families that were fundamentally the same as her own. \"These families restricted Islam, Khomeini, and the Revolution, and thought about the Islamic Revolution as an unsalvageable deviation in the advancement of present day Iran,\" she says. Indeed, even the nonconformists, who were later captured and executed in the mid year of 1988, had casted a ballot \"Yes\" to this system in the 1980 submission. She says: \"If this novel had been written during the 1980s, a huge populace of Iranians would have restricted the story. In any case, today, 40 years after the system arrangement, about 90 percent of Iranians have perceived that the Islamic Revolution was an irreversible slip-up during the time spent turn of events and majority rule government of Iran.\" In the novel, the anecdotal Khomeini is tormented by the phantoms of those executed, detained in the royal residence of mirrors they constrain him to manufacture. Caught in the castle, the despot meets his monstrous end, having been compelled to get that while conveying talks he may have been a savage ruler, however in discourse he didn't be anything yet an \"unshaven, counter-intuitive young man, obstinate and affected\". The despot murmurs a solitary sentence in his last minutes: \"It took 87 years to comprehend that the scholarly and formal guidelines of the discourse are generally unique in relation to those of exchange.\"  Azar, whose novel has brought the tale of the political overabundances of the Islamic system in Iran to the consideration of perusers in the West, feels that there is an \"etymological separate\" between the scholarly and abstract results of Iranians and the world. \"Amazing books, predominantly true to life, have been distributed in Farsi (inside and outside Iran), however have never been converted into another dialect. Along these lines, the West has little thought of the advancement of Iranian idea,\" she says. Mystical authenticity gives Azar the potential outcomes that authenticity doesn't. \"As I would see it, the best style to show the stature and profundity of genuine human sentiments and feelings is otherworldly authenticity. In this novel, I have attempted to introduce that dream and enchantment in enchantment authenticity can be utilized in the administration of real occasions. Hence, the enchantment authenticity in this novel has been utilized to report the genuine political, social and strict issues in Iran. That is, enchantment serves authenticity in this novel,\" she says.  It was enchantment authenticity that helped her compose the sort of novel that Azar herself likes to peruse: one that has a place with the class of writing that helps us to remember \"human heart and ethical quality\" in the midst of the breakdown of social ethical quality; writing that has faith in mankind; writing that originates from \"crazy, exploratory, basic, imaginative and pioneer minds\". It is the sort of composing that has molded Azar's own psyche and composing, as it has the brains and work of numerous other Iranian theater author chiefs, mythologists, rationalists, music writers and painters. ",
            "date": "Answered September 13, 2020",
            "views": "18",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Farhana Mili",
                    "user_href": "/profile/Farhana-Mili-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Haseeba Qayyum",
                "href": "/profile/Haseeba-Qayyum"
            },
            "answer_text": "Old Literature dates back to 3400 B.C. Sumerians created the first literary piece. Modern literature on the other hand dates back to late 19th Century. Both are different in terms of characteristics. Old Literature was confined to chivalry, bravery, heroism and strength. Moderm literature was a doorway to individuality, love, romance, beauty, and nature. Old literature had was traditional in nature, Modern loterature defies tradition! Consider Beowulf, the Epic by Bede and E.E. Cummings to get a better insight into both. ",
            "date": "Answered December 17, 2018",
            "views": "29",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sheridan Povedano",
                    "user_href": "/profile/Sheridan-Povedano"
                },
                {
                    "user_id": "James Welch",
                    "user_href": "/profile/James-Welch-26"
                },
                {
                    "user_id": "Leian Joyce Del Valle",
                    "user_href": "/profile/Leian-Joyce-Del-Valle"
                },
                {
                    "user_id": "James W Clarke",
                    "user_href": "/profile/James-W-Clarke-1"
                }
            ]
        }
    ]
}