{
    "title": "Diffusion takes place according to concentration gradient. Is it possible for materials to move against concentration gradient gradient? - Quora",
    "tags": [
        "Divyank, the Divine Constant.",
        "Divyank Ratio",
        "Gradient Descent",
        "Diffusion",
        "Focusing and Concentrating"
    ],
    "response": [
        {
            "author_info": {
                "name": "Prof. Shiv Bhushan Sharma",
                "href": "/profile/Prof-Shiv-Bhushan-Sharma"
            },
            "answer_text": "The diffusion of materials across the cell membrane is a passive process without the use of any energy. The movement is along the concentration gradients. The transport of materials across the cell membrane against the concentration gradient is called an active process with the use of energy. Active transport is of two types. 1. Primary Active Transport: Adenosine triphosphate (ATP) is the energy used. Example: Sodium-Potassium-ATP-pump. 2. Secondary Active Transport: Energy provided by Sodium ions in most cases. It is of two types. A. Symport or Co-Transport: Two molecules moving in one direction. Example: Glucose-Sodium. Amino acid-Sodium. B. Antiport: Two molecules moving in opposite directions. Example: Sodium-Potassium Pump. A New Hypothesis: According to Akhand Sutra, Sodium-Potassium Pump can work without ATP. How? According to medical books, Sodium-Potassium Pump: 3 Sodium Ions and 2 Potassium Ions. According to Akhand Sutra, Sodium-Potassium Pump: 34 Sodium Ions and 21 Potassium Ions. The ratio of 34 and 21 is called Divyank Ratio. Divyank Ratio is the most economical algorithm of Nature. Divyank Ratio is derived from Divyank, the Divine Constant. Divyank: ((22/21)10.34419)=1.618034. The Scientific Proof and Evidence: The molecular weight of 34 Sodium ions is approximately 748 (equal to 22). The molecular weight of 21 Potassium ions is approximately 714 (equal to 21). The Suggestion: Sodium (22) and Potassium (21) pump can work as an effective antiport process without any energy. For detailed knowledge, please download and read Akhand Sutra from Akhand Vidyashram. The eBook is free. ",
            "date": "Answered May 7, 2020",
            "views": "143",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mukund Varadarajan",
                    "user_href": "/profile/Mukund-Varadarajan-2"
                },
                {
                    "user_id": "Keerthana",
                    "user_href": "/profile/Keerthana-451"
                },
                {
                    "user_id": "Dipak Kumar Das",
                    "user_href": "/profile/Dipak-Kumar-Das-59"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sitaram Bettadpur",
                "href": "/profile/Sitaram-Bettadpur"
            },
            "answer_text": "Not without the use of energy. For example, in cells, active transport takes place wherein ions are transported against the concentration gradient. This happens, for example, in muscle cells and requires energy, not only to move ions against the concentration gradient (needed to make the muscle contract) but also to stop them from diffusing back. BTW, this is where work is done: even if you are holding a bag of provisions in your hand and the bag is stationary (displacement = 0, work done against gravity = 0), active transport is constantly taking place to stop diffusion; you have a force (diffusion trying to equalize concentration) and displacement. ",
            "date": "Answered May 7, 2020",
            "views": "25",
            "upvotes": "0"
        }
    ]
}