{
    "title": "Do earthquakes occur everywhere? - Quora",
    "tags": [
        "Seismology",
        "Earthquakes"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Noel",
                "href": "/profile/Paul-Noel-5"
            },
            "answer_text": "Actually Earthquakes do occur everywhere on earth but most locations the intensity is very low. Causes can vary from (where I live in Alabama USA) mine explosions to genuine massive quakes of entirely natural origin. At this time many earthquakes in the USA have a man-made component but it is not sure the exact relationship to man’s actions and natural forces. The whole earth is continually vibrating with earthquake energy. This is how our seismographs work. This is how we can measure the consistency of the center of the earth by the speed these waves travel through the earth. Oklahoma USA used to have almost no earthquakes. Right now it is probably the most active site in the USA. There is a definite relationship to the process known as Fracking but exactly what is going on is not for sure. Fracking does involve enough energy to cause a major earthquake as a single fracking of a well can have enough energy to produce a 4.5 earthquake. However; it is not known if the process is merely causing natural forces to be released or if it is entirely man caused. Some locations this information is clear, and in others it is not. The recent earthquakes in Flomaton Alabama and just across the line in Florida are most definitely nearly 100% man caused. (4.5 and 4.0) But do not let the obvious caused earthquakes be the whole anwer. If man is causing something and he releases natural forces the quake could be a lot stronger. We are just learning the story. ",
            "date": "Answered April 23, 2019",
            "views": "114",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jeanne Paquette",
                "href": "/profile/Jeanne-Paquette-1"
            },
            "answer_text": "No. The motion of crust against crust that generates an earthquake only occurs where the Earth’s crust suddenly breaks and moves. This happens mostly along the edges of tectonic plates (at convergent margins and transform margins, where the different sections of Earth’s crust push against each other, or slide sideways past each other, explained in Where Do Earthquakes Happen?). In places where a tectonic plate was pulled apart (“rifted”) deep cracks (“faults”) appeared in Earth’s crust. Those fauults can be a site of episodic motion for tens of millions of years afterward, even if they are quite far from an active plate margin. The spot underground where the rock breaks is called the focus of the earthquake. The place right above the focus (on top of the ground) is called the epicenter of the earthquake. However, an earthquake is felt over a somewhat larger distance than at its focus or its epicenter. The breaking of Earth’s crust radiates seismic energy, and this energy travels through Earth’s crust as body waves and surface waves. Those are well explained at What Are Seismic Waves? The surface waves are almost entirely responsible for the damage and destruction associated with earthquakes. They travel through the solid crust, moving it horizontally sideways , but also up and down like a rolling wave. The damage to buildings and structures is usually worsened in the area being shaken if they were built on soft sediment, or soil that is easily loosened on hill slopes, etc. In earthquake prone countries, geological surveys keep track of earthquakes in order to identify the areas where the risk is highest. There is more information about this at United States - Lower 48 and the map below indicates the relative risk estimated for the next 50 years.  It is particularly interesting to compare this with their short-term prediction, i.e. the risk of minor earthquakes within the year (Short-term Induced Seismicity Models) induced by the disposal of wastewater (saltwater) produced during oil and gas extraction and (to a far lesser extent) fluid injection related to oil and gas extraction by fracking. Common misconceptions are covered at Induced Earthquakes).  ",
            "date": "Answered April 15, 2019",
            "views": "129",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dave Nelson",
                "href": "/profile/Dave-Nelson-89"
            },
            "answer_text": "\"Do earthquakes occur everywhere?\" They can occur anywhere because there are changing stresses in the crust everywhere on Earth. It's just that in particular areas, the stresses build up quicker. ",
            "date": "Answered April 16, 2019",
            "views": "31",
            "upvotes": "0"
        }
    ]
}