{
    "title": "Do ghosts exist? If not, why do we see them? - Quora",
    "tags": [
        "Ghosts",
        "The Paranormal",
        "Supernatural Phenomena"
    ],
    "response": [
        {
            "author_info": {
                "name": "Duckworth Ann",
                "href": "/profile/Duckworth-Ann"
            },
            "answer_text": "If we can think the spirit world exists, then we must look at the Bible for those explanations. That would be the only source which shows just what those spirits are. I am afraid the belief of soul living on after death is misleading many persons. You see many teachings have come about over the years and have formed much unfounded dogma about the afterlife. This is why the Bible is very important for seeing just as God, who is the Grand Spirit feels about this. Where Are The Dead Really? Many persons today are being given many different views of what happens to persons when they die. The current view is that persons who die remain in some spirit form afterwards. It is claimed they may come back in some form: leave messages, appear at times, and even do good or bad things depending upon their mood. We need to see that the very powerful and seemingly very insightful occurrences of the supernatural are caused, not by those who have died but by very real spirit forces, which can take on many forms and wield much force. The emblems and rituals used may create feelings of protection but are not going to protect persons. See where in the article such emblems and rituals are not helpful. Most of all, know those forces are not those who have died, even when displaying seemingly convincing evidence. We need to see this as a perpetuated lie by those demons in an attempt to contradict the Bible. The Bible is very clear on what happens when a person dies. Ecclesiastes 9:5; “The living are conscious that they will die; but as for the dead, they are conscious of nothing at all.” Psalm 146: 3-4, says: “Do not put your trust in nobles, nor in the son of earthling man, to whom no salvation belongs. His spirits goes out, he goes back to his ground; in that day his thoughts do perish.” Isaiah 26:14 “They are dead; they will not live. Impotent in death, they will not rise up. Ezekiel 18:4 “Look! All souls—to me they belong. As the soul of the father so likewise the soul of the son—to me they belong. The soul that is sinning, it itself will die.” Since Adam had sinned, this then created imperfection and death to all persons born from Adam. However, the dead are pictured as asleep and not dead forever. The Bible shows the dead as asleep and can be awakened by God Acts 13:36” For David, on the one hand, served the express will of God in his own generation and fell asleep [in death] and was laid with his forefathers and did see corruption.” Psalms 13:3 Do look [upon me]; answer me, O Jehovah my God. Do make my eyes shine, that I may not fall asleep in death. Luke 8:51-54 Once Jesus said concerning a twelve-year-old girl: “She did not die but is sleeping.” “People began to laugh at him because they knew she had died.” Yet the Bible explains that Jesus woke her from the sleep of death. – “When he reached the house, he did not let anyone go in with him except Peter and John and James and the girl’s father and mother. But the people were all weeping and beating themselves in grief for her. so he said: “STOP weeping, for she did not die but is sleeping. At this they began to laugh at him scornfully, because they knew she had died. But, he took her by the hand and called, saying, “Girl, get up!” It was similar when Lazarus died. John 11:11-14 “Lazarus our friend has gone to rest, but I am journeying to awaken him from sleep. Therefore the disciples said to him: “lord, if has gone to rest, he will get well.” Jesus, however, had spoken about his death. But they imagined he was speaking about taking a rest in sleep. The disciples did not understand what Jesus meant, so Jesus said to them outspokenly; ‘Lazarus has died.’” The apostle Paul too spoke of those ones ‘who had fallen asleep in death’ and said that in God’s due time, they would be brought back to life. 1Thessalonians 4:13-15 – Moreover, brothers, we do not want YOU to be ignorant concerning those who are sleeping [in death]; that YOU may not sorrow just as the rest of those who have no hope. For if our faith is that Jesus died and rose again, so too, those who have fallen asleep [in death] through Jesus, God will bring with him. For this is what we tell you by Jehovah’s word, that we the living who survive to the presence of the Lord shall in no way precede those who have fallen asleep [in death]. Isaiah 65; 20-25 says “No more will there come to be a suckling a few days old from that place, neither and old man who does not fill his days; for one will die as a mere boy, although a hundred years of age; and as for the sinner, although a hundred years of age, he will have evil called down upon him. And they will certainly build houses and have occupancy; and they will certainly plant vineyards and eat their fruitage. They will not build and someone else have occupancy; they will not plant and someone else do the eating. For like the days of a tree will the days of my people be; and the work of their own hands, my chosen ones will use to the full. They will not toil for nothing, nor will they bring to birth for disturbance, because they are the offspring made up of the blessed ones of Jehovah, and their descendants with them. And it will actually occur that before they call out, I myself shall answer; while they are yet speaking, I myself shall hear. The wolf and the lamb themselves will feed as one, and the lion will eat straw just like the bull; and as for the serpent, his food will be dust. They will do no harm nor cause any ruin in all my holy mountain, Jehovah has said” The most beautiful part, all of those who had died before the point had been proven on the last day will be coming back in a resurrection. You see, they did not have the same opportunity to choose the correct path as did Adam and Eve. It says, “Do not two sparrows sell for a coin of small value? Yet not one of them will fall to the ground without your Father’s knowledge. But the very hairs of your head are all numbered.” Matthew 10: 29-31 Those hairs were numbered for a reason, to put those hairs back in the very same places when our loved ones are brought back. Yes, our loved ones are coming back. Daniel 12:13 “And as for you yourself, go toward the end; and you will rest, but you will stand up for your lot at the end of the days.” John 6:39-40 “This is the will of him who sent me, that I should lose nothing out of all that he has given me but that I should resurrect it at the last day. For this is the will of my Father, that everyone that beholds the Son and exercise faith in him As for Laz′a·rus John 11:17 Consequently when Jesus arrived, he found he had already been four days in the memorial tomb. 18 Now Beth′a·ny was near Jerusalem at a distance of about two miles. 19 Accordingly many of the Jews had come to Martha and Mary in order to console them concerning their brother. 20 Therefore Martha, when she heard that Jesus was coming, met him; but Mary kept sitting at home. 21 Martha therefore said to Jesus: “Lord, if you had been here my brother would not have died. 22 And yet at present I know that as many things as you ask God for, God will give you.” 23 Jesus said to her: “Your brother will rise.” 24 Martha said to him: “I know he will rise in the resurrection on the last day.” 25 Jesus said to her: “I am the resurrection and the life. He that exercises faith in me, even though he dies, will come to life; 26 and everyone that is living and exercises faith in me will never die at all. Do you believe this?” 27 She said to him: “Yes, Lord; I have believed that you are the Christ the Son of God, the One coming into the world.” 28 And when she had said this, she went off and called Mary her sister, saying secretly: “The Teacher is present and is calling you.” 29 The latter, when she heard this, got up quickly and was on her way to him. Jesus had not yet, in fact, come into the village, but he was still in the place where Martha met him. 31 Therefore the Jews that were with her in the house and that were consoling her, on seeing Mary rise quickly and go out, followed her, supposing that she was going to the memorial tomb to weep there. 32 And so Mary, when she arrived where Jesus was and caught sight of him, fell at his feet, saying to him: “Lord, if you had been here, my brother would not have died.” 33 Jesus, therefore, when he saw her weeping and the Jews that came with her weeping, groaned in the spirit and became troubled; 34 and he said: “Where have YOU laid him?” They said to him: “Lord, come and see.” 35 Jesus gave way to tears. 36 Therefore the Jews began to say: “See, what affection he used to have for him!” 37 But some of them said: “Was not this [man] that opened the eyes of the blind man able to prevent this one from dying?” Hence Jesus, after groaning again within himself, came to the memorial tomb. It was, in fact, a cave, and a stone was lying against it. 39 Jesus said: “TAKE the stone away.” Martha, the sister of the deceased, said to him: “Lord, by now he must smell, for it is four days.” 40 Jesus said to her: “Did I not tell you that if you would believe you would see the glory of God?” 41 Therefore they took the stone away. Now Jesus raised his eyes heavenward and said: “Father, I thank you that you have heard me. 42 True, I knew that you always hear me; but on account of the crowd standing around I spoke, in order that they might believe that you sent me forth.” 43 And when he had said these things, he cried out with a loud voice: “Laz′a·rus, come on out!” 44 The [man] that had been dead came out with his feet and hands bound with wrappings, and his countenance was bound about with a cloth. Jesus said to them: “Loose him and let him go.” Therefore many of the Jews that had come to Mary and that beheld what he did put faith in him Those who have been damaged in some way mentally, physically, or emotionally will be made whole again. Those living in the new system will be perfectly healthy and be as perfect as others. This is why Jesus had to give his ”perfect life” for “Adam was perfect”, so Jesus was chosen one to become the perfect ransom sacrifice for Adam who was perfect. The rest of mankind will continue putting their faith in this old world order and its completely failed, human direction. God will then (by reading their hearts) those who chose to not want to be in that new system. Daniel 2:44; Psalms 37. The ones who desire to live properly will survive and not die, inheriting the new paradise earth and the paradise he has intended from the beginning. Psalms 37; Isaiah 11; and Isaiah 65 – Dead sleeping in death are to be resurrected. Revelation 20:4-6 Yes, I saw the souls of those executed with the ax for the witness they bore to Jesus and for speaking about God, and those who had worshipped neither the wild beast nor its image and who had not received the mark upon their forehead and upon their hand. And they came to life and ruled as kings for a thousand years. The rest of the dead did not come to life until the thousand years were ended. This is the first resurrection. Happy and holy is anyone having part in the first resurrection; over those the second death has no authority, but they will be priests of God and of the Christ, and will rule as kings with him for the thousand years. This rule would last for a thousand years. During this time, Satan and his millions of fallen angels will be abyssed for a thousand years. Revelation 12:3-5, where we read: “Another sign was seen in heaven, and, look! a great fiery-colored dragon, with seven heads and ten horns and upon its heads seven diadems; and its tail drags a third of the stars of heaven, and it hurled them down to the earth. And the dragon kept standing before the woman who was about to give birth, that, when she did give birth, it might devour her child. And she gave birth to a son, a male, who is to shepherd all the nations with an iron rod. And her child was caught away to God and to his throne.” During that time, all of those persons who survive and all of those who are brought back will grow to perfection. After the thousand years have ended, Satan will then be released and will tempt to control and dissuade those with the same choice he gave Adam and Eve. The Bible continued to say regarding those who will choose not to follow God or – the wicked. Their numbers are listed as the sands of the sea. Here, those who choose not to follow God are finally destroyed in the second death. Revelation 20:14 and Revelation 20:8. Where Did We Get The Teachings The Soul Lives On The Bible never said that man had an immortal soul. Genesis 2:7 And Jehovah God proceeded to form the man out of dust from the ground and to blow into his nostrils the breath of life, and man came to be a living soul. (note, not immortal but simply a living soul) Let’s see what we have already learned: Ezekiel 18:4 Ezekiel 18:4 “Look! All souls—to me they belong. As the soul of the father so likewise the soul of the son—to me they belong. The soul that is sinning, it itself will die.” Acts 3:23 Indeed, any soul that does not listen to that Prophet will be completely destroyed from among the people. Even Animals are souls And God went on to say: “Let the waters swarm forth a swarm of living souls and let flying creatures fly over the earth upon the face of the expanse of the heavens.” 21 And God proceeded to create the great sea monsters and every living soul that moves about, which the waters swarmed forth according to their kinds, and every winged flying creature according to its kind. And God got to see that [it was] good. 22 With that God blessed them, saying: “Be fruitful and become many and fill the waters in the sea basins, and let the flying creatures become many in the earth.” 23 And there came to be evening and there came to be morning, a fifth day. And God went on to say: “Let the earth put forth living souls according to their kinds, domestic animal and moving animal and wild beast of the earth according to its kind.” And it came to be so. 25 And God proceeded to make the wild beast of the earth according to its kind and the domestic animal according to its kind and every moving animal of the ground according to its kind. And God got to see that [it was] good. and every living soul died, [yes,] the things in the sea. Note Revelation 16:3 3 And the second one poured out his bowl into the sea. And it became blood as of a dead man, The confusion for the average person is in understanding the meanings of the original words that occurred in the Bible. We use the word “soul” as a translated word from other words in the original Bible, which was written in Hebrew and Greek. The original words for the word “soul” in Hebrew is word - ne′phesh, “that which breathes.” The Greek word psy·khe′ “the Greek word for soul” means the whole creature, now translated as “soul”. “The first man, Adam, as scripture says, became a living soul.” Note, “became,” not “was given.” and Greek are - The Bible calls sea creatures ne′phesh: “Every living soul that is in the waters.” (Leviticus 11:10) The word can refer to land animals: “Let the earth put forth living souls according to their kinds, domestic animal and moving animal and wild beast.” (Genesis 1:24) Hundreds of times ne′phesh means people. “All the souls who issued out of Jacob’s upper thigh came to be seventy souls.” (Exodus 1:5) An example of psy·khe′ being used this way is 1 Peter 3:20. It tells of Noah’s ark, “in which a few people, that is, eight souls, were carried safely through the water.” The Bible uses the word “soul” in many other ways. Genesis 9:5 says: “Your blood of your souls shall I ask back.” Here the soul is said to have blood. Exodus 12:16 says: “Only what every soul needs to eat, that alone may be done for you.” In this case the soul is said to eat. Deuteronomy 24:7 speaks of a man “kidnapping a soul of his brothers.” Surely it was not an immortal soul that was kidnapped. Psalm 119:28 says: “My soul has been sleepless from grief.” So the soul can even lose sleep. The Bible also shows that the soul is mortal. It dies. “That soul must be cut off from his people.” (Leviticus 7:20) “He may not come toward any dead soul.” (Numbers 6:6) “Our souls are to die.” (Joshua 2:14) “Any soul that does not listen to that Prophet will be completely destroyed.” (Acts 3:23) “Every living soul died.”—Revelation 16:3. Clearly, the Bible’s use of ne′phesh and psy·khe′ shows that the soul is the person or, in the case of animals, the creature. It is not some immortal part of an individual. Indeed, ne′phesh is even used of God himself: “Anyone loving violence His soul certainly hates.”—Psalm 11:5. Many Scholars Agree What do people who follow the religions of Judaism, Christendom, and Islam believe about life after death? Of these religions, Judaism is by far the oldest. Its roots go back some 4,000 years to Abraham—long before Socrates and Plato gave shape to the theory of the immortality of the soul. The ancient Jews believed in the resurrection of the dead and not in inherent human immortality. (Matthew 22:31, 32; Hebrews 11:19) How, then, did the doctrine of the immortality of the soul enter Judaism? History provides the answer. In 332 B.C.E., Alexander the Great conquered the Middle East, including Jerusalem. As Alexander’s successors continued his program of Hellenization, a blending of the two cultures—the Greek and the Jewish—took place. In time, Jews became conversant with Greek thought, and some even became philosophers. Philo of Alexandria, of the first century C.E., was one such Jewish philosopher. He revered Plato and endeavored to explain Judaism in terms of Greek philosophy, thus paving the way for later Jewish thinkers. The Talmud—written commentaries on oral laws by the rabbis—is also influenced by Greek thought. “The rabbis of the Talmud,” says the Encyclopaedia Judaica, “believed in the continued existence of the soul after death.” Later Jewish mystical literature, such as the Cabala, even goes as far as to teach reincarnation. Thus through the back door of Greek philosophy, the idea of the immortality of the soul found its way into Judaism. What can be said about the entry of the teaching into Christendom? Genuine Christianity began with Jesus Christ. Concerning Jesus, Miguel de Unamuno, quoted earlier, wrote: “He believed rather in the resurrection of the flesh, according to the Jewish manner, not in the immortality of the soul, according to the [Greek] Platonic manner.” He concluded: “The immortality of the soul . . . is a pagan philosophical dogma.” In view of this, we can see why the apostle Paul strongly warned the first-century Christians against “the philosophy and empty deception according to the tradition of men, according to the elementary things of the world and not according to Christ.”—Colossians 2:8. When and how, though, did this “pagan philosophical dogma” infiltrate Christendom? The New Encyclopædia Britannica explains: “From the middle of the 2nd century AD Christians who had some training in Greek philosophy began to feel the need to express their faith in its terms, both for their own intellectual satisfaction and in order to convert educated pagans. The philosophy that suited them best was Platonism.” Two such early philosophers who wielded a great deal of influence on Christendom’s doctrines were Origen of Alexandria and Augustine of Hippo. Both were deeply influenced by Plato’s ideas and were instrumental in fusing those ideas with Christian teachings. The teaching of the immortal soul came from men and beliefs that were not Christian. Genesis 3:4 At this the serpent said to the woman: “YOU positively will not die. Revelation 12:9 So down the great dragon was hurled, the original serpent, the one called Devil and Satan, who is misleading the entire inhabited earth; he was hurled down to the earth; and his angels were hurled down with him. Here we see how Satan was seeking to show persons, they would not die. So we know Satan was a liar, for Adam and Eve did die. The problem for some is the belief that remains from false teachings that the soul lives on after death. This teaching came from the Greek Philosopher Plato, who was quoting Socrates saying: The soul ... if it departs pure, dragging with it nothing of the body, … goes away into that which is like itself, into the invisible, divine, immortal, and wise, and when it arrives there it is happy, freed from error and folly and fear… and all other human ills, and lives in truth through all after time with the gods.’ Phaedo, 80 D,E; 81 A. Why the Bible condemns turning to spirit mediums and other attempts to contact the dead We should now have understanding that those who have died are asleep in death and are not awake and so “not able to perform any intelligent activity”. This only leaves visions of apparitions, fortune telling, and contacts with the dead as most assuredly the work of the many millions of demons who came to the earth before the flood and remain here now to mislead everyone they can through various controls and various displays of power. This is why long ago, the Bible warned against attempting to contact those persons who had died. Leviticus 19:31 “Do not turn yourselves to the spirit mediums, and do not consult professional fortune tellers or events, so as to become unclean by them. I am Jehovah YOUR God.” Deuteronomy 18:10-12 “There should not be anyone who makes his son or his daughter pass through the fire, anyone who employs divination, a practice or magic, or anyone who looks for omens or a sorcerer, or one who binds others with a spell, or anyone who consults a spirit medium or a professional foreteller of events or anyone who inquires of the dead. For everybody doing these things is something detestable to Jehovah, and on account of these detestable things Jehovah your God is driving them away from before you.” We must ask ourselves: would a God of love condemn this practice if the living were simply communicating with loved ones who had departed? On the other hand, if demonic spirits were impersonating the dead and misleading mankind by conveying to their minds impressions that would perpetuate a lie, would it not be loving on God’s part to safeguard his servants against such deception and those very harmful and powerful demons. Regarding Satan and his demons: it says: 2 Corinthians 11:14-15 and no wonder for Satan himself keeps transforming himself into an angel of light. it is therefore nothing great if his ministers keep transforming themselves into ministers of righteousness. But their end shall be according to their works. James 2:19 You believe there is one God, do you? You are doing quite well. And yet the demons believe and shudder. Mark 1:34 So he cured many that were ill with various sicknesses, and he expelled many demons, but he would not let the demons speak, because they knew him to be the Christ. Demons work through objects: many stem from pagan beliefs Today, as a result of the Roman Vatican II Council, some priests have ordered the removal of all images from their church buildings. Thus in Dominica a priest ordered this to be done, and the workmen simply lassoed the images and brought them crashing to the floor in a cloud of dust. But by and large, images remain in the churches. Even where such images are removed from one’s church the question each one who professes to be a Christian and desires to be pleasing to God must ask himself is, Do I have any objects in my home to which I give veneration or worship (intense faith in)? Regarding the cross: historical evidence shows that early Christians did not use crosses in their worship. Says the New Catholic Encyclopedia: The representation of Christ’s redemptive death on Golgotha does not occur in the symbolic art of the first Christian centuries. The early Christians, influenced by the Old Testament prohibition of graven images, were reluctant to depict even the instrument of the Lord’s passion.” Obviously, they never bowed before or kissed crosses. Not until the fourth century C.E. did the cross begin coming into use among professed Christians. The one primarily responsible for this was Emperor Constantine, a sun worshipper who is said to have accepted Christianity years before submitting to baptism while on his deathbed. The beginning of Constantine’s conversion is placed in the year 312, when he supposedly saw a cross in the sky. It is claimed that this cross was a Christian symbol and that Constantine took it to mean that the God of the Christians would grant him victory. But did sun-worshipping Constantine really see a Christian symbol? Why would God sanction the warfare of a sun worshipper? Years earlier, Jesus told Peter: “Return your sword to its place, for all those who take the sword will parish by the sword.” Matthew 26:52 - Hence the God of truth, whom Jesus represented, could not have backed up the wars of a sun worshipper and his sun worshipping army. Also note – No Biblical evidence even intimates that Jesus died on a cross. Regarding the Greek word “stauros” (which has been translated as cross) A comprehensive Dictionary of the Original Greek Words with their Precise Meanings for English Readers states – “The word “Stauros” denotes, primarily, and upright pale or stake. On such malefactor were nailed for execution.” Similarly, the book The Non-Christian Cross observes: ‘There is not a single sentence in any of many numerous writings forming the New Testament, which, in the original Greek, bears even indirect evidence of to the effect that the “stauros” used in the case of Jesus was anything other than an ordinary pole or stake. Thus the cross had no meaning to the first Christians and certainly would not have been bowed down to or worshipped by the first Christians. There are many objects that appear very beautiful but can be worshipped in some way or used in some blessed protection. These are the very things Jehovah warned his servants about years ago in connection with Spiritism and demons. This is why he prohibited the use of objects as guides and devotional aides (any engraved images). Exodus 20:4-6 “You must not make for yourself a carved image or a form like anything that is in the heavens above or that is on the earth underneath or that is in the waters under the earth. You must not bow down to them nor be induced to serve them, because I Jehovah your God am a God exacting exclusive devotion, bringing punishment for the error of fathers upon son, upon the third generation, and upon the fourth generation, in the case of those who hate me; but exercising loving-kindness toward the thousandth generation in the case of those who love me and keep my commandments. – This is why he said this, because such objects can be used by demons to work through and gain power and control over persons. This would include beautiful pictures or statues that may have been used even previously by former owners who may have put faith and devotion into those objects. How Do We Confront Demons In Our Presence? Some demons are very strong – Mark 9:25-29 Jesus, now noticing that a crowd was running together upon them, rebuked the unclean spirit, saying to it: “You speechless and deaf spirit, I order you, get out of him and enter into him no more.’ and after crying out and going through many convulsions it got out; and he became as dead, so that the greater number of them were saying: “He is dead!” But Jesus took him by the hand and raised him up, and he rose. So after he entered into a house his disciples proceeded to ask him privately: “Why could we not expel it?” And he said to them: “This kind cannot get out by anything except by prayer.” Psalms 91:1-16 Anyone dwelling in the secret place of the Most High Will procure himself lodging under the very shadow of the Almighty One. I will say to Jehovah: “You are my refuge and my stronghold, My God, in whom I will trust.” For he himself will deliver you from the trap of the birdcatcher, From the pestilence causing adversities. With his pinions he will block approach to you, and under his wings you will take refuge. His trueness will be a large shield and bulwark. You will not be afraid of anything dreadful by night, Nor of the arrow that flies by day, Nor of the pestilence that walks in the gloom, nor of the destruction that despoils at midday. A thousand will fall at your very side And ten thousand at your right hand; to you it will not come near. Only with your eyes will you look on And see the retribution itself of the wicked ones. Because you said, “Jehovah is my refuge,” You have made the Most High himself your dwelling; No calamity will befall you, and not even a plague will draw near your tent. For he will give his own angels a command concerning you, To guard you in all your ways. upon their hand they will carry you, That you may not strike your foot against any stone. Upon the young lion and cobra you will tread; You will trample down the maned young lion and the big snake. Because on me he has set his affection, I shall also provide him with escape. I shall protect him because he has come to know my name. He will call upon me, and I shall answer him. I shall be with him in distress. I shall rescue him and glorify him. With length of days I shall satisfy him, and I shall cause him to see salvation by me. I imagine simply reciting the Lord’s Prayer or other prepared recipes will only anger the demons more, making them more threatening. It requires real prayer along with real faith and a real hope in a real God. As for graven images, statues, charms, and emblems – I imagine these along with the prepared speeches will also just anger and entice the demons more so, as they are the very pagan symbols Jehovah warned his people not to use and for a good reason. The demons work through them and use them as more avenues to use against you. Deuteronomy 7:25 The graven images of their gods you should burn in the fire. You must not desire the silver and the gold upon them, nor indeed take it for yourself, for fear you may be ensnared by it; for it is a thing detestable to Jehovah your God. And you must not bring a detestable thing into your house and actually become a thing devoted to destruction like it. You should thoroughly loathe it and absolutely detest it., because it is something devoted to destruction. This may include beautiful carvings of emblems, angels, or statues of wonderful persons held in high esteem by people and the church. James 4:7-8 Subject yourselves, therefore, to God; but oppose the Devil, and he will flee from YOU. Draw close to God and he will draw close to YOU. Cleanse YOUR hands, YOU sinners, and purify YOUR hearts, YOU indecisive one. Matthew 7:21-23 Not everyone saying to me , ‘Lord, Lord,’ will enter the kingdom of the heavens, but the one doing the will of my father, but the one doing the will of my Father who is in the heavens will. Many will say to me in that day, ‘Lord, Lord, did we not prophesy in your name, and expel demons in your name, and perform many powerful works in your name?’ And yet then I will confess to them: I never knew you! [Christ never recognized them as his representatives.] Get away from me you workers of lawlessness. Some would boast they ‘expelled demons in his name.’ There are person in the churches today who claim to have such power. But the practice of casting out demons (by means of mystical rites) has always been a feature of non-Biblical religions”. Moreover, certain Jews of the first century C.E. expelled demons by means of magical formulas that they believed were handed down from King Solomon. Yet, by this time, many false traditions and beliefs had taken over, so they were just as filled with images and rituals as those of other groups. it is not supernatural prophesying, expelling demons, or any other “powerful works” (miracles) that identify true Christians. In fact, when foretelling the sign of his presence and the conclusion of the present system of things, Jesus declared: Matthew 24:24 “False Christs and false prophets will arise and will give great signs and wonders so as to mislead, if possible, even the chosen ones.” We also have to be careful simply using names such as Jesus to ward off demons. Jesus is God’s son, not God. We need to understand how the pagan trinity, which also crept into the churches many years ago by persons who were false teachers has blinded many persons as to who to call on when in distress or confronting demons. Some “roving Jews who practiced the casting out of demons” sought to duplicate Paul’s miracles. Certain ones of those Jews tried to expel demons by invoking the names of Jesus and Paul. Luke gives the example of the seven sons of Sceva—members of a priestly family—who sought to do this. The demon said to them: “I know Jesus and I am acquainted with Paul; but who are you?” The possessed man then attacked those charlatans, leaping upon them like a wild beast, sending them scurrying off, wounded and naked. (Acts 19:13-16) This was a resounding victory for “the word of Jehovah,” as the contrast between the power given to Paul and the powerlessness of those false religionists could not have been plainer. There are millions today who wrongly assume that simply calling on the name of Jesus or labeling oneself “Christian” is enough. As Jesus indicated, though, only those actually doing the will of his Father have a real hope for the future.—Matt. 7:21-23. Regarding the name “Jehovah” – The American Standard Version Says In 1901 the American Standard Version was published. It was based on the text of the King James Version. The preface or front of the Bible stated: “We are not insensible to the justly lauded, beauty, and vigor of the style of the Authorized King James Version.” Yet, the American Standard Version made a significant adjustment. The preface explains this: “The American Revisers, after careful consideration, were brought to the unanimous conviction that a Jewish superstition, which regarded the Divine Name as too sacred to be uttered, ought no longer to dominate in the English or any other version of the Old Testament, as it fortunately does not in the numerous versions made by modern missionaries.” It is not that the divine name, Jehovah does not appear at all in the (older) King James Version. It does appear in four places, namely Exodus 6:3; Psalm 83:18; Isaiah 12:2; and Isaiah 26:4. The American Standard Version of 1901, however, restored the name to some 7,000 of its rightful places in the Bible. The name Jehovah is used in the names of many persons mentioned in the Bible. (Jesus) the original word was Hebrew “Ye shu’a” or “Yehoh shu’a” which means – “Jehovah Is Salvation” (Jeremiah) possible translations are “Jehovah Exalts” or “Jehovah Loosens”. (Jehu) “Jehovah Is He” (Zechariah) “Jehovah Has Remembered’ (Johanan) shortened form of Jehohanan meaning “Jehovah Has Shown Favor” or “Jehovah Has Been Gracious” (Joel) meaning “Jehovah Is God” For those who believe we should use the name “Yahweh” instead, they should then ask themselves how they should pronounce the name Jesus which when translated is pronounced Ye·shu′aʽ or Yehoh·shu′aʽ. So you see, we all need to recognize that our pronunciation of the word should more rightly correspond to the English we use for ourselves and for other English speaking persons we are talking to. ",
            "date": "Answered September 12, 2019",
            "views": "126",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aditti Agarwal",
                "href": "/profile/Aditti-Agarwal"
            },
            "answer_text": "Not ghosts but spirits do exist. Some evil some good ones are lurking around our existence. Sometimes we see them because we probably have our karmic accounts to settle with them thats when we see them. I have had such an experience where once while travelling from vegas to Sfo. When we were drving through the fields all of a sudden i saw a spirit pass through and our car went for a toss. But by gods grace after taking five round turns our car stopped and we all were safe. I feel that spirit had come to save us maybe we were to have a big accident but it saved us by letting us go through a small harrowing experience and so i feel our karmic account was settled. That day. ",
            "date": "Answered November 16, 2018",
            "views": "73",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ajit Singh",
                "href": "/profile/Ajit-Singh-991"
            },
            "answer_text": "I don’t think per say but I definitely believe that soul or whatever you may call it does exist. I believe that there is something which goes missing when someone dies and this something which you can assume akin to a driver is driving our body just like a driver drives the car. Just like when driver is inside the car the car moves / runs etc but the moment the driver leaves the car the car can no longer run and ultimately ruste away same as our body without the soul. ",
            "date": "Answered November 13, 2018",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shishir Kumar",
                "href": "/profile/Shishir-Kumar-186"
            },
            "answer_text": "Because we can see things that our eyes can capture between the visible spectrum that requires a physical body that can reflect light. A ghost is just a human with life force, intellect and concise minus physical body! ",
            "date": "Answered November 14, 2018",
            "views": "80",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ankit Jha",
                    "user_href": "/profile/Ankit-Jha-58"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Boling",
                "href": "/profile/John-Boling-3"
            },
            "answer_text": "No, of course they don’t exist. Nothing supernatural exists. We don’t see them because they don’t exist. Some people mistakenly believe they see them, that’s all. ",
            "date": "Answered November 7, 2018",
            "views": "24",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Anthony Rushton",
                    "user_href": "/profile/Anthony-Rushton-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kiran Phalke",
                "href": "/profile/Kiran-Phalke-6"
            },
            "answer_text": "Yes but not like men or women or animals. I feel it is just some force. I have experienced that force in the form of a throwen things, a ball of spinning light,different types of aromas , ",
            "date": "Answered November 7, 2018",
            "views": "29",
            "upvotes": "0"
        }
    ]
}