{
    "title": "Does the earth continually replace or create fossil fuels? - Quora",
    "tags": [
        "Fossil Fuels",
        "Fuels",
        "Oil (fossil fuel)",
        "Alternative Energy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Malcolm Sargeant",
                "href": "/profile/Malcolm-Sargeant"
            },
            "answer_text": "Not to any significant degree. Coal is the remains of the vast swampy forests of The Carboniferous Period compared to the plant life of that period out current forests and jungles are insignificant. Oil and gas are the result of the bodily remains of sea creatures, mostly single cell, deposited on ancient seabeds that after millions of years become compressed, heated and chemically decomposed. Sea creatures are still dying and their remains are still accumulated on the sea bed but it will be millions of years before our current sea beds become oil bearing rocks. Petroleum - Wikipedia ",
            "date": "Answered December 13, 2016",
            "views": "185",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William Mook",
                "href": "/profile/William-Mook"
            },
            "answer_text": "It doesn’t. http://homepages.uc.edu/~becktl/en17grad/fossil-fuel-presentation.pdf Oil discoveries peaked in 1962 and since oil reserves generally last 38 years - you would expect oil production to have peaked in 2000. In 1971 Nixon went off the gold standard which disconnected wages and commodities from the money supply. This cause the price of oil to skyrocket in 1971 and wages in real terms to plummet. This reduced consumption of oil and other commodities, and broke the natural connection between discovery and production. Nixon and Kissinger did that because they could see no alternative to oil, and they wanted to give the US time to prepare for a post oil world. From 1971 through to 2020 we have had a period of relative stable and high priced oil. From 2020 onward, you will see an unending crisis with oil. This will not be viewed as an oil crisis. Just as the banking crisis of 2008 was divorced from the radical increases in oil price earlier, continuing and pervasive shortages will be seen as a debt crisis. Yet the connection is there. That’s why you see large military forces in oil rich nations.    MOK.INTERNATIONAL My company makes hydrogen from rain water and sunlight at costs that are competitive with oil. I am happy to sell on long-term contract to credit worthy buyers significant volumes of hydrogen. ",
            "date": "Updated January 10, 2019",
            "views": "199",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Henrik Bever Fikse",
                    "user_href": "/profile/Henrik-Bever-Fikse"
                },
                {
                    "user_id": "Brian Donovan",
                    "user_href": "/profile/Brian-Donovan-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thalbert McGinness",
                "href": "/profile/Thalbert-McGinness"
            },
            "answer_text": "Absolutely! The process has never stopped and there have been swamps on the planet since the first plant life began. Now as to the comparable rate of generation vs consumption, that's a different story. The deposition, burial and cooking of the swamps to produce oil is a long, slow process while current production and use is almost 100 million barrels a day. There is no way that the one can keep up with the other. ",
            "date": "Answered December 13, 2016",
            "views": "185",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vincent Maldia",
                    "user_href": "/profile/Vincent-Maldia"
                },
                {
                    "user_id": "Allan Baker",
                    "user_href": "/profile/Allan-Baker-2"
                },
                {
                    "user_id": "Jeff Hawkins",
                    "user_href": "/profile/Jeff-Hawkins-1"
                },
                {
                    "user_id": "Sachin Ganiga Karkera",
                    "user_href": "/profile/Sachin-Ganiga-Karkera"
                }
            ]
        },
        {
            "author_info": {
                "name": "Philip Rabe",
                "href": "/profile/Philip-Rabe"
            },
            "answer_text": "It doesn’t. The conditions that created our fossil fuel reserves in the Carboniferous era ended millions of years ago. There are no mechanisms creating new supplies of oil or coal. ",
            "date": "Answered January 8, 2019",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tom Nathe",
                    "user_href": "/profile/Tom-Nathe"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Hench",
                "href": "/profile/Steve-Hench"
            },
            "answer_text": "It does but this process takes place over millions of years. This is extremely slow compared to the rate of human consumption of these resources. ",
            "date": "Answered December 14, 2016",
            "views": "57",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vincent Maldia",
                    "user_href": "/profile/Vincent-Maldia"
                },
                {
                    "user_id": "Thomas Irwin",
                    "user_href": "/profile/Thomas-Irwin-5"
                }
            ]
        }
    ]
}