{
    "title": "Does the boiling point and melting point affect the solubility of a compound? - Quora",
    "tags": [
        "Solubility of Organic Compounds",
        "Melting Points",
        "Boiling Points",
        "Solubility",
        "Melting",
        "Boiling"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rob Hooft",
                "href": "/profile/Rob-Hooft"
            },
            "answer_text": "The boiling point and melting point of a compound do not change the solubility. But there are possible correlations. Both dissolving and melting a compound break the inter-molecular bonds between the molecules, replacing them by more flexible interactions in the fluid. If a compound has a very high melting point, this could indicate that the inter-molecular bonds in its solid are very strong; the solid is very well packed. And in such cases, a solvent may also have difficulties breaking those bonds. This is not a strict rule, though, because any equilibrium like this is affected by the stability on both sides, and we only look at the stability of the solid here. ",
            "date": "Answered February 17, 2019",
            "views": "26",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Suzana Mannan",
                    "user_href": "/profile/Suzana-Mannan-1"
                },
                {
                    "user_id": "Tony Mkar",
                    "user_href": "/profile/Tony-Mkar-1"
                },
                {
                    "user_id": "Almond Sugar",
                    "user_href": "/profile/Almond-Sugar"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Wolff",
                "href": "/profile/William-Wolff-14"
            },
            "answer_text": "The boiling point and melting point do not affect the solubility of a compound (unless you intentionally go trying to dissolve them at these temperatures which resist solvation). What affects the solubility, melting point, and boiling point however, are intermolecular forces, the attractive forces between each molecule in a compound. Higher intermolecular forces result in higher boiling points and melting points. Solubility however, is a bit more complicated. This only affects the solubility if the intermolecular forces of the solute and solvent are compatible (polar forces and non polar forces), and if the attractive forces of the solute to itself and the solvent to itself are stronger then the forces between each other. ",
            "date": "Answered December 12, 2018",
            "views": "12",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Klevelty",
                    "user_href": "/profile/Klevelty"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edward Willhoft",
                "href": "/profile/Edward-Willhoft"
            },
            "answer_text": "The solubility of a compound in, say, water as solvent is dependent not on its mp and bp, but on the lattice strength of the solid and the solvation energy when solubilised. A further consideration is the similarity of the compound to the solvent; eg water by virtue of its polarity readily solubilises most polar substances, but not those devoid of polar character. In such instances, water enters into the solvation of the ionic or polar parts of the molecule through hydrogen bonding; eg NaCl and sucrose, a disaccharide having polar OH radicals forming an essential part of the sugar molecule. ",
            "date": "Answered December 12, 2018",
            "views": "859",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Wayne Peltier",
                    "user_href": "/profile/Wayne-Peltier"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martin J Pitt",
                "href": "/profile/Martin-J-Pitt"
            },
            "answer_text": "A simple way to answer this would be to look up some melting points and boiling points and also solubility data. However you have not specified the solvent, and as you should know there are substances which are soluble in one solvent but not another. Thus there are liquids which do not mix though they have similar liquid ranges. ",
            "date": "Answered December 12, 2018",
            "views": "416",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Wayne Peltier",
                    "user_href": "/profile/Wayne-Peltier"
                }
            ]
        }
    ]
}