{
    "title": "Does the size of an atom change in absolute vacuum? I know when there is an atom present it already isn't a theoretical absolute vacuum anymore, but as close as it gets to an absolute vacuum. - Quora",
    "tags": [
        "Vacuum (space)",
        "Atomic Physics",
        "Atoms",
        "Theoretical Physics",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Frank Fahrendorf",
                "href": "/profile/Frank-Fahrendorf"
            },
            "answer_text": "We know of 4 forces: Gravity, electromagnetism, the weak nuclear force (how the nucleus is held together) and the strong nuclear force (how quarks compose in particular protons and neutrons). These 4 forces dictate how big the atoms are. Atoms’ sizes are dictated by the electrons “orbiting” them. Simplified, the “orbit” is linked to the orbital velocity, the speed by which an electron moves around the atom. An electron is also a wave and the simplest wave possible is one full wave. With that we can calculate the size of the electron orbit (see Bohr model - Wikipedia) But if the size of an atom is dictated only by the De Broglie wavelength then it does not matter what the pressure is; the size of the atom will stay the same. Also do keep in mind that one atmosphere of pressure is very little. It is pretty close to a vacuum from the point of view of an atom, so no, the atoms do not change size in a vacuum. At extremely high pressures, perhaps, but it is rather the state that the atoms adopt that changes - to solids for example. ",
            "date": "Answered March 2, 2020",
            "views": "45",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kyan Sadeghinejat",
                    "user_href": "/profile/Kyan-Sadeghinejat-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brent Meeker",
                "href": "/profile/Brent-Meeker"
            },
            "answer_text": "Being in not-a-vacuum would mean there are other atoms around. If this is in a gas, it means there’s an occasional impact from other atoms. The rest of the time they’re in a vacuum. So unless the gas is so hot that the speed of impact strips off an electron it has no effect on the size of the atom. The other possibility is that the atom is in a liquid or solid. In general these will not change the size unless there is sharing of electrons that makes the nuclei get a little closer together or further apart. For example, when water freezes it expands a little which means the atoms reoriented as a crystal so they don’t pack together as tightly. Whether that means they are “bigger” is a matter of definitions of size. ",
            "date": "Answered March 2, 2020",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Peter Upton",
                "href": "/profile/Peter-Upton-2"
            },
            "answer_text": "In a gas at room temperature, the atoms will be about 20 diameters apart on average. So it makes sense to think of Helium atoms in Helium gas as being isolated. What is in the gaps between the atoms? Nothing- a vacuum. So the helium atoms are already in a vacuum. Increasing the gap so that there is no other atom within say 30 cm will make no difference to the Helium atoms. Really we are just thinking about - how big the vacuum is. Does bigger vaccum (bigger volume vacuum) have a bigger effect on the atoms. No. ",
            "date": "Updated March 20, 2020",
            "views": "36",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bert Willke",
                    "user_href": "/profile/Bert-Willke"
                },
                {
                    "user_id": "Kyan Sadeghinejat",
                    "user_href": "/profile/Kyan-Sadeghinejat-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Art Hobson",
                "href": "/profile/Art-Hobson"
            },
            "answer_text": "An atom in vacuum is entirely undistorted, i.e. unchanged from its most natural state. Any presence of other objects, such as additional atoms, distorts an atom, i.e. changes it from its most natural state. ",
            "date": "Answered March 2, 2020",
            "views": "17",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Michael Soso",
                    "user_href": "/profile/Michael-Soso"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jocelyn Joseph",
                "href": "/profile/Jocelyn-Joseph-10"
            },
            "answer_text": "The Dalton atom is composed of protons, neutrons and electrons which exist in and interact with the vacuum of free space. In this context, the vacuum of free space is present around all atoms, be they in the air, water or deep underground. This is why many users comment here that the atom and solid matter is mostly composed of free space. So, what determines the size or diameter of the atom? It's the temperature that does so. ",
            "date": "Answered March 2, 2020",
            "views": "15",
            "upvotes": "0"
        }
    ]
}