{
    "title": "Does the existence of poverty imply that our socioeconomic system is unjust? Does the concentration of poverty in certain groups make it more unjust than it would be otherwise? - Quora",
    "tags": [
        "Socioeconomics",
        "Injustice",
        "War on Poverty",
        "Economic Inequality",
        "Poor People",
        "Justice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lanci Botton",
                "href": "/profile/Lanci-Botton"
            },
            "answer_text": "The existence of poverty in not an issue or just or unjust. People in poverty are that arbitrary percent of the people whose income and ability to sustain themselves is the the lower group of the population. It is in the interests of the federal welfare establishment to always identify that lower level of people as those in poverty. It is not an actual measurement of some specific minimum level below which self-sustainability is not possible. It is simply that group that fall below a certain arbitrary level. You might argue that it is unjust to refer to people at that level as being in poverty. I think it is demeaning, insensitive and probably painful, hurtful and damaging to them to so labeled. The injustice is in singling them out and constantly reminding them that they are some how lesser people, of less value, and devoid of the respect all people deserve. We as a nation can do everything possible to raise those folks out of poverty, but that is a fools errand because the government will simply raise the bar such that there is always around 15% of the population “in poverty”. What would the politicians and bureaucrats do if suddenly there was no one “in poverty”? What would they be able to wage a war against? What great tragedy is there that can replace the altruistic and humane and sympathetic emotions that comes from waging war on poverty? If we simply recognize that some part of the population is always going to earn less than the rest and then concentrate all of our energies and funds on teaching, training, mentoring, apprenticing, and hiring these people they would soon be able to earn more and begin to find a place in that massive middle class that we once had. Of course the politicians and pundits would then concentrate their attention on the lower middle class just so they have some group to concentrate their war on. ",
            "date": "Answered October 13, 2020",
            "views": "91",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gerard Smorowski",
                    "user_href": "/profile/Gerard-Smorowski"
                },
                {
                    "user_id": "Judy Parker",
                    "user_href": "/profile/Judy-Parker-61"
                }
            ]
        },
        {
            "author_info": {
                "name": "Craig Kulat",
                "href": "/profile/Craig-Kulat"
            },
            "answer_text": "“You will always have the poor.” - Bible Today add to that the poor in spirit & the poor in heart . Empty shells of individuals raised in broken homes, bad drug infested neighborhoods, gang culture mentality with no respect of authority or of themselves. That is “TRUE POVERTY” ! That is the South side of Chicago. (And many urban areas) Part of the cause contributing to our current social situations was the “defunding” in our society of churches basically 50 years ago! Core moral values, which emphasized : love, joy, peaceq, patience, goodness, kindness & long suffering. The government just threw money at inequality which just encouraged single parent families, making it more advantageous to NOT work. Culture rot & drugs also provided income & escape from reality. The “gang” replaced the family. People fled the inner cities for safety. We again end up with a Detroit. The real problem all along is Spiritual Poverty! Poverty of the heart, mind & soul. And it looks right now it is a tipping point only getting worse. (Statue destruction, like a child throwing a temper tantrum.) They can't even express themselves & their arguments with words. They are not literate enough! All they can do is physically scream, shout & hit. Fo!!owing like lemmings the groups getting attention. It is sad & pathetic. It's the anarchist heaven! Just sayin. ",
            "date": "Answered July 3, 2020",
            "views": "110",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "John Richardson",
                    "user_href": "/profile/John-Richardson-500"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven Cooper",
                "href": "/profile/Steven-Cooper-111"
            },
            "answer_text": "sounds like someone is reading questions from a Saul Alinsky flyer. Poverty will always exist for a variety of reasons. Addictions, gambling, lack of Education, out-of-wedlock children, children before you're even an adult yourself, and lack of Education. This is self-induced poverty and has nothing to do with socioeconomic poverty. Put down the Marxist handbook and educate oneself is the answer to climb out of poverty. There is one other thing you must develop a work ethic. Do everything you can to the best of your ability. Every job that you do, do it well do every detail of the job don't cut corners. This is the best advice anybody can give you in life. I'm a small business owner but I worked for people before I started a business. I did a great job on everything I did and it got noticed and I made more money. Just like I noticed when people do a good job for me. Do the little things. These are the wonders of capitalism. It's called a meritocracy. The best candidate gets the job. I see and everyone else sees, the people who don't want to work but still want to collect a paycheck. This is a huge problem. So the moral of the story boys and girls, if you don't educate yourself and you don't have a work ethic you restrict yourself to poverty. This is your fault not society. ",
            "date": "Answered July 1, 2020",
            "views": "114",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sukru Tikves",
                    "user_href": "/profile/Sukru-Tikves"
                },
                {
                    "user_id": "John Richardson",
                    "user_href": "/profile/John-Richardson-500"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Trejo",
                "href": "/profile/Paul-Trejo-1"
            },
            "answer_text": "Otherwise than what? It depends on the alternative. If a brutal method is selected to force Income Equality onto people — then there will only be further revolution. The USSR (1917–1991) with all its brutal methods — could not even stand for 75 years. Will we disfigure beautiful girls to enforce “equality” so to speak? Some alternatives to Inequality are mere variations on insanity — mere excuses for sadism. So, the real question isn’t about Income Inequality — the real question is about two socioeconomic factors: Massive UnemploymentDestitution PovertyAs long as these two exist for millions of families in the US alone, we are not really trying very hard to bring justice to the world. We will never stop Income Inequality (because millions of people each generation choose to take vows of poverty and chastity for religious purposes, if nothing else). The real problem isn’t a matter of Income Inequality — but of Education Inequality. So — we should tweak our Public Education Curriculum to teach Small Business principles to elementary school children (and every year through high school). If we did that, then in only one generation we we’d have a working class that could always adapt to any socioeconomic circumstance — the best trained working class in history. Then there would be no more Unemployment and no more Poverty for all practical purposes — for the first time in history. There would still be Income Inequality — but nobody would care for all practical purposes. Racism would plummet. Crime would plummet. Political radicals would plummet. This is the non-violent solution. I see no other on the horizon. ",
            "date": "Answered July 1, 2020",
            "views": "41",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "John Richardson",
                    "user_href": "/profile/John-Richardson-500"
                }
            ]
        },
        {
            "author_info": {
                "name": "Don Beavers",
                "href": "/profile/Don-Beavers-1"
            },
            "answer_text": "Not at all. It’s important to remember that different people have different levels of intelligence, creativity, motivation, and work ethic. There are some people who have no work ethic and no ambition and often will preferred to remain poor rather than work toward greater economic goals. This is their choice. The important thing is that a government provide opportunity to people with both educationally, and job training, and unemployment. This is what capitalism accomplishes. This is why a large number of the wealthy In the United States started out as poor or people of low average wealth but over a lifetime of 30 to 40 years working in investing in such things as a business, real estate, or the stock market became wealthy. The great majority of them did not inherited or receive it through someone’s largess. Most of them earned it. The important thing is that people are provided opportunity so that they can increase their socioeconomic status. Capitalism does that by providing opportunity fostered by freedom. ",
            "date": "Answered October 15, 2020",
            "views": "5",
            "upvotes": " Answer requested by John Richardson",
            "upvoters": [
                {
                    "user_id": "John Richardson",
                    "user_href": "/profile/John-Richardson-500"
                }
            ]
        },
        {
            "author_info": {
                "name": "Diane Merriam",
                "href": "/profile/Diane-Merriam"
            },
            "answer_text": "The state of mankind in nature is universal poverty. The question isn’t what creates poverty. Doing nothing returns mankind to its natural state. The important question is what creates wealth. That is what isn’t natural. That is what requires certain policies to be in place, such as the rule of law, rooting out corruption, recognition and protection of property rights along with the protection of other natural human rights - life and freedom. Where true poverty, extreme poverty, still exists, you will find none of the above systems in place. Even so, we have gone from the 99+% of the population in extreme poverty to now only 8%. It was double that just a few years ago and doubled again about 35 years ago. While the pandemic is going to put a crimp in things, I wouldn’t be surprised if it’s less than 20 years or so to see its virtual end. Even on levels above poverty, in 2018 we passed the marker of over half the human population now living a middle class or better lifestyle for their region. These broad improvements in standard of living are unprecedented throughout all of human history. ",
            "date": "Answered July 1, 2020",
            "views": "19",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "John Richardson",
                    "user_href": "/profile/John-Richardson-500"
                },
                {
                    "user_id": "Sukru Tikves",
                    "user_href": "/profile/Sukru-Tikves"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lynne Noll",
                "href": "/profile/Lynne-Noll"
            },
            "answer_text": "So far, the question of poverty is about how many resources are available to the people at the lower levels, and how many people are at the lower levels. A system that reduces the number of people at the lower levels (by enriching them, not murdering them) and provides a better minimum for them than other systems is better than a system that provides a lower minimum or puts more people at the bottom. Our system (assuming you mean capitalism) appears unjust, since some have much less than others (even in Norway) and the poverty is not equally distributed across the groups we are looking at. (Our current categories are not all the same as the categories we had 30 years ago.) But evidence suggests other systems may do worse since they have weaker systems for maximum production and efficient distribution. Given the devastation of screwing this stuff up, I’d say we should be careful. A little tweaking, for which we can find test cases, is safer than a radical change that makes everyone equally poor. ",
            "date": "Answered July 1, 2020",
            "views": "17",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sukru Tikves",
                    "user_href": "/profile/Sukru-Tikves"
                },
                {
                    "user_id": "John Richardson",
                    "user_href": "/profile/John-Richardson-500"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Handy",
                "href": "/profile/Tom-Handy-9"
            },
            "answer_text": "Real social injustice has to do with unequal treatment. Poverty in the US is caused by unequal outcome, not unequal treatment. You see, exceptional people will almost always succeed. And those less exceptional, those unable to try and those that choose not to try will often not succeed. If all wealth in the US was redistributed equally among all citizens, the same people that have wealth today would have it again within a few years. And most of the same people that are poor today would be poor again. The better answer is to help assure two things. We need to ensure that those unable to succeed due to illness, impairment or other conditions beyond their control are taken care of. And next, we help ensure people have more equitable opportunities. And we do this by promoting two-parent families, providing more educational opportunities and putting our greatest efforts into promoting the growth of good jobs. ",
            "date": "Answered July 1, 2020",
            "views": "30",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "John Richardson",
                    "user_href": "/profile/John-Richardson-500"
                }
            ]
        },
        {
            "author_info": {
                "name": "Santhakumar V",
                "href": "/profile/Santhakumar-V"
            },
            "answer_text": "We should understand that what is just and unjust are evolving concepts. Yes we can say that the existence of poverty is unjust, and that too among a few social groups more unjust. This is more so when we note that society has the resources to eradicate poverty. Mitigating general poverty (say in a society which has 10 percent poor people belonging to all social groups) is relatively easier than addressing it when it is concentrated in certain groups. The adversarial relationships between groups may matter then. The features of these groups may matter then. Ideally there should be a strong overall social commitment, a willing government, and capable leadership and intra-group mobilization within these groups to address their poverty. ",
            "date": "Answered July 1, 2020",
            "views": "9",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "John Richardson",
                    "user_href": "/profile/John-Richardson-500"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Carter",
                "href": "/profile/Robert-Carter-26"
            },
            "answer_text": "First answer this question before seeking a loophole the excuses indolent behavior. Keep in mind that we live in a society that protects a person's freedom to pursue happiness…In other words they possess free will to engage in the activity of free enterprise…no other society in the world offers the generally speaking, “unfettered” ability to earn money as “Our\" society. Is poverty a choice for adults that are able to work? Work meaning, earn an income for performing a task that produces some wanted outcome for an employer. Because the answer is undeniably an affirmative…generally speaking. So don't belabor the minute examples of those who aren't physically or mentally capable of engaging in this pursuit of happiness. For every example of people supposedly held in poverty by some invisible evil force(s) they're more than enough success examples of those who through their own efforts refused to remain in the man defined cow patty called “poverty\". Keep in mind what those who define what the word poverty to mean in the United States, would be wealthy in many many other countries. So it's easy to see that this exercise or attempt to belittle the conditions in this county do little to encourage others to take advantage of a system unlike any other…one that offers a plethora of opportunities to alter one's financial standing…and that's the rest of the story…imho ;?) ",
            "date": "Answered October 6, 2020",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mohammad Gani",
                "href": "/profile/Mohammad-Gani"
            },
            "answer_text": "The existence of poverty is basically a result of lack of education. More than 90% of the poor are peasants, who have just no sane reason to produce excess food, and drive the price to less than 40% of the cost of production and thereby become poorer. Currently, the world production (2019) is 2.72 billion tons against a need of only 1.56 billion tons for a population of 7.8 billion people. The questions is: why are so many people trying to overgrow food and sell the same at staggering losses (in view of the opportunity to move to towns and earn more income). Smart people in developed nations have fled from the villages so much so that more than 90% of the people of developed nations abandoned the villages. Those who have not are suffering from lack of proper education. ",
            "date": "Answered July 3, 2020",
            "views": "37",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Raziene Davis",
                    "user_href": "/profile/Raziene-Davis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Reed Hansen",
                "href": "/profile/Reed-Hansen-4"
            },
            "answer_text": "Poverty is the natural state of everyone. There is nothing unjust about it. To change it, and be not in poverty, is the part that takes effort and is not “natural”. There are natural things that keep people in poverty but those who get out of poverty do so with effort on their part. Obedience to laws of economics and capitalism. Living around enough people who have moved out of poverty so that there is capital for new companies and more opportunities. You are much more likely to move out of poverty in America than in Columbia or Zimbabwe. ",
            "date": "Answered July 1, 2020",
            "views": "43",
            "upvotes": " Answer requested by John Richardson",
            "upvoters": [
                {
                    "user_id": "John Richardson",
                    "user_href": "/profile/John-Richardson-500"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kent McManigal",
                "href": "/profile/Kent-McManigal"
            },
            "answer_text": "No system will ever eliminate poverty completely. The Market has done more to eliminate poverty than anything else has ever been able to, even when crippled by government regulation. That’s an awesome accomplishment! That poverty might concentrate in certain groups is an indication that government is interfering in those groups more than in other groups. Get the unjust burden of government “assistance” off your back and out of your life and you’ll be free to prosper. “I’m from the government and I’m here to help you” is among the most evil lies ever told. ",
            "date": "Answered October 13, 2020",
            "views": "14",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Dirk Patze",
                "href": "/profile/Dirk-Patze"
            },
            "answer_text": "I would say that it is ineffective. It all about creating value and performance, but in the same moment, it stops the value from being created in the most effective way. Like: What is the most effective way to provide clothing to as many people as possible? Poverty would include not being able to wear clean clothing every day, right? But why is the social system giving people money then? From the little money they can only buy cheap and shortly lasting clothing. Why not use that part of the money to provide jobs that provide the poor with the most effective clothing? Durable and flexible basic stuff that people could design as they please, if they need design? Of course it is not done, because it would hurt the market for those who profit from selling garbage to people and selling their rags to other people as clothing as well. The socioeconomic system is still not a system of support, but a system of suppression. Expensive, but ultimately run ineffectively to ensure maximum profits. ",
            "date": "Answered July 1, 2020",
            "views": "16",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Larry Prall",
                "href": "/profile/Larry-Prall"
            },
            "answer_text": "Actually, to a certain extent it implies that it is just. Clearly some people produce more desirable products than others and it is only just that they receive appropriate compensation. Some people produce nothing of value to many, and it is only just that they receive nothing of value in return. ",
            "date": "Answered September 19, 2020",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ron Combs",
                "href": "/profile/Ron-Combs-2"
            },
            "answer_text": "Imply our system is unjust? No. You cannot expect to place the value of a janitor and a doctor as equal. Certain groups? Possible, but the group itself would have to be determined as equal to all others. For example, the educational level of a group may not be equal to another group. In a case like that, it is not unjust to be unequal. ",
            "date": "Answered July 1, 2020",
            "views": "9",
            "upvotes": " Answer requested by John Richardson"
        },
        {
            "author_info": {
                "name": "Edwin Wilkerson",
                "href": "/profile/Edwin-Wilkerson"
            },
            "answer_text": "there is no poverty in the United States…..there are people that have a low standard of living and they live that way by choice it is their constitutional right to live sub standard ",
            "date": "Answered October 12, 2020",
            "views": "12",
            "upvotes": " Answer requested by John Richardson"
        },
        {
            "author_info": {
                "name": "Robert Hafetz",
                "href": "/profile/Robert-Hafetz"
            },
            "answer_text": "Poverty is created y a poverty of morals and bad choices the worst is single mothers no father in the home ",
            "date": "Answered July 1, 2020",
            "views": "69",
            "upvotes": " Answer requested by John Richardson"
        }
    ]
}