{
    "title": "Energy is neither created nor destroyed, then why do we think so much about energy preservation? - Quora",
    "tags": [
        "Science of Everyday Life",
        "Energy (physics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "I McPadden",
                "href": "/profile/I-McPadden"
            },
            "answer_text": "Energy is neither created nor destroyed, but it is transformed, sometimes into a useful form other times into something not useful. Energy preservation is about not using useful energy to do something useless. For example, running the lights when the sun is beating into your bedroom window is a waste of electrical energy. The electrical energy passing through the light bulb is transformed into light and heat at a time when neither is needed. Energy preservation becomes important because that electrical energy was likely generated using chemical energy in a fossil fuel of some sort to heat water into steam and the steam is used to rotate a turbine generating electricity. Indirectly, running the light at a bad time is wasting the fossil fuels used to generate the electricity and fossil fuels are a limited resource. You also have to pay for electricity so “preserving energy” is also saving money. ",
            "date": "Answered November 6, 2017",
            "views": "96",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jessica Jin",
                    "user_href": "/profile/Jessica-Jin-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karthik Kothuri",
                "href": "/profile/Karthik-Kothuri-2"
            },
            "answer_text": "Energy is always conserved but its usefulness is not. For example, if you move block on a rough surface it stops after sometime as its kinetic energy is converted into thermal energyof the floor and block(Same principle applies when you rub your palms to make them warmer in winter). The kinetic energy of the block could've been used to generate electricity or some other utility, but the thermal energy cannot(atleast not completely). The difference between the two cases is entropy. Entropy is a measure of randomness or chaos of a system. According to the second law of thermodynamics, the entropy of the universe must always keep increasing. In the first case there was low entropy and in the second entropy was high. The net entropy of the universe always goes up, so other forms of energy can be easily converted to thermal but the opposite is not true. This is why some forms of energy like solar and chemical energy are very useful to us while other forms of energy are not so easy to harness. Hope this helps Cheers! ",
            "date": "Answered November 6, 2017",
            "views": "446",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bhawyanth Reddy",
                    "user_href": "/profile/Bhawyanth-Reddy"
                },
                {
                    "user_id": "Sai Kiran Kothuri",
                    "user_href": "/profile/Sai-Kiran-Kothuri"
                },
                {
                    "user_id": "Rushi Varun",
                    "user_href": "/profile/Rushi-Varun"
                },
                {
                    "user_id": "Srinivas Kothuri శ్రీనివాస్ కొత్తూరి",
                    "user_href": "/profile/Srinivas-Kothuri-శ్రీనివాస్-కొత్తూరి"
                },
                {
                    "user_id": "Tobi Louw",
                    "user_href": "/profile/Tobi-Louw"
                },
                {
                    "user_id": "Sachin Minnanda",
                    "user_href": "/profile/Sachin-Minnanda"
                }
            ]
        },
        {
            "author_info": {
                "name": "Calder Lane",
                "href": "/profile/Calder-Lane"
            },
            "answer_text": "Simply because the two topics are completely seperate. Using fossil fuels to generate electricity emit dangerous greenhouse gasses and other toxins. Preserving or conserving energy reduce the ecological impact of our energy generation. And while that energy certainly is conserved, our ability to harness it for useful “work” becomes more limited as it changes into other forms. ",
            "date": "Answered November 6, 2017",
            "views": "58",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alan Greger",
                "href": "/profile/Alan-Greger"
            },
            "answer_text": "What people are really trying to preserve isn't exactly energy, but more useful energy sources. Energy often becomes converted into useless forms, locked up into a form of potential energy (whether physical or chemical) or emitted as heat. Things like coal and oil run out, the energy in the universe stays constant. It's very possible for energy to become unusable but still exist. ",
            "date": "Answered November 7, 2017",
            "views": "29",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shabir Lukmanji",
                "href": "/profile/Shabir-Lukmanji"
            },
            "answer_text": "Basically energy is being used. once used than have to be replaced. Energy can be converted from one form to another. So simply when we generate electricity we are converting two types energies to electricity that is chemical energy of fuels running the enegine to heat energy which is converted to mechanical energy and mecenical energy running generator which convert meganatic energy to electricity. ",
            "date": "Answered November 6, 2017",
            "views": "10",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pankaj Yadav",
                "href": "/profile/Pankaj-Yadav-75"
            },
            "answer_text": "The preservation which you talk about here is I guess that you might have heard in the advertisement ..Well if yes, then that is for the less consumption of fossil fuel which is essential for electricity generation…….if no then pls let me know where have you heard it ",
            "date": "Answered November 6, 2017",
            "views": "15",
            "upvotes": " Answer requested by Ajay Banerjee",
            "upvoters": [
                {
                    "user_id": "Jeffrey Chou",
                    "user_href": "/profile/Jeffrey-Chou-6"
                },
                {
                    "user_id": "Kris Satya",
                    "user_href": "/profile/Kris-Satya"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeffrey Chou",
                "href": "/profile/Jeffrey-Chou-4"
            },
            "answer_text": "Not all forms of energy can be used. So even though the energy is always there, you want to preserve the forms that we can use. ",
            "date": "Answered November 6, 2017",
            "views": "52",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Jay Babcock",
                "href": "/profile/Jay-Babcock-3"
            },
            "answer_text": "We dont so much care about that energy itself is being conserved, but rather that we conserve it in the forms we can use. Such as the energy stored in fossil fuels that is released when we ignite it inside an engine. ",
            "date": "Answered November 7, 2017",
            "views": "37",
            "upvotes": "0"
        }
    ]
}