{
    "title": "Energy can neither be created nor be destroyed. After our death, where does this energy go to? - Quora",
    "tags": [
        "Energy Can Neither Be Created nor Be Destroyed",
        "Energy (physics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Duncan Watson",
                "href": "/profile/Duncan-Watson-10"
            },
            "answer_text": "We get our energy from food. Two epic tragedies from the last century saw Stalin confiscate peasant food and up to 30 million peasants starved and died. The tragedy was repeated in China by Mao Zedong and up to 60 million peasants died. Stop eating and you slowly starve and die. So where does our food, plants and vegetables and fruit, get its energy from? The sun. Animals live on plants and thus they ultimately get their energy from the sun too. So the sun is the source of energy on earth. Why can you do a day’s work? Because the sun is shining. Sunlight is about 47% light and 47 % infra red that produces heating and 6 % ultraviolet (harmful). Photosynthesis turns sunlight into food. The infrared keeps the atmosphere warm for us delicate human beings. We know the photosynthesis process, called the Kreb’s cycle, but we cannot duplicate it to make our own food. So we still have to rely on plants to do that function. We are 43 % human and the rest of us, mainly lining the digestion tract and gut, consists of bacteria, viruses, fungi etc. They perform the vital task, which we cannot do on our own, of digesting the food and extracting the sun’s energy from it. Some of this food and energy goes into making new proteins to replace the worn out proteins in our bodies. Some we use to do useful work as in walking, cooking, gym, pushing a pen, tapping a keyboard, reading or thinking which pushes neurotransmitters around between our brain cells etc. Much of the food gets burned up in our cells to produce body warmth. This energy is degraded in the process and appears as heat energy which cannot be collected and used to do useful work. The energy input of a person is due to the food that has miraculously trapped the sun’s energy. That is balanced by an output of useful work when we focus our energy on some task plus an output of body heat energy that seldom does any useful work as the energy radiates out in all directions instead of being focused in one direction. Energy input equals energy output. The total energy transfer is a zero sum. Energy input from the food is useful energy. Energy output is partly useful work done and partly degraded energy that does nothing useful. So some of the useful energy input is wasted by us humans. Thus we are inefficient energy users. And so the sun keeps pumping in excess energy to keep us inefficient energy gobbling humans going. Thus the final end of the sun’s energy is to appear as warmth in our atmosphere as our body temperature pumps out heat energy day and night. Some of this body-warmth energy adds to the heat energy content of the atmosphere. Some is reflected out to the cold of space. Some gets absorbed by plants to help their cycle. When a person dies they stop absorbing food energy and also stop giving out energy as body warmth and any work that they did. So there is still a zero sum energy transfer. Zero energy absorbed equals zero energy given out. So only in death is the energy equation efficient. Saint Paul said we must die to self. The less we think of self, the more efficient we become. But whether you live or die, the sun keeps shining. ",
            "date": "Answered September 13, 2018",
            "views": "2",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Yash Chanda",
                    "user_href": "/profile/Yash-Chanda"
                },
                {
                    "user_id": "Fay B",
                    "user_href": "/profile/Fay-B-5"
                },
                {
                    "user_id": "Ryan Weaver",
                    "user_href": "/profile/Ryan-Weaver-80"
                }
            ]
        },
        {
            "author_info": {
                "name": "Blake Winfield",
                "href": "/profile/Blake-Winfield-4"
            },
            "answer_text": "The laws of thermodynamics state that energy cannot be created or destroyed. When you die, the atoms that make up your body disperse to create new things. There also remains much debate about whether there may exist forms of \"energy\" (auras, souls, etc) outside of atoms and molecules that make up a human being. “As we know through thermodynamics, energy can not be created nor destroyed.. it can simply change states. The total amount of energy in an isolated system does not, cannot, change. And thanks to Einstein, we also know matter and energy are two rungs on the same ladder. The universe as a whole is closed. However, human bodies (and ecosystems alike) are not closed systems, but open systems-we exchange energy with our surroundings. We can gain energy (again, through chemical processes) and we can lose it (by expelling waste or emitting heat). In death, the collection of atoms that comprise you (a universe within the universe) are repurposed. These same atoms, and this energy, which originated during the big bang, will always be around. Therefore, your \"light\"-that is, the essence of your energy (not to be confused with your actual consciousness)-will continue to echo throughout space until the end of time.” Source- http://futurism.com/the-physics-of-death/ ",
            "date": "Answered February 20, 2020",
            "views": "382",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Drew Pascalini",
                    "user_href": "/profile/Drew-Pascalini"
                }
            ]
        },
        {
            "author_info": {
                "name": "Levi Shaner",
                "href": "/profile/Levi-Shaner"
            },
            "answer_text": "This is an easy one :) Disclaimer: In this answer I will talk solely about physical energy (heat, chemical energy, etc.). I don’t know or care where anyone stands on the entire spirituality debate, and I won’t share my opinion either. :) After our deaths, the energy contained in us simply disperses into the surrounding environment. As our bodies (or giblets) cool, the excess heat energy we possess in life is distributed to the surrounding air, liquid, or objects our bodies are in contact with. Furthermore, the energy contained in the compounds in our bodies (sugar, fat, protein, almost everything) disperses as well. The bacteria and other organisms that decompose us absorb some of it, and much of it is lost too as heat to our surroundings as the chemicals break apart (either when eaten by decomposers or naturally) into smaller, lesser-energy forms. In summary, after the death of the human body (or any other, for that matter) the energy in it is dispersed to its surroundings, either in the same form or a different one, becoming one with the energy already in the surroundings and dissolving into it, ready to be absorbed by another living, growing organism. :) P.S. This is my first answer on Quora, so please give me any feedback and tell me if I did anything wrong! ",
            "date": "Answered July 29, 2017",
            "views": "13",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bill Lindemann",
                    "user_href": "/profile/Bill-Lindemann"
                },
                {
                    "user_id": "Dan Celestin",
                    "user_href": "/profile/Dan-Celestin-3"
                },
                {
                    "user_id": "Bill Collis",
                    "user_href": "/profile/Bill-Collis-2"
                },
                {
                    "user_id": "Ralf Ulrich",
                    "user_href": "/profile/Ralf-Ulrich-1"
                },
                {
                    "user_id": "Johnson A",
                    "user_href": "/profile/Johnson-A-41"
                },
                {
                    "user_id": "Robert Heap",
                    "user_href": "/profile/Robert-Heap"
                },
                {
                    "user_id": "Justin Rivas",
                    "user_href": "/profile/Justin-Rivas-11"
                },
                {
                    "user_id": "Kevin Malate",
                    "user_href": "/profile/Kevin-Malate"
                },
                {
                    "user_id": "Andrew Zhang",
                    "user_href": "/profile/Andrew-Zhang-103"
                },
                {
                    "user_id": "Rizwan Ravkrda",
                    "user_href": "/profile/Rizwan-Ravkrda"
                },
                {
                    "user_id": "Shubham Sankpal",
                    "user_href": "/profile/Shubham-Sankpal-2"
                },
                {
                    "user_id": "John Mears",
                    "user_href": "/profile/John-Mears-1"
                },
                {
                    "user_id": "Agent.l. Weber",
                    "user_href": "/profile/Agent-l-Weber"
                },
                {
                    "user_id": "Mark Weinstock",
                    "user_href": "/profile/Mark-Weinstock-2"
                },
                {
                    "user_id": "Bastiaan Van Zwieten",
                    "user_href": "/profile/Bastiaan-Van-Zwieten"
                }
            ]
        },
        {
            "author_info": {
                "name": "Samuel O. Alfred",
                "href": "/profile/Samuel-O-Alfred"
            },
            "answer_text": " When human beings die, the energy stored in their body breaks down very quickly and heat is dissipated in the decomposition process. This happens very quickly. Chemical energy is stored in our body. The electrical activities in our brain means electrical energy is inherent. When a person dies, the heart stops beating. The body loses heat and the person becomes cold. The body temperature falls so rapidly until it becomes at par with The surroundings. In summary, the energy conversion process is as follows: Chemical energy - Heat energy Electrical energy - Heat energy So energy is neither destroyed or created. ",
            "date": "Answered July 29, 2017",
            "views": "36",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Deepak Kumar",
                    "user_href": "/profile/Deepak-Kumar-9914"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Roseman",
                "href": "/profile/Mark-Roseman-5"
            },
            "answer_text": "A small fraction of your energy is in the form of heat, which dissipates into the surroundings. Energy is also stored in ion gradients across membranes. These dissipate, the potential energy converted to heat. The vast majority of the energy in you is in the form of chemical potential energy. You are food: carbohydrates, fat and protein, no different than a dead cow. Estimates are that you provide 130,000 Calories to whatever eats you. Maggots, bacteria, and predators convert your food energy to their own biochemicals plus heat. They die and the process repeats. The atoms are immortal but in each cycle, the largest fraction of energy is converted to heat. Fortunately, we have a steady input of energy from the sun, which keeps the cycle going. If you are talking about a soul or vital force, it is has not been detected. ",
            "date": "Answered September 13, 2018",
            "views": "645",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jeffrey Werbock",
                "href": "/profile/Jeffrey-Werbock"
            },
            "answer_text": "The energy that animates our bodies comes from the sun via the food we eat, and the electricity in all the sensory impressions our bodies take in every moment of their lives. We, the thinkers / perceivers, are a tiny offshoot of these two currents of energy. When the body dies, the two currents stop flowing through that body. We no more own that energy than a toaster oven owns the electricity which makes it hot. Thus it is incorrect to identify the currents of animating energy as “our” energy. It doesn’t go anywhere, it just stops flowing through our bodies which then disintegrate if they haven’t been embalmed. ",
            "date": "Answered August 23, 2019",
            "views": "323",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harold , s",
                    "user_href": "/profile/Harold-s-18"
                },
                {
                    "user_id": "Christopher Han",
                    "user_href": "/profile/Christopher-Han-22"
                }
            ]
        },
        {
            "author_info": {
                "name": "Donald Fone",
                "href": "/profile/Donald-Fone"
            },
            "answer_text": "The energy before you were conceived was In your mother’s egg and your father’s sperm. The sperm has to use energy to swim to an egg. The egg has to use energy to survive while it awaits a sperm cell. The two joined and created you. The energy in those two cells created you. And after conception, your mother’s body and food provided energy for you to grow and develop. When you die, our bodies are like the dead meat we eat from dead animals. Meat contains energy and our bodies store that meat until it’s eaten by bacteria or animals, giving them energy from our bodies. ",
            "date": "Answered August 28, 2019",
            "views": "188",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hayden Finch",
                    "user_href": "/profile/Hayden-Finch-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Murphy",
                "href": "/profile/Jim-Murphy-49"
            },
            "answer_text": "In our material, physical world, where conservation of energy is an observed fact, there is no such thing as “a human’s energy”, therefore nothing happens. If you prefer to believe there is some mystical property that you label human energy, you are also free to believe anything you like about what happens to it when we die. ",
            "date": "Answered September 12, 2018",
            "views": "365",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Brown",
                    "user_href": "/profile/David-Brown-1015"
                },
                {
                    "user_id": "Elizabeth Porco",
                    "user_href": "/profile/Elizabeth-Porco-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ron Brown",
                "href": "/profile/Ron-Brown-120"
            },
            "answer_text": "If you are asking about one’s thermal energy when they die, it dissipates to the environment as the metabolic processes stop - just as you would expect. I held my wife’s still warm hand after her last exhale, and felt her pulse weaken then disappear. If you are asking about her spirit - and how she dealt with this disease - her story has been inspiring to others. If you are asking about something more mystical, I can’t help you. ",
            "date": "Answered September 13, 2018",
            "views": "402",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ronald Ris",
                    "user_href": "/profile/Ronald-Ris"
                },
                {
                    "user_id": "Elizabeth Porco",
                    "user_href": "/profile/Elizabeth-Porco-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jordan Shank",
                "href": "/profile/Jordan-Shank-2"
            },
            "answer_text": "In your body, energy is stored in the form of fats, sugars, and ATP. These chemical bonds contain more energy than their constituent parts (water and carbon dioxide), which is why we use them to store energy. When you die, your body stops breaking down those molecules. The energy is still in the environment — you’re just no longer doing anything with it. ",
            "date": "Answered July 29, 2017",
            "views": "292",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kevin Cameron",
                    "user_href": "/profile/Kevin-Cameron-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Wrixon EurIng",
                "href": "/profile/David-Wrixon-EurIng"
            },
            "answer_text": "Energy is actually inherent in matter that by and large it does not really go anywhere. When it does go somewhere, it is due to Mass Transfer, such as in the emission of Light. To get a handle on this, can I suggest: David Wrixon EurIng's post in RQD l ",
            "date": "Answered July 29, 2017",
            "views": "206",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Suzy McKee Charnas",
                "href": "/profile/Suzy-McKee-Charnas"
            },
            "answer_text": "It is transformed, in many different ways. That’s the unwritten part of this law; there is literally no alternative: x created + x destroyed = transformed. ",
            "date": "Answered February 21, 2020",
            "views": "88",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Diana Davis Rumbold",
                    "user_href": "/profile/Diana-Davis-Rumbold"
                }
            ]
        },
        {
            "author_info": {
                "name": "Will Gits",
                "href": "/profile/Will-Gits"
            },
            "answer_text": "You stop ingesting new energy and the energy you have accumulated in your body is consumed by decomposers, your body heat slowly dissipates into the air and ground ",
            "date": "Answered July 29, 2017",
            "views": "85",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Christian Gingras",
                "href": "/profile/Christian-Gingras-1"
            },
            "answer_text": "Where the energy that keep you alive everyday come from? If you stop eating, you will quickly discover that you lack energy. ",
            "date": "Answered August 23, 2019",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Satyadeep Yadav",
                "href": "/profile/Satyadeep-Yadav"
            },
            "answer_text": "Energy can't be created nor destroyed, but can reside into non-living things. ",
            "date": "Answered September 13, 2019",
            "views": "50",
            "upvotes": "0"
        }
    ]
}