{
    "title": "Everything on a black hole's event horizon must travel through space with the speed of light c. Is that right? If so, how can something enter a massive enough black hole and stay intact? - Quora",
    "tags": [
        "General Relativity",
        "Black Holes",
        "Speed of Light",
        "Cosmology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tyson Jensen",
                "href": "/profile/Tyson-Jensen-1"
            },
            "answer_text": "It’s an article written from the hopeful point of view that we know what a black hole really is. We do not. We know that when too much stuff gets concentrated into a small enough space, it bends spacetime into a permanent configuration that we’ve taken to calling a black hole. Until Hawking came along and we then knew that it’s a semi-permanent configuration — permanent in any normal sense but over sufficiently long timescales the black hole evaporates. But what do we really know? And what happens? So what actually happens is we don’t know. If quantum physics is just wrong and black holes don’t really evaporate at all, then the description of “Anne’s” point of view from the article is incorrect. She’d see you fall across the horizon and not see anything after that, and would have no idea what became of you, while you would be able to see out but you’d never be able to leave. Probably you die from tidal forces as you are drawn to the center. Probably because… no one has ever seen inside a black hole, and singularities aren’t physical phenomena, they’re mathematical phenomena that as far as anyone can tell do not and cannot manifest in a physical form. Thus, a mathematical singularity is a place where our best answer is “we don’t know.” We don’t know. If Einstein is wrong about black hole physics then what happens is you burn up at the event horizon. Anne sees your clock slow down and predicts that from your point of view it’s a quick death. From your point of view you see Anne’s clock speed up and… experience a quick death. But we have no real reason to believe Einstein is wrong, we’ve not done a single experiment that would give us cause to doubt. We don’t know. That’s the right answer, whatever some pop science article wants to claim about it. ",
            "date": "Answered December 29, 2019",
            "views": "106",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Daryl Garrett",
                    "user_href": "/profile/Daryl-Garrett-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brent Meeker",
                "href": "/profile/Brent-Meeker"
            },
            "answer_text": "Are you saying you think moving at light speed will somehow mean you won’t be intact? Remember it called relativity theory for a reason. Just because something is traveling a c relative to some distant observers, doesn’t mean it’s even moving in it’s own reference frame (in fact nothing ever moves in it’s own reference frame). Here’s an infalling trajectory in spacetime with the light cone (the future directions of emitted light) of the infalling particle. Notice that the particle is not falling at the speed of light in it’s own frame.  One way to think of it is imagine the black hole is like a sink hole and spacetime is flowing into it like water. You’re in a boat and it has a certain maximum speed relative to the water. So there’s a point at which the water in flowing in faster than your boat can go…that’s the event horizon. But nothing happens to you as you cross it. It just means you can’t go back. ",
            "date": "Answered December 30, 2019",
            "views": "164",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Roy Patrick Kerr",
                    "user_href": "/profile/Roy-Patrick-Kerr"
                },
                {
                    "user_id": "Tommy White",
                    "user_href": "/profile/Tommy-White-67"
                },
                {
                    "user_id": "Herdeep Singh",
                    "user_href": "/profile/Herdeep-Singh-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Myckola Goroh",
                "href": "/profile/Myckola-Goroh"
            },
            "answer_text": "No, not at all. From any side — from center or from the Space. The fact is that outside matter is falling with a speed of about 1/3 of c on average; due to a rotation of plasma on accretion disc real radial speed is just about 20,000 mi/s. Nowadays internal model of black hole says that nothing even trying to come close to event horizon from the inside even with a half speed of c. Matter that got inside is slow down to a zero speed. Event horizon is imaginary line and it has no special features. Only one magic property: nothing material can pass it from inside. Light can not be generated inside black hole in a direction going from the center. But if something would be able to beam light out — it will go through event horizon. Event horizon is fully transparent for magnetic field and gravity. ",
            "date": "Answered December 29, 2019",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bengt Nyman",
                "href": "/profile/Bengt-Nyman-1"
            },
            "answer_text": "Only EM radiation travels at the speed of light. The event horizon is just a light phenomenon, otherwise nothing “physical”. Nothing stays intact on the way into a black hole. The endothermic fission that must be the reason for the near absolute zero temperature inside a BH is sure to reduce everything to primitive forms of matter and or energy. This disassembly can very well be going on gradually starting outside the event horizon and finishing inside and closer to the actual, physical core of the BH. ",
            "date": "Answered December 29, 2019",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Blyth",
                "href": "/profile/David-Blyth-1"
            },
            "answer_text": "They don't stay intact. The gravitational forces break things apart down to the particle level well before they get to the event horizon. Particles that travel at some significant percentage of C near the event horizon can escape. The others don't. ",
            "date": "Answered December 29, 2019",
            "views": "24",
            "upvotes": "0"
        }
    ]
}