{
    "title": "Has any technology influenced human evolution? - Quora",
    "tags": [
        "Human Evolution"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steven J Greenfield",
                "href": "/profile/Steven-J-Greenfield"
            },
            "answer_text": "Most definitely yes! Cooking food has led to small jaws and teeth, and has enhanced our ability to grow large brains. It has also led to increased resistance to cancers caused by the compounds created in burnt meat. Yes, the same stuff that makes barbecued steak taste so good, which by the way we also have developed a taste for partly burnt meat. Cooking is like moving part of the digestive system outside the body. It makes foods easier to digest, so we can get more energy and proteins and such out of the food we eat. Some vegetables are actually bad for us until cooked, and any roasted vegetable becomes -much- easier to chew and digest. It has had tremendous effects on our genes. Those first psychotic primates who -didn't- run in terror from fire, but instead were fascinated by it and played with it, were the ones who survived and adapted. The ones who experimentally tossed vegetables and meat into a fire to see what would happen, were the ones who survived and adapted. All those changes in behavior and development came about by genetic changes. Cooking and smoking meats keeps them edible longer. Fire can keep us warm at night and keep predators away. Cooking means a given size of land can support more of us. ",
            "date": "Answered July 27, 2014",
            "views": "12",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andrew Sevenich",
                    "user_href": "/profile/Andrew-Sevenich-1"
                },
                {
                    "user_id": "Tim Kaye",
                    "user_href": "/profile/Tim-Kaye-1"
                },
                {
                    "user_id": "Ed Averbukh",
                    "user_href": "/profile/Ed-Averbukh"
                },
                {
                    "user_id": "Kenneth Chua",
                    "user_href": "/profile/Kenneth-Chua-3"
                }
            ]
        }
    ]
}