{
    "title": "Has a giant squid ever attacked a human? - Quora",
    "tags": [
        "Giant Squid",
        "Squid"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brodie Brickey",
                "href": "/profile/Brodie-Brickey-1"
            },
            "answer_text": "The Humboldt Squid has definitely attacked humans, although that species of cephalopod would not be considered to be a giant. They are know to be rather voracious and aggressive towards anything that they might consider prey. Whether Humboldt hunt in packs in a cooperative manner is questionable or at least unproven. They may just appear to be pack hunters because they feed so aggressively and competitively, and they just appear to be cooperating to get their prey. The individual squid grow up to almost 5 ft. in length ( 4.1 meters). Squid of their Family Ommastrephid have been measured at 2.5m (10ft), and 50kg (100 lbs.). Whether giant squid have attacked human beings is open for debate. Sea stories which tell of giant Cephalopods attacking ships are perhaps questionable. However, squid are know to be rather voracious and aggressive hunters and feeders. If a human being got in their way of a really big one it might be just too bad. Billy (while he was Capt. of the truth) shot a squid he found banging its mantle into a rock. He was diving for halibut at the time and had a large spear gun. After he brought it back to the boat. The stretched the length of he “green” landing ramp on the stern of the Truth. That would be over 24 ft from the top of the mantel to the tips of the arms. Marine biologists from UCSB (University of California Santa Barbara) were ecstatic with the specimen. Just imagine that thing meeting you at a 100 ft. By the way Sea Stories begin with:”No shit this……”, Dive stories begin with:”There I was at (insert depth)”. These are a fact of life and dead animals, fish and lobsters grow much faster than they do when they are alive. Reference : Wikipedia ",
            "date": "Answered October 7, 2020",
            "views": "33",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Donna Brownlee",
                "href": "/profile/Donna-Brownlee-4"
            },
            "answer_text": "NO! NOT that l am aware of, THEY live to Deep in the Ocean for a Human to come in contact with. ",
            "date": "Answered October 7, 2020",
            "views": "17",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Gwartney",
                    "user_href": "/profile/David-Gwartney-1"
                }
            ]
        }
    ]
}