{
    "title": "Has science ever disproved philosophical theories? - Quora",
    "tags": [
        "Scientific Laws and Principles",
        "Philosophy of Science",
        "Philosophers",
        "Theory and Theories",
        "Scientists",
        "Science of Everyday Life",
        "Philosophy",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Israel Ramirez",
                "href": "/profile/Israel-Ramirez"
            },
            "answer_text": "There isn’t much in philosophy that can be disproved. Some ideas are no longer popular or haven’t been found to useful or maybe seem hard to reconcile with other things we have learned. Scientists no longer accept mind-body dualism, an idea that had been popular among philosophers for many centuries. The philosopher Descartes is famous for this idea. He did develop logical arguments though the idea probably goes back to Plato and Aristotle.[1] [2] [3]  The exact formulation of this idea has varied over time, but the usual version is that mind and matter are fundamentally different from each other. The mind is somehow immaterial though it may interact with the matter in our body or maybe act in parallel with the matter in our body. Neuroscience and behavioral science hasn’t produced evidence for an immaterial mind. Our thoughts, feelings, dreams, and desires seem to be the product of our brains. There aren’t any experiments showing that we must accept the existence of an immaterial mind. My belief in God is nothing more than neurons firing and releasing neurotransmitters through various regions of the cerebral cortex. In fact, the neurophysiology of religious experience is a perfectly ordinary subdiscipline.[4] [5]Here’s a picture of brain regions activated by prayer.[6]  I understand that most academic philosophers today are now monists; they accept that the mind and body are the same substance and that our mental life is the activity of our brains. Of course, there’s no such thing as proof in philosophy. Some academic philosophers and many ordinary people remain convinced that mind and matter are entirely different substances and that our everyday conscious experience can’t be reduced to the electrical and chemical activity of cells in our heads. This guy, who is pretty smart, thinks that it makes sense to distinguish between mind and body:[7] [8]  Footnotes[1] Dualism – My MOOC experiences[2] Dualism (Stanford Encyclopedia of Philosophy)[3] Dualism versus Materialism[4] Association of posterior EEG alpha with prioritization of religion or spirituality: a replication and extension at 20-year follow-up[5] The neurophysiological correlates of religious chanting[6] How Does Neuroscience Explain Spiritual and Religious Experiences?[7] Which of these do you agree with? -  ppt download[8] Dualism & Reductionism: David Chalmers’s “Facing Up to the Problem of Consciousness”",
            "date": "Answered November 6, 2019",
            "views": "892",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Victor Duarte",
                    "user_href": "/profile/Victor-Duarte-16"
                },
                {
                    "user_id": "Sarvesh Rawat",
                    "user_href": "/profile/Sarvesh-Rawat-16"
                },
                {
                    "user_id": "Ethan Schoales",
                    "user_href": "/profile/Ethan-Schoales-1"
                },
                {
                    "user_id": "Andrey Gelman",
                    "user_href": "/profile/Andrey-Gelman"
                },
                {
                    "user_id": "Omar Bessa",
                    "user_href": "/profile/Omar-Bessa"
                },
                {
                    "user_id": "Ken Saladin",
                    "user_href": "/profile/Ken-Saladin"
                },
                {
                    "user_id": "Samad Khan",
                    "user_href": "/profile/Samad-Khan-33"
                },
                {
                    "user_id": "Sujoy Das",
                    "user_href": "/profile/Sujoy-Das-225"
                },
                {
                    "user_id": "Mark Elliott Churchman",
                    "user_href": "/profile/Mark-Elliott-Churchman"
                },
                {
                    "user_id": "Gino Lee",
                    "user_href": "/profile/Gino-Lee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Quinn Rusnell",
                "href": "/profile/Quinn-Rusnell"
            },
            "answer_text": "The most well preserved ancient theories in philosophy are found in the complete works of Aristotle. In all his works on nature, he considers himself to be doing both science and philosophy. There was no distinction at that point in time. You can see him trying to logically deduce causes from observable phenomena, which is one of the core methods in the empirical sciences. These conclusions are continually revisable because we are continually making new observations, and finding new ways to make new observations, which fit or do not fit our causal explanations. So while the reasoning and logic has essentially stayed the same, I would be surprised to find a single theory in Aristotle’s natural philosophy that has not been sufficiently “disproved”. Throughout the history of natural philosophy since Aristotle, you will find the same pattern of theories being revised or disproved by new observations, especially when we get new technologies which open up the sorts of observations we can make, such as the telescope for astronomy and microscope for biology. In physics, Newton considered himself first and foremost a natural philosopher. It took another natural philosopher, Einstein, to “disprove” in scientific terms, Newton’s theories. The distinctions between natural philosophy and science are so fuzzy that the question amounts to “has science ever disproved a scientific theory?”, or the equivalent, “has natural philosophy ever disproved a theory in natural philosophy?”, or any combination thereof which may sound slightly more meaningful, but essentially mean the same thing. There is really no useful distinction to be made between natural philosophy and science in terms of getting the work done with which they both aim to get done. They aim for the same target: explanation of natural observable phenomena. They use the same methods: observation and inference. ",
            "date": "Answered April 10, 2020",
            "views": "148",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alioune Ngom",
                    "user_href": "/profile/Alioune-Ngom"
                },
                {
                    "user_id": "Michael Boland",
                    "user_href": "/profile/Michael-Boland-67"
                }
            ]
        },
        {
            "author_info": {
                "name": "Justin Schwartz",
                "href": "/profile/Justin-Schwartz-3"
            },
            "answer_text": "All the time. For example, there is the principle of sufficient reason, that everything happens for a reason. Quantum physics shows this is not true. Contrary to what Einstein thought, God does indeed play with dice. The subatomic realm is irreducibly probabilistic. There’s also this proves determinism on certain common understandings of determinism. That’s just to start. Things that seem utterly inconceivable to people in one situation at a particular time turn out to be true, and sometimes come to be seen as obvious to people later. Lots of people still find quantum Mechanics to be deeply mysterious however. ",
            "date": "Answered November 7, 2019",
            "views": "80",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sarvesh Rawat",
                    "user_href": "/profile/Sarvesh-Rawat-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Sibbald",
                "href": "/profile/Stephen-Sibbald-1"
            },
            "answer_text": "Science is a branch of philosophy: phi·los·o·phy /fəˈläsəfē/ noun. The study of the fundamental nature of knowledge, reality, and existence, especially when considered as an academic discipline. (Google) sci·ence /ˈsīəns/ noun. The intellectual and practical activity encompassing the systematic study of the structure and behaviour of the physical and natural world through observation and experiment. (Google) There is nothing in science that transcends philosophy. The term science is merely a neologism for natural philosophy: Natural philosophy was the common term for the practice of studying nature, from the ancient world to the 19th century. It was in the 19th century that the concept of \"science\" received its modern shape with new titles emerging such as biology and physics. (Wikipedia) So to answer the question, yes, every time science disproves a theory, it disproves a philosophical theory. ",
            "date": "Answered November 20, 2019",
            "views": "72",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Quinn Rusnell",
                    "user_href": "/profile/Quinn-Rusnell"
                },
                {
                    "user_id": "Mary Cris",
                    "user_href": "/profile/Mary-Cris-15"
                },
                {
                    "user_id": "Chris van der Walt",
                    "user_href": "/profile/Chris-van-der-Walt-1"
                },
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                },
                {
                    "user_id": "David Moore",
                    "user_href": "/profile/David-Moore-408"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathan Ketsdever",
                "href": "/profile/Nathan-Ketsdever"
            },
            "answer_text": "Only the verse, ethical theories calling to question: The risk of use or abuse of military technology.The manipulation of humans for the purposes of science.The use of Nazi ends and means of scientific experimentation.The later led to the Nurenberg Trial and the the Nuremberg Code, based on deontelelogical principles of ethics. So much for any sector of the economy being able to self-police its own ethical questions. Specifically: The ten points of the code were given in the section of the verdict entitled \"Permissable Medical Experiments\": [5] The voluntary consent of the human subject is absolutely essential.The experiment should be such as to yield fruitful results for the good of society, unprocurable by other methods or means of study, and not random and unnecessary in nature.The experiment should be so designed and based on the results of animal experimentation and a knowledge of the natural history of the disease or other problem under study that the anticipated results will justify the performance of the experiment.The experiment should be so conducted as to avoid all unnecessary physical and mental suffering and injury.No experiment should be conducted where there is an a priori reason to believe that death or disabling injury will occur; except, perhaps, in those experiments where the experimental physicians also serve as subjects.The degree of risk to be taken should never exceed that determined by the humanitarian importance of the problem to be solved by the experiment..Proper preparations should be made and adequate facilities provided to protect the experimental subject against even remote possibilities of injury, disability, or death.The experiment should be conducted only by scientifically qualified persons. The highest degree of skill and care should be required through all stages of the experiment of those who conduct or engage in the experiment.During the course of the experiment the human subject should be at liberty to bring the experiment to an end if he has reached the physical or mental state where continuation of the experiment seems to him to be impossible.During the course of the experiment the scientist in charge must be prepared to terminate the experiment at any stage, if he has probable cause to believe, in the exercise of the good faith, superior skill and careful judgment required of him that a continuation of the experiment is likely to result in injury, disability, or death to the experimental subject.Source: Nuremberg Code - Wikipedia ",
            "date": "Answered November 6, 2019",
            "views": "87",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sarvesh Rawat",
                    "user_href": "/profile/Sarvesh-Rawat-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charles Francis",
                "href": "/profile/Charles-Francis-56"
            },
            "answer_text": "It has, but this is very rarely recognised. The fundamental tenet of falsification, one of the most popular philosophies is that scientific theory cannot be proven, because it is induced from data. But the most important theories of the 20th century can be derived from fundamental principle, Hume’s principle of uniformity in nature, that the fundamental behaviours of matter are always and everywhere the same. Without this principle, there is no science because if the behaviour of matter could change observation would be meaningless. Einstein showed that relativity follows, not from data, but from the way in which we define distances. Von Neumann showed that quantum mechanics follows from the general property that we can give a probabilistic prediction for a measurement result. These theories do indeed disprove the fundamental tenets of falsification. ",
            "date": "Answered November 20, 2019",
            "views": "40",
            "upvotes": " Answer requested by Sarvesh Rawat",
            "upvoters": [
                {
                    "user_id": "Sarvesh Rawat",
                    "user_href": "/profile/Sarvesh-Rawat-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Constantin Lupu",
                "href": "/profile/Constantin-Lupu-1"
            },
            "answer_text": "Philosophy in general is a science. It must be in line with findings from other branches of science. The fact that many philosophers speculate on technical discoveries and some discoveries stimulate philosophies is another problem, but in principle it leads to progress if this interdependence has a common real basis. That is why philosophical theories are often rejected by engineers and philosophers can reject technical theories. The downside is that philosophers and engineers don't really like each other, even though scientists, researchers are more advanced engineers, who also have some philosophy in mind. ",
            "date": "Answered November 8, 2019",
            "views": "45",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sarvesh Rawat",
                    "user_href": "/profile/Sarvesh-Rawat-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bruce Barron",
                "href": "/profile/Bruce-Barron-1"
            },
            "answer_text": "There is such a thing as the the philosophy of science which speaks of science, it's theories, the subscribing to certain rules, it's causes and principles. Ultimately it takes its principles from philosophy and philosophy does not take its principles from science. As a matter of fact science is often found butting its nose into philosophy where it is impossible to disprove philosophical theories. They are two different sciences. Their subject matter is different. Philosophy is neither the subject matter or object matter of science. ",
            "date": "Answered November 20, 2019",
            "views": "9",
            "upvotes": " Answer requested by Sarvesh Rawat",
            "upvoters": [
                {
                    "user_id": "Mary Cris",
                    "user_href": "/profile/Mary-Cris-15"
                },
                {
                    "user_id": "Leslie Thorny",
                    "user_href": "/profile/Leslie-Thorny"
                },
                {
                    "user_id": "Catlin Arch",
                    "user_href": "/profile/Catlin-Arch"
                },
                {
                    "user_id": "Sarvesh Rawat",
                    "user_href": "/profile/Sarvesh-Rawat-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Samuel Chukwudi Ogbonna",
                "href": "/profile/Samuel-Chukwudi-Ogbonna"
            },
            "answer_text": "Science has disproved every single philosophical theory. Moreover science has shown philosophy to be impossible. With the exception of the work of Bertrand Russell and the Vienna Circle and a handful of others NOTHING any philosopher has devised is worthy of being called a theory. ",
            "date": "Updated November 9, 2019",
            "views": "30",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Priyanka Sinha",
                    "user_href": "/profile/Priyanka-Sinha-311"
                },
                {
                    "user_id": "Thomas Hägg",
                    "user_href": "/profile/Thomas-Hägg"
                },
                {
                    "user_id": "Sarvesh Rawat",
                    "user_href": "/profile/Sarvesh-Rawat-16"
                },
                {
                    "user_id": "Eric Hernández",
                    "user_href": "/profile/Eric-Hernández-1-1"
                },
                {
                    "user_id": "Peter LePort",
                    "user_href": "/profile/Peter-LePort"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vern Wall",
                "href": "/profile/Vern-Wall-1"
            },
            "answer_text": "Philosophy does not deal in theories. A philosophy is made up in some person’s head. If it especially thought provoking it will be known by that person’s name and people will not bother to explain it any more. They will embellish the proposal with various made up words, the more syllables the better, until it is possible to talk all day without ever saying anything. They get very unmannerly when somebody points out that their circumlocution is meaningless. Philosophy and the academic system originated in Akademos, a grove near Athens that was sacred to the goddess of wisdom. Membership was by invitation only, and members claimed ownership of all knowledge, by which they meant stuff they made up by their own powers of reasoning. PhDs are priests in a pagan religion! ",
            "date": "Answered November 18, 2019",
            "views": "26",
            "upvotes": " Answer requested by Sarvesh Rawat",
            "upvoters": [
                {
                    "user_id": "Arslan Baig",
                    "user_href": "/profile/Arslan-Baig-21"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Brocklehurst",
                "href": "/profile/Paul-Brocklehurst-2"
            },
            "answer_text": "Has science ever disproved philosophical theories? Yes. Socrates claimed that women must have more teeth than men. - They don’t! ",
            "date": "Answered November 7, 2019",
            "views": "34",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sarvesh Rawat",
                    "user_href": "/profile/Sarvesh-Rawat-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jack Crawford",
                "href": "/profile/Jack-Crawford-1"
            },
            "answer_text": "They are 2 different bodies of knowledge. Properly they shouldn’t intersect. The question is something like asking if biology ever disproved math theories. ",
            "date": "Answered November 6, 2019",
            "views": "88",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sarvesh Rawat",
                    "user_href": "/profile/Sarvesh-Rawat-16"
                },
                {
                    "user_id": "Eugene Bucamp",
                    "user_href": "/profile/Eugene-Bucamp"
                }
            ]
        },
        {
            "author_info": {
                "name": "Radhakrishnan (Arkay) Nair",
                "href": "/profile/Radhakrishnan-Arkay-Nair"
            },
            "answer_text": "Philosophy in its broadest term includes science (Natural Philosophy). So your question must be rephrased to say whether logics (a branch of philosophy) has proved or disproved any scientific theories. ",
            "date": "Answered November 18, 2019",
            "views": "69",
            "upvotes": " Answer requested by Sarvesh Rawat",
            "upvoters": [
                {
                    "user_id": "Sarvesh Rawat",
                    "user_href": "/profile/Sarvesh-Rawat-16"
                },
                {
                    "user_id": "Richard O. Colestock",
                    "user_href": "/profile/Richard-O-Dick-Colestock"
                }
            ]
        },
        {
            "author_info": {
                "name": "Skip Moreland",
                "href": "/profile/Skip-Moreland"
            },
            "answer_text": "Science doesn’t try. Philosophical ‘theories’ are not provable by science. Philosophical ‘theories don’t use the scientific method. So science neither proves or disproves such ‘theories’. ",
            "date": "Answered November 19, 2019",
            "views": "13",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sarvesh Rawat",
                    "user_href": "/profile/Sarvesh-Rawat-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Roemer",
                "href": "/profile/David-Roemer-1"
            },
            "answer_text": "Philosophy is a method of inquiry above another method. Metaphysics is as fundamental as science. Science has never disproved a theory in metaphysics. ",
            "date": "Answered November 7, 2019",
            "views": "23",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sarvesh Rawat",
                    "user_href": "/profile/Sarvesh-Rawat-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathan Coppedge",
                "href": "/profile/Nathan-Coppedge"
            },
            "answer_text": "Phlogiston was a scientific theory around 1896. It was philosophers… favoring science who opposed Hegel. ",
            "date": "Answered November 8, 2019",
            "views": "32",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jack Crawford",
                    "user_href": "/profile/Jack-Crawford-1"
                },
                {
                    "user_id": "Sarvesh Rawat",
                    "user_href": "/profile/Sarvesh-Rawat-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Chan",
                "href": "/profile/David-Chan-287"
            },
            "answer_text": "No, Science cannot be used to prove or disprove Philosophical theories. This is why. Belief, Proof and Science. ",
            "date": "Answered November 7, 2019",
            "views": "30",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sarvesh Rawat",
                    "user_href": "/profile/Sarvesh-Rawat-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tim Harding",
                "href": "/profile/Tim-Harding-7"
            },
            "answer_text": "Not that I’m aware of, and I have qualifications in both science and philosophy. Contrary to popular myth, there is not much overlap between science and philosophy. Science uses observations and experiments to discover empirical knowledge, whereas philosophy uses reason to deduce new knowledge from what we already know. ",
            "date": "Answered November 7, 2019",
            "views": "48",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Ragesh Nair",
                "href": "/profile/Ragesh-Nair-10"
            },
            "answer_text": "Philosophy says flower is beautiful. Science has no units for beauty. So there is no point or end if philosophy and science argues. It can neither be proved nor disapproved. ",
            "date": "Answered November 8, 2019",
            "views": "23",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Peter LePort",
                "href": "/profile/Peter-LePort"
            },
            "answer_text": "Philosophical theories try to show how you know something. Such as are the senses valid or how concepts are formed and how they work, etc. Scientific theories helps discover knowledge about things. Such as how far is the moon from the earth. How do we measure brightness, color, sound waves, etc. Knowing the first makes it easy to be correct about the second. Read: “How We Know” by Harry Binswanger ",
            "date": "Answered November 19, 2019",
            "views": "24",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Howard Neilly",
                "href": "/profile/Howard-Neilly"
            },
            "answer_text": "Philosophical theories and scientific theories separated themselves starting with the separation of Astronomy from Astrology, and also the establishment of The Scientific Method as the guideline for investigation all natural phenomena ",
            "date": "Answered November 8, 2019",
            "views": "21",
            "upvotes": " View 1 Upvoter "
        }
    ]
}