{
    "title": "Has the Pauli exclusion principle ever been violated? - Quora",
    "tags": [
        "Electron Spin",
        "Pauli Exclusion Principle",
        "Quantum Mechanics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rob Oliver",
                "href": "/profile/Rob-Oliver-33"
            },
            "answer_text": "Yes: in Neutron stars. The gravitational collapse of white dwarf stars is resisted by the electron degeneracy pressure i.e. the matter in these stars is so dense that if it were to be compressed any further the electrons would need to occupy the same set of quantum numbers thus violating Pauli’s principle. The tendency of nature to avoid such a situation results in a kind of pressure exerted against forces that try and push the electrons into the same orbitals. When the mass of such a star is increased further (for example if it accretes matter from its companion star in a binary system) then it can reach the Chandrasekhar limit where it experiences so much gravitational attraction that it collapses further causing a type Ia supernova and a neutron star remnant. In the neutron star, gravitational collapse has proceeded to the point that not only were electrons forced into the same set of quantum numbers: the electrons were forced into the the nuclei and captured by the protons, thus creating neutrons. Then, with essentially all of the star’s matter converted to neutrons, the neutrons were compressed until they were themselves at a point where further collapse would cause them to occupy the same sets of quantum numbers. Then neutron degeneracy pressure kicks in to stabilize the star. If further mass increase via accretion occurs, the Pauli principle can be broken for the neutrons too and the result will be an unstoppable collapse that results in a black hole. ",
            "date": "Answered September 22, 2018",
            "views": "900",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Holly Watkins-Gultiano",
                    "user_href": "/profile/Holly-Watkins-Gultiano"
                },
                {
                    "user_id": "Eman Mahboob",
                    "user_href": "/profile/Eman-Mahboob"
                },
                {
                    "user_id": "Sriram Jagathisan",
                    "user_href": "/profile/Sriram-Jagathisan"
                },
                {
                    "user_id": "Gregor Kikelj",
                    "user_href": "/profile/Gregor-Kikelj"
                },
                {
                    "user_id": "Bob Staszewski",
                    "user_href": "/profile/Bob-Staszewski"
                }
            ]
        },
        {
            "author_info": {
                "name": "Krishna Gangadhara",
                "href": "/profile/Krishna-Gangadhara"
            },
            "answer_text": "The answer is not known well. But “everything gets collapsed if Pauli’s exclusion principle is violated” Everyone knows that according to Pauli no two electrons can share the same quantum state. If electrons share the same quantum state, then all the electrons would occupy same quantum state. As a result there won’t be any valance electrons to make bond with other atoms and hence no molecule formation at all. We can guess the consequence of this result, if there is no molecule formation……..Everything gets collapsed. Thus, The existence of molecules itself says that Pauli’s principle can’t be violated ",
            "date": "Updated March 4, 2018",
            "views": "728",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aftaab Zia",
                    "user_href": "/profile/Aftaab-Zia"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jens Adler Nielsen",
                "href": "/profile/Jens-Adler-Nielsen"
            },
            "answer_text": "The exclusion principle is the difference between the two main categories of particles: Fermions (non-integer spin particles like electrons, neutrons and protons) and Bosons (integer spin particles like photons (light) and cooper pairs (superconductivity)). So to answer your question: yes, but it is OK. ",
            "date": "Answered February 12, 2015",
            "views": "258",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jay Wacker",
                    "user_href": "/profile/Jay-Wacker"
                },
                {
                    "user_id": "Jay Wacker",
                    "user_href": "/profile/Jay-Wacker"
                }
            ]
        },
        {
            "author_info": {
                "name": "Asvini Ramu",
                "href": "/profile/Asvini-Ramu"
            },
            "answer_text": "To this question this article gives the answer. How hard is it to violate Pauli's exclusion principle? ",
            "date": "Answered March 9, 2017",
            "views": "232",
            "upvotes": "0"
        }
    ]
}