{
    "title": "Has the ozone layer recovered? - Quora",
    "tags": [
        "Ozone & Ozone Layer",
        "Earth Science",
        "Environmental Science",
        "Atmospheric Sciences",
        "Climate Change",
        "The Environment",
        "Science of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Vance",
                "href": "/profile/John-Vance-14"
            },
            "answer_text": "The ozone layer is recreated every spring as the suns power increases to make ozone, and is at its least active in winter due losing solar power with ozone creating ultra violet being at its lowest. I suspect it was used by manufacturers of refrigerants( EG DUPONT) as an excuse to stop others using their patented gas whose patent was running out. Ozone is a very unstable gas and the hole may have been there all the time expanding and contracting with solar power as the seasons change. My opinion is shared by many. ",
            "date": "Updated October 22, 2019",
            "views": "128",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "John Flavin",
                    "user_href": "/profile/John-Flavin-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vishwanath Iyer",
                "href": "/profile/Vishwanath-Iyer-40"
            },
            "answer_text": "As the use of cfcs have significantly reduced as many governments have banned the use of cfcs in their countries and instead are using other compounds as refrigerants , the amount of ozone layer depletion has decresed . Yet , it still remains to continue to flourish because of the greenhouse gases , i.e CO , carbon dioxide , methane etc. It CAN be stopped by reducing pollution and planting more trees . ",
            "date": "Answered July 11, 2019",
            "views": "47",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dana Turner",
                "href": "/profile/Dana-Turner-41"
            },
            "answer_text": "When the “hole” was first discovered nearly half a century ago the world got it’s panties in a bunch and the culprit was deemed to be CFCs (which turned out to be quite a boon to politicians who invested in the fledgling ammonia technology prior to them banning CFCs). This was and is BULLSHIT! The ozone barrier at the South pole vents garbage into the atmosphere beginning at Spring solstice while it does the same thing at the north pole beginning at Fall solstice. These vents close when the garbage has been “flushed”. Rather than admitting their error the “scientists” simply went silent. This really should piss everyone in the world off. It is the common “scientific” myth that ozone forms a barrier to harmful UV rays from the sun, but this is also BULLSHIT. The ozone barrier keeps earth’s atmosphere from escaping into space. ",
            "date": "Answered April 11, 2019",
            "views": "761",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lisa Waguespack",
                    "user_href": "/profile/Lisa-Waguespack"
                },
                {
                    "user_id": "James Matkin",
                    "user_href": "/profile/James-Matkin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kunal",
                "href": "/profile/Kunal-509"
            },
            "answer_text": "It has been all over the news these days… however even if it has healed it is not related to lockdown due to corona virus. It is not that one of the advantage of lockdown is that Ozone layer has healed. I have found this video from Khan Study Group YouTube channel and it has explained properly.  #upsc #currentaffairs #dailycurrentaffairs #ozonelayerdepletion ",
            "date": "Answered May 20, 2020",
            "views": "59",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anton Carver",
                "href": "/profile/Anton-Carver"
            },
            "answer_text": "The ozone hole is recovering. A noticeable decline in ozone depletion since the Montreal Protocol came into force 30 years ago. It hasn’t fully recovered, there is still a hole, it is just smaller than before.  First Direct Proof of Ozone Hole Recovery Due to Chemicals Ban ",
            "date": "Answered April 11, 2019",
            "views": "222",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Varun Kumar Riat",
                    "user_href": "/profile/Varun-Kumar-Riat"
                },
                {
                    "user_id": "Ed Caruthers",
                    "user_href": "/profile/Ed-Caruthers"
                },
                {
                    "user_id": "Gary Leung",
                    "user_href": "/profile/Gary-Leung-44"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Trigaux (Yichard Muni)",
                "href": "/profile/Richard-Trigaux-Yichard-Muni"
            },
            "answer_text": "Not really. Healing has done significant progress, but will still take maybe a century, due to the high persistence of the freon molecules (and the leaks still occurring from ancient equipments). It has need recently detected some companies cheating with the rules. To be detectable at Earth level means that the effect is large. ",
            "date": "Answered April 15, 2019",
            "views": "58",
            "upvotes": " Answer requested by Andrew Lewis"
        },
        {
            "author_info": {
                "name": "John Wilder",
                "href": "/profile/John-Wilder-8"
            },
            "answer_text": "It was never damaged. They only had thinning at the poles and no where else. This because the earth spins on its axis at the poles which creates a vortex effect which in effect causes the thinning of the ozone and it was always variable with the seasons ",
            "date": "Answered April 11, 2019",
            "views": "12",
            "upvotes": " Answer requested by Andrew Lewis and Gary Leung"
        }
    ]
}