{
    "title": "Have humans discovered every part of earth? - Quora",
    "tags": [
        "Discoveries",
        "Earth (planet)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jyoti Sharma",
                "href": "/profile/Jyoti-Sharma-530"
            },
            "answer_text": "No, earth is still an alien planet and there is much to be discovered. 1. Earth’s mysterious underground superocean. We’ve only explored about 0.4% of the Earth’s total mass. It might turn out to be the mostinteresting 0.4%, but the fact remains that almost everything wemight ever find on Earth is underneath us. For all of human history, Earth’s explorers have been—quite literally—just scratching the surface. And this may actually turn out to mean that we’ve never been anywhere near Earth’s largest ecosystems. Geologists are increasingly certain that a massive ocean (or “hydrous mantle transition zone”), larger than all of Earth’s surface water combined, lies underneath us. It’s not at all unrealistic that this superocean might contain life; evenintelligent life isn’t completely beyond the realm of possibility. We’re talking about what may be a completely unexplored underground ecosystem, larger than the oceans of Europa and Enceladus combined, on a planet that wealready know to be habitable. What’s not to love? The trouble is that in some respects it’s actually much easier to travel through 390 million miles of space than it is to travel through six miles of solid rock. Over the next ten years, the JapaneseChikyüvessel will allow humans to directly access Earth’s upper mantle for the first time—by digging through the ocean floor to get to it—and thatmay give us evidence of life under the crust. Or it may not. Either way, this will only be the first step in the very long process of exploring the 99.6% of Earththat is as alien to us as the surface of any new world. 2. The upper atmosphere. September 2013, British molecular biologist Milton Wainwright flew a high-altitude balloon over England and found something he didn’t expect to see: algae floating 17 miles above Earth’s surface. We’re not sure how it got there, and until we have a solid theory we have no reason to assume that these algae are the only life forms we’ll find in the skies of Earth. 3. The ocean floor. A commonly-cited (and accurate) statistic that less than 5%of the ocean’s floor has been explored. There are two ways to read this figure: one is to look at the ocean as if it’s an aquarium, and to say that we’ve neglected the floor because everything interesting is swimming around inside it above the surface. But the other is to look at the ocean floor as if it were land, which it is, and realize that we still haven’t mapped over 95% of it. If we’d only mapped 5% of a continent, how well-explored would we say it is?Dry land only makes up 29% of Earth’s terrain; the rest of the surface is hidden from us by massive amounts of water. We don’t know what we’ll find at the deepest depths, though what we’ve already seen suggests that a lot of it is going to bereally freaking weird. 4. The frozen world. Global climate change has thawed outfresh mammoths,living megaviruses, and the mummified bodies of World War I soldiers. As this process continues, we’ll no doubt discover new forms of life—and veryold forms of life—buried, and preserved, underneath the ice. (That’s assuming the same warming process doesn’t kill us first, of course.) Studying these ancient, well-preserved remains before they decay is going to pose a challenge for scientists. 5. Our own bodies. In a very real sense, each of us is a walking planet full of diverse microbial ecosystems of unimaginable complexity. And there are more than seven billion of us.We’ve long known that we’re full of bacteria (collectively, the amount of bacteria in your body weighs about as much as your head), and the Human Microbiome Project has made strides towards cataloguing them. But now, scientists have uncovered evidence suggesting that there’s an undiscovered microbial ecosystem that includes bacteria-eating viruses that feed on our bacterial flora, and there’s no reason to believe that this is the last microbial surprise our bodies hold.While we’re working to discover evidenceof past microbes on Mars, we’re still discovering new things about the microbes that live in our pores and between our teeth. While we’re looking to explore the oceans of Enceladus and Europa, we’ve only just begun to explore the oceans of Earth’s crust—and we haven’t even touched the ocean of Earth’s mantle. And while we explore the skies of exoplanets for atmospheric biosignatures, our own atmosphere contains life that remains, on the whole,mysterious to us. It’s an exciting time tobe an astronomer, without question—butit’s also an exciting time to study the largely alien planet that produced us, and to meet the creatures who share it with us. For all of our advances in mapping this planet and cataloguing what we find on it, there’s still a great deal of exploring left to do. ",
            "date": "Answered December 24, 2017",
            "views": "38",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tierra M Wilson",
                    "user_href": "/profile/Tierra-M-Wilson"
                },
                {
                    "user_id": "Asim Kumar",
                    "user_href": "/profile/Asim-Kumar-30"
                },
                {
                    "user_id": "Abhirup Goswami",
                    "user_href": "/profile/Abhirup-Goswami-1"
                },
                {
                    "user_id": "Hetvi Gandhi",
                    "user_href": "/profile/Hetvi-Gandhi-7"
                },
                {
                    "user_id": "Shathik Hussain",
                    "user_href": "/profile/Shathik-Hussain"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jaisan Raj",
                "href": "/profile/Jaisan-Raj"
            },
            "answer_text": "There are a lot of areas that are yet to be discovered! 1. Earth’s mysterious underground superocean. We’ve only explored about 0.4% of the Earth’s total mass. It might turn out to be the most interesting 0.4%, but the fact remains that almost everything we might ever find on Earth is underneath us. For all of human history, Earth’s explorers have been—quite literally—just scratching the surface. And this may actually turn out to mean that we’ve never been anywhere near Earth’s largest ecosystems. Geologists are increasingly certain that a massive oceans, larger than all of Earth’s surface water combined, lies underneath us. It’s not at all unrealistic that this superocean might contain life; even intelligent life isn’t completely beyond the realm of possibility. We’re talking about what may be a completely unexplored underground ecosystem, larger than the oceans of Europa and Enceladus combined, on a planet that we already know to be habitable. What’s not to love? The trouble is that in some respects it’s actually much easier to travel through 390 million miles of space than it is to travel through six miles of solid rock. Over the next ten years, the Japanese Chikyü vessel will allow humans to directly access Earth’s upper mantle for the first time—by digging through the ocean floor to get to it—and thatmay give us evidence of life under the crust. Or it may not. Either way, this will only be the first step in the very long process of exploring the 99.6% of Earth that is as alien to us as the surface of any new world. 2. The upper atmosphere. In September 2013, British molecular biologist Milton Wainwright flew a high-altitude balloon over England and found something he didn’t expect to see: algae floating 17 miles above Earth’s surface. We’re not sure how it got there, and until we have a solid theory we have no reason to assume that these algae are the only life forms we’ll find in the skies of Earth. 3. The ocean floor. It’s a commonly-cited (and accurate) statistic that less than 5% of the ocean’s floor has been explored. There are two ways to read this figure: one is to look at the ocean as if it’s an aquarium, and to say that we’ve neglected the floor because everything interesting is swimming around inside it above the surface. But the other is to look at the ocean floor as if it were land, which it is, and realize that we still haven’t mapped over 95% of it. If we’d only mapped 5% of a continent, how well-explored would we say it is? Dry land only makes up 29% of Earth’s terrain; the rest of the surface is hidden from us by massive amounts of water. We don’t know what we’ll find at the deepest depths, though what we’ve already seen suggests that a lot of it is going to be really freaking weird. 4. The frozen world. Global climate change has thawed out fresh mammoths, living mega viruses, and the mummified bodiesof World War I soldiers. As this process continues, we’ll no doubt discover new forms of life—and very old forms of life—buried, and preserved, underneath the ice. (That’s assuming the same warming process doesn’t kill us first, of course.) Studying these ancient, well-preserved remains before they decay is going to pose a challenge for scientists. 5. Our own bodies. In a very real sense, each of us is a walking planet full of diverse microbial ecosystems of unimaginable complexity. And there are more than seven billion of us. We’ve long known that we’re full of bacteria (collectively, the amount of bacteria in your body weighs about as much as your head), and the Human Microbiome Project has made stride towards cataloguing them. But now, scientists have uncovered evidence suggesting that there’s an undiscovered microbial system that includes bacteria-eating viruses that feed on our bacterial flora, and there’s no reason to believe that this is the last microbial surprise our bodies hold. While we’re working to discover evidence of past microbes on Mars, we’re still discovering new things about the microbes that live in our pores and between our teeth. While we’re looking to explore the oceans of Enceladus and Europa, we’ve only just begun to explore the oceans of Earth’s crust—and we haven’t even touched the ocean of Earth’s mantle. And while we explore the skies of exoplanets for atmospheric biosignatures, our own atmosphere contains life that remains, on the whole, mysterious to us. It’s an exciting time to be an astronomer, without question—but it’s also an exciting time to study the largely alien planet that produced us, and to meet the creatures who share it with us. For all of our advances in mapping this planet and cataloguing what we find on it, there’s still a great deal of exploring left to do. ",
            "date": "Answered May 22, 2016",
            "views": "54",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Prathamesh Chavan",
                    "user_href": "/profile/Prathamesh-Chavan-38"
                },
                {
                    "user_id": "Ernest Official Music",
                    "user_href": "/profile/Ernest-Official-Music"
                },
                {
                    "user_id": "Mike Placentra",
                    "user_href": "/profile/Mike-Placentra-1"
                },
                {
                    "user_id": "Kieran Kelly",
                    "user_href": "/profile/Kieran-Kelly-9"
                },
                {
                    "user_id": "Paul Rothberg",
                    "user_href": "/profile/Paul-Rothberg"
                },
                {
                    "user_id": "Kulwant Bhogal",
                    "user_href": "/profile/Kulwant-Bhogal"
                },
                {
                    "user_id": "ELiane Odile Bacoyanis",
                    "user_href": "/profile/ELiane-Odile-Bacoyanis"
                },
                {
                    "user_id": "HRH George J Rickle IV",
                    "user_href": "/profile/HRH-George-J-Rickle-IV"
                },
                {
                    "user_id": "Gabriela Lebron",
                    "user_href": "/profile/Gabriela-Lebron-1"
                },
                {
                    "user_id": "Melissa Graham",
                    "user_href": "/profile/Melissa-Graham-66"
                },
                {
                    "user_id": "Charles P. Hobbs",
                    "user_href": "/profile/Charles-P-Hobbs"
                },
                {
                    "user_id": "Ian Chao",
                    "user_href": "/profile/Ian-Chao-1"
                },
                {
                    "user_id": "Jason Baxter",
                    "user_href": "/profile/Jason-Baxter-5"
                },
                {
                    "user_id": "Matt Brown",
                    "user_href": "/profile/Matt-Brown-507"
                },
                {
                    "user_id": "Vaishnavi",
                    "user_href": "/profile/Vaishnavi-92"
                },
                {
                    "user_id": "Allan Baker",
                    "user_href": "/profile/Allan-Baker-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harshit Kutaula",
                "href": "/profile/Harshit-Kutaula"
            },
            "answer_text": "There are still some places on Earth that have not been explored much by people. The ocean is one of these places. It covers more than 70% of Earth's surface, and it contains many types of ecosystems. We know a lot about some of these ecosystems, like the mangrove and kelp forests that surround our coastlines, and the polar seas at the North and South Poles. But we still have much to learn about remote and mysterious places like the deep sea. The technology we use to explore the ocean continues to get better and better. People can now send robotic Remotely Operated Vehicles (ROVs) to dive deep into the ocean. Scientists operate the \"robot\" from a ship on the ocean surface. At the seafloor, the ROV can take pictures and videos, and even use a robotic arm to collect water and rock samples.  A Remotely Operated Vehicle (ROV) explores the seafloor. The ROV brings back valuable information that scientists can use to help protect and conserve marine organisms and habitats. For example, in 2006, scientists sent an ROV deep into the Pacific Ocean off the coast of Washington State. They were able to learn more about deep-sea corals and sponges that can be easily damaged by commercial fishing equipment.  An ROV took these pictures of deep-sea corals and fish. Unlike the oceans, almost every place on land has been visited by people. By using new technology, scientists can now learn more about remote places that are difficult for us to travel to, such as areas that are very cold, very wet, very dry, or very high. In some of these places, scientists are also discovering new species! For example, in 1992, a new mammal species called the saola was discovered in the thick forests of Vietnam. (And some new species are even found in familiar places. In 2002, researchers found a new species of centipede living in the leaf litter in Central Park, New York City.) As we document and learn about plant and animal species around the world, we can help understand how they live and how we can best protect them. ",
            "date": "Answered November 26, 2018",
            "views": "921",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ayush Tripathi",
                "href": "/profile/Ayush-Tripathi-340"
            },
            "answer_text": "Definitely Not. Because 1.We discover 3.5 million types of living organism on earth but it is expected to more the 5.5 million is undercovered till now. 2.Large part of earth surface covers by ocean and we know only little bit about the deepest parts of ocean. Example: more than 4000 people climbed Everest and more than 500 people reach to space but not even 10 people reach the deepest part of space which is Mariana trench. So large part of it undiscovered till now. 3. We don't know exactly about where the water in our oceans come from. 4.we don't know exactly about our core and mental layers. ",
            "date": "Answered November 15, 2019",
            "views": "192",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ram (ராம்)",
                "href": "/profile/Ram-ராம்"
            },
            "answer_text": "No, we have not discovered all of the Earth. There are some places on earth, humans have not visited yet. Like the interior of the Earth, Deepest Sea and much more. Actually, we have much smaller knowledge about the environment and the surroundings we are living on. After all, we are young organisms on the face of the Earth, we still have long way to go to understand our whole home and the system. I hope we do soon. Thanks, Bala ",
            "date": "Answered December 24, 2017",
            "views": "642",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Pragati Shukla",
                    "user_href": "/profile/Pragati-Shukla-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nrusingha Behera",
                "href": "/profile/Nrusingha-Behera-1"
            },
            "answer_text": "How could it be claimed to have discovery of all of the earth, as earth being a planet has a vast no of molecular constituents forming it.Until and unless the each individual molecules of earth are touched,how could it be assumed for the discovery all of the earth. ",
            "date": "Answered December 24, 2017",
            "views": "301",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Richie Vargas",
                    "user_href": "/profile/Richie-Vargas-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Om Borkar",
                "href": "/profile/Om-Borkar-1"
            },
            "answer_text": "No. Not yet. Ocean levels rise and fall all the time. New islands that are actually underwater volcanoes emerge and fall all the time. And we don't even know about all of them. Also, nearly 90% of Earth's oceans are still undiscovered. _Om ",
            "date": "Answered December 24, 2017",
            "views": "584",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nabarun Mondal",
                    "user_href": "/profile/Nabarun-Mondal-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deepanshu Gupta",
                "href": "/profile/Deepanshu-Gupta-246"
            },
            "answer_text": "absolutely no…it is believed that only 30% of ocean is discovered…rest 70% is still undiscovered in the world.. ",
            "date": "Answered December 25, 2017",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Yasir",
                "href": "/profile/Yasir-50"
            },
            "answer_text": "Many people are still receiving PhDs in geology , I hope this answers your question . ",
            "date": "Answered May 29, 2016",
            "views": "236",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nowshad Hamid",
                "href": "/profile/Nowshad-Hamid"
            },
            "answer_text": "I don't think so ",
            "date": "Answered December 24, 2017",
            "views": "143",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hitaishi Katekhaye",
                "href": "/profile/Hitaishi-Katekhaye"
            },
            "answer_text": "No. ",
            "date": "Answered December 11, 2018",
            "views": "33",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sriindian",
                "href": "/profile/Sriindian"
            },
            "answer_text": "No ",
            "date": "Answered July 25, 2018",
            "views": "24",
            "upvotes": "0"
        }
    ]
}