{
    "title": "How are cathode rays produced in a cathode ray tube? - Quora",
    "tags": [
        "Cathode Ray",
        "Cathode Ray Tubes",
        "Physics of Everyday Life",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bill Lyons",
                "href": "/profile/Bill-Lyons-28"
            },
            "answer_text": "A cathode ray tube is a cone-shaped vacuum tube which has a tube containing an electrode affixed to the small end of the cone. This electrode is the cathode and is a small diameter metal tube that is coated with some rare-earth oxides that emit electrons when heated. Inside the metal tube is a coil of resistance wire which gets very hot when electrical current passes through it and thereby causes the cathode to emit electrons (sometimes called cathode rays) particularly when there is a large difference of potential between the cathode and an anode, the anode is always at a positive potential with respect to a cathode. The vacuum tube, as the name implies, maintains a high vacuum as any gas molecules would prevent the electrons from moving. The large end of the cone usually has a glass plate that is coated with some elements that emit light when bombarded with electrons. With the help of some deflection plates, the beam of electrons can be moved around the screen to produce a pattern or even a picture. ",
            "date": "Answered March 25, 2019",
            "views": "803",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bob Bushnell",
                "href": "/profile/Bob-Bushnell-2"
            },
            "answer_text": "The tube is so named because the electron beam is emitted from the cathode of the tube. The electron beam is accelerated by the anode. Various means have been used to direct the beam to the face of the tube. The term ‘cathode ray’ is meaningless. ",
            "date": "Answered March 18, 2019",
            "views": "109",
            "upvotes": " View Sharers"
        }
    ]
}