{
    "title": "How are intermolecular forces formed? - Quora",
    "tags": [
        "Intermolecular Forces"
    ],
    "response": [
        {
            "author_info": {
                "name": "Suresh Verma",
                "href": "/profile/Suresh-Verma-14"
            },
            "answer_text": "Intermolecular forces (IMF) are the forces which mediate interaction between molecules, including forces of attraction or repulsion which act between molecules and other types of neighboring particles, e.g., atoms or ions. Intermolecular forces are weak relative to intramolecular forces – the forces which hold a molecule together. For example, the covalent bond, involving sharing electron pairs between atoms, is much stronger than the forces present between neighboring molecules. Both sets of forces are essential parts of force fields frequently used in molecular mechanics. The investigation of intermolecular forces starts from macroscopic observations which indicate the existence and action of forces at a molecular level. These observations include non-ideal-gas thermodynamic behavior reflected by virial coefficients, vapor pressure, viscosity, superficial tension, and absorption data. Attractive intermolecular forces are categorized into the following types: Ion-induced dipole forcesIon-dipole forcesHydrogen bondingvan der Waals forces – Keesom force, Debye force, and London dispersion forceInformation on intermolecular forces is obtained by macroscopic measurements of properties like viscosity, pressure, volume, temperature (PVT) data. The link to microscopic aspects is given by virial coefficients and Lennard-Jones potentials. Intermolecular forces can also be described phenomenologically as occurring between permanent and instantaneous dipoles. A quantum view- Alternatively, one may seek a fundamental, unifying theory that is able to explain the various types of interactions such as hydrogen bonding,van der Waals forces anddipole-dipole interactions.Typically, this is done by applying the ideas of quantum mechanics to molecules, and Rayleigh–Schrödinger perturbation theory has been especially effective in this regard. When applied to existing quantum chemistry methods, such a quantum mechanical explanation of intermolecular interactions, this provides an array of approximate methods that can be used to analyze intermolecular interactions. One of the most helpful methods to visualize this kind of intermolecular interactions, that we can found in quantum chemistry, is the non-covalent interaction index, which is based on the electron density of the system. Ref.-Intermolecular force - Wikipedia ",
            "date": "Answered August 8, 2018",
            "views": "252",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Arno Vigen",
                "href": "/profile/Arno-Vigen"
            },
            "answer_text": "The main inter-molecular force is A) electrostatic proton-electron attraction for the bonding electrons which has an open path to the nucleus of two different atoms (thereby creating the two atom set).  That is why ‘open valence’ provides bonds. The electrons at the sides then provide repulsion creating a channel (or energy well) where the 2-atom a) have a specific angle for bonding, and b) side force to keep the bonding electron (outer electrons of atom #2) from going elsewhere.  The calculation is not so easy for a number of reasons: - B) there are no iron bars holding electrons, so they wobble, and rotate which make predictions imperfect (Quantum Mechanics) - C) the orientation of the nucleus matters because nucleon-electron ‘weak force’ is axial, anisotropic (static nucleomagnetics) repulsive-at-both-poles at 1/distance-cubed which is still the strongest at intra-molecular distances, and changes the calculation at inter-molecular bonding. At inter-molecule, A) electrostatic is more powerful, but the odd-shaped ‘bagel’ repulsion changes calculations with a f(theta) that ‘eats computer time’, especially given A). - D) that ‘weak force’ is repulsive, so an electron does not actually fall into a nucleus (electrostatic alone). Instead, it hits a magic-physics balancing point (modified Bohr radius) where electrostatic (A) at 1/distance-squared isotropic has equilibrium with weak force nucleomagnetics (C). At closer, the net is repulsive (physics-positive in the below), at farther, the electron is attracted back (physics-negative in the below). At slope <0 through 0, is a natural physics-equilibrium.  As you can see, the Electrostatic-alone goes to Negative Infinity (electrons fall into the nucleus). However, that is false. My discovery of this fix of subatomic forces is as revolutionary in physics and chemistry as the discovery of Planck for a calculation of separate electrons, to change thermodynamics — which (Rayleigh-Jeans) also predicted something going off to infinity.  This creates all the Elements building in settling positions for the electrons in 2 hemispheres (Pauli ‘spin’ pairs) with Shells (1st Quantum Number), inclination (2nd QN), latitiude (3rd QN), and two hemispheres (4th QN).  And a Periodic Table that gets better understanding of the outer shell 3D structure.  ",
            "date": "Answered August 14, 2018",
            "views": "169",
            "upvotes": " Answer requested by Chandan Sah",
            "upvoters": [
                {
                    "user_id": "Aidan Cooney",
                    "user_href": "/profile/Aidan-Cooney"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vidushi Mishra",
                "href": "/profile/Vidushi-Mishra-29"
            },
            "answer_text": "When two atoms ,ions ,or molecules are attracted to each other they form intermolecular forces. They do so because of polarity that arises between them, or electron transfer concepts like inductive effect, electronegativity difference ,resonance, hyperconjugation etc . The two molecules let be A and B are attracted to each other by electrostatic force of attractions . There are total 4 fundamental forces are present on earth which is applicable to all things present in universe. Due to the above forces nd reasons there is intermolecular forces are formed like in H bonding , methane molecule ,carbon dioxide etc. ",
            "date": "Answered August 7, 2018",
            "views": "59",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mike Jones",
                "href": "/profile/Mike-Jones-2528"
            },
            "answer_text": "1. London dispersion forces .... forces between all molecules. All molecules exhibit London dispersion forces, LDF's. The strength of LDF's is proportional to the polarizability of the molecule, which in turn, depends on the number of electrons and the surface area of the molecule. Contrary to what some teachers and even some authors say, in many cases London dispersion forces can be stronger than Keesom or Debye forces and are second only to hydrogen bonding.   2. Keesom forces (dipole-dipole attraction) ... the attraction of one polar molecule for another. Oppositely charged ends of the molecules undergo electrostatic attraction.   3. Debye forces (induced attraction) .... the attraction between a polar molecule and one which is nonpolar, where the polar molecule induces a charge separation in the nonpolar molecule. Debye forces can also exist between two polar molecules, even the same kind of molecule.   4. Hydrogen bonding .... The weakly covalent bonds found between the hydrogen atom of one molecule where it is bonded to N, O or F, and the N, O, or F of an adjacent molecule. The hydrogen atom functions as a bridge, forming a bond between two molecules. Hydrogen bonding is more than an electrostatic attraction between molecules, instead there is evidence of orbital overlap and covalent bond formation.   Note: There are three van der Waals forces (Keesom forces, Debye forces and London dispersion forces). Some textbooks and some teachers' dusty old notes erroneously equate van der Waals forces only with London dispersion forces. ",
            "date": "Answered August 6, 2018",
            "views": "442",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Aidan Cooney",
                    "user_href": "/profile/Aidan-Cooney"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aidan Cooney",
                "href": "/profile/Aidan-Cooney"
            },
            "answer_text": "They can be formed by electronegativity differences in particular bonds, which may result in dipole moments,in a particular molecule. This can induce temporary polarity in nearby molecules They maybe only temporary due to electron density on a part of a molecule at a certain time. or they maybe induced by other molecules, or nearby bonds in which there is substantial electronegativity difference. There are also ion-dipole interactions but I’m no expert and I’m not sure if they fit in here. There are a few people here who seem to be a great deal more knowledgable in this area than me and have given some very good answers! Pisgachemist has given an excellent account of the different types and names of these forces in another answer to this question! ",
            "date": "Answered August 7, 2018",
            "views": "105",
            "upvotes": " Answer requested by Chandan Sah"
        },
        {
            "author_info": {
                "name": "Nishant Yadav",
                "href": "/profile/Nishant-Yadav-377"
            },
            "answer_text": "It all flows from this general principle: as bonds become more polarized, the charges on the atoms become greater, which leads to greater intermolecularattractions, which leads to higher boiling points. Ionic bonds > H bonding > Van der Waals dipole-dipole interactions > Van der Waals dispersionforces. ",
            "date": "Answered August 10, 2018",
            "views": "54",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steve Ruis",
                "href": "/profile/Steve-Ruis"
            },
            "answer_text": "In chemistry all forces between atoms are the same. The nucleus of one atom is attracted to electrons of an adjacent atom and vice-versa. The forces between atoms within molecules are stronger than between molecules, so when energy is added it is easier for the molecules to be pulled/driven apart than for the atoms within the molecules to be pulled/driven apart. ",
            "date": "Answered August 6, 2018",
            "views": "51",
            "upvotes": " View 1 Upvoter "
        }
    ]
}