{
    "title": "How would you describe a scientific experiment? - Quora",
    "tags": [
        "Experiments",
        "Descriptions",
        "Scientific Research"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Ranieri",
                "href": "/profile/Michael-Ranieri-2"
            },
            "answer_text": "How would you describe a scientific experiment? I would describe it as others who lived before me have, without too much variation - unless I have forgotten something, yet with my own spin. Please comment if I have omitted anything or if you disagree! To describe accurately, perhaps uniquely and competently, a hypothesis that can be tested.To define and frame the dependent and independent variables.To manipulate and control a variable accurately without confusing which is the dependent or which is the independent.To describe and record measures and observations taken that can be replicated anywhere else by anyone else without further conditions other than stated within the framing of the experiment.To intelligently discuss the results and possible implications without claiming absolutism or axiomatic findings.I also feel that we are approaching the demise of this methodology which served humanity for many centuries. Data-mining and the analysis of such mountains will probably supercede the method I tried to describe above, especially when applied research is the only goal. Still, I try to remain optimistic. I hope pure research may find some sort of equitable overlap or accomodation. ",
            "date": "Answered February 13, 2018",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jace Webster",
                "href": "/profile/Jace-Webster"
            },
            "answer_text": "In my opinion, which matters little, a scientific experiment should be an attempt to prove your hypothesis incorrect. A hypothesis is a predicted answer to a question. If (and unfortunately, when) a researcher seeks to design a study that will support their prediction (which seems to be how many people view scientists), their results typically are not overly interesting. Their results, after all, simply support something that could have been predicted without doing the experiment in the first place (although having proof is nice). I would suggest that a researcher should look at existing data, form a question about it, predict an answer, and then try their hardest to design a study that will prove themselves wrong. If the hypothesis turns out to be supported by the data they produce, even after all their efforts to prove themselves wrong, then great. Go publish your results! If the hypothesis turns out to not be supported by the data, even better! The researcher now has the opportunity to ask “Why does my data contradict all previous relevant data and predictions?” It is in trying to answer that question that real, interesting progress is often made. ",
            "date": "Answered February 14, 2018",
            "views": "780",
            "upvotes": "0"
        }
    ]
}