{
    "title": "How long do dogs stay in heat? - Quora",
    "tags": [
        "Dogs (pets)",
        "Pets"
    ],
    "response": [
        {
            "author_info": {
                "name": "Katie Bjorkman",
                "href": "/profile/Katie-Bjorkman"
            },
            "answer_text": "It depends on what you mean by “heat.” The way that most people use the word, including the discharge phases of proestrus, estrus, and diestrus. Each of those phases lasts “more or less” a week in most dogs - three weeks total where there may be discharge and where she will be attractive to males. However, only the middle part - the estrus - is when she will accept mating and can become pregnant. BUT… because a dog’s cycles are not going to be identical across dogs, or even two cycles in the same dog, wisdom dictates that the female be carefully confined as if she was in estrus from the first sign of swelling/discharge until at least three weeks have passed and she has no visible signs of being in heat remaining. ",
            "date": "Answered December 4, 2016",
            "views": "27",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Iris Harpe",
                    "user_href": "/profile/Iris-Harpe"
                },
                {
                    "user_id": "Flo Tabbada",
                    "user_href": "/profile/Flo-Tabbada"
                },
                {
                    "user_id": "Abraham Muñoz",
                    "user_href": "/profile/Abraham-Muñoz-3"
                },
                {
                    "user_id": "Rajesh Kannan",
                    "user_href": "/profile/Rajesh-Kannan-140"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elizabeth Williams",
                "href": "/profile/Elizabeth-Williams-238"
            },
            "answer_text": "It depends on the individual dogs and its breed. How long does a dog stay in heat will depends on their sex. The female dog will undergo through heat into twice a year. Their timings to undergo through it is seasonal, it occurs with two annual cycles.  It occurs between January and March or August and October. A small dog will undergo through heat three times a year. Dogs like the cocker spaniel, fox terrier undergo through it thrice a year. Some giant breed or largest dogs breeds like mountain dog, Irish wolfhounds, shepherd dog will undergo to heat once in every two years. ",
            "date": "Answered August 1, 2017",
            "views": "397",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jake Rae DeMorre",
                    "user_href": "/profile/Jake-Rae-DeMorre"
                },
                {
                    "user_id": "Peadar Cremin",
                    "user_href": "/profile/Peadar-Cremin"
                }
            ]
        }
    ]
}