{
    "title": "How can an object lose kinetic energy, but keep momentum? Especially if the collision stops the object? - Quora",
    "tags": [
        "Collisions (physics)",
        "Momentum (physics)",
        "Kinetic Energy",
        "Energy (physics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "JT Law",
                "href": "/profile/JT-Law"
            },
            "answer_text": "In this case, you can’t really think about “the object” — you have to think about the system of objects that transfer energy and momentum between them during interactions. If you’re asking a question like this, I’m going to assume you’re in high school (not a put-down or anything, just trying to figure out where you are). In a typical high school collision problem, both objects are more-or-less free to move around, so we’re not talking about smashing cars into brick walls or anything. Let’s say you have two toy cars that are free to roll on a track. One is moving towards the other, which is at rest, and when they collide they make a sound. Depending on the masses of the cars relative to each other, the first one might bounce and roll backwards after the collision, or if it’s much more massive, it’ll hit the stopped car and continue moving forwards, albeit slower. If you add the momenta of both the cars before the collision, and compare it to the total momentum of the system after the collision, assuming you’ve taken the vector nature of momentum into account, you should end up (ideally) with the same amount, before and after. When my students do an experiment to test this out, if they do it right, with decent equipment, they’ll usually get somewhere around 95% of it conserved. But, if you do the same thing for the kinetic energy, you’ll probably found that you’ve lost a decent amount of it, through the collision. It’s not like this energy just disappeared, though; because of the collision, you’ve lost kinetic energy, but that’s been turned into the sound energy that you hear, and some of the energy may have been absorbed by the cars to deform them (whereupon friction between particles inside the car turns it all into heat anyway). With our lab equipment, this type of collision ends up seeing about half the kinetic energy going away. So, in conclusion… you have to think bigger than just “the object,” because it’s part of the rest of the universe. ",
            "date": "Answered September 16, 2018",
            "views": "333",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abu-Bakir Waissi",
                    "user_href": "/profile/Abu-Bakir-Waissi-1"
                },
                {
                    "user_id": "Gregg Gray",
                    "user_href": "/profile/Gregg-Gray-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kaiser Tarafdar",
                "href": "/profile/Kaiser-Tarafdar"
            },
            "answer_text": "Conservation of momentum occurs everywhere. There is a lot to talk about aside from what is in the question ! In the above example such as ball hitting a wall, the energy is dissipated as impact energy, sound, heat, and imparting of some of the kinetic energy to the wall material with vibrations taking place that distribute the energy out. The intial kinetic energy of the ball gets converted to all the energy forms as described above. But momentum conservation can not be well demonstrated here as the wall did not move tangibly after the collision ! It does not violate the conservation of momentum law at all as that deals with moving bodies pre and post collision where velocities pre and post collision can be measured. Now as you realize the ball will experience Newton’s third law and recoil with a certain velocity, and the wall will not move macroscopically. So you can not really measure the post-collision velocity of something like a rigid wall, except to calculate a theoretical velocity of the entire mass of the wall that could shed some interesting light, but it will not correlate well due to uncertainties of estimating the actual physical instantaneous ‘velocity potential’ rather than a true velocity since the object is rigid !! You must have measurable pre and post collision velocities to demonstrate this fundamental law of conservation of momentum as stated by the great Sir Isaac Newton. There are certain aspects of moving bodies that are not talked about much that can, in real life, affect the expected conservation of momentum apparently as a result of loss of energy due to friction, the impact of collision, the sound and heat produced, etc. Let’s look at some classical physics situations first. On a near-perfectly smooth surface with no significant friction when balls roll and hit each other the conservation of momentum is perfect in all practicality. Now if the surface is rough, a lot of kinetic energy will get spent in overcoming the friction, and the velocities will go down substantially as the balls travel on the rough surface before they hit each other. If you take the initial velocities that the balls started out with then the momentum conservation will not manifest, or will look violated, as obviously the velocities of the striking balls will have diminished substantially and the final total momentum will not equal the initial total momentum ! It will be much less ! So how then is this conservation law true ?? Well for reasons that should be clear, on non-smooth surfaces you must take into account the existing velocities only at the time of the impact, not what the balls started out with. That will show you that the total momentum just at the time of striking, is equal to the total momentum just after striking ! So for rough surfaces you can’t use the intial velocities that the balls start out with before they hit each other ! You have to use the velocities at the time of the collision to show the conservation of momentum. In other words you have to eliminate the confounding variables. This very very important aspect that can cause confusion and wrong results is hardly ever well written and explained in physics textbooks unfortunately ! Now if you switch to space where there is no friction, the conservation of momentum between large striking bodies will be perfect, as what is also known to be in the world of free atoms, molecules, and fundamental particles. In particle physics conservation of momentum between striking particles is perfect. Does the conservation of momentum equally apply to massless partcles such as photons, gravitons, and some neutrinos ??? This brings up some interesting conjectures : What happens when a photon strikes another photon, both traveling at speed c, can they affect each other’s momentum ? Can they attain speeds greater than light-speed ??? What if they strike each other from directly opposite directions rather than say at an angle ?? (They will not be able to strike each other along the same direction both moving at speed c as one can not gain over the other as their relative velocity will be zero with respect to each other !). If they somehow combine (let’s assume so) will they show conservation of momentum still or violate it somehow, as well as violating the invariant speed of light in vacuum especially if they remain discreet after the ‘collision’ ?? There is always conservation of momentum even with massless partcles or bosons. Interestingly two striking photons may produce electron-positron pairs with energy to mass conversion spontaneously, so energy will be conserved and intrinsically total momentum will be conserved also but with different converted particles in space and time of the locale where the two-photon collision occurred !! This is a very different scenario than in classical physics where a mass can not transform into something else, but even here in the quantum world the conservation laws reign from all that is known ! Nature prevents the violation of the energy and momentum conservation, and the invariance of light speed by producing other entities that are needed, and that can carry some of the energy and the momentum of the initial colliding particles with no loss of any of the above two quantities in the process… Philosophically speaking from the scientific considerations it appears that nature uses its own imposed limitation such as the invariant speed of light into a valuable machinery for the creation of matter constituents out of energy all the time, thus putting its limitation to great use through the conservation laws at the fundamental subatomic level !! It is quite thought provoking to say the least… I will describe a thought experiment that may be tested to see if it yields what can be theoretically thought of. Let us say we have the technology to strike a photon with another photon, or a conglomerate of photons going in a certain direction with another conglomerate going in a predetermined different direction under our control in a highly advanced experimental setting, starting off at different angles gradually from near zero angle to 180 degrees, that is from the opposite directions(head on I mean), and be able to detect what particles are liberated(electron-positron pairs, other virtual particles, etc), then we may find that out that when the collisions are from exactly opposite directions, that is when the greatest number of electron-positron pairs, and other virtual particles are generated… Conversely when the collisions are at a very low angle, the least amount of such particles are generated !! When the collisions are head on between photons from opposite directions, not only the energy exchanges can be the most intense, with increased potential waste, but there is a lot more ‘potential for violation’ of the invariance of light, which never occurs but the “situational potential” (a term I am using with some objectivity) is used by nature to generate the maximum number of other partcles such as electron-positron pairs and other virtual particles to make use of the situation and keep things under great control through the conservation laws, and make the situation productive !! This is a thought experiment of mine that I included here where I am trying to, in some ways, make a marriage of some of the ideas in quantum mechanics with classical physics ideas philosophically speaking with scientific considerations… Kaiser T, MD (Life long physics, math, cosmology, and science proponent). ",
            "date": "Updated September 20, 2018",
            "views": "673",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Asd Qwe",
                    "user_href": "/profile/Asd-Qwe-92"
                },
                {
                    "user_id": "Maritza Garcia",
                    "user_href": "/profile/Maritza-Garcia-4"
                },
                {
                    "user_id": "Tiffany Cheng",
                    "user_href": "/profile/Tiffany-Cheng-2"
                },
                {
                    "user_id": "Amal Pushp",
                    "user_href": "/profile/Amal-Pushp-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Olson",
                "href": "/profile/John-Olson-47"
            },
            "answer_text": "An object that loses momentum also loses kinetic energy. Momentum = mass * velocity = m* v KE = 1/2 m v^2 if v decreases, both KE and p (momentum) decrease. A SYSTEM can lose kinetic energy but keep momentum, because a system has more than one object. In an inelastic two body collision, for example, in which initially one object is at rest and is struck by and ends up stuck to a second object, momentum is the same before and after the collision but the total kinetic energy is less after the collision. This is possible because one object speeds up and one slows down, so one loses p and the other gains p. But because KE depends on v^2, KE is not necessarily the same before and after the collision. To convince yourself, do the math for a simple inelastic collision where mVo = (m +M)Vf KEo = 1/2 m (Vo)^2 KEf = 1/2 (m+M) (Vf)^2 but we know that Vf = m/(m +M) Vo and m/(m+M)<1 so Vf is less than Vo and KE is lost. ",
            "date": "Answered September 16, 2018",
            "views": "201",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David W. Vogel",
                    "user_href": "/profile/David-W-Vogel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Plamen Vassilev",
                "href": "/profile/Plamen-Vassilev"
            },
            "answer_text": "You are confusing momentum of an individual object with a momentum of a (closed) system of objects. The momentum of a closed system, which is not experiencing any net external forces or torques is conserved. The individual momenta of particles within the system may not be conserved, but the total system momentum is. ",
            "date": "Answered September 16, 2018",
            "views": "118",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pranav Prabhu",
                    "user_href": "/profile/Pranav-Prabhu-15"
                },
                {
                    "user_id": "David W. Vogel",
                    "user_href": "/profile/David-W-Vogel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vinayak Kulkarni",
                "href": "/profile/Vinayak-Kulkarni-38"
            },
            "answer_text": "It doesn't really keep the same momentum. but, momentum is conserved or in other words the collided body gets a partial share of it's momentum. ",
            "date": "Answered September 16, 2018",
            "views": "80",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Varun Kumar",
                    "user_href": "/profile/Varun-Kumar-579"
                },
                {
                    "user_id": "Poornima Kulkarni",
                    "user_href": "/profile/Poornima-Kulkarni-16"
                }
            ]
        }
    ]
}