{
    "title": "How massive does something have to be to have a noticeable gravitational pull? - Quora",
    "tags": [
        "Gravity",
        "Astrophysics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alexander Orr",
                "href": "/profile/Alexander-Orr"
            },
            "answer_text": "I'm assuming that by this you mean how big would an object floating around in space have to be for you, standing on it, not to feel completely weightless. How light is \"light\"? If you were to weigh exactly the same as a feather (which, let's face it, is a pretty good start) and I'm gonna assume for the sake of ease that a feather is 0.8 grams and that you weigh 80kg. In order for you to weigh 100,000 times lighter than you do now, the gravitational field strength must be 100,000th of the size as on earth: 9.8x10^-5 Nkg^-1. Plug this answer into the equation g= (Gm/r^2) would give the correct answer however, we first need to identify a mass or rather, a density. I'm going to let you do this bit: rearrange the equation so that you can use density (mass per unit volume) and select a density you want to use (I'm going to work this out myself using Silicon as it is the most abundant material in the Earth's crust). You should still have a radius to work with but the mass function should have gone (try expressing the mass as density times volume and use the volume of a sphere as your volume). Then use your radius to find the volume. Let me know how you get on. ",
            "date": "Answered December 6, 2015",
            "views": "561",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jonah Kipp",
                    "user_href": "/profile/Jonah-Kipp-1"
                },
                {
                    "user_id": "James Joseph",
                    "user_href": "/profile/James-Joseph-442"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevin Dwyer",
                "href": "/profile/Kevin-Dwyer-7"
            },
            "answer_text": "Anything with mass has gravity. How strong an attraction do you want? Two specks of dust, miles away from each other in Deep Space (nothing else around for several million miles) will still feel the feeble gravitational pull of each other. We may not be able to detect it with our current instrumentation, but we can prove mathematically that they attract each other. It appears that once an object reaches somewhere in the neighborhood of 600 miles in diameter, the gravity is stronger than the material, and the object tends to become spherical. This can vary wildly with the type of material involved, and how tightly it is packed to begin with, but we have to start somewhere. We have found small asteroids that have smaller objects orbiting them (orbiting as per the gravitational constraints) so we might call them moonlets. But these asteroids still don’t have much gravity, by our human standards. You couldn’t walk on one, for instance. As soon as you pushed with a toe, you’d be off on a loooong arc before coming ‘down’. Again, all objects have gravity. The bigger the item, the greater the force. Humans need something like at least our Moon, to even survive long-term. We probably have a maximum G (force of gravity) we can live with too. I’d say 10 to 15% higher gravity might be the human long-term limit, but that is just a guess. Gravity is no laughing matter. ",
            "date": "Answered February 17, 2020",
            "views": "14",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rich Gore",
                    "user_href": "/profile/Rich-Gore-1"
                },
                {
                    "user_id": "Jo Gullin",
                    "user_href": "/profile/Jo-Gullin"
                },
                {
                    "user_id": "Joseph John Zita",
                    "user_href": "/profile/Joseph-John-Zita"
                },
                {
                    "user_id": "Douglas Ivey",
                    "user_href": "/profile/Douglas-Ivey-1"
                },
                {
                    "user_id": "Artur Johny",
                    "user_href": "/profile/Artur-Johny"
                },
                {
                    "user_id": "Henrik Ladholm",
                    "user_href": "/profile/Henrik-Ladholm"
                },
                {
                    "user_id": "Enrique Ibarra",
                    "user_href": "/profile/Enrique-Ibarra-3-1"
                }
            ]
        }
    ]
}