{
    "title": "How does molecular weight of a chemical compound affect its boiling and melting points? - Quora",
    "tags": [
        "Melting",
        "Boiling"
    ],
    "response": [
        {
            "author_info": {
                "name": "Elbert Timothy",
                "href": "/profile/Elbert-Timothy"
            },
            "answer_text": "Heavier molecules means that there are more atoms that compose it or the atoms that compose it are heavier. Heavier atoms or more atoms in the molecule means more electrons. Boiling and melting points are determined by intermolecular forces. The intermolecular force affected by mass is Van Der Waals’ forces or also known as instantaneous dipole forces and induced dipole forces. Via quantum mechanical effects, an electron’s position in its orbital is uncertain. Hence, there will be times that more electrons are going to be at one side of a molecule than the other. This generates a dipole in the molecule where one side is more negative than the other. This is the “instantaneous” part. When this happens, the negative charge will push electrons away from the side of another molecule closest to that molecule’s negative pole. Now, the other molecule’s side closest to it is electron deficient hence will have a slightly positive charge and opposite charges attract. This is the “induced” part. This effect perpetuates throughout substance. The more electrons you have, the larger is the negative or positive charge generated when the instantaneous part is going to happen. Hence, attraction between molecules is going to be stronger. Thus, higher melting and boiling points. ",
            "date": "Answered March 5, 2017",
            "views": "54",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rupa Thakkar",
                    "user_href": "/profile/Rupa-Thakkar-4"
                },
                {
                    "user_id": "Shashank Devarmani",
                    "user_href": "/profile/Shashank-Devarmani"
                },
                {
                    "user_id": "Deli E",
                    "user_href": "/profile/Deli-E"
                },
                {
                    "user_id": "Dylan Rodrigues",
                    "user_href": "/profile/Dylan-Rodrigues-5"
                },
                {
                    "user_id": "Angela Yzy",
                    "user_href": "/profile/Angela-Yzy"
                },
                {
                    "user_id": "ΠΑΝΑΓΙΩΤΗΣ ΧΑΣΑΠΗΣ",
                    "user_href": "/profile/ΠΑΝΑΓΙΩΤΗΣ-ΧΑΣΑΠΗΣ"
                },
                {
                    "user_id": "Adam Man U Soudan",
                    "user_href": "/profile/Adam-Man-U-Soudan"
                },
                {
                    "user_id": "Dan Calvano",
                    "user_href": "/profile/Dan-Calvano"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charles Kanakam",
                "href": "/profile/Charles-Kanakam"
            },
            "answer_text": "Mol. Wt. is related to no. and nature of atoms present and the overall size. The forces of attraction depends on the the size. The boiling point depends on the inter molecular forces. M.pt depends on the size and shape of molecule as these determine the packing in the crystal and lattice energy. ",
            "date": "Answered February 14, 2020",
            "views": "258",
            "upvotes": "0"
        }
    ]
}