{
    "title": "How does NaCl structure differ from a standard FCC stucture? - Quora",
    "tags": [
        "Sodium Chloride",
        "Inorganic Chemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kevin Jong Hun Kang",
                "href": "/profile/Kevin-Jong-Hun-Kang"
            },
            "answer_text": "Let’s go into a deep dungeon of crystallography. Easy answer: NaCl has two different ions (one at origin, the other at the center of unit cell), while the standard FCC is only one. Complete answer: both NaCl and a standard FCC structure belong to the space group Fm-3m. And Fm-3m has two distinguished Wyckoff positions with a multiplicity 8. One at (0,0,0) and the other at (1/2,1/2,1/2) The difference between the two is that, in a standard FCC, only one of them are occupied, while in NaCl, both of them are occupied by crystallographically different ions. Face-centered cubic (FCC, 23F) is one of 14 Bravais lattices. And among 230 space groups, 11 space groups (F23, Fm-3, Fd-3, F432, F4_132, F-43m, F-43c, Fm-3m, Fm-3c, Fd-3m, and Fd-3c) belong to the Bravais lattice of FCC. It is hard to define the standard FCC structure, if you are imagining the crystal structure of copper metal (Cu) as that standard of FCC, here it is.  (ⓒ Copper\"crystal structures [WebElements Periodic Table]) So let’s define this as the standard FCC structure. This structure belongs to the space group Fm-3m having the highest symmetry among the eleven FCC space groups.  (ⓒ https://chem.libretexts.org/LibreTexts/Howard_University/General_Chemistry%3A_An_Atoms_First_Approach/Unit_2%3A__Molecular_Structure/Chapter_4%3A_Ionic_Bonding/Chapter_4.1%3A_Ionic_Bonding) So does NaCl. NaCl also belongs to the same space group Fm-3m. To see the difference, visit this page of the table of Wyckoff positions of the space group Fm-3m. You will see a gross list of coordinates. Ignore them. Just scroll down. You will see the simplest last two rows labelled with Wyckoff letters a and b. In NaCl, both of them are occupied by different atoms. In Cu metal, only one of them are occupied. We have so many natural substances that have two different ions/atoms occupying the two Wyckoff positions of multiplicity 8 of the space group Fm-3m. Since we have so many similar examples in nature, like NaCl, we decided to give a special name to such structures: Rock-salt structure. (most rigorous definition of the rock-salt structure) ",
            "date": "Answered June 29, 2017",
            "views": "56",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tanuja Sharma",
                    "user_href": "/profile/Tanuja-Sharma-101"
                },
                {
                    "user_id": "Arush Sharma",
                    "user_href": "/profile/Arush-Sharma-31"
                },
                {
                    "user_id": "Archana Sharma",
                    "user_href": "/profile/Archana-Sharma-826"
                },
                {
                    "user_id": "JJ",
                    "user_href": "/profile/JJ-1665"
                },
                {
                    "user_id": "Rushabh Chalke",
                    "user_href": "/profile/Rushabh-Chalke"
                },
                {
                    "user_id": "Safoora Ashraf",
                    "user_href": "/profile/Safoora-Ashraf-1"
                },
                {
                    "user_id": "Madhur Rao",
                    "user_href": "/profile/Madhur-Rao-1"
                },
                {
                    "user_id": "Sarvesh Chakraborty",
                    "user_href": "/profile/Sarvesh-Chakraborty-3"
                },
                {
                    "user_id": "Ajijul Hakim",
                    "user_href": "/profile/Ajijul-Hakim"
                },
                {
                    "user_id": "Samuel Soohoo",
                    "user_href": "/profile/Samuel-Soohoo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Specker",
                "href": "/profile/Chris-Specker"
            },
            "answer_text": "To begin with, standard FCC structure consists of only one type of atom. Second, The FCC structure contains holes at the middle of each edge of the unit cell, as well as the unit cell’s center. You can, however, think of the NaCl structure as two FCC structures superimposed on one another, with one FCC lattice containing Na+ ions and the other lattice made up of Cl- ions. The Cl- lattice would have to be offset from the Na+ lattice by half a unit cell length along a primary axis. (Alternatively, you could offset along the body diagonal by half its length, but not a face diagonal.) This is still a bit of an approximation, because the Cl- ions only contact the ions in the Na- lattice (and vice versa), where in a true FCC lattice the holes do not prevent the atoms at the center of each face from contacting the corner atoms. ",
            "date": "Answered July 22, 2016",
            "views": "25",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sadib Fardin",
                    "user_href": "/profile/Sadib-Fardin"
                },
                {
                    "user_id": "Ajijul Hakim",
                    "user_href": "/profile/Ajijul-Hakim"
                },
                {
                    "user_id": "Toufik Zisan",
                    "user_href": "/profile/Toufik-Zisan"
                }
            ]
        }
    ]
}