{
    "title": "How many waves will there be to COVID-19 reopening? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Virginia White-Gaul",
                "href": "/profile/Virginia-White-Gaul"
            },
            "answer_text": "According to the latest I’ve read from the experts, there’s no counting them. They’ve all (from around the world) already counted over a million cases and they’re fully expecting a new, more serious wave to hit in the fall. I heard Fauci say that the second outbreak will see a much higher contagion and death rate due to the easing of restrictions and states reopening too soon. It’s just a bad situation for all of us to be in. I know as well as anyone that we need to get back to work; I need to get back to work, and I need my business to reopen. But I’m not willing to die to do either. I have three pre-existing conditions that make me an especially vulnerable candidate for serious illness or death from Covid-19; I’m fully aware that we all have to die sometime, but I don’t want to do it now, and I don’t want it to happen while I’m attached to a ventilator because I can’t breathe. The federal government is a joke during this time. They’re no help at all. I’m listening to the experts and to our governor, who really has been working his butt off to keep Maryland both as safe as possible and as well-equipped for a new and more severe outbreak by doing anything and everything he can to restock the healthcare systems and workers with an adequate amount of safety equipment and ventilators and space to use in the event the hospitals can’t take the overflow. Larry Hogan is a Republican—the first GOP governor in Maryland history to be re-elected—but he’s not a Trumpster, nor does he care what Trump thinks. Even Democrats like him because he doesn’t play partisan politics, ever, and he cares first and foremost about the people of Maryland. He’s taken a lot of criticism from Trump because of his refusal to reopen until the numbers align with what the experts recommend, and he doesn’t care. He will not let Maryland die. I’m unaffiliated so I’m not a Republican or a Democrat, but I lean left politically and I love Hogan. It’s rare, especially now, to find a leader who actually cares more about the people they’re supposed to be serving than they do about their party—-and particularly about what Trump thinks as opposed to what’s best for the people. I have to admit that I get annoyed with all these protesters toting their AR-15s and waving “Don’t Tread On Me” flags and storming the steps of state Capitol buildings, claiming that their “rights are being taken away” by their state governments’ imposing mandatory lockdown or restrictions when they’re out of their homes. Nobody’s “rights” are in any danger of being taken away. This is not a permanent situation, and their (and everybody’s) “rights” end where someone else’s begin. They do not have the “right” to expose themselves (deliberately) to a killer virus and spread it to anyone they come into contact with; everybody else has the “right” to live, too. But it doesn’t really surprise me that these people are doing this; most of them are Trumpsters, and Trump wants the economy back. Period. At any cost. It’s the only thing he has to run on in November. It doesn’t matter to him if 70% of the country dies as long as the economy gets better. He’s stupid, because he ought to care; some of the most vulnerable people to infection and death are his own voters. If they’re all dead by November 3, he’s not going to have enough sheep in his flock to win. He’s been pushing and prodding the states to reopen even as their contagion and death rates spike, and he obviously takes the side of all these “liberty” morons who, I think, just really don’t get why reopening before we’ve flattened the curve is a bad idea. They’re only thinking of themselves—just as their lord and master is telling them to do. Now that it’s been proven that the White House is as likely to breed infection as anywhere else, maybe he’ll change his tune—but I doubt it. Trump would rather see the inside of the Oval Office again, even if the very people who support him are in body bags stuffed into refrigerator trucks—which will mean that there’ll be fewer and fewer people willing to defend whatever he screws up. But he doesn’t have enough smarts to see the big picture. The way he’s trying to politicize this deadly pandemic is so far removed from what a “real” president would do in a situation like this that more and more people who used to be behind him are seeing the mistake they made—maybe, finally, some of them will wake up. His base won’t; they think he.’s God’s Chosen. But some Republicans with still-functioning brains might—we’ll just have to hope. But back to the question, states all over the country are reopening too soon. The experts are 99% positive that the coronavirus is going to spread a lot more—-and that the results are much worse than they were this time—as states whose stats haven’t improved yet reopen and the second wave hits. I completely understand that the economy needs to get going again, but what all these “reopeners” don’t seem to realize is that it’s not going to help the economy if nobody feels safe going into these establishments and spending money on whatever they’re selling. The latest polls show that a huge majority of people are still staying home despite the relaxation of the directives. Nobody feels comfortable eating at a restaurant or going to the movies or shopping at retail stores or even going to get a haircut, as much as they feel they need one. The CEOs and owners of some businesses that opened the first weekend in May complained that the businesses had lousy consumer responses that weekend. If nobody comes in to spend money (and if the 20% of the population that’s now unemployed don’t have any money to spend), it’s not going to improve the economy much—-and if reopening facilitates a second, even more virulent wave of Covid-19, which all the disease-control experts say is going to happen—they’re just going to have to close again, probably for good this time. Reopening businesses doesn’t mean they’re going to prosper, and if they don’t, they’re going to lose investors as well. My personal opinion is that we need to focus most on finding a successful treatment for covid-19, rather than racing to find a vaccine. This kind of coronavirus isn’t going to go away any time soon; a vaccine that absolutely protects people from getting it is a very long way away. I think we’re going to just have to adjust ourselves to living with the coronavirus in our midst, the same as we had to do when HIV first appeared. If adequate testing and contact tracing can be developed and if we just realize that social distancing is “the new normal” for now, then once an effective treatment is found so that it’s no longer “deadly,” we’ll be able to open the economy and not have to resort to lockdown measures or lose any more lives. Certainly we need a vaccine and I doubt that they’re going to stop working on one, but—given the experts’ opinions that that’s going to take a lot of time and that, even were one to be developed, it’s going to need to go through a long and complicated testing and trial-and-error procedure—a successful treatment for covid-19 is going to be of much more help when it comes to learning to live with the fact that SARS-CoV-2 is still out there and probably will be for some time. Let’s all just hope that that happens soon. I want to get back to living, too—but “living” is the operative word here. ",
            "date": "Answered May 12, 2020",
            "views": "179",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jen Burns",
                    "user_href": "/profile/Jen-Burns-12"
                },
                {
                    "user_id": "Cathy Riess",
                    "user_href": "/profile/Cathy-Riess"
                },
                {
                    "user_id": "Michael Chaplan",
                    "user_href": "/profile/Michael-Chaplan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Billy Lee",
                "href": "/profile/Billy-Lee-85"
            },
            "answer_text": "Answered 11 May 2020  Added 2 September 2020: A recent hypothesis developed with help by artificial intelligence suggests that the virus may be hemorrhagic. It’s called the Bradykinin hypothesis.  No one knows because no one is certain what is the nature and cause of this viral menace. A lot of conjectures have been put forward. Scientists at Scripps Labs wrote in Nature that the virus is natural and jumped species. It’s a convincing report. Other less reputable persons have suggested the virus is a bio-weapon with a timer—a telomeric timer that limits the number of iterations the virus can undergo before it no longer replicates. Those who believe the virus is a weapon are of two views: the USA developed the weapon but a Chinese agent stole it and transported it to Wuhan Labs where it was mishandled; the other view is that the weapon was developed by the Chinese at the Wuhan Labs where someone mishandled it. Another suggestion is that the virus is the infamous “Christmas gift” a certain world leader in the far east promised the Trump administration last year. Right now, all the evidence available to civilians like myself seems to confirm that the virus is a seasonal cold-like virus which—unlike the common cold—is virulent, deadly, and more contagious. The virus attacks repetitiously like a stinging bee until it provokes cytokine storms and other deadly complications like MIS-C (Multi-Inflammatory Symptom in Children) that eventually kill its hosts. As of today—hopefully the future will overturn this dreadful fact—the virus seems to incite no effective immunity-defense in its victims. If these ideas about the nature of the virus prove true, we can expect a dramatic seasonal decrease this summer followed by a dramatic seasonal increase in the fall or winter. During summer the virus will continue to spread asymptomatically. When it erupts during the next active season, the numbers of victims could be staggering. Without an ability to acquire immunity from the virus, designing a safe and effective vaccine will be challenging. We don’t yet have a vaccine for the common cold though some say very smart people are working the problem. IN THE BEGINNING… Added 4 July 2020: Evidence for immunity has emerged in infected Chinese monkeys. China announced a vaccine on June 25 and is inoculating members of their military. China agreed on July 2 to partner with Brazil to test another version of a coronavirus vaccine they have in their arsenal. ",
            "date": "Updated September 2, 2020",
            "views": "631",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Janice Fox",
                    "user_href": "/profile/Janice-Fox-14"
                },
                {
                    "user_id": "Scoot Booterson",
                    "user_href": "/profile/Scoot-Booterson"
                },
                {
                    "user_id": "Pratik Shah",
                    "user_href": "/profile/Pratik-Shah-9"
                },
                {
                    "user_id": "Joe Sweeney",
                    "user_href": "/profile/Joe-Sweeney-30"
                }
            ]
        }
    ]
}