{
    "title": "How do enzymes accelerate a metabolic reaction? - Quora",
    "tags": [
        "Metabolism (biochemistry)",
        "Metabolism (nutrition)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steven Fowkes",
                "href": "/profile/Steven-Fowkes"
            },
            "answer_text": "A very good answer by William Halmeck regarding the energetics of the metabolic reaction. But I think a structural description will add to his explanation. The lowering of the activation energy is achieved by two “mechanical” processes. The first one of which is the “positioning” of the reactants in immediate proximity to each other. Enzymes have an “active site” which not only fits the reactants (A and BC), but orients them with respect to each other (so the B part of BC faces A). This, in itself, favors the reaction more than random collisions of A molecules with BC molecules in a non-enzyme environment. The second “mechanical” process may be more accurately described as “entropic,” in which an ATP (or a related “energy molecule”) binds to the enzyme, hydrolyzes, and “pushes” the reactants to react with each other. You might think about this as the electricity that powers a spot-welding device, or the hand pressure that operates a paper stapler. All these analogies might help us understand roughly how an enzyme works, but there is serious misleadingness involved, too. Most of our macro tools and assembling devices are hard and stiff, where we can pretty easily see how pushing here causes pressure there. But enzymes and molecules are soft and squishy, so it’s more like a tool made of sponges and Jello, where a little “hand-waving” mystery is involved. Nevertheless, tools and enzymes both get the job done. Thanks for the question. ",
            "date": "Updated October 28, 2020",
            "views": "1",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Carlos Asenjo",
                    "user_href": "/profile/Carlos-Asenjo"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Halmeck",
                "href": "/profile/William-Halmeck"
            },
            "answer_text": "Enzymes make it possible for reactants to reach the Transition state at a lower energy than without the enzyme. The energy required to bring the reactants to the transition state is called Activation energy.  ",
            "date": "Answered April 15, 2018",
            "views": "656",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Carlos Asenjo",
                    "user_href": "/profile/Carlos-Asenjo"
                },
                {
                    "user_id": "Steven Fowkes",
                    "user_href": "/profile/Steven-Fowkes"
                },
                {
                    "user_id": "Marie Pedersen",
                    "user_href": "/profile/Marie-Pedersen-7"
                },
                {
                    "user_id": "Kathryn Elle",
                    "user_href": "/profile/Kathryn-Elle"
                },
                {
                    "user_id": "Michael Soso",
                    "user_href": "/profile/Michael-Soso"
                }
            ]
        }
    ]
}