{
    "title": "How can Darwin's evolution theory influence the economy in modern times? - Quora",
    "tags": [
        "Darwinism",
        "Charles Darwin",
        "Evolutionary Theory",
        "Evolution (process)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Julian Banfield Randall",
                "href": "/profile/Julian-Banfield-Randall"
            },
            "answer_text": "I think the most relevant factor is that people advocating social Darwinism have a skewed idea of the supposed “Law of the Jungle\", often a wilful misinterpretation based on personal ambition, perceived entitlement & a psychopathic lack of regard for others. The touted interpretation is is that in Nature's scheme of things it is right & proper to sacrifice the weak so the strong can win. In short it is the philosophy of the schoolyard bully on reaching adulthood, & boy is it in evidence around the world today, despite all the lessons of the past. The one lesson we should really take from the past is that that interpretation of Darwin's law is completely wrong. Take any fossil ecosystem & one thing is blindingly obvious: Being top predator is a one way trip to extinction. What the Law of the Jungle really decrees is that however strong you are, everything loses in the end. It is the small generalised & social animals whose dynasties endure. Both civilisation & Christianity are supposed to stand that law on its head. The strong protect the weak, who can do things other than fight, & all benefit. But every 3 generations or so, when grandparents die & take the memories of war- weary youth with them, you can guarantee some idiot somewhere will think it a personal stroke of genius to re-invent ruthlessness. They will diss civilisation as decadence & crash society. Until society loses its temper & sends the dictator the way of the sabre toothed cat. As the world overpopulates & competition for resources intensifies poverty makes a ready audience for disruptive demagogues. Just when we need cooperation to hoard & share resources equitably we are instead urged to exhaust the dwindling supply fighting each other. ",
            "date": "Answered September 29, 2019",
            "views": "5",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Geles Abigail",
                    "user_href": "/profile/Geles-Abigail"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Krall",
                "href": "/profile/Peter-Krall-3"
            },
            "answer_text": "A lot of caution is advisable when comparing cultural or economic evolution with biological evolution. For example, there is nothing comparable to the transfer of knowledge from one company or one economic area in biological evolution or comparable to disruptive effects of technological innovation. Another important difference is that organisms eating other organisms do not acquire characteristics of the prey whereas big companies often acquire intellectual property by buying startups and the perspective to sell the startup after some time is an important incentive for founders. What might be learned is that social change is a evolutionary process at all. There is no such thing as a natural order, pre-stabilized harmony, meaning, etc. Social systems are as they are and change as they change as consequence of interactions between actors. But the relevant interactions are pretty different from passing genes to biological offspring. ",
            "date": "Answered June 16, 2019",
            "views": "35",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Carl Smotricz",
                    "user_href": "/profile/Carl-Smotricz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nick Cranny",
                "href": "/profile/Nick-Cranny"
            },
            "answer_text": "It doesn’t Companies and Governments are not living organisms, Capitalism sometimes justifies it’s actions by use of Social Darwinism which suggests the survival of the strong is a a product of not Government not supporting the weak, which is actually the function of Government in a civilised modern society, so these beliefs are A) Nonsense and B) Not actually Darwinist, Charles Darwin was a Clergyman as well as a Scientist so he believed in the duty of the moral society to assist the less fortunate, he would have found so called Social Darwinsim a repulsive idea! ",
            "date": "Answered December 6, 2018",
            "views": "26",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jerome Mendoza",
                    "user_href": "/profile/Jerome-Mendoza-34"
                },
                {
                    "user_id": "Carl Smotricz",
                    "user_href": "/profile/Carl-Smotricz"
                },
                {
                    "user_id": "Al Klein",
                    "user_href": "/profile/Al-Klein"
                },
                {
                    "user_id": "David Chan",
                    "user_href": "/profile/David-Chan-287"
                }
            ]
        },
        {
            "author_info": {
                "name": "Koen van Hees",
                "href": "/profile/Koen-van-Hees"
            },
            "answer_text": "Hopefully only in very broad strokes. That it makes evolutionary sense to have a sustainable economy, meaning leaving enough for future generations to have at least our level of comfort. Because mass extinction is so embarrassing. ",
            "date": "Answered October 19, 2020",
            "views": "67",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gloria Cole",
                "href": "/profile/Gloria-Cole-1"
            },
            "answer_text": "Darwin’s (1859) is a biological theory. It does not apply to economics in 1859 or now. Applying and outdated biological theory to economics was Herbert Spencers idea also used by Hitler. It is called Social Darwinism. If someone starts spouting “survival of the fittest” you know they are mis-applying Darwin to social-economics. ",
            "date": "Answered December 6, 2018",
            "views": "11",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yma Hasee",
                    "user_href": "/profile/Yma-Hasee"
                },
                {
                    "user_id": "Cim Eliat",
                    "user_href": "/profile/Cim-Eliat-2"
                },
                {
                    "user_id": "Barry Clemson",
                    "user_href": "/profile/Barry-Clemson-1"
                },
                {
                    "user_id": "Dennis Horvitz",
                    "user_href": "/profile/Dennis-Horvitz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kamil Jarzynowski",
                "href": "/profile/Kamil-Jarzynowski"
            },
            "answer_text": "It's a biological theory so not so much. Understanding how selection works influences the farm animal and seed markets, especially the prices of animals for insemination and breeding. But farmers understood this intuitively centuries before the theory. ",
            "date": "Answered July 1, 2019",
            "views": "1",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Carl Smotricz",
                    "user_href": "/profile/Carl-Smotricz"
                }
            ]
        }
    ]
}