{
    "title": "How many times have gravitational waves been detected? - Quora",
    "tags": [
        "Waves (physics)",
        "Gravity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jack Fraser",
                "href": "/profile/Jack-Fraser-11"
            },
            "answer_text": "There have been 6 confirmed Gravitational Wave detection since LIGO went live in 2015. In order, they are: GW150914 on 14th September, 2015First GW observationBinary Black hole merger, with largest observed masses to date (total mass [math]65 M_\\odot[/math])GW151226 on 26th December, 2015Black hole binary merger, with total mass [math]22 M_{\\odot}[/math]GW170104 on 4th January 2017Black hole binary merge, with total mass [math]50 M_{\\odot}[/math]Currently the farthest object observed ([math]z = 0.2[/math])GW170608 on 8th June 2017Black hole binary merger, with total mass [math]19 M_\\odot[/math]The lightest precursors yet observedGW170814 on 14th August, 2017Black hole binary merger, with total mass [math]55 M_{\\odot}[/math]First detection after VIRGO went live (first 3-detector event)First measurement of polarisationGW170817 on 17th August, 2017First neutron star binary merger, total mass [math]\\approx 3 M_{\\odot}[/math]First GW event to have an optical counterpart: the Gamma Ray Burst designated GRB 170817A, and the optical transient designated AT 2017gfoSo-called “kilonova” event, with evidence of r-process nucleosynthesisThere was a 7th unconfirmed event — LVT151012 — on 12th October, 2015, but the signal-to-noise ratio was poor, rendering this event as not significant enough to be designated a true gravitational wave detection — as there was a ~10% chance that the event was just random noise in the detector.  P.S. The question as is currently written refers to “gravity waves”, which have been observed many billions of times. That’s because this is a gravity wave:  Credit: Surface gravity waves | Applied Mathematics A gravity wave is a phenomenon in fluid dynamics, when the competing forces of gravity and buoyancy result in propagating disturbances at the boundary between two fluidic media (in this case: the air and the water) — they are what you automatically think of when you think of “waves”. Gravity Waves are not to be confused with the phenomena discussed in this answer, which is gravitational waves, and what I interpreted the question to be asking about! ",
            "date": "Answered June 29, 2018",
            "views": "106",
            "upvotes": " View 363 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Stephen Selipsky",
                    "user_href": "/profile/Stephen-Selipsky"
                },
                {
                    "user_id": "Allan Steinhardt",
                    "user_href": "/profile/Allan-Steinhardt"
                },
                {
                    "user_id": "Jerzy Michał Pawlak",
                    "user_href": "/profile/Jerzy-Michał-Pawlak"
                },
                {
                    "user_id": "Jesse Raffield",
                    "user_href": "/profile/Jesse-Raffield-1"
                },
                {
                    "user_id": "Marcos da Maia Vicente Júnior",
                    "user_href": "/profile/Marcos-da-Maia-Vicente-Júnior"
                },
                {
                    "user_id": "Shashank Sadafule",
                    "user_href": "/profile/Shashank-Sadafule"
                },
                {
                    "user_id": "Ron Davis",
                    "user_href": "/profile/Ron-Davis-43"
                },
                {
                    "user_id": "Shlok Malviya",
                    "user_href": "/profile/Shlok-Malviya-4"
                },
                {
                    "user_id": "Karthik",
                    "user_href": "/profile/Karthik-305"
                },
                {
                    "user_id": "Marcelo Besser",
                    "user_href": "/profile/Marcelo-Besser"
                }
            ]
        },
        {
            "author_info": {
                "name": "Floyd Baker",
                "href": "/profile/Floyd-Baker-8"
            },
            "answer_text": "There are no gravity waves as such. There are only real time fluctuations of gravity strength that we may see here on earth, caused by such things as binary stars moving from inline with each other to side by side in respect to our POV. These changes in the cosmos are instaneously seen on earth at the very instant they are happening. They are seen in real time. Gravity is non compressible so it cannot form waves. And if it did, those waves, coming from everything that is moving about in the cosmos would cause interference patterns that would cause all kinds of shaking and wobbles of everything those on again-off again gravity switches caused. And if the right harmonics mixed they could present the ultimate shake up. A square wave of gravity that with its switching from excessive gravity to zero gravity would destroy just about everything within what we used to call the cosmos. :/ h IMHO ",
            "date": "Answered June 29, 2018",
            "views": "148",
            "upvotes": "0"
        }
    ]
}