{
    "title": "How much sleep does one require? - Quora",
    "tags": [
        "Sleep Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Natalie Engelbrecht",
                "href": "/profile/Natalie-Engelbrecht-1"
            },
            "answer_text": "What determines how much sleep one requires? First, here is a chart that shows the recommended amount of sleep for your age.  Next, here is when we sleep (on average) depending on our life.  Changing sleep and activity patterns throughout life (image by Luke Mastin based on an image from The Brain from Top to Bottom) And here is the change in our proportion of REM sleep during our lives.  Changing proportion of REM sleep, non-REM sleep and wakefulness throughout life (image by Luke Mastin) So back to the question of what determines how much sleep we need. Well, as the images show, our age alters our sleep requirements. The idea of the required 8 hours has no evolutionary basis. Cultures wihtout electricity sleep 6–7 hours per day, but less sleep than is recommended (the first image) is associated with an increased risk of obesity, heart disease, depression, and early death, Our body has a circadian rhythm (a 24-hour repeating rhythm). Two processes interact to control this rhythm. First, every hour that we are awake increases the pressure to sleep; at some point that drive reaches a peak, and we sleep. One factor that causes this is a compound called adenosine; during the day it rises (signalling the need to sleep), and then during sleep it is broken down. Second, your internal body clock syncs with cues from the environment. Light and darkness are some of these cues that help you feel asleep and awake. Light signals received through your eyes tell your brain that it is day time. When it is dark, your body releases the hormone melatonin, and this hormone signals the need for sleep and makes you drowsy. If you get exposed to light (phone, computer, etc.) once it turns dark, it can interrupt this process. As shown in the images the rhythm and timing of the body clock change with age. Teens fall asleep later at night than younger children and adults. One reason is that melatonin is released and peaks later in the 24-hour cycle for teens. As such, teens prefer later bedtimes at night, and sleep later in the morning than adults. Once the Sun begins to rise, cortisol gets released and prepares your body to wake up. During early life people need more sleep, to aid growth and development. Children sleep more in early evening, and teens sleep more in the morning. Factors such as diet, medication (Dopamine), inflammation, disorders (such as ASD) and stress can also alter our need for sleep. Half the people with autism struggle with sleep disorders. The reasons seem to due to dysregulation the circadian rhythm of the hormone melatonin, which is involved in controlling the sleep-wake cycle. ",
            "date": "Updated July 29, 2019",
            "views": "221",
            "upvotes": " View 52 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anony Thinker",
                    "user_href": "/profile/Anony-Thinker"
                },
                {
                    "user_id": "Muhammad Idrus",
                    "user_href": "/profile/Muhammad-Idrus-5"
                },
                {
                    "user_id": "Wendy Moncur",
                    "user_href": "/profile/Wendy-Moncur"
                },
                {
                    "user_id": "KS Pandit",
                    "user_href": "/profile/KS-Pandit"
                },
                {
                    "user_id": "Jeremy Dalgai",
                    "user_href": "/profile/Jeremy-Dalgai"
                },
                {
                    "user_id": "ASHUTOSH SHUKLA",
                    "user_href": "/profile/ASHUTOSH-SHUKLA-416"
                },
                {
                    "user_id": "Christian Dittel",
                    "user_href": "/profile/Christian-Dittel"
                },
                {
                    "user_id": "Aum Vaghasia (ઓમ વઘાસીયા)",
                    "user_href": "/profile/Aum-Vaghasia-ઓમ-વઘાસીયા"
                },
                {
                    "user_id": "Sarim Suhail",
                    "user_href": "/profile/Sarim-Suhail-1"
                },
                {
                    "user_id": "Sriram Medida",
                    "user_href": "/profile/Sriram-Medida"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhi Singh",
                "href": "/profile/Abhi-Singh-79"
            },
            "answer_text": "How many hours of sleep do you need? There is a big difference between the amount of sleep you can get by on and the amount you need to function optimally. According to the National Institutes of Health, the average adult sleeps less than seven hours per night. In today’s fast-paced society, six or seven hours of sleep may sound pretty good. In reality, though, it’s a recipe for chronic sleep deprivation. Just because you're able to operate on six or seven hours of sleep doesn't mean you wouldn't feel a lot better and get more done if you spent an extra hour or two in bed. While sleep requirements vary slightly from person to person, most healthy adults need between 7 to 9 hours of sleep per night to function at their best. Children and teens need even more. And despite the notion that our sleep needs decrease with age, most older people still need at least 7 hours of sleep. Since older adults often have trouble sleeping this long at night, daytime naps can help fill in the gap. Age :Hours Needed :May be appropriate Newborn to 3 months old : 14 - 17 hrs: 11 - 19 hrs 4 to 11 months old: 12 - 15 hrs :10 - 18 hrs 1 to 2 years old: 11 - 14 hrs :9 - 16 hrs 3 to 5 years old :10 - 13 hrs :8 - 14 hrs 6 to 13 years old :9 - 11 hrs :7 - 12 hrs 14 to 17 years old :8 - 10 hrs: 7 - 11 hrs Young adults (18 to 25 years old) :7 - 9 hrs: 6 - 11 hrs Adults (26 to 64 years old) :7 - 9 hrs :6 - 10 hrs Older adults (65+) :7 - 8 hrs: 5 - 9 hrs It's not just the number of hours you spend asleep that's important—it's the quality of those hours. If you give yourself plenty of time for sleep but still have trouble waking up in the morning or staying alert all day, you may not be spending enough time in the different stages of sleep. Each stage of sleep in your sleep cycle offers different benefits. However, deep sleep (the time when the body repairs itself and builds up energy for the day ahead) and mind and mood-boosting REM sleep are particularly important. You can ensure you get more deep sleep by avoiding alcohol, nicotine, and being woken during the night by noise or light. While improving your overall sleep will increase REM sleep, you can also try sleeping an extra 30 minutes to an hour in the morning, when REM sleep stages are longer. For detailed study refer to the link : What to Do If You’re Not Getting Enough Sleep ",
            "date": "Answered August 9, 2017",
            "views": "11",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robme Jones",
                    "user_href": "/profile/Robme-Jones"
                },
                {
                    "user_id": "Alex Lucio",
                    "user_href": "/profile/Alex-Lucio-1"
                },
                {
                    "user_id": "Kotya Karapetyan",
                    "user_href": "/profile/Kotya-Karapetyan"
                },
                {
                    "user_id": "Anamika S",
                    "user_href": "/profile/Anamika-S-8"
                },
                {
                    "user_id": "Prakash",
                    "user_href": "/profile/Prakash-902"
                }
            ]
        }
    ]
}