{
    "title": "How should I start learning Python for data science? How fast can I learn Python for data science and its libraries? - Quora",
    "tags": [
        "Learning Python"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul DeVos",
                "href": "/profile/Paul-DeVos"
            },
            "answer_text": "There's so many good resources out there it's honestly getting harder to go wrong. You just have to keep going onto the next one. You will have to solve a lot of problems with Python. In looking for ways to learn Python I believe in writing as much Python as possible.  If you have any programming experience (e.g. PHP, Perl, JavaScript, C#, Java, etc) I'd start with Learn Python The Hard Way (by actually coding). If you haven't even tried programming before, perhaps CodeAcademy's Python course would be a good start. I had programmed in PHP, SQL, and C# before Python, so I never came from the 'nothing to Python' route. And this would factor into your question in your comments \"How fast can I learn Python for Data Science and it's libraries?\" - I would need more context to your current background.  After the intro to Python course(s) I would go through the base scientific Python libraries Numpy DocumentationPandas DocumentationScipy DocumentationStatsmodels DocumentationScikit-Learn DocumentationMatplotlib DocumentationYou will actually learn how to use all the methods within each of the libraries and what each library is capable of.  From there, I'd hit Github for as much Python code and IPython notebooks as you can handle to try to find exploratory data analysis of other Python Data Scientists. You'll see them use descriptive statistics and begin to show how they peel back the layers of a data set to understand it's distribution and shape and as they angle it for feature engineering and modeling.  If you want videos I'd go after the Pycon, PyData, and Scipy videos. There's conferences (Europe, USA, etc) each year in many of them. So you have 100's of hours of new video tutorials each year going back to 2012.  If you like books, a few of my favorite books for getting started: Python for Data Analysis by Wes McKinneyData Science from Scratch by Joel GrusAfter that I'd revisit a few other books that aim at you getting more Pythonic. If you like courses, I'd recommend the Data Science and Python courses at Udemy. They're usually $15 per course (when on sales, which is often) or beginning in April, at most $40. Udacity has a few good Data Science/Python courses as well by Dave Holtz and Sebastian Thrun. In case you prefer a more hands on way of learning, there is the interactive online coding course: Intro to Python for Data Science by DataCamp. Without knowing your experience with Python...this would be my general recommendation for time to proficiency for 1 year: Days: Must write Python code no less than 250 days in a 365 calendar day period. Weekly: Must write Python code no less than 4 days a week and must code no less than 8 hours a week.Year: must have at least 700 hours of coding in PythonEDAs: Must find at least 3 data projects that require you to merge seemingly unrelated data sets. Clean, merge, feature engineer, visualize, apply statistical tests, and model. Re-adjust and try another model. Must try at least one Regression, Classification, and Clustering data model. Assuming no previous experience in data centric roles:  I'd give you 80% confidence for Data Analyst it's a Python shop and you know SQL well. If you don't know SQL well I'd drop to 20% confidence. For Data Science, you have more dependencies, namely statistics, especially a firm grasp of Scipy and Statsmodels - if so, I'll give you 80% confidence you could land a Data Science job outside of Silicon Valley.   ",
            "date": "Updated April 23, 2016",
            "views": "851",
            "upvotes": " View 229 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Frederick T. Williams",
                    "user_href": "/profile/Frederick-T-Williams"
                },
                {
                    "user_id": "Shivam Thassu",
                    "user_href": "/profile/Shivam-Thassu"
                },
                {
                    "user_id": "Arslan Asghar",
                    "user_href": "/profile/Arslan-Asghar-31"
                },
                {
                    "user_id": "Alen Jose",
                    "user_href": "/profile/Alen-Jose-3"
                },
                {
                    "user_id": "Manvesh Dev",
                    "user_href": "/profile/Manvesh-Dev"
                },
                {
                    "user_id": "Meyappan Lakshman",
                    "user_href": "/profile/Meyappan-Lakshman"
                },
                {
                    "user_id": "Dwarakanath Reddy",
                    "user_href": "/profile/Dwarakanath-Reddy"
                },
                {
                    "user_id": "Dhruv Lahariya",
                    "user_href": "/profile/Dhruv-Lahariya"
                },
                {
                    "user_id": "Anna Wang",
                    "user_href": "/profile/Anna-Wang-15"
                },
                {
                    "user_id": "Suman Maji",
                    "user_href": "/profile/Suman-Maji-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Staniek",
                "href": "/profile/Michael-Staniek"
            },
            "answer_text": "Hello, thanks for the A2A. Python is really amazing and I think you chose the language well. It has a steep learning curve (meaning you can learn alot in a short amount of time and you see results fast), but it also doesnt slow down. So the more time you put in, the better you get. When you are finished with the basics, you start with a library. When you are finished with the library, you go to the next. Okay, so, you have 2 questions. How should you start learning Python for Data Science is the first one. Here my answer to that: First start learning the basics of Python (if you havent already)Codeacedemy has an amazing course for the basics, I would advise you to do the course: Python  Next, when you have done that, take any tutorial of basic Python you want and read over it. Skim the parts that you have already learnt in the Codeacedemy course and IMPLEMENT the parts that you havent dealt with yet. Dont just read a text, try to really work with new techniques to learn them. Here is one I find good: Python Programming Tutorials  2. Data Science in Python The amazing things with libraries in Python is, you can learn by doing. That means you dont need to spend a billion hours getting familiar with it before you can start your own project, the python libraries can take alot of work away from you. Pandas was already answered here. Scikit-learn is so easy to learn too. Thats why I would advise you next to go through this page: Python Programming Tutorials  (I am not affiliated with the site in any way, I just learned alot myself from this page). It has a pandas tutorial, you can learn to use Support Vector Machines on that page. It should be enough to make you familiar with the libraries. Data Visualization is also there, with the amazing Matplotlib library! Now, your second question. How much time do you have to input? It depends on your background and how much time you are willing to input into learning all of this. If you are actually going to spend a lot of time with this, I could see you doing small data science projects in about a months time (with lots of copy pasting of course, everyone does it. You dont have to know it by heart). I hope I could help you. Greetings. ",
            "date": "Answered March 5, 2016",
            "views": "146",
            "upvotes": " View 24 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Patrick McOfori",
                    "user_href": "/profile/Patrick-McOfori-1"
                },
                {
                    "user_id": "Sejal Jadhav",
                    "user_href": "/profile/Sejal-Jadhav-2"
                },
                {
                    "user_id": "Harshal Gailwad",
                    "user_href": "/profile/Harshal-Gailwad"
                },
                {
                    "user_id": "Mallela Raghavendra",
                    "user_href": "/profile/Mallela-Raghavendra"
                },
                {
                    "user_id": "Dhruv Lahariya",
                    "user_href": "/profile/Dhruv-Lahariya"
                },
                {
                    "user_id": "Rishabh Sharma",
                    "user_href": "/profile/Rishabh-Sharma-248"
                },
                {
                    "user_id": "Arpit Rajput",
                    "user_href": "/profile/Arpit-Rajput-2"
                },
                {
                    "user_id": "Swadhikar C",
                    "user_href": "/profile/Swadhikar-C"
                },
                {
                    "user_id": "Swapnil Dubey",
                    "user_href": "/profile/Swapnil-Dubey-68"
                },
                {
                    "user_id": "Saurabh Singh",
                    "user_href": "/profile/Saurabh-Singh-1452"
                }
            ]
        }
    ]
}