{
    "title": "How do sodium potassium pumps work? - Quora",
    "tags": [
        "Heat Pumps",
        "Potassium",
        "Sodium"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abhi Singh",
                "href": "/profile/Abhi-Singh-79"
            },
            "answer_text": "The process of moving sodium and potassium ions across the cell membrane is an active transport process involving the hydrolysis of ATP to provide the necessary energy.  It involves an enzyme referred to as Na+/K+-ATPase. This process is responsible for maintaining the large excess of Na+ outside the cell and the large excess of K+ ions on the inside. A cycle of the transport process is sketched below. It accomplishes the transport of three Na+ to the outside of the cell and the transport of two K+ions to the inside. This unbalanced charge transfer contributes to the separation of charge across the membrane. The sodium-potassium pump is an important contributer to action potential produced by nerve cells. This pump is called a P-type ion pump because the ATP interactions phosphorylates the transport protein and causes a change in its conformation.  The sodium-potassium pump moves toward an equilibrium state with the relative concentrations of Na+and K+ as shown  ",
            "date": "Answered September 9, 2017",
            "views": "22",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harold Clements",
                    "user_href": "/profile/Harold-Clements-1"
                },
                {
                    "user_id": "ASHA PRERNA TIGGA",
                    "user_href": "/profile/ASHA-PRERNA-TIGGA"
                },
                {
                    "user_id": "Iswarya",
                    "user_href": "/profile/Iswarya-32"
                },
                {
                    "user_id": "Sakeria Abdirahman Ahmed Jama",
                    "user_href": "/profile/Sakeria-Abdirahman-Ahmed-Jama"
                },
                {
                    "user_id": "Lydia Anastasia Henderson",
                    "user_href": "/profile/Lydia-Anastasia-Henderson"
                },
                {
                    "user_id": "Alexandra Jones",
                    "user_href": "/profile/Alexandra-Jones-133"
                },
                {
                    "user_id": "Anchal Bhagal",
                    "user_href": "/profile/Anchal-Bhagal"
                },
                {
                    "user_id": "Maryam Mutvalli",
                    "user_href": "/profile/Maryam-Mutvalli"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lydia Anastasia Henderson",
                "href": "/profile/Lydia-Anastasia-Henderson"
            },
            "answer_text": "Sodium (NA+) in the cytoplasm diffuse into the pump's open channel and bind to the interior. The pump changes shape after it receives a phosphate group from ATP. It channels open to ECF and releases NA+. Then K+ from ECF diffuse into the channel and bind to the interior. The transporter releases the phosphate group and then reveal to its original shape. The channel opens to the cytoplasm and the K+ is released there. Source: Biology: Concepts and Applications Seventh Edition ",
            "date": "Answered December 22, 2018",
            "views": "433",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mysterious Universe",
                "href": "/profile/Mysterious-Universe-3"
            },
            "answer_text": "what is primary active transport you can check this here ",
            "date": "Answered November 19, 2019",
            "views": "135",
            "upvotes": "0"
        }
    ]
}