{
    "title": "How can falsifiability help in the development of science? - Quora",
    "tags": [
        "Falsifiability in Physics",
        "Philosophy of Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joe Andros",
                "href": "/profile/Joe-Andros-1"
            },
            "answer_text": "Falsifiability doesn’t help in the development of science. It’s the sine qua non of the development of science. (That’s Latin for “without which not.” Falsifiability is the without which not of science’s development!) Falsification is the engine that drives scientific progress. We observe reality, and we conceive hypotheses and theories to account for what we see. These are intended as descriptions of reality, of how reality truly is. But we know, we may get some parts wrong, even slightly wrong. That matters a great deal, when we plan to use these theories to generate further advance! So we test them, everywhere we can. Every particular that strikes us as testable. Any way we can conceive of proving this part or that part of the theory wrong, we test it against reality. Whatever doesn’t hold up, whatever fails the test, we discard, and refine a more fitting description in its place. We never stop testing, until can’t think of anything else to test. Every test is an attempt in grim earnest, to prove part or all of the theory wrong. Only in this way can we develop closer and nearer descriptions to reality, which can be used to propel our further attempts at theory, or our further developments of engineering and technology. To quote Karl Popper (who is wonderfully, inspirationally clear on this topic): “A theory which is not refutable by any conceivable event is nonscientific. Irrefutability is not a virtue of a theory (as people often think) but a vice.” Don’t assume scientists are virtuous in seeking ruthlessly to falsify their own theories. They’re being realistic. Other scientists have access to reality, too. If your own theory can be disproved by contact with everyone’s reality, it’s really much better for you if you discover this yourself. Because if you do, or whoever does, that reality check will be another rung from which to pull ourselves upwards, see farther, describe more. And put it to the test. ",
            "date": "Answered November 22, 2018",
            "views": "125",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rajni Kachhela",
                    "user_href": "/profile/Rajni-Kachhela"
                },
                {
                    "user_id": "Nick Layon",
                    "user_href": "/profile/Nick-Layon"
                },
                {
                    "user_id": "Al Klein",
                    "user_href": "/profile/Al-Klein"
                }
            ]
        }
    ]
}