{
    "title": "How fast are the poles melting? - Quora",
    "tags": [
        "North Pole"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Kearney",
                "href": "/profile/Steve-Kearney-7"
            },
            "answer_text": "They do not appear to be in any unusual way. Antarctica has been frozen solid for at least the last 15 million years. The majority of the continent is the eastern part - the older part of the land mass and mostly above sea level. Western Antarctica is newer, mostly below sea level, and apparently with a lot (90+) of active sub ocean volcanoes. It is the Western peninsula of the continent that one hears about in the news most often, as it is displaying some warming and melting along the coastal areas. The Western peninsula is composed of a series of islands that are covered in thick ice, and subject to changing ocean temperatures as a catalyst for changes in melt rates. This is much like the Arctic, with the sea ice there being directly impacted by changing ocean rather than atmospheric temperatures. If one looks at the proxy temperature record of the planet it is clear that the Earth has been much warmer than now for most of the 15 million years that Antarctica has been frozen. So it seems like it is not going to change any time soon based on a 1 or 2 degree, or even 5 degree planetary change of atmospheric temperature. In fact, just the opposite seems to be happening in the Eastern Antarctic with ice mass growing rather than shrinking. There have been several scholarly papers published on this matter, though there is still some dispute over the veracity of the satellite data. The other thing to keep in mind is that the vast majority of that continent is almost completely unknown regarding temperatures and snowfall etc, other than that fairly recent (less than 50 years) satellite data. Regarding the Arctic, it appears that sea ice levels have varied tremendously even over the last 150 years. As the Arctic ice is almost exclusively sea ice, the build up is highly dependent on ocean temperatures and storm tracks. The bottom line is that it is dark and really, really cold all winter up there - afterall it is where those -30 C temps that sometime invade North America each winter come from! Sea temperatures of the North Pacific, and the oceanic cycles that typically generate the changes in regional ocean temperature - look up Pacific Decadal Oscillation - are the real drivers of Arctic sea ice. Generally, anytime one sees a catastrophic sea ice loss graph or chart from that region it has a start date that corresponds to the maximum extent of the modern era - circa 1979. If one looks at a longer period the decline seems less significant. As that ice is floating on the surface of the Arctic Ocean, its absence or presence has little impact on sea levels. The main catastrophist argument relates to changes in Albedo - reflectivity of the planet - with the idea being that less winter sea ice means earlier melting, which means less reflectivity by the time the sun actually starts to shine on the area again. Lower Albedo equals more absorption of solar energy, which interacts with atmospheric ‘greenhouse’ gases when it is re-radiated, which equals more heat in the atmosphere. I have not studied Albedo too closely - but it seems to be a factor mostly controlled by clouds rather than ice cover. The changes in cloudiness, particularly in the equatorial regions where the vast majority of the Earth’s solar energy is absorbed, and redistributed via oceanic currents, alter the Albedo by orders of magnitude compared to changes in polar ice. One must understand that the polar ice albedo is only a factor at the shoulder seasons - ie when the ice is at its greatest extent it is mostly dark up there - between 30–60 days of twilight type light each winter. Therefore the albedo variability only really shows up as the area receives more sun, and the ice pack begins to melt away. The volume of ice and the speed of its melt is then factored in to the albedo. Regardless, global albedo is a highly variable input on an annual basis, and the Arctic is only a small part of that variability. I am sure there are many who will disagree, I am not an expert in these matters. I am just relaying the information I have gleaned on this topic over the years. Humans do have an impact on climate to be sure, just as do termites, trees, phytoplankton, etc. I just do not think we know enough to make the kind of predictions being made - I read recently that the term ‘internal climate variability’, one used quite often in climate science, is just code for ‘we do not know why this or that is happening’ - I believe it was from a paper on the Jet Stream, and how models predicted it would do one thing because the planet was warming, and when it did not, the models were adjusted to reflect what it was doing, and then lo and behold, the Jet Stream started doing what was originally predicted, so the models were changed yet again. Internal variability trumped the best science we had on that topic apparently, and showed the true nature of modeling - a lot of guess work coupled with some fancy math, and then a bit of ‘fine tuning’. The kicker of it is that the original premise was that the Arctic warming - Arctic Amplification - would cause the Jet Stream to change behaviour, but in the end it may well be the reverse, with changes to the Jet Stream causing the Arctic to warm. That is what happens when narrative gets in the way of science, and the scientific method. Just one example of may, sea level rise and disappearing islands is another similar oops moment in climate science. Cheers All! ",
            "date": "Answered February 22, 2020",
            "views": "20",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brock Williams",
                "href": "/profile/Brock-Williams-47"
            },
            "answer_text": "In view of all the slanted news on this subject it is very difficult to know what’s true. Depending on your source the ice is either increasing or decreasing in both poles. I understand that the northwest passage was open in 1904 and 1944 so presently there is more ice now than then. As for large glaciers (according to Dr Patrick Moore)if melting is occurring without replacement it might take hundreds of years for them to melt completely. ",
            "date": "Answered February 20, 2020",
            "views": "30",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gary Nelson",
                    "user_href": "/profile/Gary-Nelson-56"
                }
            ]
        }
    ]
}