{
    "title": "How do we know that the elements we know of today are actually pure elements and not made up of two elements we don’t know of yet? - Quora",
    "tags": [
        "Elements (chemistry)",
        "Chemical Elements",
        "Periodic Table",
        "Chemistry of Everyday Life",
        "Science",
        "Chemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Istvan Geza Juhasz",
                "href": "/profile/Istvan-Geza-Juhasz"
            },
            "answer_text": "All the previous answers (except the one “defining” the “4 elements to life and creation”) gave you the correct answer. So far it seems that we know all the naturally occurring elements; and a few more that simply don’t last long enough to be found in nature. Any new element we might discover will most likely fall in the same category: they might exist for just a fraction of a second before decaying. All the “alien, unknown elements” from sci-fi books, comics, movies, and those in conspiracy theories were invented by the victims of an education system that allows teaching of a so-called “science education”, defined as “science for non-scientists”, instead of giving the students at least some basic information about real science. Just one or two pages of definitions taught in these classes would drastically improve the quality of questions on Quora.  If you asked this question because you are doing research for a sci-fi, here are a few possible lines your fictional scientist could say without sounding ridiculously unscientific: “This is a chemical compound I’ve never seen before. I can tell you what’s it made of, but I don’t know how.” There are hundreds of thousands of chemical compounds registered for production and use on our planet, and I don’t dare to estimate the number of possible combinations. Probably more than enough for quite a few surprises.Your scientist can say the exact same thing, just replacing “chemical compound” with “alloy”. Or with “structure”, “crystal structure”, or “solid-state solution”. Or “material”, but that can be confusing, as some people will understand it as “element”.An other thing that could surprise a scientist could be an unusual proportion of isotopes. For instance, lithium-6 is relatively rare on Earth, at about 7.59% of what we have on our planet, the rest, 92.41% being lithium-7. Lower content of lithium-6, maybe as low as 1.9% occurs pretty often; but a much higher content would be unusual. Similarly, iron has four naturally occurring stable isotopes, iron-56 being the most abundant (91.75%), followed by iron-54 (5.85%), iron-57 (2.12%) and iron-58 (0.28%), with traces of a fifth, unstable isotope, iron-60 (with a half-life of 2.6 million years, found only in more recent meteorites and sediments, suggesting a supernova explosion in the vicinity of the solar system 2–8 million years ago). A drastically different proportion of these isotopes would indicate artificial and/or alien origin… And “alien” doesn’t necessarily mean “space invaders”: the iron-60 “forged” by a recent supernova is also of alien origin.Of course any of these can be misunderstood by someone educated to be a non-scientist as “elements”, that won’t be your fault. Especially if you can make this clear: you’re not talking or writing about elements, but about chemicals, alloys and molecular structures we don’t know yet, with properties we never imagined. Unlike “unknown elements”, these are plausible and highly probable. If science is not your strong point, and you still want to write science-fiction, without becoming ridiculous in the process, I would recommend you to find an associate: a scientist, or at least a student of the domain you want to explore. Avoid giving too many details: leave them to the fans. Physicist Miguel Alcubierre, inspired by Star Trek’s warp drive came up with a scientific solution for one. Many sci-fi inventions and gadgets were implemented, sometimes exceeded by our technology. By giving too many, too specific (and possibly too non-scientific) details you would only hinder their creativity… A perfect balance between vague and unambiguous is one of the main ingredients in a good sci-fi. Average readers don’t care too much about technobabble anyway.  Forget the “unknown elements”, or just smile when you hear about them. Now you know better. ",
            "date": "Answered March 13, 2020",
            "views": "155",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Ahmet Umut Ergen",
                    "user_href": "/profile/Ahmet-Umut-Ergen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jun-Ichi Yano",
                "href": "/profile/Jun-Ichi-Yano"
            },
            "answer_text": "Andrew’s answer is very formal and correct. my answer would be bit more from a historical perspective: by towards the end of 19th century, chemists have tried more or less all sorts of possible reactions between the existing materials (and also all those they created by chemical reactions) and identified a bunch of basic “elements” that form all those chemical materials. for example, the water consists of hydrogen and oxygen, and you can break the water into hydrogen and oxygen. however, whatever chemical mean you try, you cannot break hydrogen and oxygen into more elemental chemicals. thus the water is not an element, but hydrogen and oxygen are. that was the way the chemists figures out what are the elements. it is only towards the end of 19th century to the beginning of 20th century that actual atomic form of these elements consisting of protons, neutrons, and electrons, and begun to understand why these chemicals (like hydrogen and oxygen) constitute elements (and that is a point of Andrew’s answer). however, the elements are not strictly unbreakable components: if we take more brutal methods, called nuclear reactions (like using high-energy proton beams), we can further break these elements to more basic particles, but that are not considered chemical reactions (a kind of matter of definition) ",
            "date": "Updated June 18, 2019",
            "views": "278",
            "upvotes": " View 1 Upvoter"
        }
    ]
}