{
    "title": "How good is the University of the West of England? - Quora",
    "tags": [
        "University of the West of England",
        "University Rankings in the United Kingdom",
        "Higher Education in the United Kingdom"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hagen Earbery",
                "href": "/profile/Hagen-Earbery"
            },
            "answer_text": "Really poor. 1st year was awful, the course content was irrelevant until the 2nd semester and although the quality of the housing in halls was really good, many people I know had a bad experience with flat mates. Very noisy outside my window. Second year, not much better, there have been issues with the timetable being changed without notice and when brought up was told I was making it up. Cost me lots of money with my train tickets due to this. Trip to Tenerife was really fun however very little relevance to conservation and there is actually very little wildlife on the island. Course is very plant heavy and it feels like we do not learn much about conservation or animals at all. Lots of science and maths involved and often very difficult with lack of explanation as to the relevance to wildlife and conservation. Should have been prepared about 60 hour placement in 2nd year in the summer before as we are only given 1 Monday every other week to complete this and its near impossible to find somewhere that will take you and allow you to get enough hours. No support provided to help find placements. Wish I could have done it over summer, it is causing lots of stress. The whole course it disappointing. JOB PROSPECTS How does your uni make efforts to increase your employability (careers department, work placements, transferable skills)? The uni do have helpful staff regarding employability ect. However, the course staff do very little to support students, especially in finding placements for a sandwich year and even more so in attempting to find a compulsory 60 hour placement for a module in 2nd year. COURSE AND LECTURERS What do you like most and least about the way your course(s) are taught? The course is taught in many different ways, lectures, computer practicals, lab practicals and field work. The computer practicals are often not very interactive and are sometimes boring. How many contact hours per week do you have? 14 STUDENTS' UNION What do you think of your Students' Union? If you don't get involved, why not? Its okay. UNI FACILITIES How good are your university’s facilities? They are relatively good. The SU shop is very expensive and the gym is quite small but they are satisfactory. CITY LIFE What’s the city life like? Its good. Plenty of night life, lots of buses and city has has many shops. CLUBS AND SOCIETIES What are the clubs and societies like? Good. STUDENT SUPPORT How good is the support offered by the uni? Think both academic (tutors/feedback) and personal (counselling, etc). My tutor knew less than the staff, asking them for help or reporting problems is pointless. ",
            "date": "Answered March 15, 2019",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Calvin Young",
                    "user_href": "/profile/Calvin-Young-51"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nadia Fernandez",
                "href": "/profile/Nadia-Fernandez-2"
            },
            "answer_text": "It really depends on what course you’re looking to take up. I did both my undergraduate and postgraduate in Law there and I thoroughly enjoyed my postgraduate studies more than my undergrad simply because I had much better lecturers. I cannot speak for other courses as I do not have first hand knowledge, but I would imagine it’s pretty great as well. It’s all very relaxed and friendly in UWE! ",
            "date": "Answered March 20, 2017",
            "views": "697",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "T Baucells",
                    "user_href": "/profile/T-Baucells"
                },
                {
                    "user_id": "Anna Na Maus",
                    "user_href": "/profile/Anna-Na-Maus"
                }
            ]
        }
    ]
}