{
    "title": "How important is soil to human life on Earth? - Quora",
    "tags": [
        "Soil",
        "Agriculture"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alishsttrichser",
                "href": "/profile/Alishsttrichser"
            },
            "answer_text": "We all know that soil is a key element of agriculture. Without it we wouldn´t be able to grow plants, which are used as food for both humans and animals. In this blog post I would like to focus a little bit more on the technical side of soil and explain some of its chemical and physical properties. There are different definitions of soil, depending on the approach we want to take. For us (from the agricultural point of view) it is an unconsolidated mineral or organic material that is on the surface of the earth in which we grow plants. From a geological point of view, we would probably look at how it was formed and what kinds of layers it has. As far as food is concerned it is important to study a couple of its properties that are fundamental for plant growth. There are two important aspects as far as soil properties are concerned. First we focus on its hydraulic conductivity, the ability of the soil to manage, hold and drain water. Second, we look at its nutrient management, which in addition to the above-mentioned factors analyzes the organic matter content, cation exchange capacity and coatings on sand grains. All the above-mentioned properties determine the texture of soil. Every soil is a mixture of three main SoilTrianglecomponents: sand, clay and silt. A very useful tool to verify a given soil texture is the soil textural triangle that you can see on the right. It shows you what kind of soil you are working on by taking into consideration the soil’s components. Loam is the most fertile type of soil and has a mixture of these components. For example, a more sandy soil will have a high hydraulic conductivity and a low water holding capacity. Water drains through sand very easily and if too much water enters this kind of soil it can lead to nitrate leaching which can be lethal to plants. Sandy soils need a special kind of irrigations systems. Most of farmers try to irrigate these soils many times throughout a day with small quantities of water. This helps the plants efficiently use the water supply without it washing away all the necessary nutrients. There are different solutions to enhance sandy soil performance. One of them is to add more of the organic matter content. The organic matter is a mixture of living and recently dead materials such as previous crop residue, livestock waste or simple organic matter, such as leaves. The organic matter does two things for our soil. It adds water holding capacity and nutrient holding capacity. You can envision this process by comparing organic matter to a sponge. Of course, there is a limit to how much of the organic matter you can introduce to soil. If there is too much of it, in addition to supplying plants with too much nutrients it will start oxidizing, which provides an additional supply of nutrients. Soils that have a higher percentage of clay will have a lower hydraulic conductivity and a high water holding capacity. Sometimes when there is a compacted layer of clay underground it can lead to flooding after heavy storms. Water does not have anywhere to go in such a short time, so its level goes higher and eventually floods our plants. Moreover a higher percentage of clay and silt in the soil will increase the cation exchange capacity. It is an ability of the soil to hold positively charged nutrients called cations (calcium, magnesium, potassium and ammonium–N). On our planet we have 12 different soil types known as orders. Each one of them needs a different treatment and farmers should know about these practices. How a farmer manages the farm can have crucial impacts on the environment. Unfortunately, many of the farmers are not familiar with the information mentioned in this blog. Many times, poor water management can lead to severe contamination of near by watersheds. We need to remember that farming is a complex process that also needs studying and a constant exchange of information. We encourage individuals, both farmers and non-farmers, to sign up for various online courses on Coursera. A free course on Land Misuse and Management can be accessed through here. ",
            "date": "Answered August 11, 2016",
            "views": "71",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jessica Awomi",
                    "user_href": "/profile/Jessica-Awomi"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Sangeeta-AHLAWAT-7"
                },
                {
                    "user_id": "Gerry Mrosso",
                    "user_href": "/profile/Gerry-Mrosso"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/ANIME-Life-53"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chandan M Angadi",
                "href": "/profile/Chandan-M-Angadi"
            },
            "answer_text": "Let us start the discussion by elaborating the definition of the soil. soil → is a mixture of minerals, organic matter, gases, liquids, and countless organisms that together support life on Earth (def. from wikipedia) From the definition itself it is clear that soil is the rudimental part of the evolution. It is the primary base of the biosphere. we can define various importances of soil such as It’s a conduit/medium for plant growth → Human being/organisms is dependent on plant to fulfill his appetite and absorb oxygen which is the lifeline of the human body. so it is implicit that without soil it will be tough for human being/organisms to survive.soil absorbs the atmospheric nitrogen and fixes it to the plants hence maintaining the nitrogen cycle. soil also takes part in carbon-cycle and hence it helps in maintaining levels of carbon in the atmosphere soil also act as a ‘carbon sink’(absorbing the atmospheric ,terrestrial carbon and storing it ) 4. Plays vital role in maintaining phosphorous cycle.  5. It act as a stable medium to construct the buildings, houses ,dams ,powerplants etc. 6. It is one of the major source of almost all the minerals and precious rocks apart from the ocean. 7. Helps rain water to get drain/infiltrate and thus forming a ‘AQUIFER’(source of drinking water apart from lakes) and also helps to recharge underground water.  8. soil itself maintains its moisture thus helping the plants to grow. 9. Apart from the pedology (study of soil) it forms the major chunk of study in geology. 10. Everything in geography starts with soil and ends with soil. ",
            "date": "Answered June 6, 2016",
            "views": "377",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tasha D'Souza",
                    "user_href": "/profile/Tasha-DSouza-1"
                },
                {
                    "user_id": "Riya Natha",
                    "user_href": "/profile/Riya-Natha"
                },
                {
                    "user_id": "Madan Kumar",
                    "user_href": "/profile/Madan-Kumar-901"
                },
                {
                    "user_id": "Neera",
                    "user_href": "/profile/Neera-19"
                },
                {
                    "user_id": "Manoj Biswal",
                    "user_href": "/profile/Manoj-Biswal-28"
                },
                {
                    "user_id": "Akshat Kumar",
                    "user_href": "/profile/Akshat-Kumar-175"
                },
                {
                    "user_id": "Shubham Panday (शुभम पाण्डेय)",
                    "user_href": "/profile/शुभम-पाण्डेय-Shubham-Panday-शुभम-पाण्डेय"
                },
                {
                    "user_id": "Suvidha Mathur",
                    "user_href": "/profile/Suvidha-Mathur"
                },
                {
                    "user_id": "Punit Pawar",
                    "user_href": "/profile/Punit-Pawar-4"
                },
                {
                    "user_id": "Utkarsh S",
                    "user_href": "/profile/Utkarsh-S-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kirtan Patel",
                "href": "/profile/Kirtan-Patel-67"
            },
            "answer_text": "It is difficult to find important of soil in human life.Because soil is the basic utility for the existence of life on earth. Soil is the basic need for plant,crops or other vegetation to grow.Soil is responsible for biodiversity process through which dead body of plants and animals decompose.Soil is important in providing an edequate water supply.The water absorption properties of soil play a role in reducing pollution from chemicals in pesticides and other compounds.Various minerals can be found from soil.Soil also witnesses the history of human ancient culture. ",
            "date": "Answered February 6, 2018",
            "views": "86",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mh Lupet",
                    "user_href": "/profile/Mh-Lupet"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/ASHA-S-M-2"
                },
                {
                    "user_id": "Subhra Saha",
                    "user_href": "/profile/Subhra-Saha-29"
                },
                {
                    "user_id": "V C YESWANTH",
                    "user_href": "/profile/V-C-YESWANTH"
                },
                {
                    "user_id": "Veerendra Babu Yanamala",
                    "user_href": "/profile/Veerendra-Babu-Yanamala"
                },
                {
                    "user_id": "Nidhi Patidar",
                    "user_href": "/profile/Nidhi-Patidar-13"
                },
                {
                    "user_id": "Samuel Somto",
                    "user_href": "/profile/Samuel-Somto"
                },
                {
                    "user_id": "Pankaj Kumar",
                    "user_href": "/profile/Pankaj-Kumar-11090"
                },
                {
                    "user_id": "Ruby Poddar",
                    "user_href": "/profile/Ruby-Poddar-7"
                },
                {
                    "user_id": "Manoj Biswal",
                    "user_href": "/profile/Manoj-Biswal-28"
                },
                {
                    "user_id": "Ruchi Jindal",
                    "user_href": "/profile/Ruchi-Jindal-8"
                },
                {
                    "user_id": "Priyank Shah",
                    "user_href": "/profile/Priyank-Shah-166"
                },
                {
                    "user_id": "Cristiano Dp",
                    "user_href": "/profile/Cristiano-Dp"
                },
                {
                    "user_id": "Abhinav Shrestha",
                    "user_href": "/profile/Abhinav-Shrestha-5"
                },
                {
                    "user_id": "Samyak Jain",
                    "user_href": "/profile/Samyak-Jain-412"
                },
                {
                    "user_id": "Ashu Jha",
                    "user_href": "/profile/Ashu-Jha-37"
                },
                {
                    "user_id": "Shubhangi Singh",
                    "user_href": "/profile/Shubhangi-Singh-188"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rakhi Kumari",
                "href": "/profile/Rakhi-Kumari-81"
            },
            "answer_text": "Soil is the most wonderful gift as a resource by nature. Soil is a mixture of rocks,broken down by weathering and erosion over a long period of time, different minerals which contribute in its nutrients value are mixed, decayed organic matter, water,air,along with billions of living organisms, most of them are as microscopic decomposers. Soil from the base of all life on lands, specially mankind who is supported by soil,food growing capacity. Soil also helps decompose and recycle biodegradable wastes apart from helping in storing water and regulating the earth climate by removing carbon dioxide from the atmosphere and storing it as carbon compounds.  It takes million of years in soil formation by its natural means and this must be realised by man before contributing in its destruction. Sources: Ecology &Environment By K.Siddhartha ",
            "date": "Answered December 7, 2017",
            "views": "9",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Heera Kumawat",
                    "user_href": "/profile/Heera-Kumawat"
                },
                {
                    "user_id": "Aaisha Hassan",
                    "user_href": "/profile/Aaisha-Hassan"
                },
                {
                    "user_id": "Vaishali Sinha",
                    "user_href": "/profile/Vaishali-Sinha-15"
                },
                {
                    "user_id": "Amrita Anand",
                    "user_href": "/profile/Amrita-Anand-35"
                },
                {
                    "user_id": "Alka Tiwari",
                    "user_href": "/profile/Alka-Tiwari-43"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tony Smyth",
                "href": "/profile/Tony-Smyth-6"
            },
            "answer_text": "Good answer from Rob there. Its not just important, it is essential. A lot of the worlds soil has been badly degraded by industrialised farming and the removal of trace elements. Plus also we lose a lot of topsoil by tilling, which causes the topsoil to be removed by the action of wind and rain. Poor soil = poor quality food and hence bad nutrition. I wrote more on this here: Tony Smyth's answer to Why is soil a non-renewable resource? PS: Here is a link to an article I just received about the link between soil quality and health. This too illustrates the importance of soil to human life. The True Cost of Food ",
            "date": "Updated October 4, 2017",
            "views": "88",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Greg Tingey",
                    "user_href": "/profile/Greg-Tingey"
                },
                {
                    "user_id": "Kathleen Winitsky",
                    "user_href": "/profile/Kathleen-Winitsky"
                },
                {
                    "user_id": "Puteri Maisarah",
                    "user_href": "/profile/Puteri-Maisarah-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ryan Scientist",
                "href": "/profile/Ryan-Scientist"
            },
            "answer_text": "It’s very important, from the stuff we eat to the stuff we put in rocket fuel, soil has been man’s ally for tens of thousands of years! We would starve without soil to grow food in, we would have to only use solar power, Which will actually be impossible because of the lack of metal, and we would not be able to survive because there would be no trees or oxygen to breathe. Soil is very important to human life on earth. ",
            "date": "Answered March 28, 2018",
            "views": "927",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Anders Kouru",
                    "user_href": "/profile/Anders-Kouru"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mihir Kulkarni",
                "href": "/profile/Mihir-Kulkarni-95"
            },
            "answer_text": "Soil is the foundation of major living entities on the earth. Most of the important things in life are based on soil. It forms the ecological layer called lithosphere of the earth which sustains numerous life forms. Soil is useful for agriculture, plant growth, construction, minerals, various materials from soil used for manufacturing metals, non-metals, precious substances like silicon, bricks, clay ware, and so on. We cannot imagine our life without soil. Thus the soil teaches us qualities like tolerance, patience and stability. ",
            "date": "Answered May 24, 2018",
            "views": "34",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Wen Llarena",
                    "user_href": "/profile/Wen-Llarena"
                },
                {
                    "user_id": "Kwesi Acquah",
                    "user_href": "/profile/Kwesi-Acquah-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cliff Kleymeyer",
                "href": "/profile/Cliff-Kleymeyer"
            },
            "answer_text": "Soil is the matrix for most of the earth’s flora except for epiphitic or hydroponic plants. It also serves as a place where bacteria, micro-organisms, insects, worms and small animals can exist and break down organic material in the soil. We derive food directly from plantlife and indirectly from animals who eat plants or other animals. Soil also fixes nitrogen when lightening strikes the earth. Soil gives plants a foothold for plants which moderates erosion. ",
            "date": "Answered August 7, 2018",
            "views": "634",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jimmy Higgins",
                "href": "/profile/Jimmy-Higgins-1"
            },
            "answer_text": "Not much. Humans do nto need soil to live, but currently it is where we have most of our structures and food supplies. But all that can be transferred to the larger part of the Earth’s surface, the Oceans and humans would be fine. If all the plants and animals of the landmasses died today, we are screwed. But if there were a gradually dies off, moving humanity to the oceans would be possible and humans don’t need soil. ",
            "date": "Answered March 28, 2018",
            "views": "17",
            "upvotes": " Answer requested by Abhinav Shrestha",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/ANIME-Life-53"
                }
            ]
        },
        {
            "author_info": {
                "name": "Janardhan",
                "href": "/profile/Janardhan-20"
            },
            "answer_text": "Soil is important as a ecological point of view, for growing food, without proper suitable soil you cannot grow crops to feed the millions with unsuitable soil. Therefore soil fertility and the ecosphere is more important. But with view of building a road or a buildings different set of rules are applied as far as the soil is concerned,it should not be water logged and the bearing capacity of the soil should be more. All these are of important for the soil to us. ",
            "date": "Answered May 15, 2018",
            "views": "2",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David A.Watts",
                "href": "/profile/David-A-Watts"
            },
            "answer_text": "Soil is the vital part of the natural environment. Soil is the part of the cultural heritage. It is as important as plants, animals, wind and water. It provides habitat for wide range of organisms. It controls the flow of water and the chemical substance between the atmosphere and the earth and acts as both a source and store for the gases. It influences the distribution of the plant species. ",
            "date": "Answered June 17, 2016",
            "views": "19",
            "upvotes": " View 1 Upvoter"
        }
    ]
}