{
    "title": "How did the banana peel become the “slippery” item that causes people to fall? - Quora",
    "tags": [
        "Banana Peels",
        "Bananas",
        "Fruit",
        "Science of Everyday Life",
        "Human Body",
        "Science",
        "Food",
        "Health",
        "Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Howell",
                "href": "/profile/Peter-Howell-19"
            },
            "answer_text": "You can partly blame these guys.  It was a go-to gag in the silent movies, with each of the physical comedians creating their own variations. This was the introduction of the idea is mass media, but the gag started in vaudeville. Slippery bananas goes back even further however. When bananas started being important from central American plantations, they became very cheap and popular street food in many US cities. This was not long before the Civil War. The discarded skins were considered a public nuisance. That’s where the idea of using it for pratfalls originated. “Sliding” Billy Watson built an act around it after seeing real-life examples, the movie actors picked it up, and it’s been part of the comedic zeitgeist ever since. How Did Slipping on a Banana Peel Become a Comedy Staple? ",
            "date": "Answered October 23, 2020",
            "views": "275",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Karen Fitzgerald",
                    "user_href": "/profile/Karen-Fitzgerald-77"
                },
                {
                    "user_id": "Yaacov Lazar",
                    "user_href": "/profile/Yaacov-Lazar"
                },
                {
                    "user_id": "Tony Nguyen",
                    "user_href": "/profile/Tony-Nguyen-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zara Rowlands",
                "href": "/profile/Zara-Rowlands-1"
            },
            "answer_text": "It is the most likely fruit to be carried and eaten on the go, and that has a discarded peel. Many other fruit are eaten peel and all so there is nothing to slip on. ",
            "date": "Answered October 23, 2020",
            "views": "62",
            "upvotes": " Answer requested by Darian Jackson"
        }
    ]
}