{
    "title": "How to develop more of an interest in math and science - Quora",
    "tags": [
        "Science and Mathematics",
        "Science Education",
        "Teaching Mathematics",
        "Self Motivation",
        "The High School Experience",
        "Learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Akash Chaurasia",
                "href": "/profile/Akash-Chaurasia-20"
            },
            "answer_text": "As you are asking “how” did I gain interest in mathematics and science, i will share my story which is not very inspiring but can give you essence of going forth in these majors. Until i was in class 5 i had no idea what these subject are and how interesting they can be. I assumed that these are just common and wierd subjects as social science and English (seriously i hated both social and english. dont know why but now i realise that due to the method of teaching or my fault). I Gave freaking looks on my science and maths teacher. Then after stepping to class 6 i started gaining interest in science. (Major reason was my science teacher who taught us very well and interestingly he was mocking and weird man i ever seen in my life). I gained good knowledge in science and i was changed to Normal students from dumb student. Maths story was quite different. There was one guy (lets say him A ) who i hated a lot just because of his bold and arrogant nature. But he was good in maths and probably best in class. I feel irritated and this inspired me to study mathematics and give tough competition in class. (The guy mentioned above is now my best friend and we both give healthy competition to each other. We assume ourselves “brothers”) So in math i changed from dumb to normal student. Class 6 -8 was spent as a normal student with good interest in mathematics. But the major change came after passing class 8. Exams were over and we were planning to do something new. I came to know about IIT from this guy A who told me how prestigious this institute was and how hard it was to crack JEE. So we decided to enroll in one foundation course and soon we both were the best in class for our calculation speed and extra knowledge.whenever our maths and science teacher ask question or numerical we were first to raise hands. (We say to ourselves that “ those were the days of legends!! ) Now from class 9 to 10 i was changed from normal student to a good student. You see the transformation dumb < Normal < Good. Lets sum up here . The conclusion is : Gaining interest in maths and science is not a big deal. The only difference is our approach to these subject and other factors ( which you may have noticed in the beginning of my answer). You cannot control “other factors” but you can definitely control your approach and that will certainly change these factors in favour of you. ",
            "date": "Answered June 30, 2017",
            "views": "763",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sonu Verma",
                    "user_href": "/profile/Sonu-Verma-702"
                },
                {
                    "user_id": "Himanshu Chhatpar",
                    "user_href": "/profile/Himanshu-Chhatpar-1"
                },
                {
                    "user_id": "Manju Prasath",
                    "user_href": "/profile/Manju-Prasath"
                },
                {
                    "user_id": "Swaroop M",
                    "user_href": "/profile/Swaroop-M-19"
                },
                {
                    "user_id": "Sovit Ranjan Rath",
                    "user_href": "/profile/Sovit-Ranjan-Rath-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dominic Dsouza",
                "href": "/profile/Dominic-Dsouza-13"
            },
            "answer_text": "How do I gain interest in mathematics and science ? Now I don't know which year you are in , considering your question you said mathematics and science , didn't specify physics/biology/other science subjects Considering you are in school still , I would advise you don't skip any concepts even the ones which are unnecessary looking one's Because if you make a habit of skipping them later on you wouldn't know what you don't know And mainly PRACTICE , in the beginning it gets really annoying for not understanding them , which is why you start losing interest in the subject , you just have to pull through that phase Once you do you will start to develop interest in the subject , if you forget a concept were it down till you remember , forgot the theorem ? Write it down so many times that even if someone wakes you up at 3 am and ask you to write the theorem you should be able to (my maths sir had told this) Same goes for science , know the meaning of the term DO NOT MUG UP ANSWERS , you have access to the internet use it , try to find the meaning and you will start developing interest in the subject ",
            "date": "Answered October 5, 2019",
            "views": "154",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sonu Verma",
                    "user_href": "/profile/Sonu-Verma-702"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mohd Sufyan (मोहम्मद सुफ़यान)",
                "href": "/profile/Mohd-Sufyan-मोहम्मद-सुफ़यान"
            },
            "answer_text": "STEM subjects have always been too damn lovable. Why, you ask? Well, the answer is easy. I always viewed Chemistry as blowing things up. I viewed Physics as understanding the world, better. At least better than Civics. I viewed Biology as — Actually, nevermind. I hate biology. I viewed Maths as what it is. Numbers. Fucking numbers. People are scared of numb — “Cut the crap! Tell us about Biology! It falls in Science!” Fine. Biology has all aforementioned subjects in it. Maths: “x amount of y is present in z and their movement around…”Chemistry: “x amount of y is present in z and their movement around…”Physics: “x amount of y is present in z and their movement around…”So, would I rather study all the STEMs than 3? No, thanks.  Answered as my “I hate topics” session. ",
            "date": "Answered June 25, 2017",
            "views": "374",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aryan Kumar",
                    "user_href": "/profile/Aryan-Kumar-221"
                },
                {
                    "user_id": "Nachiket Agrawal",
                    "user_href": "/profile/Nachiket-Agrawal"
                },
                {
                    "user_id": "Chhanboiha Ralte",
                    "user_href": "/profile/Chhanboiha-Ralte"
                },
                {
                    "user_id": "Frank Wei",
                    "user_href": "/profile/Frank-Wei-19"
                },
                {
                    "user_id": "Sam Smith",
                    "user_href": "/profile/Sam-Smith-820"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Schudy",
                "href": "/profile/Eric-Schudy"
            },
            "answer_text": "Why do want to? Money? I guarantee there are better ways to make more. Curiosity? Then take a field for which you already have a passion, and find the connections. For example: painting. Did you ever think to study the chemistry behind the colors and oils? Or how perspective has a mathematics foundation? I guarantee you there are interesting connections to ANY fields of endeavor. ",
            "date": "Answered December 29, 2018",
            "views": "92",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Prashanth Navle",
                "href": "/profile/Prashanth-Navle"
            },
            "answer_text": "Math is problematic science is nothing but the things around you , if you are quite generous about the things around you I.e, the technology the numericals etc., you will surely respect the subjects for the technology around you ., bit as per consideration of marks make a habit of studying , its quite difficult but while studying science corelate the things which are growing and developing around you , and you will definitely generate respect and ibtrestvin this field …..! ",
            "date": "Answered June 25, 2017",
            "views": "153",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Robert Pavlovski",
                    "user_href": "/profile/Robert-Pavlovski"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rajat Shetty",
                "href": "/profile/Rajat-Shetty-22"
            },
            "answer_text": "As per my experience the things we run away from are the things that are usually boring or the things we personally dont like. So fusing them with things we like or have fun doing in would be the best possible way through. These are the subjects of practically utmost importance. so ignoring them is never gonna help you. Fusing them with dance, music, favourite games would help to overcome ua boring attitude towards these subjects. ",
            "date": "Answered June 27, 2017",
            "views": "91",
            "upvotes": "0"
        }
    ]
}