{
    "title": "How can a black hole be massive but not big? - Quora",
    "tags": [
        "Black Holes"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cihad Kıbrıs",
                "href": "/profile/Cihad-Kıbrıs"
            },
            "answer_text": "Why black holes are massive yet have exceptionally small sizes entirely boils down to the gravity/mass of progenitor stars. Briefly, when a star runs out of its fuel, i.e hydrogen, to maintain the nuclear fusion, which is what creates the required outward pressure to counterbalance the inward pull of gravity, the star starts to collapse in on itself. That is, the star's own gravity pulls matter as close to each other as possible in the absence of an opposing force, reducing the star in size and increasing its density. If the remaining core of the star is adequately massive (more than about 3 solar mass), there is no known or conjectured mechanism in the universe to keep the stellar core from further contracting and eventually it becomes a black hole. Another example is neutron stars. Their radii decrease as their masses increase. The diagram below demonstrates a family of curves, each of which represents individual mass-radius relation for different equations of state of neutron stars. Notice how their radius shrinks with the increasing mass.  Just not to be misleading, i want to point out a subtlety which can potentially cause confusion in lay audience. The size of black holes, by which i mean their corresponding Schwarzchild radius, gets bigger as their mass increases. More massive stars, typically between 10–20 solar masses, give birth to more sizeable black holes to begin with and they can grow even more sizeable through infalling matter and radiation but this is a different story. [math]R_{blackhole}=\\dfrac{2GM}{c^2}[/math] However, unlike black holes, the size of neutron stars gets smaller as their mass increases. More massive stars, typically between 1–3 solar masses, result in smaller sized neutron stars. [math]R_{neutronstar}=\\dfrac{15.46}{(M/M\\odot)^{1/3}} km[/math] where [math]M_\\odot[/math] is the mass of the Sun. After all, both are shrunk and compact end products of the process of implosion. ",
            "date": "Answered May 18, 2018",
            "views": "16",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Cesar Alcaraz",
                    "user_href": "/profile/Cesar-Alcaraz-7"
                },
                {
                    "user_id": "Alex Johnston",
                    "user_href": "/profile/Alex-Johnston-39"
                },
                {
                    "user_id": "Omayma Hmidi",
                    "user_href": "/profile/Omayma-Hmidi"
                },
                {
                    "user_id": "Swati Gautam",
                    "user_href": "/profile/Swati-Gautam-5"
                },
                {
                    "user_id": "Krishna Rowter",
                    "user_href": "/profile/Krishna-Rowter"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akademe Foundation",
                "href": "/profile/Akademe-Foundation-1"
            },
            "answer_text": "Black holes are subject to Heisenberg uncertainty. If you know where it is, you cannot observe its magnitude. You can observe the magnitude of everything else acting on it (equations below). It is a special field condition of perfect order which is what connects it to the perfect disorder of its relative light horizon (up to 46.85 Gly away where the magnitude but not position can be observed).  As for the anatomy and its size, a black hole consists of two distinct manifold spaces. Only the singularity has value, and it defines an enfolding surface tension (quantum gravity). The second manifold is attributed value into which the universe pushes matter until a quantum number triggers exclusion (quasar). The size of this anatomy is tricky because it is a subspace defined by a change function independent of time. The function is an imaginary operator. The singularity displaces that part of phase space (the fabric of spacetime) leaving another imaginary operator defining a parallel subspace. This is the space swirling things into the black hole fitting the above equations. The variable in each of these is the value changing until that definition of spacetime is filled. A space cannot be defined the same way (e.g. as a surface or volume) twice at the same time (exclusion). Imaginary axes tend to confuse most people, even physicists and mathematicians. When your field goes to zero or infinite, check to be sure it didn’t go down an imaginary axis lest you lose things. ",
            "date": "Answered May 17, 2018",
            "views": "419",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "George Yool",
                    "user_href": "/profile/George-Yool"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexander Dratsenko",
                "href": "/profile/Alexander-Dratsenko"
            },
            "answer_text": "Once upon a time (recently) it was said that black holes are neutrons packed together as tightly as they can be. Now days, black holes are suspected to be comprised of some kind of matter that is infinitely dense and has properties that scientists cannot fully understand by the Physics our human race understands so far. Infinity exists by virtue of mathematics that does give humanity some kind of a reference of a totally abstract meaning of some thing that is impossible to exist in our universe (so it seems). Imagining something that is infinitesimally small exploding into the “big bang” as we postulate which still seems to be expanding all the matter from this event into a universe that is possibly infinitely large. Well, after all, the basic number line that starts at zero and goes to positive infinity or negative infinity. Where in nature can we find negative infinity, zero, and positive infinity? Only in mathematics, so far. ",
            "date": "Answered October 3, 2019",
            "views": "118",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Zhengdong Chen",
                "href": "/profile/Zhengdong-Chen"
            },
            "answer_text": "Because the black hole, itself, is not black, or a hole. The reason it is black is because of the fact that the gravity is so strong and intense that even light can not escape up to a certain distance away from the black hole itself, and thus we perceive the black hole as a black sphere. The hole itself is the event horizon, the line in space where even light can not escape anymore, making it impossible to get out of a gravitational vacuum of a black hole once beyond the event horizon. The black hole, itself, is a singularity. A singularity is a single point in space, with no volume or scalar measurements of size, where lots and lots of mass is concentrated, resulting in the extreme gravitational strength and pull. ",
            "date": "Answered January 7, 2018",
            "views": "186",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hal MacLean",
                "href": "/profile/Hal-MacLean-1"
            },
            "answer_text": "When you consider the terminology - as a loose description, Mass is simply a count of the number of atoms within an object. Big… implies size… is how far apart those atoms are spaced. An item can be massive, yet very small. Or massive and very big. It’s perfectly possible to get a load of water molecules into a small space, closely packed together. It’s called ice, so think of an ice cube from your freezer.. Take the same amount of molecules and heat them so they become steam, the molecules are now much further apart, but they are the same number of molecules. They take up more room, but have the same mass as the original ice cube. ",
            "date": "Answered January 6, 2018",
            "views": "140",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David W. Vogel",
                "href": "/profile/David-W-Vogel"
            },
            "answer_text": "While we’re on the subject, how can an electron have mass but zero size? The electron is thought to have zero size because with collisions of greater and greater energy we have yet to find anything there but its electric and gravitational fields. It’s as if the fields themselves are all that exist. The same goes for a gravitational singularity. ",
            "date": "Answered January 5, 2018",
            "views": "352",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shahmir Siddiqui",
                    "user_href": "/profile/Shahmir-Siddiqui-4"
                },
                {
                    "user_id": "Claude Lambert",
                    "user_href": "/profile/Claude-Lambert-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suhani Chouhan",
                "href": "/profile/Suhani-Chouhan"
            },
            "answer_text": "Stellar black holes form when the center of a very massive star collapses in upon itself. This collapse also causes a supernova, or an exploding star, that blasts part of the star into space. Scientists think super massive black holes formed at the same time as the galaxy they are in.  ",
            "date": "Answered January 5, 2018",
            "views": "108",
            "upvotes": "0"
        }
    ]
}