{
    "title": "How rigorous is the science behind GlassesOff? - Quora",
    "tags": [
        "GlassesOff",
        "Ophthalmology",
        "Eyesight"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anat Koren",
                "href": "/profile/Anat-Koren"
            },
            "answer_text": "GlassesOff's innovation is based on over 20 years of scientific research into the field of perceptual learning, which has yielded a real breakthrough in visual skills' enhancement by improving image processing speed and efficiency of the brain's visual cortex without altering optical functions of the eyes.  There are several renowned achievements in the area of perceptual learning, including solutions for visual conditions such as amblyopia, loss of vision resulting from stroke, and others. GlassesOff's scientists have been able to develop a unique technology of brain training that significantly improves near vision capabilities by boosting the brain’s image processing abilities. Several controlled studies conducted with our technology have proven its effectiveness, which is also supported by users’ feedback, including a study conducted at the University of California at Berkeley, USA and published in Nature’s Scientific Reports:-      This study clearly demonstrated the significant benefit of the GlassesOff training program for reading abilities and eye age. -      Moreover, cutting-edge optometric equipment allowed the scientists to unequivocally determine that the actual source of the observed benefits is solely in the brain and not in the optics of the eyes. ",
            "date": "Answered February 6, 2014",
            "views": "800",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Daniel Buchuk",
                    "user_href": "/profile/Daniel-Buchuk"
                }
            ]
        },
        {
            "author_info": {
                "name": "Blair O'Reilly",
                "href": "/profile/Blair-OReilly"
            },
            "answer_text": "Despite changes in neural processing, the physical changes that happen to the eye will still occur.   You still will need reading glasses. Neural processing will not change the physiology of the eye.  The effects of GlassesOff can be considered a type of visual illusion where perceived near vision improves without the use of glasses.   This gives false hope that a realistic long-term solution for presbyopia besides glasses exists.   It doesn't.  Don't fall for it.  If you want the best vision at near, make sure to have an accurate glasses Rx.  Most everyone needs reading glasses eventually.  It is part of the human condition. ",
            "date": "Answered April 8, 2016",
            "views": "890",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Allieya Perry",
                    "user_href": "/profile/Allieya-Perry"
                }
            ]
        }
    ]
}