{
    "title": "How does Russia continue to produce cutting edge military technology despite the dissolution of the USSR? - Quora",
    "tags": [
        "Edge Technologies",
        "Cutting Edge Technology",
        "Russian Armed Forces",
        "Collapse of Soviet Union (1985-1991)",
        "Soviet Union",
        "Military Technology",
        "Weapons",
        "Russia"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abhirup Sengupta",
                "href": "/profile/Abhirup-Sengupta-5"
            },
            "answer_text": "Cutting edge military technology you say? In last 20 years the US fielded 3 generations of AESA radars on their Fighters while today Russia is yet to have a single operational AESA radar on a Fighter. The Mig-35’s Zhuk-AME won’t be operational until 2021 at the earliest.[1]  The most capable radar on a Russian Fighter, Irbis-E has a SAR resolution (3 meter) comparable to F-15E’s APG-70 radar from 1980s.[2] The mighty Irbis-E has a maximum targeting range of 250 km against B-52 class target in air-air and in air-ground can’t engage a Naval Destroyer beyond 100 km – according to the manufacturer.  KNAAPO’s Su-35 brochure The Su-57 according to Sukhoi’s own patent[3] has an intended RCS of 0.1 – 1 m^2[4] – which put it short, is comparable to that of F-18E Super Hornets. Even the F-117 designed 40 years ago had orders of magnitude lower RCS than Su-57. In what world you call that cutting edge? The US started using kinetic kill warheads for Ballistic Missile Defence since 2000 with PAC-3. Today PAC-3MSE, THAAD or SM-3 along with most Western interceptors use kinetic-kill warheads while Russia still continue to use fragmentation warhead for Missile Defence. The A-135 in Moscow still use old-fashion nuclear warheads. Without kinetic kill warhead, you’re not even on the same page. Not to mention that Russia has no exo-kinetic interceptor. Forget US, the Russian Missile Defence is decades behind Israel (Arrow-3). The older SPY-1D(v) radar on Aegis ship has more than twice the range of mighty S-400’s 91N6E Search radar. The SPY-1D(v) can detect a 0.4 m^2 ballistic target from 587 km[5] compared to S-400 detecting it from 250 km.[6] The new SPY-6 GaN radar has over 3.2 times greater range than SPY-1.[7][8]  Yet the S-400 is portrayed as some cutting edge or out-of-the-world Air Defence system. Never mind lack of any combat record despite getting multiple opportunities. Russia’s Khmeimim air base in Syria faced multiple drone attacks – some resulting in damaged aircraft and multiple Russian personnel being killed & injured.  Russia Confirms Syria Attack But Denies Seven Aircraft Got Destroyed As Photos Emerge The mighty S-400 was deployed on that base since 2015[9] but had never attempted to intercept any drone despite repeated failure of point defence systems. In recent years we saw IAF releasing footage of destroying at least 3 Pantsir-S1 on two separate occasions[10] and in March Turkey destroyed multiple Pantsir-1 protecting Syrian forces. That’s your latest Russian point defence system being destroyed using simple PGMs & UAVs, no fancy weaponry – and it’s supposed to defend saturation attack from LO cruise missiles amidst heavy jamming environment & decoys. This isn’t to bash Russian military, there’s no doubt that they produce some very good systems that definitely pose a significant threat. But the notion of Russia producing “cutting edge technology” is mere Propaganda. Marketing vanilla figures that have little relevance in real world while hiding relevant data is pretty common across Russian military – Irbis-E is a really good example. How is IRBIS-E such a powerful radar installed in SU 35, in spite of it being a PESA radar? For over a decade Russia glorified S-400 for its “400 km engagement range” while the SAM (40N6) with 380 km range didn’t become operational until just end of 2018[11] and little do many realize that 40N6 is optimized for non-manoeuvrable strategic targets (AWACS, Bombers, etc.) – against Fighter aircraft, S-400’s engagement range is restricted bellow 250 km with 48N6E2.  Revealed: Characteristics of 40N6 long-range anti-aircraft missile Never mind the hyped-up 40N6 with alleged “anti-satellite” capability[12] and Mach 14 speed[13] actually has smaller engagement altitude against ballistic missiles (15 km) than PAC-3 and Mach 3.5 speed according to the manufacturer. Look beneath the propaganda and you’ll see that Russian technology is nowhere close to being ‘cutting edge’. This is mostly because Russia significantly lag behind in the semiconductor industry and this is before you account Russian economy being a limiting factor towards large-scale modernisation. Whatever new design Russia boasts about, their economy severely limits large scale production or fleet-wide transition. Forget the leading operational BVR missile R-77–1 being significantly behind Western counterparts[14] – today majority of Russian Fighters use non-Imaging IR or semi-active radar guided missiles (R-27T/ER).[15] It’s cool to see Russian Fighters pleasing the audience at airshows but when you look at things that actually matter in combat, the gap is far bigger than the general perception. Footnotes[1] Phazotron-NIIR readies new AESA radar for Russian fighter trials[2] Google Translate[3] Attention Required![4] http://Sukhoi Su-57 Patent – RCS Reduction[5] Missile Defense Advocacy Alliance[6] НЕВСКИЙ БАСТИОН, ВОЕННО-ТЕХНИЧЕСКИЙ СБОРНИК, ВООРУЖЕНИЯ, ВОЕННАЯ ТЕХНИКА, ВОЕННО-ТЕХНИЧЕСКИЙ СБОРНИК, СОВРЕМЕННОЕ СОСТОЯНИЕ, ИСТОРИЯ РАЗВИТИЯ ОПК, БАСТИОН ВТС, НЕВСКИЙ БАСТИОН, ЖУРНАЛ, СБОРНИК, ВПК, АРМИИ, ВЫСТАВКИ, САЛОНЫ, ВОЕННО-ТЕХНИЧЕСКИЕ, НОВОСТИ, ПОСЛЕДНИЕ НОВОСТИ, ВОЕННЫЕ НОВОСТИ, СОБЫТИЯ ФАКТЫ ВПК, НОВОСТИ ОПК, ОБОРОННАЯ ПРОМЫШЛЕННОСТЬ, МИНИСТРЕСТВО ОБОРОНЫ, СИЛОВЫХ СТРУКТУР, КРАСНАЯ АРМИЯ, СОВЕТСКАЯ АРМИЯ, РУССКАЯ АРМИЯ, ЗАРУБЕЖНЫЕ ВОЕННЫЕ НОВОСТИ, ВиВТ, ПВН[7] | InsideDefense.com[8] Sailors Get a Firsthand Look at the Navy's New SPY-6 Radar System[9] Second Russian S-400 in Syria confirmed[10] Israel targeted several Pantsir-S1 air defense system in Syria[11] Advanced long-range missile for S-400 system accepted for service in Russia[12] https://www.rt.com/news/239961-near-space-missile-defense/[13] Shoot at sight: The S-400 boosts Indian air defence[14] Abhirup Sengupta's answer to How does the R-77 compare with the AIM-120? What are the individual disadvantages and advantages of each missiles? How can the Russian and American pilots avoid themselves from getting hit?[15] Russia's Su-35 was Spotted Armed with a New Missile over Syria",
            "date": "Answered May 8, 2020",
            "views": "274",
            "upvotes": " View 343 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dan Gingrich",
                    "user_href": "/profile/Dan-Gingrich-2"
                },
                {
                    "user_id": "Stephen Arnett",
                    "user_href": "/profile/Stephen-Arnett-4"
                },
                {
                    "user_id": "Yogurt",
                    "user_href": "/profile/Yogurt-44"
                },
                {
                    "user_id": "Jason Purdue",
                    "user_href": "/profile/Jason-Purdue-1"
                },
                {
                    "user_id": "Ken Katz",
                    "user_href": "/profile/Ken-Katz-5"
                },
                {
                    "user_id": "Jack Wilson",
                    "user_href": "/profile/Jack-Wilson-316"
                },
                {
                    "user_id": "Phil Miller",
                    "user_href": "/profile/Phil-Miller-106"
                },
                {
                    "user_id": "William Go",
                    "user_href": "/profile/William-Go-5"
                },
                {
                    "user_id": "Ed Fragoso",
                    "user_href": "/profile/Ed-Fragoso"
                },
                {
                    "user_id": "Sankalp Sharma",
                    "user_href": "/profile/Sankalp-Sharma-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Wedrall",
                "href": "/profile/Mark-Wedrall"
            },
            "answer_text": "I take issue with your premise that Russia builds ‘cutting edge’ military technology at all. That’s a debatable issue and I’m not disrespecting your opinion. The Soviets/Russians had always been known for their less-than-superb equipment. They excel at basic quality production and only ‘lead the pack’ when it comes to reckless behavior and suicidal bravery. While traveling in southern Germany in 2006, I met a retired Soviet colonel with whom I had several fascinating conversations. After a few conversations, as I spent a week in Munich where he’d retired, his reserve faded and we discussed various aspects of our own personal military experiences. He lamented the disappointing quality of Soviet equipment in ‘all’ branches of their military. He explained that they had planes that fall, subs that sink, tanks that fail to start and rampant alcoholism in all ranks. The Russian navy is constantly reducing it’s ‘white water’ fleet because of their inability to compete on an equal footing with Western navies. He was glad to retire and get out just before the Soviet Union disintegrated. He also confirmed my suspicion that Soviet/Russian leadership suppressed any news that put that the military in a ‘bad light.’ The poor quality of the Russian equipment and lack of technological advances hasn’t improved since the breakup of the USSR. The Russians are constantly playing ‘catch up’ with Western advances. The Russians were always ‘reacting’ to the developments in Syria when fighting close to western forces. I don’t mean to dissuade you from your position. This is just something to consider for future discussions. I hope that helps. Take care. ",
            "date": "Answered May 3, 2020",
            "views": "12",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ankush Sharma",
                    "user_href": "/profile/Ankush-Sharma-67"
                },
                {
                    "user_id": "Mike Durrett",
                    "user_href": "/profile/Mike-Durrett-3"
                },
                {
                    "user_id": "Pawel Madziar",
                    "user_href": "/profile/Pawel-Madziar"
                },
                {
                    "user_id": "Ro Schofield",
                    "user_href": "/profile/Ro-Schofield"
                },
                {
                    "user_id": "Jacob Baumgardner",
                    "user_href": "/profile/Jacob-Baumgardner"
                },
                {
                    "user_id": "Myhailo Yavorskyi",
                    "user_href": "/profile/Myhailo-Yavorskyi"
                }
            ]
        }
    ]
}