{
    "title": "How do scientists know what exoplanets are made of? - Quora",
    "tags": [
        "Exoplanets",
        "Scientists",
        "Science of Everyday Life",
        "Astronomy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mats Andersson",
                "href": "/profile/Mats-Andersson-16"
            },
            "answer_text": "Scientists don’t know, but they can make a very good guess. For all exoplanets, we know how long it takes to orbit its star. That’s because it’s actually how we detect exoplanets: by seeing how it affects the starlight over time. For the exoplanets discovered by the transit method, we know their size. That’s because we can see how much the starlight dims. For exoplanets discovered by the radial velocity method, we know their mass. That’s because we can see how much they “pull” at their stars. For a very select few, we know both, because we can detect them with both methods. For a not quite as select few of them, but still only a fraction of them all, we can see that their atmospheres absorb starlight at specific frequencies that correspond to the elements present in the planet’s atmosphere. (That’s called spectroscopy, and is a huge field in its own right.) And with this, we can start figuring things out. We know that the biggest planets have to be mostly gas, because that’s simply how planets form: there’s no way of making a really big, or really heavy, planet without it sucking up a large quantity of gas. We can figure out how far from its star it orbits, so we can deduce the temperature; a small planet which is very hot can only hold on to a few gases and will be mostly made of rock. If we know both the size and the volume, we can figure out the density; a planet with low density cannot be made of rock, and a planet with high density cannot be mostly gas. We know how various elements form in the universe, and how they behave, so the proportions have to be pretty much the same as they are in our own solar system; we will not find planets made of solid gold out there, although it’s possible that we’ll find planets made of mostly metal (mostly iron, in that case). We can see what chemical elements are actually present on some of the planets, and we know roughly how they will behave at the temperature and gravity that the planet has. But it is important to realise that whatever you read in a newspaper, or a popular science magazine, is never the absolute, final word. If you go back to what the scientists actually said, you will find that they usually say things like “based on our observations, and the calculations here, we see that the data is consistent with the planet having these and these properties”. Sometimes they’re pretty certain, sometimes they just pick whatever they think is the most likely explanation. It’s a bit like a pathologist. Sometimes, the body has a knife sticking out of the chest; they will say that the person appears to have been stabbed to death. Sometimes, the body just has a heart that looks a bit worn out, and all the tests they could think of didn’t show any signs of poisoning, so they say it was natural causes. Sometimes, all they have is a skeleton, and all they can say is that no bones were broken. ",
            "date": "Answered October 22, 2018",
            "views": "762",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Markentosh Denino",
                    "user_href": "/profile/Markentosh-Denino"
                },
                {
                    "user_id": "Peter Knutsen",
                    "user_href": "/profile/Peter-Knutsen-1"
                },
                {
                    "user_id": "Krister Sundelin",
                    "user_href": "/profile/Krister-Sundelin"
                },
                {
                    "user_id": "Harish Tamhankar",
                    "user_href": "/profile/Harish-Tamhankar"
                },
                {
                    "user_id": "Phil Teunon",
                    "user_href": "/profile/Phil-Teunon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roberto Sanchis-Ojeda",
                "href": "/profile/Roberto-Sanchis-Ojeda"
            },
            "answer_text": "We know much more about the planets in the solar system because we can send probes to observe them directly! I wish we could send a mission to every exoplanet we discover, but unfortunately this is going to have to wait a few decades (if not centuries!). As Yeasir mentions, we can measure the masses and radii of many of the exoplanets that we have discovered. We think we have a good understanding of how planets can form. You first combine a lot of rocks to create a rocky core, and if there is any gas left surrounding the planet, this can end up forming the gaseous atmosphere surrounding the planet. Even if you only have the same amount of mass in the rocky core and the gaseous atmosphere, the gas will occupy a much larger volume, because of its low density, so the planet will look much larger. So for example, lets imagine that we find a planet with a mass eight times larger than Earth. If the planet was completely rocky, we would expect a density similar to the Earth's density, so the size would be approximately twice the size of Earth (it would be even smaller due to compression). If we measure its radius and it turns to be 4 times the size of Earth, we know there is a large gaseous envelope, like the one Neptune has. This is one of the ways we can say things about the composition of exoplanets. ",
            "date": "Answered November 6, 2015",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Donald Floyd FG",
                    "user_href": "/profile/Donald-Floyd-FG"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carol Linn Miller",
                "href": "/profile/Carol-Linn-Miller"
            },
            "answer_text": "Telescopes ARE NOT seeing, observing exoplanets, because they are WAY too small because they way too far away to be resolved.   Scientists use SPECTROSCOPES along with telescopes . THAT is how  they know  what parts of planets are made of, The rest is  by logical deduction. if a planet has a global magnetized field, it HAS to have an iron nickel sulfur core and relatively rapid rotation.. A telescope e alone  gives zilch information about chemical composition  of a planet or exoplanet or magnetic fields. @What is Spectroscopy? I'm tempted post ten hyperlinks to NASA remote sensing tutorials, but I do not spoon feed  hyperlinks that will probably be ignored. If you aren't curious enough to do your own online research, why should I bother. ",
            "date": "Answered October 24, 2015",
            "views": "391",
            "upvotes": " Not for Reproduction",
            "upvoters": [
                {
                    "user_id": "Asif Kabir",
                    "user_href": "/profile/Asif-Kabir"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yeasir Mohammad Akib",
                "href": "/profile/Yeasir-Mohammad-Akib"
            },
            "answer_text": "There are many ways we can detect exoplanet and the most useful methods are radial velocity method and transit method. Direct imaging method is used for detecting young exoplanet. Albedo number is useful because it tells us about the surface properties. Spectroscopy shows us about which elements are absorbed by the planet's atmosphere during the passing of light from it's host star. So if you combine the radial and transit method then you can get mass and radius of any planet from which we can get density. The density shows us the composition of the planet. A density diagram of our solar system objects is shown here.  Source: Internet Here are some links :http://lasp.colorado.edu/education/outerplanets/exoplanets.php#detection https://en.wikipedia.org/wiki/Exoplanet ",
            "date": "Updated September 25, 2018",
            "views": "862",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sergio D'Ambra",
                    "user_href": "/profile/Sergio-DAmbra"
                },
                {
                    "user_id": "Dillon Borges",
                    "user_href": "/profile/Dillon-Borges"
                }
            ]
        },
        {
            "author_info": {
                "name": "Misak Ghazaryan",
                "href": "/profile/Misak-Ghazaryan"
            },
            "answer_text": "beyond our solar system we cant see the planets themselves they're way too far away, we can detect them based on the gravitational/ lighting effects they have on their star, and we know what they're composed of because different elements effect light differently, if you break a light band up you can detect the types of elements it's been in contact with because they leave a signature, basically like a finger print for atoms, we can use these finger prints to detect the composition of the planets we're looking at. ",
            "date": "Answered August 11, 2015",
            "views": "484",
            "upvotes": " View 2 Upvoters"
        }
    ]
}