{
    "title": "How should I study organic chemistry? - NEET UG Discussion - Quora",
    "tags": [
        "All India Institute of Medical Sciences (AIIMS)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Priyesh Gautam",
                "href": "/profile/Priyesh-Gautam-4"
            },
            "answer_text": "Everybody will tell you read NCERT, make notes, well then you will have to mug up the reactions without knowing the mechanism behind it as every reaction's mechanism isn't explained in NCERT. By doing this you can achieve clearing NEET but trust me you will never feel confident in solving tricky questions of organic chemistry.You will not be asked directly the reactions given in NCERT, you will have to apply basic rules to proceed and get the result. And confidence is what will help you go from 600 to 650 or even more. So, I suggest: Don't study nomenclature much. Study basic rules. Don't solve naming of complex compounds as they have never been asked and will not be asked.Study Inductive effect, hyperconjugation, resonance, isomerism thoroughly. If you have a good teacher then, it's good and not then read a standard book.Study E1 vs E2, SN1vsSN2 thoroughly.Also you need to study the mechanism behind almost all the reactions of aldehyde ketone and alcohol.Always go for the mechanism, even if it is not given in the book. This will improve your applied aspect of different reactions that you have studied and their mechanism.Solve a standard set of questions. I'll not recommend MS Chouhan or any book, just modules of Aakash or Allen are enough.I was very fortunate to have a very good teacher of organic chemistry who taught me so well which is just beyond my imagination. I was a 2 year classroom program student at Aakash but, studied organic chemistry outside. Even my friends were stunned by my concepts and at how I so easily solved very tricky questions. I'm not bragging, I'm just trying to say that I was very lucky to have a teacher like that and how much a teacher plays role in building your concepts.Hope this helps.",
            "date": "May 4, 2020",
            "views": "43",
            "upvotes": " View 56 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shivangi Tamboli",
                    "user_href": "/profile/Shivangi-Tamboli-1"
                },
                {
                    "user_id": "Shree Varshan",
                    "user_href": "/profile/Shree-Varshan-1"
                },
                {
                    "user_id": "Ahmed",
                    "user_href": "/profile/Ahmed-1660"
                },
                {
                    "user_id": "Omkar Panigrahi",
                    "user_href": "/profile/Omkar-Panigrahi-2"
                },
                {
                    "user_id": "Soumyadeep Mukherjee",
                    "user_href": "/profile/Soumyadeep-Mukherjee-20"
                },
                {
                    "user_id": "Shayeri Sengupta",
                    "user_href": "/profile/Shayeri-Sengupta-1"
                },
                {
                    "user_id": "Stuti Gautam",
                    "user_href": "/profile/Stuti-Gautam-2"
                },
                {
                    "user_id": "Surendhra",
                    "user_href": "/profile/Surendhra-3"
                },
                {
                    "user_id": "Shubha Rana",
                    "user_href": "/profile/Shubha-Rana"
                },
                {
                    "user_id": "Smita Jha",
                    "user_href": "/profile/Smita-Jha-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sandeep Goyal",
                "href": "/profile/Sandeep-Goyal-185"
            },
            "answer_text": "Organic chemistry is vast and qus can be asked when examiner linked many reactions in to one. It's not going to be straightforward reaction as given in any standard book. So, follow strategy as below: Write, write and write standard reactions many times to remember. Without writing you are not going to make it.Solve as many as qus possible. Previous years qus papers.Randomly bring some reaction in your mind (after couple of days you first studies) and try to write again and check if you can still recall it or not.Collect all the name reactions at one place so that you can remember easily and pin point differences in those reactions.And never forget to practice…practice….practice",
            "date": "June 30, 2020",
            "views": "16",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tehreem Shaikh",
                    "user_href": "/profile/Tehreem-Shaikh-7"
                },
                {
                    "user_id": "Usha Bhargavi",
                    "user_href": "/profile/Usha-Bhargavi-3"
                },
                {
                    "user_id": "Manikarnika Jansi",
                    "user_href": "/profile/Manikarnika-Jansi-1"
                },
                {
                    "user_id": "Vasu Gwalleen",
                    "user_href": "/profile/Vasu-Gwalleen"
                },
                {
                    "user_id": "Sharmistha Sarangi",
                    "user_href": "/profile/Sharmistha-Sarangi-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Md Faisal Warsi",
                "href": "/profile/Md-Faisal-Warsi"
            },
            "answer_text": "Try to note down all the naming reaction given in Ncert book and revise it through its mechanisms . There is no need to study other extra naming reaction which is not given in Ncert book take it seriously. Because i scored full in organic and even in all i corrected 43 out of 45 in 2k19 Neet. Try to solve the exercise and example of ncert book . Never forget to solve the questions of previous year of NEET and JEE MAIN problem.Because most of the questions concept repeat in exam. Always try to understand the mechanism of every reaction which is given in a Ncert book. ",
            "date": "June 18, 2020",
            "views": "13",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Maira",
                    "user_href": "/profile/Maira-99"
                },
                {
                    "user_id": "Barath Balaji",
                    "user_href": "/profile/Barath-Balaji-12"
                },
                {
                    "user_id": "Prachi Dahiwade",
                    "user_href": "/profile/Prachi-Dahiwade"
                },
                {
                    "user_id": "Akshy Kalyahn",
                    "user_href": "/profile/Akshy-Kalyahn"
                },
                {
                    "user_id": "Akash Choudhury",
                    "user_href": "/profile/Akash-Choudhury-76"
                }
            ]
        }
    ]
}