{
    "title": "How big of an eruption would it be, if a super volcano in Yellowstone erupts? - Quora",
    "tags": [
        "Supervolcanoes",
        "Yellowstone National Park",
        "Volcanology",
        "Volcanoes"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jesse Lee O’Connor 李杰西",
                "href": "/profile/Jesse-Lee-O-Connor-李杰西"
            },
            "answer_text": "Answered 29, February, 2020 If it’s ”super*” it would produce by definition 1,000 or more cubic kilometres of ejecta. https://www.usgs.gov/faqs/what-a-supervolcano-what-a-supereruption?qt-news_science_products=0#qt-news_science_products However, not all eruptions have been of that magnitude. In fact, the vast majority of eruptions of Yellowstone’s hot spot have been considerably smaller and less violent. Within the next several decades to centuries, only small volcanic events are projected by geophysicists to occur because the magma chambers beneath the park are far from being volatile enough to erupt without decades of development from the crystalised, non-eruptible state they are now in.  Yellowstone volcano has multiple magma chambers https://www.quora.com/What-is-going-on-with-the-Yellowstone-volcano-Will-it-implode-explode-or-suddenly-halt-activity/answer/Jesse-O-Connor?ch=10&share=e0927525&srid=hDAQm The most likely explosive event to occur at Yellowstone is actually a hydrothermal explosion—a rock-hurling geyser eruption—or a lava flow. Hydrothermal explosions are very small; they occur in Yellowstone National Park every few years and form a crater a few meters across. Every few thousand years, a hydrothermal explosion will form a crater as much as a few hundred meters across. Though the worst-case scenario for a giant Yellowstone eruption is indeed bad and could have global implications, most past eruptions at Yellowstone were not highly explosive. Of the past 50 or so eruptions, almost all were simple lava flows. If they occurred tomorrow or next year, they would have minimal direct effect outside Yellowstone National Park. https://www.usgs.gov/faqs/what-type-eruption-will-yellowstone-have-if-it-erupts-again?qt-news_science_products=0#qt-news_science_products Of the 27 fictional accounts of a Yellowstone eruption I’ve encountered, the only one written by a geologist tellingly involves only a single vent eruption; a cone. I won’t say who wrote it because that would be spoiling necessary story tension, if you read it. Much wading through popular anxiety and incomplete reporting is necessary to provide accurate perspective on this. Many sources report there have been three Yellowstone “supereruptions” within the park boundaries. This is misleading. There have been more VEI-8 eruptions of that hot spot all across what’s now Idaho and only two of them were in what’s now Yellowstone. The third one we hear of constantly made the Henry’s Fork Caldera which was VEI 7; #1 below for 1.3 MYA, west of Yellowstone. The next level of incompleteness regards 12 or 13 calderas formed from northern Nevada/southeast Oregon to the current park. Here is a good example:  Volcano - Yellowstone National Park (U.S. National Park Service) That one, above, is better than most because it includes Lake Owyhee; 25 MYA. But it’s only the “greatest hits” version. This one’s better yet:  Yellowstone hotspot track full map The Yellowstone Hotspot recognises an earlier McDermitt event at 16.5 MYA. Add Lake Owyhee to this and we’re up to 21 calderas in 16,500,000 years! Include known small calderas which form West Thumb and Mary Bays in Yellowstone Lake and it’s 23. How many were VEI 8, or, “super?” The older ones are challenging to quantify in terms of tephra volume but they weren’t all that big. Giving benefit of doubt to Bruneau-Jarbidge (it could just as easily have been McDermitt), I counted only 5 out of 23. After two new ones were documented this year, one the size of Toba, my current count is 7 of 25; please see: Jesse Lee O’Connor 李杰西's answer to What are the 20 supervolcanoes in the world? Add to that dozens or more lava flow events, each of them eruptions far short of “super” across the Snake River Plain including the most recent Yellowstone activity 70,000 years ago, a lava flow, and you can see VEI 8 activity is just the infrequent tip of the proverbial iceberg. To summarise: Not all geoscientists predict it will have a future VEI 8 eruption at allMost predict a small volcanic event before a large oneA caldera-forming eruption, impossible now, will require decades of measurable change Jesse Lee O’Connor 李杰西's answer to The Yellowstone hotspot has moved over the course of eruptions, so is the next one going to be in Montana, not Idaho? *Why the Scientist-in-Charge of the Yellowstone Volcano Observatory no longer says “Supervolcano:” https://www.quora.com/If-Yellowstone-decided-to-finally-go-super-volcano-on-us-how-much-forewarning-if-any-would-the-planet-give-us-Would-it-be-instantaneous-or-would-we-have-days-weeks-months-to-prepare-What-would-any-such-forewarning/answer/Jesse-O-Connor?ch=10&share=05f67921&srid=hDAQm ",
            "date": "Updated October 9, 2020",
            "views": "299",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Steve Jones",
                    "user_href": "/profile/Steve-Jones-243"
                },
                {
                    "user_id": "Dash Stewart-Wild",
                    "user_href": "/profile/Dash-Stewart-Wild"
                },
                {
                    "user_id": "Louise D. Jewell",
                    "user_href": "/profile/Louise-D-Jewell"
                },
                {
                    "user_id": "Lynn Mungo",
                    "user_href": "/profile/Lynn-Mungo"
                },
                {
                    "user_id": "David Berger",
                    "user_href": "/profile/David-Berger-64"
                },
                {
                    "user_id": "Carol Dieter",
                    "user_href": "/profile/Carol-Dieter-2"
                },
                {
                    "user_id": "Yosey Huff",
                    "user_href": "/profile/Yosey-Huff"
                },
                {
                    "user_id": "Yaping Tang",
                    "user_href": "/profile/Yaping-Tang-1"
                },
                {
                    "user_id": "Stan Jetton",
                    "user_href": "/profile/Stan-Jetton"
                },
                {
                    "user_id": "Emma Skinner",
                    "user_href": "/profile/Emma-Skinner-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Darcy Cordell",
                "href": "/profile/Darcy-Cordell"
            },
            "answer_text": "It depends on how much of the magma chamber erupts. The Yellowstone magma chamber is massive. Various estimates have been put forward using geophysical imaging tools (usually seismic tomography). A relatively recent estimate suggested a 4,300 cubic kilometer magma chamber beneath Yellowstone Caldera[1][2] . It is unlikely that an eruption would evacuate the entire magma chamber. This is largely because the magma chamber is relatively low melt fraction (anywhere from 10 to 30%). This means that it is a “mush” magma which is relatively viscous and unable to erupt due to viscosity and buoyancy overpressure[3]. Regardless, even if only 10% of the magma chamber was eruptible, it would still be the largest volcanic eruption in thousands of years. It is estimated that 600,000 years ago, Yellowstone erupted >1000 cubic kilometers of material. To put that in perspective, that was 1000 times more ejecta than Mount Saint Helens. It is quite literally off the chart:  But don’t worry too much, volcanologists estimate that there is only a 1% chance of this occurring in the next 7,200 years[4]. There is a 75% chance of such an eruption occurring in the next million years. Footnotes[1] Mushy magma beneath Yellowstone[2] Crustal Structure and Evolution of an Explosive Silicic Volcanic System at Yellowstone National Park[3] Supervolcano eruptions driven by melt buoyancy in large silicic magma chambers[4] The size and frequency of the largest explosive eruptions on Earth",
            "date": "Answered June 19, 2017",
            "views": "646",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Liam Wescott",
                    "user_href": "/profile/Liam-Wescott"
                },
                {
                    "user_id": "Brad Wartman",
                    "user_href": "/profile/Brad-Wartman-1"
                },
                {
                    "user_id": "Samuel Beausoleil",
                    "user_href": "/profile/Samuel-Beausoleil"
                },
                {
                    "user_id": "Bhavesh Singh",
                    "user_href": "/profile/Bhavesh-Singh-6"
                },
                {
                    "user_id": "Aruna Nair",
                    "user_href": "/profile/Aruna-Nair-1"
                },
                {
                    "user_id": "Tyler Siemssen",
                    "user_href": "/profile/Tyler-Siemssen"
                },
                {
                    "user_id": "Mylitta White",
                    "user_href": "/profile/Mylitta-White-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave G. Howell",
                "href": "/profile/Dave-G-Howell"
            },
            "answer_text": "Yellowstone has a history of large eruptions and extremely large eruptions. When it erupts next if it matches it’s largest eruption it has the potential to have a global effect on weather and climate. It could bring about global famine through crop failure for a number of years. as well as a “nuclear winter” where we have freezing temps and snow year round in what are now temperate regions of the planet. The major ash fallout alone will cover 2/3 of the USA and a significant part of Canada. The areas covered are some of the most productive grain and livestock areas of North America. With an ever growing world population, if you reduce food production in North America by 80% and Northern Europe and the Ukraine by 90 %. India China and other major food producers also greatly reduced production, all will suffer. Even producers in South America and Australia will have greatly reduced production due to global winter. It wont look good for humanity anywhere! It will also be extremely hard on wildlife world wide and no doubt push some creatures into extinction. As an example of what I am talking about check this out and keep in mind this was a peanut compared to what Yellowstone's potential is. Mount Tambora and the Year Without a Summer  Map of unusual cold temperatures in Europe during the summer of 1816Credit: Creative Commons, authored by Giorgiogp2 The summer of 1816 was not like any summer people could remember. Snow fell in New England. Gloomy, cold rains fell throughout Europe. It was cold and stormy and dark - not at all like typical summer weather. Consequently, 1816 became known in Europe and North America as “The Year Without a Summer.” Why was the summer of 1816 so different? Why was there so little warmth and sunshine in Europe and North America? The answer could be found on the other side of the planet - at Indonesia’s Mount Tambora. On April 5, 1815, Mount Tambora, a volcano, started to rumble with activity. Over the following four months the volcano exploded - the largest volcanic explosion in recorded history. Many people close to the volcano lost their lives in the event. Mount Tambora ejected so much ash and aerosols into the atmosphere that the sky darkened and the Sun was blocked from view. The large particles spewed by the volcano fell to the ground nearby, covering towns with enough ash to collapse homes. There are reports that several feet of ash was floating on the ocean surface in the region. Ships had to plow through it to get from place to place. But the smaller particles spewed by the volcano were light enough to spread through the atmosphere over the following months and had a worldwide effect on climate. They made their way into the stratosphere, where they could distribute around the world more easily. Earth’s average global temperature dropped three degrees Celsius. The effect was temporary. Eventually, even the smallest particles of ash and aerosols released by the volcano fell out of the atmosphere, letting in the sunshine. The Year Without a Summer had many impacts in Europe and North America. Crops were killed - either by frost or a lack of sunshine. This caused food to be scarce, and caused farmers who were able to grow crops to fear that they would be robbed. The lack of successful crops that summer made the food which was grown more valuable, and the price of food climbed. Because the price of oats increased, it was more expensive for people to feed their horses. Horses were the main method of transportation, so with expensive oats, the cost of travel increased. This may have been one of the factors that inspired a German man named Karl Drais to invent a way to get around without a horse: the bicycle. The gloomy summer weather also inspired writers. During that summer-less summer, Mary Shelley, her husband, the poet Percy Bysshe Shelley, and poet Lord Byron were on vacation at Lake Geneva. While trapped indoors for days by constant rain and gloomy skies, the writers described the bleak, dark environment of the time in their own ways. Mary Shelley wrote Frankenstein, a horror novel set in an often stormy environment. Lord Byron wrote the poem Darkness, which begins, “I had a dream, which was not all a dream. The bright sun was extinguish’d.” © 2012 UCAR with portions adapted from Windows to the Universe (© 2008 NESTA) ",
            "date": "Answered February 11, 2019",
            "views": "370",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Carl Kemp",
                    "user_href": "/profile/Carl-Kemp-5"
                },
                {
                    "user_id": "Ted Black",
                    "user_href": "/profile/Ted-Black-5"
                },
                {
                    "user_id": "Liam Wescott",
                    "user_href": "/profile/Liam-Wescott"
                },
                {
                    "user_id": "Jason Skelly",
                    "user_href": "/profile/Jason-Skelly-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Philip Rabe",
                "href": "/profile/Philip-Rabe"
            },
            "answer_text": " There are many similar graphs available on the Google. Just ask. ",
            "date": "Answered February 11, 2019",
            "views": "42",
            "upvotes": "0"
        }
    ]
}