{
    "title": "How can politics affect science? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Peter Hawkins",
                "href": "/profile/Peter-Hawkins-2"
            },
            "answer_text": "Politics can affect science is many ways.  Politics can affect and even dictate the manner in which science is done. For example, passing laws that limit whether embryos can be used in stem cell research. Politics can allocate funding to various scientific causes. Politics can create a great research environment in the universities. And so on.  In extremes, politics can even make entire areas of science off limits. In the early twentieth century, lots of very smart and decent people were eugenicists. Politics (in particular, the unbelievable moral horror that was Nazism and the Holocaust) changed all that. ",
            "date": "Answered November 21, 2015",
            "views": "3",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nicholas Mew",
                    "user_href": "/profile/Nicholas-Mew-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Muhammed Rafeek",
                "href": "/profile/Muhammed-Rafeek-1"
            },
            "answer_text": "Look at the history. 3000 BC there was a scientific advancement by the invention of use of bronze. A fundamentalist view of polythiestic religions were existed then which is politically exploited by barbaric bronze age politicians. The next scientific upbringing was happened at ionian islands at around 1000 to 400 BC. Pythagoreans of that time who were the mathematical office bearers of kings at that time opposed the \" experimentations\" of these ionian scientists which caused a serious pull back in the development of science. A wave of Christendom then followed have pulled back ' logical reasoning' for about 1500 years. Some king ruled Egypt before Christendom burned an entire collection of ionian developments which were collected in Alexandrian library. It can be statistically shown that the developments of science have happened in cycle with the increasing unrest of religious fundamentalism at different times of hystory. The nineteenth century upbringing was followed by two major wars which involved the extremist national philosophies. Extremism in politics have an inverse correlation with the development of scientific geniuses. ",
            "date": "Answered November 21, 2015",
            "views": "11",
            "upvotes": "0"
        }
    ]
}