{
    "title": "How does research in the arts and humanities work? - Quora",
    "tags": [
        "Scientific Research Education, Organizations and History",
        "Humanities",
        "The Arts",
        "Research"
    ],
    "response": [
        {
            "author_info": {
                "name": "Leif Jerram",
                "href": "/profile/Leif-Jerram"
            },
            "answer_text": "Thanks for the ask. I suspect you could get as many answers as researchers! The thing about being 'subjective' is a constant, and flawed, complaint about the arts and humanities. But there are some basics. People in the arts always, and people in the social sciences mostly, research those things which cannot be comprehended by numbers or laws, as they operate in, say, physics or chemistry. So if you wish to understand things like love, or answer questions like, 'Why do wars end?', or understand how God can play such an important role in one person's life but not another's, or define what makes one town a great place to live and the neighbouring one a dump, then it is to the arts and humanities you must turn. And these are big issues for humanity - we need to think about these things, to know what to do. People in the social sciences-end of the arts/humanities spectrum sometimes try to apply numbers to these questions, and often will be the first to point out the limitations to this approach. Economists and town planners, for example, will attempt to answer questions like, 'why do people take foolish financial decisions?' and 'what makes a town a great place to live?' by using lots of numbers, but most of them will concede, at some point, that the numbers can't explain the nub of the issue. The problem is qualitative. It is tempting to view these qualitative problems as being 'subjective', but it is foolish to do so. It is a profound moral, social and intellectual failure to say, effectively, 'Because this field of knowledge does not function in the same way as metallurgy, therefore its contents are arbitrary and subjective.' This type of argument is often made by people who don't want to go the effort of learning the amount of stuff you have to learn, and applying the difficult methods you have to apply, to get to plausible answers. And just because there are plausible answers (plural), does not mean that all possible answers are plausible. Often, the answers to questions (like, how can I make streets beautiful?, or, 'how can I make life meaningful?') don't have one firm answer. But they'll have 2-3 firm answers. These answers will often contradict the beliefs of individuals profoundly, in a way that doesn't apply in metallurgy: metallurgists aren't morally offended that alloy x fractures at compression y. But if a researcher in the arts and humanities finds out that, say, selective education never achieved great things in Britain, or that the language of the French civil services causes racial discrimination, this poses a problem to people's beliefs. They can either change their beliefs to match the evidence, or dismiss the evidence as subjective, biased, flawed, improper. And this is why much research in the humanities is routinely dismissed. But it's also why it matters. ",
            "date": "Answered May 5, 2015",
            "views": "532",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Niels Ohlsen",
                    "user_href": "/profile/Niels-Ohlsen-1"
                },
                {
                    "user_id": "Tom Willis",
                    "user_href": "/profile/Tom-Willis-28"
                },
                {
                    "user_id": "Conjeepuram Venkatasubramani Ambarish",
                    "user_href": "/profile/Conjeepuram-Venkatasubramani-Ambarish"
                },
                {
                    "user_id": "Peter Hawkins",
                    "user_href": "/profile/Peter-Hawkins-2"
                },
                {
                    "user_id": "Jason Li",
                    "user_href": "/profile/Jason-Li-18"
                }
            ]
        }
    ]
}