{
    "title": "How does quantum mechanics explain radioactivity? - Quora",
    "tags": [
        "Radioactivity",
        "Nuclear Physics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark John Fernee",
                "href": "/profile/Mark-John-Fernee"
            },
            "answer_text": "The most basic theory of quantum mechanics doesn't explain radioactivity in any specific sense. Quantum mechanics was developed to describe simpler experimental measurements, such as particle position and momentum as well as the energy level structure of atoms. However, the theory is fundamentally more general and the principles were extended to treating electromagnetism and electrodynamics. Here the first hint of an explanation for radioactivity can be found. The higher energy levels of an atom are not stable because of the interaction of the atom with the electromagnetic field, which must include the quantum vacuum. Thus the higher excited states also have a lifetime, which can be expressed as a half-life. This is the clue to understanding radioactivity. The fact that radioactive elements actually decay is an indication that the nuclei must be interacting with another aspect of the quantum vacuum field. However the exact nature of this nuclear interaction depends on a quantum theory of the nucleus. There are two theories that treat the nucleus, and they are the electro-weak theory and quantum chromodynamics. The electro-weak theory treats beta decay and introduces additional quantum fields that also interact with the nucleus. Quantum chromodynamics adds the gluon field. These are all wrapped up in the Standard Model of particle physics. The most general level of understanding is that certain states of the nucleus are not stable in the presence of quantum vacuum and result in radioactive decay to more stable states. In quantum speak, we would say that the quantum state of the nucleus is not an eigenstate of the Hamiltonian operator that describes the system. The theories that describe radioactive decay are very much more specialised than the most fundamental quantum mechanics, but a basic understanding can nevertheless be gleaned from basic principles of quantum mechanics. The nuts and bolts of actually predicting nuclear stability and half-lives requires a full quantum treatment of the nucleus, which are very much more specialised theories. ",
            "date": "Answered February 24, 2018",
            "views": "752",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Allan Steinhardt",
                    "user_href": "/profile/Allan-Steinhardt"
                },
                {
                    "user_id": "Amal Guptan",
                    "user_href": "/profile/Amal-Guptan"
                },
                {
                    "user_id": "Zane Jakobs",
                    "user_href": "/profile/Zane-Jakobs"
                }
            ]
        }
    ]
}