{
    "title": "How do scientists know what humans are made of? - Quora",
    "tags": [
        "Humans ",
        "Scientists",
        "The Human Race and Condition"
    ],
    "response": [
        {
            "author_info": {
                "name": "Keith Shannon",
                "href": "/profile/Keith-Shannon-2"
            },
            "answer_text": "Corpse analysis. Lots of it. Henry Gray, author of the original textbook Gray’s Anatomy, compiled the data for his work by essentially paying off prison guards for access to the bodies of executed prisoners, because human dissection was illegal at the time. Since that time, medical science has involved a lot of work on human cadavers. For more precise compositional analysis of samples, gas chromatography has become common. The concept is simple; take a sample of a compound of unknown composition, and heat it until that sample starts producing a vapor. Collect that vapor and heat it further until it breaks down into its component atoms (at this temperature it will likely also be glowing), then examine the spectral lines of the compound (the wavelengths of light produced by the glowing sample). The specific frequencies/wavelengths, and their relative strengths, can be used to identify the elemental components and their rough percentages. The “boiling point” (where the vapor began to be produced) of the original collected vapor sample can tell you the approximate molecular weight of the initial molecule that was vaporized at that temperature. With a molecular mass and a percentage composition by element, you can then determine the empirical formula of the compound that was detected in the sample. Then, the change in mass of the original sample as this compound vaporizes will tell you the percentage of that compound in the original sample. You repeat this, continuing to heat the original sample until more and more vapors are produced, until the entire sample has been vaporized and analyzed, and the end result is a breakdown by empirical formula of the percentages of various detected compounds. It is left as an exercise for the chemist to determine the theoretical formulas; you might, for instance, detect a molecule that contains 22 carbons, but when you isolate and perform some reaction experiments on that substance you find the reaction products are based on 11 carbons. That’s evidence that the pure substance you originally detected forms a stable weakly-bonded structure called a dimer, and the actual molecule, for most purposes, is only half of this structure. Trimers and more complex “polymers” are also common in organic chemistry, and this kind of “reading between the lines” is where the Ph.D analytical chemist earns their pay. A lot of this kind of work has been done in the past century or so, taking samples of various tissues and analyzing their molecular and elemental content in various ways (reactionary chemistry, mass spectroscopy, liquid/column chromatography, gas chromatography, etc), while at the same time continuing to dissect the cadaver where the source material came from to determine how much of that type of tissue exists in the body. Do this enough times with various specimens of various body types, and you come up with statistically-sound mean percentages of elemental composition of the entire human body. As our tools have gotten more precise, so have these determinations. For grins, here are the most common elements in the human body by mass: Oxygen: 65%Carbon: 18.5%Hydrogen: 9.5%Nitrogen: 3.2%Calcium: 1.5%Phosphorus: 1.0%Potassium: 0.2%Sodium: 0.2%Chlorine: 0.2%Magnesium: 0.1%Sulfur: 0.04%Together, these 11 chemicals comprise 99.44% of your body mass. The first four make up 96.2% of total mass by themselves. Other detectable trace elements, each making up less than 0.01% of body mass, include boron, cadmium, chromium, cobalt, copper, fluorine, iodine, iron, manganese, molybdenum, selenium, silicon, tin, vanadium and zinc. ",
            "date": "Answered August 9, 2016",
            "views": "196",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Donald Floyd FG",
                    "user_href": "/profile/Donald-Floyd-FG"
                },
                {
                    "user_id": "Caroline Wright",
                    "user_href": "/profile/Caroline-Wright-108"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harvey Murray",
                "href": "/profile/Harvey-Murray-3"
            },
            "answer_text": "Open ’em up and look.  Of course you need a microscope for the real tiny stuff. And visualizations for things that are too small to see even with a microscope. Animations of unseeable biology ",
            "date": "Answered October 2, 2017",
            "views": "33",
            "upvotes": "0"
        }
    ]
}