{
    "title": "How is it possible that a star older than the universe was found? - Quora",
    "tags": [
        "Stars (astronomical objects)",
        "The Universe",
        "Cosmology",
        "Outer Space",
        "Astrophysics",
        "Planetary Science",
        "Astronomy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Krister Sundelin",
                "href": "/profile/Krister-Sundelin"
            },
            "answer_text": "Q: How did scientists discover a star older than the universe? A: The star HD 140283 was catalogued in 1912 using the Mount Wilson telescope. Early on, it was determined through stellar spectroscopy that it had very low metal content, much lower than the Sun. As stellar evolution was better understood, it became clear that HD 140283 was a very old star, probably Population II (our sun is a population I star), because of the low metal content – it formed when there wasn’t very much metal in the universe. Using computer simulations of stellar evolution models based on quantum mechanics, the age was estimated to 14.46 ±0.8 billion years, or between 13.66 and 15.26 billion years. Since the age of the universe is estimated to 13.79 ± 0.021 billion years, parts of the age estimate range of HD 140283 falls outside the age estimate range of the universe. Note that both age estimates (that of the star and that of the universe) are estimates, not absolute numbers. They are based on our current understanding of stellar evolution and cosmology. Also note that the star’s age estimated has much greater uncertainty (5.5% for the age of the star, 0.1% uncertainty for the age universe). That means that the lower end of the age estimate of the star, 13.66 to 13.79 billion years easily falls within the estimated age of the universe.  So scientists don’t say that they have found a star that is older than the universe. Instead, they say “HD 140283 has this age with a certain uncertainty, and the universe has that age with a certain uncertainty, and the estimates don’t overlap perfectly. Curious – this requires further research!” Then journalists reinterpret that message to “woah, scientists have found a star that is older than the universe, science must start over!” – partly because it is a dramatic and selling headline, and partly because the journalists are not scientists and are not used to how scientists express themselves. ",
            "date": "Answered August 12, 2019",
            "views": "464",
            "upvotes": " View 561 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Guy Geens",
                    "user_href": "/profile/Guy-Geens"
                },
                {
                    "user_id": "Lee Slee",
                    "user_href": "/profile/Lee-Slee-1"
                },
                {
                    "user_id": "Todd Hotchkiss",
                    "user_href": "/profile/Todd-Hotchkiss"
                },
                {
                    "user_id": "Randy Crane",
                    "user_href": "/profile/Randy-Crane"
                },
                {
                    "user_id": "Zoë Sumra",
                    "user_href": "/profile/Zoë-Sumra"
                },
                {
                    "user_id": "Sanjeev Sabharwal",
                    "user_href": "/profile/Sanjeev-Sabharwal-10"
                },
                {
                    "user_id": "Victoria Warren",
                    "user_href": "/profile/Victoria-Warren-17"
                },
                {
                    "user_id": "Shannon Hill",
                    "user_href": "/profile/Shannon-Hill-235"
                },
                {
                    "user_id": "Mansur Dikko",
                    "user_href": "/profile/Mansur-Dikko"
                },
                {
                    "user_id": "Doug Williams",
                    "user_href": "/profile/Doug-Williams-320"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Rose",
                "href": "/profile/Tom-Rose-16"
            },
            "answer_text": "The star in question (HD 140283) is estimated to be 14.5 billion years old, based on its low iron content, as revealed by its spectrum. That is older than the presently accepted age of the Universe (13.8 billion years) As usual the media have reported this wth their usual fake drama and stupidity as “A star older than the Universe”. But how can anything in the Universe be older than the Universe it is in? That is silly. What are the more sensible possibilities: The star is not as old as we thinkThe Universe is older than we thinkWe hardly understand the Universe at all. Our theories are way off the truthI suspect that option 1 will turn out out be the right one ",
            "date": "Answered August 12, 2019",
            "views": "304",
            "upvotes": "0"
        }
    ]
}