{
    "title": "How would you explain, “The compound should not be heated to the point that it melts”? - Quora",
    "tags": [
        "Melting Points",
        "Melting"
    ],
    "response": [
        {
            "author_info": {
                "name": "Muhammad Ahsan Ali",
                "href": "/profile/Muhammad-Ahsan-Ali-8"
            },
            "answer_text": "When kinetic energy of molecules is increased by giving energy then we use term “heat\" and heat means intermolecular forces are intact but kinetic energy of molecules is increased and here occurs no change of physical state of that compound. Melting point is the temperature at which given energy is used to break intermolecular forces of compound and physical state of compound changes from solid to liquid. Energy is given in both cases to heat and to melt the compound but in heating just kinetic energy of molecules is being increased and in melting energy supplied is used to break intermolecular forces of compound and here more energy is required to melt as compared to heat the compound. . ",
            "date": "Answered June 16, 2018",
            "views": "47",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kumar Vin",
                    "user_href": "/profile/Kumar-Vin-3"
                },
                {
                    "user_id": "Galileo Han",
                    "user_href": "/profile/Galileo-Han"
                },
                {
                    "user_id": "Nur Azizah Mohd Baseair",
                    "user_href": "/profile/Nur-Azizah-Mohd-Baseair"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark S. Smith",
                "href": "/profile/Mark-S-Smith-6"
            },
            "answer_text": "It means look at the phase diagram or melting point of the compound at STP (Standard Temperature and Pressure) and control the thermal environment when heating to stay under the melting point on the compound. If the melting point is 120C, then use something like a boiling water bath to heat up the compound to guarantee you heat the compound up (to 100C) but don’t exceed the melting point of 120C. Think of a double boiler for melting chocolate.  ",
            "date": "Answered May 28, 2018",
            "views": "26",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daniel James Berger",
                    "user_href": "/profile/Daniel-James-Berger"
                },
                {
                    "user_id": "Nur Sabrina",
                    "user_href": "/profile/Nur-Sabrina-153"
                },
                {
                    "user_id": "YING JIE KHO",
                    "user_href": "/profile/YING-JIE-KHO"
                },
                {
                    "user_id": "Anis Faqihah",
                    "user_href": "/profile/Anis-Faqihah-3"
                },
                {
                    "user_id": "Richard O. Colestock",
                    "user_href": "/profile/Richard-O-Dick-Colestock"
                },
                {
                    "user_id": "Indi Mackay",
                    "user_href": "/profile/Indi-Mackay"
                }
            ]
        }
    ]
}