{
    "title": "How good is NPTEL online courses offered for computer science? - Quora",
    "tags": [
        "E-learning Courses",
        "Online Training",
        "E-learning",
        "Educational Courses",
        "Computer Science Education",
        "Computer Science",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mukesh Ghimire",
                "href": "/profile/Mukesh-Ghimire-5"
            },
            "answer_text": "Courses from IIT professors. It is going to be great. Well, that was what I thought when I first joined courses on NPTEL. I joined around 5 courses. Some of the course content are really good but some of them are not that great. It depends on what type of course you are joining. Some of the courses I joined had only theories and a professor would sit in his desk reading some presentation. I lost interest after 2 or 3 lectures. The other problem with NPTEL is that the course week are released really late. I joined around 2 weeks before and the course still haven't released week 2 content. Imstead of waiting on NPTEL site for course to release, it's better to go to YouTube and find the same course. You will get all the lecture videos on YouTube. I think joining NPTEL course will be good if you are ready to give exam by paying some amount. Certificates are given only after giving examination and you cannot give exam without registering for the course on NPTEL site. If you only want to learn, then you can just go to YouTube and search for NPTEL courses. ",
            "date": "Answered February 3, 2019",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Karan Sharma",
                    "user_href": "/profile/Karan-Sharma-2304"
                },
                {
                    "user_id": "Greeshma",
                    "user_href": "/profile/Greeshma-31"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dhananjay Shukla",
                "href": "/profile/Dhananjay-Shukla-43"
            },
            "answer_text": "Very good. However it'd be better if you'd check out MIT opencourseware too. ",
            "date": "Answered February 3, 2019",
            "views": "106",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Greeshma",
                    "user_href": "/profile/Greeshma-31"
                }
            ]
        }
    ]
}