{
    "title": "How did Charles Darwin contribute to science? - Quora",
    "tags": [
        "Darwinism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Kinnon",
                "href": "/profile/Peter-Kinnon"
            },
            "answer_text": "Charles Darwin, was among the most conspicuous individuals of the eighteenth century who, by virtue of the great advances in scientific instrumentation, printing and publication, and world travel at that time, had been led to an inevitable understanding of the reality of biological evolution by natural selection. This was contemporaneously (and independently) figured out by Alfred Russel Wallace. Fast mounting evidence was making this mechanism clear to many. The fruit was ripe for the picking! In fact the process of natural selection had been exactly identified and published many years before by Patrick Matthew. Darwin was later forced to admit this as follows: “I have been much interested by Mr. Patrick Matthew's communication in the Number of your Paper, dated April 7th. I freely acknowledge that Mr. Matthew has anticipated by many years the explanation which I have offered of the origin of species, under the name of natural selection. ”Arthur Koestler, in “The Act of Creation” whimsically put another spin on it:“With a pinch of salt it could be said that Darwin's essential achievement was to combine the evolutionary philosophy of Anaximander, who taught that man's ancestor was an aquatic animal and that the Earth and its inhabitants were descended from the same Prime Material, with the philosophy of Empedocles who taught the survival of the fittest among the random aggregations of organic forms.” Lucky guesses that, centuries later, were to be confirmed by observation of a wealth of new data.For an insight into the wider aspects of evolution which extend beyond biology please check out my latest book \"The Intricacy Generator: Pushing Chemistry and Geometry Uphill\". ",
            "date": "Answered July 18, 2018",
            "views": "105",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Christine Joy Borre",
                    "user_href": "/profile/Christine-Joy-Borre"
                },
                {
                    "user_id": "Franzell Marce",
                    "user_href": "/profile/Franzell-Marce"
                },
                {
                    "user_id": "Recel Mercado",
                    "user_href": "/profile/Recel-Mercado"
                },
                {
                    "user_id": "Reigna Rizza Ocampo",
                    "user_href": "/profile/Reigna-Rizza-Ocampo"
                },
                {
                    "user_id": "Princess Velasco",
                    "user_href": "/profile/Princess-Velasco-6"
                },
                {
                    "user_id": "Joel Pomarca",
                    "user_href": "/profile/Joel-Pomarca"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carl Vagg",
                "href": "/profile/Carl-Vagg"
            },
            "answer_text": "well darwin wrote his texts on direct observations over a lifetime including 5 years of around the world voyage of discovery on hms beagle, 160 years ago,, his first finding by direct observation [as a geologist] of shell and coral rock strata way above sea level, made him realise that his belief that yhwh had created the earth 6000 yrs ago as an anglican who had studied at uni for the anglican priesthood,, was wrong.. observing south american rainforests and their people, including ancient buildings etc, he realised that none of that was included in his bible.. his many, observations and collected specimens and copious notes, of the birds and animals on numerous islands showed how bird beaks [the usual example] on different islands, had shapes and sizes relative to food sources on each island.. eg, only curved beaks like hummingbirds for long curved flowers, short strong beaks for nuts, and so on.. these observations together with ongoing communications with fellow thinkers of he time of his discoveries, changed peoples understandings about life on earth, on earth itself, its age and so on.. so while darwin had no understanding of genetics, he still proposed a force, capable of transmitting new traits to reproductive systems, which he called playfully ‘gremmules’, but which predates the reality we know today of genes and genetics.. so just as michaelangelo contributed to astronomy by hand crafting lenses and making telescopes to view the planets and their moons etc, contributed to modern astronomy by breaking away from old false assumptions into the world of scientific study and observation of reality,, and just as he and later the wright brothers in usa created the first models of and actual gliders and basic aircraft, thus creating the start of aircraft aerodynamics, which has resulted in humans walking on the moon, and sending roving scientific detectors to the surface of mars,, anyone seeking to learn about genetics or basic evolution, will without doubt learn about darwins observations on the beagle, as the first steps long ago, to todays sciences.. ",
            "date": "Answered September 6, 2020",
            "views": "32",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mary Ann Batac",
                    "user_href": "/profile/Mary-Ann-Batac"
                },
                {
                    "user_id": "Sten-Åke Alfredsson",
                    "user_href": "/profile/Sten-Åke-Alfredsson"
                },
                {
                    "user_id": "Julius Angelo Rala",
                    "user_href": "/profile/Julius-Angelo-Rala"
                },
                {
                    "user_id": "Christine Joy Borre",
                    "user_href": "/profile/Christine-Joy-Borre"
                },
                {
                    "user_id": "JAYLOR PIAYAS",
                    "user_href": "/profile/JAYLOR-PIAYAS-1"
                }
            ]
        }
    ]
}