{
    "title": "How does a blood moon look from the point of view of someone standing on the moon? Is the moon red around them, or not? - Quora",
    "tags": [
        "Blood Moon (lunar eclipse)",
        "Moon Phases",
        "Moons (astronomy)",
        "Earth-Moon Relationship",
        "The Solar System",
        "The Moon (astronomy)",
        "Planetary Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dave Consiglio",
                "href": "/profile/Dave-Consiglio"
            },
            "answer_text": "The Moon looks…like asphalt.  This is a man in Wisconsin on an asphalt road.  This is a man on the Moon. Notice the similarity? These are Moon rocks  They are darker than you’d expect. Reason? The Moon looks lighter than it is thanks to the fact that we are always looking at it against either a blue or almost black background. Now, during a “Blood Moon”, what you’re typically seeing is an image of the Moon reddened by our atmosphere. If you were on the Moon in such a scenario, you’d see nothing different. However… A “Blood Moon” can also be the result of a lunar eclipse. During a lunar eclipse, you’d definitely notice something different on the Moon. Rather than seeing the Sun, blinding and horrible in the sky, the Earth would blot it out. It would be very dark…but a reddish hue would be visible. Why? Because the Sun’s light will be reddened by passage through the Earth’s atmosphere. A tiny amount of that light will bathe the Moon in a Hadean glow. ",
            "date": "Answered May 14, 2019",
            "views": "228",
            "upvotes": " View 1.1K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tristram Carlyon",
                    "user_href": "/profile/Tristram-Carlyon"
                },
                {
                    "user_id": "Cesar Alcaraz",
                    "user_href": "/profile/Cesar-Alcaraz-7"
                },
                {
                    "user_id": "Bob Jones",
                    "user_href": "/profile/Bob-Jones-2002"
                },
                {
                    "user_id": "Deepshikha Pandey",
                    "user_href": "/profile/Deepshikha-Pandey-41"
                },
                {
                    "user_id": "Adella Gray",
                    "user_href": "/profile/Adella-Gray-3"
                },
                {
                    "user_id": "Isabella Walker",
                    "user_href": "/profile/Isabella-Walker-38"
                },
                {
                    "user_id": "Ben van Velzen",
                    "user_href": "/profile/Ben-van-Velzen"
                },
                {
                    "user_id": "Leslie Jean Rhodes",
                    "user_href": "/profile/Leslie-Jean-Rhodes"
                },
                {
                    "user_id": "Ty Raj",
                    "user_href": "/profile/Ty-Raj"
                },
                {
                    "user_id": "Ari Dayton",
                    "user_href": "/profile/Ari-Dayton"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gary Novosielski",
                "href": "/profile/Gary-Novosielski"
            },
            "answer_text": "If you mean a lunar eclipse, say so. Leave “blood moon” to the illiterates. To someone standing on the Moon during what we’d call a lunar eclipse, they would see a total Solar eclipse as the Earth moves in front of the Sun. It would not resemble a Solar eclipse on Earth, because the Earth would appear much larger than the Sun and could take hours to move across the Sun’s disk. It would also look different because the Earth has an atmosphere, and as the sunlight passes through it, the blue light is scattered, leaving red light to pass through. You’d see a red ring surrounding the surface of the Earth. Essentially, you would be seeing all the sunrises and sunsets on Earth at once. And that red glow is what illuminates the Moon during totality. If you looked around you, you would see the landscape illuminated by that red glow. But your eyes would quickly adjust and the color would be less evident. And that’s still no excuse to call it a “blood moon”. ",
            "date": "Answered April 24, 2019",
            "views": "98",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Richard Stratford",
                    "user_href": "/profile/Richard-Stratford-2"
                },
                {
                    "user_id": "Steven Spielman",
                    "user_href": "/profile/Steven-Spielman"
                },
                {
                    "user_id": "Tom Nathe",
                    "user_href": "/profile/Tom-Nathe"
                },
                {
                    "user_id": "Harm Kramer",
                    "user_href": "/profile/Harm-Kramer"
                },
                {
                    "user_id": "Lucian Alexandru Moţoc",
                    "user_href": "/profile/Lucian-Alexandru-Moţoc"
                },
                {
                    "user_id": "Luke Swafford",
                    "user_href": "/profile/Luke-Swafford-1"
                }
            ]
        }
    ]
}