{
    "title": "How rare do you think intelligent life is in our universe? - Quora",
    "tags": [
        "Intelligent Life",
        "Extraterrestrial Intelligence",
        "Extraterrestrial Life",
        "The Universe",
        "Cosmology",
        "Intelligence",
        "Astrophysics",
        "Astronomy",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Fred Civish",
                "href": "/profile/Fred-Civish"
            },
            "answer_text": "Very rare. Why? Because conditions for intelligent life are probably quite rare. How do I arrive at this conclusion? The Drake Equation isn’t very informative. It has a lot of completely unknown variables. But, in the end, it tries to determine how many planets in our galaxy might be conducive to intelligent life, and the answer to that is probably close to zero. Because the Rare Earth Hypothesis is probably much more likely. What do I base that on? Observation. First, because Aliens ARE NOT HERE, and if intelligent life was easy and common, they would have been here, not just now, but 100 million years ago and 400 million years ago and a billion years ago. They would have settled our planet, taking it as their own, and converting it, over millions of years, for their use. The Fermi Paradox IS valid. Essentially, it asks, WHY AREN’T THEY HERE, because if they exist, they SHOULD be here. Again, not just now, but many times over millions and millions of years. You might want to take a look at this: Fred Civish's answer to What is your preferred answer to the Fermi paradox?But, second, because observation shows that there ARE NO PLANETS LIKE EARTH. At least not yet. We have found THOUSANDS of other star systems that have planets. We have found THOUSANDS of planets in those thousands of star systems. And, though a few of them have been close to earth in size, or close to ‘The Goldilocks Zone’ where temperatures might be suitable to support life, NONE of those star systems are ‘right’ for complex life, let alone intelligent life. The stars are not right, too energetic or not energetic enough. For a star to exist for long enough to develop complex life, it pretty much has to be a ‘Dwarf’ star. Bigger stars burn out way too quickly. Red Dwarf stars are much more common than Yellow Dwarf stars like our sun, which is a G2V star. And the Red Dwarfs often have planets, but almost all of the Red Dwarfs suffer from instability in some ways and they tend to have massive coronal flares, which would literally fry their planets on a regular basis. I could go on and on about the problems we see in EVERY star system where we have discovered planets, but a lot of it comes down to lack of enough stability in the star, or in the planets. A lack of Gas Giants, farther out, like in our star system, which ‘sweep’ up the planet killer asteroids and comets. And then, having a planet like ours which is gyro-stabilized by a large moon, like ours, must be exceedingly rare, because our ‘protective moon’ literally formed because our planet was struck just perfectly off center, by another planet, and it knocked off enough material to form the moon, without shattering our planet completely. How often is that really going to happen out there?Panspermia is probably very real. Take a look at this previous answer about that: Fred Civish's answer to How likely is panspermia as the origin of life on Earth? But Panspermia occurs with very primitive, single celled, bacterial level life, only. Bacteria could possibly grow in all kinds of very ‘marginal’ environments. Unfortunately, when we see the lack of adequate planetary environments in other star systems, we realize that there just does not appear to be anywhere out there where complex life, let alone intelligent life, is likely at all. ",
            "date": "Answered April 5, 2020",
            "views": "208",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harold Muniz",
                    "user_href": "/profile/Harold-Muniz-1"
                },
                {
                    "user_id": "Trent Cheney",
                    "user_href": "/profile/Trent-Cheney"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Thomas Blume",
                "href": "/profile/Stephen-Thomas-Blume"
            },
            "answer_text": " Before asking if intelligent life exists, we need to look at the chance that life exists in any form on any other planet in the universe. Looking at life on Earth, in every location, in every nook and cranny, living cells are the same. All animals use the same energy cycle, the Krebs cycle, all over the Earth. Plants on Earth use photosynthesis. All animal cells have the same basic internal anatomy, and they have cell membranes (walls) made up of lipids and proteins. All plant cells have the same basic internal anatomy, and they have cell walls made up of cellulose. The design of all plant cells, and all animal cells on the Earth is universal, just as if a common intelligent source put them all together. If cells evolved randomly, there should be vast differences in the anatomy and biochemistry of cells all over the Earth, as they would have evolved in vastly different environments, with vastly different stepwise pathways. For a single cell, one inch might as well be a hundred miles. Cells are so tiny, that long distance travel for them is unthinkable. The first living cells couldn’t go running around the Earth, going through cellular division, and leaving off their daughter cells in every location that they exist in today. The notion that ocean currents or wind spread cells over all bodies of water from a “birthing” location, and on every land surface doesn’t fly. Dig down 100 feet in Antarctica, living cells are there. Enter a cave filled with deadly acid, and living cells are there. Living cells exist near boiling hot vents in the ocean, and in the digestive tracts of every animal. And every single major cell type, without exception, has the same biochemistry. If there were ever a reason to believe the universe is bubbling with life it is this: cells can’t travel more than an inch in their lifetimes, but their even distribution and designs are universal on Earth. They must also then be universal in the universe. If alien cells could be found and observed, they must have the same design as cells on Earth. They must, because the design source must be and will be the same. It has to be. Pure mathematics and logic say so. Those that are evolution supporters should wish that there was no life in the universe other than here on Earth. Because the only way extraterrestrial life can exist is if a cosmic blueprint, is the source. The odds of a single protein molecule forming randomly is 1:10^760. This could occur only if a perfect vat of only left-handed amino acid molecules somehow existed, which actually makes the odds 1:10^infinity. A cosmic blueprint is the only way to wipe out odds as ridiculous as this. Even climbing Dawkins’ Mount Improbable wouldn’t do it. The cosmic blueprint somehow brushed off those odds here on Earth. If it did that here on earth, it most likely did so in trillions of locations in the universe. The only way life could exist throughout the universe is if there truly is a universal design source. If random abiogenesis and evolution are the sources of living cells on Earth, there isn’t a chance in hell that life exists anywhere but here on Earth. Evolution has to live with the hemoglobin number, 1:10^760 and a googolplex of other absurd odds. If there is life in other locations in the universe besides here on Earth, its ramifications are just the opposite of what is touted by modern science. The greatest evidence for cosmic blueprint is the fact that we live in an immense universe that could not possibly have been formed just for the people of Earth. What could be more absurd than the notion that the entire universe is here just for our existence, enjoyment, and amazement? The existence of that immense universe, and the absurdity of the notion that it is here just for us is immense proof that a universe-wide cosmic blueprint is the source of all of living nature; in fact all of nature itself. If random abiogenesis and evolution are the sources of all living organisms on Earth, then Earth houses the only living entities in the universe. Conversely, if I a cosmic blueprint is the source of all living organisms on Earth, then the universe is teeming with living entities. Going to the next step, and the answer to your question about intelligent life in the universe: If a basic form of life is impossible without a cosmic blueprint, then extraterrestrial intelligent life is 100% impossible as well as intelligent life is infinitely more complex. The only hope for the existence of intelligent life in the universe is if there is a universe-wide cosmic blueprint for life. I think there is, and therefore I think the universe is teeming with intelligent life. ",
            "date": "Answered March 21, 2020",
            "views": "343",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gerald McDonald",
                    "user_href": "/profile/Gerald-McDonald-6"
                },
                {
                    "user_id": "David Servin",
                    "user_href": "/profile/David-Servin-5"
                },
                {
                    "user_id": "Eve Grove",
                    "user_href": "/profile/Eve-Grove-1"
                },
                {
                    "user_id": "Andrew Sheehy",
                    "user_href": "/profile/Andrew-Sheehy-9"
                },
                {
                    "user_id": "Ed Walsh",
                    "user_href": "/profile/Ed-Walsh-7"
                }
            ]
        }
    ]
}