{
    "title": "How to approach probability versus degree of belief in facts of nature (“plausibility”) (terminology, probability, physics) - Quora",
    "tags": [
        "Nature",
        "Probability (statistics)",
        "Physics of Everyday Life",
        "Statistics (academic discipline)",
        "Belief and Beliefs",
        "Problem Solving",
        "Science",
        "Physics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Hodes",
                "href": "/profile/Mark-Hodes-2"
            },
            "answer_text": "There are several explications of probabilities. In no particular order: 1). As measures on subsets of an abstract mathematical space determined by formal axioms, e.g., Kolmogoroff’s axiomatization. 2) As limits of relative frequencies, e.g., as the limit of number of heads to total tosses of a fair coin as the number of tosses approaches infinity. 3) As deductible from symmetries using a principle of indifference, e.g., heads as likely as tails, so P(h) = 1/2. 4) As reports of subjective likelihoods, e.g., the a priori probability in 1941 that the U. S. would win WW II 5) As measures of ignorance of the details of deterministic events, e.g., if only we knew the exact initial conditions of a coin flip and the relevant physics, the probabilities would disappear. 6) As irrevocably fundamental indeterminacies of the physical world, not indicative of ignorance, e.g., transition probabilities in quantum physics. This list is not intended to be exhaustive, and some entries overlap in their contexts of applicability. ",
            "date": "Answered October 24, 2020",
            "views": "339",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David W. Letsch",
                    "user_href": "/profile/David-W-Letsch"
                }
            ]
        },
        {
            "author_info": {
                "name": "Geoff Read",
                "href": "/profile/Geoff-Read-9"
            },
            "answer_text": "I suggest you take a look at Bayes’ Theorem and pay particular attention to how you establish “prior probabilities”. ",
            "date": "Answered October 24, 2020",
            "views": "56",
            "upvotes": "0"
        }
    ]
}