{
    "title": "How did the day start when the Earth formed, was it daytime or night time? - Quora",
    "tags": [
        "Daytime",
        "Time (physical quantity)",
        "Earth (planet)",
        "Planetary Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vishvaraj Sinh",
                "href": "/profile/Vishvaraj-Sinh-1"
            },
            "answer_text": "Sun was already there. Earth spun 4 time faster, the day was 6 hour at a time, the Moon was that close. Now imagine the whole scene, dust, rocks, ice and what not attracted each other and the Earth was formed. Then a planet size of Mars collided with Earth and Moon was formed just the way Earth was formed. To decide the day or night, first decide the exact time after the Earth started forming - the very first two particles combined with each other, or mid way, or when Earth was a complete planet. It is like to decide for 5 year baby which hair came out first off the scalp. You need to go back to the birth, even before birth I mean. ",
            "date": "Answered January 21, 2019",
            "views": "617",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sai Charan",
                    "user_href": "/profile/Sai-Charan-792"
                },
                {
                    "user_id": "Nikhil Sukumar",
                    "user_href": "/profile/Nikhil-Sukumar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Samiulla Shaikh",
                "href": "/profile/Samiulla-Shaikh"
            },
            "answer_text": "When the Earth formed, similar to today, it was different local time at a different part of Earth. The very concept of day and night originated after Earth was created. Also, the concept of the day is not absolute Earth-wide. It is always nearly half of the Earth in the daylight whereas the remaining half in the night. If you want to imagine how it would have felt being present at that time, note that Earth did not form instantly out of nowhere, it took hundreds of years for the celestial dust around the sun to aggregate in the form of large planets. Check this video out to take a look at one of the possibilities in which Earth could have formed:  ",
            "date": "Answered January 23, 2019",
            "views": "350",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Andrew Hagen",
                    "user_href": "/profile/Andrew-Hagen-20"
                }
            ]
        }
    ]
}