{
    "title": "How is guidance and counselling both a science and an art? - Quora",
    "tags": [
        "Guidance",
        "Counseling",
        "The Arts"
    ],
    "response": [
        {
            "author_info": {
                "name": "Neil Sherman",
                "href": "/profile/Neil-Sherman-6"
            },
            "answer_text": "email sez: “Daademe Kajetan wants an answer to: How is guidance and counselling both a science and an art?” NO THING is EITHER a science nor an art a loaf of bread is simply pulverized something and water, a poem is simply a chain of thought, guidance is simply establishing direction, and counseling is simply providing data. “Science” and “Art” describe a “quality of workmanship”, from “incompetent” at the bottom to “art” at the top. Science is the AWARENESS of HOW a particular thing functions.  Art is the TALENT to MAKE a thing function in a Particular way.  “Hence it is” the LOVING ADORATION of phrases like “uh accident”, “unintended consequences”, “fell through the cracks” and other such “be REASONABLE” “explanations” for when “a(n incompetent) boy  is sent to do a (crafts)man’s job”.  so you get ten thousand “Graduated” “Qualified” incompetents running around BELIEVING they’re “Artistic Scientists” because they got pieces of paper that “suggest” “guidance and counselling IS both a science and an art”? Which CREATES AND MAINTAINS the very “jobs in the hands of enterprising and influential speculators, and snares to the more-industrious and less informed part of the community” from which the Towering, Loftiest Genius ARTISTS  MAKE THEIR LIVING  by MANUFACTURING all those “uh accident”, “unintended consequences”, “fell through the cracks” to “investigate”, “look into”, and “address”.  ",
            "date": "Answered October 23, 2020",
            "views": "69",
            "upvotes": "0"
        }
    ]
}