{
    "title": "How would it be to see with 3 eyes? - Quora",
    "tags": [
        "Eyesight",
        "Eyes"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mary Alexander-Brum",
                "href": "/profile/Mary-Alexander-Brum"
            },
            "answer_text": "I know this answer is funny but it’s really fun to explore this subject. It would be a disability unless the brain, eye-hand coordination is in sync.  Not being at all a professional of any sort regarding eyes that is just my opinion.  If we did have an extra eye with no issues then we would have HD vision most probably - (again, just my opinion).  ;-) However, the mantis shrimp sees like a satellite with trinocular vision.  Now that would be convenient since the eyes can separate their area of focus to a different location and human eyes move together in the same direction and focus on the same thing at the same time.  Parents especially would love to have 3 eyes trinocular, imagine how efficient it would be to give all three children attention at the same time!  See this article at National Geographic about trinocular vision.  The Mantis Shrimp Sees Like A Satellite ",
            "date": "Answered June 7, 2016",
            "views": "648",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Monique Guzman",
                    "user_href": "/profile/Monique-Guzman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akram Ibrahime",
                "href": "/profile/Akram-Ibrahime"
            },
            "answer_text": "We would still see the world as three dimensional. So perception of depth will be the same. Each eye individually sees in 2-D. It's the brain that makes sense of everything and makes it 3-D. Having more eyes means having more information for brain to process so that would give us a clarity of vision in low lighting places or distant objects so it would reduce the errors of vision It also depends on where the eyes are placed. Above is assuming that all the eyes function as human eyes. There are many insects that have more than two eyes, but they function differently than human eyes.  In case of spiders, Generally speaking, the eyes centered on the head and close to the spider's face are used to detect the size, shape, and color of an object. Eyes further away from the center of the face (along the side of the head) are used to detect motion. So, if an object moves, say, a cricket that could be food, the spider is usually going to detect it with it's peripheral (side) eyes. Subsequently, the spider will learn more about the nature of the object (size, color, etc.) once it is facing it. ",
            "date": "Answered June 9, 2016",
            "views": "14",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sunny Castro",
                    "user_href": "/profile/Sunny-Castro-2"
                },
                {
                    "user_id": "Sachin",
                    "user_href": "/profile/Sachin-2"
                }
            ]
        }
    ]
}