{
    "title": "How does one drop of lava kill you? - Quora",
    "tags": [
        "Lava",
        "Volcanology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Barry",
                "href": "/profile/Jeff-Barry-11"
            },
            "answer_text": "RE: How does one drop of lava kill you? Lava “drops” come in various sizes and can be falling from great height.  So you have one drop of lava fall on your skin. It gives you a 3rd degree burn which goes all the way through your skin to the muscle below. Or maybe it gives you a 4th degree burn all the way through your skin and into or through the muscle below. Either way there is now a path for bacteria to get into your body in an abnormal way. So some bacteria get into you, some bad bacteria. And let’s also say those bacteria get into your blood unbeknownst to you. In the meantime you’ve put a band-aid over the wound and you keep on grooving on the volcano (I know I would.) until you start feeling really sick. You are taken to the hospital but sepsis has become septic shock, and you know what comes next.A biggish drop of lava hits you on the top of your head cracking your skull open. You are knocked out and don’t come to in time to escape being vaporized by the advancing lava flow. Perhaps another biggish drop or bigger than biggish drop hits you on the top of your head, cracks your skull open and enters your brain. The extreme heat vaporizes the water in your brain and explodes your brain.I was going to put in a picture of and exploding head but I took a look at some of such images on the web and decided not to include one here. BTW, did you know that there IS such a thing as Exploding head syndrome? So charming. Anyway between this question and all of the stuff going on at Kilauea recently (2018–05–14) my brain is latched onto lava and it will probably show up in my dreams. Or should I say nightmares? In any case don’t mess around with erupting volcanoes. They have all kinds of ways to kill you like the aforementioned lava “drops”, explosions, toxic gases, pyroclastic flows, avalanches, landslides, lahars, volcanic ash getting into your lungs, etc. ",
            "date": "Answered May 14, 2018",
            "views": "57",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert Jarrett",
                    "user_href": "/profile/Robert-Jarrett-9"
                },
                {
                    "user_id": "Angutimmarik Møller",
                    "user_href": "/profile/Angutimmarik-Møller"
                },
                {
                    "user_id": "Tait Rief",
                    "user_href": "/profile/Tait-Rief"
                },
                {
                    "user_id": "Jeremy Diaz",
                    "user_href": "/profile/Jeremy-Diaz-6"
                },
                {
                    "user_id": "Kathie Dillon",
                    "user_href": "/profile/Kathie-Dillon-2"
                },
                {
                    "user_id": "James Cameron",
                    "user_href": "/profile/James-Cameron-296"
                },
                {
                    "user_id": "Luke Hughes",
                    "user_href": "/profile/Luke-Hughes-82"
                },
                {
                    "user_id": "Erik S",
                    "user_href": "/profile/Erik-S-106"
                },
                {
                    "user_id": "Milton Dsouza",
                    "user_href": "/profile/Milton-Dsouza-9"
                },
                {
                    "user_id": "Michael Scott",
                    "user_href": "/profile/Michael-Scott-183"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhinav Kaushik",
                "href": "/profile/Abhinav-Kaushik-45"
            },
            "answer_text": "Thats quite possible if the drop is big enough. As you said one drop and doesn't give the exact dimension of it, I assume it is big enough to give you severe burn and injury and quite possiblly kill you. If the drop is just like a water droplet, it will give you severe injury, as the temperature of lava is quite high, but not possiblly kill you. But as lava has very high density, a drop it will form will be normally very big and it has a possibility of kill you if you come in contact. So, stay away from lava drop. Cheers. ",
            "date": "Answered July 16, 2017",
            "views": "19",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Erik S",
                    "user_href": "/profile/Erik-S-106"
                },
                {
                    "user_id": "Karen Tiede",
                    "user_href": "/profile/Karen-Tiede"
                },
                {
                    "user_id": "Vinay Raj",
                    "user_href": "/profile/Vinay-Raj-81"
                }
            ]
        }
    ]
}