{
    "title": "How dependent are we on technology for our survival? - Quora",
    "tags": [
        "Survivalism",
        "Survival"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ryan FitzGerald",
                "href": "/profile/Ryan-FitzGerald-12"
            },
            "answer_text": "Last January, my neighbourhood lost power for 15 hours during a blizzard. Over the span of those 15 hours, me, my wife and our two sons (6 & 3 at the time) gradually added more layers.  We lit candles and carried out emergency flashlights.  By the time we went to bed, we were all sleeping in one room with every door in the house closed except for the basement. We were lucky as the power came back on in the middle of the night for us.  It wasn't until almost a day later for neighbours across the street.  But if we had not had power by breakfast time, it would have been below freezing in our modern, new, energy-efficient house and this was not even in one of the Canadian provinces that gets really cold during the winter. In Canada, during cold months (October to March/April) if you do not have heat or access to heat, you can die.  When we think of technology, we often think of light.  But during many months of the year, the light is less important than the heat. ",
            "date": "Updated November 3, 2015",
            "views": "21",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Massey Man",
                    "user_href": "/profile/Massey-Man-1"
                },
                {
                    "user_id": "Jerry Ryan",
                    "user_href": "/profile/Jerry-Ryan-6"
                },
                {
                    "user_id": "Alexandre Pioli",
                    "user_href": "/profile/Alexandre-Pioli"
                },
                {
                    "user_id": "Gregor Kikelj",
                    "user_href": "/profile/Gregor-Kikelj"
                },
                {
                    "user_id": "Ethan Jones",
                    "user_href": "/profile/Ethan-Jones-17"
                },
                {
                    "user_id": "Trung Quang",
                    "user_href": "/profile/Trung-Quang-2"
                },
                {
                    "user_id": "Stephen Weine",
                    "user_href": "/profile/Stephen-Weine"
                }
            ]
        }
    ]
}