{
    "title": "How to remember theory in one reading - Quora",
    "tags": [
        "Memory (information storage)",
        "Human Memory"
    ],
    "response": [
        {
            "author_info": {
                "name": "Siddhartha Pramanik",
                "href": "/profile/Siddhartha-Pramanik"
            },
            "answer_text": "Thanks for asking to answer. The best way that has always helped me out is to associate certain real life example or incident to the theory. Now this example may be exactly same to the theory, for example for a history event you can associate a simple recent event that repeats the instances to a very good extent, or you the example may relate to something or someone that can make you recall certain points in the theory ultimately helping you remember the complete theory. But, as suggested by Purvanshi Vakil , if you don’t remember it or understand in the first go it is pretty natural and you should try to read the same thing a few times with some break in between. In those break do something different and then after the break first try to recall the concept, if you can then voila else re-read it. This will also help you in improving your grasping capabilities too. ",
            "date": "Answered June 29, 2017",
            "views": "61",
            "upvotes": " Answer requested by Harshith S",
            "upvoters": [
                {
                    "user_id": "Harshith S",
                    "user_href": "/profile/Harshith-S-9"
                },
                {
                    "user_id": "Shurvir Sisodiya",
                    "user_href": "/profile/Shurvir-Sisodiya"
                },
                {
                    "user_id": "Raj",
                    "user_href": "/profile/Raj-1219"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yanjaa Wintersoul",
                "href": "/profile/Yanjaa-Wintersoul"
            },
            "answer_text": "Active recall. Read this paragraph: In psychology, cognitive dissonance is the mental stress or discomfort experienced by an individual who holds two or more contradictory beliefs, ideas, or values at the same time; performs an action that is contradictory to their beliefs, ideas, or values; or is confronted by new information that conflicts with existing beliefs, ideas or values. [1] And then you try to actively recall without looking at the text what you just read. This works better than reading it over and over again because you’re engaging your brain more in the process of actually remembering and making abstract words into concepts. Make the abstract into something concrete. Draw diagrams or thought-trees when you read so that’s it’s more clear on paper what’s actually being said in the text. Use memory techniques, those are Googleable. Good luck! Footnotes[1] Cognitive dissonance - Wikipedia",
            "date": "Answered December 29, 2016",
            "views": "244",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kurt Weggler",
                    "user_href": "/profile/Kurt-Weggler"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kanupriya Swami",
                "href": "/profile/Kanupriya-Swami"
            },
            "answer_text": "Thanks for A2A. Make a diagram. No matter how bogus, how random, how irregular it is, just make one. And every time you try to remember that theory, try redrawing the diagram. You will never forget it. Other ways are to create mnemonics for the important words. Or make a song. This doesn't usually work for me. But does for some people. ",
            "date": "Answered December 19, 2016",
            "views": "181",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jigar Purohit",
                    "user_href": "/profile/Jigar-Purohit-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vaibhav Bhatnagar",
                "href": "/profile/Vaibhav-Bhatnagar-23"
            },
            "answer_text": "Not sure if this is the answer you are looking for but in my opinion you should read a para or two and then write it in a notebook. Writing will help you remember theory for a longer period of time. ",
            "date": "Answered September 22, 2016",
            "views": "76",
            "upvotes": " View 1 Upvoter"
        }
    ]
}