{
    "title": "How can someone gain the appropriate skills to prepare for the coming climate change apocalypse? - Quora",
    "tags": [
        "Societal Collapse",
        "Climate Change Adaptation",
        "Survival Techniques",
        "Thinking Outside of the Box",
        "Doomsday",
        "Survivalism",
        "Apocalyptic and Post-Apocalyptic Hypothetical Scenarios",
        "Climatology",
        "Climate Change",
        "Skills"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Thompson",
                "href": "/profile/Steve-Thompson-199"
            },
            "answer_text": "You don’t need to because it won’t be happening:- Is Global warming actually occurring, and if so is it detrimental to the planet and life on Earth? It would appear that all the previous climate models predicting global warming are completely wrong - except for the Russian model which shows exactly what has been actually happening, with no prediction of notable global warming. The other 30+ models that the IPCC used are catastrophically wrong, all predicting vastly increased temperature rises which have not actually occurred. These models are the result of incorrect/cherry picked data from (mainly) Western universities, and appear to be politically/financially motivated to come up with a model that suits their global-warming agenda. There are a number of factors to consider if global warming is occurring, firstly what are the implications of a couple of degrees rise in temperature? Rainfall and drought are closely tied to the amount of moisture available in the atmosphere to fall as rain. This moisture is generated by the evaporation of water on the ground and in the seas/oceans/rivers. Water covers approximately three-quarters of the Earth’s surface as oceans/seas/rivers/lakes/snow and ice etc. so is the most abundant supply of cloud-forming moisture evaporation. The amount of evaporation is largely dependant on the surface temperature of the water, and therefore it follows that the warmer the climate and water temperature, the more evaporation will take place, and the more moisture-heavy clouds will form and the more rainfall will occur - you can check this out by looking at the rainfall in equatorial regions of the planet, they have some of the highest consistent 24-hr temperatures throughout the year and some of the highest rainfall throughout the year. Considering that a lack of potable/clean water is now fast becoming one of the more urgent problems faced in many parts of the world, this seems to indicate global warming may well be a good thing for alleviating this particular problem, and also for supplying rainfall to the various drought-stricken agricultural regions - as well as opening up previously unsuitable farming areas such as dry bush and semi-arid regions, areas of perma-frost etc. This may result in a small rise in sea level, but the majority of the ice-melt will probably end up as atmospheric moisture (clouds), or as ground water in previously dry regions. Global cooling, however, will result in the opposite effects - leading to less evaporation and rain-bearing clouds, more drought, increase in polar ice, less rainfall, dropping of sea and freshwater levels and eventually increased famine and arid/semi-arid desert regions. Increase in atmospheric carbon dioxide (CO2) levels. What effect will an increase/decrease in CO2 have upon the planet? CO2 (carbon and oxygen, which all living things are based on) is an essential ingredient that allows photosynthesis to take place in plants. Photosynthesis enables the plant to convert sunlight into energy for growth and health. Without sufficient CO2 in the atmosphere we would have no plants, and as they are at the start of the food chain there would be no food of any description to sustain life of any sort, bar microorganisms and bacteria. An increase of CO2 up to 40% on present levels would increase plant growth and yield without any ill effects to them, and would actually be of benefit to humans and all other life-forms as it would increase the basic food source. As CO2 is a ‘greenhouse gas’ a rise in levels would increase the atmospheric/surface temperature by blocking out some of the radiated heat from the Earth’s surface that normally radiates into space, thus giving a small rise in temperature consistent with the rise in CO2. But as I have already shown - this is a good thing, as the increase in temperature brings with it increased rainfall, and more farming land will go hand in hand with the increase in plant growth arising from the greater photosynthesis available. A lush future! Altogether, I believe that if/when global warming occurs it will be a very good thing for all life on Earth - except for the global-warming doomsayers who are largely driven by Marxist/Socialist ideology (or money and power through carbon credit trading) and have no interest in discovering the simple, common-sense, science behind it - even though many have been to (or are still in) further education establishments, which appear to be teaching socialist doctrines rather than the useful education that the State or their parents have been paying for. ",
            "date": "Answered April 13, 2019",
            "views": "97",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Romain André Raphaël Antaya",
                    "user_href": "/profile/Romain-André-Raphaël-Antaya"
                },
                {
                    "user_id": "Dean Rojas",
                    "user_href": "/profile/Dean-Rojas-2"
                },
                {
                    "user_id": "Jerrod Mason",
                    "user_href": "/profile/Jerrod-Mason-1"
                },
                {
                    "user_id": "John McLean",
                    "user_href": "/profile/John-McLean-72"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dean Rojas",
                "href": "/profile/Dean-Rojas-2"
            },
            "answer_text": "What Climate Change apocalypse? You mean the disastrous and natural weather events that have been occurring for millions of years? Global Warming is a HOAX. One (1) degree total rise in temperature spread over the last 140 years does not Global Warming make … that translates to less than 0.007 degree rise per year … totally insignificant! Since Global Warming is not real, then it can not be the cause of Climate Change. So relax .. just go inland when the next major hurricane is coming your way … would not be a good time to go to the beach. Avoid California forest camping trips during the dry season .. listen for tsunami sirens and head for the hills . .. and you will be fine .. ",
            "date": "Answered April 13, 2019",
            "views": "54",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "James Matkin",
                    "user_href": "/profile/James-Matkin"
                }
            ]
        }
    ]
}