{
    "title": "How to determine the quantum numbers for the valence electrons of elements in the d-block of the periodic table - Quora",
    "tags": [
        "Valence Electrons",
        "Periodic Table"
    ],
    "response": [
        {
            "author_info": {
                "name": "Greg Burns",
                "href": "/profile/Greg-Burns-5"
            },
            "answer_text": "The quantum numbers for electrons are determined by the rules for quantum numbers. The principal quantum number (n) specifies the row within the periodic table of the highest shell valence electrons. The different types of orbital are specified by the azimuthal quantum number (l). The value of this determines which block you find an element. s-block elements have their s-orbitals unfilled, electrons within which have l =0. p-block elements have their p-orbitals unfilled, electrons within which have l = 1. d-block elements have their d-orbitals unfilled, electrons within which have l=2. Image courtesy Electron Configuration of Transition Metals  However, valance electrons are typically determined from the s-block and p-block. This is because d-block electrons are always a shell lower than the equivalent s-block and p-block electrons. You can see this from the order of filling by the aufbau principle. Image courtesy Aufbau principle - Wikipedia  Although d-block electrons are not typically considered valence electrons, there can be electrons that can have states within s-orbitals, and p-orbitals which correspond with the group number. This allows the same d-block element to take different oxidation states in some instances. Because of this variability, the concept of valency doesn’t work terribly well with d-block elements. However, the quantum numbers themselves of the outmost electrons are described by principal, and azimuthal quantum number. The magnetic, and spin projection quantum numbers can have any allowed value. These have no impact on row, or block within the periodic table. ",
            "date": "Answered March 30, 2019",
            "views": "28",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ajit Singh Bhatnagar",
                    "user_href": "/profile/Ajit-Singh-Bhatnagar"
                },
                {
                    "user_id": "Jess H. Brewer",
                    "user_href": "/profile/Jess-H-Brewer-3"
                },
                {
                    "user_id": "Jyotipuspa Das ( ଜ୍ୟୋତିପୁଷ୍ପା ଦାସ)",
                    "user_href": "/profile/ज्योतिपुष्पा-दास-Jyotipuspa-Das-ଜ୍ୟୋତିପୁଷ୍ପା-ଦାସ"
                },
                {
                    "user_id": "Karen Marie Shelton",
                    "user_href": "/profile/Karen-Marie-Shelton"
                },
                {
                    "user_id": "Karen Carmichael",
                    "user_href": "/profile/Karen-Carmichael-7"
                },
                {
                    "user_id": "James Smith",
                    "user_href": "/profile/James-Smith-3709"
                },
                {
                    "user_id": "Kirk A. Janowiak",
                    "user_href": "/profile/Kirk-A-Janowiak"
                },
                {
                    "user_id": "Rigopoula Tsambou Talarantas",
                    "user_href": "/profile/Rigopoula-Tsambou-Talarantas"
                },
                {
                    "user_id": "Jerry Sorrell",
                    "user_href": "/profile/Jerry-Sorrell"
                },
                {
                    "user_id": "Elsa Kristian",
                    "user_href": "/profile/Elsa-Kristian"
                }
            ]
        }
    ]
}