{
    "title": "How many times does photosynthesis occur a day? - Quora",
    "tags": [
        "Photosynthesis"
    ],
    "response": [
        {
            "author_info": {
                "name": "Caitlin Jeffries",
                "href": "/profile/Caitlin-Jeffries"
            },
            "answer_text": "How many times do you breathe in a day? Sure, you could count the number of “in breaths” in one day. Leaving aside that this would change on a daily basis, it overly simplifies a complex, unending process. You are constantly breathing, oxygen and carbon dioxide are crossing cell membranes in and out of your lungs and bloodstream. It’s far more accurate to say that you are constantly breathing than to count a certain number of breaths, although that is theoretically possible. With photosynthesis, it’s even more complicated to count than a human’s breath. Whilst we inhale and exhale in a predictable cycle, each cell in a plant capable of photosynthesis is photosynthesising independently of all others. While ever those cells have access to their 3 main needs- water, carbon dioxide and sunlight, they are constantly converting light energy into chemical energy through photosynthesis. Photosynthesis is not a discrete and quantifiable action- it’s a continuous process that occurs whenever the right conditions are met. You therefore cannot say that photosynthesis occurred x amount of times in one day… but you can say that photosynthesis occurred (or did not occur). Hope that helps! xx ",
            "date": "Answered June 26, 2018",
            "views": "888",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Henry Norman",
                    "user_href": "/profile/Henry-Norman-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Henry Norman",
                "href": "/profile/Henry-Norman-3"
            },
            "answer_text": "How many times does photosynthesis occur a day? Short answer: Once a day, starts at first light, ends when darkness sets in. Photosynthesis is a continuous process, present in every one of virtually uncountable thylakoids inside uncountable chloroplasts in uncountable plants, plus in every one of uncountable cyanobacteria.  ",
            "date": "Answered September 7, 2019",
            "views": "895",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "P Whitekitten",
                    "user_href": "/profile/P-Whitekitten-1"
                },
                {
                    "user_id": "Vaibhav Krishan",
                    "user_href": "/profile/Vaibhav-Krishan"
                }
            ]
        }
    ]
}