{
    "title": "How does enzyme actually catalyze any reaction? - Quora",
    "tags": [
        "Enzymology",
        "Enzymes",
        "Chemical Reactions",
        "Biochemistry",
        "Biology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Luke Mercer",
                "href": "/profile/Luke-Mercer-13"
            },
            "answer_text": "Living things have thousands of different chemical reactions going on inside them all the time, including the reactions involved in metabolism. These reactions need to be carefully controlled - to get the right amount of substances. You can usually make a reaction happen more quickly by raising the temperature. This would speed up the useful reactions but also the unwanted ones too… not good. There’s also a limit to how far you can raise the temperature inside a living creature before its cells start getting damaged. So… living things produce enzymes that act as biological catalysts. This is how they work… Chemical reactions usually involve things either being split apart or joined together. Every enzyme has an active site with a unique shape that fits onto the substance involved in a reaction. Enzymes are really picky - they usually only catalyze one specific reaction. This is because, for the enzyme to work, the substrate has to fit into its active site. If the substrate doesn’t match the enzyme’s active site, then the reaction won’t be catalyzed. A catalyst is a substance which increases the speed of a reaction, by providing an alternative reaction pathway with a lower activation energy, without being changed or used up in the reaction. Activation energy is the minimum amount of energy needed for a reaction to start. ",
            "date": "Answered November 29, 2019",
            "views": "474",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kenneth Armstrong",
                    "user_href": "/profile/Kenneth-Armstrong-9"
                },
                {
                    "user_id": "Amani Mg",
                    "user_href": "/profile/Amani-Mg"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Halmeck",
                "href": "/profile/William-Halmeck"
            },
            "answer_text": "Enzymes bring the reactants to the transition state at a lower energy level than without the enzyme. In doing so, an enzyme facilitates an increase in the rate of the reaction, simply because the energy barrier is lower. Enzymes accomplish this in various ways, including, but not limited to: substrate orientation, bond stress, and microenvironment. ",
            "date": "Answered April 30, 2018",
            "views": "958",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kenneth Armstrong",
                    "user_href": "/profile/Kenneth-Armstrong-9"
                },
                {
                    "user_id": "Ruby Porter",
                    "user_href": "/profile/Ruby-Porter-17"
                },
                {
                    "user_id": "Billie Jimenez",
                    "user_href": "/profile/Billie-Jimenez-4"
                },
                {
                    "user_id": "Christopher Dwyer",
                    "user_href": "/profile/Christopher-Dwyer-3"
                },
                {
                    "user_id": "Jo",
                    "user_href": "/profile/Jo-856"
                },
                {
                    "user_id": "Manuel Bertsch",
                    "user_href": "/profile/Manuel-Bertsch"
                },
                {
                    "user_id": "Michael Soso",
                    "user_href": "/profile/Michael-Soso"
                }
            ]
        }
    ]
}