{
    "title": "How is a double rainbow formed? - Quora",
    "tags": [
        "Double Rainbows"
    ],
    "response": [
        {
            "author_info": {
                "name": "Srinivasan Narayanaswamy",
                "href": "/profile/Srinivasan-Narayanaswamy-7"
            },
            "answer_text": "How are double rainbows formed?Double rainbows are formed when sunlight is reflected twice within a raindrop with the violet light that reaches the observer's eye coming from the higher raindrops and the red light from lower raindrops. This means the sequence of colours is inverted compared to the primary rainbow, with the secondary bow appearing about 10 degrees above the primary bow. In a primary rainbow, the arc shows red on the outer part and violet on the inner side. This rainbow is caused by light being refracted when entering a droplet of water, then reflected inside on the back of the droplet and refracted again when leaving it. In a double rainbow, a second arc is seen outside the primary arc, and has the order of its colours reversed, with red on the inner side of the arc. This is caused by the light being reflected twice on the inside of the droplet before leaving it.. What is a double rainbow? A double rainbow is a wonderful sight where you get two spectacular natural displays for the price of one.Surprisingly, this phenomenon is actually relatively common, especially at times when the sun is low in the sky such as in the early morning or late afternoon. The second rainbow is fainter and more 'pastel' in tone than the primary rainbow because more light escapes from two reflections compared to one. The secondary rainbow is also dispersed over a wider area of the sky. It is nearly twice as wide as the primary bow. A key feature of double rainbows is that the colour sequence in the second rainbow is reversed, so instead of red, orange, yellow, green, blue, indigo and violet (ROYGBIV), the colours appear in VIBGYOR order. The dark band between the two rainbows is known as Alexander's band, after Alexander of Aphrodisias who first described it in 200AD. The band forms because between the deviation angles of the primary and secondary rainbows none of the sunlight is scattered by the raindrops towards the observer giving the band of dark sky. Please see the picture below:-  In a primary rainbow, the arc shows red on the outer part and violet on the inner side. This rainbow is caused by light being refracted when entering a droplet of water, then reflected inside on the back of the droplet and refracted again when leaving it. In a double rainbow, a second arc is seen outside the primary arc, and has the order of its colours reversed, with red on the inner side of the arc. This is caused by the light being reflected twice on the inside of the droplet before leaving it.. What is a double rainbow? A double rainbow is a wonderful sight where you get two spectacular natural displays for the price of one.Surprisingly, this phenomenon is actually relatively common, especially at times when the sun is low in the sky such as in the early morning or late afternoon. The second rainbow is fainter and more 'pastel' in tone than the primary rainbow because more light escapes from two reflections compared to one. The secondary rainbow is also dispersed over a wider area of the sky. It is nearly twice as wide as the primary bow. A key feature of double rainbows is that the colour sequence in the second rainbow is reversed, so instead of red, orange, yellow, green, blue, indigo and violet (ROYGBIV), the colours appear in VIBGYOR order. The dark band between the two rainbows is known as Alexander's band, after Alexander of Aphrodisias who first described it in 200AD. The band forms because between the deviation angles of the primary and secondary rainbows none of the sunlight is scattered by the raindrops towards the observer giving the band of dark sky. Please see the picture below:- Is seeing a double rainbow Good luck? As we all know, seeing a rainbow is good luck, provided that you can find the end of it, along with a pot of gold like the double rainbow guy. While the gold part may be false, the fact is that seeing a rainbow in nature is always an exciting experience. What does 2 rainbows mean in the Bible? According to Eastern cultures, a double-rainbow is a symbol of transformation and a sign of good fortune. The material world is represented by the first arc, while the second arc is the spiritual realm. Hmmm…Sounds good. I'll take it. In the Bible, there are a few books that make references to rainbows Please enjoy seeing the picture hereunder:-  How rare is a triple rainbow? According to the Optical Society in Washington D.C. – a scientific society with 16,000 members around the world – there have been only five scientific reports of triple rainbows in 250 years. Some scientists believed triple and quadruple rainbows did not truly exist in nature, but now scientists have their proof. WISHING YOU ALL THE BEST AND BE HAPPY WHEN YOU SEE DOUBLE RAINBOWS! Is seeing a double rainbow Good luck? As we all know, seeing a rainbow is good luck, provided that you can find the end of it, along with a pot of gold like the double rainbow guy. While the gold part may be false, the fact is that seeing a rainbow in nature is always an exciting experience. What does 2 rainbows mean in the Bible? According to Eastern cultures, a double-rainbow is a symbol of transformation and a sign of good fortune. The material world is represented by the first arc, while the second arc is the spiritual realm. Hmmm…Sounds good. I'll take it. In the Bible, there are a few books that make references to rainbows Please enjoy seeing the picture hereunder:-  How rare is a triple rainbow? According to the Optical Society in Washington D.C. – a scientific society with 16,000 members around the world – there have been only five scientific reports of triple rainbows in 250 years. Some scientists believed triple and quadruple rainbows did not truly exist in nature, but now scientists have their proof. WISHING YOU ALL THE BEST AND BE HAPPY WHEN YOU SEE DOUBLE RAINBOWS! ",
            "date": "Answered October 27, 2019",
            "views": "1",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shivank Singh",
                    "user_href": "/profile/Shivank-Singh-85"
                }
            ]
        },
        {
            "author_info": {
                "name": "Girija Devi",
                "href": "/profile/Girija-Devi-76"
            },
            "answer_text": "Double rainbows are formed when sunlight is reflected twice within a raindrop with the violet light that reaches the observer's eye coming from the higher raindrops and the red light from lower raindrops. It's interesting that a double rainbow is considered a symbol of transformation and is a sign of good fortune in eastern cultures. The first arc represents the material world, and the second arc signifies the spiritual realm. ... Therefore, a single rainbow signifies a human descending from heaven to earth. About the duration That rainbow was recorded as lasting six hours, from 09:00 to 15:00, according to the Guinness World Records. Rainbows typically last much less than an hour, according to the Guinness website. ",
            "date": "Answered June 1, 2020",
            "views": "178",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shivank Singh",
                    "user_href": "/profile/Shivank-Singh-85"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/W-Sijy-775352-Sijy"
                },
                {
                    "user_id": "Aradhna Rani",
                    "user_href": "/profile/Aradhna-Rani"
                }
            ]
        }
    ]
}