{
    "title": "How many calories does an adult burn without exercise in a day? - Quora",
    "tags": [
        "Burning Calories",
        "Calories",
        "Exercise"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nitin Sharma",
                "href": "/profile/Nitin-Sharma-2672"
            },
            "answer_text": "you can use the chart supplied by the U.S. Department of Agriculture to estimate your burn rate. Note that the numbers are based on the energy needs of the average man, who is 5 feet, 10 inches tall and weighs 154 pounds; the average woman in these estimates is 5 feet, 4 inches tall and 126 pounds. Sedentary means you do only the light activity associated with daily life -- such as walking from your car to a desk job and making dinner; moderately active accounts for those that do movement equal to 1.5 to 3 miles per day; active means you do physical activity in addition to daily life that's equal to walking more than 3 miles per day. The average daily calorie burn rate for a man between the ages of 31 and 50 is 2,200 to 2,400 if he's sedentary; 2,400 to 2,600 if he's moderately active; and 2,800 to 3,000 calories if he's considered active. For sedentary women, also between the ages of 31 to 50, the average calorie burn is 1,800 per day; for moderately active women, it's 2,000 calories; and for active women, it's 2,200 calories per day. People who are larger or smaller than the average person used to determine these ranges will burn a different amount of calories. Younger people tend to burn more than these estimates, while older people tend to burn fewer calories. The estimates don't accurately take into account intensity of daily activity, genetics or body composition, either. Counting Calories Once you have an estimate of how many calories you burn daily, you can then project how much you should eat to either maintain, lose or gain weight. If you eat more 3,500 calories than you need for maintenance, you gain a pound; if you eat 3,500 calories fewer, you lose one. But, counting calories, just like estimating your daily burn rate, is not precise. As Marion Nestle points out, people underestimate their daily calorie intake by an average of 30 percent. Usually, people fail to remember exactly what they ate and think their portions were smaller than they actually were. Even if you are spot-on with your estimates, food packaging isn't always 100 percent accurate, and meats, dairy and vegetables aren't uniform -- their organic nature means some may have more fat or fiber, which can change the calorie count. Keep track the best you can to stay in line with your calorie needs. If the scale starts to creep up, you know you're probably eating more than your body needs and that you should trim portion sizes slightly and exercise more. ",
            "date": "Answered July 13, 2018",
            "views": "32",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abby Nicks",
                    "user_href": "/profile/Abby-Nicks"
                },
                {
                    "user_id": "Prerna Chauhan",
                    "user_href": "/profile/Prerna-Chauhan-14"
                },
                {
                    "user_id": "Aishwarya Vr",
                    "user_href": "/profile/Aishwarya-Vr-1"
                },
                {
                    "user_id": "Saif Malik",
                    "user_href": "/profile/Saif-Malik-63"
                },
                {
                    "user_id": "Minal Khan",
                    "user_href": "/profile/Minal-Khan-2"
                },
                {
                    "user_id": "Cheema Saab",
                    "user_href": "/profile/Cheema-Saab-11"
                },
                {
                    "user_id": "Daniel DX",
                    "user_href": "/profile/Daniel-DX-1"
                },
                {
                    "user_id": "Sarah Parvez",
                    "user_href": "/profile/Sarah-Parvez"
                },
                {
                    "user_id": "Waqar Ahmad",
                    "user_href": "/profile/Waqar-Ahmad-441"
                },
                {
                    "user_id": "Arbaz Azam",
                    "user_href": "/profile/Arbaz-Azam-1"
                }
            ]
        }
    ]
}