{
    "title": "How is kinetic energy related to the equation E=mc^2? It seems to infer a mass moving at speed c^2 (impossible). Does it say the relativistic energy of a mass is equal to the kinetic energy of that mass if it somehow moved at a speed of c^2? - Quora",
    "tags": [
        "Mass Energy Equivalence",
        "Kinetic Energy",
        "Special Relativity",
        "Relativity (physics)",
        "Energy (physics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jonathan Lang",
                "href": "/profile/Jonathan-Lang-6"
            },
            "answer_text": "The classic formula for kinetic energy is E=½mv². Does this mean that if you have a mass of 10kg and a kinetic energy of 1000J (1J=1kg·m²/s²), that you're moving at a speed of 100 m²/s²? No; you're moving at a speed of 10m/s. Last I checked, no one has a problem with this. What I don't get is why it suddenly becomes so confusing when using the very similar in form E=mc². Now, there is a bit more to this, in that the mass isn't moving at the speed of light; and in fact E=mc² is not itself talking about kinetic energy. But my point is that just because the equation has a velocity-squared factor in it, that doesn't mean that you're moving at a “speed squared”. But to this other point, let's look at another classic energy equation: E=mgh. This is the Galilean equation for potential energy. You have mass, a gravitational constant (approximately 10 meters per second each second), and an attitude. Multiply the three together, and you get your potential energy. Does this mean that the mass is accelerating at 10 m/s²? Not exactly, no. If it's rolling down a slope, its acceleration is probably much less than g; if it's sitting on a flat surface, it's probably not accelerating at all. But you still use the acceleration of gravity when calculating its potential energy. The point is that the acceleration of the object isn't the same as the acceleration of gravity: they are related; but they are not the same. In the same way, the c in E=mc² isn't the speed of the object; it's the speed of light. There's a connection between the speed of the object and the speed of light; but they're not the same thing. Another thing: the Relativistic formula for kinetic energy isn't E=mc²; it's: [math]E=\\dfrac{mc^2}{\\sqrt{1-\\tfrac{v^2}{c^2}}}[/math] Again, let's look back at classical physics for an analogy. As I said above, Galileo's formula for potential energy was E=mgh. Newton replaces this with: [math]E=-\\dfrac{GM}{r}[/math] It turns out that Galileo's equation is a good approximation of Newton's equation under certain limited circumstances, such as when your distance from the center of the Earth doesn't change significantly. In a similar way, the classic E=½mv² formulas for kinetic energy turns out to be a good approximation of the Relativistic kinetic energy formula as long as your speed is effectively zero when compared to the speed of light. Another point of similarity: with Galileo's potential energy formula, the altitude is arbitrary: you choose a reference altitude, and measure potential energy relative to that. But with Newtonian potential energy, you don't have that freedom: the equation is set such that the potential energy is always negative, and gets closer and closer to zero the further away from the gravitational source that you get. In a similar way, the classical kinetic energy depends solely on your velocity; you could easily modify it to be [math]E=½mv^2+E_0[/math], where [math]E_0[/math] is a “baseline level of energy” that isn't dependent on velocity. We generally don't do that, because the math is easier if you assume that the baseline energy is zero. But with Relativistic kinetic energy, you don't get that freedom: instead, that “baseline energy level” is required to be mc². In other words, E=mc² is what you get when you set the velocity to zero: it's the “baseline energy level” that an object has when it isn't moving. ",
            "date": "Answered August 25, 2020",
            "views": "83",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gary Novosielski",
                "href": "/profile/Gary-Novosielski"
            },
            "answer_text": "No it does not infer anything, and does not imply that a mass is moving at a speed of [math]c^2[/math]. It can’t; and not because [math]c^2[/math] is an impossibly fast speed, but because [math]c^2[/math] is not a speed at all. Speeds are measured in m/s. But [math]c^2[/math] has units of m²/s². It would be like attempting to drive your car at a rate measured in square miles per square hour. What the hell is even that? as they say. But m²/s², if multiplied by a mass in kg gives you units of kg·m²/s². And that, in case you don’t recognize it, is the unit called the joule—the unit of energy. So if you want an equation with an [math]E[/math] on the left, and an [math]m[/math] on the right, you’re going to have to multiply the [math]m[/math] by the square of a speed in order to make it come out right. ",
            "date": "Answered August 28, 2020",
            "views": "18",
            "upvotes": "0"
        }
    ]
}