{
    "title": "How to prevent yourself from being too dependent on technology - Quora",
    "tags": [
        "Dependency",
        "Self-Improvement",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chuck Brush",
                "href": "/profile/Chuck-Brush-1"
            },
            "answer_text": "I would imagine the goal is to find a nice balance you are comfortable with.. For me, I wouldn’t choose to ride a bicycle everywhere, but I might consider a vintage vehicle or perhaps a Geo Metro. I like to be able to fix or maintain most of the things I own. This allows me not to be dependent on technology and the disposable culture associated with it. When I buy a television it is a gamble. I will have to pay the state of California for the privilege of disposing of it when it breaks because televisions are not repairable by me or anyone else. Desktop computers are a bit different, they are repairable to some extent, laptops not so much. I don't know if this counts, but I saw a young woman sitting cross-legged by her car with the wheel off looking at her smartphone. I asked what she was doing she said a brake job. She had found good instructions on YouTube and wasn't going to give the dealer the $400 he wanted for simply putting new pads on. In this case technology had made her less dependent. There are people who consider themselves voluntary simplists. I think they follow a similar line of thought, making careful choices in line with their chosen goals. ",
            "date": "Updated April 4, 2020",
            "views": "652",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jake Ledger",
                    "user_href": "/profile/Jake-Ledger-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Gruszynski",
                "href": "/profile/Jeff-Gruszynski"
            },
            "answer_text": "Choose to stop using technology. Start with dropping one at a time. Learn to live without the one. You eventually find you never really needed it that much. Learn to become self-reliant. Start to ask yourself how you depend on technology in ways that may be making you dependent in an unhealthy way. Find and associate people who want the same thing so you can all support and learn from each other. ",
            "date": "Answered April 3, 2018",
            "views": "352",
            "upvotes": "0"
        }
    ]
}