{
    "title": "How do T-Cells recognize cancerous cells? - Quora",
    "tags": [
        "T Cells",
        "Cancer Biology",
        "Cancer Biology Research in Depth",
        "Cell Biology Research in Depth",
        "Immunology",
        "Cancer"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rafael Matias",
                "href": "/profile/Rafael-Matias"
            },
            "answer_text": "I would add some important aspect of T-cell recognition and activation. The antigen recognized on tumor cells are of 2 types: Tumor-specific transplantation antigens (TSTAs) and tumor-associated transplantation antigens (TATAs). Tumor-specific antigens are unique to tumor cells and do not occur on normal cells in the body. They may result from mutations in tumor cells that generate altered cellular proteins; cytosolic processing of these proteins would give rise to novel peptides that are presented with class I MHC molecules, inducing a cell-mediated  esponse by tumor-specific CTLs (Figure 22-6). Tumor-associated antigens, which are not unique to tumor cells, may be proteins that are expressed on normal cells during fetal development when the immune system is immature and unable to respond but that normally are not expressed in the adult. Reactivation of the embryonic genes that encode these proteins in tumor cells results in their expression on the fully differentiated tumor cells. Tumor-associated antigens may also be proteins that are normally expressed at extremely low levels on normal cells but are expressed at much higher levels on tumor cells. It is now clear that the tumor antigens recognized by human T cells fall into one of four major categories:■ Antigens encoded by genes exclusively expressed by tumors■ Antigens encoded by variant forms of normal genes that have been altered by mutation■ Antigens normally expressed only at certain stages of differentiation or only by certain differentiation  lineages■ Antigens that are overexpressed in particular tumors The activation T-cells need at least 2 or more signals to activation and proliferation, the stimulation have to be maintained as well. The inflammation through the cascate of necroses may play the major role on this case, because many of tumor cell may die due to randon mutation.Necroses of healthy tissue due the mechanical influence of cancer cells stimulate the immune surveillance as well. The other hypotheses is that the high level of mitoses changes the environment around the healthy tissue. Clinical application Stimulation of T-cell by the administration of monoclonal antibody target to cancel cells has been shown to be helpful. To sum up, it’s may be better to teach your body how to combat the cancer cells rather than try to destroy than  by chemo or surgical procedure ",
            "date": "Answered February 16, 2012",
            "views": "26",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cherry Geathers",
                    "user_href": "/profile/Cherry-Geathers"
                },
                {
                    "user_id": "Christian Gingras",
                    "user_href": "/profile/Christian-Gingras-1"
                },
                {
                    "user_id": "Harsh Oza",
                    "user_href": "/profile/Harsh-Oza-13"
                },
                {
                    "user_id": "Tim C",
                    "user_href": "/profile/Tim-C-12"
                },
                {
                    "user_id": "Jack Paul",
                    "user_href": "/profile/Jack-Paul-45"
                },
                {
                    "user_id": "Linda Sommers",
                    "user_href": "/profile/Linda-Sommers"
                },
                {
                    "user_id": "Emiel de Jonge",
                    "user_href": "/profile/Emiel-de-Jonge"
                },
                {
                    "user_id": "Namit Holay",
                    "user_href": "/profile/Namit-Holay"
                },
                {
                    "user_id": "Shubham Garg",
                    "user_href": "/profile/Shubham-Garg-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ian York",
                "href": "/profile/Ian-York"
            },
            "answer_text": "There are two parts to this question: How do T cells recognize anything, and what are the specific targets on a cancer cell. I won't address the first part, but the point to that is that cancer cell are recognized using the same mechanisms that T cells use to recognize infected cells. In the latter case, the cells contain targets that are not self -- they originate from viruses, or bacteria or whatever -- and there are T cells in the body that can recognize these foreign targets and respond to destroy the infected cell and otherwise trigger an inflammatory response. So T cells see non-self targets. But cancer cells are self! So where are the non-self targets coming from? Broadly speaking, there are two general classes of cancer antigens (that is, T cell targets on a cancer cell).  Because cancer cells often contain mutated proteins, the mutated region may act as a non-self target. Or, the cancer cell may express very high levels of a protein that is normally present at low levels, and the high expression may allow recognition. In both cases, the target may be an essential part of the cancer' biology (say, a growth factor that drives the abnormal growth) or it may be an innocent bystander (because cancer cells often have genome-wide mutations that include irrelevant components). There is a database of cancer antigens at http://www.cancerimmunity.org/peptidedatabase/Tcellepitopes.htmas well as a more detailed overview. ",
            "date": "Answered February 12, 2012",
            "views": "24",
            "upvotes": " View 20 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Denis O'Malley",
                    "user_href": "/profile/Denis-OMalley"
                },
                {
                    "user_id": "David Chan",
                    "user_href": "/profile/David-Chan-316"
                },
                {
                    "user_id": "Daniele Lotito",
                    "user_href": "/profile/Daniele-Lotito"
                },
                {
                    "user_id": "Harsh Oza",
                    "user_href": "/profile/Harsh-Oza-13"
                },
                {
                    "user_id": "Ilias Gioldasis",
                    "user_href": "/profile/Ilias-Gioldasis"
                },
                {
                    "user_id": "Amay Redkar",
                    "user_href": "/profile/Amay-Redkar"
                },
                {
                    "user_id": "Jack Paul",
                    "user_href": "/profile/Jack-Paul-45"
                },
                {
                    "user_id": "Linda Sommers",
                    "user_href": "/profile/Linda-Sommers"
                },
                {
                    "user_id": "Jeffrey Brender",
                    "user_href": "/profile/Jeffrey-Brender"
                },
                {
                    "user_id": "Rodney Price",
                    "user_href": "/profile/Rodney-Price-7"
                },
                {
                    "user_id": "Leo Simmons",
                    "user_href": "/profile/Leo-Simmons-2"
                },
                {
                    "user_id": "Dave Light",
                    "user_href": "/profile/Dave-Light-3"
                },
                {
                    "user_id": "Truong My Anh",
                    "user_href": "/profile/Truong-My-Anh"
                },
                {
                    "user_id": "Alex Rubinsteyn",
                    "user_href": "/profile/Alex-Rubinsteyn"
                },
                {
                    "user_id": "Dora Zhou",
                    "user_href": "/profile/Dora-Zhou"
                },
                {
                    "user_id": "Namit Holay",
                    "user_href": "/profile/Namit-Holay"
                },
                {
                    "user_id": "Shubham Garg",
                    "user_href": "/profile/Shubham-Garg-2"
                },
                {
                    "user_id": "Rafael Matias",
                    "user_href": "/profile/Rafael-Matias"
                },
                {
                    "user_id": "Cinjon Resnick",
                    "user_href": "/profile/Cinjon-Resnick"
                },
                {
                    "user_id": "Emily Altman",
                    "user_href": "/profile/Emily-Altman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cherry Geathers",
                "href": "/profile/Cherry-Geathers"
            },
            "answer_text": "I am so impressed by poster Rafael’s essay on T-cell recognition ability. Have to print it out to peruse. I do have an addendum .Cancer cells sometimes cause a reduction in the production of MHC Class I molecules. NKT cells detect this condition as an abnormality that calls for the destruction of the cell. ",
            "date": "Answered October 12, 2019",
            "views": "53",
            "upvotes": "0"
        }
    ]
}