{
    "title": "How to get a job in a Planetarium - Quora",
    "tags": [
        "Planetariums",
        "Observatories",
        "Job Search Advice",
        "Job Searches",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Zaid Dinally",
                "href": "/profile/Zaid-Dinally"
            },
            "answer_text": "Learn and explore the multifaceted roles and responsibilities of people who work in planetariums. Try and get some presenting experiences maybe as an enabler. Also read up on popular astronomy books and magazines. Also see what the curriculum is within schools because you will have to explain concepts to a school audience. Ask the questions if you are comfortable with school children and dealing with members of the public? Voice projection is also very important. From following and supporting planetarium presenters they really need to be confident speaking publicly. One can imagine that such questions would be posed during an interview. Having an interest in astronomy and perhaps being part of an astronomical society can be an advantage. Some people start working in a science museum that hosts a large planetarium such as Thinktank | Birmingham Museums and then move around to purpose built planetariums based in Winchester Science Centre as Winchester Science Centre & Planetarium. However a lot of schools and colleges are far from museums so the most experienced presenters set up mobile planetariums such as Immersive Experiences [Home page] and DOME360 Home | Immersive Planetarium Systems | DOME 360 The prospective worker in any planetarium must be prepared to travel especially for training and delivering shows for corporate events. For example, Immersive Experiences was present at Alton Towers during British Science week and at university or college during BBC Stargazing events. Therefore considerable social media work is involved along with liaising with a very diverse range of people. The prospective interviewee will prompted about their communication skills and willingness to learn new presentation technologies. Planetarium sector is specialised and is continually evolving. INSIDE DOME: Using mobile planetarium at science exhibition. Preparing inside.  INSIDE VIEW: Checking the projector works. Being multilingual is an advantage here  EXHIBITION: Big Bang event in 2013 with Immersive Experiences  HAVE FUN: Finally have a passion for learning and teaching  Hope these help answer you question. ",
            "date": "Answered June 2, 2017",
            "views": "815",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mohammad Ali",
                    "user_href": "/profile/Mohammad-Ali-240"
                }
            ]
        }
    ]
}