{
    "title": "How do signals travel to right places inside the brain? - Quora",
    "tags": [
        "Enptemology",
        "Signal (communications)",
        "Signal Processing",
        "Human Brain"
    ],
    "response": [
        {
            "author_info": {
                "name": "Fabian van den Berg",
                "href": "/profile/Fabian-van-den-Berg"
            },
            "answer_text": "Let’s immensely simplify things here. We all have light switches in our house right? Usually we have more than one switch and more than one light. Flick a switch and a light turns on (I know, one switch can turn on more than one light and multiple switches can work the same light, but let’s keep it simple). How does the electricity know where to go? why does it always go to the same lightbulb and not some other light? Well, because that switch is connected to that light, not to any of the other lights. There’s no other place that it could have gone but there.  When it comes to more complex behavior, likt you describe, we’re talking about attention and selection biasing motor commands. This happens all the time, although not that explicit. You need to disinhibit for a motor command to be executed. This is a bit more complex and not completely clear, but the same concepts are valid. IF the luminance outside goes below X THEN turn on the light.  IF I see “cat” THEN execute the motor program to press the button. Signals aren’t free floating in the brain, it’s no highway with multiple exits and ramps. It’s a one-way street with a beginning and an end. In your example there’s a one way street to execute the motor command “PRESS THE BUTTON!!!”. It’s not a straight road and it has multiple stops along the way (even a few roads connecting to other roads), but a one-way street nonetheless. That signal is ready to go, but the street is closed off, so no button pressing. Then you see that word “cat” which acts as a selection criteria. The inhibition of the command stops, the road is no longer closed off, and you press that button. There’s no decision going on at that level, neurons and action potentials don’t make decision. Think less “little cars driving around” and more “dominoes falling down”. The brain as a collection of neurons does make decisions (in a way, though that’s up for debate) but that’s a whole different question. The signal doesn’t “know” where to go, it just goes when it can. “you” as a complex organism do “know” when the signal should go. How you know and make that signal go is still being figured out. We’re not sure how motivation and attention work on the selection of signals, just that they do. It’s probably some immensely complicated system that’ll be a beautiful example of nature finding a way. ",
            "date": "Answered May 25, 2017",
            "views": "290",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daniel Nyman",
                    "user_href": "/profile/Daniel-Nyman-6"
                },
                {
                    "user_id": "Naela Blosh",
                    "user_href": "/profile/Naela-Blosh"
                },
                {
                    "user_id": "Steve DeBerry",
                    "user_href": "/profile/Steve-DeBerry"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul King",
                "href": "/profile/Paul-King-2"
            },
            "answer_text": "The brain functions and processes information via neuron-to-neuron signaling, but signals mostly just propagate; they don’t navigate. To make an analogy to computing, this is like asking how does the signal travel from the mouse button to the website when you click on a link? The signal traveling is something of an illusion whereas in reality there is a lot of complex processing happening. That said, in the case of hand-eye coordination, for example, the brain is able to establish signaling feedback loops between the visual and motor areas. The mechanisms have not been worked out, but there are theories floating around regarding signal routing, attentional biasing, surround suppression, inter-area neuronal oscillation synchronization, and other possible mechanisms. A key theme of signal routing in the brain, is that the routing happens not by navigation, which would involve the source identifying the destination, but by selection, in which the destination selects the source. In other words, it is the responsibility of a receiving brain area to decide what sources to listen to rather than the responsibility of the sending area to decide where the signal should go. This selection happens via mechanisms still being understood which include selecting for information gain, amplifying coincidence, suppressing predictability, and selection mechanisms trained from past outcomes via reinforcement learning. ",
            "date": "Answered May 23, 2017",
            "views": "881",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ada Dogrucu",
                    "user_href": "/profile/Ada-Dogrucu"
                },
                {
                    "user_id": "Roman Trusov",
                    "user_href": "/profile/Roman-Trusov"
                },
                {
                    "user_id": "Phuong-Linh Dinh (丁芳灵)",
                    "user_href": "/profile/Phuong-Linh-Dinh-丁芳灵"
                },
                {
                    "user_id": "Marc Bodnick",
                    "user_href": "/profile/Marc-Bodnick"
                },
                {
                    "user_id": "Joel Lewenstein",
                    "user_href": "/profile/Joel-Lewenstein"
                },
                {
                    "user_id": "Charles Faraone",
                    "user_href": "/profile/Charles-Faraone"
                },
                {
                    "user_id": "Edwin Goei",
                    "user_href": "/profile/Edwin-Goei"
                },
                {
                    "user_id": "Shriya Agrawal",
                    "user_href": "/profile/Shriya-Agrawal-2"
                },
                {
                    "user_id": "Naela Blosh",
                    "user_href": "/profile/Naela-Blosh"
                },
                {
                    "user_id": "Godfrey McDonnell",
                    "user_href": "/profile/Godfrey-McDonnell"
                },
                {
                    "user_id": "Thom Lu",
                    "user_href": "/profile/Thom-Lu"
                },
                {
                    "user_id": "S Pradeep",
                    "user_href": "/profile/S-Pradeep-9"
                },
                {
                    "user_id": "Ankur Sah",
                    "user_href": "/profile/Ankur-Sah-2"
                },
                {
                    "user_id": "Keerthi Ganessamourty",
                    "user_href": "/profile/Keerthi-Ganessamourty"
                },
                {
                    "user_id": "Anmol Patel",
                    "user_href": "/profile/Anmol-Patel-6"
                },
                {
                    "user_id": "Yates Buckley",
                    "user_href": "/profile/Yates-Buckley"
                },
                {
                    "user_id": "Aykut Duru",
                    "user_href": "/profile/Aykut-Duru"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Werner",
                "href": "/profile/Mark-Werner-4"
            },
            "answer_text": "Because the sensory inputs we refer to as the “senses” are “wired” to connect directly to the appropriate areas of the brain for processing. The optic nerves feed the visual cortex, for instance. The brain is marvelously interconnected and cross-wired, but there are discrete areas that handle specific tasks. ",
            "date": "Answered May 22, 2017",
            "views": "79",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gintaras Grėbliūnas",
                    "user_href": "/profile/Gintaras-Grėbliūnas"
                }
            ]
        }
    ]
}