{
    "title": "How can a researcher be a scientist? - Quora",
    "tags": [
        "Researchers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Adam Ellison",
                "href": "/profile/Adam-Ellison-9"
            },
            "answer_text": "A really basic idea is that the best, most excruciating scientists try to falsify notions, whether the notion originates from them or from someone else. Scientists are thus a subset of all the people who call themselves researchers. This idea is tossed on the sidewalk and danced upon in practice. People with what appear to be serious credentials try to use these to push nonsense ideas. People with apparently serious credentials cherry-pick data or theories when it suits their belief systems, and likewise cherry-pick evidence that seems to oppose scientific theories they don’t like. Fortunately, you don’t need credentials to be a scientist. Look at Michael Faraday: he had very little formal education, but is regarded today as one of the founders of the sciences of electrochemistry and electromagnetism. What you need is Faraday’s wisdom, which is to set aside received knowledge, and set about proving ideas for one’s self. If you do this, you will be both a researcher and a scientist. ",
            "date": "Answered September 6, 2019",
            "views": "86",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daniella Mae Sampaga",
                    "user_href": "/profile/Daniella-Mae-Sampaga"
                },
                {
                    "user_id": "Moti Navik",
                    "user_href": "/profile/Moti-Navik"
                },
                {
                    "user_id": "Gareth Morgan",
                    "user_href": "/profile/Gareth-Morgan-38"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prof. Dr. Abdul Rob",
                "href": "/profile/Prof-Dr-Abdul-Rob"
            },
            "answer_text": "How can a researcher become a scientist? This is an excellent question. Please note both terminology is interchangeable. A researcher can become a scientist and a scientist can become a researcher. How is this possible? Well, one need basic education and clear planning and to secure a position in an academic or research or NHS establishment. Typically, having a bachelor or master degree will help. Those with PhD degree can become team leader etc. Also, ability to conduct investigation is essential. Both positions are very rewarding and lead to discovery of things that community need to empower and upgrade. ",
            "date": "Answered October 7, 2020",
            "views": "25",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joebie Destajo",
                    "user_href": "/profile/Joebie-Destajo-1"
                },
                {
                    "user_id": "Pratyush",
                    "user_href": "/profile/Pratyush-19"
                }
            ]
        },
        {
            "author_info": {
                "name": "Scholarate",
                "href": "/profile/Scholarate-1"
            },
            "answer_text": "A researcher is the person who does research in a specific discipline under a project that is being conducted by a scientist or a Professor. On the other hand scientist is some one who initiates research project at an organization that may Public or Privately funded. Under whom researchers like “research assistants”,”PhD scholars” and “Research fellows” used to work for getting a degree and research experience. Here if you want to be a scientist you need apply for a position or project in an organisation. The selection will be made based on your research experience, scientific articles published and other academic qualifications. Thank you Scholarate ",
            "date": "Answered October 7, 2020",
            "views": "655",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Pratyush",
                    "user_href": "/profile/Pratyush-19"
                }
            ]
        },
        {
            "author_info": {
                "name": "Moti Navik",
                "href": "/profile/Moti-Navik"
            },
            "answer_text": "Well If you want to be a scientist , and you are already a researcher, you can utilize your research knowledge that you have already gained rather than starting from zero. In that case you have a really good carer scope of becoming a research scientist. Well it's not compulsory that you should go go research scientist only , I may also deepen on the field or the area you are interested into. that is, choosing a particular stream and doing complete research on the topic, as research is a part of scientific discovery. Talking about research scientist , what they do : Research scientist work in almost every area of science imaginable. They plan and carry out experiments and investigation in a range of areas which includes geoscience , medical research, meteorology and pharmacology. There are a lot of job opportunities available at government as well as private sectors as a research scientist. But all that it requires is your interest and your passion. ",
            "date": "Answered December 9, 2019",
            "views": "51",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ella Gross",
                    "user_href": "/profile/Ella-Gross-14"
                },
                {
                    "user_id": "Siddhant Lokhande",
                    "user_href": "/profile/Siddhant-Lokhande-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cheenepalli Ravi Shankara",
                "href": "/profile/Cheenepalli-Ravi-Shankara"
            },
            "answer_text": "How do I become a scientist when I am a researcher? These two words are like synonyms with slight difference. But for practical purposes, there is no big difference, mainly it is a matter of convention. Usually a researcher is one who does any kind of research ( even in literature, or sociology or non-science topics), while a scientist is the one who do research in science, and is affiliated with certain organizations. So, work in any scientific organization, you will be called a scientist. If start working on any topic with research bent of mind, you can claim as a researcher. ",
            "date": "Answered July 30, 2020",
            "views": "27",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shany Rose D'Alibong",
                    "user_href": "/profile/Shany-Rose-DAlibong"
                },
                {
                    "user_id": "Krish Bilgera",
                    "user_href": "/profile/Krish-Bilgera"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ed Caruthers",
                "href": "/profile/Ed-Caruthers"
            },
            "answer_text": "“How can a researcher be a scientist?” “Research” is the broader concept. “Scientific research” is the narrower concept. Scientists do scientific research. All scientists are researchers. Scientists do research in a field or fields of science. Not all researchers are scientists. Historians, for instance, may do research by finding, studying, and drawing conclusions from primary sources like letters and diaries. There are also “fans of science” who are not scientists or researchers, “fans of history” who are not historians or researchers, … ",
            "date": "Answered August 27, 2019",
            "views": "46",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Carl Velasquez",
                    "user_href": "/profile/Carl-Velasquez-1"
                },
                {
                    "user_id": "Myra Mae Leciones",
                    "user_href": "/profile/Myra-Mae-Leciones-1"
                },
                {
                    "user_id": "Jarvin Carumba",
                    "user_href": "/profile/Jarvin-Carumba"
                },
                {
                    "user_id": "Danmar Bermejo",
                    "user_href": "/profile/Danmar-Bermejo"
                },
                {
                    "user_id": "Jonly Responde",
                    "user_href": "/profile/Jonly-Responde-1"
                },
                {
                    "user_id": "Timothy Yawa",
                    "user_href": "/profile/Timothy-Yawa"
                },
                {
                    "user_id": "Moti Navik",
                    "user_href": "/profile/Moti-Navik"
                },
                {
                    "user_id": "Aayush Karn",
                    "user_href": "/profile/Aayush-Karn-1"
                },
                {
                    "user_id": "Jake Sagun",
                    "user_href": "/profile/Jake-Sagun-2"
                },
                {
                    "user_id": "Adam Ellison",
                    "user_href": "/profile/Adam-Ellison-9"
                },
                {
                    "user_id": "Erik Anson",
                    "user_href": "/profile/Erik-Anson"
                },
                {
                    "user_id": "Sohail Ahmed",
                    "user_href": "/profile/Sohail-Ahmed-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ted Acott",
                "href": "/profile/Ted-Acott"
            },
            "answer_text": "Study, read work by real scientists, remember the principles of scientific research, dig deeply into your narrow field and know what has been done, figure out what the real central question is (I never waste time on interesting side questions, I always figure out “the” central big question and go after answering it! You can waste time on peripheral interesting questions, but every field or area has big central questions - 1 or 2 or maybe 3, but no more). You want to be funded and successful - go after the big question. It has worked well for me for many years. Be creative, but follow the data. ",
            "date": "Answered October 7, 2020",
            "views": "428",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Faruque Hossain Piyada",
                    "user_href": "/profile/Faruque-Hossain-Piyada"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Jackson",
                "href": "/profile/Peter-Jackson-545"
            },
            "answer_text": "Most all scientists have to do research on other findings, to try to resolve the vast amount of unexplained data, or even if just to to confirm or position their own. If researchers deal with scientific subjects they’re ‘scientists’. ",
            "date": "Answered August 5, 2020",
            "views": "17",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Cha Nicolas",
                    "user_href": "/profile/Cha-Nicolas-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ankush Kumar",
                "href": "/profile/Ankush-Kumar-1814"
            },
            "answer_text": "Research scientists are responsible for designing, undertaking and analysing information from controlled laboratory-based investigations, experiments and trials. You could work for government laboratories, environmental organisations, specialist research organisations or universities. ",
            "date": "Answered August 12, 2019",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ali Abdulla",
                "href": "/profile/Ali-Abdulla-15"
            },
            "answer_text": "The scientific research uses scientific methods in his research toward understanding a natural phenomeno or discover new natural http://facts.So such a researcher is a scients. ",
            "date": "Answered June 25, 2019",
            "views": "15",
            "upvotes": "0"
        }
    ]
}