{
    "title": "How do we measure the actual speed of light? - Quora",
    "tags": [
        "Physics Measurements",
        "Special Relativity",
        "Speed of Light",
        "Speed",
        "Relativity (physics)",
        "Measurements"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tony Goldsmith",
                "href": "/profile/Tony-Goldsmith-6"
            },
            "answer_text": "Cheese on toast. Put it into your microwave (without the revolving bit) and leave it to cook. Now measure the distance between the peaks of cheese on the toast. Have a look at the microwave particulars on the back. This will tell you the microwave frequency. Multiply that by the distance between peaks (aka the wavelengths) and you will get the speed of the microwaves in the oven. Now, because all electromagnetic radiation travels at the same speed, this is ALSO the speed of light. Of course in 1676 they didn't have microwave ovens. Instead Ole Roemer had to work it out by measuring how long celestial light took to get to us. He noticed that, depending on the Earth–Sun–Jupiter geometry, there could be a difference of up to 1000 seconds between the predicted times of the eclipses of Jupiter's moons, and the actual times that these eclipses were observed. He correctly surmised that this is due to the varying length of time it takes for light to travel from Jupiter to Earth as the distance between these two planets varies. He obtained a value of c equivalent to 214,000 km/s, which was very approximate because planetary distances were not accurately known at that time. In 1728 James Bradley made another estimate by observing celestial events. Bradley measured angles for starlight, and knowing the speed of the Earth around the Sun, he found a value for the speed of light of 301,000 km/s. The first measurement of c that didn't make use of celestial bodies was by Armand Fizeau in 1849. He used a beam of light reflected from a mirror 8 km away. The beam was aimed at the teeth of a rapidly spinning wheel. The speed of the wheel was increased until its motion was such that the light's two-way passage coincided with a movement of the wheel's circumference by one tooth. This gave a value for c of 315,000 km/s. Leon Foucault improved on this result a year later using rotating mirrors, which gave the much more accurate value of 298,000 km/s. His technique was also good enough to confirm that light travels more slowly in water than in air. Nowadays we link c and distance together. Since 1983 the metre has been defined by international agreement as the distance travelled by light in vacuum during a time interval of 1/299,792,458 of a second. This makes the speed of light exactly 299,792,458 m/s and it can no longer change! ",
            "date": "Updated May 26, 2019",
            "views": "2126",
            "upvotes": " View 1.1K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ron Davis",
                    "user_href": "/profile/Ron-Davis-43"
                },
                {
                    "user_id": "Eric Bittner",
                    "user_href": "/profile/Eric-Bittner"
                },
                {
                    "user_id": "Eial Teomy",
                    "user_href": "/profile/Eial-Teomy"
                },
                {
                    "user_id": "Dan Blanks",
                    "user_href": "/profile/Dan-Blanks"
                },
                {
                    "user_id": "Nikolas Scholz",
                    "user_href": "/profile/Nikolas-Scholz"
                },
                {
                    "user_id": "Guy Geens",
                    "user_href": "/profile/Guy-Geens"
                },
                {
                    "user_id": "Bosley Plourde",
                    "user_href": "/profile/D-B-Oswald"
                },
                {
                    "user_id": "Ahmed Shaikh",
                    "user_href": "/profile/Ahmed-Shaikh-222"
                },
                {
                    "user_id": "Andrew Kuprat",
                    "user_href": "/profile/Andrew-Kuprat-1"
                },
                {
                    "user_id": "Dingus Munchauser",
                    "user_href": "/profile/Dingus-Munchauser"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neal Syrette",
                "href": "/profile/Neal-Syrette"
            },
            "answer_text": "Build a device that creates a magnetized photon, then measure the “river of light” (the wave) it generates; this will give you the universal constant of ‘c’ unhindered by the Sun’s inertia upon it. (a rapidly fluctuating magnetic polarity acting upon the wave insulates it from gravity’s effect) π10³ m/s/s (This same device Q.R.M.H.D. module can also be used to determine that gravity has mass and for producing near infinite electricity for little to no cost) Quantum Resonate Magneto Hydro Dynamic Module. It uses a water molecule as a perpetual motion machine within a static magnetic field with the harmonic of πε0 (pi epsilon naught is the key for creating a single shared orbit for the two hydrogen nuclei around the nucleus of the Oxygen atom bisected by the magnetic line of force; hydrogen become two point charges); sound is then used to oscillate the hydrogen in this orbit until they connect, remove sound and allow the magnetic repulsion of similar charges to maintain the perpetual motion of the dynamic. Maintain static magnetic field on the lowest possible setting. Creates photons that are also magnetized. I shared this device I conceived with the greater world on August 1, 2003. It was proven (proof of concept) two weeks later on Aug. 14, 2003 at 4:30 pm EST. (it being a Friday and a day after my birthday) It create a blackout throughout Ontario and Northern Michigan. Neal W. Syrette Sovereign in the Right of Canada, Prince of all princes. ",
            "date": "Answered May 14, 2019",
            "views": "543",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Maryjane Verbit",
                    "user_href": "/profile/Maryjane-Verbit"
                }
            ]
        }
    ]
}