{
    "title": "How does the ozone layer “stay in place”? - Quora",
    "tags": [
        "Ozone & Ozone Layer",
        "Earth Science",
        "Environmental Science",
        "Atmospheric Sciences",
        "The Environment",
        "Science of Everyday Life",
        "Planetary Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gary Ahlers",
                "href": "/profile/Gary-Ahlers"
            },
            "answer_text": "Stratospheric ozone is formed by naturally by chemical reactions involving solar ultraviolet radiation (sunlight) and oxygen molecules, which make up 21% of the atmosphere. In the first step, solar ultraviolet radiation breaks apart one oxygen molecule (O2) to produce two oxygen atoms (2 O) (see Figure Q2-1). In the second step, each of these highly reactive atoms combines with an oxygen molecule to produce an ozone molecule (O3). These reactions occur continually whenever solar ultraviolet radiation (mostly high energy UV-C) is present in the stratosphere. As a result, the largest ozone production occurs in the tropical stratosphere. The Tropical zone is close to perpendicular to the sun and therefore receives the most concentrated dose of UV radiation for the most hours/day.The production of stratospheric ozone is balanced by its destruction in chemical reactions. Ozone reacts continually with sunlight and a wide variety of natural and human produced chemicals in the stratosphere. In each reaction, an ozone molecule is lost and other chemical compounds are produced. Ozone production also changes as the Earth moves in an elliptical orbit around the sun causing thickness changes in the layer. There are large scale weather patterns in the stratosphere (jet streams etc) which move ozone toward the poles, where its concentration builds up. In addition to this global motion, strong winter polar vortices are also important to concentrating ozone at the poles. This movement toward the poles by the ozone layer - in fact all layers. Air currents, along with water currents, are the reason the Earth has a fairly temperate climate over much of its surface. The ozone layer stays at an approximate height because of air stratification and gravity and layer density but it is constantly moving and changing with min. and max concentration of ozone, thickening and thinning of the layer and constant flow towards the poles. ",
            "date": "Answered September 3, 2020",
            "views": "29",
            "upvotes": " Answer requested by Riley Norris",
            "upvoters": [
                {
                    "user_id": "Richard Rothwell",
                    "user_href": "/profile/Richard-Rothwell-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Patrick Espy",
                "href": "/profile/Patrick-Espy"
            },
            "answer_text": "Ozone is a strong oxidizer, and therefore reacts chemically with other species present in the atmosphere. However, it tends to be produced in a very narrow layer where there is enough UV dissociation of oxygen molecules that help form ozone, but not enough dissociation to destroy all the created ozone molecules themselves. Thus, it is in a layer because it is a balance between creation and destruction. As to why ozone, at mass 48, does not sink in the bulk atmosphere that has mass 29, it is because the atmosphere is well mixed. Mix the ozone to higher altitudes and the extra UV light there reduces the amount of ozone in the balance. Mix it to lower altitudes and the lack of UV to create ozone, as well as the presence of nitrogen compounds that react with ozone, again shift the balance and create a sharp drop off in ozone. This gives the ozone profile its characteristic “nose-like” shape: an exponential fall off towards higher altitudes and a sharp drop to lower. A result of having a well mixed atmosphere up to about 10–105 km is that the composition ratio of air throughout this region is essentially the same as it is on the ground: about 80% nitrogen molecules and 20% oxygen molecules. There are only about 5–10 molecules of ozone per million particles of air at the peak of the layer. That is why we call it a minor species. ",
            "date": "Answered September 3, 2020",
            "views": "38",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Charles Tips",
                    "user_href": "/profile/Charles-Tips"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jedidiah Bell",
                "href": "/profile/Jedidiah-Bell-2"
            },
            "answer_text": "Hi. Good question. The ozone layer like the entirety of the atmosphere is held “in place” by the gravity of Earth, the atmospheric pressure of Earth, and by electromagnetic field of the planet. This alone solves many of the climate change and global warming debates happening around the world today. A good example of this would be the Big Bend area of Texas. The temperature at the upper edge of the canyon and the lower “bottom” of the canyon are very different temperatures and climates no matter the season of weather. This is due to the gravity and atmospheric pressure of the planet. I'll let you figure out which level of the canyon is the warmest. ",
            "date": "Answered September 3, 2020",
            "views": "19",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Patrick Espy",
                    "user_href": "/profile/Patrick-Espy"
                },
                {
                    "user_id": "Richard Rothwell",
                    "user_href": "/profile/Richard-Rothwell-1"
                },
                {
                    "user_id": "Chris Brown",
                    "user_href": "/profile/Chris-Brown-868"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Bruyn",
                "href": "/profile/John-Bruyn"
            },
            "answer_text": "The ozone layer is not fixed like a blanket or doona. The O2 released by photosynthesis gets spun out to the stratosphere by the centrifugal force of Earth’s roughly 1,677 km/h equatorial speed of rotation. UV radiation from the sun causes the CO2 molecules to break up and reform as ozone (O3). Not a lot of UV gets to the highest latitudes in winter, causing a hole in the ozone layer that contracts in summer. This happens seasonally at both poles but lower sunspot numbers like now causes their UV output to decline, for the ozone production to reduce accordingly, and for the stratosphere to cool. ",
            "date": "Answered September 21, 2020",
            "views": "14",
            "upvotes": " Answer requested by Riley Norris"
        },
        {
            "author_info": {
                "name": "William Hoffman",
                "href": "/profile/William-Hoffman-60"
            },
            "answer_text": "It does not “stay in place” as if it were a static aegis or shield. It is a dynamic portion of upper atmosphere and is replenished by the Sun moment to moment. We can’t see it from ground or space, like we can the swirling gyres on Jupiter, Saturn, Neptune or some other planets because it does reflect visible light with a distinct color, but I think the dynamics are related. ",
            "date": "Answered September 3, 2020",
            "views": "19",
            "upvotes": " Answer requested by Riley Norris"
        },
        {
            "author_info": {
                "name": "Morgan Chandler",
                "href": "/profile/Morgan-Chandler-29"
            },
            "answer_text": "Ozone is created where it “lives”, the stratosphere. And is basically not different in density from the non-ozone nearby so it has no bias to move it anywhere that the prevailing breeze isn’t pushing it. As long as we don't kill more of it than is produced using our nasty flourine compiunds. It will continue to be produced in the stratosphere and accumulated at the poles ",
            "date": "Answered September 3, 2020",
            "views": "13",
            "upvotes": " Answer requested by Riley Norris"
        },
        {
            "author_info": {
                "name": "Terigi Ciccone",
                "href": "/profile/Terigi-Ciccone"
            },
            "answer_text": "Ozone 03 doesn’t stay out, It’s generally spread throughout the earth’s atmosphere and over a range of about 9 to 30 miles high. However there are certain vortices that trap air in whirling circles around the poles, and when they break up sucks in air from the temperate zones. ",
            "date": "Answered September 3, 2020",
            "views": "9",
            "upvotes": " Answer requested by Riley Norris"
        },
        {
            "author_info": {
                "name": "Frank Hollis",
                "href": "/profile/Frank-Hollis"
            },
            "answer_text": "It doesn’t move about because ozone is continuously produced in one particular height of the atmosphere. Ozone may move out of this layer, but it is replaced by the formation of more ozone. ",
            "date": "Answered September 3, 2020",
            "views": "54",
            "upvotes": " View 3 Upvoters"
        }
    ]
}