{
    "title": "How does melting ice affect water levels? - Quora",
    "tags": [
        "Melting",
        "Ice",
        "Climate Change"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Mombourquette",
                "href": "/profile/Michael-Mombourquette"
            },
            "answer_text": "When ice that is on land melts and the melt water runs into the oceans, the water levels rise. You need to be more specific on how you phrase your question. Ice that is floating displaces it’s own weight in water but it has a slightly higher volume than that equal weight in liquid water so it sticks up out of the sea a bit (~10%). Once that ice melts, the exact same amount of water will be displaced but there will be nothing sticking up because now, the water from the ice will be exactly density as the water from the sea (notwithstanding differences in salinity). Ice that is on Land accounts for the vast majority of the ice both in the arctic and in the Antarctic. It’s the melting of this ice that scientists are worried about. On a secondary note, if the sea ice melts, it may not cause the seas to rise directly but it will allow sunlight to be absorbed into the dark ocean waters where it used to be reflected by the white ice. This means the ocean will be warmed up, contributing to a warmer environment, which will melt the land-based glaciers faster. ",
            "date": "Answered August 14, 2019",
            "views": "998",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tiên Hồ",
                    "user_href": "/profile/Tiên-Hồ-3"
                },
                {
                    "user_id": "Vikas Mehra",
                    "user_href": "/profile/Vikas-Mehra-72"
                }
            ]
        },
        {
            "author_info": {
                "name": "TJ Berens",
                "href": "/profile/TJ-Berens"
            },
            "answer_text": "Does melting ice cause water levels to rise? As far as a simple volume change: Ice that was on the land, such as glaciers, when it melts, adds water, causing water levels to rise. Ice that was on water, such as an ice floe or iceberg, etc, when it melts, was already displacing it’s weight, so, when it melts, it does not raise the water levels. If the ice was fresh water, when it melts, it makes the salt water it melts into, less dense (Saltier water is denser). So, frozen salt water doesn’t change the density the way frozen fresh water does when they melt. The denser the water, the less volume it occupies for the same mass. So, reducing density, raises the water levels. If the ice is melting because it is warmer, then, one also considers the thermal expansion, as, warmer water is less dense, and, therefore, the same mass also requires more volume, so, the warmer the water, the more the water levels rise. And so on and so forth. :D ",
            "date": "Answered September 25, 2020",
            "views": "68",
            "upvotes": "0"
        }
    ]
}