{
    "title": "How to produce pure water - Quora",
    "tags": [
        "Pure Water",
        "Properties of Water",
        "Drinking Water",
        "Water"
    ],
    "response": [
        {
            "author_info": {
                "name": "Edward Willhoft",
                "href": "/profile/Edward-Willhoft"
            },
            "answer_text": "You are spoiled for choice: Controlled burning of pure hydrogen in pure oxygen followed by condensation of the water vapour produced.Passage of virtually any water source through activated carbon (to remove organic and other non-ionic chemicals from solution), followed by ion-exchange resins to remove ions.Treating the water to reverse osmosis as done in the Middle East where fresh water is scarce.Distillation.Rainfall collection in a non-polluted region (not, for example, in many industrialised parts of China!).Obviously, the purer the starting condition of the water or its gaseous components, the less work will be required to purify it further. You do not specify its end use and, therefore, it is pointless advising on which is the most appropriate option. For example, it would be unwise to rely on your total bodily water intake in its pure form. The natural electrolytes in water are generally beneficial to maintaing health, excluding obvious toxic ions and compounds generally a product of pollution by man. And finally, if the water hasn’t been heat-treated it’s always advisable to heat the water to bp in order to kill off all microorganisms. Prions would require higher temperatures to inactivate them. ",
            "date": "Answered September 3, 2018",
            "views": "191",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Arturo Nava",
                    "user_href": "/profile/Arturo-Nava-7"
                },
                {
                    "user_id": "Richard Lippman",
                    "user_href": "/profile/Richard-Lippman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Colin John Cook",
                "href": "/profile/Colin-John-Cook"
            },
            "answer_text": "Deionise tap water. Distill it under vacuum with a “cold trap”, which is a condenser that can freeze out the water vapour by being at a very low temperature. Contaminants such as carbon dioxide and residual oxygen, nitrogen and argon from air will be drawn off by the vacuum and will not condense in the trap. If you can heat this cold trap, and have a second stage cold trap, you can repeat the operation to pull away a few more residual atoms of contaminants. Maybe a third stage if you are really fussy. Don't forget that you do not have protium oxide only: there will be some deuterium oxide (heavy water) and (I think) some tritium oxide. Also, to prevent contamination of your reasonably pure water, you should shield your equipment with lead shielding, to protect against radioactive decay products entering your product through the glass. Of course, as soon as you open your trap to the atmosphere, your pure water is ‘toast’. ",
            "date": "Answered November 5, 2017",
            "views": "238",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dan Calvano",
                    "user_href": "/profile/Dan-Calvano"
                },
                {
                    "user_id": "Michael Woodhams",
                    "user_href": "/profile/Michael-Woodhams-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Raczkowski",
                "href": "/profile/Paul-Raczkowski-1"
            },
            "answer_text": "in a climate where there is a significant difference between day & night temperatures, dig a hole, put a container in the middle of the hole. cover the hole with black plastic film and make the film somewhat tight but with some flexibility. put a rock on the top of the plastic in the middle, right over where the container is inside. in the morning you should have varying amounts of water in the container. Courtesy of the laws of physics. ",
            "date": "Answered September 3, 2018",
            "views": "31",
            "upvotes": " Answer requested by Arturo Nava"
        },
        {
            "author_info": {
                "name": "Craig Cornelius",
                "href": "/profile/Craig-Cornelius"
            },
            "answer_text": "What are your starting materials? Water can be produced by burning almost anything that contains hydrogen such as hydrocarbons. Capturing it, however, requires some effort, of course, since the combustion produces water vapor. ",
            "date": "Answered September 3, 2018",
            "views": "42",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Cheryl Johnson",
                "href": "/profile/Cheryl-Johnson-103"
            },
            "answer_text": "Hydrogen and oxygen. Just be careful. Mixing them is likely to produce water explosively. ",
            "date": "Answered September 2, 2018",
            "views": "4",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Loring Chien",
                "href": "/profile/Loring-Chien"
            },
            "answer_text": "React pure hydrogen with pure oxygen, is one way, ",
            "date": "Answered November 5, 2017",
            "views": "90",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mason Kelsey",
                "href": "/profile/Mason-Kelsey-4"
            },
            "answer_text": "Burn hydrogen gas in air. ",
            "date": "Answered September 16, 2018",
            "views": "3",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bob Smurdly",
                "href": "/profile/Bob-Smurdly"
            },
            "answer_text": "I just turn on the tap. ",
            "date": "Answered September 3, 2018",
            "views": "8",
            "upvotes": " Answer requested by Arturo Nava"
        },
        {
            "author_info": {
                "name": "Ameya Kamath",
                "href": "/profile/Ameya-Kamath-5"
            },
            "answer_text": "Yes. Refer the movie-making The Martian © ",
            "date": "Answered September 16, 2018",
            "views": "17",
            "upvotes": "0"
        }
    ]
}