{
    "title": "How to top 11th class science and maths - Quora",
    "tags": [
        "Science Education",
        "Class 11th in India",
        "Mathematics Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shilpashree V",
                "href": "/profile/Shilpashree-V-3"
            },
            "answer_text": "Its quite easy to score well in science and maths in class 11. You only need to be focused and practice well. Firstly you have to pay attention in class and grasp as much as possible there so you could save on time. For maths you need to solve a lot of problems. Try solving all the exercise problems first. Then also solve the solved examples. It will be helpful. In science for physics you need to be good at your concepts and solve a lot of problems like math. Here you should keep one thing in mind however difficult the problem may look it ends up in a concept. So you should be good at your concepts. In chemistry you need to concentrate more on concepts. The problems here will be relatively easy but organic part could be a little tricky, so concentrate a bit more on that part. I would suggest you to write and practice the reactions. Inorganic goes mainly on memory. And Physical is the easiest. Biology, you just need to read the lessons and keep in mind all the key words. Diagrams are very important and labelling of the diagram too. Here you should pay attention towards the key words.(I assumed you are a PCMB student) For all the subjects I would suggest you to make summary sheets which contains all the formula, major reactions and important concepts. It will prove to be very useful. Thank you!! Sorry for any grammatical mistakes. ",
            "date": "Answered April 18, 2019",
            "views": "114",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Srinivas Adireddi",
                    "user_href": "/profile/Srinivas-Adireddi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ankit Gupta",
                "href": "/profile/Ankit-Gupta-1781"
            },
            "answer_text": "Practice, Discipline, Activities, Self-Determination , Hard work , Smart work , make you top in every class , in specific math and science,in math you should do lot of practice (N.c.e.r.t and R.D.sharma or R.s.aggarwal) ,Science (pc) is very long and heavy subject so you need to understand learn and practice on maxm topic as your syllabus ,in chem. some concept are interconnected and use in both 11 and as well as 12 th , physics are conceptual so you need clear your topic and go or practice with different numericals . N.c.e.r.t must read and solve because most questions are match through N.c.e.r.t and after than R.d.sharma(math) . you can do it if neither think of any excuses , this is most problem in this stage because students are maxm. only study as a formality . so you think positive, and go deep in. MATH IS VERY LOVELY AND BEST SUBJECT . ",
            "date": "Answered July 25, 2017",
            "views": "142",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abhay Pratap Singh",
                    "user_href": "/profile/Abhay-Pratap-Singh-127"
                },
                {
                    "user_id": "Hankit Gupta",
                    "user_href": "/profile/Hankit-Gupta"
                }
            ]
        },
        {
            "author_info": {
                "name": "Garvitraj Pandey",
                "href": "/profile/Garvitraj-Pandey"
            },
            "answer_text": "I would say by having a smart hard work. U must practice the paper, different concept, quality based questions that all will accelerate ur growth towards ur way of success. So for being topper try to be brilliant hard worker and sincere. Brilliancy means completing the work on time, being attentive , punctual, sincere, giving regular test etc. So follow these u will surely be pleased with ur self.. Have faith and be motivated. Thanks!!!! Good luck ",
            "date": "Answered October 25, 2017",
            "views": "72",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "AUDHESH HARIJAN",
                    "user_href": "/profile/AUDHESH-HARIJAN-1"
                },
                {
                    "user_id": "Ravi Singh",
                    "user_href": "/profile/Ravi-Singh-1802"
                }
            ]
        }
    ]
}