{
    "title": "How can we use data science in scientific research? - Quora",
    "tags": [
        "Scientific Research",
        "Big Data",
        "Research",
        "Data Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard Johnson",
                "href": "/profile/Richard-Johnson-48"
            },
            "answer_text": "For a few years I was combing NASA data on the position, speed, and wobbles of all kinds of orbital bodies, synchronizing them with coronal mass ejections and looking for tell-tale signals that might indicate the speed of gravity. I used calculus and statistics. Over and over. It was painful, tedious, and eventually boring. I never found a signal bigger than the noise. Using data science and a learning algorithm, I could merely plop the data sets into my trusty compute engine and let it figure out if any signals exist. Instead of years, we could find out within hours if I just messed up my math. (Highly likely.) In fact, I might do that unless you beat me to it. It could be good to know even though we have now actually detected gravity waves. :-) ",
            "date": "Answered June 27, 2018",
            "views": "480",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Carvalho",
                    "user_href": "/profile/David-Carvalho-10"
                },
                {
                    "user_id": "Damien Trolet",
                    "user_href": "/profile/Damien-Trolet"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Knudsen",
                "href": "/profile/Steve-Knudsen"
            },
            "answer_text": "Data science refers to the science of data, whereas scientific research refers to the study of physical reality or some other phenomena (such as states of mind). So data scientists mine data sets for new insights, and this is especially helpful in psychology and biology (or for drug design, which is biochemistry). So, scientific research is an endeavor, whereas data science is a methodology to do that endeavor. Sometimes data science is relevant to scientific research, sometimes it’s not. To understand why, consider the distinction between big data and ordinary data. Big data requires more than one computer/server for storage and processing. Below this threshold, data science technically does not exist, and is replaced by traditional statistics and the ordinary scientific method. So, when you see a job advertisement for a data scientists, see if you can replace the phrase “data scientist” by “statistician”. If you can, the job isn’t really about data science. ",
            "date": "Answered June 25, 2018",
            "views": "700",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Carvalho",
                    "user_href": "/profile/David-Carvalho-10"
                }
            ]
        }
    ]
}