{
    "title": "How many dinosaurs lived on Earth? - Quora",
    "tags": [
        "Dinosaurs"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Bøgelund Unger",
                "href": "/profile/John-Bøgelund-Unger"
            },
            "answer_text": "How many dinosaurs lived on Earth? We can divide this into two different answers, how many different species and total dino population. We have discovered over 700 different dinosaur species. But we have only been looking for fossils for about 200 years the first 100 years being riddled with gross errors in identification i.e. juveniles of one species mistaken for another species. For an animal group (Clad) that dominated the earth for 150–200 million years we most likely have only scratched the surface. We now also divide this clad into avian and non-avian. Non-avian Dinosaurs can be divided into bipedal and quadrupedal species further refinements can be made. Diversity increased over time. Existing over three major eras Triassic, Jurassic and Cretaceous. During those eras there were many extinction events and of course the final blow the cretaceous-Paleocene event 65 million years ago. The graph from PLOS shows this diversity  The number of dinosaurs living on earth at any given time would be difficult to estimate. Surely there were many more small dinosaurs than the huge ones. There surely more herbivorous dinosaurs than carnivorous, following normal food chain models. But with out a doubt that prior to any extinction event there were billions on earth at one time. The fact that we find as many fossils, a most improbable process, as we do would indicate that. ",
            "date": "Updated July 14, 2019",
            "views": "48",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daniel King",
                    "user_href": "/profile/Daniel-King-732"
                },
                {
                    "user_id": "Charlie Wass",
                    "user_href": "/profile/Charlie-Wass-1"
                },
                {
                    "user_id": "Shirley Smith",
                    "user_href": "/profile/Shirley-Smith-31"
                },
                {
                    "user_id": "Sangi Arach",
                    "user_href": "/profile/Sangi-Arach"
                },
                {
                    "user_id": "Brent Phillips",
                    "user_href": "/profile/Brent-Phillips-28"
                },
                {
                    "user_id": "Magnus Hovda",
                    "user_href": "/profile/Magnus-Hovda"
                },
                {
                    "user_id": "William Coke",
                    "user_href": "/profile/William-Coke-2"
                },
                {
                    "user_id": "Dominik Jurinić",
                    "user_href": "/profile/Dominik-Jurinić"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ade Black",
                "href": "/profile/Ade-Black-2"
            },
            "answer_text": "The correct answer here is - We do not know. We will never know - Because fossils only form under specific conditions. If these conditions are not met there is no fossil. So entire species could of lived and died in conditions adverse to fossil formation. Therefore there is no record of them, we will never know of their existence. Because there is nothing there to show they ever existed. So it is impossible to say how many dinosaurs existed on earth at any given time. Because we have not found them all and most likely never will. ",
            "date": "Answered September 15, 2019",
            "views": "662",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ahmed Metwally",
                    "user_href": "/profile/Ahmed-Metwally"
                },
                {
                    "user_id": "Shirley Smith",
                    "user_href": "/profile/Shirley-Smith-31"
                },
                {
                    "user_id": "Steve Leonard",
                    "user_href": "/profile/Steve-Leonard-67"
                }
            ]
        }
    ]
}