{
    "title": "How to tell if a molecule is polar or nonpolar - Quora",
    "tags": [
        "Chemical Polarity",
        "Molecules",
        "Physical Chemistry",
        "Organic Chemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vaishali Elango",
                "href": "/profile/Vaishali-Elango-1"
            },
            "answer_text": "The electronegativity (obtained from periodic table) can be used to determine the polarity.However, the molecular shape is the best, and easiest way to determine whether a molecule is polar or non-polar. Any molecule that contains a lone pair of electrons on the central atom is polar. For example, H2O is polar because the lone pairs on the oxygen atom create a non-symmetrical shape (bent or v-shaped molecular geometry). Which means no lone pairs is non-polar, right? Wrong. Not all molecules with no lone pairs on the central atom are non-polar. Sure, they might have a linear or tetrahedral shape but it depends on what is bonded to the central atom. For example, CH4 is non-polar whereas a chlorofluorocarbon such as CCl2F2 is polar. Both molecules have the same molecular geometry (tetrahedral) but have different atoms bound to the central atom. CH4 consists of 4 hydrogen atoms bound to the carbon, which has the same difference in electronegativity, and will “cancel out” creating an overall non-polar molecule. CCl2F2 consists of 2 chlorine and 2 fluorine atoms bound to the carbon, the difference in electronegativity is different in the C-F bond and the C-Cl bond, and cannot “cancel out” despite the tetrahedral shape. Therefore, CCl2F2 is polar. Hope this helps! :) ",
            "date": "Answered August 28, 2016",
            "views": "206",
            "upvotes": " View 28 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bob Brent",
                    "user_href": "/profile/Bob-Brent-1"
                },
                {
                    "user_id": "Important Information",
                    "user_href": "/profile/Important-Information-11"
                },
                {
                    "user_id": "Seine Yoo",
                    "user_href": "/profile/Seine-Yoo-1"
                },
                {
                    "user_id": "Tywin Thot",
                    "user_href": "/profile/Tywin-Thot"
                },
                {
                    "user_id": "Abu Fahad Ansari",
                    "user_href": "/profile/Abu-Fahad-Ansari-2"
                },
                {
                    "user_id": "Lucas Taiano",
                    "user_href": "/profile/Lucas-Taiano"
                },
                {
                    "user_id": "Payal Chandra",
                    "user_href": "/profile/Payal-Chandra-9"
                },
                {
                    "user_id": "Vignesh Thanigai",
                    "user_href": "/profile/Vignesh-Thanigai"
                },
                {
                    "user_id": "Jake Jupp",
                    "user_href": "/profile/Jake-Jupp"
                },
                {
                    "user_id": "Julia Correale",
                    "user_href": "/profile/Julia-Correale"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pierre Smith",
                "href": "/profile/Pierre-Smith-17"
            },
            "answer_text": "A polar molecule is a particle consisting of two or more covalently bonded atoms with an asymmetric distribution of charges. This occurs in molecules that are asymmetric along at least one axis when one side contains atoms with a greater electronegativity than the other side. This results in shared electrons spending more time on the side with greater electronegativity, causing that side to have a greater negative charge most of the time. A molecule can be determined to be polar or nonpolar in two steps, which means putting the molecule through the Lewis Structure to determine its shape and determine if that shape is symmetrical or nonsymmetrical. The Lewis structure is used to show where and how the various atoms that make up a molecule connect. The Lewis Structure can help give visual clues to the polarity of a molecule because polarity is normally found in atoms with uneven electron distribution Once the molecule being studied has been laid out in the Lewis Structure, it is used to determine the shape of the molecule. A molecule whose shape is not symmetrical is considered polar because it has the associated uneven electron distribution. The second step, determining the symmetry of a molecule, also allows it to be determined if the atoms on the outer edge of the molecule are the same. If the atoms on the outer edge are all the same, then the molecule is nonpolar. If the atoms on the outer edge are different, even if the shape of the molecule is symmetrical it can still be a polar molecule because the differences in the edge atoms cause the charge to be uneven. These outer molecules are why using both steps in the process are important. How Do You Tell If a Molecule Is Polar? ",
            "date": "Answered July 19, 2018",
            "views": "17",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aditya Kumar",
                    "user_href": "/profile/Aditya-Kumar-10652"
                },
                {
                    "user_id": "Nicolás Samanez Cruzate",
                    "user_href": "/profile/Nicolás-Samanez-Cruzate"
                }
            ]
        }
    ]
}