{
    "title": "How did the specific gravity of water get one? - Quora",
    "tags": [
        "Gravity",
        "Water",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jordan Fysh",
                "href": "/profile/Jordan-Fysh"
            },
            "answer_text": "Water is an important part of the metric system. Celcius scale has 0 at the freezing point of water and 100 at the boiling point. A calorie is the amount of energy needed to raise the temperature of one mL of water by one degree. A gram is the mass of one mL of water. Specific gravity is the ratio of the density of a substance to the density of water because water is an important base of the metric system. The ratio the density of a substance to the density of the same substance is therefore 1. ",
            "date": "Answered June 6, 2018",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David A. Smith",
                    "user_href": "/profile/David-A-Smith-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andy Heilveil",
                "href": "/profile/Andy-Heilveil"
            },
            "answer_text": "Because water is available and very useful to chemistry chemists have chosen to make many of their units of measurement be simple numbers when measured on water. That is why they have calories where physicists have Joules. One calorie is the amount of energy to raise 1 cc of water 1′C. The centigrade temperature scale is another ‘hydrocentric’ unit of measure. It is 0 for ice, 100 for steam (over simplifying a bit). ",
            "date": "Answered June 6, 2018",
            "views": "813",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "David A. Smith",
                    "user_href": "/profile/David-A-Smith-13"
                },
                {
                    "user_id": "Marc Freeman-Sheehy",
                    "user_href": "/profile/Marc-Freeman-Sheehy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barry Austern",
                "href": "/profile/Barry-Austern"
            },
            "answer_text": "Get one what? I feel as if English is not your native language, so please rephrase it. Do you mean get to be one? Simply because water is the standard upon which units are based. It is one gram per cubic centimeter as that really is how the weight is defined. ",
            "date": "Answered June 6, 2018",
            "views": "212",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Dolschenko",
                "href": "/profile/John-Dolschenko"
            },
            "answer_text": "It all goes back to the Plato table as far as I know. They used water at 4 C so it's pretty close the maximum density of water. Now I think it is 20 C Calculated as US Customary Units. of 62.42 pounds per cubic foot. ",
            "date": "Answered June 6, 2018",
            "views": "171",
            "upvotes": "0"
        }
    ]
}