{
    "title": "How does hair dye damage hair? - Quora",
    "tags": [
        "Hair Dye",
        "Hair Coloring",
        "Hair Color",
        "Hair Care"
    ],
    "response": [
        {
            "author_info": {
                "name": "Adrian Yin",
                "href": "/profile/Adrian-Yin-4"
            },
            "answer_text": "To begin with, note that the hair is composed of 3 layers (the cuticle, the cortex and the medulla) and has a ph of about 5 (slightly acidic). I’m assuming that you are talking of oxidative hair dye (hair colour that requires hydrogen peroxide to activate: aka permanent hair colour) because direct dye (manic panic, lunar tides, special effects) do not modifies the hair structure hence making it non damaging to the hair. Hair that is mainly composed of dead keratin cells which is filled with a certain amount of melanin (phaeomelanin and eumelanin). In most case of modern permanent hair color, the ammonia present in the hair color first open up the cuticle (scales that protects the cortex and medulla), due to his alkalinity, allows the artificial pigments to enter the cortex and also acts as a catalyst when the artificial pigments react with the hydrogen peroxide. Hydrogen peroxide has two roles in this situation, it oxidize the artificial pigments to give them their true color and “bleaches” the melanin in the hair when it’s concentration is higher that 5 vol or 1.5% (the higher the concentration of peroxide the higher lift you get). In summary, the ammonia open the cuticle due to his high alkalinity, then the peroxide (with the help of the ammonia) deposits the oxidized artificial hair pigments and in most case (peroxide>5vol/1,5%) simultaneously bleaches the melanin in the hair. But why does it damages the hair? Well, first extreme alcaline ammonia dry out the hair (a property of alcaline substance ex:dishwashing soap) and slightly damages the cuticles in a permanent wait by forcing them open. Then allowing the peroxide to penetrate the cortex, the chemical reaction that bleaches the melanin causes damage by burning off your natural pigments that allows a lighter “canvas” for the colour to set. The amount of damage caused by the peroxide is determined by the volume of the peroxide. The more concentrate the peroxide, the faster it burns the melanin, allowing it to burn more pigments before the chemical reaction ends. Visualizing it as a fire, the bigger the “fire” the more damage its going to cause by the time the firefighters come and extinguish it. Hope it answer your question adequately. ",
            "date": "Answered June 23, 2019",
            "views": "117",
            "upvotes": "0"
        }
    ]
}