{
    "title": "How can statistics help by the existence of scientific knowledge? - Quora",
    "tags": [
        "Scientific Knowledge",
        "Scientific Research",
        "Knowledge",
        "Statistics (academic discipline)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Robdine",
                "href": "/profile/Jeff-Robdine"
            },
            "answer_text": "When doing science you measure things, then you make comparisons between the things measured. Statistics helps you deal with the numbers that you get. We mostly use two kinds- descriptive and inferential. Descriptive stats just summarize numbers from the things you’re measuring. They describe things like what the numbers tend to be (e.g., mean, median, mode), and how spread out or variable the numbers are (e.g., variance, standard deviation). Inferential statistics are used to make educated guesses about what the “bigger” picture looks like. You might measure the IQ of a group of 30 kids born from parents who ate a lot of tumeric during conception (I’m just making this up…) and find that that group has a mean IQ of 140. Inferential statistics would be used to ask how well that 140 represents the mean of all the possible kids of all the possible parents who ate a lot of tumeric during conception. Descriptive stats describe the sample of kids you have, inferential stats are to help describe what the population of all possible cases would look like. Statistics, particularly inferential statistics, are also used in calculating probabilities. For example, is the 140 above meaningful, or could it just be a chance result? Maybe you could go grab any 30 kids and get an average IQ of 140. Its too much to describe how, but I know from inferential statistics that if you collect data from groups of 30 kids at a time you’d have to do that 10,370,640 times before you could expect to find even 1 group of 30 with a mean IQ of 140 at random. So, just based on chance alone getting a group with such a high average IQ isn’t going to happen by chance (at least almost never). Does that mean tumeric made a difference in the IQ of offspring? Who knows… statistics can’t answer that question. What you can conclude, beyond this looks like chance or not, is a question of research design and methods. ",
            "date": "Answered October 25, 2018",
            "views": "705",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Christopher Schardl",
                    "user_href": "/profile/Christopher-Schardl"
                },
                {
                    "user_id": "Shaunak Alshi",
                    "user_href": "/profile/Shaunak-Alshi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dorin Stanciu",
                "href": "/profile/Dorin-Stanciu"
            },
            "answer_text": "The other answers that you’ve got (two, until now) are very thorough and well-documented. I’ll give you one that takes a rather different approach… In order to gain knowledge of any kind, not only scientific, you need to explore the world or the phenomena or interest. Sadly, we only have logic (you may call it reasoning for now) on our side, to decide how to think about what’s around us. That leaves us in very precarious spot, because only deductive reasoning can give absolute truths, provided the premises are true and the algorithm is sound. For instance, you may know the famous example of a syllogism: given premises a) (general) All men are mortal, b) (specific) Socrates is a man, then, you can conclude with absolute confidence that c) Socrates is (also) mortal. Alas, there isn’t a book of premises and procedures that fit in the above category, able to provide us with conclusive answers for our problems, so we’re pretty much stuck with the other type of reasoning, namely the inductive reasoning, for most of our daily lives. This one, the inductive reasoning, works by observing things many, many times, and spotting a relatively stable way, a pattern, in which things are/phenomena occur. This patterns, or laws, serve as our premises, which we use to derive our conclusion. But, because no one can ever study a phenomenon or a thing in all its details and occurrences, there’s always a chance that our inductive reasoning is wrong. And here’s where statistics helps science build knowledge, by quantifying the chance that we’re wrong about something. Statistics provides us with the necessary methodology (series of steps and procedures) and the theoretical framework (the assumptions that form our axiomatic system), which quantify the probabilities that something is not the way we inferred it to be, based on our observations and calculations. Now, for the rest of the details, I believe the rest of the answers and a blog on statistics would be of a greater help. Best regards! ",
            "date": "Answered October 26, 2018",
            "views": "596",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Carla Inclan",
                    "user_href": "/profile/Carla-Inclan"
                },
                {
                    "user_id": "Christopher Schardl",
                    "user_href": "/profile/Christopher-Schardl"
                }
            ]
        }
    ]
}