{
    "title": "How do plant cells undergo mitosis without centrosomes? How does the spindle form? - Quora",
    "tags": [
        "Centrioles and Centrosomes",
        "Mitosis",
        "Genomics",
        "Plants"
    ],
    "response": [
        {
            "author_info": {
                "name": "Akshari Gupta",
                "href": "/profile/Akshari-Gupta"
            },
            "answer_text": "Spindle formation in plants is very different from most other eukaryotes owing to the fact that plant cells lack centrosomes or spindle pole bodies, which act as the microtubule organizing centers in animal cells. The evolutionary advantage that animal cells gain due to the presence of centrosomes is the ability to direct drastic changes in their shapes during mitosis. On the other hand, plant cells have a rigid cell wall that does not undergo any major changes in shape during mitosis; and the cell wall itself can organize many of the microtubules that form the spindle during mitosis.   Different stages of mitosis in barley. Microtubules are in red, kinetochores in green, and chromosomes in blue. Image source: Mechanisms of plant spindle formation To get an idea of how the spindle is organized in different kinds of cells, it is important to understand the different mechanisms by which microtubules (MTs) are stabilized and organized into different structures. Microtubule nucleation is facilitated by a protein complex known as the γ-tubulin ring complex (γTuRC, for more details, see Microtubule assemblies I. Nucleation), and this complex can be anchored at various locations within the cell to allow the growth of microtubules in many different directions:   Mechanisms known to contribute to mitotic spindle formation. Image source: 50 ways to build a spindle: the complexity of microtubule generation during mitosis  Centrosome-mediated nucleation: Various centriolar proteins have been shown to associate with the γTuRC and activate it to mediate MT growth. During animal cell mitosis, centrosomes expand and accumulate more of these proteins to increase the number of MTs originating from the spindle poles.Chromatin and kinetochore-driven assembly: Kinetochore-associated motor proteins can bind the plus-ends of microtubules (away from the nucleation sites) and exert pulling/pushing forces to stabilize the chromosomes along the metaphase plate during mitosis.Augmin-mediated nucleation: Augmin is a large complex that can bind to the surface of microtubules, and along with some accessory proteins, also form a complex with the γTuRC. The unique arrangement of the γTuRC in this complex allows the nucleation of new MTs from pre-existing MTs at an angle of ~20°, and facilitates a rapid amplification of the number of MTs emanating from the spindle poles.Other mechanisms: Various cell wall and nuclear membrane components have also been implicated as binding partners for the γTuRC. Additionally, various molecules function in microtubule bundling and cooperate with motor proteins to concentrate and \"slide\" MTs to regulate spindle dynamics. All eukaryotic cells use a combination or all of these mechanisms to coordinate mitotic spindle assembly. Since plant cells lack centrosomes, they rely on the rest of the mechanisms to initiate spindle assembly.     Nucleation and reorganization of MT arrays during early steps of spindle assembly.(a) G2 phase.(b,c) Pre-prophase: MT reorientation into two opposite poles.(d) Late prophase: polar caps.(e) Prometaphase: spindle assembly after NEB.  Spindle assembly in plant cells: MT reorganization itself is very different in plant cells as compared to animal cells. I'll go through the major stages briefly: G2 phase: The formation of MTs in the perinuclear area in G2 is facilitated by two mechanisms. Several protein complexes present on and near the nuclear envelope can associate with augmin complexes and promote MT nucleation, in this case the plus-end of the MTs grows away from the nucleus. An alternate mechanisms involves the binding of histone H1 complexes to the plus-ends of MTs, and these complexes are associated with motor activity, pushing MTs away from the surface and acting independently of γTuRCs.Pre-prophase: The position of development of the future cell plate is determined in pre-prophase by the formation of a narrow transient band of cortical MTs. Further, the MTs radiating towards the cytoplasm redistribute into multiple small asters tangential to the nucleus. They finally converge into two opposite poles encircling the prophase nucleus and forming two polar caps. Note that at this stage, none of the perinuclear nucleated MTs remain.Prophase: During prophase, the free perinuclear MTs are translocated by various MT motors that are involved in focusing them at the poles by the action of various MT bundling proteins. These MTs form the \"pro-spindle\" and are also tangential to the nucleus.Prometaphase: The pro-spindle MTs exert pushing forces on the nuclear envelope, which contribute to nuclear envelope breakdown (NEB) and have a higher likelihood of encountering kinetochores and building a spindle. Following NEB, the spindle poles broaden and fragment. The establishment of a bipolar spindle symmetry requires opposite forces, pushing poles apart as well as focusing the poles by the collective action of different kinds of MT motors.In this manner, microtubules are drastically reorganized in plant cells to facilitate directional mitosis in the absence of centrosomes. Actin filaments also play an important role in the formation of the spindle, and this function is summarized in the diagram below:     Drawings for prophase and interphase cells represent projections of a three-dimensional view showing both the cell surface and internal features. Drawings for cells in mitosis and cytokinesis represent mid-plane, cross-sectional views showing only the outlines of the cell cortex. At all stages of the cell cycle, cytoplasmic strands containing actin filaments span the vacuole, linking the cytoplasm surrounding the nucleus with the cortical cytoplasm. During prophase, a cortical preprophase band (PPB) of microtubules circumscribes the future plane of cell division. Actin filaments are distributed throughout the cell cortex during prophase, but some are clearly aligned together with the microtubules of the PPB. When the microtubule PPB is disassembled on entry into mitosis, the actin component of the PPB also disappears, leaving behind an actin depleted zone in the cell cortex that persists and marks the division site throughout mitosis and cytokinesis. After completion of mitosis, a phragmoplast of microtubules and actin filaments is initiated between daughter nuclei, which guides the movement of Golgi-derived vesicles containing cell wall materials to the cell plate. As cytokinesis proceeds, the phragmoplast expands centrifugally until it fuses with the parental plasma membrane and cell wall at the cortical division site previously occupied by the PPB. From: Plant cell division: building walls in the right places Sources: Mechanisms of plant spindle formationMicrotubule nucleation and establishment of the mitotic spindle in vascular plant cellsMicrotubule organization in the green kingdom: Chaos or self-order?50 ways to build a spindle: the complexity of microtubule generation during mitosisPlant gamma-tubulin interacts with alpha/beta-tubulin dimers and forms membrane-associated complexesPlant cell division: building walls in the right places",
            "date": "Answered January 22, 2015",
            "views": "472",
            "upvotes": " View 82 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Puspam Adak",
                    "user_href": "/profile/Puspam-Adak"
                },
                {
                    "user_id": "Madhusmita Pala",
                    "user_href": "/profile/Madhusmita-Pala"
                },
                {
                    "user_id": "Kalya Ravi",
                    "user_href": "/profile/Kalya-Ravi"
                },
                {
                    "user_id": "VEDANT VARDHAN",
                    "user_href": "/profile/VEDANT-VARDHAN-1"
                },
                {
                    "user_id": "Ujjwal Tiwary",
                    "user_href": "/profile/Ujjwal-Tiwary-22"
                },
                {
                    "user_id": "Hanfa Jabeen",
                    "user_href": "/profile/Hanfa-Jabeen"
                },
                {
                    "user_id": "Vera",
                    "user_href": "/profile/Vera-406"
                },
                {
                    "user_id": "Adhityo Wicaksono Wahyujati",
                    "user_href": "/profile/Adhityo-Wicaksono-Wahyujati"
                },
                {
                    "user_id": "Andrew Lindsey",
                    "user_href": "/profile/Andrew-Lindsey-3"
                },
                {
                    "user_id": "Abdulwahab Wahab",
                    "user_href": "/profile/Abdulwahab-Wahab-4"
                },
                {
                    "user_id": "Jagat Saikia",
                    "user_href": "/profile/Jagat-Saikia-6"
                },
                {
                    "user_id": "Franklin Veaux",
                    "user_href": "/profile/Franklin-Veaux"
                },
                {
                    "user_id": "Tk Godhaniya",
                    "user_href": "/profile/Tk-Godhaniya"
                },
                {
                    "user_id": "Asha Shrivastav",
                    "user_href": "/profile/Asha-Shrivastav-2"
                },
                {
                    "user_id": "Chandru Tupac",
                    "user_href": "/profile/Chandru-Tupac"
                },
                {
                    "user_id": "Shubham Verma",
                    "user_href": "/profile/Shubham-Verma-1796"
                },
                {
                    "user_id": "Waleed WT",
                    "user_href": "/profile/Waleed-WT"
                },
                {
                    "user_id": "Nurul Fatin",
                    "user_href": "/profile/Nurul-Fatin-50"
                },
                {
                    "user_id": "Vivek Rathi",
                    "user_href": "/profile/Vivek-Rathi-70"
                },
                {
                    "user_id": "Anna Rosner",
                    "user_href": "/profile/Anna-Rosner"
                },
                {
                    "user_id": "Mumtaz Adzdzakiy",
                    "user_href": "/profile/Mumtaz-Adzdzakiy"
                },
                {
                    "user_id": "Aditya Damodare",
                    "user_href": "/profile/Aditya-Damodare-1"
                },
                {
                    "user_id": "Adhish Sethi",
                    "user_href": "/profile/Adhish-Sethi"
                },
                {
                    "user_id": "Tauseef Asad",
                    "user_href": "/profile/Tauseef-Asad-2"
                },
                {
                    "user_id": "Lajeni. T.Lajeo",
                    "user_href": "/profile/Lajeni-T-Lajeo"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/JYOTI-775"
                },
                {
                    "user_id": "Prathwik Kumar",
                    "user_href": "/profile/Prathwik-Kumar"
                },
                {
                    "user_id": "Amrita Roy",
                    "user_href": "/profile/Amrita-Roy-174"
                },
                {
                    "user_id": "Pranchal Sharma",
                    "user_href": "/profile/Pranchal-Sharma-4"
                },
                {
                    "user_id": "Eduardo Zelada",
                    "user_href": "/profile/Eduardo-Zelada"
                }
            ]
        },
        {
            "author_info": {
                "name": "Larry Rafey",
                "href": "/profile/Larry-Rafey"
            },
            "answer_text": "Both Animals and Plants undergo similar Cytokinesis but with slightly differing strategies. Plants use what is called a Phragmoplast and Algae use a similar device called a Physcoplast. Both are essentially Microtubule arrays which accomplish the same outcome: Equal division of the cell. You should avail yourself to explore both of these functionary organelles. ",
            "date": "Answered October 13, 2018",
            "views": "25",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shradha Sinha",
                    "user_href": "/profile/Shradha-Sinha-15"
                },
                {
                    "user_id": "Smitha Ratnakar",
                    "user_href": "/profile/Smitha-Ratnakar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Adams",
                "href": "/profile/Mike-Adams-50"
            },
            "answer_text": "“How do plant cells undergo mitosis without the formation of spindle fibres?” Before you ask How, ask If. Plants do have spindle fibers https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2590724/ ",
            "date": "Answered June 21, 2017",
            "views": "39",
            "upvotes": "0"
        }
    ]
}