{
    "title": "How did modern technology change the ways evolution is studied now compared to Darwin's time? - Quora",
    "tags": [
        "Modern Technology",
        "Darwinism",
        "Charles Darwin",
        "Evolutionary Theory",
        "Evolution (process)",
        "Human Evolution",
        "Evolutionary Biology",
        "Technology Trends",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Uetz",
                "href": "/profile/Peter-Uetz"
            },
            "answer_text": "Most importantly, we understand the genetic basis of characters (through DNA sequencing) or how they change, namely due to mutations (also by sequencing). Specifically, we understand to a great extent how genes are switched on and off (e.g. RNASeq, in situ hybridization etc.) and how these switches are affected by mutations (sequencing again). Most importantly, we can sequence complete genomes and see how they evolve. For instance, we can sequence human and chimp genomes and then reconstruct the sequence of our common ancestor, which literally means that we know all mutations that happened since the two lineages split 6 million years ago. Equally important, we can modify genes and insert mutations at will (site-directed mutagenesis, CRISPR) to study the effect of specific mutations. Then you have CT-scanning, imaging, digital photography, GIS for characer analysis, biogeography etc. In other words: computers, the internet, databases etc. are completely indispensable for analyzing biological data, such as DNA sequences, and phylogenetic analysis. Darwin could have only dreamed of all this stuff. ",
            "date": "Updated October 24, 2020",
            "views": "42",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gary Ansorge",
                    "user_href": "/profile/Gary-Ansorge"
                },
                {
                    "user_id": "Indrajeet",
                    "user_href": "/profile/Indrajeet-32"
                }
            ]
        }
    ]
}