{
    "title": "How is Trump mishandling the COVID-19 situation? - Quora",
    "tags": [
        "COVID-19 in the USA",
        "Trump Administration (2017-Present)",
        "Trump Presidency (2017-21)",
        "Conspiracy Theories",
        "Donald Trump (politician, business person)",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Henry R. Greenfield",
                "href": "/profile/Henry-R-Greenfield"
            },
            "answer_text": "There are a lot of answers, many excellent, but none are up to date. The reason is simple, the BOB WOODWARD tapes with Trump where he directly says: In February he knew the virus had pandemic potential.Said it was more than 5X the death rate and virulence of the worst flu.Said he was choosing to lie to the American public so they would not panic.Refused to do anything because it would affect his reelection chances.Deliberately downplayed everything and touted potential cures even though he knew they didn’t work like Hydroxychloroquine or injecting bleach.I watched Fox recently, they said it was wonderful that the President didn’t tell the truth, millions could have died, that he is incredible and should get the Nobel Peace Prize that Democrats keep exaggerating the death toll and those people would have died anyways and of the 200,000 dead maybe half or more were just sick so if they died well then they were ready to go. Is there anyone besides me that is literally sickened at this point by the apologies that Trump supporters will make for this man? For someone who has sat back and let 200,000 and probably up to 400,000 dead by January. Who has supported anti vaxers which means not everyone will even take the vaccine even when it is ready. Someone who laughs at and contradicts experts, who manipulates the CDC, walks out on the WHO and gives it to China, who is now at rally after rally indoors knowing full well that many who attend will die. Someone who through his gross mismanagement has allowed 10s of millions to lose their job and the economy destroyed. Look around the world, no one, not any single leader in the world has done as poorly as Trump. And for what? So he can get reelected and blame everyone, give yet another tax cut, defund Social Security, cut Medicare but hey the evangelicals are happy because he is staunchly against abortion, he is rounding up immigrants and deporting them, the 2nd amendment (his people as if he owns them), love him because they can have unlimited arsenals and can begin to chase down the other side as they feel threatened and maybe take them out with their AR15s like the young man in Kenosha who was dropped off by his mom as he was ready to go out and get some of those protesters. We have an election, every day we wonder what has happened to this country under Trump. The Trump apology machine is in full force, they never relent, we are battered over and over. In the end, if there is anything that indicts this man and yes dear questioner that should declare him unfit to govern, is his own words added to that which he said to Bob Woodward. In his recent interview in response to the question at the time of 150,000 dead from the pandemic he simply said, ‘it is what it is’. No man, no leader is fit to be in any office let alone the President of the US, the so called leader of the free world who just says, hey they are gonna die, to bad. His incompetence is appalling, the Trump enablers will have this haunt them the rest of their lives. Let us not forget who they are and how they enabled the destruction of so many lives and death on such a scale for nothing. ",
            "date": "Answered September 14, 2020",
            "views": "14",
            "upvotes": " View 35 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amy Archer",
                    "user_href": "/profile/Amy-Archer-38"
                },
                {
                    "user_id": "Cynthia Flores",
                    "user_href": "/profile/Cynthia-Flores-118"
                },
                {
                    "user_id": "Michael Loepp",
                    "user_href": "/profile/Michael-Loepp"
                },
                {
                    "user_id": "Laura Ikuta",
                    "user_href": "/profile/Laura-Ikuta"
                },
                {
                    "user_id": "Belena Vincetti",
                    "user_href": "/profile/Belena-Vincetti"
                },
                {
                    "user_id": "Bridget Collins",
                    "user_href": "/profile/Bridget-Collins-19"
                },
                {
                    "user_id": "Bill Cowie",
                    "user_href": "/profile/Bill-Cowie-1"
                },
                {
                    "user_id": "John Bryant",
                    "user_href": "/profile/John-Bryant-59"
                },
                {
                    "user_id": "H. P. Robinson",
                    "user_href": "/profile/H-P-Robinson"
                },
                {
                    "user_id": "David Phillips",
                    "user_href": "/profile/David-Phillips-1062"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rich Ameninhat Parks",
                "href": "/profile/Rich-Ameninhat-Parks-1"
            },
            "answer_text": "I know this will be updated with more on the “The Reality TV Game Show: Trumps Gone Wild,” but I'm not updating any more… Maybe... Well... I updated, again, again and again… The purpose filled ignore-ance seems to have no limitNow: He said testing causes higher infection rates. He likely meant testing shows absolute infections and illness numbers. While hospitalizations, ICU care and deaths from Covid-19 f-actually show the spread of the pandemic as wellHe said testing should be decreased, against Scientific, f-actual or information of how other countries have flattened and virtually eradicate Covid-19, ie New Zealand, South Korea, Germany, etc. His cohorts said he was jokingAfter supposedly joking about decreasing testing, he and his admin. cut Federal funding for testingAfter Republican lead State brown-nosed to him, he restored funds to that one state, ONLY for an extra two weeks, and then who knowsHe has during this Pandemic cut the USA funding to WHO (World Health Org.) and launched a Republican lead oversight investigation against them; though not following their good for the people guidance in January, February, March, NowYesterday claimed he is king and would open USA states for business when he wanted; against the USA Constitution and realityHe has stated he will not adhere to $2 Trillion dollar oversight, fired the Inspector he hired about a week ago to provide oversight for Congress and the American peopleTrump administration pulls funding for drive-through COVID-19 testing, in addition to earlier this week firing his self appointed IG, making him the primary uncensored person to decide how the $2 Trillion Congress passed Economy support with be disbursed2017 Trump Admin ignored Report: Pentagon Knew Of Possible Coronavirus Threat For Years. Did not replenish nor approve funding for replenishing N95 masks and respiratorsTrump Admin takes out key USA CDC diplomat and potential whistle blower in China, Dr. Linda Quick - Google Search, September 2019. However, she leaves her post a month earlier, August. Covid-19 is said to have been ramping up as early as October or November 2019The Trump Admin did not respond to and approve the measure that On January 26, Schumer, the top Senate Democrat, called on the administration to declare a public health emergency over coronavirus to free up funding. - Google SearchFrom January to March 2020 Trump Admin says Covid-19 is a hoax, just going to go away naturally. Fox news backs his claims.When it doesn't, Trump declares a National Emergency, but uses NONE of the War Time Emergency powers he invoked to provide Nationwide guidance in saving lives.Mid March, Governor's openly “curse” Trump for lack of supplies, purposely holding up Federal surplus Emergency supplies, not using his Commander in Chief War Time President already activated power to ramp up supplies, he tweets for the Federal Reserve to help the flailing stock market but no action in saving lives for three months.Now finally at the end of March, he takes action with New York ballooning from hundreds of infections in late February to 80,000 plus, one month laterHe focuses on taking credit and no responsibility. That is the Capitalistic boss/Dictatorship rule of thumb… Take responsibility for all good, nothing on failures, deflect, delude, maintain Alpha illusionHe continues to attack people who are supposed to be helping make America Great, UNITED statesHe has infused such delusional, easily acquired talking points to his cult followers, that he and they still brag that he closed borders to China earlier than anyone. They ignore and lie by omission that he has been closing boarders for 3 years with xenophobic racism at the crux of the matter. He kept Britain, Ireland, etc. open way longer than he should have. I wonder why?He snuck another tax break for the rich - 1% of wealthy into the 2 trillion dollar stimulus package, making it retroactive to 2018… Retroactive to 2018? Really? Why? People who made over certain amount of money, retroactive to 2018, will not get stimulus checks, even if they are bankrupt and unemployed nowHe pushed the China Corona Virus shtick to a breaking point, until he realized China makes the majority of USA medicines, it’s a voting year and he needs Asian votes, Asians were being wrongly attacked in USA by his cult followers and others for prejudiced, racist, Trumpian idealismHe turns Pandemic reports into Reality TV shows, even bragging about “His” ratings. Though he appointed Pence at lead, Pence is no where to be seen. Trump upstages all with behind scene setups, like, “Let me open the box and take out the 5 Corona device i was responsible for making, by forcing private companies to work on their own to develop…”He makes statements of quarantining States, not realizing even what that meansHe will not open the Affordable Care Act to ensure and insure people without insurance and help better or save lives, or create a National Emergency Health Care Act to insure all Americans in need of care, including hospitalization and recovery costs or specialized funeral costs related to dealing with Covid-19. People, Americans, are literally going to hospitals with symptoms, being turned away due to having no insurance, leaving the hospital infected, exposing others and dying, or suffering without care. This is both a public hazard and inhumanatarian act. I can see people having legal success suing the Government in Court. Worse, people are dying and suffering due to Reality TV Politics, focused on maintainig Political Party stances and Economic flow and achievement. How much is a life worth per Capita?He has not Federally addressed the extreme rate Covid-19 has decimated brown (African American, Asian American, Indian American, Hispanic American s, Native American, etc. He ignored this and makes busy protecting Confederate, traitors of America who believed in and promoted and promote Racism and slaveryHe hasn’t resigned or “flipped the switch” to perform responsibly and proactively re Covid-19 for saving lives, putting USA at risk daily. Etc.",
            "date": "Updated June 28, 2020",
            "views": "44",
            "upvotes": " View 59 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tracy Theresa",
                    "user_href": "/profile/Tracy-Theresa"
                },
                {
                    "user_id": "Cheryl Kahoun",
                    "user_href": "/profile/Cheryl-Kahoun"
                },
                {
                    "user_id": "Lee Walker",
                    "user_href": "/profile/Lee-Walker-77"
                },
                {
                    "user_id": "Erin Boehm",
                    "user_href": "/profile/Erin-Boehm"
                },
                {
                    "user_id": "Abigail Strubel",
                    "user_href": "/profile/Abigail-Strubel-1"
                },
                {
                    "user_id": "Mike Roberts",
                    "user_href": "/profile/Mike-Roberts-782"
                },
                {
                    "user_id": "Corinne Vielle",
                    "user_href": "/profile/Corinne-Vielle"
                },
                {
                    "user_id": "Ronald Cook",
                    "user_href": "/profile/Ronald-Cook-51"
                },
                {
                    "user_id": "Dee Franklin",
                    "user_href": "/profile/Dee-Franklin-1"
                },
                {
                    "user_id": "Darrin Vicsik",
                    "user_href": "/profile/Darrin-Vicsik"
                }
            ]
        }
    ]
}