{
    "title": "How can politics be studied as a science? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Jason Mead",
                "href": "/profile/Jason-Mead-26"
            },
            "answer_text": "It sounds like you are referring to the study of Political Science, which is a social science. The social sciences are often referred to as soft sciences; whereas, hard science refers to an area such as biology, astronomy or physics. Science is the organized study of “something”; let’s call that something politics. In studying the systems, governments and bodies politic, social scientists use a variety of tools to gather data; these tools are either quantitative or qualitative. Please search Quora to learn more about soft/qualitative and hard/quantitative sciences. The terms hard and soft should not be seen as a degree of importance or legitimacy. Rather hard/soft should refer to how rigid the discipline is in it’s interpretation of data. The less rigid the definitions, the more explanations of what we understand may be true. Hard Science: A molecule of water is two hydrogen and one oxygen atoms. There’s no wiggle room. Soft Science: Theories on climate change are not deductive; therefore, leaving room for other legitimate claims to be made. Is it caused by human activity, or by researchers/universities to get grant dollars that only go to “researchers” that back-fill data to support predefined conclusions, or is it caused by deglaciation? ",
            "date": "Answered September 3, 2017",
            "views": "12",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ogunkoya William",
                    "user_href": "/profile/Ogunkoya-William"
                },
                {
                    "user_id": "Emil Davidov",
                    "user_href": "/profile/Emil-Davidov"
                },
                {
                    "user_id": "Alvin Rodriguez",
                    "user_href": "/profile/Alvin-Rodriguez-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Cullenbine",
                "href": "/profile/Bob-Cullenbine"
            },
            "answer_text": "Not really. The scientific method, the foundation of science, is either unhelpful or impossible to use in politics. But many sciences are utilized to study politics…statistics, math, geography, medicine, etc. History probably provides the most reliable information about politics. ",
            "date": "Answered September 13, 2017",
            "views": "162",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Giles Cattermole",
                    "user_href": "/profile/Giles-Cattermole-1"
                }
            ]
        }
    ]
}