{
    "title": "How can theoretical physics discover complex theories in mathematics? - Quora",
    "tags": [
        "Mathematical Theories",
        "Mathematical Physics",
        "String Theory",
        "Complexity",
        "Mathematics and Physics",
        "Theory and Theories",
        "Theoretical Physics",
        "Science",
        "Mathematics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gaston Nusimovich",
                "href": "/profile/Gaston-Nusimovich"
            },
            "answer_text": "The truth is that we have at least one historical example when math was discovered from a need to solve a problem in certain legal affairs: algebra and algebraic numbers were discovered to solve the math problems present in inheritance trials. During the middle ages, arab scholars made the transition from the geometric diagrams of greek math and geometry to the equations of algebra. Archimedes did discover differential calculus so as to solve engineering problems, for the most part, and not just out of the curiosity of exploring math, which of course he also had and motivated some of his research. So, it not only theorerical physics that may help push the boundaries of knowledge in math, and, since the 18th century, math has always been ahead of physics: since then, by the time physics has needed some math tool, said tool had already been discovered by mathematicians. We seldom see a case when a discovery in math is done by physicists, but it does happen, like for instance, the novel expression for eigen values discovered by physicists while investigating the ratios of changes of flavor of travelling neutrinos. Kind regards, GEN ",
            "date": "Answered October 15, 2020",
            "views": "33",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ahmad Mbark",
                    "user_href": "/profile/Ahmad-Mbark"
                }
            ]
        }
    ]
}