{
    "title": "How hard is it to actually be in a lockdown for weeks? - Quora",
    "tags": [
        "Locks",
        "Lockdowns",
        "Crime",
        "Experiences in Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "J M Sharma",
                "href": "/profile/J-M-Sharma"
            },
            "answer_text": "Staying at home for long periods can be difficult, frustrating and lonely for some people and may make you or other household members feel less. That can be particularly challenging if you do not have much space or access to the garden. It is important to remember that we have to take care of our mind as well as body, and get external support when needed. Stay in touch with family and friends over the phone or on social media. There are also sources of help and information that can help, such as the Every Mind Matters website. source: Stay at home: guidance for households with possible coronavirus (COVID-19) infection Let's also discuss another angle of lock-down, The idea of ​​lock-down is reinvented and conceived by our policymakers and thought-provoking and learned people! Measures such as silence, seclusion, Kutir (cottage) Pravesh, are some of the words of the ancient generation that were used to describe the social interest of a seeker. Those measures were mainly practised to conserve energy level. We know that the virus is deadly; It changes shape, increases rapidly. The bacteriophage is ubiquitous, and in a different form, the earth is inhabited, it is not visible to our senses. Like humankind, they too are multiplying. He is our enemy, and man is the means for him to grow. Therefore, how to defeat them and provide them with the means available is essential for our survival. Not engaging in a direct fight with them, however, making sure that we win and they lose, is only possible with a well thought out strategy. Viruses exist in the environment; We clap jointly and vibrate together with the local atmosphere, a bell sound and several bells sound that produce specific vibrational energy. It is also a brilliant idea, brilliant fantasy, defeating the enemy of humankind with smart tricks. Our ancient generation has created many non-traditional methods by practising it. Now, under the illusion of so-called progress, we abandoned old practices and adopted some methods, to go out with no reason, to use petrol, so we hesitate to burn it for our so-called enjoyment Don't! Merchants are ready to market to attract buyers by laying nets, they special decorate places to invite us (that is, potential customers!), Sell them our so-called 'life useful' products, and we also pass on them at our cost. Go to market In practice, little or no product is an essential requirement for our healthy life and livelihood. Confusion controls us, lock-down is breaking that illusion, and we are fast approaching self-thought mode. Only Thodasa contemplation and so many facts are visible to us. This change is welcome at the time of this disaster. The real meaning of life has vanished in the last few decades due to the influence of the deceptive methods we have forcibly adopted. Since life is a journey, unfortunately, we do not determine the destination on our own. Perception managers force their preconceived ideas into our thinking style. And we do not even see this force directly! Simply put, we have lost the ability to see things according to our point of view. We are forced to follow the set line (streak) operated by the trader and his hired managers, so they push, bulldoze, even without our will, and it is beyond our comprehension. They put their thoughts before the illusionary advertisement, broadcast and immerse them in sugar syrup. This system is now so powerful, and we are now worried because it is not there! How can we run on our own without guiding principles of perception managers and market guides? The life of the race and its guiding principles has become our crutch. Bandhu, isolation (lock-down) is not a punishment, but it is true freedom when we have a pleasant feeling of our existence. It is like new rays of real hope, and all people buried deep within the depths of their life. Hui being able to hear his inner voice is also an achievement. Direct your thoughts, be awake; if our ideas are right, then the future of humanity is too bright. Thanks, Naman, please like the share and follow if you want the answer. ",
            "date": "Answered March 21, 2020",
            "views": "466",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Farzeen Mirza",
                    "user_href": "/profile/Farzeen-Mirza-5"
                },
                {
                    "user_id": "Lalit Shekhawat",
                    "user_href": "/profile/Lalit-Shekhawat-2"
                }
            ]
        }
    ]
}