{
    "title": "How to detect Volatile Organic Compounds - Quora",
    "tags": [
        "Volatile Organic Compounds",
        "Air Pollution",
        "Pollution",
        "Organic Chemistry",
        "How-to Question",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thomas Talhelm",
                "href": "/profile/Thomas-Talhelm"
            },
            "answer_text": "I got into this same question when I was living in China, and was worried about the air pollution in my home. At first I used a laser particle counter to measure particulate, and I found the air in my apartment in Beijing was almost always well above the WHO 24-hour limit:  After I did a bunch of particulate tests, I started getting curious about gas pollutants like NO2 and VOCs. I quickly discovered that gas pollutants are a lot harder to measure. Difficulty 1 For one, “particles in the air” is a natural, real category. But “gases that are harmful to humans is not.” That means you need different sensors for different gases, so it quickly becomes a complicated job. VOCs in Particular But this question is about VOCs in particular. VOCs are a fairly big category, including things like benzene, toluene (put out by cigarettes), and formaldehyde (sometimes released by new furniture and construction materials). How can we measure VOCs? At first, I bought an inexpensive VOC add-on to the Air Quality Egg. But it didn’t seem to respond to VOCs in my home. When I burned cigarettes in the room and put nail polish remover near it, it didn’t respond. (I can’t find it on their website anymore, so maybe they’ve removed that sensor.)  From there, I decided I needed to kick things up a notch. Next I bought an Industrial Scientific MX6. It has ports for six sensors, including a PID sensor (identical to what User-9569469144132262102 mentioned in her answer). All told, this cost about $3,000, although it’s cheaper if you buy a machine with just one port.  On the plus side, this machine comes with a pump, which regulates air flow. It also responded to VOCs in the environment. Readings jumped when I burned cigarettes and opened nail polish remover near the machine. Difficulty 2 However, it doesn’t seem to be very sensitive on the low end. When I opened up nail polish and put it a meter or two away, the machine would read zero. That’s despite the fact that I could smell the nail polish. So the machine seemed to be missing something. Another piece of evidence that makes me think the machine is missing readings on the low end is that in most apartments I tested in, it read zero. Now, these apartments probably didn’t have serious VOC problems, but I doubt they were really zero. I’ve read studies where researchers use much more sophisticated devices to measure VOCs in apartments in China and Hong Kong, and they found at least some level of VOCs in all apartments.  However, the MX6 was able to detect moderate and high amounts of VOCs. For example, when I went to apartments that had been recently remodeled, the MX6 was able to detect VOCs. Thus, my conclusion was it could reliably detect moderate amounts of VOCs, but not low levels. The MX6 also allowed me to do tests of carbon filters in rooms to see whether carbon could reduce VOCs from cigarettes and reduce formaldehyde I bought from a factory. For fellow nerds, I made all of the test methods and results openly available.  Difficulty 3 These PID machines will give you numbers, but you won’t know what it’s actually detecting. Is it formaldehyde? Is it benzene? Is it that bottle of alcohol someone opened? The machine won’t tell us. This point is particularly frustrating to me because I see a lot of machines marketed in China as “formaldehyde detectors,” like this one for about $12:  The problem is, they aren’t formaldehyde detectors per se. They detect lots of stuff, and the machine will display formaldehyde numbers, but users have no way of knowing if it’s actually formaldehyde. For example, the machine I bought in China (similar to the one above) also reacted to carbon monoxide. Thus, labeling the output formaldehyde is misleading. Conclusion If you’re concerned about VOCs in your home, these machines are a good starting point for detecting moderate and high levels. But if you want to know what specific VOCs you have, you’d probably have to send air samples to a lab. P.S. Why your nose might be almost as good! When people tell me they’re considering buying a VOC detector, I tell them they might be better off using their nose! Many VOCs have odors (for example, benzene smells somewhat like gasoline according to the CDC). In my experience testing many homes around Beijing, everywhere the PID displayed VOCs, I could also clearly smell a chemical smell. To me, it smells like paint, remodeling, or that new car smell. Thus, I’d say your nose is a good place to start! Of course, remember that it’s not a guarantee. Some VOCs may be odorless, and there must be low levels that our noses can’t detect. However, I was able to identify problem areas with my nose. I hope my nerdy testing quest helps you in yours! ",
            "date": "Updated September 16, 2019",
            "views": "26",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kenneth Armstrong",
                    "user_href": "/profile/Kenneth-Armstrong-9"
                },
                {
                    "user_id": "Zachary Lee",
                    "user_href": "/profile/Zachary-Lee-36"
                },
                {
                    "user_id": "Jalwa Younas",
                    "user_href": "/profile/Jalwa-Younas"
                },
                {
                    "user_id": "Andrew Lam",
                    "user_href": "/profile/Andrew-Lam-88"
                },
                {
                    "user_id": "J. Edward",
                    "user_href": "/profile/J-Edward-10"
                },
                {
                    "user_id": "João Vitor Gomes",
                    "user_href": "/profile/João-Vitor-Gomes"
                }
            ]
        },
        {
            "author_info": {
                "name": "Albert Donnay",
                "href": "/profile/Albert-Donnay"
            },
            "answer_text": "With Gas chromatography and mass spectroscopy. These costs tens or hundreds of thousands of dollars. Cheap sensors that claim to measure VOCs only measure total VOCs and can't distinguish among them ",
            "date": "Answered July 11, 2016",
            "views": "467",
            "upvotes": " Answer requested by João Vitor Gomes"
        }
    ]
}