{
    "title": "How can the universe continue to expand with gravity trying to pull everything back together? - Quora",
    "tags": [
        "Gravity",
        "The Universe",
        "Cosmology",
        "Astrophysics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nimita Deshpande",
                "href": "/profile/Nimita-Deshpande"
            },
            "answer_text": "There are two reasons. First of all, space is so incredibly empty that if the universe was a room with a volume of several cubic kilometers, all the matter in it would amount to nothing more or less than an insignificant speck of dust. An insignificant amount of matter implies an insignificant gravitational attraction. Then add to this interesting bit of information that gravity is the weakest of the four fundamental forces, and decreases the greater the distance between matter, (in this case planetary systems and galaxies), which is vast. Second of all, we must take into account the fact that the universe is expanding, as has been mentioned already, at an accelerated rate. This can be attributed to the presence of a phenomenon known as dark energy, which is repulsive in nature and propels galaxies apart at what are thought to be light speeds. The expansion due to dark energy is increasing at such a rate that some galaxies are ‘saying their final goodbyes’ and disappearing forever from our observable universe. With such a huge rate of expansion it is not likely that the universe will ever be slowed down and brought back to the state of a singularity by such a weak force as gravity. It is like imagining a ball tied to an elastic string. If we hold one end of the string and sling the ball forward, two possible scenarios may occur. One; if the force that we exert on the ball is a small one, the string will merely snap back, bringing the ball with it. Two; if the force we exert on the ball is a great one, it is likely that the string will snap and the ball will be flung across the room. The latter scenario can be related to what will more likely happen concerning the universe. ",
            "date": "Answered May 19, 2016",
            "views": "766",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gunturu Rkv Subba Rao",
                    "user_href": "/profile/Gunturu-Rkv-Subba-Rao"
                },
                {
                    "user_id": "Shoaib Shaikh",
                    "user_href": "/profile/Shoaib-Shaikh-56"
                },
                {
                    "user_id": "Shrutika Sahai",
                    "user_href": "/profile/Shrutika-Sahai"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pavi Kanetkar",
                "href": "/profile/Pavi-Kanetkar"
            },
            "answer_text": "The discovery that the universe is expanding was one of the great intellectual revolutions of the twentieth century. With hindsight, it is easy wonder why no one had thought of it before. Newton, and others should have realized that a static universe would soon start to contract under the influence of gravity. But suppose instead that the universe is expanding.If it was expanding fairly slowly, the force of gravity would cause it eventually to stop expanding and then to start contracting. However, if it was expanding at more than a certain critical rate, gravity would never be strong enough to stop it, and the universe would continue to expand forever. This is a bit like what happens when one fires a rocket upward from the surface of the earth. If it has a fairly low speed, gravity will eventually stop the rocket and it will start falling back. On the other hand, if the rocket has more than a certain critical speed (about seven miles per second), gravity will not be strong enough to pull it back, so it will keep going away from the earth forever.This behavior of the universe could have been predicted from Newton’s theory of gravity at any time in the nineteenth, the eighteenth, or even the late seventeenth century. Yet so strong was the belief in a static universe that it persisted into the early twentieth century. Even Einstein, when he formulated the general theory of relativity in 1915, was so sure that the universe had to be static that he modified his theory to make this possible, introducing a so-called cosmological constant into his equations. Einstein introduced a new “antigravity” force, which, unlike other forces, did not come from any particular source but was built into the very fabric of space-time. He claimed that space-time had an inbuilt tendency to expand, and this could be made to balance exactly the attraction of all the matter in the universe, so that a static universe would result. ",
            "date": "Answered March 21, 2014",
            "views": "631",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abdullah Talal",
                    "user_href": "/profile/Abdullah-Talal"
                },
                {
                    "user_id": "Gal Levinsky",
                    "user_href": "/profile/Gal-Levinsky"
                }
            ]
        }
    ]
}