{
    "title": "How does pressure produce heat if heat is the rapid movement of atoms? - Quora",
    "tags": [
        "Fluid Dynamics",
        "Heat",
        "Thermodynamics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Riadh Al Rabeh",
                "href": "/profile/Riadh-Al-Rabeh"
            },
            "answer_text": "Pressure is force over unit area of a surface. The force comes from the particles moving towards this surface, meet enough repulsion then go back where they come from. In the process the momentum has changed from a positive value p to its negative -p, so the change in momentum is 2p, and this when divided by the time period it took to happen we get the force.. since force is the time rate change of momentum; f=dp/dt. If you bring the walls nearer to each other, the distance between them becomes smaller and the time taken by particles to move between container surfaces is shorter. The velocity of the particles does ‘not’ change, but the frequency of hitting the wall increases and this increase the momentum change at the walls per unit time, and this will appear as increase in pressure. This is Boyle’s law for gases. The more general law for ideal gases is pV=nRT, where n is the number of particles and R is the universal gas constant. So for constant T, pressure p is inversely proportional to the volume V. So if you allow the walls to compress a gas slowly and the gas is not insulated, you can have higher pressure, smaller volume and no temperature change from the first value which could be that of the surroundings for example. Now what is temperature. If I touch something and get burnt, I know it is hot. Why, because the molecules of the hot object are moving so fast, they get in contact with my hand, move their molecules in turn very fast and get them change their composition.. by melting, or encourage them to bind to oxygen and burn. Accordingly the temperature is defined as the average r.m.s (statistical average) kinetic energy of the molecules. <Ek>=3/2 kT, where k is Boltzmann constant. Now the product pV is energy since pV=force/area(N/m^2) x volume(m^3)= N.m, and that is energy. So as long as pV is constant, the temperature remains constant. The increase in temperature due to increase in pressure comes from the work done to compress the gas. This work or energy; E=pdV, where dV is te change in volume. If this heat is not allowed to escape, the energy of the gas will increase and temperature will increase too according to the universal gas law. But that means the rms velocity of the molecules has increased too. Where did this increase come from.. it comes from the motion of the walls pushing the molecules as they hit the walls.. This is like the case of me hitting a tennis ball with a racket and giving it kinetic energy, or keeping the racket fixed and let the ball hit it and reverse back, in which case the ball will keep its original energy. The first case correspond to a moving wall to compress the gas and the second to a static wall just keeping the gas in. ",
            "date": "Answered September 13, 2018",
            "views": "23",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Malavi Arulmani",
                    "user_href": "/profile/Malavi-Arulmani"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/yashoswi-das-2"
                },
                {
                    "user_id": "Kirsten Hacker",
                    "user_href": "/profile/Kirsten-Hacker"
                }
            ]
        },
        {
            "author_info": {
                "name": "Viktor T. Toth",
                "href": "/profile/Viktor-T-Toth-1"
            },
            "answer_text": "Pressure by itself does not produce heat. An increase in pressure does produce heat. As you compress a quantity of gas, for instance, by pushing a piston into a cylinder, you cause every molecule that bounces into the piston wall to bounce back a little faster. As you push the piston, you do work; this work is translated into more kinetic energy for those gas molecules, which means more heat. If you stop pushing, the increase in heat will stop (and unless the walls of the cylinder are perfectly insulated, the excess heat will ultimately dissipate through the cylinder walls to the environment.) ",
            "date": "Answered February 8, 2015",
            "views": "5",
            "upvotes": " View 34 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Xyla Zuwe",
                    "user_href": "/profile/Xyla-Zuwe"
                },
                {
                    "user_id": "Fahad Taj",
                    "user_href": "/profile/Fahad-Taj"
                },
                {
                    "user_id": "Steven Calvert",
                    "user_href": "/profile/Steven-Calvert"
                },
                {
                    "user_id": "Abhinav Asokh",
                    "user_href": "/profile/Abhinav-Asokh"
                },
                {
                    "user_id": "Bijal B",
                    "user_href": "/profile/Bijal-B"
                },
                {
                    "user_id": "Reynold Yong",
                    "user_href": "/profile/Reynold-Yong"
                },
                {
                    "user_id": "Shashi Kant Sharma",
                    "user_href": "/profile/Shashi-Kant-Sharma-6"
                },
                {
                    "user_id": "Steven Zitis",
                    "user_href": "/profile/Steven-Zitis-1"
                },
                {
                    "user_id": "Paul P Mealing",
                    "user_href": "/profile/Paul-P-Mealing"
                },
                {
                    "user_id": "Rujul Patel",
                    "user_href": "/profile/Rujul-Patel-15"
                }
            ]
        }
    ]
}