{
    "title": "How can cell cycle aberrations lead to tumor formations? - Quora",
    "tags": [
        "Cell Cycle",
        "Cells (biology)",
        "Cell Biology",
        "Cancer"
    ],
    "response": [
        {
            "author_info": {
                "name": "Zabi Safi",
                "href": "/profile/Zabi-Safi"
            },
            "answer_text": "Hi, The cell cycle is divided into two main stages the interphase and the mitosis. Each of the cell cycle is tightly regulated by various proteins and enzymes.  Usually cyclin are involved in the cell cycle progression. This is because studies have shown that their concentration has been found to increase and decrease rapidly during cell cycle. In animal cells there are various cyclin and CDKs activated at different stages of cell cycle. They include, cyclin A, B, D, E and there is also mitosis promoting factors, which is involved in promoting the M phase.During mid-G1 cyclin D and CDK4 and 6 are expressed. In late-G1 cyclin E and CDK2 are expressed. In S-Phase cyclin A and CDK2 are expressed and finally in mitotic phase cyclin A, B along with CDK1 are expressed. These are the regulators of the cell cycles along with other proteins and enzymes that are either expressed before or after cell cycle. For example, cell receptor EGF and signalling molecules such as RAS also control and regulate cell cycle progression in animals along with p53 and BCL-2.  Majority of cell cycle aberration that leads to  tumour formation are associated with cell receptor EGF and signalling molecules such as RAS and p53 as well as  BCL-2. In cancer genes are broadly divided into two groups oncogene (gain in functions) example include, RAS and tumour suppressor genes (loss in function) example include p53. Let’s say we have a mutation or aberration in cell cycle and it is in the oncogene (RAS). Mutation in RAS pathway will allow RAS to gain in function i.e. keep signalling cell to divided and proliferate (leading to uncontrollable proliferation of cells without the need – this leads to high cell turnover and in return leads to weight loss one of the symptoms of cancer),. A tumour will become hypoxic if there is not enough of oxygen into the centre of the tumour. Folkman was the first who reported that for a tumour to grow to >2mm in diameter, a blood supply is required. This blood supply is provided by tumour cells forming angiogenesis (formation of new blood vessel), from here the cells can also escape and travel to a distant site in the body (metastasis) and colonise their forming a secondary tumour and that is how aberration can eventually lead to tumour formation. Now let’s say we have mutation in p53 protein (loss in function of p53), mutation in this proteins is associated with about 50% of tumourgenesis. It results in reduced apoptosis (less programme cell death) therefore allowing cells to proliferate and survive, which in return requires nutrients and other proteins supply and this is done through the formation of angiogenesis by the cancer cells. Again the rest of the process is similar. So if we have mutation in either of them or in both of them altogether then there are high chances of a secondary cancer as well as less survival rate.  Cheers :)  Zabi Safi   ",
            "date": "Answered May 12, 2016",
            "views": "324",
            "upvotes": "0"
        }
    ]
}