{
    "title": "How close are we to making the Nikola Tesla free energy concept a reality? - Quora",
    "tags": [
        "Free Energy",
        "Nikola Tesla",
        "Inventors",
        "Scientists",
        "Science of Everyday Life",
        "Energy (physics)",
        "Science",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carl Smotricz",
                "href": "/profile/Carl-Smotricz"
            },
            "answer_text": "Tesla had two different ideas about “free energy.” One was about obtaining it and the other was about distributing it. The “obtaining” idea involved, roughly, somehow stringing antennas and wires up to the ionosphere to tap into the electrical potential difference between the Earth and “up there.” That idea is impractical because of the length and weight of the wires required, and the size and weight of the antennas. Cool in theory, unrealistic in practice. It’s not like this idea was kept secret or anything; if it was a sensible idea then there would be power companies doing this and making a profit on it. The “distributing” idea involved building big-ass coils to transmit power to whole cities the way wireless chargers do to your phone. You’d essentially be turning a city into a huge transformer or induction range, and everybody living in it would be walking around in a periodic magnetic field. Anybody could tap into the electricity just by setting up a coil. This idea isn’t completely impractical technically, though it would waste some energy heating up any bit of metal in the field. It’s impractical from a public health point of view because there are likely to be negative effects from living inside a strong fluctuating magnetic field, in a way that’s far more real than the one today’s 5G conspiracy nutters worry about. It’s impractical economically because who would want to build a lot of expensive infrastructure to provide a population with energy in a way that can’t be metered and charged for? Regular ol’ copper wire turns out to be more efficient and more practical in every way. And remember, this is just about distribution — the electrical energy would still have to come from somewhere. See above. In summary: Both of Tesla’s “free energy” ideas turned out to be garbage, and that’s why they aren’t implemented today. There are many clueless people whose IQ drops by several dozen when they hear the word “free,” and these people continue to worship the idea of someone who invented a mechanism for giving them something for nothing. ",
            "date": "Answered September 11, 2020",
            "views": "137",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Waldemar W. Koczkodaj",
                    "user_href": "/profile/Waldemar-W-Koczkodaj"
                },
                {
                    "user_id": "Ravikumar Bhadram",
                    "user_href": "/profile/Ravikumar-Bhadram"
                },
                {
                    "user_id": "Ian Dougherty",
                    "user_href": "/profile/Ian-Dougherty-2"
                },
                {
                    "user_id": "Golu Ujjain",
                    "user_href": "/profile/Golu-Ujjain"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevin Bar",
                "href": "/profile/Kevin-Bar"
            },
            "answer_text": "We are very close to getting new energy creation systems that will access free electricity as well as other energies that we do not know about. Mainstream science lost Teslas positive concepts of electrical attraction when they embraced the negative electron and its pushing force that needed generation. A shift in consciousness is taking place and people are now awakening to their own unique consciousness. From this perspective we will all begin to become the creator that is innate within us. Science works from laws, assumptions and so-called facts which make systems that need to be enclosed, mechanical and finite. Nature and our universe (solar system) work from infinite and intelligent systems that have boundary conditions which are pervasive to higher vibrations so that unity of light happens through density of harmonics and can be seen in tones of colour such as a rainbow. As Tesla said, “the universe is light” and “everything is vibration”. 2020 is going to be a year of awakening for many people around the planet. As we begin to become aware of ourselves, we also become aware of the “evil” that is now in its death throws. Evil is not universal; it is a man-made concept. Pedophilia and child sacrifice are evil as is satanic worship. This year we are all becoming aware of what a group of elites who have been in control of the planet for 1000’s of years has been up to. They have infiltrated into the top hierarchies of every institution around the planet and are now making their presence felt as they try and take as many people with them as they can. The last thing that they want is for individual human beings to begin to know who they are and what they can accomplish when they work together from a perspective of unconditional love and self-respect. ",
            "date": "Answered September 11, 2020",
            "views": "70",
            "upvotes": " Answer requested by Joe Abdi"
        }
    ]
}