{
    "title": "How can TOTALLY PURE water kill someone? - Quora",
    "tags": [
        "Pure Water",
        "Toxicology",
        "Killing",
        "Murder",
        "Drinking Water"
    ],
    "response": [
        {
            "author_info": {
                "name": "Barry Gehm",
                "href": "/profile/Barry-Gehm"
            },
            "answer_text": "To be more specific, if you drink lots of water, your blood (and other extracellular fluids) become more dilute, which is to say that they contain more water and less of the other stuff like salts, sugars, etc., that they normally carry. The membranes of your cells are permeable to water, and since the concentration of salts, sugars, etc., in the cells is now higher that in the liquid outside, we get osmosis of water into the cells, which makes them swell up. Mostly, this isn’t a big deal. It doesn’t do much harm if your liver cells or muscle cells or kidney cells swell up a little bit. But, there’s one rather important organ that is inside a rigid bone box. When your brain cells swell, your brain has nowhere to expand. It just squeezes tighter and tighter against the skull, and it’s kind of like having a concussion over the whole brain. This can do a lot of damage, and among other things cause you to stop breathing. Disclaimer: I didn’t watch the video, but I talk about a case of lethal water intoxication in my biochemistry class. ",
            "date": "Answered September 4, 2017",
            "views": "361",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mayukh Bhattacharya",
                    "user_href": "/profile/Mayukh-Bhattacharya"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ben Powell",
                "href": "/profile/Ben-Powell-20"
            },
            "answer_text": "The Youtube video you referenced is a nice compilation of relative toxicities; I’ve bookmarked it for use elsewhere. Thanks! Regarding “water poisoning” AKA “water intoxication” . . . and sometimes “hyponatremia” (though that’s not quite the same thing”, the articles here:Water intoxication - Wikipediaand here:https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1770067/provide detailed information. But basically, MANY body processes depend on the correct ratios of water to sodium and potassium ions (among others). When you drink too much water, you screw up the ratios, which screws up the body processes . . . which causes you to die!  By the way, the video referenced with the original question is worth watching for anyone who does not have a clear understanding of relative toxicities.  ",
            "date": "Updated September 11, 2017",
            "views": "632",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lorraine Tilbury",
                    "user_href": "/profile/Lorraine-Tilbury"
                },
                {
                    "user_id": "Amara Valkyrie Kane",
                    "user_href": "/profile/Amara-Valkyrie-Kane"
                },
                {
                    "user_id": "Sahil Sen",
                    "user_href": "/profile/Sahil-Sen-3"
                },
                {
                    "user_id": "Corey Tran",
                    "user_href": "/profile/Corey-Tran-3"
                },
                {
                    "user_id": "Tristan Phillips-Page",
                    "user_href": "/profile/Tristan-Phillips-Page-1"
                },
                {
                    "user_id": "Thomas Mccorry",
                    "user_href": "/profile/Thomas-Mccorry-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Syris Rodello",
                "href": "/profile/Syris-Rodello"
            },
            "answer_text": "Water is a biproduct of the combination of hydrogen and oxygen. In this purest form, water has absolutely zero trace elements of carbons, iron, calcium or atoms of other elements that water collects during rainfall. When entering the human body in this form, the water will literally strip and collect needed nutrients that are essential for human survival. These nutrients are then disposed of rather than collected by your body for needed nutritional importance. Over a length of time, drinking pure distilled water (which contains the warning label “not for consumption” ) will literally dry you out and kill you. ",
            "date": "Answered September 5, 2017",
            "views": "159",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chris King",
                    "user_href": "/profile/Chris-King-831"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ann Sedlacek",
                "href": "/profile/Ann-Sedlacek"
            },
            "answer_text": "I mean, no, pure water is good for you. Water is necessary to survive. People need to drink more water, and less juice (too much sugar to consume frequently) and soda (soda actually dehydrates you badly, and is full of processed sugar which is bad for you, and toxic additives that are mildly poisonous. Diet soda is even worse, because the aspartame in it converts to extremely poisonous formaldehyde in the human body during digestion. Water is the best thing you could ever drink. As long as it is clean, filtered, disinfected water. Technically, too much of any good thing can kill you. There’s 1 report I read of 1 crazy woman who drank 6 gallons of water a day for a week straight as some sort of a crazy weight loss diet. She died. She literally drowned her own internal organs in water. But that’s literally like 1 in 7 trillion chances of happening, and you’d have to drink insane amounts of water. ",
            "date": "Answered December 4, 2019",
            "views": "64",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chicken Butt",
                    "user_href": "/profile/Chicken-Butt-26"
                },
                {
                    "user_id": "Mohammed Saiful Alam Siddiquee",
                    "user_href": "/profile/Mohammed-Saiful-Alam-Siddiquee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom McDonald",
                "href": "/profile/Tom-McDonald-49"
            },
            "answer_text": "Here’s one way: Drink massive amounts of waterDon’t peeThe osmotic pressure of your extracellular fluid will plummetWater will start entering the cells of your body to compensateYour brain stem will swellAs it swells into the foramen magnum of your occipital bone your medulla oblongata will compressWhen your medulla oblongata fails your heart will stop and you’ll stop breathingWater intoxication - WikipediaKDND - Wikipedia",
            "date": "Answered September 6, 2017",
            "views": "125",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gage H. Leibman",
                    "user_href": "/profile/Gage-H-Leibman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marius Gorvett",
                "href": "/profile/Marius-Gorvett"
            },
            "answer_text": "Water or dihydrogen monoxide can kill people in many ways. Excess consumption can dilute various nececery minerals and suchlike.It's fatal if inhaled.Insufficient or non consumption can kill you in 3–4 days.It's the major component of acid rain.It can cause severe burns - in the McDonalds coffee case water was the main ingredient.It's corrosive in the landscape and causes rusting of iron, just imagine what it would do to a body.It's been found in cancerous tumours.Water contains high levels of hydrogen which is also used in hydrogen bombs.Prolonged uncovered exposure to its solid form causes tissue damage and can cause death.It has a ph of 7 that's higher than any other acid.",
            "date": "Answered September 5, 2017",
            "views": "160",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Thomas Davis",
                    "user_href": "/profile/Thomas-Davis-82"
                }
            ]
        }
    ]
}