{
    "title": "How to earn money in this lockdown period - Quora",
    "tags": [
        "Advice About Making Money",
        "Lockdowns",
        "Financial Advice",
        "Making Money Online",
        "Wanting and Making Money",
        "Personal Finance",
        "Money"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mashuque Raza",
                "href": "/profile/Mashuque-Raza-1"
            },
            "answer_text": "The corona virus pandemic isn’t just a health crisis – millions of people worldwide have also seen an impact to their jobs, whether in reduced hours, different working patterns, or losing work entirely. A third of people in the UK have been economically affected, with under-25s and women worst off. If you’re one of these people, you might be looking for methods to make ends meet. We’ve put together a handy list of 27 ways to make some additional money during the corona virus lock down – including everything from one-off tasks to ideas that may end up as an additional income stream even after the lock down has been lifted.  1 Check for government schemes and plans There are a huge number of government plans created to support people who are in financial hardship because of the lock down. Look up your local options and make sure that you’re taking advantage of everything that you’re eligible for. In the UK, this includes furloughed wages if you’re employed or a taxable grant if you’re self-employed and submitted a filed tax return for 2018/2019. While this isn’t necessarily ‘making money’ it’s an essential first step if you need to make up lost income. For more info, check out our blog on what to do if you’ve been made unemployed due to corona virus. 2 Get paid to write online If you’ve always wanted to be a writer, what better time to start than during lock down? While a lot of online writing jobs don’t pay, there are still quite a few websites where you can make money by creating high quality, relevant content. You can get started by looking at: List verse: a listicle website that will pay $100 per accepted article.Long reads: a long-form content site that pays competitive rates. The website doesn’t specify the amount paid but other websites and blogs have stated rates of $500-$1,500.Back2college: a site aimed at older students will pay $55+ per accepted article.All Pet Voices: a pet website that pays $75 per accepted article.iWorkWell: a website for HR professionals and SMEs that pays $200 per accepted article.Loaded Landcapes: a photography website that pays $20-150 per accepted article.Income Diary: a website focussed on making money online that pays $200-$500 per accepted article.A Fine Parent: a parenting website that pays $75 per accepted article. All of these sites only pay for accepted articles, so make sure that you review their criteria and read through the websites for an idea of their existing content and style before you start. Some websites also prefer to receive pitches before the main article. While a lot of freelance writers have regular clients, writing for some select websites allows you to build up a portfolio, create a niche, and work up to higher-paying and more reliable income, if that’s something that you want to pursue. 3 Become a virtual assistant If you’re a good communicator, have strong digital skills, and excellent organisational skills, you could work as a virtual assistant. You will need to accurately type at a speed of 80-100 wpm, work well remotely, and adjust to the needs of the business or person that you are assisting, but this is one of the more long-term and reliable options to make additional money during lockdown. There are a number of virtual assistant websites like Virtalent and 24/7 Virtual Assistants, offering $10-12ph and 20-120 hours per month. However, these websites typically require extensive experience within the sector before they will take you on. If you’re new to being a VA or PA, you can apply for jobs on jobs websites like Reed, TotalJobs, or Glassdoor. If you’d like to brush up on your skills or improve your CV before you apply, you can take some free courses that can help you get hired by improving your communication, growing your digital skills, or just learning how to write a great job application. 4 Have a clear-out If you’re sitting at home 23 hours a day, you might notice the clutter a lot more than usual. Luckily, online auction sites and retailers are still open so you can follow lockdown rules while turning your unwanted belongings into cash. Some sites even offer collection from your door during lockdown.  These websites are a great place to start once you’ve identified the items you’d like to sell: Ebay is a great place to sell anything from garden furniture to old clothes and shoes.Webuybooks will buy books, CDs, DVDs, and games.Music Magpie will buy phones, MacBooks, CDs, DVDs, games, books, and lego.Cex will buy phones, laptops, game consoles, DVD players, smartwatches, assorted tech, and DVDs/games.5 Get crafty Some people have managed to discover new hobbies during lockdown, or remember old projects. If you’re into arts and crafts, you could turn that hobby into an additional income. You can make your own jewellery, homemade cards, print t-shirts, upcycle things around the house, or even make beautiful terrariums to sell on sites like Etsy. Not all crafts sell well or will make a profit, so before you get started it’s a good idea to check out what’s already on there, how much it sells for, and compare it to what you’d expect for the time, effort, and spend associated with it. You can also see how much competition there is, and decide how you will make your own crafts stand out. 6 Make money by taking surveys If you’d prefer a lower investment in both time and expense, you can make money by responding to surveys online. You can even do this while you’re binge-watching Netflix. The rewards depend on the website – some offer vouchers but a lot of them also payout via PayPal or directly to your bank. While it is relatively low-effort, it can also time quite a lot of time to build up your earnings – surveys pay as little as £0.05 and as much as £10 each, with the majority towards the lower end of the spectrum. You can get started with sites like YouGov, Prolific, Swagbucks, LifePoints, Survey Junkie, and OneOpinion. 7 Rent out your driveway If you have some driveway space and live in a busy area or city, you may be able to make an income from renting out that space. The need for additional parking may have increased in your area, as people are at home more during lockdown and need to park all their household vehicles at once. Websites like Just Park or Your Parking Space make it easy to find people who are looking for parking spots, and take a lot of the confusion out of admin and managing this additional income stream. 8 Rent out your car If the public transport in your area is on a skeleton service or people in your neighbourhood need to make larger purchases, you could also make money by renting out your car. Websites like Get Around help to connect car owners with potential renters. If you’re considering this, it’s important to weigh the risks against your own situation as car surfaces can hold bacteria and viruses well after people have returned the rental. 9 Try online tutoring Now that schools and colleges have closed, there’s been a huge increase in parents looking for online tutors for their children. If you have in-depth knowledge around a particular subject, great communication skills, and feel that you have the right temperament to keep your students engaged and nurture their interest, you can apply to a variety of online tutoring websites that link up tutors with students. Some focus on academic subjects but others offer the chance to teach music, crafts, and other skills. If teaching for the first time feels daunting or you don’t know where to start with a lesson plan, we have a range of free courses specifically designed for teachers. They can help you become a better music teacher, plan a great English lesson, or provide a grounding in how to teach online. 10 Sell your photographs If you’re interested in photography or have lots of photographs on your hard drive, why not try selling them online? Businesses are creating a lot more online content at the moment, so the right images and themes could help you earn some money. Rather than uploading a lot of landscapes and only selling what you have, take a look at the kinds of images that business websites, news websites, and blogs have been using over the last few weeks. Try to shoot images around those themes and stay on top of what’s in demand at the moment. Stock photography sites like Shutterstock, Alamy, Getty, and iStock take a commission from sales and allow people to find your images based on keyword searches. 11 Switch bank accounts Switching bank accounts can be a pain, but a lot of high street banks offer switching bonuses for people who move and for people who recommend banks to their friends. Some of the accounts require a minimum monthly deposit, but others don’t have specific requirements. You can see recommendations and compare your options on websites like Love Money. 12 Make sure you’re getting rewards and cashback While you’re reviewing your bank account, make sure that you’re registered for rewards and cashback wherever possible. Some bank accounts offer cashback on spending, and you may be eligible for rewards schemes. If not, you can still register for schemes that let you get cashback when you spend online via sites like QuidCo. 13 Get paid to test websites You can make money by testing out websites and letting businesses know whether or not they’re user-friendly. Small adjustments can make a lot of money for people selling online, so it makes sense for them to get opinions from their target audience, rather than just their own marketing and development teams. You can get paid $5-$90 per test or interview, but most tests are around $10 and will be paid directly into your PayPal.  You can get started with these sites: User TestingUserlyticsTry my UIUserfeelYou don’t need to be a digital expert to make a good tester, you just need to answer the questions honestly and understand what you’re looking for. But if you’re interested in brushing up on your knowledge, we have a free user experience course from Accenture to help you understand the questions and decision-making process. 14 Make money by staying healthy If you wanted to lose weight during lockdown, you can stay on track and actually get paid for it. My Achievement works with a variety of popular fitness apps and gives you points for anything from logging diet information and taking surveys through to exercising or meditating. You can earn $10 for every 10,000 points and choose from activities based on the number of points they give you. You’ll also be contributing to health research while you do it. 15 Get paid to transcribe audio Transcription has always been a popular job to do from home – pay tends to start at $20 per audio hour, and how quickly you can transcribe will define the pay per hour worked. The increase in online video content has fuelled a rise in demand for transcription services, but speech to text software is also getting better so it can be a tough industry. Websites such as GoTranscript and Transcribe Me can help you to get started. 16 Start a blog or website Popular websites and blogs earn hundreds if not thousands through affiliate marketing, advertising, and brand partnerships. Now that everybody is at home during lockdown, lots of websites are seeing a boom in traffic and it could be a good time to build an audience. Creating a blog that makes money definitely isn’t a short-term fix, but it could provide income over the long-term if you’re dedicated and willing to learn how digital marketing works. Most successful blogs either get the majority of their traffic through organic search (via a process called SEO) or via social media by building a quality following. If you’re not sure where to start, we have some free courses on digital marketing, social media, and web analytics to help. 17 Become a delivery driver It’s no secret that there’s a huge demand for delivery drivers at the moment – both to deliver online shopping for food delivery services. Despite tough prospects across a range of industries, there is still a huge need for delivery drivers but it is one of the riskier ways of making money given current transmission rates.  If you’re considering this option, it’s important to consider your risk category and the risk to others in your household. 18 Publish a book on Kindle In 2019, Amazon paid over $300 million to self-published authors on its Kindle platform. While it’s a very competitive marketplace, it has been incredibly lucrative to those who have managed to build a following and gain additional income from Kindle Unlimited. The financial barriers to entry are low and you can decide how much you charge for your books. If you like the idea but you’re not sure where to start, we have a free course to help you start writing fiction. 19 Become a clickworker Clickworker is another website that offers gigs and tasks that you can do at home. The site states that you make an average of $9 per hour but may be able to make more than that with time. The tasks include everything from categorisation to recording audio, so you should be able to find something that you’re comfortable with. 20 Check if you’re due a student loan rebate A total of £308 million was overpaid to The Student Loans Company in 2009/2010 and 2017/2018 and while most of it has been refunded, around a tenth was still waiting to be claimed in early March. If you haven’t had a letter from the company recently and suspect they have an old address on the system, it’s worth getting in touch to see whether you’re due a rebate. You can call The Student Loans Company directly and go through their security questions to make sure that your file is up to date and see whether you’re owed any money. 21 Put up some gigs on fiverr Fiverr is a freelancing marketplace that used to advertise the majority of tasks for $5. The current marketplace is less restrictive, but the expectation is typically that people will pay $5-20 for anything from marketing tasks through to relationship advice. You can browse the categories to see what’s on offer before deciding on what you want to advertise. Most of the work is bespoke, but if you want to scale your earnings it’s a good idea to advertise work that you’ve already done, such as creating a guide or ebook that people can buy as a pdf. 22 Get paid for your music opinions If you’d like to listen to some new music while you make money, Slice the Pie is a good place to start. You get paid to listen to at least 90 seconds of a track and review it. The pay rates depend on your star rating (which increases with the number of reviews you submit) and the number of words in your review. Unfortunately, your 2 cents aren’t paid much more than that, so it takes a long time to build up enough money to withdraw but it may be one of the more enjoyable activities on this list. 23 Become a dog walker Animal lovers can make friends with some new dogs and earn money too. Although people are at home on lockdown, some people may have to still work long hours or be unable to take their dogs out, so there are still opportunities to get dog walking gigs. Just make sure that you follow social distancing rules when picking up your canine companions and throughout the walks too. 24 Sell your story If you’ve lived through some unusual experiences, you may be able to make money from your story. Magazines and websites will pay for everything from extreme weight loss through to family drama and first-person accounts of dramatic incidents. Options like Real People Mag focus on more extreme events and pay up to £2,000 for featured stories. There are also groups like FeatureMe! on Facebook which feature journalists offering slightly less (typically £100-£500) for smaller features and less shocking stories. 25 Get paid to solve problems for businesses Businesses often need outside help solving problems or improving their products, which is where corporate problem solvers come in. Problem solvers need detailed knowledge of their subject and an innovative approach, but can earn $20,000-$100,000 for their solutions, as well as professional acclaim. You can register with websites like InnoCentive to review current challenges and submit your solutions – the subjects range from medicine through to tech and product design. 26 Take part in psychological experiments When you hear ‘psychological experiment’ you may think of things like the Stanford Prison Experiment but tests taking place today are very different to those in the 1970s; you can get paid for anything from taking online questionnaires through to having your eye movements tracked when looking at paintings. Universities typically recruit students but they’re open to non-students as well. You can see Bristol University’s current experiments here – many of them can’t be completed with social distancing in place but some are available remotely and during lockdown. If you’re interested in just learning a little more about psychology before diving into an experiment, you can take a range of free psychology courses (including intros aimed at beginners) with FutureLearn. 27 Change careers It’s a difficult time for a lot of industries. Some jobs work easily from home and the lockdown doesn’t affect them as badly, while others may still take weeks or months to recover even after lockdown is lifted. If you’re concerned about your industry or want to reskill, this may be a good time to consider your options. While changing careers often comes with a drop in pay, you may be able to move to a more lucrative field and regain lost earnings quickly. This may not help to make money specifically during lockdown, but it could be a long-term investment in your future. We have a variety of free courses for people who want to change career. They can help you test out whether that career move is really for you, and get started on your new CV. You can also explore our interactive career mapper, to help set you on the right path. ",
            "date": "Answered May 10, 2020",
            "views": "23",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Miranda Gamboa",
                    "user_href": "/profile/Miranda-Gamboa-2"
                },
                {
                    "user_id": "Mayank Singh",
                    "user_href": "/profile/Mayank-Singh-727"
                },
                {
                    "user_id": "Suraj Pandey",
                    "user_href": "/profile/Suraj-Pandey-721"
                },
                {
                    "user_id": "Dorin Cojocariu",
                    "user_href": "/profile/Dorin-Cojocariu"
                },
                {
                    "user_id": "Tajammul Hussain",
                    "user_href": "/profile/Tajammul-Hussain-19"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lovepreet Kaur",
                "href": "/profile/Lovepreet-Kaur-936"
            },
            "answer_text": "1 Get paid to write online If you’ve always wanted to be a writer, what better time to start? While a lot of online writing jobs don’t pay, there are still quite a few websites where you can make money by creating high quality, relevant content. You can get started by looking at: Listverse: a listicle website that will pay $100 per accepted article.Longreads: a long-form content site that pays competitive rates. The website doesn’t specify the amount paid but other websites and blogs have stated rates of $500-$1,500.Back2college: a site aimed at older students will pay $55+ per accepted article.All Pet Voices: a pet website that pays $75 per accepted article.iWorkWell: a website for HR professionals and SMEs that pays $200 per accepted article.Loaded Landcapes: a photography website that pays $20-150 per accepted article.Income Diary: a website focussed on making money online that pays $200-$500 per accepted article.A Fine Parent: a parenting website that pays $75 per accepted article.Become a virtual assistant If you’re a good communicator, have strong digital skills, and excellent organisational skills, you could work as a virtual assistant. You will need to accurately type at a speed of 80-100 wpm, work well remotely, and adjust to the needs of the business or person that you are assisting, but this is one of the more long-term and reliable options to make additional money. There are a number of virtual assistant websites like Virtalent and 24/7 Virtual Assistants, offering $10-12ph and 20-120 hours per month. However, these websites typically require extensive experience within the sector before they will take you on. If you’re new to being a VA or PA, you can apply for jobs on jobs websites like Reed, TotalJobs, or Glassdoor. If you’d like to brush up on your skills or improve your CV before you apply, you can take some free courses that can help you get hired by improving your communication, growing your digital skills, or just learning how to write a great job application. 4 Get crafty If you’re into arts and crafts, you could turn that hobby into an additional income. You can make your own jewellery, homemade cards, print t-shirts, upcycle things around the house, or even make beautiful terrariums to sell on sites like Etsy. Not all crafts sell well or will make a profit, so before you get started it’s a good idea to check out what’s already on there, how much it sells for, and compare it to what you’d expect for the time, effort, and spend associated with it. You can also see how much competition there is, and decide how you will make your own crafts stand out. 5 Make money by taking surveys If you’d prefer a lower investment in both time and expense, you can make money by responding to surveys online. You can even do this while you’re binge-watching Netflix. The rewards depend on the website – some offer vouchers but a lot of them also payout via PayPal or directly to your bank. While it is relatively low-effort, it can also time quite a lot of time to build up your earnings – surveys pay as little as £0.05 and as much as £10 each, with the majority towards the lower end of the spectrum. You can get started with sites like YouGov, Prolific, Swagbucks, LifePoints, Survey Junkie, and OneOpinion. 6 Rent out your driveway If you have some driveway space and live in a busy area or city, you may be able to make an income from renting out that space. The need for additional parking may have increased in your area, so it’s always worth checking the current rates. Websites like Just Park or Your Parking Space make it easy to find people who are looking for parking spots, and take a lot of the confusion out of admin and managing this additional income stream. 7 Rent out your car If the public transport in your area is on a skeleton service or people in your neighbourhood need to make larger purchases, you could also make money by renting out your car. Websites like Get Around help to connect car owners with potential renters. If you’re considering this, it’s important to weigh the risks against your own situation as car surfaces can hold bacteria and viruses well after people have returned the rental. 8 Try online tutoring Now that schools and colleges have closed, there’s been a huge increase in parents looking for online tutors for their children. If you have in-depth knowledge around a particular subject, great communication skills, and feel that you have the right temperament to keep your students engaged and nurture their interest, you can apply to a variety of online tutoring websites that link up tutors with students. Some focus on academic subjects but others offer the chance to teach music, crafts, and other skills. If teaching for the first time feels daunting or you don’t know where to start with a lesson plan, we have a range of free courses specifically designed for teachers. They can help you become a better music teacher, plan a great English lesson, or provide a grounding in how to teach online. 9 Sell your photographs If you’re interested in photography or have lots of photographs on your hard drive, why not try selling them online? Businesses are creating a lot more online content at the moment, so the right images and themes could help you earn some money. Rather than uploading a lot of landscapes and only selling what you have, take a look at the kinds of images that business websites, news websites, and blogs have been using over the last few weeks. Try to shoot images around those themes and stay on top of what’s in demand at the moment. Stock photography sites like Shutterstock, Alamy, Getty, and iStock take a commission from sales and allow people to find your images based on keyword searches. 10 Switch bank accounts Switching bank accounts can be a pain, but a lot of high street banks offer switching bonuses for people who move and for people who recommend banks to their friends. Some of the accounts require a minimum monthly deposit, but others don’t have specific requirements. You can see recommendations and compare your options on websites like Love Money. 11 Make sure you’re getting rewards and cashback While you’re reviewing your bank account, make sure that you’re registered for rewards and cashback wherever possible. Some bank accounts offer cashback on spending, and you may be eligible for rewards schemes. If not, you can still register for schemes that let you get cashback when you spend online via sites like QuidCo. 12 Get paid to test websites You can make money by testing out websites and letting businesses know whether or not they’re user-friendly. Small adjustments can make a lot of money for people selling online, so it makes sense for them to get opinions from their target audience, rather than just their own marketing and development teams. You can get paid $5-$90 per test or interview, but most tests are around $10 and will be paid directly into your PayPal. 13 Make money by staying healthy If you want to lose weight, you can stay on track and actually get paid for it. My Achievement works with a variety of popular fitness apps and gives you points for anything from logging diet information and taking surveys through to exercising or meditating. You can earn $10 for every 10,000 points and choose from activities based on the number of points they give you. You’ll also be contributing to health research while you do it. 14 Get paid to transcribe audio Transcription has always been a popular job to do from home – pay tends to start at $20 per audio hour, and how quickly you can transcribe will define the pay per hour worked. The increase in online video content has fuelled a rise in demand for transcription services, but speech to text software is also getting better so it can be a tough industry. Websites such as GoTranscript and Transcribe Me can help you to get started. 15 Start a blog or website Popular websites and blogs earn hundreds if not thousands through affiliate marketing, advertising, and brand partnerships. Creating a blog that makes money definitely isn’t a short-term fix, but it could provide income over the long-term if you’re dedicated and willing to learn how digital marketing works. Most successful blogs either get the majority of their traffic through organic search (via a process called SEO) or via social media by building a quality following. If you’re not sure where to start, we have some free courses on digital marketing, social media, and web analytics to help. 16 Become a delivery driver It’s no secret that there’s a huge demand for delivery drivers at the moment – both to deliver online shopping for food delivery services. Despite tough prospects across a range of industries, there is still a huge need for delivery drivers but it is one of the riskier ways of making money given current transmission rates.  If you’re considering this option, it’s important to consider your risk category and the risk to others in your household. 17 Publish a book on Kindle In 2019, Amazon paid over $300 million to self-published authors on its Kindle platform. While it’s a very competitive marketplace, it has been incredibly lucrative to those who have managed to build a following and gain additional income from Kindle Unlimited. The financial barriers to entry are low and you can decide how much you charge for your books. If you like the idea but you’re not sure where to start, we have a free course to help you start writing fiction. 18 Become a clickworker Clickworker is another website that offers gigs and tasks that you can do at home. The site states that you make an average of $9 per hour but may be able to make more than that with time. The tasks include everything from categorisation to recording audio, so you should be able to find something that you’re comfortable with. 19 Check if you’re due a student loan rebate A total of £308 million was overpaid to The Student Loans Company in 2009/2010 and 2017/2018 and while most of it has been refunded, around a tenth was still waiting to be claimed in early March. If you haven’t had a letter from the company recently and suspect they have an old address on the system, it’s worth getting in touch to see whether you’re due a rebate. You can call The Student Loans Company directly and go through their security questions to make sure that your file is up to date and see whether you’re owed any money. 20 Put up some gigs on fiverr Fiverr is a freelancing marketplace that used to advertise the majority of tasks for $5. The current marketplace is less restrictive, but the expectation is typically that people will pay $5-20 for anything from marketing tasks through to relationship advice. You can browse the categories to see what’s on offer before deciding on what you want to advertise. Most of the work is bespoke, but if you want to scale your earnings it’s a good idea to advertise work that you’ve already done, such as creating a guide or ebook that people can buy as a pdf. 21 Get paid for your music opinions If you’d like to listen to some new music while you make money, Slice the Pie is a good place to start. You get paid to listen to at least 90 seconds of a track and review it. The pay rates depend on your star rating (which increases with the number of reviews you submit) and the number of words in your review. Unfortunately, your 2 cents aren’t paid much more than that, so it takes a long time to build up enough money to withdraw but it may be one of the more enjoyable activities on this list. 22 Become a dog walker Animal lovers can make friends with some new dogs and earn money too. If you’re available during day times, this could be a great option for you. Plenty of people ask dog walkers to come and look after their pooch during the week, which means it’s likely that you could still keep your weekends free. Or you could branch out into pet or even house-sitting for more income options. 23 Sell your story If you’ve lived through some unusual experiences, you may be able to make money from your story. Magazines and websites will pay for everything from extreme weight loss through to family drama and first-person accounts of dramatic incidents. Options like Real People Mag focus on more extreme events and pay up to £2,000 for featured stories. There are also groups like FeatureMe! on Facebook which feature journalists offering slightly less (typically £100-£500) for smaller features and less shocking stories. 24 Get paid to solve problems for businesses Businesses often need outside help solving problems or improving their products, which is where corporate problem solvers come in. Problem solvers need detailed knowledge of their subject and an innovative approach, but can earn $20,000-$100,000 for their solutions, as well as professional acclaim. You can register with websites like InnoCentive to review current challenges and submit your solutions – the subjects range from medicine through to tech and product design. 25 Take part in psychological experiments When you hear ‘psychological experiment’ you may think of things like the Stanford Prison Experiment but tests taking place today are very different to those in the 1970s; you can get paid for anything from taking online questionnaires through to having your eye movements tracked when looking at paintings. Universities typically recruit students but they’re open to non-students as well. You can see Bristol University’s current experiments here – a lot of universities run experiments if they have a psychology faculty, so just check at your local college or university to see if it’s an option. If you’re interested in just learning a little more about psychology before diving into an experiment, you can take a range of free psychology courses (including intros aimed at beginners) with FutureLearn. 26 Change careers If you don’t feel the same sort of passion for your work that you used to, or perhaps the industry is not as healthy as it once was, it may be a good idea to consider a career change. While changing careers often comes with a drop in pay, you may be able to move to a more lucrative field and regain lost earnings quickly. This may not help to make money immediately, but it could be a long-term investment in your future. We have a variety of free courses for people who want to change career. They can help you test out whether that career move is really for you, and get started on your new CV. You can also explore our interactive career mapper, to help set you on the right path. ",
            "date": "Answered August 7, 2020",
            "views": "361",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Siddharth Raj",
                    "user_href": "/profile/Siddharth-Raj-52"
                },
                {
                    "user_id": "Misbah Khan",
                    "user_href": "/profile/Misbah-Khan-377"
                },
                {
                    "user_id": "Amy Vinx",
                    "user_href": "/profile/Amy-Vinx"
                }
            ]
        },
        {
            "author_info": {
                "name": "Buddy Media",
                "href": "/profile/Buddy-Media-1"
            },
            "answer_text": "As you know the situation is becoming tenser and people all overThe world are so afraid to come out from their house. And so you know that all over theworld people are going to stay athome for more than a month withoutdoing anything. So today I’ll give u a tip to let youearn plus also to give tips to thosepeople who are at home. So let’s get started Tip for you to earn money from home during this lockdown: 1: Become a gaming Streamer If you are a gamer you will knowhow people are watching peopleplaying games live. Millions of people started watchinglive so that they can learn and alsohave fun. So if you really want to start thenthere is a popular website calledTwitch which is one of the mostpopular in gaming. There are about 14 to 15 million dailyviewers who come and watch peopleplaying games. But my recommendation for you ifyou want to start streaming as agamer you must have at least i5processor, 8 Gigabytes of ram,stronggraphic card and a good internetconnection. You might be questioning that thereare lots of popular streamers whypeople will watch my live streamright? But my answer to you is that gamingstreamers live is not about how goodyou play or how well you talk. It depends on how well you entertainthem. Imagining that you are a professionalgamer but you don’t entertain thepeople you only focused on playing,do you think people will watch you?No, they will never watch your livestream. People nowadays love to watch thosestreamers who entertain them. So all you have to do is set up theroom for streaming and during livestreaming always remember to behumble, friendly and interactiveand always treat people like a star. So let’s get to the earning part howstreamer earns money There are lots of ways they earn one Twitch affiliatesIn order to qualify to join the affiliateprogram, you will have to meet somecriteria. But once you meet those criteriatwitch will automatically invite youand you will become a member ofthe twitch program. After becoming a member you will earn money when people subscribeyou not only that but people willalso pay you bits and you can alsosell in-game items. Twitch Subscription, Video Ads,donations,Affiliatelinks, Sponsoreship and many other ways you can earn. Once you have a group your audienceearning money will be no problemfor you. And also once you start streamingyou will get to know all the termsand conditions of twitch. 2: Become a YouTube You watch YouTube and you knowhow it is, how people earn, whattype of video people make etc. You might be asking yourself “what type of video I will make”. It is simple I have given you an ideai.e. entertained others during thislock down, you can make videobased on that. Things to keep in mind while uploadingthe videos: The title: Write a title which will beeasier to find by people. Description: You will have to write agood description so as to attractpeople. Tags: Always remember to put tagswhile uploading a video and alsowhile writing a tags do write thekeywords which are related to yourvideos. Thumbnails: let me ask you onequestion “while watching YouTubevideos do you click those videoswhich have poor quality imagethumbnails?No right you search for qualitythumbnails right.So always try to put a qualitythumbnail into your videos. How youtube earns money: YouTube earns money by showingads in videos, sponsorship, affiliatelinks etc. But to earn money on YouTube youmust have at least 1000 subscribersand 4000 watch hours. But you know the situation most ofthe people are at home doingnothing and if you have qualityinformation or entertain them. It will be easy for you to get subscribers. ",
            "date": "Answered March 29, 2020",
            "views": "2",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Arup Sarkar",
                    "user_href": "/profile/Arup-Sarkar-41"
                },
                {
                    "user_id": "Preeti Talreja",
                    "user_href": "/profile/Preeti-Talreja-9"
                },
                {
                    "user_id": "Zisan Ali",
                    "user_href": "/profile/Zisan-Ali-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tamika Nicholson",
                "href": "/profile/Tamika-Nicholson-4"
            },
            "answer_text": "I’ll show you a few ways to make money and also if you are interested I can show you a method that I found that has free training to make $500 to $1,000 daily, just email me at nicholsont205@ gmail.com But other ways you can make money online without youtube or blogging are: Setting up an e-commerce store E-commerce stores are the same as Amazon. Collect vast amounts of products that people can buy online. If you have a blog, especially a WordPress blog, you can install an e-commerce store directly on your existing site. This store may sell its own products, receive full profits, or consist of affiliate products (or both). The following plug-ins allow you to install an e-commerce store on the WordPress website. WP E-CommerceWooCommerceJigoshopGet Free Lottery TicketsHitting a big jackpot could solve a lot of your problems right now. It’s tempting to buy those scratch-off tickets from the gas station. But that’s not the best use of your money when you’re in a bind. Instead, try scratching for free using an app called Lucktastic. Each day, it releases a new assortment of digital scratch-off tickets. Lucktastic says instant wins range from $1 to $10,000, in cash or gift cards to popular retailers. The app is supported by advertising, which allows it to keep the payouts high and the games free. It’s not guaranteed money, but at least Lucktastic is free to play. And hey, somebody’s gotta win. Take single dad Oneil Campbell, from Boston. He was shocked when he won a $5,000 Lucktastic prize. “I didn’t see that one coming,” Campbell says with a laugh. “I really didn’t. This is something good that happened to me at the right time — when I can really use it.” Search Your Wallet and Cash in on Your Dollar BillsSpecifically, dollar bills with strange serial numbers — ones that aren’t easy to come by. The collectors at CoolSerialNumbers.com - Home will pay you big bucks if you have a bill with a rare sequence in your wallet.Turns out antique coins aren’t the only currency worth cash to collectors. Check out their website for a full list to see if you’ve got any of these rare bills, but here’s a rundown of the sort of serial numbers these collectors are looking for: 7 repeating digits in a row on $1 Federal Reserve Notes (i.e. 09999999, 77777776)7 of a kind on $1 Federal Reserve Notes (i.e. 00010000, 99999099)Super repeaters on $1 Federal Reserve Notes (i.e. 67676767)Double quads on $1 Federal Reserve Notes (i.e. 00009999)and more!Earn $225/Month By Watching Cooking VideosIf we told you that you could get paid to watch videos on your computer, you’d probably laugh.It’s too good to be true, right? But we’re serious. A website called InboxDollars will pay you to watch short video clips online. One minute you might watch someone bake brownies and the next you might get the latest updates on Kardashian drama. All you have to do is choose which videos you want to watch and answer a few quick questions about them afterward. No, InboxDollars won’t replace your full-time job, but it’s something easy you can do while you’re already on the couch tonight wasting time on your phone. Unlike other sites, InboxDollars pays you in cash — no points or gift cards. It’s already paid its users more than $56 million. It takes about one minute to sign up, and you’ll immediately get a $5 bonus to get you started. ",
            "date": "Answered September 18, 2020",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ahamdi Abarikwu",
                "href": "/profile/Ahamdi-Abarikwu"
            },
            "answer_text": "While lots of schemes on the internet which promise to give you an opportunity to earn some money from home end up being scams or at best, reward you with so little for so much effort, there are a few that are genuine and that keep to their promise. One of such reliable schemes, which I have regularly patronized to earn myself some cool money during this lockdown, is Winplay.app. Winplay.app is a platform that gives you an opportunity to create awareness about cryptocurrencies, blockchain projects, crypto exchanges etc, while rewarding you with valuable crypto tokens for your efforts. You can easily trade the tokens you earned on any exchange where the token is listed, and make some money as a result. How does Winplay.app work? Winplay.app makes available easy tasks that you can do to earn points. Usually, the more points you earn by completing as many tasks as possible, the higher you climb on the Leaderboard which will give you a chance to earn higher rewards at the end of the campaign. Some of these tasks include Twitter share, Facebook share, Article Creation, Video Content creation, Twitter follow etc. For example, a campaign currently ongoing, which will end in a couple of hours, is the Noia 350,000 NOIA Giveaway.  This particular campaign promotes the NOIA blockchain project, and rewards the top 500 participants with a total of 350,000 NOIA tokens. To earn money on the Winplay platform, simply click on the Winplay website, and sign up for an account with your email address.  Then verify your phone number through either Telegram or Whatsapp.  After successful verification of your phone number, a confirmation link will be sent to your registered email address. Click on that link to verify your account. Once you have done that, your account becomes fully activated, and you will gain access to the platform where you will be able to join any available giveaway campaign, do simple tasks, play mini games and take part in a lucky draw etc to win points. Earning money through the Winplay platform is easy, and I have participated in at least fifteen (15) Giveaway campaigns where I won for myself a good amount of crypto tokens worth more than $700 in all. ",
            "date": "Answered May 21, 2020",
            "views": "19",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chandrabahadur Thapa",
                    "user_href": "/profile/Chandrabahadur-Thapa-1"
                },
                {
                    "user_id": "Abiola Adewoyin",
                    "user_href": "/profile/Abiola-Adewoyin-1"
                },
                {
                    "user_id": "Tajammul Hussain",
                    "user_href": "/profile/Tajammul-Hussain-19"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexander Stoyanov",
                "href": "/profile/Alexander-Stoyanov-24"
            },
            "answer_text": "We live in a moment where making money online has become a necessity rather than just an option to explore. The world is headed towards a digital, and technological shift, which means that many of the traditional ways of making money are becoming obsolete. Many brick and mortar businesses shut their doors for good, and over the years this has proven to be an uprising trend. It’s happening all over the world, and we can't stop it, so we might as well learn to adapt to it. Learn Something New  It’s time to learn a new skill. More specifically, it’s time to learn a DIGITAL skill. Something that can be done from the comforts of your own home, and is IN DEMAND, right now. There are many options to choose from, but I will be focusing on the ones that have the highest potential of creating a full-time online income (in my opinion). You can learn more about my favorite choice here. Before I get into that, there is something important that I want to mention first. Avoid Online Scams  You see, there are many online scammers and low-quality services out there that can mislead people into thinking that they can make a lot of money fast and easy without actually putting in the work. Basically they promise a lot but deliver nothing. I’m only saying this because right now there’s a lot of people who are trying to take advantage of all the panic that’s going out in the world, to try and make a quick buck out of unsuspecting people, and scam them out of their money. If you come across something that sounds too good to be true, that’s because it probably is. How To Make Money Online  There are many different ways of making money online, here are some of them. Become a Freelancer. If you already have some digital skills that are in demand then this can help you a lot. If not, well maybe it’s time to learn. You should know that this has become an extremely competitive field so you would need to stand out in order to land gigs on a consistent basis. Many bloggers and digital marketers outsource portions of their work because it can be difficult to be on top of everything all of the time. You can become a content writer for blogs, and get paid for that. On the other side of the coin, you can choose to learn the skills of affiliate marketing, and combine that with blogging. This can open the doors for a long-lasting and sustainable passive income stream. It is a skill, so it takes time to learn, and become good at it, just like anything else in life. But if you’re willing to put in the effort, it can be well worth it. By taking advantage of this digital shift, you can put yourself right in the middle of all the money being spent online, and take a portion of that for yourself. The income potential is huge, and the great thing is that you don’t even have to be good at selling things to people. In fact, you don’t even have to talk to them. All you have to do is learn how to identify what people are searching for online and provide them with a virtual “bridge” that will take them to exactly where they want to be.[1] Footnotes[1] Become The Next Online Success Story | Wealthy By Default",
            "date": "Answered July 13, 2020",
            "views": "337",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Misbah Khan",
                    "user_href": "/profile/Misbah-Khan-377"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shine Akhila",
                "href": "/profile/Shine-Akhila"
            },
            "answer_text": "This lockdown period has restricted people all over the world into the 4 walls of their house, they are forced to stay inside, does that make, their source of income is also restricted, absolutely no. So what if you cannot go out, we are living in an era where we have this awesome technology, called internet, we can earn as much money as we want in a legit way. Freelancing: Look for platforms online such as Fiver, Freelancer, Upwork where you can work as freelancer and earn money per project which you undertake. Surely it will take some time to get your first project, but once you start getting clients, you build your own network. Blogging: You can start a side hustle to get extra couple of dollars in your pocket by writing blogs online. You choose a niche you are interested in ad get started, blogging is a very good way to earn passive income for life. If you don’t want to buy a domain, hosting, or website builder, simply go to Blogger.com - Create a unique and beautiful blog. It’s easy and free . Try it out, you can write blog in any language you want and explore the field. YouTube: Start your own YouTube Channel and build trust with your audience, provide value to them and earn passive income. Once you successfully establish yourself in there, go for monetization.Monetization is when Companies create advertisements that get placed at the beginning of your videos and you get paid simple. Start Your Own Business: If you had a small business plan online, and you left that idea long back to work a 10am to 7 pm job, than now is the time to take a step and implement that business plan. If you have no budget, than see if there is a way to start your business for free and give it a try. Now is the time to take step and build your own name in the market, don’t hesitate, whatever legit idea and method you think you can make money with, give it a try. ",
            "date": "Answered September 27, 2020",
            "views": "72",
            "upvotes": " Answer requested by Baby Dubey",
            "upvoters": [
                {
                    "user_id": "Georgy Giko",
                    "user_href": "/profile/Georgy-Giko"
                },
                {
                    "user_id": "Ginny Leow",
                    "user_href": "/profile/Ginny-Leow"
                },
                {
                    "user_id": "Rich Campbell",
                    "user_href": "/profile/Rich-Campbell-6"
                },
                {
                    "user_id": "Marlene Braxton",
                    "user_href": "/profile/Marlene-Braxton"
                },
                {
                    "user_id": "Peter Caravette",
                    "user_href": "/profile/Peter-Caravette"
                },
                {
                    "user_id": "Al Hassane TOURE",
                    "user_href": "/profile/Al-Hassane-TOURE"
                }
            ]
        },
        {
            "author_info": {
                "name": "Julianne McCarthy",
                "href": "/profile/Julianne-McCarthy"
            },
            "answer_text": "In the U.S. there is an app called NextDoor. It’s a social platform for neighborhoods to communicate with each other (e.g.,for sale items, neighborhood news/posts, etc.). Membership is free and specific for each neighborhood - you can only join the neighborhood you live in. You can make a post about looking for work and some of your neighbors might reach out to hire you for gig work. Neighbors seem to be more willing to help support people in their own neighborhood. One neighbor put up a post asking for kids willing to be sidewalk chalk artists, and offered them $20 each to create uplifting, positive artwork. You can also do this same thing on Facebook Marketplace. GIG WORK IDEAS: Lawn mowing and yard maintenanceCar washingGrocery shopping servicesFruit harvesting. Many trees are bearing fruit right now - offer a service to pick these and bag the fruit for them. You could also negotiate to keep a portion of the harvest for your family.Sell some of your unneeded items on Facebook Marketplace or NextDoorAre you creative? You can buy materials online and open an Etsy shop to sell your wares. Treat it like a real business and it can help you out. I’ve done this before and was surprised. This can be real money if you put the effort in.Do you speak another language? Maybe you can offer private language tutorials and translation services.Just offer general help for hire, and neighbors will tell you what they needThink of anything you’re decently good at and see if you can turn it into a service to help people that they’d be willing to pay for. Outside of that, you can create a business if you have extra spare time and some ideas. Now may be as good a time as ever to brainstorm and try your hand at something you’ve been thinking of or a new venture. You can take online courses to qualify you for some jobs that you may be able to do remotely. These might not be the best or most ideal options, but it’s a start to get the wheels turning. ",
            "date": "Answered April 4, 2020",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shaziya Hasan",
                "href": "/profile/Shaziya-Hasan-5"
            },
            "answer_text": "Hi, see there are a lot of options you can try. As one can’t go out, the advantage of working from home has emerged for many people. Like if a person doesn’t lives in a remote area and doesn’t want to go somewhere for joining, it is a good opportunity. So, I am going to tell earning practices one can do in lockdown. Freelancing: Freelancing is really good platform which pays off quite well. One can start freelancing on websites like http://Freelancer.com , Fiverr, UpWork. These sites are legit and really pay well. There is a wide range of jobs like data entry, web design, conversion of word file to PDF format, and many more.Internships: You can apply for internships on platforms like Internshala and Futwork(Frapp). They also provide good options.Content Writing: Now-a-days, the demand for content and article writers have increased much. One can apply for content writing, Ghost writing, technical writing, and much more.Social Media Marketing: The craze of social media has increased extensively since past few years. Now, it has become a source of marketing also. Many companies need people who can handle their page and post content. So if you are a social butterfly, you can give it a chance.Paid Survey: There are many platforms which pay you hard cash for submitting some surveys. Many companies need review and for that they take survey to know the need of people. Websites like Swagbucks, Toluna Surveys, Google opinion rewards, and so on.I think that’s enough for now. There are many more options like affiliate marketing, blogging, marketing products on Meesho app, transcribing, proofreading. Although it’s a huge list but nothing is too huge is you make start. ",
            "date": "Answered July 14, 2020",
            "views": "166",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sumit Varma",
                    "user_href": "/profile/Sumit-Varma-11"
                },
                {
                    "user_id": "Shruti Aditya",
                    "user_href": "/profile/Shruti-Aditya-1"
                },
                {
                    "user_id": "Siddharth Raj",
                    "user_href": "/profile/Siddharth-Raj-52"
                }
            ]
        },
        {
            "author_info": {
                "name": "Xiuxian Du (Steven Dux)",
                "href": "/profile/Xiuxian-Du-Steven-Dux"
            },
            "answer_text": "IN THE WAKE OF THE CORONAVIRUS OUTBREAK AND SO MANY COUNTRIES GOING INTO SHUTDOWN, LIFE HAS CHANGED. The global coronavirus pandemic has been rampaging through the world affecting not just health, but economies and livelihood. It may or may not have affected you directly but indirectly, all our lives have taken quite a turn. According to reports, within the first week of April, 6.6 million Americans filed for unemployment. Global unemployment is already at 190 million. No matter which part of the world, the pandemic has dealt a catastrophic blow on the workforce. Some have completely lost work, while others are facing a loss of income because of less work, and the rest have immense work pressure. At this time, no one is really sure when the world will return to normal and that means this might continue for a while. At least for the foreseeable future, we are going to be in our homes. And since our work life has taken a complete u-turn, a lot of us are currently feeling lost, finding a lot of time on our hands, binging on Netflix, stuffing ourselves with junk food, and feeling completely restless! Does that sound familiar? I know, you’re also worried. You don’t know where the next paycheck is coming from and when. Financial security plays a huge part in our wellbeing and overall mood. Currently, you don’t know what is going to happen next and how you will take care of yourself and your family. On the other spectrum, if you’ve been able to transition your work online, you may find yourself working longer hours than usual. You may feel disillusioned, exhausted, and undervalued. You’re probably getting paid less than before, and you’re addled with all these sudden changes. You’ve been wondering if this is how you want to go on. Or do you want to make a change? How does one find work that doesn’t just pay well, but is also fulfilling (work you can do on your own terms?) Don’t lose hope because the digital world presents immense opportunities. During this global crisis, let’s try and make the best of the situation. In fact, the changes that this has brought about in your life could be the major transformation you need to propel your life forward. We can look at events that send us out of work as a huge disappointment, considering that we have to explore new career options, but the truth is that this could be the time for you to completely reshape your destiny. To get out of struggling for a paycheck each and every single month and instead create the lifestyle of your dreams. There’s a way for you to do this while at home, just with three to four hours a day. And the best part of it all is you can do it while spending time with your family and loved ones, AND while collect an unemployment check. Like I said, staying at home has become our new normal so we might as well start looking at how to work the situation to our advantage. HOW CAN YOU UTILIZE THE BENEFITS OF STAYING HOME RIGHT NOW? We are at a time in life when it is up to us to take control of our destiny. Even though we must stay home right now, it is up to us to take charge of our happiness. No matter what your background or your talents, there’s a silver lining to be found in staying home. Think about this: What if you could earn money staying at home? What if it’s something you can continue doing long after the lockdown is over? Wouldn’t it be amazing if you can start earning for your dream lifestyle right now and save up for traveling once the pandemic subsides? One thing this pandemic has made very clear is that a lot of us have the ability to work from home. While you’re staying home right now to survive a health crisis, eventually working from home might become the new norm. WHY YOU SHOULD BE GETTING INTO DAY TRADING RIGHT NOW While this might seem like a weird time to start a new career, there are actually plenty of reasons why you should. You need to breathe new life into your career. You are either stuck in a low paying, high-stress job, or suffering unemployment. In either case, you’re stuck at home mulling over the overhaul your life needs to take and stressing out even more because you have the time to. Well, now is the time to utilize YOUR time to make changes! Today!! Starting a career in day trading means you’ll spend at least a few months (to a year) learning the ropes and gaining knowledge. Make use of that time right away. You could spend your extra time right now binge watching Netflix or you could utilize it learning a skill that can change your destiny. I’m a true believer that you can learn anything if you put your mind to it. The economy may be uncertain right now, but your ability to gain new knowledge never will be. If I never got into day trading, chances are I would’ve been sent back to China after college. But I took a risk and decided to dive deep into the topic of day trading. I read every book I could read on the topic, studied graphs and took every single course possible. Through all of this research, I found a lot of stuff that didn’t work… But I did find eight strategies that continued to work time and time again. And with those strategies, I created a portfolio that has made over $5 million in the last five years. I went from having no career options to reshaping my entire life. And it’s not just me who has been able to do it! I have students who have replaced the income at their jobs, a few who have earned six figures a year day trading, and some who are earning seven figures each year. And while all of this may sound too good to be true, it’s really not the case. Day trading is a combination of math and basic human psychology. There are graphs you can look at that continue down the same patterns each and every single time. Some as consistent as 75 to 85%. That means that out of every 100 times you make a move on the same graph, you’re winning 85% of the time. When you think of the returns for that within a year, your income has the ability to compound significantly. A lot of investors look at earning 10% a year when they go and trade. And if you have a million dollars to go and put into the market, you’re looking at earning a clean $100,000 a year. But if you are starting out where you’re on unemployment or if you just have less than $10,000 in the bank, a return like that isn’t going to do anything for your career. That’s how I felt when I first started with my $27,000 investment. I knew that if I only got a return of $2,700 for the year, that I would be the first one to head back into a plane and get off on the next flight in China. I came here with limited knowledge of the English language and couldn’t really see myself finding an industry to make a lot of money in. I wanted to do real estate but I couldn’t wrap my head around the contracts. So I found something that I could understand, even with language barriers. I took a deep dive into day trading because numbers and graphs are universal and understandable, no matter what language you speak. And I’m so glad I did, because this industry completely changed the entire trajectory of my life. And just like it’s changed my life, I know it can change yours. Especially during this time, where people around the world are seriously considering a way to make extra money. Now the difficult thing about situations like this is it puts a lot of people into fear: Where fear and uncertainty makes you panic and become scared of what will come tomorrow…Where bills pile up and you fear you’ll lose your home and face financial collapse…The government is doing what it can to help with bailouts and stimulus checks. But this isn’t enough to get you a permanent situation to take control of your life. You need to put your family first and take the initiative to keep your family alive and breathing. Then get them to thrive. It’s your destiny to thrive. To stand out and overcome this adversity that came your way from this pandemic. To step up and reshape your entire destiny. It’s not going to be easy and it’s going to take a lot of studying and hard work, plus you’re going to need a mentor to guide your way. But before getting into all of that, let me first explain what a day trader does so you can see if this is the right career move for you to make. WHAT DOES A DAY TRADER DO? A day trader, as the name suggests, trades stocks within the same day i.e. buying and selling on the same day without carrying them to the next morning. This is often done multiple times a day. The objective is to earn small profits every day that stack up over time. And what they also do is they can flip things around and bet the other way. Where they see trends going downwards and they make a bet that the stock is going down (this is called short selling, or shorting). As an investor of five years and having studied the statistics relentlessly, the numbers have proven that 94% of day traders fail. That means only 6% of them are making money. And while that would scare off most people from trying to even get into the industry, let me explain why people fail like this. It’s because they get their emotions involved and wait for an upwards swing, thinking a stock is going to continue to go up. And then more people rally in on the ride up, thinking they’re going to get rich. While this all happens, there comes a tipping point where a stock starts to go down. And these novice investors who ride the emotional wave of getting rich start to panic. They sell their stocks or hold on too long, then get wiped out in the market. And this happens time and time again. How I make money, and how my students make money is that they look out for this exact same thing happening. Instead of riding the upwards trends, they ride on the downward trends. And when a stock falls, they are able to get a 25-35% return on their investment. With $3,000, you could look at getting a return of $1,000 on a trade like that. And if that continues to happen 75% of the time, you could see yourself quickly making a lot more money. But it takes a lot of practice, mentorship and paper trades to really get to that point. WANT TO BECOME A DAY TRADER? HERE’S HOW TO GET STARTED Now here’s why this is a crucial time in history. Never before have we collectively had as much time and the need to make a change in our lives. This is why I think now is the moment to get started in day trading and change your destiny. Now that the seed for day trading has been planted in your head, in order to change your destiny, you are wondering how to get started. Success in day trading doesn’t happen overnight. It takes time and patience. You need knowledge and skills. The accumulation of that knowledge is a time-consuming exercise that bears fruit at least a year down the line. Hence, this is not a get rich quick scheme. For new traders, this is what I suggest to help get you started with day trading: 1. KNOWLEDGE AND EXPERTISE: The time on your hands that we’ve been speaking of? This is where most of it should be going. The good news is, you’re contemplating making a change in your life during quarantine, you are reading about how to find a new career and your knowledge building process has already begun. You’ve come to the right place. Use this time to get yourself acquainted with day trading and its nuances. When I first started, I attended seminars and met other successful traders. I listened to their stories and studied their own techniques and patterns. It’s time for you to do the same so you can build your own wealth of knowledge during quarantine at home. 2. CAPITAL: In the beginning, it’s important you only invest what you’re able to (and willing to) lose. And right now that will be a crucial decision. I also recommend my students start with at least $3,000 of investment. You can start with less, but $3,000 gives you the leverage you need to build momentum. With this, you set yourself up for potential success from the very onset. Whereas if you start with less than this, you don’t give yourself enough room to work with. The money you make won’t give you the traction you need, and the commissions you have to pay will eat into most of your profits. So if you don’t have $3,000 that you can comfortably spare, begin saving now. In the meantime, study the markets, expand your knowledge, and create a Plan!! 3. CREATE A PLAN: This will be the beginning of a new career for you so start with a plan. Start prepared. Day trading is nothing less than a business. You cannot start blindly and hence you need to have a plan with strategy and goals. It’s crucial that this plan includes risk management and an exit strategy. As much as you’d want to owing to the time you have on your hands, you cannot jump into day trading and expect overnight success. Now that you’re at home, invest some time building a plan. Your plan must include the following: RISK MANAGEMENT: In order to become a seasoned, successful and profitable day trader, proper risk management is critical. Whenever I am mentoring newcomers, I notice that a lot of them don’t pay attention to risk management. Many of them assume that it will hold them back from success in day trading. It is actually the opposite! Proper risk management can actually set you up for success. Meticulous risk management ensures your losses remain small and don’t turn into big ones before you even notice. Determining how much risk you’re at ease with means calculating a profit/loss ratio, which is what you anticipate the profit will be versus what you might lose on a particular trade. Establish for yourself what the maximum percentage of overall capital you’re willing to risk is. Sticking with a 1% to 3% potential loss, the overall risk remains low and gives you room to make more trades in a day. I call this The 1% rule It signifies that the maximum risk you take is no more than 1 percent on a single trade. With several trades in a day, keeping risk at 1% means there’s more than enough leverage to provide ample returns while keeping any losses minimal. It’s impossible to be profitable with every single trade; hence one must be prudent enough to keep the losses low. GOAL SETTING: During your planning stage, figure out how much you want to earn by and when. Think for now and also beyond the quarantine time, whenever that will be. Having a goal in mind will help you work towards it. Should this be daily or weekly or monthly goals? There’s no correct answer, especially in uncertain times like now, so do what makes the most sense for you. Whatever you decide, make sure that your goals are realistic. If you’re keeping your risk at 1%, your goal for profit should be around 2% or more. Finalize percentages that work for you to keep you in this race in the long haul. PAPER TRADES: This final tip is a secret weapon! I will get into this in detail shortly. 4. TIME: At present, my workday consists 2-3 hours of day trading. Any more than this is overkill and unnecessary. It’s also where a lot of traders go wrong when they transition from a part-time trader into a full time one. Having said that, in the beginning, you need to invest A LOT more than 2-3 hours each day. You need to spend most of this time studying, planning, and experimenting. This is how you build a platform so in the future you only have to work 2-3 hours each morning. Again, most new traders get this all wrong. They jump into the trades and spend too much time trading and too little studying. This is how you fail. Building a new career happens from laying the groundwork. This begins for you now. And there has never been a better time in history to do this. 5. COMMITMENT: With everyone’s work-life in such great distress right now because of the quarantine, it’s more important than ever to commit to taking things into your own hands. You cannot get into day trading expecting to become an overnight sensation and making money right away. This is another reason most new traders fail. Taking a few courses and reading a couple of books is not enough. When you enter the world of day trading, you need to commit to it knowing it will take priority in your work life and become your major source of income in the future. That is how you will come out of this quarantine with a profitable career in your arsenal. In the beginning, you may get restless. You may feel discouraged. Take it one day at a time and see the results of your efforts gradually blossom. You need to see the bigger picture and appreciate that this is a process of building a skill. The results will come soon enough. 6. TECHNOLOGY AND TOOLS: The best way to use knowledge is to apply it using the right tools. No amount of knowledge will yield fruitful results if you don’t choose the right tools. To start with, you will need scanning software. During day trading, only some stocks are worth trading in. Identifying them correctly using a scanning tool is what changes the game. The next tool you will need is charting software. Charting is the process of watching asset prices move and take a call on when to trade. Charting software is used to create and view these charts and is a useful tool to understand market movements.. During the lockdown, you should take advantage of the numerous free trading tools available to you. These tools are significant for understanding the market, analysis, scanning for stocks to trade, and formulating your trading strategy. 7. A MENTOR: I wouldn’t say I have any regrets when it comes to my day trading career but it would have helped had I looked for a mentor It’s helpful to have a mentor guide you. I observed and spoke to a lot of people when I first got started, but I didn’t commit to a single mentor. If I had, my trading portfolio would be much larger now! A mentor gives you the right training to get started and get set up for success. Most importantly, a mentor guides you in developing your knowledge and skills so you can create your own techniques and patterns. The quicker you do this, the quicker day trading can become your primary source of income. This is how you will reshape your destiny and achieve new heights (even during a crisis). Get a mentor. Find someone you trust and follow their advice. The only piece you’re missing is the knowledge on how to do this specifically for trading. This is where your mentor comes in. START SMALL WITH PRACTICE! Want to know what would be the most significant thing you will do with all this time on your hands when it comes to being prepared for day trading? Practice. What if there was a way to practice day trading without the risk of losing your money? There is. It’s called Paper Trading. Paper trading allows you to buy and sell securities without risking your money. It is a kind of simulation. While you’re building your expertise and honing your skills, paper trading allows you the freedom to fail and learn new patterns. It will help you see what the real deal will be like! It’s a fantastic way to map out your strengths and weaknesses, play with new techniques and patterns, and manage your risk. I still use paper trades when testing new techniques. I recommend all my students do the same, especially in the beginning. In fact, I tell them to prepare for 12-months of studying the markets and experimenting with paper trades before they invest large amounts of money. It’s the secret weapon most successful day traders use. Once you learn how to do the same, you too can build a very successful portfolio. Your Next Steps… If you’ve read this far, it’s clear you’re frustrated with your work situation. The pandemic has taken a toll on your career! You give so many hours to your career yet it’s giving you sleepless nights. The monetary returns just aren’t enough. There is no financial security. It’s been a mission of mine to help people who want to make day trading their primary source of income. Now is the time for you to get started. Now is the time for you to build your own knowledge and expertise. The longer you wait, the longer you’ll remain frustrated during quarantine. Take charge of the situation! I hope you’ve found this valuable and I hope you are staying safe. We will get through this. ",
            "date": "Answered May 19, 2020",
            "views": "26",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Parul",
                    "user_href": "/profile/Parul-258"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chirag Parmar",
                "href": "/profile/Chirag-Parmar-472"
            },
            "answer_text": "Simple and interesting ways to make money during lockdown  COVID-19 pandemic lockdown has crippled our professional and social lives with most of us quarantined inside our homes.For all those who have got used to an active social life, confinement inside home can be a highly bothersome experience.If you are prepared to stretch that extra bit, here are a few simple, easy and interesting ways to make money during lockdown.COVID-19 pandemic has disrupted every sphere of human activity and has crippled the professional and social lives of almost everyone on the earth. Many countries have responded to the global health emergency by announcing lockdowns as a quarantine measure to control the spread. While it might be difficult for many to remain locked up inside the homes, there are ways to convert the free time available into an earning opportunity to get that extra cash for useful spends. Here are a few ways to earn moneyduring lockdown. Freelance Freelancing work opportunities let you work flexibly as per your choice across several domains like graphic designing, architecture, content writing, digital marketing and many others. Find out your expertise and interest and create an account with some job portals that offer freelancing job opportunities to make some much needed cash during lockdown. Teach online A lot of students are taking active interest in learning online. Register yourself with some online teaching website by uploading your profile and giving your subject preferences. If you are listed as a registered tutor online, your earnings can be from Rs. 200 to Rs. 500 per hour. Sell your used things and collectibles eBay is a great place to sell your used items and collectibles for a good price. Choose the option, ‘buyer collects’ so that you can handover the items safely to the buyer following the social distancing norms. Make masks The COVID-19 pandemic has created a huge demand for masks. Medical shops and retail stores are out of stock and masks are rare to find these days. Visit some sites and learn how to make masks the simple way and sell them for the local stores to make a handsome money. Get creative Many of us have a number of skills and talents. If you are good at arts and crafts, you can make some interesting things out of recycled material to sell them online. You can also set up a Facebook page or show your items on Pinterest to create an avenue for selling them. Summing up There are many other ways to make money from home during lockdown like taking online surveys, affiliate marketing, playing games for cash, and several others. You just need to do the little homework and decide what will work best for you. Once you figure out the right avenue, you have no restrictions to convert your extra time into some cash for some useful spends you have been waiting for. ",
            "date": "Answered September 22, 2020",
            "views": "96",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Syeda Simran Khatun",
                    "user_href": "/profile/Syeda-Simran-Khatun"
                },
                {
                    "user_id": "MD JIDAN MONDAL",
                    "user_href": "/profile/MD-JIDAN-MONDAL-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dilip Singh Parihar",
                "href": "/profile/Dilip-Singh-Parihar-3"
            },
            "answer_text": "Best way for the students to make money is to earn while they learn. Students should develop a good reading habit to improve their English and Vocabulary. One such way for students who want to make money online without investment is discussed below. If you want to earn money from some an online legitimate money making app then you can read further or quit. There are tons of ways to make money online but it need lil hard work at the initial stage. There are tons of websites and apps that claims and advertise that they are legit and really pays. Most of them are scams. Only few are real. Yes, there are plenty of apps in the play-store but legit are very rare and less for we Indians as compared to the Americans as America is the best valued Global Market. One such app that really pays money for working online in India is Buzz Break. You can make money out of it by installing it from the play-store. Buzz Break is an app paying for reading news and doing a series of simple tasks. All details are within this answer. Steps to follow: (Step 6 is a must) Install Buzz Break.Register using Facebook or Gmail. You’ll get points to register.Go to the wallet tab.You will see an Enter button there.Click on EnterEnter the referral code as B25903325 for additional points. (Must perform this step)Now ways to make maximum points are as follows:Make a daily check-in and claim points by viewing the advertisement.Read 50 news daily and claim points. (For gaining knowledge)Watch 50 videos daily and claim points.Click on the gift icon 50 times on the earn tab and claim more points.Click on the hourly gift box on the top right corner. (24 X 1 Hour each)Click on the spin wheel icon on the top right corner. Get 5 tickets by watching 5 videos per hour and try your luck to get $10 to your main balance.Refer your friend for 20% points of their earnings. Build your clan and make endless money.Note: The app is 100% legit with payout via PayPal and Paytm in India. The minimum payout is as low as $0.02/$0.10/$0.50 i.e. Rs 5–Rs 7 depending on the dollar price. You can withdraw it to your Paypal or Paytm to check it’s legitimacy. (In Case of any Suggestions/Discussion ping me here : Dilip Singh Parihar) Best of luck! Wishing you positive outcomes! Upvote and Share if you like! Thanks for Reading and Scrolling! ",
            "date": "Updated August 13, 2020",
            "views": "385",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aditya Gupta",
                    "user_href": "/profile/Aditya-Gupta-83"
                },
                {
                    "user_id": "Sukanya Sake",
                    "user_href": "/profile/Sukanya-Sake"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shivprasad Karua",
                "href": "/profile/Shivprasad-Karua"
            },
            "answer_text": "There are many options and opportunities available to earn money even at this lockdown period and it will also become best career post lockdown. The direct selling industry or Multi Level Marketing is the only option and best opportunity in this Lockdown period ,as a good Multi Level Marketing company or direct selling company deals with health care products and essential products . So , it is clear that people have not stopped to care for thier health , people have not stopped to use essential products which are compulsory for thier livings or survival . MLM or direct selling is the recession free business and called the Business of The 21st Century. It has a huge prospects and opportunities in India . As per KPMG-FICCI report the industry will become 64500 crore in the year 2025 , and now it is around 8000 crores ,so there is huge scope in this industry . And the best part is that one can start with no investment as in Multi Level Marketing company one can convert his expenses into investment , because most of the good company deals with essential products and health care products only. To know more and to associate with good and product based direct selling company or Multi Level Marketing company feel free to reach us at 9167602176 or reach us through profile section. ",
            "date": "Answered July 29, 2020",
            "views": "165",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Monisha Ramamoorthy",
                    "user_href": "/profile/Monisha-Ramamoorthy-3"
                },
                {
                    "user_id": "Smita Shreejith",
                    "user_href": "/profile/Smita-Shreejith"
                },
                {
                    "user_id": "Deepak",
                    "user_href": "/profile/Deepak-2014"
                },
                {
                    "user_id": "Aktab Sarwar",
                    "user_href": "/profile/Aktab-Sarwar-2"
                },
                {
                    "user_id": "Phanisurya Bathula",
                    "user_href": "/profile/Phanisurya-Bathula-1"
                },
                {
                    "user_id": "Arjun Sankar",
                    "user_href": "/profile/Arjun-Sankar-19"
                },
                {
                    "user_id": "Sumanta Pal",
                    "user_href": "/profile/Sumanta-Pal-41"
                },
                {
                    "user_id": "Tajammul Hussain",
                    "user_href": "/profile/Tajammul-Hussain-19"
                }
            ]
        },
        {
            "author_info": {
                "name": "Md Jidan",
                "href": "/profile/Md-Jidan-3"
            },
            "answer_text": "This lockdown has had a huge impact on each sector but has had a small impact on online sectors. The online sector here usually means digital marketing. Here I will give you some important tips and motivation so that you can earn money from digital marketing in a very short time. When you go to achieve something big, ask yourself these three questions. ..... What is your passion. ..?2. How much you care about your work….? 3. Can you do this every day…? You may know a lot about elon musk, Bill Gates and be motivated a lot but you might be instantly motivated by it. This will not have any impact on your work. So, pull out the work of love that is hidden in your own heart. Blogging is the best source of income at home in lockdown. So, you start blogging on the niche on which you have enough knowledge and love. Since you have time is short so you have to do smart work not hard work. 1. You first select a profitable niche from different niche on which you have an interest.( Find blogging niche) 2. Second, select a micro niche from the niche of interest. And create a blog on that micro niche which we call Microniche blogging. But you will notice that your micro niche wants to be profitable.( Microblogging niche) 3. You buy a domain for a small fee and buy a hosting from a good hosting provider.( Bye domain and hosting) 4. One thing to keep in mind when you start blogging is that content is king. So, you plan on content with 30 low competition keywords for three months. So, you have to publish ten blog posts a month. ( Keywords research and find 30 low compilation keywords using Google adwords, ubber suggest, semrus etc keywords tools) 5. One thing to keep in mind is that Google is much smarter than us so you need to seo if your website is to grow organically. One thing to keep in mind here is never copy someone else's content. ( Please stop spam, focus on SEO and growth organically) 6. Patience and self-reliance will publish a valuable blog post every three days. But each poster length should be above three thousand words, and you will try to give a complete guideline about that keyword in each post. ( Min length 3000 words) 7. These three months you will invest 10 hours of your life on the blog please please ......... (invest 10 hours per day, and continue 3 month) 8. In these 10 hours, you will invest 4 hours on social media marketing. One thing to always keep in mind is that no matter how good your product is, if you don't do marketing then the value of your product is zero. ( 4/10 hours investment social media marketing) 9. See your blog as a business or brand. When you market a blog post, you think you are doing brand marketing. ( Blogging as a business or your own brand) 10. Here I will not tell you anything about Adsense or affiliate, you will learn on your own when you get a lot of traffic to your blog. Please never give up. ....... I discussed in an income source details rather than telling you a thousand income sources. If I can add some value in your life through this post, please support. ",
            "date": "Answered June 23, 2020",
            "views": "350",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Raj Nathan",
                    "user_href": "/profile/Raj-Nathan-16"
                },
                {
                    "user_id": "Shivam Singh Bhadauriya",
                    "user_href": "/profile/Shivam-Singh-Bhadauriya-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jameel Shariff",
                "href": "/profile/Jameel-Shariff-4"
            },
            "answer_text": "There is no real secret or magic to earn money easily. Simply people may refer some app to earn money and some would suggest for online jobs. But in real, there is no option or opportunity. People might find there own way according to the current situation opportunities. You can start your own idea how to earn money in this situation. You can design an app which help to get information about coronavirus or relevant to that. You can be network specialist to resolve the WFH technical issues. You can develop some employee monitoring tool which helps the company to track the employees performance in home. You can post the add of who wants to market digitally of their new sanitizer brand and new mask brand. You can be a WFH setup technician. You can hangup with some government projects who wants to have a detail about ration wages management and you can also connect with hospital work who wants to track the information about how many in quarantine and again infected and again cured. You can connect with vaccine management or plasma management to track the details of vaccine injected and plasma donated details and to track the details of infection screening. ",
            "date": "Answered May 1, 2020",
            "views": "246",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adam Max",
                    "user_href": "/profile/Adam-Max-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raghu Vamsi",
                "href": "/profile/Raghu-Vamsi-59"
            },
            "answer_text": "Straight to the point Here are some of the work from home jobs that you can try out your hand in! Content WritingWeb DevelopmentMaking YouTube VideosAffiliate MarketingGraphic DesignerTranslatorCopy WriterTeacherSEO SpecialistSocial Media CoordinatorData Entry JobsPDF to Word Conversion JobsWriting, Editing and Proofing JobsOnline Survey JobsForm Filling JobsCaptcha Entry JobsPayroll Data Entry OperatorEmail ProcessorTranscription JobsWord ProcessorEspecially for WritersBloggingAcademic WritingDigital MarketingPublic Relations WritingScript WritingCopy WritingNOTE: Those jobs that are in BOLD are in more demand right now according to some of the statistics. Here are some of the websites you can look over: FreelancerWork From Home Jobs for Women | Part Time Job For Ladies20 Best Online Jobs from Home that Pay Rs.1000 DailyHire Freelancers in India & Find Freelance Jobs OnlineHomework help - TranstutorsFreelance writing resources, jobs, gigs and adviceHire Freelancers Online & Find Freelance WorkI must say this lockdown period isn’t something that you can do ‘Netflix and chill’ kinda stuff. Let’s work hard and more importantly work smart. You should be a better person after this lockdown! Quora collapsed my answer which has many website hyperlinks. So, I removed some of them and posting this again! Please feel free to add the jobs as well as job websites down in the comment section that are not listed up here! ",
            "date": "Answered June 3, 2020",
            "views": "545",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Reshu Gupta",
                    "user_href": "/profile/Reshu-Gupta-103"
                },
                {
                    "user_id": "Chiranjeev V Gopal",
                    "user_href": "/profile/Chiranjeev-V-Gopal"
                },
                {
                    "user_id": "Ransjsj",
                    "user_href": "/profile/Ransjsj"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amardeep Sharma",
                "href": "/profile/Amardeep-Sharma-22"
            },
            "answer_text": "Hello friend, if you seen the current situation of the COVID-19 all over the world most of the country have in lockdown. And because of this lockdown middle class families can face a lot of trouble. So that's why I want share some tips for improving skill in lockdown period. In lockdown period we should learn about our work of interest which is very important for all because now generation I seen they all doing what other like and following But we never got time for ourselves what we want. So that's why I want tell you that time has come for you to recognize your skills and develop yourself and develop to fight the upcoming challenge. These are some skill such as. Yoga TrainerIn today's time, people spend a lot of money for their health. So by yoga training, you can do a lot of earning. and you can also earn from online yoga training. 2. Freelancing Freelancing are terms commonly used for a person who is self employed. freelance job one where a person works for themselves, rather than for a company. And freelancing skill you can do your own business and earn more money. 3. Blogging Blogging is platform which help for writing content, information, sharing knowledge on internet. Blog writing is also good platform for earring lots of money. 4. Marketing with social media Social Media marketing through you can get comission from by promotions or advertisement of product on your social media site. 5. Share Market Share market is where buying and selling share happens. And share represents a unit of ownership of company from where you brought it. This is also good source of income. So friend these are some skill which you learn in lockdown Period and you can create new of income for yourself. ",
            "date": "Answered May 2, 2020",
            "views": "332",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ganesh Ram",
                    "user_href": "/profile/Ganesh-Ram-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neha Kakkar",
                "href": "/profile/Neha-Kakkar-163"
            },
            "answer_text": "The best way is through YouTube If you want to make most possible money out of YouTube, 1st select your niche which is interesting for you when you making videos for your interest and fun you will work with enjoy and lots of fun so please select the niche that enjoying you 2nd make a 3/4 minute video regularly. 30days 30video 1day/1video 3rd complete your combined watch time 4000 hour's and 1k subscribers 4th try making a video of more than 10 minutes of length. While uploading a video, make sure you put a lot of tags, that improves the quality of your video in a search result. Now, while uploading a video. 5th after this process you can apply Google ad sense for monetization and earn money from YouTube. Thank you 😊 Watch this simple 5 minute video for creating YouTube channel. simply explained. https://youtu.be/8JM3_RBkzQE ",
            "date": "Answered June 3, 2020",
            "views": "97",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aman Sharma",
                    "user_href": "/profile/Aman-Sharma-375"
                },
                {
                    "user_id": "Sarthak Yadav",
                    "user_href": "/profile/Sarthak-Yadav-162"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harsha V Gopal",
                "href": "/profile/Harsha-V-Gopal"
            },
            "answer_text": "‘Work from home’ is a new concept nurturing very well in corporate world. It’s a therapy that helping in earning money and dealing with other chores simultaneously. Research has shown time and again that routine traveling causes various health and skin problems especially during this widespread of covid-19 where ‘work from home’ comes as a relief.Here’s i bring 5 ways where everyone can earn money sitting at home: Invest money in Stock Market:- If you are really interested in earning money in seconds and having interest in stock market, then you can open demat account with any nearby broker and start investing in stock market.Content writing- Content writers typically create content for the Web. Aside from writing content, these writers might also be responsible for making sure the sites' pages and content connect. These days, women who believes in writing and looking for earning money out of their passion can choose content writing as a career option.Vlogging- It refers to video blogging. Vlogging saw a strong increase in popularity beginning in 2005 since the popular social media handle, youtube, came. Sejal kumar, one of the popular indian youtuber/vblogger earning not only money but also fame out of it.Online data entry jobs- it involves job responsibilities like to post those contents (already provided) belongs to client website on the data entry project site. Here, payment is made on per content basis where one can earn primary earning, additional earning and so on.Editor- it derives from the word ‘edit’ which means to correct mistakes- be it typos and grammatical and rewrite content to make it clearer and stronger. Editors may also pitch ideas, provide feedback to writers, and write headlines.Therefore, it wouldn’t be fair to say one can’t earn money sitting at home. Rather, life eases out for women since this concept has become a conventional phenomenon. So, stay home, work from home and earn. ",
            "date": "Answered April 27, 2020",
            "views": "976",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vaibhavi Shirdhankar",
                    "user_href": "/profile/Vaibhavi-Shirdhankar-2"
                },
                {
                    "user_id": "Vaibhavi Shirdhankar",
                    "user_href": "/profile/Vaibhavi-Shirdhankar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rajneesh Singh",
                "href": "/profile/Rajneesh-Singh-404"
            },
            "answer_text": "Yeah, there are enormous ways to make money during the lockdown. I have been in digital marketing since 2016 so yeah I can share some real money-making tips that would help you to make real cash online. Freelancing - If a beginner looking to earn real cash online. Then go with FREELANCING. You just need to have a skill and you’re good to start freelancing. You need to have a laptop and an internet connection. I am sure these two things you’ll have. I recently wrote an ebook on FREELANCING! WIll launch it soon! And let me tell you in order to start freelancing you don’t need to invest single rupee. As I said you just need to have a skill that can be served online such as Content Writing, Graphics Designing, Coding and so on. Affiliate marketing - If you want to actually make passive income affiliate marketing is the best option. But it requires lots of effort to generate income at an initial level. Once you cross that phase you can make a decent amount of money on a passive mode. Blogging - This one is my favourite, but Blogging is not for everyone. It requires so, much patience and time which most of the people aren’t ready to put. However, blogging can give you a decent amount of passive income if you work consistently These are the methods, I believe that can give you real money. ",
            "date": "Answered July 2, 2020",
            "views": "129",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Siddhi Dahale",
                    "user_href": "/profile/Siddhi-Dahale"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dolly Sharma",
                "href": "/profile/Dolly-Sharma-106"
            },
            "answer_text": "There are many options to earn in lockdown and most preferable is online earning. Some of the options are: 1 Online classes If you are interested in giving classes and it's not possible during lockdown to go in someone house and give tutions. So you can start online classes in any field that you are interested. 2 Start blogging or make website If you are interested in writing blogs you can start blogging as you have so much time in lockdown. It's definitely not a short-term fix, it can take long-term to start making income. 3 Get creative If you are interested in doing craft than it's time to turn your hobby into an additional income. You can make jwellery, wall hangings etc and sell them online. 4 Virtual assistant If you are good at communicating, and have strong digital skills you ca be a virtual assistant. You have to find websites by which you can get work as VA. 5 Freelancing There are lots of freelancing websites which offers you work according to you skills. So go and checkout some and find your appropriate job. ",
            "date": "Answered June 15, 2020",
            "views": "221",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Roshan Deshmukh",
                    "user_href": "/profile/Roshan-Deshmukh-2"
                },
                {
                    "user_id": "Gurkaran Singh",
                    "user_href": "/profile/Gurkaran-Singh-108"
                },
                {
                    "user_id": "Surjeet Singh",
                    "user_href": "/profile/Surjeet-Singh-1798"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bharvi Thanki",
                "href": "/profile/Bharvi-Thanki"
            },
            "answer_text": "Here is the Answer of All - Multiple Stream of Affiliate Marketing is the legal and easiest way to make money online without any risk.  Here are some current ideas (depends on 2020 - 2030 situations) to achieve this: During Covid-19 Pandemic and due fast internet growth, huge people are consuming data. Most of people are active on social media No need to build your own products or factory for earning, Instead get associated with a platform which already has products and plans of selling. You can Use Social Media to promote it using Influence Marketing skills which are so much technical. I got some ways to earn money online and I have categorised these for you in 3 parts: Create your Digital Products (Requires deep technical & marketing knowledge)Affiliate Marketing (Requires technical, marketing & sales knowledge)Affiliate Marketing with multiple stream of incomeThird option does not require any investment on expensive tools. And you can launch this business immediately without investment. If you want to know more about this option, I invite you to upcoming online workshop where we discuss about building profitable online global business without investment. Here is option for you to start earning within some days ",
            "date": "Updated September 6, 2020",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sri Kanta",
                "href": "/profile/Sri-Kanta-18"
            },
            "answer_text": "In this hard time, all of the sudden things are going worst were we can’t imagine, and the World is in big trouble because of COVID – 19 Pandemic. As a precautionary step, many countries are completely lockdown. Due to lockdown, people are suffering very badly. At this stage, seeking a platform to earn money is a need, because probably in the upcoming months there is a high chance of losing their jobs. It is better, to find an alternative solution. Start Now to Earn Money by following the given information to avoid future discrepancies. Approach for the Platforms which offers you real money that is as follows MPL.Live – Play Games & Earn Real CashRummyCircle – Play Card Games with Less Investment and Earn Big CashGOGAME.IN – It’s All About Play Games, Build Social Connections & Earn Money Blogger – Become a blogger and Earn from Google AdSenseYoutuber – Entertain Users with Your Skills and Get Monet via AdSense, Super Chat & Influence MarketingAffiliate Marketing – Do promotion for products or services via Digital Marketing and Earn Money The above-provided information is the best way to earn money. Let’s hope and pray to overcome the current Happening COVID-19 pandemic as soon as possible. ",
            "date": "Answered April 24, 2020",
            "views": "394",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Biswambar Panda",
                    "user_href": "/profile/Biswambar-Panda-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edward Steal",
                "href": "/profile/Edward-Steal"
            },
            "answer_text": "Are you interested in earning small amounts of money online? Do you already have a job that involves you most of the day and you do not have much time to invest in online jobs? I’ll show you a few ways how to make money, you can earn $500 to $1000 daily. Just email me at edwards479810@ gmail. If you are passionate about writing, you can use it to make money online. It is an activity that you can do comfortably from home and above all without investing any money. You already had a similar idea, but you do not know who to contact to submit your articles? Well then, you might want to market yourself to editorial content and try to sell it there. The sale of used and/or handmade items can be another potential form of income. Performance commission is another way to earn small amounts of money online, especially if you are good at repairing objects and/or specific skills in areas such as hydraulics, electronics, computer science, graphic design, school rehearsals, translations, etc. ",
            "date": "Answered September 22, 2020",
            "views": "20",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gudla Vihari",
                "href": "/profile/Gudla-Vihari"
            },
            "answer_text": "There are many sources to earn money working from home depending on the skills you have and type of work and income you wish…if you prefer a instant lumpsome amount you should go for freelancing on sites like Fiver, Peopleperhour,Upwork,Trulancer etc….where you can find projects on different subjects like data entry,web designing,logo designing,fb page setup,email scraping etc etc… Another way is to setup a blog and write interesting articles and generate traffic and get paid through adsense….you may also setup a youtube channel for the same and earn money… Another way is stocks and mutual funds but for them you need to invest some amount and even time also…don't blindly invest which may lead to huge losses😰 If you don't have much skill and prefer to do simple tasks and don't mind even if the income is slow then you can go for paid surveys or PTC(Pay to click) …if you go on like that there are websites which pay for reading emails,listneing music,writing reviews ,chatting with students,some websites even pay for uploading your old best clicks😂….. If you need suggestions of legit websites to do these tasks you can DM me….beacuse it is difficult to distinguish between the scam and legit websites for these….happy earning🤗 ",
            "date": "Answered August 10, 2020",
            "views": "92",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Deepak Makhija",
                    "user_href": "/profile/Deepak-Makhija-45"
                },
                {
                    "user_id": "Aashi Sontakke",
                    "user_href": "/profile/Aashi-Sontakke-1"
                },
                {
                    "user_id": "Kapil Rajput",
                    "user_href": "/profile/Kapil-Rajput-186"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harsaroop Singh",
                "href": "/profile/Harsaroop-Singh-2"
            },
            "answer_text": "Hi when this lockdown was implemented I decided to come out of it a better a version of myself. I decided that when this all ends my life will not be the same. I wanted to start a legitimate online business where I could earn from home. I had little money to invest just a couple of hundred bucks but had this burning desire to learn. I searched for a quite amount of time to start something with this much money. Then I came across forex trading which just requires a minimum of 100$ and you are good to go but the key point is you need knowledge first. Forex is a recession proof business and every day 6–7 trillion dollars are traded and its one of the largest markets of the world. It's been around 2 and half months now and I am making over 500$ every week sitting home in ny comfort trading at what ever time I want to. Hope this was helpful information, if you're interested to start and have any questions or want to know where to get started direct message me and I can share some resources. ",
            "date": "Answered June 13, 2020",
            "views": "110",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Eesha Deshpande Chakradeo",
                "href": "/profile/Eesha-Deshpande-Chakradeo"
            },
            "answer_text": "If you have a work from home job, work as per your regular office timings. Some tips to help you work better : Get up on time and get dressed nicely. Good clothing affects your productivity and mood. It's proven.Have a proper designated spot to work from. It can be a table with a good chair or the bed with the laptop at eye level.Keep water nearby so you don't get up always.Having said point 3, do getup every half hour atleast and take a walk of the house.Eat at proper times. If you have to cook, then cook before you start working so you can focus on your work.Don't spend entire day on work. Take some time to read, sleep, meditate also.You are getting paid for the job so do it right.I cannot stress the importance of having a proper schedule during these times. Yes you can take it slow some days. But random schedules make the day seem long and tiring with the office work, household chores, own interests etc. Take care and be safe ! Eesha Deshpande Chakradeo (@eeshadeshpande) • Instagram photos and videos ",
            "date": "Answered March 27, 2020",
            "views": "627",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Simran",
                    "user_href": "/profile/Simran-869"
                },
                {
                    "user_id": "Manish Kapri",
                    "user_href": "/profile/Manish-Kapri-6"
                },
                {
                    "user_id": "Guru Scopesupport",
                    "user_href": "/profile/Guru-Scopesupport"
                },
                {
                    "user_id": "Shivika",
                    "user_href": "/profile/Shivika-17"
                },
                {
                    "user_id": "Vivek",
                    "user_href": "/profile/Vivek-1017"
                },
                {
                    "user_id": "Vishal Dubey",
                    "user_href": "/profile/Vishal-Dubey-241"
                },
                {
                    "user_id": "Uttej Sai",
                    "user_href": "/profile/Uttej-Sai-3"
                },
                {
                    "user_id": "Aman Gowalkar",
                    "user_href": "/profile/Aman-Gowalkar"
                },
                {
                    "user_id": "Anitha G",
                    "user_href": "/profile/Anitha-G-54"
                },
                {
                    "user_id": "Anil Saini",
                    "user_href": "/profile/Anil-Saini-628"
                },
                {
                    "user_id": "Rajendra Joshi",
                    "user_href": "/profile/Rajendra-Joshi-263"
                },
                {
                    "user_id": "Deepak Makhija",
                    "user_href": "/profile/Deepak-Makhija-45"
                },
                {
                    "user_id": "Sujit Kumar Yadav",
                    "user_href": "/profile/Sujit-Kumar-Yadav-40"
                },
                {
                    "user_id": "Mithun Rathod",
                    "user_href": "/profile/मिथुन-राठोड-Mithun-Rathod"
                },
                {
                    "user_id": "Ram Rachure",
                    "user_href": "/profile/Ram-Rachure"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vaibhav Kamble",
                "href": "/profile/Vaibhav-Kamble-184"
            },
            "answer_text": "See, there are many ways to earn money online and it's totally on you what you choose for earning. Basically there are many methods … 1. Freelancing Freelancing has always been a popular way to earn money online and the Internet has a plethora of options. There are several websites offering freelance tasks for people with varying skills. likes Fiverr, Upwork , Freelancer. You can earn anywhere between $5 and $100 through these websites.  2. Affiliate marketing- Once your website is up and running, opt for affiliate marketing by allowing companies to insert web links on to your site. in affiliate marketing u can earn by commission through Amazon, Flipkart,banggoods, Myntra etc. as per product commission is fixed that u can earn better revenue for your future. 3.Surveys, searches and reviews- There are several websites offering money to undergo online surveys, carry out online searches, and write reviews on products. To get the credit, one needs to disclose certain information to them including one's banking details. In these method by taking survey and review u can earn money.there are many websites for survey like Google rewards u can sign up there and start earning. 4.virtual assistantship - Doing all the corporate stuff from one's home is what a virtual assistant (VA) does. VAs basically work remotely with their clients and manage the aspects of their business that they are too busy to handle themselves. When you work as a virtual assistant, you can choose to work as an employee or you can set up your own business. 5. Language translating- Knowing a language other than English may even help you earn some extra bucks. There are several websites that offer translation projects that require translating a document from one language into another. This may include Spanish, French, Arab, German, or any other language to or from English. 6. Social media- In addition to interacting with friends and strangers, social networking platforms like Facebook, Twitter, Instagram, and Snapchat can be used to make money. Companies and popular brands pay social media strategists to further boost the popularity of their products. With lots of competition around and the constantly shortening of attention time of online viewers, creativity is essential to create posts, videos etc that can go viral quickly and enhance the brand value. Remember, social media needs dedicated time and energy to stay relevant. Hence, you need to share posts regularly and interact with your followers on a regular basis. 7. Web designing- Not all business owners are tech savvy but the need of the hour is to have a website of their own. Those who have a knack for all- things- tech, especially related to websites, can help small businesses set up their own websites and earn from it. Coding and web designing are the essential ingredients in setting up websites. Further, websites need maintenance and may require frequent updates, which may add to one's revenue. Depending on the client and job, a single project can fetch you anywhere between Rs 20,000 and Rs 1 lakh. 8. Content writing- Online platforms can be a good starting point. Depending on the quality of the articles, one gets paid. One may be asked to work upon articles with specific guidelines as well. Develop a niche in your area of expertise and build strength in that domain to increase the revenue stream. 9. Blogging- It starts with a hobby, interest, and passion and blogging becomes a career option for many bloggers. There are a number of full-time bloggers in the country. There are two ways to start a blog.you can either create a blog through Wordpress which requires no investment, or go for a self-hosted blog. buying domain is very important for blogging by that u cannot earn money. 10. YouTube- If you are not comfortable in penning down your thoughts through blogs and content writing, make use of your camera to create a video presentation. Create your YouTube channel, upload videos and start monetising them. Choose a category or subject that you want to make videos on and get started, but make sure it's a topic that will interest a lot of people. Everything from cooking shows to political debates can find many takers on YouTube. You have to create a YouTube channel, which works on a similar model as a blog. As you make your channel popular and the number of subscribers grows, so will your earning potential. The payment one gets is based on every thousand views. 11. Data entry- Although this line of work is seriously threatened by automation, there are still plenty of data entry jobs available in India. It is one the simplest jobs you can do online, and requires no special skills. You just have to have a computer, Internet connection, fast typing skills, and the ability to pay attention to details. Most freelancing websites list these jobs, and you can sign up on any of them to start earning in the range of Rs 300 to Rs 1,500 per hour. ",
            "date": "Answered May 21, 2020",
            "views": "112",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sanju Bhandari",
                "href": "/profile/Sanju-Bhandari-14"
            },
            "answer_text": "People are already earning due to this lockdown if i am not wrong, Manufacturers increased prices for they products while selling to distributors or wholesalers Wholesalers or distributors also taking good profits with ease by selling to retailers Retailers demanding more price from consumers Means either mrp or even higher than mrp on the name of lockdown These people who pay high prices getting free money from central n state government onnthe name of white ration card This government asking funds to fight against the natural calamity n they may wont tell where are they going to spend this money The funds r given by the manufacturers who were in the starting of the cycle. All this happening n its a circle No ine following rules then why will the infected cases decrease ",
            "date": "Answered April 17, 2020",
            "views": "566",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Surya Prakash",
                    "user_href": "/profile/Surya-Prakash-3099"
                }
            ]
        },
        {
            "author_info": {
                "name": "Agniva Mahata",
                "href": "/profile/Agniva-Mahata-1"
            },
            "answer_text": "Hello brother, so u r looking for passive income over internet in lockdown days, yeah this corona breakthrough have became a very major issue, and speaking frankly the net gdp of our country is swapping off.. so some tips i wanna give u that can boost Ur income to a large extent: Affiliate Marketing with whatsapp status- Ever had those links in whatsapp that redirects u to new pages and aware u about Corona Out break!! yeah just make this script (buy from me at the cheapest price) and make income using google adsence and amazon affiliate.Stock Market - This had been a major earning option nowadays, because of this outbreak the stocks are heavily down and if u invest u may earn a fortune and even can double ur amount in 2–3 years. Make Youtube Videos- for this outbreak people cannot visit gym, so u can make gym and diet tutorials and can grow considerably, maybe fastest growing in months.Online teaching- Last but not the least online teaching, if u think u have knowledge to teach u can teach a ton of students, and get heavily paid..so that's all, if u have any queries follow and contact me. this lockdown be safe and keep ur peoples safe. ",
            "date": "Answered March 27, 2020",
            "views": "1",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Misbah Khan",
                    "user_href": "/profile/Misbah-Khan-377"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vishnu",
                "href": "/profile/Vishnu-433"
            },
            "answer_text": "Everyone is in search of ways to earn money online especially during this period as there is so much time in home and there is nothing to do. If you want this time to use effectively and earn some bucks out of it then hats off to you, its a very good decision. There are so many ways to earn money online not only now in quarantine but usually if you are willing to make some handsome income in your free time then you can definitely. Nowadays, everyone want to be their own boss instead of working under someone they are preferring online jobs which are very convenient, comfortable and flexible at the same time. If you are in search of these online jobs and earn some handsome amount of income and use this quarantine time then follow the below methods and adopt any of them as per your convenience and wish. SurveysQuizTasksWatch and EarnBloggingWebsite or App developmentGraphic designingYouTubeSocial mediaOnline TutoringTry one of these methods and earn easily a handsome amount of money online. If you want to know in detail about these methods check into this How can I make money online daily up to 500-1000 Rupees? Thanks, Vishnu ",
            "date": "Answered April 2, 2020",
            "views": "696",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mohd Saif",
                "href": "/profile/Mohd-Saif-457"
            },
            "answer_text": "Hii everyone If you want to earn money sitting at home, there are many ways to earn money online such as creating a YouTube video, reviewing the product by writing content, but it takes you a little time to earn money if you want to earn money in this lockdown, then I will give you one such I am going to show the way by which you can earn money easily.. EarnKaro[1] is a website where you can easily earn money by sharing any product you like amazon flipkart myntra, if any person buys any product from your share link then you are given commission there. For this, you first have to sign up by going to the link given below.  After EarnKaro registering, you can refer to your friend or anyone by copying the link to any product from the side. Whom you can earn for a good month is sitting at home and many people in India are earning well through it, so what should be the time to sign up and start earning money thank you .. Footnotes[1] EarnKaro",
            "date": "Answered May 14, 2020",
            "views": "173",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Arundas Antony",
                "href": "/profile/Arundas-Antony"
            },
            "answer_text": "There are plenty of reasons to want to make money from home – perhaps you’d like to supplement your main income, keep busy during parental leave, or even start a brand new career. We’ve put together a handy list of 26 ways to make some additional money from home (or in some instances, via the gig economy) – including everything from one-off tasks to ideas that may end up as an additional income stream.  1 Get paid to write online If you’ve always wanted to be a writer, what better time to start? While a lot of online writing jobs don’t pay, there are still quite a few websites where you can make money by creating high quality, relevant content. You can get started by looking at: Listverse: a listicle website that will pay $100 per accepted article.Longreads: a long-form content site that pays competitive rates. The website doesn’t specify the amount paid but other websites and blogs have stated rates of $500-$1,500.Back2college: a site aimed at older students will pay $55+ per accepted article.All Pet Voices: a pet website that pays $75 per accepted article.iWorkWell: a website for HR professionals and SMEs that pays $200 per accepted article.Loaded Landcapes: a photography website that pays $20-150 per accepted article.Income Diary: a website focussed on making money online that pays $200-$500 per accepted article.A Fine Parent: a parenting website that pays $75 per accepted article. All of these sites only pay for accepted articles, so make sure that you review their criteria and read through the websites for an idea of their existing content and style before you start. Some websites also prefer to receive pitches before the main article. While a lot of freelance writers have regular clients, writing for some select websites allows you to build up a portfolio, create a niche, and work up to higher-paying and more reliable income, if that’s something that you want to pursue. To know more visit the link-ShrinkMe.io ",
            "date": "Answered July 16, 2020",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Amit Kapoor",
                "href": "/profile/Amit-Kapoor-479"
            },
            "answer_text": "As you know the situation is becoming tenser and people all over the world are so afraid to step outside from their house. All of the employees have been suggested to Work from Home. It’s been already more than 2 months we have been lockdown. Our daily lives had been scattered. We all are caged at our own homes. Now, there is a huge crisis of money. So, what can you do to avoid crisis and earn a little extra bucks from your comfort zone. In this lockdown for me, 11Wickets came as a rescue. I have earned sure shot amount in every single match. Wanna know how?? It’s very simple. I will tell you but before that let me brief you about this app. 11Wickets is a fantasy sports gaming app. I am not a pro in such games but this app is exclusively different and earning money is very easy. They have this exclusive feature called Apna League, where the creator gets 100% profit for just creating the team. Withdraw your winnings instantly. The bigger the team, bigger the profits. ",
            "date": "Answered May 28, 2020",
            "views": "89",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tom Moore",
                "href": "/profile/Tom-Moore-543"
            },
            "answer_text": "BY SELLING SUBSCRIPTION BASED PRODUCTS! I HAVE STACKED UP $2,000,000 PER MONTH IN RECURRING REVENUE. It is very important and those of you who are doing dropshipping and selling dog beds, buddy you are wasting time even if you are making a million dollar per month! Sell dog food, the owner will come again to you shop. (online shop/store/shopify!!) You should sell a Ethically addictive product plus if you can make it subscription based and my friend you are a Billionaire! Eg: Nexflix the owner got $1,000,000,000 richer because of lock down! you can try with cheese based products! I am telling you, no one is selling cheese on a big scale, I don’t do business in these toxic food industry so you have not seen me yet, but I am giving you a billion dollar idea if you are smart enough to catch it! And the simplest way could be Affiliate marketing! Yes It is easy and promises Financial security there was a time when I was building something like this from affiliate marketing! but I changed my values! Otherwise it is easily achievable, Some of my friends are living like him just by income from affiliate marketing! And yaa, I have a Recorded Free Video from our mastermind! The host (my friend) did a demo of making $1000 in 1 hour from scratch! Link for that is in my bio! So simply click on my profile and register for that free training, I am confident that you can also be like danny after watching that video!  ",
            "date": "Answered June 17, 2020",
            "views": "67",
            "upvotes": " Answer requested by Alex Benny",
            "upvoters": [
                {
                    "user_id": "Sukanya Sake",
                    "user_href": "/profile/Sukanya-Sake"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rohit Pani",
                "href": "/profile/Rohit-Pani-1"
            },
            "answer_text": "The only way to get some income during this lock down period is to work online.. I will suggest you some online works which are very easy, even for students and can income a lot Freelancing. ...Start your own website. ...Affiliate marketing. ...Surveys and searches and reviews. ...Virtual assistantship. ...Translating. ...Online tutoring. ...Social media.Web designingContent writingBloggingYouTubeKindle e bookSelling products onlinePtc sitesPeer to peerData entryAll these will help you to earn alot ",
            "date": "Answered March 26, 2020",
            "views": "38",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dorin Cojocariu",
                    "user_href": "/profile/Dorin-Cojocariu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sudharsan S",
                "href": "/profile/Sudharsan-S-66"
            },
            "answer_text": "best way to earn money during lockdown is online work That’s the only way to earn money, so the work you have to do it from home here some of the easy way to work from home create a youtube channel but its a long term work , if you wrk correctly you can even earn money from the second month also . but it s not easy as its look. so approximately more than 3 month wrk to start earn from youtubenext one is captcha work, yes the 2captcha work. its genuine you work from today you earn even today. its like clearing a captcha , if you clear 1000 captcha they give 1 dollar . it may sounds easy but its hard to solve this much captcha at first but if you used to it. you can earn minimum 4 dollar or the maximum as you wrk , so solidly you can get 100 dollar or more for a month.",
            "date": "Answered July 28, 2020",
            "views": "72",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kannan Iyer",
                    "user_href": "/profile/Kannan-Iyer-45"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joy Das Sharma",
                "href": "/profile/Joy-Das-Sharma"
            },
            "answer_text": "It depends on your personal skills and location. For example , in certain High rise Apartments , some of the residents are preparing breakfast , lunch or snacks items and selling within the gated community. All they do is to paste a notice near the lift of every block and wait for orders. Many are making good money. Basically you have to look at gaps in service areas. You may serve a group of senior citizens by bringing groceries, Rations, provisions of medicines to their door step. Most of them may not be accustomed to ordering online. Online tuitions could be a good source of income. If you have any other skills like plumbing, electrical work or even as beautician, you might be in great demand. A lot of people are losing jobs due to Covid. They need professional help. Either to find a new job or to navigate them to a new profession or business. If you are having contacts or knowledge, you can also start an online consultancy. Apart from earning money for yourself, you get the satisfaction of helping out someone in distress. Masks are there to stay. If you are creative, then make designer masks. It could be in packs of 7 , so that one can wear a new design each day of the week. ",
            "date": "Answered August 15, 2020",
            "views": "83",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Nanda Varma",
                    "user_href": "/profile/Nanda-Varma"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sankalp Jain",
                "href": "/profile/Sankalp-Jain-182"
            },
            "answer_text": "1. If they have savings than invest it in share markets and do short term tradings. 2. Take up online surveys. 3 . Or conduct online games make money . For the poor people I can't suggest anything. Because whatever they do is very important for us. And due to lockdown we are not making buildings, nor travelling somewhere. So those who worked daily and ate daily and in jeopardy. Sorry I couldn't suggest anything for them. ",
            "date": "Answered May 1, 2020",
            "views": "84",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Manish Kapri",
                    "user_href": "/profile/Manish-Kapri-6"
                },
                {
                    "user_id": "Payal Agarwal",
                    "user_href": "/profile/Payal-Agarwal-138"
                },
                {
                    "user_id": "Surjeet Singh",
                    "user_href": "/profile/Surjeet-Singh-1798"
                }
            ]
        },
        {
            "author_info": {
                "name": "Luke Clemo",
                "href": "/profile/Luke-Clemo-1"
            },
            "answer_text": "You can try clearing out your shed, basement or garage of all that rubbish. Flog it off cheap on eBay or a local site and clear up that space. Be ruthless and get rid of it. There’s a few hundred bucks if not a few thousand to start with. Less than a days work and you’ve got a bonus free space cleared in the house to feel great about. Next up, find some affiliate marketing opportunities and sign up. It takes a few minutes. Once thats done, start telling people via email or Facebook or Youtube or Instagram about your product. Include the link so they can buy through you. Get an Amazon affiliate link and do the same. Heh presto…more cash from home. You could accelerate the earnings by going to WordPress and starting a blog for free. Spend a few bucks (the dollars earned on flogging off the secondhand goods) to get a domain name. And start blogging and building your site with affiliate links throughout. Highly recommend you spend just a few of those dollars also, to learn a few simple secrets that will accelerate the cash earnings and fatten your wallet! Small changes make a big difference. Jump onto my link above for one such offer thats simple, cheap and designed for the newbie - no experience required. One affiliate link sale, and it’s paid for itself. The hundreds and thousands more cash on top - is all yours. ",
            "date": "Answered May 18, 2020",
            "views": "158",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Susanta Rakshit",
                    "user_href": "/profile/Susanta-Rakshit-2"
                },
                {
                    "user_id": "Sona Jain",
                    "user_href": "/profile/Sona-Jain-103"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bonita Mcclain",
                "href": "/profile/Bonita-Mcclain-1"
            },
            "answer_text": "The best way to make money online: There are thousands of ways to bring in cash on the web. but, the best way that has worked for me is Affiliate Program - Your goal in affiliate marketing is to earn commissions for mentioning or recommending services or products on your website. Affiliate Network - A value-added intermediary providing services, including aggregation, for affiliate merchants and affiliates.Freelancing - Outsourcing is an agreement based calling were as opposed to being enlisted in an association, the individual uses his abilities and experience to offer types of assistance to various customers.Content Creation - Hope you all know about content creation.The 10 best websites to make money online: Home - ClickBankShareASaleJVZoo HomepageThe web's most popular and successful Affiliate ProgramFlipkart Affiliate ProgramAdobe Affiliate ProgramEtsy - AffiliatesUpwork | Hire Freelancers. Make things happenYouTubeSell photos, footage clips, illustrations & vectors | ShutterstockIf you are interested to read the money-making book - check this out Simply pick 1 site and learn as much as possible about it and start it All the best and Happy earning! ",
            "date": "Answered May 21, 2020",
            "views": "106",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gauri Sankar",
                "href": "/profile/Gauri-Sankar-2"
            },
            "answer_text": "There is no certainty during this lockdown period. No steady business and nobody can tell about the future and this may happen at least for a couple of months. Now there is a huge demand from the public for the following apart from essential vegetables and groceries Face masksFace shieldPPE kitsSanitisersEspecially any individual cannot use face masks continuously for a longer time. This is the right time for the tailors and textile units in manufacturing face masks which will be the hot cake for more than six months from now ",
            "date": "Answered June 21, 2020",
            "views": "543",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Biswambar Panda",
                    "user_href": "/profile/Biswambar-Panda-4"
                },
                {
                    "user_id": "Naveen Kumar",
                    "user_href": "/profile/Naveen-Kumar-13113"
                },
                {
                    "user_id": "Gia Paul",
                    "user_href": "/profile/Gia-Paul"
                }
            ]
        },
        {
            "author_info": {
                "name": "Faizan Khan",
                "href": "/profile/Faizan-Khan-3294"
            },
            "answer_text": "You can make money in lockdown by several ways like completing surveys, watching videos etc, but my recommended way to earn money is affiliate marketing and selling other people products for free online If you are interested in making money through affiliate marketing then checkout the best trainings in my profile Faizan Khan and learn How I make 1000$/week just using my laptop and with zero skills and experience, once you setup the system I give you in my trainings you will be making money instantly and on autopilot guaranteed, it only requires hardwork once and efforts and you can make money from home, Thanks for reading everyone……….. ",
            "date": "Answered June 3, 2020",
            "views": "83",
            "upvotes": " Answer requested by Ankur Verma",
            "upvoters": [
                {
                    "user_id": "Varsha",
                    "user_href": "/profile/Varsha-636"
                },
                {
                    "user_id": "Hasnain Khan",
                    "user_href": "/profile/Hasnain-Khan-88"
                },
                {
                    "user_id": "Patel Mayank",
                    "user_href": "/profile/Patel-Mayank-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nicola Nicolas",
                "href": "/profile/Nicola-Nicolas-2"
            },
            "answer_text": "if you are interested in making money online and don’t worry this is not like other people scamming IT IS AUTOMATIC MONEY MAKING SYSTEM 6 FIGURES IN 6 MINUTES MAKE MILLIONS SHUT UP! I am sick of people making money because of spamming people here I am going to give you truth and you decide if you want to click and join or not and when you join it will charge you ONLY 10$ and that 10$ will forever change your life and it change thousands of people lives and there is MONEY BACK GUARANTEE so it is risk free if you do not make money you take money back but trust me you will make money just inbox me for link LETS BUILT THIS ALL COMMUNITY WITH MORE TRUST AND HONESTLY ",
            "date": "Answered April 17, 2020",
            "views": "239",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Moses McKenzie",
                "href": "/profile/Moses-McKenzie"
            },
            "answer_text": "If you have skills, put them to good use.If you don’t have skills, then while in lockdown, you better be learning something, especially if you have free time.If you aren’t doing anything but entertaining yourself, then, do you think you have been wasting time? Artists sell art online. Animation, Design, etc.People that do coding code for others online.People teach online.Cam girls and cam boys, well the name itself is self explanatory, they sell pleasure online. 18 and up only and you need proof of ID (it is legal),From there, I guess if you want to learn a skill, there is always Udemy. If you lack the money, then try searching for tutorials on Youtube or something..If you have no skill at all, try selling entertainment online.Make up a story and people will watch. ",
            "date": "Answered April 7, 2020",
            "views": "179",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rahul Sharmaa",
                "href": "/profile/Rahul-Sharmaa-2"
            },
            "answer_text": "You can earn the good money in lockdown through various ways. If you have any skill you can get the job online or offline through that particular skill. There are many sites which give you work based on your choice online. You can google them. Upwork is one of them and mostly people chose it because of easy to access and easily get the money through PayPal or any other online platform. You can get the work offline also nearby if you have skill. Example- If you are mason, contact nearby construction sites and try to get work. ",
            "date": "Answered August 10, 2020",
            "views": "42",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nitish Kumar",
                "href": "/profile/Nitish-Kumar-5110"
            },
            "answer_text": "There are many ways using which you can earn money But first you have to understand that Rome was not built in a day eearning money is somewhat similar to that. Create Youtube Channel if you are good in something you can create a youtube channel. If you are not good at anything you can become good by watching youtube channels and once you have gathered knowledge you can share it with peopleWrite bloggs I think it's one of the easiest thing one can do because you just have to start and everything else happens by itself you can try by writing some answers on quora JUST TRY YOU WILL BECOME ADDICT OF IT.Make an app If you are good at coding just create an app there are multiple videos on how to create app you should go through them.Earning is a by product of Learning so keep learning to keep earning ",
            "date": "Answered May 29, 2020",
            "views": "235",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rahul Surong",
                    "user_href": "/profile/Rahul-Surong-2"
                },
                {
                    "user_id": "Seema Sasmita",
                    "user_href": "/profile/Seema-Sasmita"
                },
                {
                    "user_id": "Surjeet Singh",
                    "user_href": "/profile/Surjeet-Singh-1798"
                },
                {
                    "user_id": "Shrey Creation",
                    "user_href": "/profile/Shrey-Creation"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kenny Varner",
                "href": "/profile/Kenny-Varner"
            },
            "answer_text": "Affiliate Marketing I found a Free training video linked in my profile. I easily found the time to check it out during these lockdown times. Simply put You need to take action and be consistent and those 2 things are the ultimate truth. People who Take action are the ones that profit. The ones that stay on the sidelines and make excuses and try for 10 mins then say things dont work are excuse makers who whine all over places like FB instead of taking real action ",
            "date": "Answered March 29, 2020",
            "views": "352",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tushar Agarwal",
                "href": "/profile/Tushar-Agarwal-545"
            },
            "answer_text": "Well Indians have subtle approaches when it comes to earning all in the comfort of home! Play Housie! Invest some money and leave everything in your fate. When we say “ Ek din mein paisa double “ ( to get your money doubled in a day ) , we literally mean it !Have good typing skills ? There are bunch of online recruiters who want data typists. You will get a good pay for every page entry . Cheers :)Interested in tutoring ? There are some great platforms where you can be an educator . Infact , you may develop your career there . You can join :-Cheggs TutorUnacademy / VedantuToppr / Hashlearn and manyEven if you fail in all these , do remember that you are earning and saving lives, all in the comfort of your home. Thanks for reading! ",
            "date": "Answered April 24, 2020",
            "views": "686",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Madhura Tatkari",
                    "user_href": "/profile/Madhura-Tatkari"
                },
                {
                    "user_id": "Ankur Parikh",
                    "user_href": "/profile/Ankur-Parikh-5"
                },
                {
                    "user_id": "Majji Satish",
                    "user_href": "/profile/Majji-Satish-1"
                },
                {
                    "user_id": "Vishnu Raj",
                    "user_href": "/profile/Vishnu-Raj-689"
                },
                {
                    "user_id": "Hitesh Jain",
                    "user_href": "/profile/Hitesh-Jain-44"
                },
                {
                    "user_id": "Noel Kuppili",
                    "user_href": "/profile/Noel-Kuppili"
                },
                {
                    "user_id": "Prananshu Palandurkar",
                    "user_href": "/profile/Prananshu-Palandurkar"
                },
                {
                    "user_id": "Deepak Joshi",
                    "user_href": "/profile/Deepak-Joshi-120"
                },
                {
                    "user_id": "Anoop Balodhi",
                    "user_href": "/profile/Anoop-Balodhi-2"
                },
                {
                    "user_id": "Surya Shukla",
                    "user_href": "/profile/Surya-Shukla-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shishu Raj Pandey",
                "href": "/profile/Shishu-Raj-Pandey-3"
            },
            "answer_text": "Getting bored at Home due to Covid19 pandemic? Well you can Join Join Toluna and Earn free vouchers of upto Rs.5000 per month. You can Get Free PayPal Cash , Amazon/Flipkart Vouchers By Filling Small Surveys by enrolling in Toluna Survey. You can Earn points for every online surveys you completed. Offer Is Working On Below Given Cities Only : Kanpur, Indore, Jaipur, Vadodara, Surat, Nagpur, Lucknow, Bhopal, Coimbatore, Chandigarh, Vishakapatnam, Ludhiana, Varanasi, Allahabad, Rajkot, Madurai, Patna, Kamrup, Khordha, Ahmedabad, Bangalore, Chennai, Hyderabad, Kolkata, Mumbai, New Delhi & Pune !! How To Do This & Earn Free Voucher : Visit Here For the Offer Page To Get StartedFill Out Your First Name , Last Name , Your Date Of Birth & Gender In Given FormAnd Fill Out Your Genuine Email Address. Because New Surveys Will Come On This Email AddressClick on Submit buttonNow Open Your Email Box & Just Verify The Email You Received From TolunaNow Click on “START NOW” button and fill the details as per below instruction to attract more surveys/points !!Best Thing About Toluna Survey is : You Can Redeem Your Points in – PayPal Cash, Amazon , Flipkart VouchersDaily You Will Get 3-4 SurveysEach Survey Will Give Your More Then 2000 PointsSurvey Length is Very Shorter then other sitesLower Dis-Qualification Ration",
            "date": "Answered June 15, 2020",
            "views": "240",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Padmavathi R",
                "href": "/profile/Padmavathi-R-3"
            },
            "answer_text": "I am not sure if it is easy for you, surely you may take up an online teaching job like giving tuition to kids who are in need of good concept deliveries. Probably you can charge for the hours you work and that may give you good amount . Further you can register yourself as a certified teacher once you gain confidence and plan to work from home. Hope this information is useful. Stay home stay safe ",
            "date": "Answered June 28, 2020",
            "views": "35",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vikash Sharma",
                "href": "/profile/Vikash-Sharma-441"
            },
            "answer_text": "If you want to earn money during periods of lockdown. Don't worry I am telling about the some of the best platform, with the help you can earn a lot of money without any scams. Yes, it is absolutely the best platform. There are many platforms available on the Internet 1 ) freelancing 2 ) created your own website and blog 3) affiliated marketing 4) website degine 5 ) captcha 6) sell your own products 7) share your own experience in webinar If you want to know about the complete information you click links given below 14 Ways to make money online in (2020) without investment, no scams | blogareana ",
            "date": "Answered June 15, 2020",
            "views": "75",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Amjad Shuvo",
                "href": "/profile/Amjad-Shuvo-1"
            },
            "answer_text": "In spite of having locked down, people are earning money. Specifically the guys who are involved in informational technology can earn money. At present, you can still make money. If you are confined because of lock down, you can research web, you study how to start niche site business. It is one of the profitable and lucrative businesses. You can study about internet marketing. But you have to mind it that it is not easy process, you may be persuaded about earning. But it is not easy to earn. You have to know whole process how to earn. If you want to earn from online, you have to invest time more than money. You have to earn skilled. ",
            "date": "Updated May 19, 2020",
            "views": "273",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mishra Ayush",
                    "user_href": "/profile/Mishra-Ayush-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kailash Namata",
                "href": "/profile/Kailash-Namata-1"
            },
            "answer_text": "There are many ways to earn money. If you really want work from home and want to earn money online then you can do work on : YouTube : Make your channel on YouTube and try to upload your video regularly and when you are eligible for monetization then you can earn money through AdSense.Blogger : You can start your own blog all website where you can share your content and you can monetize your blog or website using many alternatives of AdSense infact you can monetize your blog or website using AdSense itself.Upwork : It is the platform where people use to hire influencers to complete their work and they pay for it.",
            "date": "Answered April 12, 2020",
            "views": "392",
            "upvotes": " Answer requested by Sripathi",
            "upvoters": [
                {
                    "user_id": "Ayman Alshaikh",
                    "user_href": "/profile/Ayman-Alshaikh-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chiru Sanjeevini",
                "href": "/profile/Chiru-Sanjeevini"
            },
            "answer_text": "The major source of income would be:- People are getting aware of health so if you are an expert then go to health sector.Or you can do digital marketing. As more people are in social media due to less jobs.You can do freelance such as designing a ad or content writing or anything you like.Keep in mind that it should be online. It is the main source of income in lockdown. And also try that it should be a software product. As people are afraid of the hardware ones. Thank you. ",
            "date": "Answered September 26, 2020",
            "views": "7",
            "upvotes": " Answer requested by Baby Dubey",
            "upvoters": [
                {
                    "user_id": "Rajat Godara",
                    "user_href": "/profile/Rajat-Godara-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prasanna Kumar",
                "href": "/profile/Prasanna-Kumar-1866"
            },
            "answer_text": "Actually it is interesting and valuable question you have posted I give three options you can choose better one Option 1. If you are good in content writing have video editing skills you can start YouTube channel. You can also work in freelance get clients make small deal in beginning you can earn in that also If you good in analysing SEO keywords you can start writing blogs. Option 2 If you have RS 50000 to 1lakhs in your account and have some share market trading knowledge you can do intraday or swing trading by predicting market price and direction. If you have confidence invest other wise it is huge risk to come this side. Option 3 Wake up In the morning sell idiyappam and I'm evening you can sell somasa in your streets it is simple at the end of the day you get much profit this business is done in my place getting huge crowd for this so you can also try Thanks for reading ",
            "date": "Answered July 22, 2020",
            "views": "72",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tushar Mishra",
                "href": "/profile/Tushar-Mishra-21"
            },
            "answer_text": "Every crisis comes with an opportunity. A large number of people are devastated due to collapse of business and profession during Covid times. The opportunity for you is to discover ways and means to mobilize them and restart their economic activity. There is none for them to empathize, guide, give innovative ideas and do the networking. They are in a vacuum. Helping them or creating Self-help groups, you can help yourself. ",
            "date": "Answered July 5, 2020",
            "views": "94",
            "upvotes": " View Sharers ",
            "upvoters": [
                {
                    "user_id": "Jibi Thomas",
                    "user_href": "/profile/Jibi-Thomas-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barbara Johanna",
                "href": "/profile/Barbara-Johanna-1"
            },
            "answer_text": "Launch your own business! Build networks. Networks of consumers and a handful of partners who do the same. There is a simple, duplicative system that is proven successful. You don’t need huge blocks of time to build this business, it’s not like a regular job where you have your 8-hour shifts. You gain time freedom and financial freedom. With this business you also become part of a large community of like-minded individuals who support you, empower you and always have your best interests in mind all while helping others in the process. This is a learn as you earn business. If this is something you feel you want to be a part of and want to learn more then I would be happy to share more information xx ",
            "date": "Answered May 6, 2020",
            "views": "323",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Manish Kapri",
                    "user_href": "/profile/Manish-Kapri-6"
                },
                {
                    "user_id": "Vikash Sharma",
                    "user_href": "/profile/Vikash-Sharma-441"
                },
                {
                    "user_id": "Manika Baiswar",
                    "user_href": "/profile/Manika-Baiswar-1"
                },
                {
                    "user_id": "Rupshali Dasgupta",
                    "user_href": "/profile/Rupshali-Dasgupta"
                },
                {
                    "user_id": "Pragya Chakraborty",
                    "user_href": "/profile/Pragya-Chakraborty-6"
                },
                {
                    "user_id": "Aastha Singh",
                    "user_href": "/profile/Aastha-Singh-275"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jarvis Peguese",
                "href": "/profile/Jarvis-Peguese"
            },
            "answer_text": "In my opinion, the major source of earning in this lockdown period involves the internet with online related activities. We are still experiencing some form of social distancing and traditional business closures which have created a completely new normal that is nothing like 20 years ago! Today, the internet is the foundation for the majority of our interactions and is quite impersonable. We are utilizing the internet for every fiber of our being, including shopping, working, dating, and entertainment. With this increased usage comes increased revenue streams of all sorts. In summary, statistics show the probability of this continuing post lockdown. Now is the time to get on board and make the internet a major source of your earning during this period of uncertainty. ",
            "date": "Answered September 25, 2020",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dale Gore",
                "href": "/profile/Dale-Gore"
            },
            "answer_text": "The Hustle. Do something well enough people want to pay you to do it. People might be worried about being in public, with the public. Grocery getter. Any errand people don't want to get out and do themselves. Perfect time for a ten speed and a small town. ",
            "date": "Answered May 19, 2020",
            "views": "46",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shubham Tiwari",
                "href": "/profile/Shubham-Tiwari-2108"
            },
            "answer_text": "Most hot question during lockdown , There are many answers available on the internet ,on some of them you are met with online fraud .So be aware ,i am giving some idea to you how can you earn in lockdown *Freelancing There are many websites available for which you can work (like content developer , doubt solver etc) *Blogging Long term work ,but once you became pro at this than you could do it as a full time *Make YouTube videos As education affects the most so you can make video on YouTube as per your interest So there are some options on which you can work sincerely ",
            "date": "Answered July 6, 2020",
            "views": "50",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hardik Bhuva",
                "href": "/profile/Hardik-Bhuva-8"
            },
            "answer_text": "see lock down is big opportunity for learn something new,so during this period i recommend to you select any online field like blogging, digital marketing as per your intrest and become expert that perticuler field, than you can earn money from your niche, but this prossess is so hard so , you cane make your youtube channel on youtube and build your brand but startig some month you can not earn money becuars its take a time. ",
            "date": "Answered September 18, 2020",
            "views": "23",
            "upvotes": " Answer requested by Baby Dubey",
            "upvoters": [
                {
                    "user_id": "Shivam Kumar",
                    "user_href": "/profile/Shivam-Kumar-8238"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nishant Kumar",
                "href": "/profile/Nishant-Kumar-4511"
            },
            "answer_text": "There are lot of options to make money online. It depends how much efforts you want to give to earn money. I am a full time freelancer I make 50k to 60k per month. I do web development. You can learn web design or web development in 3 months and then start freelancing. I know there are other cheap ways which others will offer you but you can not make real money other than recharging your phone. ",
            "date": "Answered June 30, 2020",
            "views": "153",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rajat Godara",
                    "user_href": "/profile/Rajat-Godara-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Divyesh Harwani",
                "href": "/profile/Divyesh-Harwani"
            },
            "answer_text": "There are many ways to earn money during this lock down period. Freelancing- There are many websites where you can do freelancing, like making reports in word, making excels etc. (MS office related work.). If you are a software enginner, than you can develope softwares and websites for the customers who posts their requirements on freelancing websitesYou can start a blog or vlog. Ofcourse it will take sometime to get established. After that you can apply for adsense or any ad based company to post ads on your blog and vlog to monatize it.Data entry work. But it is hard to find genuine one.",
            "date": "Answered March 29, 2020",
            "views": "570",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lanita Ballard",
                    "user_href": "/profile/Lanita-Ballard"
                },
                {
                    "user_id": "Kimberly Gray",
                    "user_href": "/profile/Kimberly-Gray-45"
                },
                {
                    "user_id": "Gin Richman",
                    "user_href": "/profile/Gin-Richman"
                },
                {
                    "user_id": "Gia Paul",
                    "user_href": "/profile/Gia-Paul"
                }
            ]
        },
        {
            "author_info": {
                "name": "MyselfDee",
                "href": "/profile/MyselfDee"
            },
            "answer_text": "Nowadays it is easy to earn money online or work from home in this lockdown. There are plenty of online business lets discuss the top 5 online business ideas or work from home in this lockdown. Share MarketyoutubeE-commerceWebsite(BLogging)Social mediaTo Know more about this business in which I will discuss how to start it and what is the benefit of this business, its starting cost and earning potential. Click to know more  ",
            "date": "Answered May 27, 2020",
            "views": "46",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Peter Joseph",
                "href": "/profile/Peter-Joseph-188"
            },
            "answer_text": "People can earn through various methods, like wise: a) Open a Youtube channel and start uploading videos. Once it gets monetize you can earn handsome revenue from it. b) Join Quora Partner Program and earn via online. c) Login to Shutterstock contributor, wherein you have to post HD images and get it revenue generate as and when your images will be downloaded by anyone. ",
            "date": "Answered June 15, 2020",
            "views": "46",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kevin Thomas",
                "href": "/profile/Kevin-Thomas-1217"
            },
            "answer_text": "Well, this is one of the questions which most of us are thinking about. Maybe it's time for a business. Look for the investors or the funds and start a business. Something that is going in the market of your place. Even small profits initially would do. For example Roadside vendors they change their business as per the demand within no time and they end their day with minor profits. in my opinion, I consider them as entrepreneurs because They are ready to take risksThey also need fundsHave heavy competitionThey look for market segmentation and the right place for their business.Give a thought for this. ",
            "date": "Answered June 23, 2020",
            "views": "220",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jyoti Biswas",
                "href": "/profile/Jyoti-Biswas-64"
            },
            "answer_text": "One can earn money through online aaps by posting pics and playing games Some of those apps are Instagram , Kiki , mpl etc. You can win prizes on Amazon fun zone .these aaps may take some time , but as it starts growing it will go on . But it's hard to get a accurate job as whole of the system has been slowed down. ",
            "date": "Answered June 13, 2020",
            "views": "38",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Devashree Shukla",
                "href": "/profile/Devashree-Shukla-1"
            },
            "answer_text": "If you are an expert at something then you can register yourself as a trainer on platforms like Udemy, unacademy, etc. Similarly, that same expertise can be written in the form of a blog and you can monetize your blog. There is this person called google which will give you the best tips on how to make money through blogging. IT WORKS. You can work as a “Virtual Assistant”. You will be surprised to see the number of job listings for this particular position. You get to work from home, do the job of an office assistant, and get paid for it. I hope that helps. ",
            "date": "Updated June 13, 2020",
            "views": "27",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Misbah Khan",
                    "user_href": "/profile/Misbah-Khan-377"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ritesh Singh",
                "href": "/profile/Ritesh-Singh-129"
            },
            "answer_text": "FYI - Lockdowns have not been imposed on people's earnings or means of earning😊✌️ If you have a reasonably good idea, concept or modus operandi to execute something productive for a monetary return, you will definitely earn revenue. May be the margins may be lower when compared to earlier times but that shouldn't matter till its cost plus, right🤔 If you meant to ask the ways you could earn Earning a job with stipulated salary annonced & mentioned along with offer letter.Business venture irrespective of the scale of business.As a Freelancer with the core forte on acquired knowledge & skill set learnt so far in your life.Good luck🙏 ",
            "date": "Answered May 29, 2020",
            "views": "157",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sukanya Sake",
                    "user_href": "/profile/Sukanya-Sake"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arpit Gupta",
                "href": "/profile/Arpit-Gupta-1488"
            },
            "answer_text": "Lock down has not only become a point of pain. It also become the point of gain for many The biggest example of this is RELIANCE JIO has successfully raised the fund of more than 100k cr. In just few months and with this also they manage to start there new venture that is JIO MART which is the need of hour in this Peridemic. Other than this many small business also earned a good amount with there innovative ideas of sanitizing machine or some other Innovative ideas Some startup earned with new concept of WORK FORM HOME Many online education startup earned with there content only ",
            "date": "Answered June 15, 2020",
            "views": "76",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jacinda Kayla",
                "href": "/profile/Jacinda-Kayla"
            },
            "answer_text": "Here are some tips to earn money during the lockdown period : Be an online tutor / give online coursesStart a youtube channel (to maybe show your skills or any content really!)Start a blog post (about anything that interest you!)Start a podcastSell off ur unwanted clothes or things onlinehopefully these would help! ",
            "date": "Answered April 9, 2020",
            "views": "144",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jagdip Madaan",
                    "user_href": "/profile/Jagdip-Madaan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sanjay Mondol",
                "href": "/profile/Sanjay-Mondol-2"
            },
            "answer_text": "Lots of websites are in google and lots of things to do with the internet. Let's describe this briefly. There are some websites in google who's are Legitbale. They are actually giving money to do some easy task like data entry, copy pasting, email scraping, social network engagement. etc. If you have some skill like website design, logo design, SEO, Email marketing etc, then you can definitely earn money only from work in your home. I suggest you three websites where you get lots of clients who's are actually need people for there task and they are come to this platform to search people and hired as per there requirements. Freelancer.comUpwork | Hire Freelancers. Make things happen.http://Peopleperhour.comMore related queries do follow my blog ; Build Traffic online ",
            "date": "Answered March 30, 2020",
            "views": "132",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Misbah Khan",
                    "user_href": "/profile/Misbah-Khan-377"
                },
                {
                    "user_id": "Mohammad Kamran Farogh",
                    "user_href": "/profile/Mohammad-Kamran-Farogh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shakir Husain",
                "href": "/profile/Shakir-Husain-98"
            },
            "answer_text": "hi friends, if you want to earn money in lock down from home then you have to follow some tips which i am giving you in this article.. firstly in today's modern world it is easy to earn online from home no tension just follow some tips.. let you know how to earn from home first you have to make a website and to register it on google and other business search engines and on this after registration now you can list your business on the search engines.. now you have to list your business on to them.. now you are visible to google searches that will explore you more then you need.. it is so easy to get money from google with home.. ",
            "date": "Answered July 15, 2020",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jonny Parker",
                "href": "/profile/Jonny-Parker-4"
            },
            "answer_text": "Start a blog There is a massive demand for online content right now. People all over the world are seeking information, looking for inspiration, and reading content in hopes of passing by the time. Now, you may not make money at first. Blogging can be a process, but you can set yourself up for success long term if you start to become a thought leader in a subject that you have knowledge in. ",
            "date": "Answered April 22, 2020",
            "views": "309",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mohammad Kamran Farogh",
                    "user_href": "/profile/Mohammad-Kamran-Farogh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rohan Gunjal",
                "href": "/profile/Rohan-Gunjal-11"
            },
            "answer_text": "Don't think about earning right now, just enjoy your time what you have got witj your close ones. These time is not going to come, maybe these same peoples will be not there in some other time. Just enjoy these moment, stay happy, stay safe, stay home. But to earn as a business advisor i will surely suggest you one small business idea, But after lockdown you can implement till arrange some research work about market, What will be in high demand just after lockdown gets over start? Do research on these part and start promoting now these will create you client base for future. ",
            "date": "Answered April 24, 2020",
            "views": "139",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ajay",
                "href": "/profile/Ajay-1226"
            },
            "answer_text": "Hey Dear , First thing there is no short to earn money and if you tried you might loose your own money like I did. Second, Just invest your money on your own skills and try to inbuilt new skills if you want to go long way in your life . Third , Everyone wants to earn more and more money but few one succeeded And there is lots of info available for part time / work from home on YouTube but it seems doesn't work for us. Fourth , Right now we have ample amount of time so don't think much , enjoy this time with your loved ones , take care of family well-being. #Stayhome #Staysafe Thanks for reading !!! ",
            "date": "Answered April 24, 2020",
            "views": "304",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rishad K",
                "href": "/profile/Rishad-K-10"
            },
            "answer_text": "Affiliate marketing is the best and easiest way to make your quarantine productive. People are choosing this particular platform because of its convenience and affordability. You don’t need any kind of previous experience to get started. if you’re really looking for a legit platform to get started your affiliate marketing business in this lockdown time, link in my bio. Check it out. All the best  ",
            "date": "Answered June 28, 2020",
            "views": "97",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aman Singh",
                "href": "/profile/Aman-Singh-3159"
            },
            "answer_text": "Hello, You can start freelancing by registering on any of the freelancing portals i.e fiverr, upwork, truelancer, etc. You can also start blogging on Blogger.com - Create a unique and beautiful blog. It’s easy and free (free platform). I had also done the same thing.  First, I started to write blogs on Blogger.com - Create a unique and beautiful blog. It’s easy and free.. Then, I created my own ezKnowledge.in - Expertise your thoughts . It is managed by me and my friends. We write articles on a daily basis. We have written on many topics that might interest you. Thank You ",
            "date": "Answered May 6, 2020",
            "views": "122",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ravishankar Singh",
                    "user_href": "/profile/Ravishankar-Singh-129"
                }
            ]
        },
        {
            "author_info": {
                "name": "Srinica Hampi",
                "href": "/profile/Srinica-Hampi"
            },
            "answer_text": "If you're really strapped for cash and have time on your hands, the easiest way to make money right now, is through internships. Just check out the work from home internships at any job portal and apply. Given how the market is crumbling, business are looking for people who can do important work for a quick buck rather than deal with the hassle of processing full time employees. ",
            "date": "Answered April 16, 2020",
            "views": "252",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Anjana Sharma",
                    "user_href": "/profile/Anjana-Sharma-526"
                },
                {
                    "user_id": "Neha Goyal",
                    "user_href": "/profile/Neha-Goyal-433"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amit Singh",
                "href": "/profile/Amit-Singh-795"
            },
            "answer_text": "According to me, there are two methods to earn money. And I would like categorise it further. Short term method.Long term method.In Short term method you can do below things to earn some. 1.1 - Freelance your skills. 1.2 - You can make money from stocks. 1.3 - You can Instruct online on topics related to your experience and skill. In Long term method. 2.1 - Blogging 2.2 - Vlogging (video+blogging) And yes I would suggest to invest in your interest areas so this will open door of multiple income sources. ",
            "date": "Answered June 15, 2020",
            "views": "194",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ambuj Kumar",
                "href": "/profile/Ambuj-Kumar-29"
            },
            "answer_text": "Lets start a fashion mask company. I will encourage fellow indians to wear masks despite the crisis being over. We will become the safest country ever. By promoting masks maybe i will increase tourism revenue. Maybe because of this the government will financially support this regime. Think about this guys, why stop the hygine. Who's with me? Google tokyo ghoul masks. Now imagine if someone sticks an N95 mask behind it and makes it replaceable and sells it. It would be EPIC. Yayy. Maybe high integrity states like tamil nadu would accept it gratefully. ",
            "date": "Answered March 30, 2020",
            "views": "372",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mani Singh",
                    "user_href": "/profile/Mani-Singh-939"
                },
                {
                    "user_id": "Madhu Singh",
                    "user_href": "/profile/Madhu-Singh-1185"
                },
                {
                    "user_id": "Rajesh Gupta",
                    "user_href": "/profile/Rajesh-Gupta-3431"
                },
                {
                    "user_id": "Rohni Singh",
                    "user_href": "/profile/Rohni-Singh-4"
                },
                {
                    "user_id": "Irfan Khan",
                    "user_href": "/profile/Irfan-Khan-3976"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Little Eagle-Freeman",
                "href": "/profile/John-Little-Eagle-Freeman"
            },
            "answer_text": "Amazon.comBonanza.eBay.eBid.iOffer.Listia.Mercari (app)Oodle.Advertising Services Available on ???JobsTop 10 Internet Sales TechniquesOnline Shopping for Electronics, Apparel, Computers, Books, DVDs & more.",
            "date": "Answered June 21, 2020",
            "views": "95",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ransjsj",
                    "user_href": "/profile/Ransjsj"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ganesan M",
                "href": "/profile/Ganesan-M-152"
            },
            "answer_text": "WORK FROMHOME WITH OUT ANY INVESTMENT. WORK WHENEVER YOU ARE FREE NO EXPERIENCE REQUIRED. NO QUALIFICATION REQUIRED. POTENTIAL TO EARN RS 5000 TO 50000 BASED ON THE BUSINESS GENERATED BY YOU. IF YOU ARE INTERESTED YOU CAN JOIN Some Direct Selling Companies like Amway, Vestige etc Now Every thing online. During this period you can work from home online. Unlimited income. . ",
            "date": "Answered June 16, 2020",
            "views": "160",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anshi Gupta",
                "href": "/profile/Anshi-Gupta-89"
            },
            "answer_text": "You have enough time to explore your hidden talents. Who says one can not earn by following passion. If you are a good writer it's a good time for your first novel or a book. If a cook why not start a bakery at home. There is @Internshala they have some internships option that you can apply for and will be paid too. ",
            "date": "Answered July 14, 2020",
            "views": "29",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Harsh Panchal",
                    "user_href": "/profile/Harsh-Panchal-280"
                },
                {
                    "user_id": "Vasanthi Rao",
                    "user_href": "/profile/Vasanthi-Rao-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aryan Thakur",
                "href": "/profile/Aryan-Thakur-429"
            },
            "answer_text": "You can earn a lot of money during lockdown. If you want Make Money Online and you want to live a financial freedom life. And you want to Monetize your website/blog without adsense and want to earn a lot of money. Then check My Bio. For check My Bio Click on my name and click on read more. ",
            "date": "Answered May 26, 2020",
            "views": "70",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mehnaz Amjad",
                "href": "/profile/Mehnaz-Amjad-3"
            },
            "answer_text": "If you are a daily wage earner or someone into business which now stands shut due to the ongoing lockdown You need to reach out to the Govt authorities of your location , there is a relief announced for many, you can check how much you can get from it based on your employment condition . There is no other way to earn money in this lockdown period ",
            "date": "Answered March 26, 2020",
            "views": "352",
            "upvotes": " Answer requested by Ram Rachure",
            "upvoters": [
                {
                    "user_id": "Sukanya Sake",
                    "user_href": "/profile/Sukanya-Sake"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sanket T",
                "href": "/profile/Sanket-T-5"
            },
            "answer_text": "Yes my friend you can earn during this lockdown you can do affilitade marketing or do blogging as we all are lockdown in our home we all are ordering from social media site and day by day the number on social media is rising …socail media is the best platfrom to earn money…1st learn about social media it will help you grow ",
            "date": "Answered May 27, 2020",
            "views": "86",
            "upvotes": " Answer requested by Omkar Bhoir",
            "upvoters": [
                {
                    "user_id": "Daisy Hudson",
                    "user_href": "/profile/Daisy-Hudson-3"
                },
                {
                    "user_id": "Gia Paul",
                    "user_href": "/profile/Gia-Paul"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mohan Reddy",
                "href": "/profile/Mohan-Reddy-393"
            },
            "answer_text": "Lockdown has thrown open lot of new avenues for making money…u have to be open to these roles and consider them as dignity of labor and not go by the role or what others think if you are broke specially, like the IT girl from Hyderabad who started selling vegetables…so here are some… Online Tuition's Home Tuition's - huge range of subjects…incl computers Delivery Boys - very high demand, range of products… Home fitness instructors Home cooked food - special dishes to name a few Hair stylist/dresser - home visit ",
            "date": "Answered August 12, 2020",
            "views": "110",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Anggi Sasmito",
                    "user_href": "/profile/Anggi-Sasmito"
                },
                {
                    "user_id": "Taras Koniukhov",
                    "user_href": "/profile/Taras-Koniukhov"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nancy Raymond",
                "href": "/profile/Nancy-Raymond-35"
            },
            "answer_text": "I think affiliate marketing is the best way to make money online. I am already doing this so I know that this is the best way to make money online. You don't need any product or website to promote products. There are lots of affiliate sites on the internet just google “affiliate marketing sites\" and you will get lots of sites. ",
            "date": "Answered August 8, 2020",
            "views": "25",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sidhanta Sahoo",
                    "user_href": "/profile/Sidhanta-Sahoo-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mohammed Mufeez",
                "href": "/profile/Mohammed-Mufeez-5"
            },
            "answer_text": "You can earn money . *Freelancer that gives your opportunity based on your skills. *Fiver you need to work smart on time . *Upwork gives your many opportunities staying home learn many thing and do work and earn more than enough that much you can earn. *YouTube based on your talent ,what your going to do it's also helps you in earn money. *Blogger you can create your own blogger to give information to audience based views you can earn money. *Aliffiate marketing .. ",
            "date": "Answered April 12, 2020",
            "views": "297",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marlene Hessler",
                "href": "/profile/Marlene-Hessler"
            },
            "answer_text": "Lockdown is all but over. Only the dims are doing everything to drag it out. Deaths from the china virus are way way down. It i running its course through the younger more immune folks is all that’s happening. Lots of minor cases, very few deaths. time to get on with it. ",
            "date": "Answered July 1, 2020",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "La Excellence IAS",
                "href": "/profile/La-Excellence-IAS-1"
            },
            "answer_text": "It depends on your Time Management, Skills. If you are interested in business then go for a Grocery Shop. In this lockdown many people started grocery shops because the only business which government officially allows was Traders Shops as they are the things which were used by the people in their daily life. If your are interested in learning anew technology, This is the right time to learn and make money. ",
            "date": "Answered May 14, 2020",
            "views": "96",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sunny Saraff",
                "href": "/profile/Sunny-Saraff"
            },
            "answer_text": "If you have enough knowledge to guide someone or able to solve some doubts of certain students…I recommend to use HASLEARN app , and sign in as a tutor. Basically ,This app is for students who holds the doubts in certain subject , doubts of JEE and NEET related questions. For a tutor login, you have to pass a certain entry test to login for that and it would be rather easy to work and earn money after passing the test. May be initially , you feels different but as you starts solving doubts of students , you will be accordingly paid for your every minute of work. ",
            "date": "Answered August 10, 2020",
            "views": "54",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mark John",
                    "user_href": "/profile/Mark-John-427"
                },
                {
                    "user_id": "Kaushik Gohil",
                    "user_href": "/profile/Kaushik-Gohil-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pabalkar",
                "href": "/profile/Gajanan-37"
            },
            "answer_text": "It will be incorrect to advise at this moment. Your interest, ability and caliber is unknown. I would for an instance think that you are like me. Above is always good. I work from home and make both ends meet. I don't like sitting idle. You to can do that. Find at your place what suit you and get on to it. ",
            "date": "Answered August 10, 2020",
            "views": "13",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Misbah Khan",
                    "user_href": "/profile/Misbah-Khan-377"
                }
            ]
        },
        {
            "author_info": {
                "name": "Divyanshu Shekhar",
                "href": "/profile/Divyanshu-Shekhar-89"
            },
            "answer_text": "There are lot of ways some are as follow E commerce ( drooshipng, online marketing)Trading ( stock market , investment, crypto currency )Online course selling ( related to programming language or subject related to specific stream )Freelancer( you should have a good portfolio for that )Online tutoring",
            "date": "Answered June 19, 2020",
            "views": "73",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Manish Kapri",
                    "user_href": "/profile/Manish-Kapri-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Al Hagopian",
                "href": "/profile/Al-Hagopian"
            },
            "answer_text": "We’re making more than ever in network marketing, and also helping others do same. In two recent months helped 25 and 82-year-old women each reach $10K in a month. Overall company sales up 45% in March as we provide two things people need: 1— Boost immune system 2—-Work from home ",
            "date": "Answered April 12, 2020",
            "views": "189",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sydney Nyamurera",
                    "user_href": "/profile/Sydney-Nyamurera"
                }
            ]
        },
        {
            "author_info": {
                "name": "Irfan Khan",
                "href": "/profile/Irfan-Khan-1883"
            },
            "answer_text": "Online earning is the big and best tool to earn money in lock down condition So like that YouTube ,Facebook, Twitter and so other ",
            "date": "Answered May 29, 2020",
            "views": "144",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kapil Rajput",
                    "user_href": "/profile/Kapil-Rajput-186"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raghav Gautam",
                "href": "/profile/Raghav-Gautam-19"
            },
            "answer_text": "Learn a skill and start doing freelancing.Solve some problems on Chegg.Fill out surveys (not recommended).Make something craftily and sell it online.Rent out your Car.Start writing BlogsOnline Tutoring.There are a lot more, lemme know if you want more. ",
            "date": "Answered July 15, 2020",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Abhishek Kumar Sahu",
                "href": "/profile/Abhishek-Kumar-Sahu-37"
            },
            "answer_text": "As I always wanted to do something, and searching for opportunities, the same way in this lockdown I got an opportunity to join an Affiliate Marketing Business who sells digital products Through out the globe. Now I can say, yes I have utilised this lockdown time and have learnt a skill through which I can earn from my home. And I can proudly tell everyone one within this lockdown I have Earned 20K. So yes, opportunities are everywhere you just need to grab it. I would recommend you learn Affiliate Marketing. ",
            "date": "Answered April 29, 2020",
            "views": "95",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Amanpreet Singh",
                    "user_href": "/profile/Amanpreet-Singh-1316"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mohamed Jamsheer JMX",
                "href": "/profile/Mohamed-Jamsheer-JMX"
            },
            "answer_text": "It really depend on the way you wanna earn the money bro. If have relevant skills and lot of time you can make money without any investment bit if you’re competition is high then you have to find a way to invest in someting and earn money from that ",
            "date": "Answered July 9, 2020",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ravi Kant Tigga",
                "href": "/profile/Ravi-Kant-Tigga"
            },
            "answer_text": "Upgrade your skills , if you are able try to take online courses ,learn new things that will give you a job. I already have similar question answer so please check my profile where I shared my answer how I am trying to learn new skills. ",
            "date": "Answered June 3, 2020",
            "views": "32",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abhi Khari",
                    "user_href": "/profile/Abhi-Khari-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ajitkumar Padhi",
                "href": "/profile/Ajitkumar-Padhi"
            },
            "answer_text": "Yes there is a way you can earn from following websites a ptc site you can refer to this link Earn money online from neobux: Since 2009 | Techniyojan A survey site valued opinions to earn you shopping vouchers and later you can purchase your product that you need..Earn from Survey Jobs: Valued Opinions | Techniyojan http://Freelancer.com… for more you can view my channel and subscribe for same    ",
            "date": "Answered April 28, 2020",
            "views": "67",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ajith",
                "href": "/profile/Ajith-182"
            },
            "answer_text": "Can prepare home wines n sell it as more demand Chocolates too Cakes n pastries since bakery is closed Tees design Shoe designing Cookies as lot demand Bike service Saloon n parlours Can make more money in this.. ",
            "date": "Answered May 1, 2020",
            "views": "66",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Gia Paul",
                    "user_href": "/profile/Gia-Paul"
                },
                {
                    "user_id": "Sanjay",
                    "user_href": "/profile/Sanjay-1271"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mehedi Hasan Zihad",
                "href": "/profile/Mehedi-Hasan-Zihad-1"
            },
            "answer_text": " I am already providing a article which can helped you how to earn money online in this lockdown time… How can I earn money now online in lockdown since I lost my job and need money? ",
            "date": "Answered April 12, 2020",
            "views": "194",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bindu Jangid",
                    "user_href": "/profile/Bindu-Jangid-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Colleen Farrelly",
                "href": "/profile/Colleen-Farrelly-1"
            },
            "answer_text": "Yeah, if they still have jobs. Most people haven’t lost jobs. They’re being paid. Some have had to take paycuts to avoid the company folding. They’re being paid. It’s hit some sectors hard, and the people who lost jobs aren’t being paid by their former employers. ",
            "date": "Answered May 8, 2020",
            "views": "414",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mohammad Kamran Farogh",
                    "user_href": "/profile/Mohammad-Kamran-Farogh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sayantani Sengupta",
                "href": "/profile/Sayantani-Sengupta-19"
            },
            "answer_text": "Apply for work from home in various companies, search on Google to find plenty of them. open your own online business. Anything online is suitable now, even you can provide online education. Please upvote and follow if you find it useful. ",
            "date": "Answered August 9, 2020",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Niki Solanki",
                "href": "/profile/Niki-Solanki-5"
            },
            "answer_text": "You can intrest to earn lots of money online in lockdown. You can make your interest create a blog. To create your website and adsense to google and earn money to more traffic. Second your skills to make videos in youtube to earn 💰 money. ",
            "date": "Answered May 27, 2020",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brad Marcus",
                "href": "/profile/Brad-Marcus-8"
            },
            "answer_text": "1 Check for government schemes and plans 2 Get paid to write online 3 Become a virtual assistant 5 Make money by taking surveys 6 Rent out your driveway 7 Try online tutoring ",
            "date": "Answered June 17, 2020",
            "views": "29",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Suman Mohapatra",
                    "user_href": "/profile/Suman-Mohapatra-33"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harsh Raj",
                "href": "/profile/Harsh-Raj-2152"
            },
            "answer_text": "Harsh Raj's answer to I lost ₹20,000 on an online booking website and I’m a student, are there any ways to make some money? I had written best answer related to it you can read it ",
            "date": "Answered May 11, 2020",
            "views": "206",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shivam Kumar",
                    "user_href": "/profile/Shivam-Kumar-8238"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shweta Tiwari",
                "href": "/profile/Shweta-Tiwari-675"
            },
            "answer_text": "the best way to make money in this lockdown period is affiliate marketing or network marketing. affiliate marketing and network marketing gives the opportunity to do work from at home without disturbing your current work ",
            "date": "Answered June 13, 2020",
            "views": "12",
            "upvotes": " Answer requested by Adam Max",
            "upvoters": [
                {
                    "user_id": "Misbah Khan",
                    "user_href": "/profile/Misbah-Khan-377"
                }
            ]
        },
        {
            "author_info": {
                "name": "Puneet Rawtani",
                "href": "/profile/Puneet-Rawtani"
            },
            "answer_text": "Hey Vikash, How do i earn my money during lockdown should be the question and the answer to that is that i have a job wherein i work for a company which pays me money and with many company employees doing work from home i too work from home and by the start of every month i get paid. ",
            "date": "Answered May 6, 2020",
            "views": "24",
            "upvotes": " Answer requested by Vikash Sharma"
        },
        {
            "author_info": {
                "name": "Whysand Ways",
                "href": "/profile/Whysand-Ways"
            },
            "answer_text": "Yeah this is my favorite question ;) In order to earn money you should have some skill. So utilize your time and convert it into productive activities like enroll online training in your interest subjects gain knowledge from it, Lear music instruments, Read books etc… Apply your knowledge and convert into make money… Share your opinion. Thank you. ",
            "date": "Answered April 1, 2020",
            "views": "48",
            "upvotes": " Answer requested by Deven Jaiswal"
        },
        {
            "author_info": {
                "name": "Bhanu Prakash Reddy Chaganti",
                "href": "/profile/Bhanu-Prakash-Reddy-Chaganti"
            },
            "answer_text": "Hi , Hope you are asking good ways to earn from Home, If so, this is what I can suggest Option1:- (Can earn Rs.2000 -3000 per month) Good options are by filling the Surveys: a) Surveysavvy b) Indiaspeaks c) toluna Option2:- The future is for Digital currency and beauty is now they are available free of cost now. Registering to Cryptocurrency websites (No investment needed and upon registration once gets 500 Ecoins and can sell them immediately, if needed but would recommend to hold for 3–4 years and can get decent amounts).Link no1: here. (just need Email and Phone number to register).Link no2: Download app from Play store by name “Pi Network “ & please enter invitation code “prakashbch12”.Invest wisely and good luck.. ",
            "date": "Answered August 11, 2020",
            "views": "59",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Hardik Rathod",
                "href": "/profile/Hardik-Rathod-223"
            },
            "answer_text": "Start your own business affiliate marketing and daily passive income generate U can join my team members and support and free training provided and daily 125$ to 250$ instantly 100% cumission…. ",
            "date": "Answered May 29, 2020",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sachin Mehrotra",
                "href": "/profile/Sachin-Mehrotra-7"
            },
            "answer_text": "Dear Friend, There are many ways in which you can utilise this lockdown period. There may not immediate methods of making money on any new start up but definitely you can start exploring freelance assignments available on net. These assignments could be related to copy paste, data entry, blog writing, content writing etc. Regards ",
            "date": "Answered April 23, 2020",
            "views": "133",
            "upvotes": " View Sharers"
        },
        {
            "author_info": {
                "name": "Rajat Godara",
                "href": "/profile/Rajat-Godara-2"
            },
            "answer_text": "I am earning by freelancing and YouTube. And my major income comes from PUBG. Their are various apps which organise tournament and gives you money on per kill. My father is a government Employee ,so his salary is not stopped. If you are a good player of PUBG than upvote the answer , follow me and then contact me by message in Quora, I will give you a chance to play a tournament with me . ",
            "date": "Answered March 30, 2020",
            "views": "224",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Steven Rutseek",
                "href": "/profile/Steven-Rutseek"
            },
            "answer_text": "Of course. From the home office, for example. There are also system-relevant jobs that are not affected by the lockdown. But in fact, many self-employed and freelancers, as well as artists, suffer extremely and it is a difficult time for them. ",
            "date": "Answered May 3, 2020",
            "views": "164",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Shubham Chhoda l WEB DESIGNER",
                "href": "/profile/Shubham-Chhoda-l-WEB-DESIGNER"
            },
            "answer_text": "My suggestion is if you are interested in writing just write down some of the blogs, or write just write the thing u are interested or do whatever you are love to do like dancing painting cooking, etc. ",
            "date": "Answered March 27, 2020",
            "views": "255",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Ansu Limboo",
                "href": "/profile/Ansu-Limboo"
            },
            "answer_text": "There are many way to earn money in this lockdown period. But main way to earn money is through Freelancing you just type or copying paste the project and earn money in hour. Here are some of website where you can start freelancing: Freelancing, Upwork and Fiverr. ",
            "date": "Answered May 10, 2020",
            "views": "48",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Abhishek Pakhale",
                "href": "/profile/Abhishek-Pakhale"
            },
            "answer_text": "You seems to be medical student. So I will suggest to study hard. Don't run behind Money. Anyway it will come to you in next few years 🙂. But this study time won't come again😃 ",
            "date": "Answered August 7, 2020",
            "views": "155",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Shanmugam Sundaramoorthy",
                "href": "/profile/Shanmugam-Sundaramoorthy-1"
            },
            "answer_text": "More important. Whatever money you have, do not loose it by putting into anything. First safeguard it in accounts which cannot be attached in courts. Post office, NABARD bank are examples. ",
            "date": "Answered September 7, 2020",
            "views": "34",
            "upvotes": " Answer requested by Ram Rachure"
        },
        {
            "author_info": {
                "name": "Nil Dev",
                "href": "/profile/Nil-Dev-1"
            },
            "answer_text": "If you have knack for writing and you are a graduate/post graduate, then freelancing in the content writing industry can fetch you some pretty good amount of money if you manage to find a trustworthy company. ",
            "date": "Answered May 29, 2020",
            "views": "116",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Suman",
                "href": "/profile/Suman-257"
            },
            "answer_text": "It's not possible to earn money from home unless you get some good platform. So, I have come up with an idea of trading in stock market. For this you will have to learn technical analysis. Join my technical analysis course and pay fee after the course is completed. First time of this kind of offer in India!!  ",
            "date": "Updated June 3, 2020",
            "views": "142",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "DilSe Indians",
                "href": "/profile/DilSe-Indians"
            },
            "answer_text": "You have to go online for some freelancing work here you can find some money in this hard time but how have to work hard to get money For more info -  ",
            "date": "Answered June 3, 2020",
            "views": "17",
            "upvotes": " View Sharers"
        },
        {
            "author_info": {
                "name": "Ranjana Makam",
                "href": "/profile/Ranjana-Makam"
            },
            "answer_text": "There are various ways to earn money. If you affiliate marketing, online digital marketing, social media marketing. I have just read but not sure. If you have money, then put in mutual funds. Now you can grab the opportunity. Regards Xyz ",
            "date": "Answered April 12, 2020",
            "views": "160",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Javier Ramos",
                "href": "/profile/Javier-Ramos-138"
            },
            "answer_text": "Learn how to trade Bitcoin or Stocks, it can be done in just a couple of hours a day and if you get good at it you can make a lot of money, no need to invest a lot of money either, you can start with Robinhood with very little and you can learn until you are profitable. ",
            "date": "Answered May 18, 2020",
            "views": "46",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sudhir Yadav",
                "href": "/profile/Sudhir-Yadav-892"
            },
            "answer_text": "There are many things you can do in lockdown periods like you can start a youtube channel or start learning stock trading. ",
            "date": "Answered June 30, 2020",
            "views": "26",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Toba Opeyemi",
                "href": "/profile/Toba-Opeyemi"
            },
            "answer_text": "Amazon kindleAmazon affiliateDropshippingBloggingCreating and monetizing websitesFiverrEcommerceSelling products offline and onlineClickbank affiliateSurvey",
            "date": "Answered April 20, 2020",
            "views": "122",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Divy Patira",
                "href": "/profile/Divy-Patira"
            },
            "answer_text": "There are many freelancing websites which can provide you employment in many ways just sitting at your home, one can make a profile on such websites and find a work according to there skills and earn money. ",
            "date": "Answered August 30, 2020",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mukesh Jangid",
                "href": "/profile/Mukesh-Jangid-44"
            },
            "answer_text": "I have already answered this question. Please find below link for answer. (Mukesh Jangid's answer to How can I learn or earn money from home during a lockdown?) Thanks God bless :) ",
            "date": "Answered May 30, 2020",
            "views": "91",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Bhushan Marke",
                "href": "/profile/Bhushan-Marke"
            },
            "answer_text": "Freelancer website visit you and your any skill expert choice any one skill and earn money online best option are earn mony ",
            "date": "Answered August 10, 2020",
            "views": "21",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Rekha Reddy",
                "href": "/profile/Rekha-Reddy-101"
            },
            "answer_text": "Namasthe It depends on the talent of a person, if a person has a talent then he or she can promote their talent on the social media and people interested in them can make a deal in buying them. ",
            "date": "Answered June 15, 2020",
            "views": "86",
            "upvotes": " Answer requested by Ayush Pandit"
        },
        {
            "author_info": {
                "name": "Heet Patel",
                "href": "/profile/Heet-Patel-97"
            },
            "answer_text": "BY MAKING YOUTUBE CHANNEL AND ON QUORA. ",
            "date": "Answered May 21, 2020",
            "views": "62",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Shamakant Salunkhe Patil",
                "href": "/profile/Shamakant-Salunkhe-Patil"
            },
            "answer_text": "1. by making and uploading videos on YouTube 2.you can earn money by writing book and publish it 3. You can earn money by share trading in share market ",
            "date": "Answered June 13, 2020",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ranjeet Kumar",
                "href": "/profile/Ranjeet-Kumar-940"
            },
            "answer_text": "You can teach online in Lockdown. Best way to earn money . Follow and contact me if you are looking for teach someone. You can teach here from class 1 to 10th ",
            "date": "Answered July 6, 2020",
            "views": "50",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Abhishek Das",
                "href": "/profile/Abhishek-Das-309"
            },
            "answer_text": "Download the app MX player and play games and earn a income of 20rs everyday to withdraw it into PayTm. Also play MPL .good app to make tons of money ",
            "date": "Answered July 15, 2020",
            "views": "96",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Ravi Parmar",
                "href": "/profile/Ravi-Parmar-319"
            },
            "answer_text": "Just make videos and upload them on YouTube just like me and wait for your luck but work here is my link go and watch  ",
            "date": "Answered August 7, 2020",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Triollionphil Lehlohonolo",
                "href": "/profile/Triollionphil-Lehlohonolo"
            },
            "answer_text": "There are so many money making opportunities from affiliate marketing, online coaching/counseling and meditation. I found interesting articles about these opportunities. Find them here Money Maker 3 ",
            "date": "Answered June 29, 2020",
            "views": "50",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lamya Rassiwala",
                "href": "/profile/Lamya-Rassiwala"
            },
            "answer_text": "There are lot of avenues open. Depends on what is your education and your skill set. The entire healthcare system will provide huge opportunities if you are trained in that area. Food industry is another one which has a lot of scope. Home Applainces will be in huge demand. Digital marketing, content creation and social media marketing are also going to be very active prospects. ",
            "date": "Answered June 13, 2020",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nidakhanum Lodi",
                "href": "/profile/Nidakhanum-Lodi-2"
            },
            "answer_text": "Search in youtube for small scale buisness during lock down and if you are educated well in this situation also govt conducting exams for jobs ",
            "date": "Answered October 13, 2020",
            "views": "6",
            "upvotes": " Answer requested by Kishan Singh"
        },
        {
            "author_info": {
                "name": "David Samuels",
                "href": "/profile/David-Samuels-17"
            },
            "answer_text": "Extra cash shouldn't be your goal, learning a new skill should be. Plenty of online training sites to choose from. But hand made masks sold on Etsy might be a good idea. ",
            "date": "Answered April 20, 2020",
            "views": "129",
            "upvotes": " Answer requested by Reena Rajauriya"
        },
        {
            "author_info": {
                "name": "Amit Sharma",
                "href": "/profile/Amit-Sharma-13155"
            },
            "answer_text": "You can learn some new skills realted to free lancing like graphic designin, content writing,seo,excels or data entry related work etc. ",
            "date": "Answered June 3, 2020",
            "views": "4",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aashish Mishra",
                "href": "/profile/Aashish-Mishra-13"
            },
            "answer_text": "आप अपने घर वालों को इस वायरस के संक्रमण से बचा कर खूब सारा पैसा बना सकते हैं क्योंकि अगर आपके घर के लोग वायरस से संक्रमित नहीं होंगे तो आप का बहुत सारा पैसा बच जाएगा हॉस्पिटल में लगने से ",
            "date": "Answered April 21, 2020",
            "views": "60",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kancheepuram Narasimhan",
                "href": "/profile/Kancheepuram-Narasimhan"
            },
            "answer_text": "ARE you not earning right now through this question? Raise million questions in quora- You get money. ",
            "date": "Answered May 27, 2020",
            "views": "108",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sridhar Chidambaram",
                "href": "/profile/Sridhar-Chidambaram-2"
            },
            "answer_text": "There are companies offering work-from-home options. You could register on one of the job sites (Indeed, Monster, Naukri, etc.) and search for such companies. ",
            "date": "Answered April 9, 2020",
            "views": "68",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Abhijeet Jagtap",
                "href": "/profile/Abhijeet-Jagtap-72"
            },
            "answer_text": "   It's ss short of my answer written on quora question ! Joining and questions contact - 9136174528 Thank you for reading this ! ",
            "date": "Answered May 6, 2020",
            "views": "65",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shirish Karia",
                "href": "/profile/Shirish-Karia"
            },
            "answer_text": "Platform number 1 at Pune Railway Station, selling Chai! Who knows you could be our future Prime minister! 😃🌹🙏 ",
            "date": "Answered June 22, 2020",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Karan Ahuja",
                "href": "/profile/Karan-Ahuja-186"
            },
            "answer_text": "There are plenty of option available while I have been seeing earning money through trader application one of the best and safest app to learn and understand its value while other option is data entry online job which has been launched by the government. ",
            "date": "Answered May 16, 2020",
            "views": "12",
            "upvotes": " Answer requested by Manvvar Ansari"
        },
        {
            "author_info": {
                "name": "Dayanand Takbhate",
                "href": "/profile/Dayanand-Takbhate"
            },
            "answer_text": "Dayanand Takbhate's answer to What is the best app for refer and earn? For more information go through this answer it helps you ",
            "date": "Answered April 21, 2020",
            "views": "61",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Manmath Shivshette",
                "href": "/profile/Manmath-Shivshette-1"
            },
            "answer_text": "Digital marketing is the best way to earn money in lockdown. ",
            "date": "Answered May 15, 2020",
            "views": "8",
            "upvotes": " Answer requested by Sanjana Khandelwal"
        },
        {
            "author_info": {
                "name": "Sukhendu Reddy",
                "href": "/profile/Sukhendu-Reddy"
            },
            "answer_text": "E-currency exchanger listing, best rates from reliable exchangers Check this link, I just found out, and looking to proliferate to check whether this works! ",
            "date": "Answered April 12, 2020",
            "views": "99",
            "upvotes": " Not for Reproduction "
        },
        {
            "author_info": {
                "name": "Amit Mall",
                "href": "/profile/Amit-Mall-12"
            },
            "answer_text": "By blogging, You tube, selling fruits, vegitable and home delivery ",
            "date": "Answered May 29, 2020",
            "views": "83",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mansi Srivastav",
                "href": "/profile/Mansi-Srivastav-13"
            },
            "answer_text": "Digital marketing- the upcoming trendSEOContent WritingDigital Marketing AgencyOnline Coaching/teachingIndian ManufacturingHealth sectorSantisation/Cleanliness sector",
            "date": "Answered June 13, 2020",
            "views": "54",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sunny Sahu",
                "href": "/profile/Sunny-Sahu-32"
            },
            "answer_text": "You can make money via following ways: BloggingYoutubeFreelancingAffiliate marketing etc.",
            "date": "Answered May 14, 2020",
            "views": "130",
            "upvotes": " Answer requested by Shivam Shukla"
        },
        {
            "author_info": {
                "name": "Anurup Kumar Sharma",
                "href": "/profile/Anurup-Kumar-Sharma"
            },
            "answer_text": "Yes there are some like data entry jobs, creating music and lyrics if you are good at them don't try if you don't know, write an blog, upload an video of the field you know ",
            "date": "Answered April 11, 2020",
            "views": "79",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joshua Ferns",
                "href": "/profile/Joshua-Ferns"
            },
            "answer_text": "what you want to do to earn? ",
            "date": "Answered July 2, 2020",
            "views": "24",
            "upvotes": " Answer requested by Vijayakumar M"
        },
        {
            "author_info": {
                "name": "Ram Kumar Lahoti",
                "href": "/profile/Ram-Kumar-Lahoti"
            },
            "answer_text": "If you have existing set up , you can . Establishing new set up is difficult. Further what type of work you are looking, how long you want to do etc.are factors to be considered for starting any work. ",
            "date": "Answered May 27, 2020",
            "views": "47",
            "upvotes": " Answer requested by Omkar Bhoir, Misbah Khan and 8 more"
        },
        {
            "author_info": {
                "name": "Pransing Pransing",
                "href": "/profile/Pransing-Pransing-1"
            },
            "answer_text": "yes ",
            "date": "Answered May 11, 2020",
            "views": "68",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sudipta Das",
                "href": "/profile/Sudipta-Das-264"
            },
            "answer_text": "No ",
            "date": "Answered April 10, 2020",
            "views": "25",
            "upvotes": "0"
        }
    ]
}