{
    "title": "How does crime lead to social injustice? - Quora",
    "tags": [
        "Social Injustice",
        "Injustice",
        "Social Justice",
        "Crime Statistics",
        "Criminology",
        "Justice",
        "Criminal Justice",
        "Sociology",
        "Society"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jim Christmas",
                "href": "/profile/Jim-Christmas-1"
            },
            "answer_text": "Crime and social injustice are locked in a perpetual square dance. The first laws created to mete out punishment took a merchant’s perspective of what “justice” was. An eye would be traded for an eye, a tooth traded for a tooth. Crime is the creation of an inequity. You injure me in some way and Iustitia would use her balance scale to ensure that what is taken from you is equal in value to what you took from me. She’s got a sword in case it’s necessary to cut something off of you.  She’s supposed to be blindfolded to play her violent Piñata game…[1] What happens when the lady in the picture doesn’t wear her blindfold, is hired to do the bidding of those in power, or decides she doesn’t like a certain group of people?  [2] This is Emmett Till. When he was a child of fourteen, a white woman accused him of “offending” her. He was brutally murdered by an angry mob. The lady with the sword strangely decided that the mob had done nothing wrong. This isn’t one isolated event. This wasn’t a rare occurrence. This is one of countless thousands of similar incidents, and other crimes beyond enumeration. The lady with the scale was so completely under the control of the racist majority, that young Mr. Till, and millions of others, couldn’t even fight for change. This inequity has persisted for generations. Crimes committed against one group, those of African descent, simply weren’t prosecuted. This made the racist citizens feel justified and emboldened them. Laws were written that served no other purpose than to make the inequity permanent. Children were born into a class that strictly defined what was allowed to them and what wasn’t.[3] Crime was redefined to be anything that challenged the status quo.[4] When criminal acts are not prosecuted for one group, yet the slightest perception of a misstep can be life altering for another, you have social injustice.[5] When those in power draft Iustitia as a soldier to fight for their immoral cause, you have social injustice. When the downtrodden are not even allowed to advocate for themselves, you have social injustice. When you hear “Everyone is welcome, except…” you have social injustice. Prolonged social injustice creates a desperate situation. Desperate situations lead to more crime.[6] Crime doesn’t cause social injustice, and social injustice doesn’t necessarily create crime. But they are clearly partners in this square dance. The movements of one don’t always directly mirror the movements of the other, but you will usually find them in the same corner of the dance floor. Footnotes[1] Best 25+ Lady justice ideas on Pinterest | Justice tattoo, Lady justice statue and Law tattoo[2] http://By Source, Fair use, File:Emmett Till.jpg - Wikipedia (https://en.wikipedia.org/w/index.php?curid=3981740)[3] Jim Crow laws - Wikipedia[4] These Are the 10 Most Racist Supreme Court Rulings in US History[5] https://www.usnews.com/news/articles/2010/08/03/data-show-racial-disparity-in-crack-sentencing[6] http://Prolonged social injustice creates a desperate situation.  Desperate situations lead to more crime.  ",
            "date": "Answered September 25, 2019",
            "views": "299",
            "upvotes": " View 50 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amanda Lubisi",
                    "user_href": "/profile/Amanda-Lubisi"
                },
                {
                    "user_id": "MERCY MEG-MAFIA",
                    "user_href": "/profile/MERCY-MEG-MAFIA"
                },
                {
                    "user_id": "Bomikazi Mposwa",
                    "user_href": "/profile/Bomikazi-Mposwa"
                },
                {
                    "user_id": "Mlondi Mahlangu",
                    "user_href": "/profile/Mlondi-Mahlangu"
                },
                {
                    "user_id": "Toby David Low",
                    "user_href": "/profile/Toby-David-Low"
                },
                {
                    "user_id": "Getty Slioness",
                    "user_href": "/profile/Getty-Slioness"
                },
                {
                    "user_id": "Itu Ponti",
                    "user_href": "/profile/Itu-Ponti"
                },
                {
                    "user_id": "Nikki Maxwell",
                    "user_href": "/profile/Nikki-Maxwell-4"
                },
                {
                    "user_id": "Vicky Hessy",
                    "user_href": "/profile/Vicky-Hessy"
                },
                {
                    "user_id": "Mihlali Mimi",
                    "user_href": "/profile/Mihlali-Mimi-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Malcolm Kogut",
                "href": "/profile/Malcolm-Kogut"
            },
            "answer_text": "My friend Jay was an alcoholic and addicted to drugs. Jay was a wonderful person, would never harm anyone, was always happy, I never saw him angry, was generous with his time and little money, had two degrees, was a pilot and avid gardener. He was also arrested a dozen times and three of them were felonies. Because of his record he couldn’t get a job. No one would give him a chance. He lost his license to drive and fly. He was the breadwinner of his family and his kids suffered for his abandonment from society. They relied on social services to survive. Jay’s wife threw him out after he fell off the wagon again and he was homeless for four years, living in various shelters. Jay died last month at the age of 55 from living on the street - surrounded by drugs and alcohol. Our society is very punitive, unforgiving, cowardly and judgemental. Ultimately we ALL pay for that in many ways. In The Art of Forgiveness, Lovingkindness, and Peace, Jack Kornfield describes an African forgiveness ritual: \"In the Babemba tribe of South Africa, when a person acts irresponsibly or unjustly, he is placed in the center of the village, alone and unfettered. All work ceases, and every man, woman, and child in the village gathers in a large circle around the accused individual. Then each person in the tribe speaks to the accused, one at a time, each recalling the good things the person in the center of the circle has done in his lifetime. Every incident, every experience that can be recalled with any detail and accuracy, is recounted. All his positive attributes, good deeds, strengths, and kindnesses are recited carefully and at length. This tribal ceremony often lasts for several days. At the end, the tribal circle is broken, a joyous celebration takes place, and the person is symbolically and literally welcomed back into the tribe.\" Not very “Christian” of them, is it? ",
            "date": "Answered September 23, 2019",
            "views": "6",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Buzwe Makangume",
                    "user_href": "/profile/Buzwe-Makangume-2"
                }
            ]
        }
    ]
}