{
    "title": "How to release stored electrical energy - Quora",
    "tags": [
        "Alternative Energy",
        "Energy (physics)",
        "Electricity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Franco Bruno Corteletti",
                "href": "/profile/Franco-Bruno-Corteletti"
            },
            "answer_text": "As there is two types of storage of electrical energy (e, i), we have two ways of releasing them (E, I). One is the magnetic energy and the other is the dielectric (electrostatic) energy. They are not really energies, because energy is a concept applied for something in motion, the “energy” stored is better to be called potential. The magnetic potential, once it is created, it is only released with the breaking of the initial condition, which for the case of electric circuits, it’s he opening of the circuit and the release of the force accumulated by the current (conduction current). The dielectric potential, once it is created, also, it is only released with the breaking of the initial condition, which for the case of electric lines, it’s the closing of the line by a short circuit, the contrary condition of magnetism. Remember that electrical energy is composed of magnetic energy times dielectric energy, hence, every circuit either open or closed is storing electrical energy is this two forms. Even when the line is closed the dielectric potential is not totally released because the material conditions are not perfect, the same for the magnetic energy when the line is opened, some current will ever be flowing because of the imperfection of the materials involved in the process. ",
            "date": "Answered September 1, 2020",
            "views": "91",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vin Yasi",
                    "user_href": "/profile/Vin-Yasi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard James Nelson",
                "href": "/profile/Richard-James-Nelson-1"
            },
            "answer_text": "200901 Ranco Cortetti described the conditions of the electrical being “stored” but he did not answer the question. For the stored magnetic energy such as that in a relay coil a diode is used to absorb the energy so as to not to harm circuit components. the diode parameters must be adaquate in power, voltage, and current. For the stored energy such as that in a capacitor a shunt resistor is used with the value being selected as a tradeoff of time and power. The resistor dissipates power at all times and the capacitor discharge is a safety issue. Specific values and physical configurations will depend on the conditions and the amount of energy needing to be “released.” X < > Y, Sonoran desert Richard ",
            "date": "Answered September 2, 2020",
            "views": "72",
            "upvotes": "0"
        }
    ]
}