{
    "title": "How can it be that scientific knowledge changes over time? - Quora",
    "tags": [
        "Knowledge"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joe Andros",
                "href": "/profile/Joe-Andros-1"
            },
            "answer_text": "Why does scientific knowledge change over time? Because falsification is the engine that drives scientific progress. You start with some facts and phenomena. You examine them closely and describe how you think they might be linked. A hypothesis, call it. You work it out and develop it into a theory that explains the results you see. Sweet! But is it true? You’re a scientist. You plan to publish it. It had better be true! If your peers poke holes all through it, you’ll look like a DORK. So you ask yourself about your theory: well, if this is true, what else must be true? You make predictions: if your theory is correct, then in addition to the results we already see (which tend to support the theory - well, they ought to! The theory was developed with them in mind, to explain their occurrence) we can predict we will also see X, Y, Z. If the theory is true. Observation. Explanation i.e. Theory. Extrapolation i.e. Prediction. What’s next? You gather more observations. In particular, you conduct experiments to determine whether X, Y, Z occur. What you are actually trying to do here is falsify your theory. Oh, yeah - you have to. All the other scientists will. You try as hard as you can to poke holes in your own theory, because you know if you don’t, you will come off so bad. Every scientist out there loves the scientific method as much as you do, and the main way it goes is poke them holes. You design every experiment you can think of to prove your theory false. You conduct every experiment as rigorously as you can. And you determine: X and Z occur. Y does not. You have falsified your theory. If your theory were true, Y would occur. So you go back to the theory stage and gut and stitch and insert and twist. You try to account for the non-appearance of the predicted Y. And you see what you got wrong. Re-draft the theory and you now have a clean and rigorous explanation that accounts for all known facts of the phenomenon, including the fact X and Z occur and Y does not (even though you might think it would at first, nope, we now understand why it does not). Ready to publish? HARDLY. You take the theory and make more predictions from it. If the theory is true, what else will occur? And you test them, and you falsify and you refine and you predict and you test and you falsify and refine. FINALLY, you’ve got a really comprehensive theory! It provides a new explanation for previously-observed phenomena, it accounts for a positive hodge-podge of facts, and you’re confident there’s no holes in it you’ve overlooked. This theory advances science. It improves upon our best descriptions of some piece of reality. And you publish. And you hold your breath.  Science is always moving forward in this way. Scientists are eying the entire sum of our body of knowledge, in each of its parts. They’re looking for new predictions they can make. Things that will be true - if the current theory is true. They’re making tons of predictions we can’t even test yet, don’t know how! And they’re working, day by day by week by month by year, to bring previous predictions made into testable range. Because that’s where the tire hits the road. And whenever some part of an established theory can be falsified, scientists rush in with new and better explanations to try and test and fix our understanding. Scientific knowledge changes over time, because a theory is not reality. It is a description of reality. And as time goes by and our tools and measurements and techniques improve, we find ways of tightening our descriptions down, ever more closely upon reality. Closer and closer and closer and closer. Bear in mind the theory “overturned” was usually right. It was simply not as precise as it could infinitely be. What is? Newton’s theory of gravitation got us to the moon. Newton’s theory was overturned by Einstein in 1915. It actually made headlines all around the world. A theory in physics! Major world news. Slow week, I guess. In 1969 when we landed on the moon, NASA was well aware that Einstein’s theory had overturned Newton’s. They used Newton’s because Newton’s was right. Einstein’s was righter - but by margins so infinitesimal they only mattered to physicists, not rocket scientists. Not engineers. The calculations were precise, correct to within an nth, and most importantly, easier to do - meaning smaller chance of error. There could be no errors. Scientific knowledge changes because our descriptions get better and better. They get better and better because scientists spend every working hour trying to tease out predictions they can use to falsify existing theory. But very often, all they do is replace a theory that is proven, that works and gets results, with a theory that’s just that touch finer, just that shade deeper. A more closely drawn portrait of reality. You’d expect our descriptions of reality to change, wouldn’t you? The better we get at the craft of perception, depiction, correction? As a sketch of a cathedral improves with the artist’s maturity. I mean, you certainly wouldn’t expect reality to change. ",
            "date": "Answered February 15, 2019",
            "views": "29",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Afonso Rodrigues",
                    "user_href": "/profile/Afonso-Rodrigues-1"
                },
                {
                    "user_id": "Alan Armstrong",
                    "user_href": "/profile/Alan-Armstrong-21"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Lloyd",
                "href": "/profile/Jim-Lloyd"
            },
            "answer_text": "First, let’s start with one dictionary definition of knowledge: facts, information, and skills acquired by a person through experience or education; the theoretical or practical understanding of a subject.With that definition, we might leap to the conclusion that the operative term in the definition for scientific knowledge is the word theoretical. But I think that might be a mistake. Scientific knowledge must always be testable, and in general, knowledge obtained via the scientific method is not considered to be scientific knowledge until it has survived various practical tests. Scientific knowledge must therefore be both theoretical and practical. Scientific knowledge is the set of well-tested explanations that are useful in that they have predictive power in their domain. So how does scientific knowledge change over time? The physicist David Deutsch says it quite succinctly: The growth of knowledge consists of correcting misconceptions in our theories. Deutsch, David. The Beginning of Infinity: Explanations That Transform the World (Kindle Locations 755-756). Penguin Publishing Group. Kindle Edition. This may seem like a strange admission: our scientific knowledge contains misconceptions. Some people might think that reveals a weakness in science. But in reality, the honest acceptance that our best scientific theories may contain misconceptions is the bedrock foundation of what makes science so successful. Knowledge cannot grow in a culture that is convinced that all ancient knowledge must be correct and unquestioned. ",
            "date": "Answered October 14, 2018",
            "views": "26",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bradley Baker",
                    "user_href": "/profile/Bradley-Baker-35"
                },
                {
                    "user_id": "Manoj Kumar",
                    "user_href": "/profile/Manoj-Kumar-8446"
                },
                {
                    "user_id": "Andre Long",
                    "user_href": "/profile/Andre-Long-12"
                },
                {
                    "user_id": "Phan Minh Chau",
                    "user_href": "/profile/Phan-Minh-Chau"
                },
                {
                    "user_id": "William T. Stephens",
                    "user_href": "/profile/William-T-Stephens"
                },
                {
                    "user_id": "Roland Leblanc",
                    "user_href": "/profile/Roland-Leblanc-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Roberts",
                "href": "/profile/Steve-Roberts-83"
            },
            "answer_text": "“Why does scientific knowledge change over time?” Our instruments improve, allowing us to measure phenomena more precisely, and correct inaccuracies in our previous data. Also, over time, the world changes, we learn new things, and we have a new context in which to evaluate our previous assumptions. Scientific findings are always subject to revision: this is a feature, not a bug. However, we should neither accept all findings as gospel, nor should we reject all findings. This is where reason comes in: we study the findings, and to the best of our current abilities, see if they are reasonably reliable. We test and re-test, and sometimes come to the conclusion (paraphrased) that “for now, given what we know now, these findings seem reasonable.” If you read a lot of scientific journal articles, not the mainstream press, you’ll see that their conclusions are generally written carefully with a number of caveats and conditions. It’s the mainstream press that jumps the gun and treats tentative findings as gospel, and deceptive internet sites that treat findings as “fake.” Naturally, the world is more complex, and most people should not evaluate scientific findings unless they have some university-level science under their belt. Or there really should be a component of critical thinking in all levels of school, just to teach students what to look for when digesting the massive amounts of media thrown at them every day. ",
            "date": "Answered February 14, 2019",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Roland Leblanc",
                "href": "/profile/Roland-Leblanc-1"
            },
            "answer_text": "Scientific knowledge can change over time as the humans do change; if, for instance, we were more brough up developing our inner forces and our intellectual possible acquisition of facts together, we would end up knowing differently. For example, we could comprehend everything from both our intuition and our reason. This would enable us to get access to more than the reality that we normaly perceive from our five senses. In essence, we could understand deeply what we are here for, we could deeply know our=selves enough to behave properly in order to maintain a high standard of Life. Let us hope we reach to this level of knowledge, both scientific, and scientific intuitive knowledge that can help us to behave properly. roland ",
            "date": "Answered October 19, 2018",
            "views": "779",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lara Landis",
                "href": "/profile/Lara-Landis-2"
            },
            "answer_text": "By finding evidence that alters or challenges the model to the current theory. This is why we know that there’s more to evolution than just natural selection. As we found new information, we altered the theories to improve our understanding. Sometimes a standing theory can be overturned, but this has become less and less likely with more rigorous scientific methods being applied. Perhaps the last time this happened is with Einstien’s cosmological constant. ",
            "date": "Answered September 30, 2019",
            "views": "295",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Phaedra Roland",
                    "user_href": "/profile/Phaedra-Roland"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard O. Colestock",
                "href": "/profile/Richard-O-Dick-Colestock"
            },
            "answer_text": "The state of the universe has been a scientific idea that has been around for a long time but has been difficult to answer. Is it expanding, contracting or is it static? The story of how this question was tentatively answered involves critical discoveries in astronomy and cosmology and changing viewpoints as new information became available. Read the fascinating tale here: WMAP- Expansion of the Universe ",
            "date": "Answered September 30, 2019",
            "views": "203",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "V. V. Raman",
                "href": "/profile/V-V-Raman-1"
            },
            "answer_text": "How can scientific ideas be changed over time? With new knowledge, new insights, and better theories. Peace! 30 Sept 2019 ",
            "date": "Answered September 30, 2019",
            "views": "182",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gerhard Lauck",
                "href": "/profile/Gerhard-Lauck"
            },
            "answer_text": "How can scientific ideas be changed over time? New information or powerful propaganda. ",
            "date": "Answered September 30, 2019",
            "views": "205",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brian White",
                "href": "/profile/Brian-White-73"
            },
            "answer_text": "Read The Structure of Scientific Revolutions. No single book has surpassed it, so far. ",
            "date": "Answered September 30, 2019",
            "views": "52",
            "upvotes": "0"
        }
    ]
}