{
    "title": "How do get a clear face I mean no acne, no pimples, no marks naturally? - Quora",
    "tags": [
        "Faces",
        "Acne",
        "Skin",
        "Dermatology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Laney New",
                "href": "/profile/Laney-New"
            },
            "answer_text": "I just want to say to be careful with the recommendations you read here. I also wanted to get clear skin and thought that natural remedies were the way to go. For years I used things like a tea tree lotion, rose water toner, and a Lush face soap including a lot of herbs (including tea tree and rose) and my face was always breaking out. I thought to myself, wow, my skin is awful—good thing I have these nice products or it might be even worse! Well, I’m allergic to tea tree and rose. Two VERY common ingredients touted as natural solutions to skin problems. If I use anything with either of these ingredients I break out like crazy. It took me until I was about 23 to figure it out! So don’t assume that everything that’s “natural” will be good for you. To answer your question though, here are some things that HAVE worked for me (although that doesn’t mean they’ll work for you): honey and cinnamon as a face mask, green tea or chamomile tea as a toner, and witch hazel as a toner. Another great option is oil cleansing. Basically, you take a mixture of oils and massage them into your skin for about two minutes. Then take a hot washcloth and drape it over your face to soften the oils, before very gently rubbing them off. (You can also use something besides a washcloth that’s designed to be gentler on your skin.) I did this for about two years with a mixture of castor oil, jojoba oil and a little tamuanu oil. Jojoba oil is moisturizing and castor oil is drying, so you have to use both and adjust the ratio to find out what works for you. I originally did half and half but noticed that my skin was too oily so I upped the castor, and that worked perfectly. Tamuanu oil is very expensive but very good for acne and you only need a few drops. If you like you can try a different “acne-fighting” oil such as sea buckthorn or tea tree (if you’re lucky enough to not be allergic!). Oil cleansing can make your skin break out at first before you adjust, but even during the “adjustment” period I could feel that my skin was loving all the rich nutrients and feeling softer and healthier. Many people like to “double cleanse” by using oils first and then using a more standard (gentle!) cleanser or micellar water to make sure all the oils are gone. I never bothered with that but if you have a very good cleanser you want to use, that might be a good thing to do! By the way, jojoba oil also makes a great body lotion after a shower and it’s good for your hair as well. It absorbs well and won’t feel greasy. I always keep a bottle around the house. ",
            "date": "Answered December 16, 2018",
            "views": "114",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lydia Roehl",
                    "user_href": "/profile/Lydia-Roehl"
                },
                {
                    "user_id": "Sakina Saify",
                    "user_href": "/profile/Sakina-Saify-22"
                },
                {
                    "user_id": "Musaazi Hafizu",
                    "user_href": "/profile/Musaazi-Hafizu"
                },
                {
                    "user_id": "Zoja Lettrichová",
                    "user_href": "/profile/Zoja-Lettrichová"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bojack Horseman",
                "href": "/profile/Bojack-Horseman-13"
            },
            "answer_text": "Acne can be caused by a slew of things such as diet, hormones, medications and/or dirty/oily skin. My profile photo is a few years old, when I was 17. You can see that my face was clear although it only shows half but it's the same on the other side. I wasnt really one to believe that all of this can go into Acne other than dirty and or oily pores. I get asked alot, even recently, what do I do to keep my face so clear. I always laugh because it was never something special, it was just always soap & water. I've been using Ivory Bar Soap since I was a kid and wash my face twice a day-- in the morning when I awake & right before I go to bed. Sometimes I can feel my face being oily and it results in me washing my face more than twice. Summer time, I washed it more due to all of the sweating. My diet was never good (I drink pop every day), I was on medication as a teenager due to depression and was under a lot of stress. But because I washed my face every day, I was fine. Everyone's body of course is different. My sister has super oily skin. Her only reason for having a face full of acne. She would try to use these advertised acne treatments on her face (Proactive, etc) but I remember a while ago reading somewhere that alot of these products actually causes acne to reappear so that you can continue buying their product. (Alot of chapstick companies are this way as well). I told her to just wash her face daily with soap & water. Shes been doing this for the past 2 years and it has cleared up significantly. The problem though when she washes her face is that her skin becomes super dry which means alot of healthy oil was being washed away as well. I recommended to her to buy a bottle of Aqauphor. It's a type of petroleum for severe dry skin but isnt as oily as vaseline. So when her face gets dry to the point her skin is flaking, I told her to just put a dab of Aqauphor in each quadrant of her face-- L/R Cheek, L/R Forehead and a dab on nose. SO LONG STORY SHORT, GET A BAR OF IVORY AND JUST WASH YOUR FACE 2X DAILY… ALSO, make sure your pillow/pillowcase is clean. ",
            "date": "Answered December 16, 2018",
            "views": "39",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Watikala Longchar",
                    "user_href": "/profile/Watikala-Longchar"
                },
                {
                    "user_id": "Mervis Majanja",
                    "user_href": "/profile/Mervis-Majanja"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raja Sekhar P",
                "href": "/profile/Raja-Sekhar-P-6"
            },
            "answer_text": "Hi Friend, Acne / pimples is a most common skin condition and almost 85% of people get it at some point in their lives. Acne occurs when the skin pores are clogged by dead skin cells. Excess sebum or oil in the skin and bacterial infection makes it worse causing pimples, puss, blackheads and whiteheads.  All of our pores contain a hair follicle and a sebaceous gland, which produces sebum, our skin’s natural oil. The body is constantly regenerating and shedding dead cells, but when those dead skin cells get trapped within the sebum of our skin, they combine to create noninflammatory acne. These are those black and white bumps on your skin — otherwise known as blackheads and whiteheads. If bacteria is present on the skin, it can combine with the dead cells and oil and cause an infection, otherwise known as inflammatory acne. Blackheads  Whiteheads  Papule Acne (P. Acne)  How to treat acne faster and forever? It is very difficult to treat acne permanently, but however, you can still control it and prevent frequent attacks. Acne medications work by reducing oil production, speeding up skin cell turnover, fighting bacterial infection or reducing inflammation — which helps prevent scarring. The doctor might prescribe ointments or creams containing one or a combination of retinoids, antibiotics, salicylic acid, azelaic acid or dapsone. Retinoids These come as creams, gels and lotions. Retinoid drugs are derived from vitamin A. It works by preventing plugging of the hair follicles.Antibiotics. These work by killing excess skin bacteria and reducing redness. Examples include clindamycin with benzoyl peroxide (Benzaclin, Duac, Acanya) and erythromycin with benzoyl peroxide (Benzamycin). Topical antibiotics alone aren't recommended.Salicylic acid and azelaic acid. Azelaic acid is a naturally occurring acid found in whole-grain cereals and animal products. It has antibacterial properties. Salicylic acid may help prevent plugged hair follicles and is available as both wash-off and leave-on products. Studies showing its effectiveness are limited.Dapsone. Dapsone (Aczone) Lower doses can treat inflammatory acne, especially in adults. Side effects include redness and dryness.Natural DIY methods? If you are looking for DIY remedies or natural remedies to treat the acne, below one has the best natural remedies that actually help to treat acne and to prevent re-occurrences by addressing the underlying cause  If you are using them or not, these natural remedies will help in effectively treating acne and to reduce the occurrences. 1. Tea tree oil: In a bowl take 2 table spoon of fresh water. Add 2 drops of tea tree oil to this. Mix the contents. Now with the help of cotton, apply this all over the face or affected area. Leave it on for 15 minutes. And wash away with fresh water. Do it every day. The anti-bacterial properties of tea tree oil help in quickly treating acne. Try to use face wash or body wash made of Tea tree oil.  2. Honey and Cinnamon mask: Take 1 table spoon of Honey into a bowl. Add ½ tea spoon of Cinnamon powder. Mix it well, apply it gently to face. Leave it on for 10 mins and gently wash away with fresh water. The antioxidant and antibacterial properties in them helps in treating pimples.  3. Witch hazel: Witch hazel is an astringent that can fight bacteria and prevent pimples. Witch hazel, may make your skin go dry. So, it should be used only by people with oily skin or normal skin. There are 3 steps in this. Apply your favorite cleanser and wash away with warm water.Take half teaspoon of witch hazel and dilute with 1 teaspoon of water. With the help of cotton, gently rub it on the face or affected area. Leave it on for 20 minutes and wash away with fresh warm water.Follow with moisturizer or apply aloevera gel 4. Apple cider vinegar: Buy apple cider vinegar with the mother. This also has 3 steps. Apply your favorite cleanser and wash away with warm water.Take ½ tea spoon of ACV into a bowl. To this add 1 tablespoon of water. Use cotton pad/ball to apply on skin. Leave it on for 20 minutes and wash away with fresh warm water.Follow with moisturizer or apply aloe vera gel. 5. Green tea mask: Prepare green tea usually and let it cool down.Take ½ tea spoon of turmeric into a bowl. To this add 1 table spoon of amla or gooseberry powder. Mix the green tea into. Mix the contents to form a fine paste. Apply this paste all over the face and wash away. Try these remedies and enjoy the benefits of reduced acne and pimples and clearer skin. These will effectively help in treating and preventing re occurrences. ",
            "date": "Answered August 31, 2019",
            "views": "148",
            "upvotes": " View 29 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rupali Joshi",
                    "user_href": "/profile/Rupali-Joshi-38"
                },
                {
                    "user_id": "Hima Bindu",
                    "user_href": "/profile/Hima-Bindu-118"
                },
                {
                    "user_id": "Komal Jahangir",
                    "user_href": "/profile/Komal-Jahangir-2"
                },
                {
                    "user_id": "Raven Howard",
                    "user_href": "/profile/Raven-Howard-19"
                },
                {
                    "user_id": "Aditya Jaya Lauson",
                    "user_href": "/profile/Aditya-Jaya-Lauson"
                },
                {
                    "user_id": "Adeyemi Precious",
                    "user_href": "/profile/Adeyemi-Precious-4"
                },
                {
                    "user_id": "Jeb Thompson",
                    "user_href": "/profile/Jeb-Thompson-6"
                },
                {
                    "user_id": "Éva Szilágyi",
                    "user_href": "/profile/Éva-Szilágyi"
                },
                {
                    "user_id": "Sonia Nagla",
                    "user_href": "/profile/Sonia-Nagla"
                },
                {
                    "user_id": "Varsha Devnani",
                    "user_href": "/profile/Varsha-Devnani"
                },
                {
                    "user_id": "B. Ham",
                    "user_href": "/profile/B-Ham-13"
                },
                {
                    "user_id": "Ilanna Green",
                    "user_href": "/profile/Ilanna-Green"
                },
                {
                    "user_id": "Krati",
                    "user_href": "/profile/Krati-32"
                },
                {
                    "user_id": "Dʀ. ع",
                    "user_href": "/profile/Dʀ-ع"
                },
                {
                    "user_id": "Anwesha Barman",
                    "user_href": "/profile/Anwesha-Barman-3"
                },
                {
                    "user_id": "Gen Teo",
                    "user_href": "/profile/Gen-Teo-2"
                },
                {
                    "user_id": "Sowmya Padmanaban",
                    "user_href": "/profile/Sowmya-Padmanaban"
                },
                {
                    "user_id": "Pavan Venkat",
                    "user_href": "/profile/Pavan-Venkat-3"
                },
                {
                    "user_id": "Garvit Juneja",
                    "user_href": "/profile/Garvit-Juneja-7"
                },
                {
                    "user_id": "Quỳnh Lê",
                    "user_href": "/profile/Quỳnh-Lê-38"
                },
                {
                    "user_id": "Dilip Donthula",
                    "user_href": "/profile/Dilip-Donthula"
                },
                {
                    "user_id": "Raju",
                    "user_href": "/profile/Raju-1008"
                },
                {
                    "user_id": "Nika Chen",
                    "user_href": "/profile/Nika-Chen"
                },
                {
                    "user_id": "Linda Wilson",
                    "user_href": "/profile/Linda-Wilson-572"
                },
                {
                    "user_id": "Harishmatha Kalyan Ram",
                    "user_href": "/profile/Harishmatha-Kalyan-Ram"
                },
                {
                    "user_id": "Prudhvi Bhavisetty",
                    "user_href": "/profile/Prudhvi-Bhavisetty"
                },
                {
                    "user_id": "Sagar Shelar",
                    "user_href": "/profile/Sagar-Shelar-11"
                },
                {
                    "user_id": "Megha Desphande",
                    "user_href": "/profile/Megha-Desphande"
                },
                {
                    "user_id": "Srikanth Ramana",
                    "user_href": "/profile/Srikanth-Ramana-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kristina Miteva",
                "href": "/profile/Kristina-Miteva-2"
            },
            "answer_text": "First and most important thing to have a clear face is to clean it every day irrespective of whether you are using make up or not. One of the natural possibilities is to use oil based cleaning method. As the name suggests it is based on vegetable oils. This technique is even known back in ancient days.  In order for this method to work you need to pick an oil based on your skin type (not every oil is suitable for every skin). Here is a list which shows different types of oils: LOW possibility for clogged pores - argan, castor, hemp, grape seed, mango, pomegranate seed, rosehip oils and shea butterMEDIUM possibility for clogged pores - almond, apricot, avocado, evening primrose, hazelnut, olive, peach, sesame oilsHIGH possibility for clogged pores - cocoa butter, coconut butter, linseed, palm butter, wheat germThe usage of non gentle cosmetic products every day can harm your skin and make it dry or too oily. How this method works - pick oils based on your skin type and rub it gently into your skin. What will happen is that the oils will dissolve the impurities leaving it nourished and soft. After that remove the oils with wet warm cloth.  Other possibility for natural cleaning is to use clay. Here are different types which you should pick based on your skin type Green - this clay is suitable for oily skin. It regulates the fat secretion and naturally matts the skinWhite - it is ideal for sensitive skin. It can be even used on babies and children and is perfect for every skin type.Red - can be used on moderate skin and has revitalizing propertiesYellow - suitable for aged skin, has lifting effectBlue - known for its hydrating properties is perfect for mixed to dry skinGray - ideal for very dry skin, makes the skin lively and elasticIt can be used as a cleaner mixed with rose water or as a mask, but remember - leave it on the skin not more than 10 min. ",
            "date": "Answered March 3, 2019",
            "views": "41",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Muna Ukachukwu",
                    "user_href": "/profile/Muna-Ukachukwu-1"
                },
                {
                    "user_id": "Asma Awan",
                    "user_href": "/profile/Asma-Awan-20"
                },
                {
                    "user_id": "Meena Madhuri",
                    "user_href": "/profile/Meena-Madhuri"
                }
            ]
        },
        {
            "author_info": {
                "name": "Luisa Fanzani",
                "href": "/profile/Luisa-Fanzani"
            },
            "answer_text": " Usually to answer this kind of question, people start mentioning skincare products such as serums, lotions, and cleansers. Truth is that the process to obtain a healthy and beautiful skin starts from within (even though it sounds cliché). From within means the food we eat, but also our habits play a huge role. When I say habits I mean applying sunscreen for long sun exposures and avoid alcohol and cigarettes. One of the best thing you can do to purify your skin is to do high intensity workouts and sweat. Sweating is nothing to be afraid of. However, excessive sweating can make the skin break out, especially if the person is acne-prone. Use a gentle cleanser free from alcohol, fragrance and harsh surfactants (for example a micellar water). Once your skin is all fresh and shiny again, it’s the best time to apply skincare products. In fact, the blood circulation is still increased from the previous workout putting your skin in a state where it is particularly receptive for treatments such as serums and moisturizers. Exercise is also great for your skin. This is mainly due to the fact that the effort and heat generated increases blood circulation and oxygen supply to the skin, which is clearly visible in reddening of the skin during exercise. More oxygen and nutrients in the skin also mean improved cell growth, which is reflected in an increased renewal rate of the cells. You will look younger with regular training! Furthermore, the increased blood circulation supports the removal of dead skin cells and free radicals. However, I need to add that if you are struggling with acne, unfortunately living healthy is probably not going to solve your problem. Acne has hormonal causes; you need to consult an experienced dermatologist in order to find a solution. I’m a cosmetic chemist…I will never tell you skincare products don’t work; however, true beautiful skin comes from sacrifice and discipline like anything else worth pursuing. If you still would like to know which kind of skincare products you should buy on top of all this you can read this article I wrote on how to recognize good quality skincare: How to choose the best skin care products Hope this helps! ",
            "date": "Answered May 7, 2019",
            "views": "81",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anastasia",
                    "user_href": "/profile/Anastasia-848"
                },
                {
                    "user_id": "Chandini Rongali",
                    "user_href": "/profile/Chandini-Rongali"
                },
                {
                    "user_id": "Rukia Adams",
                    "user_href": "/profile/Rukia-Adams"
                },
                {
                    "user_id": "Gowri Sankar",
                    "user_href": "/profile/Gowri-Sankar-103"
                },
                {
                    "user_id": "Sumanashree",
                    "user_href": "/profile/Sumanashree"
                },
                {
                    "user_id": "Paula Dragu",
                    "user_href": "/profile/Paula-Dragu"
                },
                {
                    "user_id": "Milana Balaeva",
                    "user_href": "/profile/Milana-Balaeva"
                },
                {
                    "user_id": "Rita Stephanie",
                    "user_href": "/profile/Rita-Stephanie"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kalaivani Velusamy",
                "href": "/profile/Kalaivani-Velusamy"
            },
            "answer_text": "Getting clear skin requires following certain things daily.Achieving great skin does not happen in over night.Caring your skin sporadically does not result you clear skin. Along with care,you have to take care of your diet also. Follow Cleansing,toning,moisturising routine daily twice. Always apply sunscreen before step out of your home.For the evening rituals, you can remove dirt by using glycerine and then apply almond or any oil of your choice over your face.Then use your face wash to completely remove the dirt.Once or twice in a week use natural scrubber like sugar with honey or oats with curd.Then apply rose water or any toner.As a final step in the ritual, you can apply any moisturiser or LactoCalamine lotion as well. If you have pimples then apply tea tree oil overnight or wipe it off after 3 hours.If you have dark circles then apply Vitamin E oil or Almond oil around your eyes overnight to wipe it off before you hit the sack.Vitamin E oil removes dark spots as well.These are Spot treatments. Check out this post as well Kalaivani Velusamy's answer to How do I remove pimples and dark spots overnight? Based on your skin problem just seal your skin with the specified treatment for that before closing your evening ritual. Have Green tea regularly,drink lot of water,eat lot of nuts and cut down Junk/white sugar/Salt/processed food. Thanks for A2A by Prajwal and Garima. ",
            "date": "Answered June 13, 2016",
            "views": "88",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rupali Joshi",
                    "user_href": "/profile/Rupali-Joshi-38"
                },
                {
                    "user_id": "Manika Chadha",
                    "user_href": "/profile/Manika-Chadha-4"
                },
                {
                    "user_id": "Puja Dagade",
                    "user_href": "/profile/Puja-Dagade"
                },
                {
                    "user_id": "Poorvaja",
                    "user_href": "/profile/Poorvaja-4"
                },
                {
                    "user_id": "Yashaswini Yadav",
                    "user_href": "/profile/Yashaswini-Yadav-4"
                },
                {
                    "user_id": "Navu Garg",
                    "user_href": "/profile/Navu-Garg"
                },
                {
                    "user_id": "Sri K",
                    "user_href": "/profile/Sri-K-81"
                },
                {
                    "user_id": "Supriya Jahagirdar",
                    "user_href": "/profile/Supriya-Jahagirdar"
                },
                {
                    "user_id": "Vivek R",
                    "user_href": "/profile/Vivek-R-41"
                },
                {
                    "user_id": "Prashasti Pandey",
                    "user_href": "/profile/Prashasti-Pandey-7"
                },
                {
                    "user_id": "Anjali Tushir",
                    "user_href": "/profile/Anjali-Tushir-1"
                },
                {
                    "user_id": "Ishita Gulati",
                    "user_href": "/profile/Ishita-Gulati-9"
                },
                {
                    "user_id": "Vikas Lavania",
                    "user_href": "/profile/Vikas-Lavania-2"
                },
                {
                    "user_id": "Diali Dasgupta",
                    "user_href": "/profile/Diali-Dasgupta-1"
                },
                {
                    "user_id": "Abigail Churney",
                    "user_href": "/profile/Abigail-Churney"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adore Anderson",
                "href": "/profile/Adore-Anderson-1"
            },
            "answer_text": "I have answered something like this on another question but here it goes: How to treat any types of pimple, from normal zits to cystic monsters kind. If you have normal clear skin and suddenly a pimple shows up, or you can somehow tell a pimple is on its way to make its debut (be it from redness or you could feel a slight pain/bumps), you should not worry. Go to your kitchen, open your freezer, take an ice cube, and rub it for as long as you can on your (soon) pimple. I dont have problem with rubbing it directly on my skin because i am used of its coldness but if you are new consider on putting towel paper or tissue as a barrier between ice and skin. Now, if you belong to the unluckiest like me, who struggles constantly and keep having a war with monstrous cystic good-for-nothing cystic acne; i got you covered! Keep in mind that, if your cystic acne comes from bacteria or any severe inflammation inside your body, YOU NEED ANTIBIOTICS. Visit your trusted dermatologist to help you. Okay, let’s continue with my trick for cystic acne. Exfoliate your face ONLY WITH CHEMICAL EXFOLIATOR. I highly recommend AHA and BHA from The Ordinary, but any other products your skin is suitable with is fine. As long as you are sure that the product exfoliate your skin thoroughly.Wash your face with normal water and favorite cleanser. For me i use cetaphil (gentle or oily types both products work great on me) and then i was my face again with warm tea (green tea/ black tea/ yellow tea, any will work just fine).Grab your ice cube and rub it on the concerned area. Do this as often as you can, at least in the morning and night.Benzoyl peroxide and clindamycin phosphate are your best weapon at night. DONT SPOT TREAT THEM. APPLY THEM EVERYWHERE TOPICALLY ON YOUR FACE IN JUST DECENT AMOUNT. Honestly, do this everyday whether you have pimple or not.Repeat the step 2 until 4 everyday. Step 1 only can be done twice a week.Five steps above will make your pimple ‘debunk’ itself. If you do this steps very early, you have a good chance that the pimple itself will never showed up and ended up becoming a small dry comedo then you can peel it off very easily. My skin now is almost flawless I hope I can help as much people as i can. I feel your pain. Everyone need to know this ",
            "date": "Answered January 17, 2019",
            "views": "44",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Loretta Ann",
                    "user_href": "/profile/Loretta-Ann-10"
                },
                {
                    "user_id": "Monika Buchsbaum",
                    "user_href": "/profile/Monika-Buchsbaum"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kashyap Hiral",
                "href": "/profile/Kashyap-Hiral"
            },
            "answer_text": "Hi you can use clindamycin phosphate gel It will kill the bacteria that cause pimple and acne..i am using that and got the result.. First you wash your face regular 3 to 4 times with himalya ' s clarina or clean and clears s oil control face wash and then use clindamycin phosphate gel twice in day And apply face pack regular : multani mitti , honey and lemon juice and 3 to 4 drops of rose water You can use dabar's rose water Or orange peel powder , lemon juice , rose water And when going outside or wherever you're apply rose water regular when you're not wearing any cream or makeup And you can apply lemon juice , honey and sugar and rose water ( 2 drops) for 30 minutes once or twice in day , it will help you to get rid of dark spots and pimple and acnes and will give you white , tight and glowing skin and will give you 100% result You can apply rice flour with multani mitti and lemon and rose water's mixture for 30 minutes And rice flour and yogurt and lemon once in week for 30 minutes And after washing your face massage your face with ice rapped in cotton clean hanky You can apply alovera gel but apply natural and original instead of buying patanjali or khadi….i don't found that good…apply alovera gel regular atleast for an hour …cut a leaf and apply direct over your face You can drink saafi or mahamanjishthadi kahda of dabur for clearing your digestive system and for blood purification…it will give you glowing and pimple free skin. Pimple cannot be cured completely in one night…but you can reduce that and get rid of its infection and enlargement and redness. Must try clindamycin phosphate gel and the natural remedies i suggest you will get result foresure You can use too many thinge instead of that like oatmeal mask and tometo mask.. Never uee toothpaste. .it does not help to get rid of pimple but instead of that..it irritates the skin..it can damage or dry your skin… avoid that You can drink warm hot water , 1 lemon , 1 table spoon honey or warm hot water 1 lemon and alovera juice regular…it will help you tonget clear skin and healthy skin and hair…first you can have pimple by drinking alovera then you will get 100% result within a week forever Try this You will get pimple free clear , soft , shiner , glowing skin Thank you , ignore my grammatical errors ",
            "date": "Updated August 19, 2019",
            "views": "5",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ashwini Joshi",
                    "user_href": "/profile/Ashwini-Joshi-201"
                },
                {
                    "user_id": "Khushboo Kanwar",
                    "user_href": "/profile/Khushboo-Kanwar-13"
                },
                {
                    "user_id": "Poorvaja",
                    "user_href": "/profile/Poorvaja-4"
                },
                {
                    "user_id": "Vipul Vala",
                    "user_href": "/profile/Vipul-Vala-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sweety Bhosale",
                "href": "/profile/Sweety-Bhosale-1"
            },
            "answer_text": "Hi…even I had lot of acne and pimple problem evn I wished of a clear beautiful skin here are some remedies that work with me I will share with u.. As u said how to get clear skin without acne pimple marks we will go step by step 1.acne and pimples Acne and pimples are caused by Hormonal imbalanceEating…yes eating habits can cause pimples. here I'm mentioning eating things which generates heat in the body and causes pimples eg. mangoes,chicken,milkKeeping face unclean..having bacteria not washing it properly polluted with dust wiping face with dirty towel etcOily skin…..oil clogs the pores and produces pimples acneEating oily spicySo to clear acne and pimple u need to know what's the cause of your acne if it's hormonal u need a dermatologist who will prescribe u with medicines.if it's due to eating habits u hv no option u vil have to have a limit…ya limit not stop on wht u eat to get tht beautiful skin and 2 nd reson is ur face is a reflection of your body wht u eat so eat healthy look healthy. about eating another tip I wud like to share with iu is observe ur face whn u eat all the homemade food ur skin will look fresh and whn u eat junk,hotel,oily food ur skin will look dull as whtevr we eat gets mixed up with your blood and accordingly all the body parts. 2.talking about marks they are stubborn thy will not go easily and needs a remedy Remedies for all problems Remedy 1.lemon Yes lemon works wonders u need to apply lemon juice on your face keep for 20 mins it will fade away marks remove pimples when u have active pimple jst apply over it keep for 30 mins continious use will also reduce pimple acne use it tremendously properly u cn evn rub the lemon on your face it burns a lot bt u vil c beautiful skin within 2 days (caution:1.if u have sensitive skin or if u r using any chemical based skin pls don't use it) u will thank me for skin u will get after 2.dont go in sun when using lemon it will pigment ur skin and will cause a great harm) Remedy 2.honey Apply honey over your cleansed face for 15 min to get glowing skin Remedy 3.drink lots of water Remedy 4.use a good facewash according to ur skin.type Remedy 4.moisturise! mousturise !moisturise Yes keep your skin hydrated by moisturizing it well all skin types need moisturiser.apply liberaly on your face after you have bath bcs skin is wet and pores are open so it penetrates well into face u cn go office clg school evn dng ur makeup upon this. Remedy 5. Apply Sunscreen when going out in sun Sun damages u skin a lot tht u can't evn think of so it's a must. Remedy 6.for pimples U can also apply benzoyl peroxide,clear gel while sleeping at night on pimples and acne to clear thm For pimples have patience more the pimples more the patience do these remedies any one for few days after getting complete removal thn go for next work step by step with patience Remedy 7.Complete routine of few weeks (nightime ) Clear your pimples first with above remedies thn go for this routine Wash your faceApply melamet cream(u vil get in medical stores) only on the pimple marks u will see them fading in very few days and with this u will get a clear skin caution. Consult your dermatologist before as he will examine your skin type well as this cream contains steroid.This cream will fade marks but use it only as a spot treatment don't aply on your face as u may get tempted to become fair using this cream bt its long term use will harm your skin ur skin should not get addicted to this ointment use it as spot treatment whn it finishes it's purpose jst stop using it dnt use it for more than 6 weeks don't go in sun at all while using this it will tan pigment ur skin and will do more harm than good to your face those who with sensitive skin pls think b4 u use this)apply this once in cream only at night once while u sleeping and wash away in the morning after getting desired results stop using this and don't directly leave jst use a moisturiser after instead of cream to ur whole face.Do this regime daily for few days u will get a clear skin…..this will surely help u try this out and let me know in the comments if experience after doing this and any queries if u have….have a nice day take care",
            "date": "Answered May 21, 2016",
            "views": "807",
            "upvotes": " View 57 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kota Geetasri",
                    "user_href": "/profile/Kota-Geetasri"
                },
                {
                    "user_id": "Surbhi Choudhary",
                    "user_href": "/profile/Surbhi-Choudhary-93"
                },
                {
                    "user_id": "Nasrin Baloch",
                    "user_href": "/profile/Nasrin-Baloch-2"
                },
                {
                    "user_id": "Madhav Adutiya",
                    "user_href": "/profile/Madhav-Adutiya-2"
                },
                {
                    "user_id": "Ashi Nauhwar",
                    "user_href": "/profile/Ashi-Nauhwar"
                },
                {
                    "user_id": "Prachi Nagdeve",
                    "user_href": "/profile/Prachi-Nagdeve-2"
                },
                {
                    "user_id": "Ajay Steve Rogers",
                    "user_href": "/profile/Ajay-Steve-Rogers"
                },
                {
                    "user_id": "Vanitha Srinivasan",
                    "user_href": "/profile/Vanitha-Srinivasan-25"
                },
                {
                    "user_id": "Prakasi Cg",
                    "user_href": "/profile/Prakasi-Cg"
                },
                {
                    "user_id": "Shaik Sameen",
                    "user_href": "/profile/Shaik-Sameen"
                },
                {
                    "user_id": "Nikshitha Gowda",
                    "user_href": "/profile/Nikshitha-Gowda-2"
                },
                {
                    "user_id": "Ashwini Joshi",
                    "user_href": "/profile/Ashwini-Joshi-201"
                },
                {
                    "user_id": "Shruti Jain",
                    "user_href": "/profile/Shruti-Jain-496"
                },
                {
                    "user_id": "Kuldeep Dabas",
                    "user_href": "/profile/Kuldeep-Dabas-16"
                },
                {
                    "user_id": "Rahul",
                    "user_href": "/profile/Rahul-5052"
                },
                {
                    "user_id": "SANAYA",
                    "user_href": "/profile/SANAYA-74"
                },
                {
                    "user_id": "Sruthi Ram",
                    "user_href": "/profile/Sruthi-Ram-8"
                },
                {
                    "user_id": "Garvit Juneja",
                    "user_href": "/profile/Garvit-Juneja-7"
                },
                {
                    "user_id": "Varsha A",
                    "user_href": "/profile/Varsha-A-13"
                },
                {
                    "user_id": "Akanksha Vohra",
                    "user_href": "/profile/Akanksha-Vohra-6"
                },
                {
                    "user_id": "Hridya Dileep",
                    "user_href": "/profile/Hridya-Dileep"
                },
                {
                    "user_id": "Tre Dana",
                    "user_href": "/profile/Tre-Dana"
                },
                {
                    "user_id": "Saivenkat Sai",
                    "user_href": "/profile/Saivenkat-Sai-1"
                },
                {
                    "user_id": "Neelam Devi",
                    "user_href": "/profile/Neelam-Devi-150"
                },
                {
                    "user_id": "Anshul Jain",
                    "user_href": "/profile/Anshul-Jain-1051"
                },
                {
                    "user_id": "Keerthana Venkat",
                    "user_href": "/profile/Keerthana-Venkat-3"
                },
                {
                    "user_id": "Arshad Azma",
                    "user_href": "/profile/Arshad-Azma"
                },
                {
                    "user_id": "Shefreena Riju",
                    "user_href": "/profile/Shefreena-Riju"
                },
                {
                    "user_id": "Farha Naaz",
                    "user_href": "/profile/Farha-Naaz-27"
                },
                {
                    "user_id": "Melanie G",
                    "user_href": "/profile/Melanie-G-47"
                },
                {
                    "user_id": "Jms Jms",
                    "user_href": "/profile/Jms-Jms"
                },
                {
                    "user_id": "Kanhaiya Varshney (कन्हैया वार्ष्णेय)",
                    "user_href": "/profile/Kanhaiya-Varshney-कन्हैया-वार्ष्णेय"
                },
                {
                    "user_id": "Harshit Sharma",
                    "user_href": "/profile/Harshit-Sharma-433"
                },
                {
                    "user_id": "UnknownKnowledge",
                    "user_href": "/profile/UnknownKnowledge-1"
                },
                {
                    "user_id": "Ryan Samrat",
                    "user_href": "/profile/Ryan-Samrat"
                },
                {
                    "user_id": "Shivam Agrawal",
                    "user_href": "/profile/Shivam-Agrawal-248"
                },
                {
                    "user_id": "Dheerendra Patel",
                    "user_href": "/profile/Dheerendra-Patel-5"
                },
                {
                    "user_id": "Gowthami M",
                    "user_href": "/profile/Gowthami-M-3"
                },
                {
                    "user_id": "Meghana H M",
                    "user_href": "/profile/Meghana-H-M"
                },
                {
                    "user_id": "Sarthick Sharma",
                    "user_href": "/profile/Sarthick-Sharma-1"
                },
                {
                    "user_id": "Pushkar Shinalkar",
                    "user_href": "/profile/Pushkar-Shinalkar"
                },
                {
                    "user_id": "Aditi Sharma",
                    "user_href": "/profile/Aditi-Sharma-1624"
                },
                {
                    "user_id": "Barath Jagadeesan",
                    "user_href": "/profile/Barath-Jagadeesan"
                },
                {
                    "user_id": "Stephen Dalmet",
                    "user_href": "/profile/Stephen-Dalmet"
                },
                {
                    "user_id": "Ra Sudhakar",
                    "user_href": "/profile/Ra-Sudhakar"
                },
                {
                    "user_id": "Chavi Gupta",
                    "user_href": "/profile/Chavi-Gupta-3"
                },
                {
                    "user_id": "Palak Tiwari",
                    "user_href": "/profile/Palak-Tiwari-29"
                },
                {
                    "user_id": "MATHS",
                    "user_href": "/profile/MATHS-16"
                },
                {
                    "user_id": "Bishal Bharadwaj",
                    "user_href": "/profile/Bishal-Bharadwaj-4"
                },
                {
                    "user_id": "Koco Brown",
                    "user_href": "/profile/Koco-Brown"
                },
                {
                    "user_id": "Ishan Dawra",
                    "user_href": "/profile/Ishan-Dawra-1"
                },
                {
                    "user_id": "Ragini Shrivastav",
                    "user_href": "/profile/Ragini-Shrivastav-2"
                },
                {
                    "user_id": "Sinobukhosi Dube",
                    "user_href": "/profile/Sinobukhosi-Dube"
                },
                {
                    "user_id": "Vaibhav Salunkhe",
                    "user_href": "/profile/Vaibhav-Salunkhe-4"
                },
                {
                    "user_id": "Vivek Sathya",
                    "user_href": "/profile/Vivek-Sathya"
                },
                {
                    "user_id": "Mathur",
                    "user_href": "/profile/Mathur-1"
                },
                {
                    "user_id": "Divya",
                    "user_href": "/profile/Divya-197"
                }
            ]
        },
        {
            "author_info": {
                "name": "Palak Garg",
                "href": "/profile/Palak-Garg-32"
            },
            "answer_text": "Acne, pimples ,marks are all basically a result of combination of the internal and external environment. Out of all the skin types, oily skin is more prone to acne, blackheads and pimples. As someone who has been studying Ayurveda for past four years. here are the few things that I have tried over time some of which has drastically helped me in skin care. Aloevera - It is Ayurveda’s one of the most premium herbs for skin care. Known as Ghritkumari,use it in its natural form. A plant in your garden and your are set. Using the gel at night is your complete night care routine. It will make your skin glow like that of a kid. Consistency is the only key.I am not going to mention the numerous face packs that you can make at home. There are tonnes of DIYs that are already present on the internet. I just use mulatni mitti ( Fullers earth) with few drops of rose water and a tinge of turmeric. NOTHING BEATS THIS NATURAL REMEDY. Ty it out and you will see the results for yourself.Clean your face with milk every evening. Better brightening agent than most creams today.Go less spicy with diet to prevent breakouts. acne, pimples are basically due to the pitta nature of the skin ( a body type according to Ayurveda). To balance it out, add cool drinks(coconut water) to your diet.Wash off your face with cold water at least twice a day. It closes the pores and thus helps in preventing breakouts.Nothing topical will help if the internal environment is not favorable. Make sure to have lots of water and watery fruits to help balance out the body’s heat.Most important point, If you think the breakouts are more than normal and are painful do not hesitate and go see a dermatologist. ",
            "date": "Answered August 12, 2019",
            "views": "9",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bhaswati Kakati",
                    "user_href": "/profile/Bhaswati-Kakati-1"
                },
                {
                    "user_id": "Echo",
                    "user_href": "/profile/Echo-3141"
                },
                {
                    "user_id": "Saniya farheen",
                    "user_href": "/profile/Saniya-farheen-6"
                },
                {
                    "user_id": "Ashwini Joshi",
                    "user_href": "/profile/Ashwini-Joshi-201"
                },
                {
                    "user_id": "Alee RaZa",
                    "user_href": "/profile/Alee-RaZa-30"
                },
                {
                    "user_id": "AYYAPPAN THIRUNAVUKKARASU",
                    "user_href": "/profile/AYYAPPAN-THIRUNAVUKKARASU-1"
                },
                {
                    "user_id": "Sruthi Ram",
                    "user_href": "/profile/Sruthi-Ram-8"
                },
                {
                    "user_id": "Sahil Sodhi",
                    "user_href": "/profile/Sahil-Sodhi-7"
                },
                {
                    "user_id": "Lakshmy",
                    "user_href": "/profile/Lakshmy-9"
                },
                {
                    "user_id": "Vidhya Vani",
                    "user_href": "/profile/Vidhya-Vani"
                },
                {
                    "user_id": "Sagar Shelar",
                    "user_href": "/profile/Sagar-Shelar-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Keyur Trivedi",
                "href": "/profile/Keyur-Trivedi-31"
            },
            "answer_text": "VERY GOOD QUESTION, YOU CAN CLEAN YOUR FACE COMPLETELY IN JUST 30 DAYS, I WILL TELL YOU ON THE SIMPLE WAYS First of all know this, Your face describes the position of inside your body  For this, you must first clean your body from inside. ———————— 7 SIMPLE WAY TO CLEAN YOUR FACE ———————— First of all you have to drink a small cup of hot water and half a teaspoon of turmeric and honey in it without brushing as soon as you wake up in the morning.Honey and turmeric clean the dirt and bacteria of inside your stomachThis will not cause you Pimples and acne.You will have to stop eating junk food for 30 days, once your face is clean then you can eat outside food for a 2 days in a week.You have to follow Remedies before sleeping as mentioned below.MON: Apply Lemon Juice + HoneyTUE: Rose Water+ MilkWEB: Pure/Fresh Aloe Vera GelTHU: Apply Lemon Juice + HoneyFRI: Turmeric Powder+ Milk + Honey + Multani MittiSAT: Pure/Fresh Aloe Vera GelSUN: JUST RUB ICE CUBE TWICE IN DAY.You have to drink at least 2 to 3 liters of water daily for 30 days.You should have face steam on your face 2 days a week.Do not take any stress in your personal life, this is also a reasonAlso keep away from dirty video dirty movie or dirty thinking, due to which if you have a habit of masturbation then this habit can also be bad for your face.In the end, I will explain to you that the face describes the state of both your thinking and your stomach. If it is controlled by you then your face is clean and beautiful. Thank you for Reading My Answer, Hop My Small Information Helps You K.T ",
            "date": "Answered October 18, 2019",
            "views": "519",
            "upvotes": " View 217 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Deepthi Raj",
                    "user_href": "/profile/Deepthi-Raj-23"
                },
                {
                    "user_id": "Anu S",
                    "user_href": "/profile/Anu-S-6"
                },
                {
                    "user_id": "Pooja Kamath",
                    "user_href": "/profile/Pooja-Kamath-24"
                },
                {
                    "user_id": "Hanzala Khan",
                    "user_href": "/profile/Hanzala-Khan-100"
                },
                {
                    "user_id": "Tiyasha Mondal",
                    "user_href": "/profile/Tiyasha-Mondal-6"
                },
                {
                    "user_id": "Samiksha.",
                    "user_href": "/profile/Samiksha-95"
                },
                {
                    "user_id": "Naren Sg",
                    "user_href": "/profile/Naren-Sg"
                },
                {
                    "user_id": "Harshitha Ravi",
                    "user_href": "/profile/Harshitha-Ravi-10"
                },
                {
                    "user_id": "Pooja Kale",
                    "user_href": "/profile/Pooja-Kale-39"
                },
                {
                    "user_id": "Manisha Kanakadandi",
                    "user_href": "/profile/Manisha-Kanakadandi"
                },
                {
                    "user_id": "Nasrin Baloch",
                    "user_href": "/profile/Nasrin-Baloch-2"
                },
                {
                    "user_id": "Nandhini Balasubramaniam",
                    "user_href": "/profile/Nandhini-Balasubramaniam-1"
                },
                {
                    "user_id": "Anshul Jangir",
                    "user_href": "/profile/Anshul-Jangir"
                },
                {
                    "user_id": "Shrishti Singh",
                    "user_href": "/profile/Shrishti-Singh-186"
                },
                {
                    "user_id": "Aditya Srivastava",
                    "user_href": "/profile/Aditya-Srivastava-140"
                },
                {
                    "user_id": "Vanshika Choudhary",
                    "user_href": "/profile/Vanshika-Choudhary-49"
                },
                {
                    "user_id": "Tanya Singh",
                    "user_href": "/profile/Tanya-Singh-573"
                },
                {
                    "user_id": "Kartikey Dubey",
                    "user_href": "/profile/Kartikey-Dubey-57"
                },
                {
                    "user_id": "Aishwarya Sridhar",
                    "user_href": "/profile/Aishwarya-Sridhar-12"
                },
                {
                    "user_id": "Anju KP Anju",
                    "user_href": "/profile/Anju-KP-Anju"
                },
                {
                    "user_id": "Muzammil Shaikh",
                    "user_href": "/profile/Muzammil-Shaikh-285"
                },
                {
                    "user_id": "Sourabh Hooda",
                    "user_href": "/profile/Sourabh-Hooda-2"
                },
                {
                    "user_id": "Prachi Shah",
                    "user_href": "/profile/Prachi-Shah-100"
                },
                {
                    "user_id": "Aniya Gupta",
                    "user_href": "/profile/Aniya-Gupta-2"
                },
                {
                    "user_id": "Ujjwal Janjal",
                    "user_href": "/profile/Ujjwal-Janjal-1"
                },
                {
                    "user_id": "Krishnaa Reddy",
                    "user_href": "/profile/Krishnaa-Reddy-1"
                },
                {
                    "user_id": "Koppolu Srinivasarao",
                    "user_href": "/profile/Koppolu-Srinivasarao-2"
                },
                {
                    "user_id": "Amit Behera",
                    "user_href": "/profile/Amit-Behera-113"
                },
                {
                    "user_id": "Tapish Chaudhary",
                    "user_href": "/profile/Tapish-Chaudhary-2"
                },
                {
                    "user_id": "Anne Rodriguez",
                    "user_href": "/profile/Anne-Rodriguez-21"
                },
                {
                    "user_id": "Annoynemous",
                    "user_href": "/profile/Annoynemous"
                },
                {
                    "user_id": "Ashi Nauhwar",
                    "user_href": "/profile/Ashi-Nauhwar"
                },
                {
                    "user_id": "Manish Kumar",
                    "user_href": "/profile/Manish-Kumar-207"
                },
                {
                    "user_id": "Sabiha Ansari",
                    "user_href": "/profile/Sabiha-Ansari-47"
                },
                {
                    "user_id": "Chesta Thakur",
                    "user_href": "/profile/Chesta-Thakur-1"
                },
                {
                    "user_id": "Mehnaz Hassan",
                    "user_href": "/profile/Mehnaz-Hassan-5"
                },
                {
                    "user_id": "Kainaz Ghadoiwala",
                    "user_href": "/profile/Kainaz-Ghadoiwala-1"
                },
                {
                    "user_id": "HAPPY CLUB",
                    "user_href": "/profile/HAPPY-CLUB-26"
                },
                {
                    "user_id": "Pranavv Haran",
                    "user_href": "/profile/Pranavv-Haran-1"
                },
                {
                    "user_id": "Teju Tej",
                    "user_href": "/profile/Teju-Tej-7"
                },
                {
                    "user_id": "Adi Sharma",
                    "user_href": "/profile/Adi-Sharma-176"
                },
                {
                    "user_id": "Zunaid Hasan Tajim",
                    "user_href": "/profile/Zunaid-Hasan-Tajim-1"
                },
                {
                    "user_id": "Ayesha Firdous",
                    "user_href": "/profile/Ayesha-Firdous-59"
                },
                {
                    "user_id": "Priyanka Joshi",
                    "user_href": "/profile/Priyanka-Joshi-321"
                },
                {
                    "user_id": "Sahithi Priyanka",
                    "user_href": "/profile/Sahithi-Priyanka-9"
                },
                {
                    "user_id": "Mitta Srinidhi",
                    "user_href": "/profile/Mitta-Srinidhi"
                },
                {
                    "user_id": "Echo",
                    "user_href": "/profile/Echo-3141"
                },
                {
                    "user_id": "Hamal H",
                    "user_href": "/profile/Hamal-H"
                },
                {
                    "user_id": "Tushar Agarwal",
                    "user_href": "/profile/Tushar-Agarwal-579"
                },
                {
                    "user_id": "Abhilasha Kumari",
                    "user_href": "/profile/Abhilasha-Kumari-90"
                },
                {
                    "user_id": "Akshita Goyal",
                    "user_href": "/profile/Akshita-Goyal-20"
                },
                {
                    "user_id": "Siddharth Singh",
                    "user_href": "/profile/Siddharth-Singh-3305"
                },
                {
                    "user_id": "AJ Vaughan",
                    "user_href": "/profile/AJ-Vaughan-1"
                },
                {
                    "user_id": "Kanika Mittal",
                    "user_href": "/profile/Kanika-Mittal-93"
                },
                {
                    "user_id": "Vedhika Srinivasan",
                    "user_href": "/profile/Vedhika-Srinivasan"
                },
                {
                    "user_id": "Revathi Reva",
                    "user_href": "/profile/Revathi-Reva-27"
                },
                {
                    "user_id": "Rohit Kumar",
                    "user_href": "/profile/Rohit-Kumar-12894"
                },
                {
                    "user_id": "Yukti Vyas",
                    "user_href": "/profile/Yukti-Vyas-6"
                },
                {
                    "user_id": "Farheen Ashraf",
                    "user_href": "/profile/Farheen-Ashraf-4"
                },
                {
                    "user_id": "Shraddha Balade",
                    "user_href": "/profile/Shraddha-Balade"
                },
                {
                    "user_id": "Saloni Jain",
                    "user_href": "/profile/Saloni-Jain-588"
                },
                {
                    "user_id": "Shreya Singh",
                    "user_href": "/profile/Shreya-Singh-1435"
                },
                {
                    "user_id": "Angel Candis",
                    "user_href": "/profile/Angel-Candis"
                },
                {
                    "user_id": "Prakasi Cg",
                    "user_href": "/profile/Prakasi-Cg"
                },
                {
                    "user_id": "Srinivas Karthik",
                    "user_href": "/profile/Srinivas-Karthik-19"
                },
                {
                    "user_id": "Mrudul Manu",
                    "user_href": "/profile/Mrudul-Manu"
                },
                {
                    "user_id": "Atchaya Rajasekar",
                    "user_href": "/profile/Atchaya-Rajasekar"
                },
                {
                    "user_id": "Bhuvan Pratap Agarwal",
                    "user_href": "/profile/Bhuvan-Pratap-Agarwal"
                },
                {
                    "user_id": "Sriram Iyengar",
                    "user_href": "/profile/Sriram-Iyengar-27"
                },
                {
                    "user_id": "Sivanesan M",
                    "user_href": "/profile/Sivanesan-M-8"
                },
                {
                    "user_id": "Komal Jahangir",
                    "user_href": "/profile/Komal-Jahangir-2"
                },
                {
                    "user_id": "Ajit Singh",
                    "user_href": "/profile/Ajit-Singh-1065"
                },
                {
                    "user_id": "Sri Bhadri",
                    "user_href": "/profile/Sri-Bhadri"
                },
                {
                    "user_id": "Sumaiya Tariq",
                    "user_href": "/profile/Sumaiya-Tariq-1"
                },
                {
                    "user_id": "Shubham Makhecha",
                    "user_href": "/profile/Shubham-Makhecha-1"
                },
                {
                    "user_id": "Shiwali Tiwari",
                    "user_href": "/profile/Shiwali-Tiwari"
                },
                {
                    "user_id": "Aditya Raj",
                    "user_href": "/profile/Aditya-Raj-942"
                },
                {
                    "user_id": "Samadarshini Bharadwaj",
                    "user_href": "/profile/Samadarshini-Bharadwaj"
                },
                {
                    "user_id": "Lokendra Shekhawat",
                    "user_href": "/profile/Lokendra-Shekhawat-45"
                },
                {
                    "user_id": "Sahil Lanjewar",
                    "user_href": "/profile/Sahil-Lanjewar-5"
                },
                {
                    "user_id": "Anjukr Kavungal",
                    "user_href": "/profile/Anjukr-Kavungal"
                },
                {
                    "user_id": "Shikha Gautam",
                    "user_href": "/profile/Shikha-Gautam-52"
                },
                {
                    "user_id": "Rahul Sanda",
                    "user_href": "/profile/Rahul-Sanda"
                },
                {
                    "user_id": "Mohan Krishna",
                    "user_href": "/profile/Mohan-Krishna-1374"
                },
                {
                    "user_id": "Sreedevi Jayaraj",
                    "user_href": "/profile/Sreedevi-Jayaraj-1"
                },
                {
                    "user_id": "Aisha Tiwari",
                    "user_href": "/profile/Aisha-Tiwari-2"
                },
                {
                    "user_id": "Mounika Ksetty",
                    "user_href": "/profile/Mounika-Ksetty"
                },
                {
                    "user_id": "Kuldeep Dabas",
                    "user_href": "/profile/Kuldeep-Dabas-16"
                },
                {
                    "user_id": "Riyanka Sengupta",
                    "user_href": "/profile/Riyanka-Sengupta-1"
                },
                {
                    "user_id": "Harshaa",
                    "user_href": "/profile/Harshaa-1"
                },
                {
                    "user_id": "Ashwini Joshi",
                    "user_href": "/profile/Ashwini-Joshi-201"
                },
                {
                    "user_id": "Shaik Umar",
                    "user_href": "/profile/Shaik-Umar-50"
                },
                {
                    "user_id": "Aaditya Mishra",
                    "user_href": "/profile/Aaditya-Mishra-89"
                },
                {
                    "user_id": "Raghu G",
                    "user_href": "/profile/Raghu-G-52"
                },
                {
                    "user_id": "Anjola Osiyoku",
                    "user_href": "/profile/Anjola-Osiyoku"
                },
                {
                    "user_id": "Pinky Nishad",
                    "user_href": "/profile/Pinky-Nishad-3"
                },
                {
                    "user_id": "Varun Tiwari",
                    "user_href": "/profile/Varun-Tiwari-11"
                },
                {
                    "user_id": "Éva Szilágyi",
                    "user_href": "/profile/Éva-Szilágyi"
                },
                {
                    "user_id": "John Lawrence",
                    "user_href": "/profile/John-Lawrence-542"
                },
                {
                    "user_id": "Sirisha Chevvuri",
                    "user_href": "/profile/Sirisha-Chevvuri"
                },
                {
                    "user_id": "Raghu K",
                    "user_href": "/profile/Raghu-K-250"
                },
                {
                    "user_id": "Mukesh Yadav",
                    "user_href": "/profile/Mukesh-Yadav-1391"
                },
                {
                    "user_id": "Bhumika Jayshankar",
                    "user_href": "/profile/Bhumika-Jayshankar"
                },
                {
                    "user_id": "Sonia Nagla",
                    "user_href": "/profile/Sonia-Nagla"
                },
                {
                    "user_id": "Amankumar Sharma",
                    "user_href": "/profile/Amankumar-Sharma-2"
                },
                {
                    "user_id": "Kavana Putti",
                    "user_href": "/profile/Kavana-Putti"
                },
                {
                    "user_id": "Aditi",
                    "user_href": "/profile/Aditi-830"
                },
                {
                    "user_id": "Chandirakumar",
                    "user_href": "/profile/Chandirakumar"
                },
                {
                    "user_id": "Seema Sherpa",
                    "user_href": "/profile/Seema-Sherpa"
                },
                {
                    "user_id": "Cynthia Dung",
                    "user_href": "/profile/Cynthia-Dung"
                },
                {
                    "user_id": "Kirti Gotan",
                    "user_href": "/profile/Kirti-Gotan"
                },
                {
                    "user_id": "Ramesh Bhargav Rayudu",
                    "user_href": "/profile/Ramesh-Bhargav-Rayudu"
                },
                {
                    "user_id": "Jyoti Gupta",
                    "user_href": "/profile/Jyoti-Gupta-170"
                },
                {
                    "user_id": "Aayesha",
                    "user_href": "/profile/Aayesha-17"
                },
                {
                    "user_id": "Ambreen Zaidi",
                    "user_href": "/profile/Ambreen-Zaidi-2"
                },
                {
                    "user_id": "Kunal Sawner",
                    "user_href": "/profile/Kunal-Sawner-1"
                },
                {
                    "user_id": "Krati",
                    "user_href": "/profile/Krati-32"
                },
                {
                    "user_id": "Indu Gunnam",
                    "user_href": "/profile/Indu-Gunnam"
                },
                {
                    "user_id": "Wonder Boy",
                    "user_href": "/profile/Wonder-Boy-42"
                },
                {
                    "user_id": "Aashish Singhal",
                    "user_href": "/profile/Aashish-Singhal-1"
                },
                {
                    "user_id": "Zess Infine",
                    "user_href": "/profile/Zess-Infine"
                },
                {
                    "user_id": "Simi Wilson",
                    "user_href": "/profile/Simi-Wilson"
                },
                {
                    "user_id": "Hr Hr",
                    "user_href": "/profile/Hr-Hr-92"
                },
                {
                    "user_id": "Mohit Karpate",
                    "user_href": "/profile/Mohit-Karpate"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Christian-1622"
                },
                {
                    "user_id": "Pavithra Ganesh",
                    "user_href": "/profile/Pavithra-Ganesh-3"
                },
                {
                    "user_id": "Reet Sharma",
                    "user_href": "/profile/Reet-Sharma-67"
                },
                {
                    "user_id": "ROY Pankaj",
                    "user_href": "/profile/ROY-Pankaj-6"
                },
                {
                    "user_id": "Prashant M",
                    "user_href": "/profile/Prashant-M-91"
                },
                {
                    "user_id": "Sayali Pawar",
                    "user_href": "/profile/Sayali-Pawar-66"
                },
                {
                    "user_id": "Ezaz Shaikh",
                    "user_href": "/profile/Ezaz-Shaikh-10"
                },
                {
                    "user_id": "Anusha Sk",
                    "user_href": "/profile/Anusha-Sk-7"
                },
                {
                    "user_id": "Shruti Singh",
                    "user_href": "/profile/Shruti-Singh-2464"
                },
                {
                    "user_id": "Lakshmi Chinnu",
                    "user_href": "/profile/Lakshmi-Chinnu-19"
                },
                {
                    "user_id": "Suma Shaffy",
                    "user_href": "/profile/Suma-Shaffy"
                },
                {
                    "user_id": "Xeno Hemlock",
                    "user_href": "/profile/Xeno-Hemlock"
                },
                {
                    "user_id": "Jk Patel",
                    "user_href": "/profile/Jk-Patel-25"
                },
                {
                    "user_id": "Srishti Singh",
                    "user_href": "/profile/Srishti-Singh-392"
                },
                {
                    "user_id": "Lakshmi Priya",
                    "user_href": "/profile/Lakshmi-Priya-12"
                },
                {
                    "user_id": "Arpita Adhurya",
                    "user_href": "/profile/Arpita-Adhurya"
                },
                {
                    "user_id": "Mahima Kesavan",
                    "user_href": "/profile/Mahima-Kesavan"
                },
                {
                    "user_id": "Pabi Mothekhe",
                    "user_href": "/profile/Pabi-Mothekhe"
                },
                {
                    "user_id": "Priyanshu Nagariya",
                    "user_href": "/profile/Priyanshu-Nagariya-1"
                },
                {
                    "user_id": "Khushboo Kanwar",
                    "user_href": "/profile/Khushboo-Kanwar-13"
                },
                {
                    "user_id": "Garvit Juneja",
                    "user_href": "/profile/Garvit-Juneja-7"
                },
                {
                    "user_id": "Mayank Durgapal",
                    "user_href": "/profile/Mayank-Durgapal-1"
                },
                {
                    "user_id": "Keerthi Subramaniam",
                    "user_href": "/profile/Keerthi-Subramaniam-3"
                },
                {
                    "user_id": "Puja Pathak",
                    "user_href": "/profile/Puja-Pathak"
                },
                {
                    "user_id": "Melvin Benny",
                    "user_href": "/profile/Melvin-Benny"
                },
                {
                    "user_id": "Amrita D R Angie",
                    "user_href": "/profile/Amrita-D-R-Angie"
                },
                {
                    "user_id": "Sonu Kashyap",
                    "user_href": "/profile/Sonu-Kashyap-59"
                },
                {
                    "user_id": "Pranathi Reddy Bomidika",
                    "user_href": "/profile/Pranathi-Reddy-Bomidika"
                },
                {
                    "user_id": "Sam Vlog",
                    "user_href": "/profile/Sam-Vlog"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Sema-CANDARLI"
                },
                {
                    "user_id": "Ruchi Dawada",
                    "user_href": "/profile/Ruchi-Dawada"
                },
                {
                    "user_id": "Bharati Mitra",
                    "user_href": "/profile/Bharati-Mitra-2"
                },
                {
                    "user_id": "CHARLOTTE",
                    "user_href": "/profile/CHARLOTTE-605"
                },
                {
                    "user_id": "Shrushti Naik",
                    "user_href": "/profile/Shrushti-Naik-3"
                },
                {
                    "user_id": "Sanghamitra Das",
                    "user_href": "/profile/Sanghamitra-Das-59"
                },
                {
                    "user_id": "Simi Susan Benny",
                    "user_href": "/profile/Simi-Susan-Benny"
                },
                {
                    "user_id": "Alok Panigrahi",
                    "user_href": "/profile/Alok-Panigrahi"
                },
                {
                    "user_id": "Karri Lalitha",
                    "user_href": "/profile/Karri-Lalitha-2"
                },
                {
                    "user_id": "Shiva Kumar Pendem",
                    "user_href": "/profile/Shiva-Kumar-Pendem"
                },
                {
                    "user_id": "Mohit Vishwakarma",
                    "user_href": "/profile/Mohit-Vishwakarma-88"
                },
                {
                    "user_id": "Rosalin Biswal",
                    "user_href": "/profile/Rosalin-Biswal-3"
                },
                {
                    "user_id": "Rukaiya Hussain",
                    "user_href": "/profile/Rukaiya-Hussain-1"
                },
                {
                    "user_id": "Poonam Yadav",
                    "user_href": "/profile/Poonam-Yadav-959"
                },
                {
                    "user_id": "Kanchan Balani",
                    "user_href": "/profile/Kanchan-Balani-3"
                },
                {
                    "user_id": "Sanskruti Das",
                    "user_href": "/profile/Sanskruti-Das"
                },
                {
                    "user_id": "Hanque Naga",
                    "user_href": "/profile/Hanque-Naga"
                },
                {
                    "user_id": "Akhildas KS",
                    "user_href": "/profile/Akhildas-KS-2"
                },
                {
                    "user_id": "Quỳnh Lê",
                    "user_href": "/profile/Quỳnh-Lê-38"
                },
                {
                    "user_id": "Nidhi Mali",
                    "user_href": "/profile/Nidhi-Mali-1"
                },
                {
                    "user_id": "Zamila Kim",
                    "user_href": "/profile/Zamila-Kim"
                },
                {
                    "user_id": "Susmita Kar",
                    "user_href": "/profile/Susmita-Kar-13"
                },
                {
                    "user_id": "Chitra Suryanarayanan",
                    "user_href": "/profile/Chitra-Suryanarayanan"
                },
                {
                    "user_id": "Praneeth Chitrapu",
                    "user_href": "/profile/Praneeth-Chitrapu"
                },
                {
                    "user_id": "Anisha Singh Chauhan",
                    "user_href": "/profile/Anisha-Singh-Chauhan"
                },
                {
                    "user_id": "Ashwin Jayagopal",
                    "user_href": "/profile/Ashwin-Jayagopal"
                },
                {
                    "user_id": "Priti Waghmode",
                    "user_href": "/profile/Priti-Waghmode-1"
                },
                {
                    "user_id": "Dhwani Bhatia",
                    "user_href": "/profile/Dhwani-Bhatia-6"
                },
                {
                    "user_id": "Rohit Nikalje",
                    "user_href": "/profile/Rohit-Nikalje-2"
                },
                {
                    "user_id": "Kalluri Madhu",
                    "user_href": "/profile/Kalluri-Madhu"
                },
                {
                    "user_id": "Jarvis",
                    "user_href": "/profile/Jarvis-141"
                },
                {
                    "user_id": "Poorvaja",
                    "user_href": "/profile/Poorvaja-4"
                },
                {
                    "user_id": "Jinal Doshi",
                    "user_href": "/profile/Jinal-Doshi-33"
                },
                {
                    "user_id": "Saisha Raut",
                    "user_href": "/profile/Saisha-Raut"
                },
                {
                    "user_id": "Rustom Balsara",
                    "user_href": "/profile/Rustom-Balsara"
                },
                {
                    "user_id": "Mansi Lodhi",
                    "user_href": "/profile/Mansi-Lodhi"
                },
                {
                    "user_id": "Sudheer Loni",
                    "user_href": "/profile/Sudheer-Loni"
                },
                {
                    "user_id": "Akshay",
                    "user_href": "/profile/Akshay-907"
                },
                {
                    "user_id": "Abhinav Singh",
                    "user_href": "/profile/Abhinav-Singh-2395"
                },
                {
                    "user_id": "Anie",
                    "user_href": "/profile/Anie-20"
                },
                {
                    "user_id": "Jyoti Dongre",
                    "user_href": "/profile/Jyoti-Dongre-2"
                },
                {
                    "user_id": "Vidhi Gaikwad",
                    "user_href": "/profile/Vidhi-Gaikwad-1"
                },
                {
                    "user_id": "Nisha Agarwal",
                    "user_href": "/profile/Nisha-Agarwal-468"
                },
                {
                    "user_id": "Janani",
                    "user_href": "/profile/Janani-213"
                },
                {
                    "user_id": "Gurjeet Kaur",
                    "user_href": "/profile/Gurjeet-Kaur-360"
                },
                {
                    "user_id": "Atul Singh",
                    "user_href": "/profile/Atul-Singh-1506"
                },
                {
                    "user_id": "Dinesh Singla",
                    "user_href": "/profile/Dinesh-Singla-6"
                },
                {
                    "user_id": "Shweta Varak",
                    "user_href": "/profile/Shweta-Varak"
                },
                {
                    "user_id": "Sharada Vinod",
                    "user_href": "/profile/Sharada-Vinod-1"
                },
                {
                    "user_id": "Ishika Roy",
                    "user_href": "/profile/Ishika-Roy-44"
                },
                {
                    "user_id": "Respect People",
                    "user_href": "/profile/Respect-People"
                },
                {
                    "user_id": "Rahul Mina",
                    "user_href": "/profile/Rahul-Mina-12"
                },
                {
                    "user_id": "Harish Kumar",
                    "user_href": "/profile/Harish-Kumar-755"
                },
                {
                    "user_id": "Rajkishore",
                    "user_href": "/profile/Rajkishore-3"
                },
                {
                    "user_id": "Rachel",
                    "user_href": "/profile/Rachel-2110"
                },
                {
                    "user_id": "Heena Khatoon",
                    "user_href": "/profile/Heena-Khatoon-6"
                },
                {
                    "user_id": "Jasmine",
                    "user_href": "/profile/Jasmine-918"
                },
                {
                    "user_id": "SAI PRASANNA KUMAR REDDY GHANTA",
                    "user_href": "/profile/SAI-PRASANNA-KUMAR-REDDY-GHANTA"
                },
                {
                    "user_id": "Niket Raj",
                    "user_href": "/profile/Niket-Raj-15"
                },
                {
                    "user_id": "Anjali Nayak",
                    "user_href": "/profile/Anjali-Nayak-18"
                },
                {
                    "user_id": "Megha Desphande",
                    "user_href": "/profile/Megha-Desphande"
                },
                {
                    "user_id": "Ankush Thakur",
                    "user_href": "/profile/Ankush-Thakur-202"
                },
                {
                    "user_id": "Dilip Donthula",
                    "user_href": "/profile/Dilip-Donthula"
                },
                {
                    "user_id": "Pranav Kunavat",
                    "user_href": "/profile/Pranav-Kunavat"
                }
            ]
        },
        {
            "author_info": {
                "name": "Swati Joshi",
                "href": "/profile/Swati-Joshi-14"
            },
            "answer_text": "Drink water, lots of water. Dehydrated skin produces more oil to make up for water and excessive oil leads to acne. Water helps maintain your skin’s moisture level by keeping it hydrated and keeping pimples at bay. Drink at least 8 glasses of water for healthy glowing skin. Some tips to follow in your skincare regime: Cleanse your face well with a good mild oil control facewashExfoliate your skin with a good face scrub, preferably natural, at least one a weekDetox your skin with a good face mask at least once a weekKeep your skin hydrated, drink at least 8 glasses of water a daySpot treat your pimples with Tea tree oil diluted with water(patch test recommended)Invest in a good water-based or gel-based moisturizerDo not pop your pimples as they leave dark spotsThe main reasons for pimples include- Clogged pores: Usually skin pores get clogged due to exposure to dirt and pollution, excessive makeup products, not removing makeup properly and excessive oil production by the skin. Make sure to cover your face when stepping out, instead of using multiple layers of skin-enhancing products use one which does all the work, keep your face clean. Less water: Dehydrated skin produces more oil to make up for water and excessive oil leads to acne. Stress: Stress can trigger acne and can also make existing acne worse. Ever wondered why do pimples pop out at all the wrong timings, especially before an important event? This is mainly because of overthinking and unnecessary stress that we take. Keep yourself calm and worry less. ",
            "date": "Answered January 3, 2020",
            "views": "17",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Krishna",
                    "user_href": "/profile/Krishna-639"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeevitha Christiana",
                "href": "/profile/Jeevitha-Christiana"
            },
            "answer_text": "You can't get clear face by applying layers outside. The effect would be least 5% Clear skin doesn't come from outside, it always seems to be in the core (inside). Your core strength is your clear skin. In Tamil there is a proverb அகத்தின் அழகு முகத்தில் தெரியும். 1.The face is the irndex of the mind. Here we will understand term mind is skin. Ensure you are having good level of harmones and metabolism and how clean your system. Please join gym or do resistance workout at home with minimal dumbell workout. Concentrate on what you eat and avoid all kind of carbs. The carb includes all kind of fancy drinks, fruit juices,honey,white or brown sugar, all bakery items. 2.Proper Bowel movement, Not everyone has a bowel movement twice in a day but it should be regular everyday. You can have kefir curd or kefir milk to overcome constipation. Good bacteria available in the gut is responsible for your healthy system. It's a natural gift from your mother when you born by vaginal delivery. We are killing them everyday by artificial sweeteners and antibiotics. So start having vegetables and kefir milk. 3. Drink plenty of water (3L/day) and keep system hydrated. This is having a loop hole, when you start workout or going to gym, you will be forced to drink plenty of water automatically! 4. Clean your pillow covers properly and change them twice in a week, especially if you are having dandruff. You can Clear dandruff easily with the shampoos available in the market. Use a seperate towel for face and change them once in a week. 5. Wash your face with mild face wash thrice in a day. It's important to choose the facewash, very concentrated heavy face wash or soap will remove all natural oil from face and will dry out the deep skin layer. So wash face in the mornings, evenings, and nights and apply any face moisturizer of your choice in the night. Please follow above, you will get clear skin naturally and also skin complexion will improve. All the best! ",
            "date": "Answered April 19, 2019",
            "views": "10",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nikhila Rajesh",
                    "user_href": "/profile/Nikhila-Rajesh-1"
                },
                {
                    "user_id": "Fathima Athar",
                    "user_href": "/profile/Fathima-Athar-1"
                },
                {
                    "user_id": "Anjola Osiyoku",
                    "user_href": "/profile/Anjola-Osiyoku"
                },
                {
                    "user_id": "Akhilesh Muchhala",
                    "user_href": "/profile/Akhilesh-Muchhala"
                },
                {
                    "user_id": "Meena Madhuri",
                    "user_href": "/profile/Meena-Madhuri"
                },
                {
                    "user_id": "Isaac Walker",
                    "user_href": "/profile/Isaac-Walker-10"
                },
                {
                    "user_id": "Magicpotato",
                    "user_href": "/profile/Magicpotato-1"
                },
                {
                    "user_id": "Gowri Sankar",
                    "user_href": "/profile/Gowri-Sankar-103"
                },
                {
                    "user_id": "Prasanna Thans",
                    "user_href": "/profile/Prasanna-Thans"
                },
                {
                    "user_id": "Kashish",
                    "user_href": "/profile/Kashish-139"
                },
                {
                    "user_id": "Milind Bhatnagar",
                    "user_href": "/profile/Milind-Bhatnagar-1"
                },
                {
                    "user_id": "Prashanth J",
                    "user_href": "/profile/Prashanth-J-45"
                },
                {
                    "user_id": "Kritika Gupta",
                    "user_href": "/profile/Kritika-Gupta-274"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ludivine Reynaud",
                "href": "/profile/Ludivine-Reynaud"
            },
            "answer_text": "If you have severe acne, there's really getting around accutane. That probably won't be enough though, seeing as as soon as you stop it, your acne might come back. So you need an appropriate skin care routine. As far as washing your face goes, you should use a gentle cleanser, without soap. Rinse thoroughly with cold water and dab your face dry with a clean cloth. Anti blemish creams usually dry out the skin and that's not a good thing. There are other creams that are more soothing and they worked better for me as long as I used them consistently - I personally used a cream called “Keracnyl PP” by Ducray and it worked wonder, not that I want to advertize any brand in particular. Then you need to be careful about what you eat. Shun dairy in favor of vegetable milks. You also need to eat your greens. Official guidelines vary from country to country, in France it’s said you ought to eat five servings a day. One great way to do this is to make smoothies with almond or soy milk - that’ll also keep your skin hydrated. Vegetable milk, good for everyone - LifeGate ",
            "date": "Answered December 18, 2018",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Daisy Dannon",
                "href": "/profile/Daisy-Dannon"
            },
            "answer_text": "Each of us knows them: those small, nasty redness and swellings on the face that always seem to appear when you really don't need them. Pimples. If they stay under the skin, they are blackheads, if they are visible, they are called whiteheads. How good that you can tackle the annoying skin blemishes. You can follow any of this Method that is following by stars for No Acne, No Pimple, No Marks. Tricks of the stars Supermodels in particular need perfect skin, it is their capital. You can find out which tricks they use for a flawless result here. Candice Swanepoel: The Victorias Secret model only uses natural beauty products. She removes her make-up with coconut oil every day and uses a mixture of tea tree oil and green tea to cleanse her skin. Miranda Kerr: She massages her skin twice a day with a cleaning brush, removing dead skin cells. She also regularly uses scrubs to care for her skin. Amber Valetta: Another supermodel with a penchant for natural products: Amber Valetta cleanses her skin with goat milk several times a week. The natural lactic acid is good for the skin and is simply dabbed on with a cotton pad and dried again with a towel. Kate Moss: Ice cream helps a lot after a long night. The model fills a sink with cucumber slices and ice, then pokes her face in it. So she looks fresh and fit again. Karolina Kurkova: Lemons are great for the skin, Karolina Kurkova knows that too. That's why she washes her face every morning with the juice of citrus fruit - this cleanses her skin and dries out pimples. ",
            "date": "Answered September 26, 2020",
            "views": "430",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Natasha Tuli",
                "href": "/profile/Natasha-Tuli"
            },
            "answer_text": "Hey !  Skin acne is a common problem now. Firstly, it may sound like a cliche, but, one needs to take care of their diet. Fresh fruits, vegetables and proper quantity of water are daily essentials for a healthier and problem free skin. Now, for acne, you should use Tea Tree Essential Oil. Highly recommended for all skin related issues. Blend it with Grapeseed Carrier Oil for better results. Proportion should be 4-5 drops of Tea Tree with 8-10 drops of Grapeseed. You can happily bid goodbye to acne with continuous and consistent use of this combo. As for acne scars, mash a ripe papaya and make a smooth paste out of it. Apply on the scarred areas of your skin. Keep it for sometime and rinse off with cold water. Also, use Soulflower Baby Your Skin Soap twice a day to get rid of acne scars. This handmade bar is a combination of skin foods like papaya, yogurt and cucumber.  www.soulflower.biz  Soulflower Coldpressed Grapeseed Carrier Oil  Soulflower Baby Your Skin Soap  Soulflower Tea Tree Essential Oil ",
            "date": "Answered January 2, 2016",
            "views": "28",
            "upvotes": " Answer requested by Samaira Gupta",
            "upvoters": [
                {
                    "user_id": "Adeyemi Precious",
                    "user_href": "/profile/Adeyemi-Precious-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bily Andrson",
                "href": "/profile/Bily-Andrson"
            },
            "answer_text": "Hi. I used to have severe acne as well and it affected my self esteem in a very bad way. Though one day while I was at work, as I often would sweat a lot, I decided to start washing my hands, and then my face, (with soap and water), and then after drying my skin applying some lotion to it. I would repeat this whenever I began to sweat, (about 4–5 times a day as an initial way of keeping myself cool), and it eventually became my savior. After about a few weeks of doing this I noticed that my acne had completely disappeared and that my skin was silky smooth and completely clear. People began asking me what I did to get such clear and smooth skin though did not believe me when I shared this information with them. They were too convinced that I was using ProActive or something of that nature. It was a gigantic boost for my self esteem and I have never had acne again since then. This will definitely work for you as well and after you achieve the same results, I just ask that you share it with anyone else who may be in need of an answer to their acne. ",
            "date": "Answered July 3, 2019",
            "views": "19",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tulika Gupta",
                    "user_href": "/profile/Tulika-Gupta-80"
                },
                {
                    "user_id": "Ollie Manzano",
                    "user_href": "/profile/Ollie-Manzano"
                },
                {
                    "user_id": "Bronwyn Spanbauer",
                    "user_href": "/profile/Bronwyn-Spanbauer"
                },
                {
                    "user_id": "Jasmine Issa",
                    "user_href": "/profile/Jasmine-Issa-3"
                },
                {
                    "user_id": "Yakubed Astroskij",
                    "user_href": "/profile/Yakubed-Astroskij"
                },
                {
                    "user_id": "Edythe Krupa",
                    "user_href": "/profile/Edythe-Krupa"
                },
                {
                    "user_id": "Kennith Becerra",
                    "user_href": "/profile/Kennith-Becerra"
                },
                {
                    "user_id": "Maurita Manigault",
                    "user_href": "/profile/Maurita-Manigault"
                },
                {
                    "user_id": "Fried Kallie",
                    "user_href": "/profile/Fried-Kallie"
                },
                {
                    "user_id": "Debra Darosa",
                    "user_href": "/profile/Debra-Darosa"
                },
                {
                    "user_id": "Kathy Bold",
                    "user_href": "/profile/Kathy-Bold-1"
                },
                {
                    "user_id": "Henkel Terrie",
                    "user_href": "/profile/Henkel-Terrie"
                },
                {
                    "user_id": "Harish Vyassa",
                    "user_href": "/profile/Harish-Vyassa"
                },
                {
                    "user_id": "Belva Hove",
                    "user_href": "/profile/Belva-Hove"
                },
                {
                    "user_id": "Corrine Nishioka",
                    "user_href": "/profile/Corrine-Nishioka"
                },
                {
                    "user_id": "Celeste Duhaime",
                    "user_href": "/profile/Celeste-Duhaime"
                },
                {
                    "user_id": "Belen Gottfried",
                    "user_href": "/profile/Belen-Gottfried"
                },
                {
                    "user_id": "Marg Jent",
                    "user_href": "/profile/Marg-Jent"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emily Crawford",
                "href": "/profile/Emily-Crawford-180"
            },
            "answer_text": "To get completely clear skin with no marks is going to be hard. Marks come with age and sun exposure so you can prevent it, but you can’t get rid of them naturally. However, you can reduce the appearance of marks with different creams and topical treatments. You can also try to stop more appearing by using sun screen every day (even if it’s not sunny), drinking a lot of water, eating healthily, and keeping your face clean. For acne & pimples, you want to make sure you have a good skin care routine. Here is an example of a skincare routine which should slowly work to reduce acne/pimples (remember, there are no quick fixes): Wash your face with a gentle cleanserUse a chemical exfoliator with Alpha-Hydroxy Acids in (Luminositie (you can find them on Amazon I think) do a good AHA serum). Stay away from exfoliating scrubs like St Ives - they cause damage to the skin when you scrub your face with them and open you up to sun damage.Use direct acids (such as Salicylic) or a Niacinamide cream which are great for cell turnover, reducing the appearance of pores, and reducing sebum productionMoisturise! This is so important. Find one that suits your skin type (oily, dry, normal, combination). If you don’t moisturise your skin could react by creating more oil to make up for the fact it is dry.Getting rid of acne is not a quick thing, you need to spend time and energy and make lifestyle changes if you want to reduce the chances of it long-term. I hope this helps! ",
            "date": "Answered August 25, 2020",
            "views": "936",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "EYAGHWOREFE FAVOUR",
                    "user_href": "/profile/EYAGHWOREFE-FAVOUR"
                },
                {
                    "user_id": "Yashaswini Yadav",
                    "user_href": "/profile/Yashaswini-Yadav-4"
                },
                {
                    "user_id": "Rãm Sõñtî",
                    "user_href": "/profile/Rãm-Sõñtî"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suneha Singh",
                "href": "/profile/Suneha-Singh"
            },
            "answer_text": "If you need to clear pimple marks from your face follow these tips- Sugar scrub to erase pimple marks. Take three table spoons of sugar, 1 tablespoon of milk powder and one tablespoon of honey, mix them together and scrub this mixture over the face for few minutes and rinse it off after 15 minutesEgg white to lighten pimple marks.Take a fresh egg and break the egg, separate the egg white from the egg yolk. Apply this egg white on the pimple marks. After 10-15 minutes, wash off with cold water.Baking Soda for lightening pimple scars.Take 1 teaspoon of baking soda. Mix few drops of water with it and apply this mixture on the pimple marks.Lemon to treat pimple spots.Squeeze half a lemon and mix the juice with double the amount of glycerin. Now dab this mixture on the skin and leave on. Wash off with water after 10 minutes.",
            "date": "Answered June 15, 2017",
            "views": "32",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sruthi Ram",
                    "user_href": "/profile/Sruthi-Ram-8"
                },
                {
                    "user_id": "Jiya Jose",
                    "user_href": "/profile/Jiya-Jose-3"
                },
                {
                    "user_id": "Divya",
                    "user_href": "/profile/Divya-197"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zoey Hill",
                "href": "/profile/Zoey-Hill-14"
            },
            "answer_text": "I’ve never had severe acne, but I’ve had the occasional outbreak of hormonal acne. What helped me was a gel cleanser by Simple (that stuff works so well, I’m currently on my third container), a moisturizer (the one I use is by Derma E), and NO walnut scrubs/exfoliators. Those will make you break out more, cause microtearing on your face, and make your acne scars worse. I quit using mine about 4 months ago, and my skin has never looked better. Drink plenty of water (I add some turmeric extract to mine. Turmeric is a natural anti-inflammatory and you can barely taste it when added to a drink). You can also take vitamins (I take collagen occasionally, vitamin E, vitamin C, and iron) and supplements like turmeric capsules. These are all things that I do every day (minus the supplements, those I do several times a week) and the skincare can be found at just about any drugstore (or grocery store like Giant and Food Lion). Remember to do these things consistently. I hope this helps you! ",
            "date": "Answered December 19, 2019",
            "views": "924",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Komal Bansal",
                "href": "/profile/Komal-Bansal-22"
            },
            "answer_text": "I think your skin is pimple proneFirst of all stop eating all the junkies!! I know it's not that easy to give up on junk and oily food. But in order to get clear and healthy skin you need to have a good diet which includes lots of fruits, salads, dairy products and sprouts.  Drink plenty of water to flush away all the toxins from your body. Drink more of fruit juices and cut on soft drinks. Have a balanced diet.You can opt for Safi(blood purifier) or try natural stuffs to purify blood like amla(Indian gooseberry), neem, bitter gourds etc..   Use a mild facewash to clean your skin and make sure to remove all the makeup before you go to sleep. Try some natural face masks: -AloveraMake a daily habit of applying fresh aloevera gel on your face after bath -Honey and lemon Mix equal quantities of honey and lemon and apply it whenever you get time. Keep it for 15 min and then wash it off. -Multani mitti Known as Fuller’s earth, is popular for its healing property against acne and blemishes. It reduces acne and absorbs excess oil from the skin. There will be a remarkable change in your skin within a month.!! ",
            "date": "Answered May 21, 2016",
            "views": "63",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Komal K",
                    "user_href": "/profile/Komal-K-46"
                }
            ]
        },
        {
            "author_info": {
                "name": "Toni Percival",
                "href": "/profile/Toni-Percival"
            },
            "answer_text": "Please stop feeling so repulsive towards your acne, it won’t help you by any means. This is very important, the initial step to treat your acne quick. Why should you eradicate those feelings? Since it rapidly creates anxiety in your thoughts, which can probably worsen your acne. Understand that there is hope for you to get rid of your acne. Because anxiety could exacerbate acne, you ought to look for some methods to keep your thoughts from feeling tense. The best way is to unwind your mind and body on a regular basis. You could do massage therapy for your body, take a sauna, yoga exercise, or some routine leisure activity. It will certainly be easier for you to treat your acne if you can keep anxiety away from your thoughts. If you're not choosing your meals very carefully, your eating habits could increase your acne problem. Many meals that you consume may just add even more contaminants in your body. You have to meticulously pick the meals you must eat and those you ought to stay away from. If your acne is growing or you suffer from an acne outbreak after consuming certain foods, you must avoid them at all costs. Eat more veggies and fruits to get the required nutrients for your body to rid the acne Acne No More ",
            "date": "Answered May 13, 2016",
            "views": "29",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Claudia Bella",
                "href": "/profile/Claudia-Bella-4"
            },
            "answer_text": "I swear by aloe vera gel. If you decide to try this, make sure you're getting the highest amount of aloe to other ingredients. My recommended is at LEAST 97%, but 99% works best. If you can get hold of the plant, even better. However, unless you buy ready plant strips, you'll have to wait a while until the plant actually grows. It is healing, soothing and completely natural. You can use it as a mask, use as a moisturiser (if you have dry skin I would recommend topping it off with your usual moisturiser as it will dry out your skin) or as a spot/mark treatment. The reason it will be particularly good for acne is because it is antiseptic and anti-inflammatory. I started having cystic acne at the age of 19 and it took me forever to find a replacement for my benzoyl peroxide. I didn't want to use chemicals or medications on my face to aggravate it more. After a couple of days of using the gel, my inflamed acne was almost gone. It took the marks about 2 weeks to a month to completely fade depending on the size, degree of inflammation and whether or not I was picking it (one of my worst habits, please don't do this). Give it a try! ",
            "date": "Answered December 22, 2019",
            "views": "17",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Saumya Bharti",
                    "user_href": "/profile/Saumya-Bharti-28"
                },
                {
                    "user_id": "Alee RaZa",
                    "user_href": "/profile/Alee-RaZa-30"
                },
                {
                    "user_id": "Seemran Parate",
                    "user_href": "/profile/Seemran-Parate"
                },
                {
                    "user_id": "Somya Srivastava",
                    "user_href": "/profile/Somya-Srivastava-94"
                },
                {
                    "user_id": "Pranav Kunavat",
                    "user_href": "/profile/Pranav-Kunavat"
                },
                {
                    "user_id": "Saketh Malladi",
                    "user_href": "/profile/Saketh-Malladi-1"
                },
                {
                    "user_id": "Sejal K",
                    "user_href": "/profile/Sejal-K-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tanu Sharma",
                "href": "/profile/Tanu-Sharma-741"
            },
            "answer_text": "I have always had skin problems since I was a teenager. I thought as I grew older, I would get rid of these skin issues. Well, I’m 28, and I still have breakouts on my chin. I bought into the hype about raw ginger a few months back, and my face broke out the worst I had ever seen. I found pimples popping on my cheeks and alongside my jawline. No topical preparation, including Himalaya, would work, so I started looking on the internet and did a ton of research on how to get rid of these zits without using chemicals. I’m someone who gives preference to home remedies rather than medicinal products. I found out acne can be due to lack of essential nutrients, too much oil on the skin’s surface, or hormonal imbalance. I came across the benefits of fuller’s earth and curd for all type of acne problems and decided to take a chance. Within a month, I noticed the pimples starting to disappear, and my skin becomes brighter and softer as I continue using it. Now I won’t go without the remedy. Curd helps me combat my dryness issue while fuller’s earth helps heal pimples. I’m a true believer, and I have been using them since October 2015. ",
            "date": "Answered November 2, 2019",
            "views": "3",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Girlie Trinidad",
                    "user_href": "/profile/Girlie-Trinidad-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carol Carol",
                "href": "/profile/Carol-Carol-169"
            },
            "answer_text": "I have tried so many methods and products to get rid of my acne, a very useful method I found is changing your cotton pillowcase to a silk pillowcase. it's hypoallergenic, breathable, and moisture-wicking. On top of that, it also minimizes the appearance of sleep creases upon waking up that have been linked by research to premature wrinkle-formation. In fact, a study by the Department of Dermatology in Medical University (Austria) found that a special type of silk textiles had positive results on back acne after wearing a silk shirt for six weeks. Although the silk fabric used for pillowcases is not exactly the same as these, we can infer from the study that silk is a better fabric than cotton when it comes to sensitive and acne-prone skin. I purchased my silk pillowcase on THXSILK website and it only cost me $13 and it really worth the price! My acne has decreased a lot and the silk texture is much more comfortable than cotton.  ",
            "date": "Answered September 1, 2019",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Safira Nursiyami",
                    "user_href": "/profile/Safira-Nursiyami"
                },
                {
                    "user_id": "Bharat Kalsangrah",
                    "user_href": "/profile/Bharat-Kalsangrah"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sulley Waterfall",
                "href": "/profile/Sulley-Waterfall"
            },
            "answer_text": "We face many kinds of facial problems as we grow older especially adolescence period. Acne occurs when oil glands attached to the hair follicles are stimulated at the time of puberty or due to other hormonal changes. Here are some few tips on how to clean the skin: Put fresh lemon juice into a bowl. Dilute the juice with a little amount of water if your skin is too sensitive. Some cases, you don't need water so better use the normal juice. Use a cotton ball, dab the fresh lemon juice over the acne scars and pimple marks. Keep your face clean. Whether or not you have acne, it's important to wash your face twice daily to remove dirt, dead skin cells, and extra oil from your skin's surface. However, if symptoms persist, I strongly recommend to see an expert. That would be the best option! ",
            "date": "Answered December 12, 2018",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dima Al Mahsiri",
                "href": "/profile/Dima-Al-Mahsiri"
            },
            "answer_text": "Exfoliation is probably the fastest way for dimensioning scars. You can use chemical peeling for better results. There are some natural chemical peelers like sugar (glycolic acid), and citrus fruits (citric acid). One face mask for exfoliating and lightening skin tone that I love is Yogurt and lemon juice face mask. Add few drops of freshly squeezed lemon juice and mix with 3 tablespoons of plain yogurt, apply to your face and leave on for 10-15 minutes before you scrub gently. Then wash with warm water and apply a moisturizer. You will have to use such face mask for a while before you see visible results. Good luck! ",
            "date": "Updated December 18, 2017",
            "views": "25",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ashwini Joshi",
                    "user_href": "/profile/Ashwini-Joshi-201"
                },
                {
                    "user_id": "Dipak Giri",
                    "user_href": "/profile/Dipak-Giri-29"
                },
                {
                    "user_id": "Molisha Singh",
                    "user_href": "/profile/Molisha-Singh"
                },
                {
                    "user_id": "Kanhaiya Varshney (कन्हैया वार्ष्णेय)",
                    "user_href": "/profile/Kanhaiya-Varshney-कन्हैया-वार्ष्णेय"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akriti Thakur",
                "href": "/profile/Akriti-Thakur-2"
            },
            "answer_text": "I had a major acne problem for years in my life. It wasn't because of food. Pimples would just keep coming up and my face was a mess. I started applying Erytop cream. After a month, I could see my pimples reducing. I kept applying Erytop, and now my face doesn't have any acne problem. A pimple may develop once in a month, but that's just it. After my face improved, I started using toner to cleanse my face. I also started using L'Oreal's clay mask. Note : Erytop is the important factor here. Once your face is clear, you can start using other products like masks to make your skin glow. ",
            "date": "Answered December 16, 2018",
            "views": "21",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nandini Shewani",
                    "user_href": "/profile/Nandini-Shewani"
                },
                {
                    "user_id": "Zoja Lettrichová",
                    "user_href": "/profile/Zoja-Lettrichová"
                },
                {
                    "user_id": "Punom Ramchiary",
                    "user_href": "/profile/Punom-Ramchiary"
                },
                {
                    "user_id": "Jee Goult",
                    "user_href": "/profile/Jee-Goult"
                },
                {
                    "user_id": "Sai Nitheesh Reddy",
                    "user_href": "/profile/Sai-Nitheesh-Reddy-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sanyuktha",
                "href": "/profile/Sanyuktha-2"
            },
            "answer_text": "The first and foremost step to clear acne is to ditch all beauty products and switch to natural remedies to end all skin problems.Believe me when i was 15 years old i used every product that says pimple cleaning and i even consulted so many dermatologists and swallowed many tablets but they worked only for some time and pimples used to show up again and again. I got so frustrated and lost all my self esteem. Later i threw all my beauty products as they are not showing any results and gradually my acne started clearing up.This way i am saving a lot of money that i used to spend on those cosmetics and my skin got cleared now.You can even use homemade remedies to quickly heal the acne.  Checkout detailed home remedies for pimples here HAPPY HEALTHY SKIN ",
            "date": "Answered November 1, 2019",
            "views": "385",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sourav Saha",
                "href": "/profile/Sourav-Saha-226"
            },
            "answer_text": "Buy a Massager. Face massagers can be found in a abubdance, online and offline. Use a good foaming and deep clean facewash and put it all over your face. Use the different attachments and massage the facewash on your skin every night before bed or after you come back home from work/college/school, with a sweaty or oily face. Keep the massager vibration at low, since the bigger pimples can hurt with strog vibrations. Try using modules like those with soft comb type teeth, and something that has small round bumps. Finish with the attachment having plane surface. Shouldn't take more than 15 mins. Do this daily and you'll see the effects after a week or two. Then make it Alternative day. Once your skin gets healthy. Make it 5 mins of massage every day and it'll maintain. After the massage, what I do was put a thin layer of toothpaste(the white one, not the gel ones) around my nose borders(where I get most of the oil secretion) or put anti bacterial talc on my face lightly and go to bed. ",
            "date": "Answered August 15, 2019",
            "views": "857",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jaspreet Kaur",
                "href": "/profile/Jaspreet-Kaur-238"
            },
            "answer_text": "Aloe vera gel and sandalwood are 2 products, that will help calm the breakouts and give a cooling sensation on the skin. If used regularly you can see results within a month. Be sure to use organic products ( aloe vera extract directly from the plant or a product from the market which has 70% or more aloe content and for sandal wood, it is better to buy the sandal wood stick from a ayurvedic store rather than buying the powder form). After the breakouts are gone, you might still be left with scars ( Acne scars) you can continue using chandan and aloe vera gel but I would advise you to include BIO OIL in your skin care routine ( use aloe in the morning and bio oil ant night, that way you can get the goodness from both products ). Having said that, it is also important to have good eating habits (NO OILY FOOD), drink plenty of water ( minimum of 4 Liters a day! ) and of course, a good nights sleep (as stress is often the cause of pimples on forehead)! EDIT : TEA TREE oil can be used on the pimple to dry it out, but this is not advised in the winter season since the skin is already dry (and sometimes flaky too) in this season! ",
            "date": "Updated November 29, 2016",
            "views": "129",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ashwini Joshi",
                    "user_href": "/profile/Ashwini-Joshi-201"
                },
                {
                    "user_id": "Anuprit Kaur",
                    "user_href": "/profile/Anuprit-Kaur"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fabiola MS",
                "href": "/profile/Fabiola-MS"
            },
            "answer_text": "I had clear skin as a teen-age lady, now as an adult after joining college I started getting zits all over my cheeks, the scars getting reluctant to fade away. After a long struggle with medication and home remedies these helped me at last: NOT TOUCHING MY FACE WHATEVER IT MAY BE. This in fact was the major reason my face cleared upUsing vicco turmeric cream everyday over the inflamed areas cleared up new zits overnight.Also changed my soap and face cream to Forrest essentials brand that worked wonders.Included lots of fruits and keep myself hydrated all day. Thanks for reading…",
            "date": "Answered December 14, 2018",
            "views": "2",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Simi Srivatav",
                    "user_href": "/profile/Simi-Srivatav"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shivani Grover",
                "href": "/profile/Shivani-Grover-19"
            },
            "answer_text": "You can use homemade face packs to control excess oil production and prevent acne breakouts by using Multani mitti. This Multani mitti natural powder purifies facial skin bursting the pimples, acne, scars and dullness. Also it actively lightens and brightens the sun tanned skin, feet, dark neck and underarms presenting you the beautiful glowing face and fresh skin. I will personally recommend you to use Indus Valley Multani Mitti powder and sandalwood face pack as it is 100% natural and free from any kind of adulteration. How to use: Blend 1 tbsp of each Multani mitti powder and a sandalwood powder with 2 tbsp of aloevera gel.Pour 10 spoon of raw milk in it.Stir a paste and apply it all over face for 20 minutes.Washout your face with plain water.You can get it from Amazon, Flipkart & Nykaa.  ",
            "date": "Answered November 29, 2019",
            "views": "755",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alice Wells",
                "href": "/profile/Alice-Wells-11"
            },
            "answer_text": "That comes with luck. But now I have seen many with clear faces. But, I have always taken care of my face and I have and still have some acne, and I guess the worse are scares from accidents. Example, one of the worse falls was on my face on the left side that was torn to pieces. It was sutured immediately but the scars remain. Just try to live life and take care of your face with the notion that there may be some sort of accident or let's say a large growth that needs to be removed. But I commend you on wanting to look your best and maybe you are in the group that never has any thing to come about. Thank you for this good question that a lot of young people can learn from and accept life and all it's imperfections. ",
            "date": "Answered January 5, 2020",
            "views": "525",
            "upvotes": " Answer requested by Andriansyah Lesner",
            "upvoters": [
                {
                    "user_id": "Bhomi Saini",
                    "user_href": "/profile/Bhomi-Saini"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sameer Singh",
                "href": "/profile/Sameer-Singh-1132"
            },
            "answer_text": "WELL this is a very big problem faced by almost everyone but there is a SOLUTION TO THIS PROBLEM 1)CLEAN: keep your face clean use facewash which suits best to your skin.  2)MOISTURISE: make sure you moisturize your face twice a day a)MORNING b)EVENING  3)FACE MASK: use a charcoal face mask to keep your pores open and breathable because dirty pores lead to the acne so use Newish Activated Charcoal Peel-off Mask  4)WORKOUT: When you workout you sweat which cleanses the pores and leads to more clear and glowing skin  ",
            "date": "Answered August 19, 2019",
            "views": "876",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Meghan Allison",
                    "user_href": "/profile/Meghan-Allison-14"
                },
                {
                    "user_id": "Kristin Singleton",
                    "user_href": "/profile/Kristin-Singleton-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gunjan Manke",
                "href": "/profile/Gunjan-Manke"
            },
            "answer_text": "Follow face hygiene. Regularly change pillow covers, wash towels, do not touch your face without washing your face, tie your hair backwards(don’t let them touch your face), regularly wash your face(at least thrice a day)Drink 10–12 glass of waterDon’t apply makeupAvoid going in dusty areas or cover your face in case you go thereUse only organic or natural skin care products.Apply Aloe Vera in every 3 days.Avoid oily foodEat healthy food especially rich in antioxidantsEven if you have one acne which is part of adolescence, then don’t prick. It will lead to infection, thus forming more pimples ",
            "date": "Answered February 20, 2020",
            "views": "869",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Adrianna Ta",
                    "user_href": "/profile/Adrianna-Ta"
                },
                {
                    "user_id": "Samaira Gupta",
                    "user_href": "/profile/Samaira-Gupta-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Julia Matthews",
                "href": "/profile/Julia-Matthews-48"
            },
            "answer_text": "Apply the lemon juice to the acne-affected area. Leave it on the skin for 10 minutes or till the lemon juice dries out completely. Rinse the area with water, then pat dry with a clean towel. Repeat this remedy twice every day. Wash the affected area with a gentle cleanser. Pat the area dry with a clean towel. Apply a spot treatment that can dry out the pimple. Examples of spot treatments include tea tree oil, benzoyl peroxide, or salicylic acid. Go to my Profile and you can find all about get rid of acne material there... ",
            "date": "Answered April 23, 2020",
            "views": "336",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ashish Gupta",
                    "user_href": "/profile/Ashish-Gupta-1337"
                },
                {
                    "user_id": "Megha Desphande",
                    "user_href": "/profile/Megha-Desphande"
                },
                {
                    "user_id": "Sahil Chawla",
                    "user_href": "/profile/Sahil-Chawla-79"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cindy Hayes",
                "href": "/profile/Cindy-Hayes-78"
            },
            "answer_text": "Sugar and Some Carbs You're more likely to have acne if your diet is full of foods and drinks like soda, white bread, white rice, and cake. The sugar and carbohydrates in these foods tend to get into your blood really quickly. Drinking water is primarily thought to prevent acne by promoting proper skin hydration. Dry skin can trigger excess oil production, which could contribute to acne ( 2 ). Go to my Profile and you can find all about Acne material there... ",
            "date": "Answered September 14, 2020",
            "views": "41",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gabi de Lourdes",
                "href": "/profile/Gabi-de-Lourdes"
            },
            "answer_text": "I love the fact that you are looking for “natural” treatments. Natural ingredients have been proven to work for many people for the treatment of acne as well as other skin conditions. Given that the skin is an organ (actually the biggest one in the human body) the treatment has to be done from the inside out! So, a healthy lifestyle (ex: good diet, excercise) is a must! And as for the outside, you might want to follow a skin routine (cleansing, toning and moisturizing) that includes just natural ingredients. I have come up with a treatment that I hope you find helpful! Please check it out here: Natural Acne Treatment All the best to you! Gabi at Simply Natural & Such ",
            "date": "Answered December 27, 2018",
            "views": "477",
            "upvotes": " Not for Reproduction",
            "upvoters": [
                {
                    "user_id": "Ellen Francis",
                    "user_href": "/profile/Ellen-Francis-9"
                },
                {
                    "user_id": "Deepika Dhilip",
                    "user_href": "/profile/Deepika-Dhilip-1"
                },
                {
                    "user_id": "Pallavi Sahu",
                    "user_href": "/profile/Pallavi-Sahu-7"
                },
                {
                    "user_id": "Prajwal Bopaiah P V",
                    "user_href": "/profile/Prajwal-Bopaiah-P-V"
                },
                {
                    "user_id": "Gagan Mohan Reddy",
                    "user_href": "/profile/Gagan-Mohan-Reddy-1"
                },
                {
                    "user_id": "Vijay Kumar",
                    "user_href": "/profile/Vijay-Kumar-960"
                },
                {
                    "user_id": "Brijesh Agarwal",
                    "user_href": "/profile/Brijesh-Agarwal-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lance Roll",
                "href": "/profile/Lance-Roll"
            },
            "answer_text": "hi,we have some natural tips  home remedies for acne scars and scar.  sandalwood paste in rosewater and leave it on your face overnight, then wash it off the next morning. Rubbing tomato slices on scars is also found to be effective in reducing the appearance of the marks or scars. Apply egg whites on the scars using a cotton ball and leave it on overnight to get the best effect.home remedies for acne scars applying turmeric paste and apple cider vinegar are also the good for clear scars and spots. ",
            "date": "Answered December 23, 2015",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robyn Esto",
                    "user_href": "/profile/Robyn-Esto"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sagar Shelar",
                "href": "/profile/Sagar-Shelar-11"
            },
            "answer_text": "Wash your face in morning face mask--(Old tree) tea tree oil + fuller's earth + Honey + milk - wash after dry Wash your face with cold water Apply aloe vera as moisturizer or just use cold water during bath to wash your face. Use salicylic acid/ Benzoyl content foam facewash after your day work. Stay hydrated and away from oily foods. These definitely going to help you. ",
            "date": "Answered September 1, 2019",
            "views": "381",
            "upvotes": " View 3 Upvoters"
        },
        {
            "author_info": {
                "name": "Betim Kelmendi",
                "href": "/profile/Betim-Kelmendi"
            },
            "answer_text": "with 20 years of experience, i can just tell you that forget all the cleaner 1. most of the people had or have acne and you can just wait till its done byself, i did so much in my live, try everything but nothing helped, just lost money and was sad 2. to have a clean skin then just eat healthy, make sport and drink enough water and sleep enough, thats the only things what helped to me, and wash only with water, not much sope, maybe just 1 per, because our skin have a fat-surface to protect it again infections asf….. thats all ",
            "date": "Answered September 3, 2019",
            "views": "887",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aj Quinn",
                "href": "/profile/Aj-Quinn-3"
            },
            "answer_text": "I think mine is genetic or no? Because my sister have acne but not that worse also my other brother im the only one at our home in our sibling who doesnt have pimples, never had an acne and no marks just pores but like a very very small pores that you’ll see when you focus om my face but i also dont drink lots of water i just cleanse my face with any facial wash, use acv water toner, aloe vera gel as moisturizer and i put tamanu oil whenever i have a pimple (it also removes pimple marks, allergies and stuff definitely recommended) and thats really just about it ",
            "date": "Answered December 15, 2018",
            "views": "768",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Piyali Kar",
                "href": "/profile/Piyali-Kar-15"
            },
            "answer_text": "Your skin has small pores that are connected to the oil glands lying under the skin through follicles. These glands are responsible for producing sebum. There are several other factors can aggravate the acne problem like genetic, hormonal, drugs, smoking etc. Some natural ways to prevent acne or pimples like cut down on caffeine, sugar & refined carbohydrates, having plenty of fresh fruit & green leafy vegetables. One of my friend was suffering from acne & pimples for last two years. She came to know about Naturoveda Health World from news paper. They provides a combination treatment of Ayurveda, Unani and Therapeutic Yoga. ",
            "date": "Answered August 8, 2019",
            "views": "389",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Meighan Sembrano",
                "href": "/profile/Meighan-Sembrano-1"
            },
            "answer_text": "There are so many creams and serums available in the market which cures acne and marks. One of them which actually helps removes acne and marks caused by acne is Zeroblem serum, which has come from a Solvaderm brand. You can see the reviews by going into the Solvaderm website. It may give you clear complexion with no acne and marks on your face. ",
            "date": "Answered May 13, 2016",
            "views": "41",
            "upvotes": " View 7 Upvoters"
        },
        {
            "author_info": {
                "name": "Mariyam Khan",
                "href": "/profile/Mariyam-Khan-20"
            },
            "answer_text": "Hi, i faced alot of acne and pimple issues but i recovered. My answer will surely help you reduce acne and soon you may get acne free skin. It may come back if you do not maintain your facial skin properly. Kindly find the answer in below link as i have already answered similar question to someone else as well.  Mariyam Khan's answer to How do I remove pimple holes from my face with home remedies? Hope this will help you. It surely helped me getting clear, blemish free skin.  God bless :) ",
            "date": "Answered May 21, 2016",
            "views": "28",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Yue Rain",
                "href": "/profile/Yue-Rain"
            },
            "answer_text": "difficult questions to answer and no one can give you a straight forward answer or one answer fit all. to get it, just go to the dermatologist to do it for you. not everything natural is good or going to wait for it to naturally be good is not for your skin. ",
            "date": "Answered March 11, 2019",
            "views": "329",
            "upvotes": " Answer requested by Chase Hanson"
        },
        {
            "author_info": {
                "name": "Salveo LifeSciences",
                "href": "/profile/Salveo-LifeSciences"
            },
            "answer_text": "You might have tried and tested out a lot of products but has not been satisfied. If you are having a skin problem it is advisable to consult a dermatologist before using any product. Try something natural this time. Apply noni juice directly on the pimple and its marks. Regular application will dissipate the marks. Salveo Life Sciences has noni juice and capsules and being the largest distributor of the fruit this is a trusted brand. Now all the herbal remedies can be ordered online too. ",
            "date": "Answered January 2, 2017",
            "views": "889",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shravan Kumar",
                "href": "/profile/Shravan-Kumar-687"
            },
            "answer_text": "Greetings! Here are a few natural remedies: Use honey mask on your face. Use neem mask or neem scrub. Use aloe vera gel as a night cream. Use fuller's earth on your face. Vitamin E cream or oil helps u to face your scars. use ice cubes on your acne marks. There is also a skin care community on CareSpace CareSpace - Diabetes, Blood Pressure and more – Apps on Google Play I’d suggest you join the community to get the right help. ",
            "date": "Answered January 7, 2019",
            "views": "459",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Zina Al Obaidi",
                "href": "/profile/Zina-Al-Obaidi"
            },
            "answer_text": "•regularly wash your face (when you wake up and before you go to bed) •apply moisturizer and facial cleanser daily for sometime •stay hydrated •eat food low on sugar and without too much grease (healthier foods) •avoid touching you face with your bare hands •if you put makeup on try to use natural products or don’t put too much on ",
            "date": "Answered January 5, 2020",
            "views": "190",
            "upvotes": " Answer requested by Andriansyah Lesner"
        },
        {
            "author_info": {
                "name": "Poojitha Poojitha",
                "href": "/profile/Poojitha-Poojitha-5"
            },
            "answer_text": "your question is very natural.many people suffer with this problem.They don’t go outside,they feel so hesitated.To get a NATURAL CLEAR SKIN,firstly your diet should be very strict. eat more juicy fruits,do exercise daily,do not expose your skin to sun,drink plenty of water.I will provide a link which shows natural remedies to clear acne.YouTube ",
            "date": "Answered June 20, 2019",
            "views": "164",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Milton Sailor",
                "href": "/profile/Milton-Sailor"
            },
            "answer_text": "Aloe vera and turmeric pack to clear scars of pimples Aloe Vera is a great source of nutrients, enzymes and polysaccharides. It acts as anti-bacterial and anti-fungal agent and helps to remove the toxins present in the skin and also balances the natural moisture level of the skin. Turmeric is an excellent exfoliating agent and has anti-inflammatory properties. Make a paste of fresh turmeric and mix 1 tsp of Aloe Vera pulp with it. Apply this pack onto the pimple marks, wash off after 20 minutes. ",
            "date": "Answered November 30, 2016",
            "views": "801",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shadab Khan",
                "href": "/profile/Shadab-Khan-515"
            },
            "answer_text": "In my opinion, Dermalmd blemish serum is the best for drying out pimples without terrorizing your skin. I have been using this serum for decades, and now my 13 year-old son is using it. We have tried every other drugstore product, and nothing compares. All the others we tried contain Benzoyl Peroxide, which bleached out bedding/clothing and didn't work nearly as well. ",
            "date": "Answered June 21, 2017",
            "views": "473",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shambhavi Vashistha",
                "href": "/profile/Shambhavi-Vashistha-1"
            },
            "answer_text": "What works for me is pure rosewater. I wash my face with a gentle facewash, then dab some on a cotton pad and then pat it lightly on my skin. Doing this twice a day can give you visible results in a week or two.  ",
            "date": "Answered May 29, 2019",
            "views": "190",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Shilpa Narendramath T",
                "href": "/profile/Shilpa-Narendramath-T"
            },
            "answer_text": "U can try out moms Co natural clay face mask for acne blemishes pigmented free skin it contains natural essences which soothes the skin ND completely safe ",
            "date": "Answered July 11, 2020",
            "views": "114",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bonnie Simpson",
                "href": "/profile/Bonnie-Simpson-1"
            },
            "answer_text": "See a dermatologist. The antibiotics and acne ointments he/she prescribes will do the most to clear acne and to treat the scars.  ",
            "date": "Answered December 23, 2015",
            "views": "111",
            "upvotes": " Answer requested by Samaira Gupta"
        },
        {
            "author_info": {
                "name": "Sakshi Patil",
                "href": "/profile/Sakshi-Patil-411"
            },
            "answer_text": "Best Anti-Acne And Anti-Pimple Creams 2020 The Best Acne Treatment for Every Kind of Breakout. ",
            "date": "Answered June 10, 2020",
            "views": "81",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vijay Makthala",
                "href": "/profile/Vijay-Makthala"
            },
            "answer_text": "Apply Aloe Vera on your before going to sleep, continue this for 30 alternate days or you can extend depending on your results. ",
            "date": "Answered December 7, 2019",
            "views": "122",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sabrina Bell",
                "href": "/profile/Sabrina-Bell-50"
            },
            "answer_text": "The one and only answer to this question is hemp extracts.  ",
            "date": "Answered October 1, 2019",
            "views": "196",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sultan Qaisar",
                "href": "/profile/Sultan-Qaisar"
            },
            "answer_text": "How to remove pimple marks naturally for oily skin check these remedies ",
            "date": "Answered January 20, 2019",
            "views": "176",
            "upvotes": "0"
        }
    ]
}