{
    "title": "How do objects move through space? - Quora",
    "tags": [
        "Objects",
        "Outer Space",
        "Astrophysics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brian R. Sanderson",
                "href": "/profile/Brian-R-Sanderson"
            },
            "answer_text": "How do you move through space? You’re in space right now. Ok, the particular point in space you’re occupying happens to be on the surface of a planet with a breathable atmosphere and gravity. You push off with something (your feet, for instance), and you move in the opposite direction. It’s even more fun on a wheeled office chair. You push off with your arms and - wheeee - you go rolling across the floor! Probably spinning a little while you do. “Every action produces an equal and opposite reaction”. Now, pushing off with your feet or arms in outer space works much the same way…but only if you have an object of greater mass to push against. If you’re asking how rocket propulsion works: that’s easy; the force of the rapidly expanding rocket propellant pushes against the rocket engine as it thrusts its way away from said engine. The engine, and whatever is attached to it, gets pushed in the opposite direction. There’s no atmospheric friction to slow down an object in the vacuum of space; so once you start accelerating by firing your rocket engine, the spacecraft will maintain velocity unless some counter-thrust is applied to slow it down again. ",
            "date": "Answered March 27, 2017",
            "views": "18",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jan Meyer",
                    "user_href": "/profile/Jan-Meyer-64"
                },
                {
                    "user_id": "Samuel Dunford",
                    "user_href": "/profile/Samuel-Dunford"
                },
                {
                    "user_id": "Barry Hampe",
                    "user_href": "/profile/Barry-Hampe"
                }
            ]
        },
        {
            "author_info": {
                "name": "Safiqul islam",
                "href": "/profile/Safiqul-islam-135"
            },
            "answer_text": "Objects in space follow the laws or rules of physics, just like objects on Earth do. Things in space have inertia. That is, they travel in a straight line unless there is a force that makes them stop or change. The movement of things in space is influenced by gravity. Gravity is an important force that can change the course of bodies in space or pull them off of one course, or even cause them to crash together. While some objects in space travel in irregular paths, most (especially our near neighbors in space) tend to travel in orbits around the Sun or around planets. The orbits are usually close to circular, but are actually slightly flattened ellipses. ",
            "date": "Answered July 8, 2019",
            "views": "374",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Donald Fone",
                "href": "/profile/Donald-Fone"
            },
            "answer_text": "All objects in space are moving. Space is made up of invisible fields. These fields are warped by mass and energy. Moving things have to follow the paths created by the warped fields. If those paths lead down to a planet, the moving things must follow the paths to the planet. That's called gravity, paths in space made by mass. ",
            "date": "Answered May 15, 2017",
            "views": "419",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aaron Arrington",
                "href": "/profile/Aaron-Arrington-8"
            },
            "answer_text": "Gravity pulls objects closer causing them to move. Another factor that plays into your question is inertia. ",
            "date": "Answered May 21, 2018",
            "views": "233",
            "upvotes": "0"
        }
    ]
}