{
    "title": "How is science able to benefit society? - Quora",
    "tags": [
        "Benefits",
        "Society"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Bruss",
                "href": "/profile/John-Bruss-2"
            },
            "answer_text": "Science is not necessary but it is one hack of a good tool (if used properly). Science is (as it was originally defined to be) the great adventure of discovering “god’s creation” and mapping it out to see how it works. If that is the approach used, it is truly magnificent and highly useful (which we observe through technologies that help humans use the science-discovered principles to great advantage). But two problems can crop up with any highly useful tool. It tempts some humans to possess/control the tool and use the tool for their personal advantage (like fire can be used to threaten others and in warfare, as well as cook food and heat homes).Those who have the most control over the new tool can let their egos/willfulness grow and start to believe they are “god like”. Using the temptation (as mentioned above), they might try to strip other “allegiances” they see the public has so that they can have “sole control” over the public, society, government, legislation, government funding, etc….total control.We saw that happened many times with religions (we see it via some terrorists today). The desire for total control (using any tool at hand) is a powerful “drug” for many amoral alpha types. Don’t ever forget that….that is foundationally true. However, we still need alpha types. But society needs to see the mega-alpha type and look down the road at the amoral strategies those alpha types might have to gain greater control. Again, this is a millenia old dilemma so it’s a well established pattern society needs to always watch out for. So today, for many, science has become an addiction for them as much as it has historically been for some literal religious zealots. We can see that they are religious zealots for material science. Their aim is to replace zealous power seeking religion with zealous power seeking science, and with the same ugly oppressive results for society). Interesting, both got and keep their “motivation” via hate. Remember, hate (us vs. them) is a far more powerful motivator than love. But of course, hate divides and destroys, love does the opposite. ",
            "date": "Answered July 3, 2018",
            "views": "27",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Josiah Egge",
                    "user_href": "/profile/Josiah-Egge"
                },
                {
                    "user_id": "Akon Edet",
                    "user_href": "/profile/Akon-Edet"
                }
            ]
        },
        {
            "author_info": {
                "name": "Francis Chen",
                "href": "/profile/Francis-Chen-2"
            },
            "answer_text": "I'm going to answer this question from the lens of economic development. Having a strong scientific elite allows governments to conduct R&D on future breakthroughs that help human productivity, and create new jobs based on these new emerging tools, products and services. The more R&D, the more a society can say, “Hey, these are new jobs, careers, you can pursue or enter, as these old jobs become automated or outsourced.” Good science and R&D allows for a society to achieve economic and social stability. The big problem in the US is that if you want to participate in the cutting edge technology, where there's a strong direct link between research & commercialization, you have to live in one of these cities: San FranciscoNew York CityBostonSeattleWashington DCLos AngelesIt's possible to achieve this at second or third tier cities in the US, but the pace will be slower than these first tier cities. And I think this is the core challenge of the US. There is far less opportunity to participate in “light at the tunnel” moonshot projects, so you have a small percentage of the highly educated workforce that take the majority of the gains. Thus, the civil unrest in the US. I believe increasing access to these moonshot projects via reskilling, infrastructure improvements, and R&D will help keep the workforce competitive. ",
            "date": "Answered September 18, 2020",
            "views": "154",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Karan Mehta",
                    "user_href": "/profile/Karan-Mehta-8"
                }
            ]
        }
    ]
}