{
    "title": "How does an atomic structure really look? - Quora",
    "tags": [
        "Atomic Structure"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jade Roberts",
                "href": "/profile/Jade-Roberts-30"
            },
            "answer_text": "Depends on the state. From my observations, they look nothing like what our current models denote. However, they are very difficult to see, by eye, yet, they are very radiant when fluorescing as they undergo ionization or hydrolyzing. From my samples, I have noticed a solidity of the atomic particle or corpuscle compounds as they oscillate and undergo fusion. For example, water, has been noted as a very confusing atomic compound, as it has many properties that are unique to it. In my studies, I've more come to think of fluidic water as a plasmodic type atomic compound. It is in the ionization that the particle matter of water becomes electromagnetically charged, forging ions of hydrogen and oxygen, which give off an electromagnetic frequency in the Hz frequencies we call red or blue, nearer 396nM to ~700nM range. They are quite innocuous, however, that is because I've done my observational experiment nearly over 200 times, and have become used to what it looks like. I created a term to describe what I saw, created calculations to facilitate a quantization, PINs, particles of a partially ionic nature, unipolar to much more complex. To say how beautiful or magnificent they look, is difficult. However, they are very amazing to view as they chain up in a saline droplet. Should I show my work? I only have sketches, which I've shown, or a proof of concept by photographing the process with way less magnification than I have achieved by naked eye. In a sense, I've done what is thought of as impossible.  That's me, looking into the atomic level. You cannot see the saline teardrop on my eye being used to magnify and see as both sample and magnifier. You can't see the chain of atoms I was trying to count. You can't see the light combining to a point and causing fluorescence of atoms as they ionize, but you can see I am doing it at that moment, and anyone who knows of me here on Quora should know I refuse to deceive or lie. Anyways, they are beautiful to the eye, they are reminiscent of groundbloom flower fireworks. And, thx4a. Laters. ",
            "date": "Answered May 30, 2019",
            "views": "137",
            "upvotes": " Answer requested by Hongyi Shui"
        },
        {
            "author_info": {
                "name": "Virgil Fenn",
                "href": "/profile/Virgil-Fenn"
            },
            "answer_text": "Atomic structure is too small to see, so any statement of what atomic structure looks like is an attempt to visualize what we think we know from other means of observing. There seems to be many levels of structure at scales “close” to the atomic scale, from sub-atomic things like quarks and electrons, to protons and neutrons, to the nuclei of atoms, to the quantum nature of electron energy levels around the nucleus, to the chemical combinations of atoms into molecules. ",
            "date": "Answered November 19, 2017",
            "views": "126",
            "upvotes": "0"
        }
    ]
}