{
    "title": "How can we know ghosts are near us? - Quora",
    "tags": [
        "Ghost Stories",
        "Ghosts",
        "The Paranormal"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sair Jay",
                "href": "/profile/Sair-Jay"
            },
            "answer_text": "Many ways feel, sense, unusual knocks or bangs if they bother you? Simply tell them to leave UNLESS you are in an v old house then I would try to appease them. I lived in a v old house and realised I only ever had trouble if ppl went up into the old servants quarters which there were two of. I started the first night sleeping in a beautiful panelled room. I hastily left it and retreated to a box room when one of the v v v large panels removed itself hung in the air for a moment then crashed to the ground there was the presence of a man who was so tall and solid- as a spectral dark image aka dark do not go there. Also as I stood between the attics one day holding my cat blu… I saw this ball of electricity speeding toward me now I was utilising certain drugs at the time HOWEVER as it neared - this all happened in a matter of seconds btw it seemed much longer - the cat clawed me to buggery trying to get far far away from the ball that I spun and watched go in the attic above the panelled room.. Lived there a year and a half in the boxroom they didn’t bother me and I made sure no one went in the attics despite how much they wanted to! For some reason they chose me to speak to my grans house was haunted by the blacksmith who’s one up one down it once was. The Smithy it was called oddky enough lol The amount of times the brass bed warming pan that hung in the kitchen flew off the wall and hit my gran? Countless!! I could feel him in there but nope was explained awayas an old house blah. When I was 14 we stood gran and I just sadly leaving a beautiful ivy clad cottage a true grandparents house - it was bigger by then but I slept in his room. I used to read stories to him when I was 3 but was asked to read them in my head by my gran - smh- anyway suddenly we hear hobnailed and how would I know that? Boots going across gran and grandads room. I said gran everyone else is outside who is upstairs she said oh that’s just the ghost saying goodbye my face must have been a picture she was a Christian was gran but she had my abilities I just wish I’d been told yes he is here no he doesn’t want to hurt you it’s just he never left- blacksmiths were kept away as it was seen as witchcraft how they forged their metal- he was still waiting for his true love who had been forced to marry someone else. She told him to wait for her I know he is still there. I’d give my right arm to move in there now he and I are old friends he still comes to visit here is here now a very dour but good hearted and broken hearted man Sorry re dissertation answer :D ",
            "date": "Answered January 17, 2019",
            "views": "525",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Priya Chinda",
                    "user_href": "/profile/Priya-Chinda-1"
                },
                {
                    "user_id": "Andrew Dexter",
                    "user_href": "/profile/Andrew-Dexter-1"
                },
                {
                    "user_id": "Joelle Dove",
                    "user_href": "/profile/Joelle-Dove"
                },
                {
                    "user_id": "Celia Thompson",
                    "user_href": "/profile/Celia-Thompson-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Haytam Rayan",
                "href": "/profile/Haytam-Rayan"
            },
            "answer_text": "Haunting is not always clear thing ,I investigated hundreds of cases of people claiming to be possessed it appear that nearly most of it was fake or imaginations or hallucinating, but also we need to understand that some times entities or possession could cause different kind of unknown feelings or even mental disorder, there is just few common possession symptoms known for humans but the most symptoms are still unknown for humans ,it always depends on the kind of the entity ,some demons are stronger than other some are more possessive or weaker than other demons, it also depend on the haunting reasons,but in general i can tell you some of the common known signs,hearing voices,seeing shadows,objects could move,isolation,nightmares or strange dreams like some one following you or attacking you,seeing tall or short dark shadow people,marks or scratches on your body,sudden changes in the room temperature ,unexplained illness or sudden pain,heaviness on the shoulders but by using the right knowledge and the right weapon you can not just get red of the entity but also heal your body and soul, Jinn or Satanic entities can cause humans to believe what they want ,could also cause unreal events or dreams or create unreal reality ,and could play with your brain tricks or cause you to do evil things by controlling your thoughts specially if this entity posses you, beside that we have few kinds of Jinn which it lives among humans and could be sexually motivated or attached to humans emotions can also cause sexual disorder for women and men,if you know the nature of the jinn you would understand why im saying that,the jinn (demon)nature some how is low radiation waves of high or low electromagnetic waves go through objects and bodies and effect brain sells, paranormal experts and spiritual healers or ghost hunters should be very careful ,you could be hurt badly in different ways or get possessed or mental problems,it is long subject and needs a lot of writing and discussions .Jinn or demons could in special circumstances take form of human for his own purposes .But i dont deny that there is also few good kinds of jinn helping humans against the evil ones and could take form of humans and live among humans and even write in Quora :-) . In general Entities (demonic nature) not just can attracted to people with such negative thoughts , mental illness, depression, etc but also they also could be the reason of humans negative thoughts and mental illness. There is no human spirits haunting always it is demonic nature entities. When human is sad or depressed he become more vulnerable to negative dark forces( to access him) he becomes defenseless in front of these entities,the demonic types feed on humans sadness and anger,the human being have some thing called Aura or the spiritual defense system,in severe sad situations or when he suffers from trauma this Aura system get weaker and unstable wich it could lead to demonic attraction,the human in this situation is easy victim,do you know why ,,,, because demonic entities can smell your weakness and feel your spiritual system,demons are more likely need more energy to attack or posses strong and stable human rather than weaker human( feels down and weak) thats why demon usually try to work on your well and your mental power before attacking or haunting you,their is some facts people dont know about these entities for example demonic entities could live long time in your place waiting the right moment to appear or attack it will try to cause troubles , hate , aggression and sadness and then if it succeed the next step will be to engage more and more into the human life activity till it reach to the complete possession or destruction But i never met one real genuine psychic who can explain this situation or could solve it ,it is rare to find real accurate psychic or demonologist ,most pretending to be experts or just beginners without any idea about the spiritual field ,most doing this for money not for any spiritual reason,they will tell you common thing they saw it in some fairy tales stories wich make the possession situation worse ,So you need to depend on your self and get the best advice in such situation from the right experts and not going to the fraud ones. In most cases you cant know if a spirit around you, it depend on the entity . Wp Hr ",
            "date": "Answered November 8, 2018",
            "views": "444",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Darlene Hill",
                    "user_href": "/profile/Darlene-Hill-26"
                }
            ]
        }
    ]
}