{
    "title": "How to keep an above ground pool from growing and collecting algae - Quora",
    "tags": [
        "Swimming Pool Maintenance",
        "Algae"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Lanenga",
                "href": "/profile/Robert-Lanenga"
            },
            "answer_text": "I have had an above ground pool for 43 out of the last 46 years. Here’s what I’ve learned. Stay out of pool stores unless absolutely necessary to buy a replacement part in an emergency. They are there to sell you stuff. For every problem, they have stuff to sell. Every chemical you need for a spotless, crystal clear pool, you can buy from other stores for less money. With one exception. Cyanuric acid, aka, stabilizer. And this can be bought online for less. All you need besides stabilizer is, bleach, baking soda, borax, and soda ash and muriatic acid. Learn the BBB pool system. DO NOT let someone at a pool store test your water. Buy a professional test kit for $50 and learn how to use it. It takes 5 minutes a day. Stay away from sand filters and use Diatomaceous earth. Much better filter media and can be totally backwashed and cleaned. A pool is a closed system. What goes in, stays in. I’m talking about all kinds of nasty stuff that’s on your body. From fecal matter , to sweat, to dead skin, to urine. Plus, all the other organic material the wind blows in and animals bring with them. Once this stuff breaks down, it becomes organic chemicals that no filter will remove. This is the stuff bacteria and algae live on. If not removed, they will buildup and become a giant buffet for bacteria and algae. Every year I pump out 90% of the water and replace with fresh tap water. I add a phosphorus remover because most tap water is loaded with phosphorus and phosphorus is a fertilizer. In fact, that’s how it gets in the drinking water. Runoff from farms. Here is my grandson helping me pump out the old dirty water from last year. Its cleaner than the water most people swim in all year long, and I’m pumping it out. But then, my pool never turns green, gets cloudy, or gives people ear infections.  ",
            "date": "Answered June 15, 2020",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jim Drew",
                "href": "/profile/Jim-Drew-5"
            },
            "answer_text": "I have an in ground pool, but pool chemistry is the same. To keep algae at bay, watch your chemicals, first and foremost. The pool pH must be right for optimum effectiveness of your chlorine. Algae hates chlorine. If you are using dry chlorine, make sure you buy it from a pool store, not a box store. Box store chlorine is higher in Cyanuric Acid (CYA for short). CYA keeps the sun from dissipating the chlorine too quickly. Furthermore, it continues to accumulate. Chlorine tablets need CYA, but these places put too much of it in them. The pool water registers as being chlorinated, but the chlorine ‘s effectiveness is blocked. You can go to the pool store with a sample of your pool water and they will run an analysis on the state of your chemistry. If your CYA is too high (>100 ppm) you will need to drain and refill your pool. Another compound to check is your pool’s phosphorus. Too much will also cause your algae to grow. You can get products like Phosfree to reduce it. Now for what you might be doing (or not doing). Keep leaves and other “biologicals” out of the pool as they decompose and produce phosphorus. Lots of kids and adults with lots of sun block/screen as a result of swimming also bumps up phosphorus levels. ",
            "date": "Updated June 18, 2020",
            "views": "66",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Stephen Kuntz",
                    "user_href": "/profile/Stephen-Kuntz-2"
                }
            ]
        }
    ]
}