{
    "title": "How to prepare 350ml of 70% ethanol in water - Quora",
    "tags": [
        "Ethanol",
        "Organic Chemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ramesh Vk",
                "href": "/profile/Ramesh-Vk-14"
            },
            "answer_text": "Depends on you want to make it very precise or just to use for ordinary purposes. If you want to make it for Laboratory purposes then you need micro pippets and volumetric flasks. Why bcz your volume may not be same as you expected. You want to make 350ml of total solution(v/v). 350x0.70=245 ml Ethanol required. Pure ethanol has a lower density than water, 0.789 g/mL at 25 deg as opposed to 1.000 g/mL for pure water. The density of an ethano solution in water will have a density lower than water. The exact density depends on the ratio of ethanol to water. If you take 99% ethanol, 245/(0.99x0.789)=313.65ml. Pippet out this quantity of ethanol into 500ml beaker. 350--313.65=36.35 ml distilled water pippet out and add it to beaker of ethanol. This will give you 70% alcohol solution.(V/V). Here we are fixing final volume 350mml and 70% of pure alcohol in the 350ml solution. ",
            "date": "Answered April 8, 2020",
            "views": "12",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Gurarmaan Singh",
                    "user_href": "/profile/Gurarmaan-Singh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Veerasamy Natarajan",
                "href": "/profile/Veerasamy-Natarajan"
            },
            "answer_text": "How can you prepare 350ml of 70% ethanol in water? You can prepare in two ways. One is weight by weight and other is volume by volume. In the first method weigh 245 grams of ethanol and add 105 grams of water. This is weight based. In the second method, add 245 ml of ethanol and 105 ml of distilled water. This is volume based. This way you can prepare 350 ml of 70% ethanol. ",
            "date": "Answered October 19, 2018",
            "views": "32",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Malcolm Sargeant",
                    "user_href": "/profile/Malcolm-Sargeant"
                },
                {
                    "user_id": "Hitesh Rana",
                    "user_href": "/profile/Hitesh-Rana-112"
                },
                {
                    "user_id": "Albert Joseph Hagemyer",
                    "user_href": "/profile/Albert-Joseph-Hagemyer"
                },
                {
                    "user_id": "Peter Dello Buono",
                    "user_href": "/profile/Peter-Dello-Buono"
                }
            ]
        }
    ]
}