{
    "title": "How can a camera catch a ghost? - Quora",
    "tags": [
        "Ghosts",
        "The Paranormal",
        "Supernatural Phenomena"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jim Jordan",
                "href": "/profile/Jim-Jordan-77"
            },
            "answer_text": "There have long been debates on this topic. It’s actually the film (or CCD now) that “sees” an apparition so if the medium (no pun intended) is sensitive to a particular wavelength like infrared or ultraviolet (above and below visible light wavelengths) it could capture it, so the theory goes. Visible light makes up only a small part of the electromagnetic spectrum. Electromagnetic waves with shorter wavelengths and higher frequencies include ultraviolet light, X-rays, and gamma rays. Electromagnetic waves with longer wavelengths and lower frequencies include infrared light, microwaves, and radio and television waves. It is believe by some that ghost energies occupy the non-visible wavelengths of the electromagnetic spectrum and can only be seen or detected with equipment sensitive to those regions.  Other theories include a belief that atmospheric conditions such as high humidity or storm-induced electrical energy might “interact” with a ghosts energy allowing people and equipment to see it. A common theory for a recurring ghost sighting such as a haunting is that the environment around us is always charged with energy, and that an event such as a violent death, or continued presence (like a nun walking the same path for decades) can exert large amounts of energy into the surrounding environment like you can record an image onto videotape or audio on a cassette (yeah, a dated reference I know). Since energy cannot be created or destroyed, it passes into the environment when we die and imprints itself to stay.  For the most part, I don’t believe in such things, although I did record voices in a cemetery in 1981 that to this day I cannot explain and I have training in audio and photographic forensics. One would think that with over 5 billion camera phones, billions of digital cameras and CCTV in the world, someone would have captured an image of a ghost that is irrefutable, and not some grainy blurred images easily disproven as a natural event or simple pareidolia! ",
            "date": "Answered February 8, 2020",
            "views": "118",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Martin Miller",
                "href": "/profile/Martin-Miller-103"
            },
            "answer_text": "Because a camera is not a human eye. I don’t really know how it works, but I know it has something to do with the curvature of the human eye and the fact that humans aren’t usually trained to see ethereal energies (“the naked eye”). Some people have claimed to be able to see “something out of the corner of their eye” in association to ghosts and hauntings. The people of this planet are typically trained to see and deal with physical matter. A camera doesn’t care what it sees and it won’t erase it for you. Your brain might be able to block out ghosts because it hasn’t been trained to see OR believe in them, and when a camera captures a ghost, that’s HARD physical evidence that your brain cannot ignore. That’s my theory about it. ",
            "date": "Answered October 3, 2019",
            "views": "99",
            "upvotes": "0"
        }
    ]
}