{
    "title": "How to determine the corresponding force of potential energy - Quora",
    "tags": [
        "Potential Energy",
        "Force (physics)",
        "Energy (physics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kenny Stephens",
                "href": "/profile/Kenny-Stephens-1"
            },
            "answer_text": "If the potential energy is one-dimensional, [math]U= U(x)[/math] for example, then the corresponding force is [math]F_x = -\\dfrac{dU}{dx}\\ , .[/math] This states that the force in the [math]x[/math] direction (that’s what the subscript on [math]F[/math] represents) is the negative derivative of the potential energy with respect to [math]x[/math]. Notice that the variable with respect to the which the derivative is taken indicates the component of the force (more on this below). In case you are unfamiliar with the derivative, we could also write the force more verbosely as [math]F_x = -\\frac{ U(x+dx) - U(x) }{ dx } \\quad\\text{as }dx\\text{ gets really close to }0 .[/math] So you see that the derivative effectively finds the slope of the potential energy. If the potential energy is multi-dimensional, let’s say three, [math]U= U(\\vec{r})[/math], then the correspond force is [math]\\vec{F} = -\\vec{\\nabla}U(\\vec{r}).[/math] Here, [math]\\vec{\\nabla}[/math] represents the gradient, which in Cartesian coordinates is [math]\\vec{\\nabla} = \\hat{\\bf x}\\dfrac{\\partial}{\\partial x} + \\hat{\\bf y}\\dfrac{\\partial}{\\partial y} + \\hat{\\bf z}\\dfrac{\\partial}{\\partial z} \\, .[/math] In this expression, the quantity [math]\\hat{\\bf x}[/math] represents the vector that points in the [math]+x[/math] direction and has a magnitude of one (called a unit vector). As I said above, notice that the variable used for the derivative indicates which component of the force is calculated. After seeing the answer expressed in terms of the math, let’s examine the answer from a more conceptual side. Consider stretching a spring. We attach one end of the spring to a rigid wall so that the end does not move. At the other end of the spring we attach a block which can slide frictionlessly along a level surface. The figure shows the potential energy curve for such a scenario (the shape of the curve is a parabola). I shaded difference regions of the graph based on the slope of the potential energy: green has a negative slope, yellow has a zero slope, and red has a positive slope.  If the spring is unstretched then we know the force on the block from the spring is zero. At [math]x=0[/math] we can see that the slope of the potential energy is zero (the yellow region). Since the slope is zero, then the negative slope is also zero and the force should be zero. So far, so good. Now pull the block to the right (toward positive [math]x[/math], into the red region) by stretching the spring. The potential energy curve rises, i.e., it has a positive slope for positive [math]x[/math]. We know that the force on the block from the spring will be toward negative [math]x[/math]. This is consistent with our earlier mathematical definition: a positive slope implies a negatively-directed force. Pushing the block to the left (toward negative [math]x[/math], into the green region) compresses the spring. In this region the potential energy has a negative slope. But the compressed spring exerts a force on the block toward the right (toward positive [math]x[/math]). This is also consistent with the formula: a negative slope implies a positively-directed force. If the problem involves a three-dimensional potential energy, we would repeat the above arguments for each direction: once for [math]x[/math], once for [math]y[/math], and once for [math]z[/math]. Then the force would have components in each direction. I hope this helps you understand how we determine the force by knowing the potential energy. ",
            "date": "Answered March 13, 2020",
            "views": "113",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Wrixon EurIng",
                "href": "/profile/David-Wrixon-EurIng"
            },
            "answer_text": "The Force from Potential Energy is effective negative pressure that holds Space apart. ",
            "date": "Answered February 17, 2020",
            "views": "42",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sabuy Jai",
                    "user_href": "/profile/Sabuy-Jai"
                }
            ]
        }
    ]
}