{
    "title": "How do we know whether an object is in motion? - Quora",
    "tags": [
        "Motion (physics)",
        "Classical Mechanics",
        "Special Relativity",
        "Relativity (physics)",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Riadh Al Rabeh",
                "href": "/profile/Riadh-Al-Rabeh"
            },
            "answer_text": "I do not subscribe to the idea that there is no absolute motion. It is no good assuming that only you and one object exist in space.. it is not true. If we stick to what is real, then there are plenty of objects in space. The center of mass of  'all' the universe never moves (according to conservation of momentum). Therefore, one can in principle determine if he is static or in motion (at constant speed) by simply observing the distance to other objects or to the universe center of mass. This has been used since antiquity by observing the distant stars etc. It is still being used now heavily most institutions. Relative motion is another thing. It is the time derivative of the relative distance between two objects. Being a difference, it is a free vector and can be moved freely from one place to the other if we so wish, and if we keep the displacement a parallel one. Relative motion (by definition) does not depend on which object is moving, but only on the change in the distance between the two. Two rockets moving parallel to each other at very high speed have zero relative velocity. But each of them have the same large absolute velocity with respect to the 'world'. The next thing is moving with acceleration. That is the second derivative of distance with respect to time, or changing the first derivative- the velocity. Constant velocity does not need a pushing force to keep it going. But acceleration happens only if the object is pushed to change its velocity. How it is pushed. In space this is done by firing another mass backward, so you are accelerated forward. If you are in space moving at a fixed velocity, you can increase, decrease, or change the direction of motion as well by directing your gun backward or froward or sideways. Before shooting you are going at a constant speed. After shooting you will go into a new constant speed. The relative speed between you and the bullet is zero before. After shooting you observe the distance between you and the bullet increasing indicating that you have now acquired a new velocity. From either this or the force of reaction, you can tell you have changed your relative speed with respect to the bullet. If you know your original absolute velocity and the new relative velocity w.r.t the bullet, you can find your new absolute velocity without having to look out of the window again to observe distant objects. This is most probably how a space ship knows its way in space without having to check continuously with the outside. Of course there is an 'instrument' limit for using this method and an occasional look from the window is needed to do the long term correction. ",
            "date": "Answered November 13, 2015",
            "views": "49",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Barak Shoshany",
                "href": "/profile/Barak-Shoshany"
            },
            "answer_text": "I assume your question is about everyday objects, and not atoms or subatomic particles, so I will ignore quantum mechanics which will make the answer much more complicated... Your question can be divided into two parts: how do we define motion conceptually and how do we detect motion experimentally. Experimentally, it's very easy. Stay still while looking at the object. Does it move? If so, then it is in motion! If the object is very small and/or moves very slowly, so you cannot detect its movement with the naked eye. set up an experiment where you measure its distance from a fixed point. Does that distance change? Then the object is in motion! Conceptually, it's a little more complicated. Consider a universe which is completely empty except for you and the object in question. When you see the object move, or measure that its distance from you has changed, does it mean that the object is in motion, or maybe the object is still and you are in motion? Here, the theory of (special) relativity help clear things up. Its first postulate basically says that any (non-accelerating) frame of reference is as good as any other. So motion is always relative: there is no notion of absolute motion, we can only define motion of one object relative to another object. ",
            "date": "Answered March 23, 2014",
            "views": "124",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richard Cumayas",
                    "user_href": "/profile/Richard-Cumayas"
                },
                {
                    "user_id": "Tyler Mackenzie",
                    "user_href": "/profile/Tyler-Mackenzie"
                },
                {
                    "user_id": "Aalay Kapadia",
                    "user_href": "/profile/Aalay-Kapadia"
                },
                {
                    "user_id": "Anders Erik Bjergvang",
                    "user_href": "/profile/Anders-Erik-Bjergvang"
                },
                {
                    "user_id": "Sudipta Roy",
                    "user_href": "/profile/Sudipta-Roy-1"
                },
                {
                    "user_id": "Edward Claro Mader",
                    "user_href": "/profile/Edward-Claro-Mader"
                },
                {
                    "user_id": "Umang Dattani",
                    "user_href": "/profile/Umang-Dattani"
                }
            ]
        }
    ]
}