{
    "title": "How does a prism separate white light into seven colors? - Quora",
    "tags": [
        "White Light",
        "Prisms",
        "White (color)",
        "Electromagnetic Spectrum",
        "Color Theory",
        "Colors (vision)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Laurie Keller",
                "href": "/profile/Laurie-Keller-14"
            },
            "answer_text": "Light changes speed as it moves from one medium to another (for example, from a vacuum into the glass of the prism or from the air into water droplets in rain). It’s why, when you look at something partially under water, it appears “broken”. This speed change causes the light to change the direction of the path of the beam of light, that is, bend it (called refraction) and to enter the new medium at a different angle. The degree of bending of the light's path depends on the angle that the incoming beam of light makes with the surface, and on the ratio between the refractive indices (numbers that describe how fast light travels through the material) of the two media, that is, usually, through air and glass.  Light: Reflection and Refraction The refractive index of many materials (such as glass) varies with the wavelength or colour of the light used. “White light” (e.g. sunlight) actually consists of light with a mixture of frequencies. This causes light of different colours to be refracted differently and to leave the prism at different angles, creating an effect similar to a rainbow. A prism can be used to separate a beam of white light into its constituent spectrum of colors, and is the principle behind the formation of rainbows where sunlight strikes water droplets in rain.  Introduction to Optical Prisms | Edmund Optics ",
            "date": "Answered December 23, 2019",
            "views": "191",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nathan D'Souza",
                    "user_href": "/profile/Nathan-DSouza-29"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Myers",
                "href": "/profile/Bob-Myers-5"
            },
            "answer_text": "It doesn’t - it separates “white” light into all of the wavelengths that were originally contained in that light. That there are only seven distinct colors is merely a convention that goes back to the days of Sir Isaac Newton. In fact, a human being with normal vision should be able to distinguish far more colors within that range. HOW the prism does this, though, is simply due to the fact that the index of refraction of glass, which is related to the speed of light through a given medium, varies with wavelength. The shorter, higher-energy wavelengths at the blue end of the spectrum are refracted or “bent” more than the longer-wavelengths (the “red” end of the spectrum”) and so what was original seen as just a beam of white light is spread out into its constituent wavelengths:  ",
            "date": "Answered December 23, 2019",
            "views": "93",
            "upvotes": "0"
        }
    ]
}