{
    "title": "How do factors such as temperature pH and concentration of enzyme or substrate affect the rate of enzyme catalyzed reactions? - Quora",
    "tags": [
        "Enzymology",
        "Enzymes",
        "Biochemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matthew McCullough",
                "href": "/profile/Matthew-McCullough-14"
            },
            "answer_text": "Ok let's get started. I guess the start point of this is to understand how enzymes do their thing. Think of them as little machines on a factory floor. Our reactants (Also called substrates) enter the machine at the active sites, the enzyme does it's thing, and the product leaves. Temperature affects how much energy our reactant have (Think of speeding up the conveyor belt of reactants). Temperature goes up, rate increases, right up to a point where the enzyme, being a protein, starts breaking certain hydrogen bonds that hold its shape together, rendering it nonfunctional. For pH, each enzyme has its own preferred pH. Pepsin in the stomach loves acidic conditions while the lipases, amylases and proteases in the small intestine prefers slightly basic. There's a pretty sharp drop in rate either side of the optimum. Which brings us to the two concentration levels and the reason for the factory analogy. Say you have ten coin stamped machines where blanks (reactants) come in and stamped coins come out (product). Increasing the number of blanks will increase the daily output with diminishing returns as the machines get closer to full capacity where it levels off. Increasing the substrate has a big effect at low concentrations that curves towards horizontal as the concentration levels increase. Now consider what happens if we add more machines. More coins can be stamped at a time. More enzyme, more active sites to fill, more product at once. This is pretty much a linear relationship between enzyme concentration and reaction rate. Hope this helps. Sorry bout the lack of pics I'm in bed. ",
            "date": "Answered September 1, 2019",
            "views": "47",
            "upvotes": "0"
        }
    ]
}