{
    "title": "How did the first elementary particles formed throughout the universe? - The Science Space - Quora",
    "tags": [
        "Early Universe Cosmology",
        "Elementary Particles",
        "Particles",
        "Theoretical Physics",
        "Particle Physics",
        "The Universe",
        "Cosmology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vincent Hsu",
                "href": "/profile/Vincent-Hsu-22"
            },
            "answer_text": "The first particles may have been created during the Planck Epoch, the first period in the universe. In the Planck Epoch, quantum gravity dominated the universe through gravitons[1]over the other three fundamental forces. In the following Grand Unification Epoch and Inflationary Epoch, TOE breaks down. Gravity separates from the other forces first[2], then the strong force from the electroweak force[3]. The inflationary period may have also had a scalar field, the inflaton field. There is no proof that it exists yet, but we are sure that inflation did occur. During the Inflationary Epoch, gluons existed, along with the photons and the massless W+/- and Z vector bosons. In the Quark Epoch, the W+/- and Z bosons gained mass in spontaneous symmetry breaking[4], at the same time as quark-gluon plasma exists. The Higgs field drops in potential energy which creates mass for the particles[5][6][7]. Finally, we reach the Hadron Epoch, where the quark-gluon plasma becomes hadrons[8][9], two of which we recognize: the proton and the neutron. Nucleosynthesis is when atomic nuclei form from protons and neutrons, mostly in the form of hydrogen, hydrogen isotopes, and helium[10][11][12][13]. It is at Recombination when electrons join with atomic nuclei to form atoms, and this is when the cosmic microwave background came from[14]. The rest of the universe’s larger structures come after this time. Sources: Evolution of the Universe through the Planck epochCosmic Evolution - Epoch 1 - Particle EvolutionGrand Unified Models and CosmologyAn Introduction to Spontaneous Symmetry BreakingBroken Symmetry and the Mass of Gauge Vector MesonsBroken Symmetries and the Masses of Gauge BosonsGlobal Conservation Laws and Massless ParticlesPhysical processes in the universe at the epoch of the quark-hadron transitionQuark-hadron phase transition in the early Universe: Isothermal baryon-number fluctuations and primordial nucleosynthesisBig-Bang Nucleosynthesis RevisitedBig-Bang Nucleosynthesis RevisitedPrimordial Nucleosynthesis ReduxPrimordial Nucleosynthesis: Theory and ObservationsPlanck and the cosmic microwave backgroundFootnotes[1] http://prints.iiap.res.in/bitstream/2248/4044/1/Evolution%20of%20the%20Universe%20through%20the%20Planck%20epoch[2] Cosmic Evolution - Epoch 1 - Particle Evolution[3] https://arxiv.org/pdf/hep-ph/0604270.pdf[4] https://arxiv.org/pdf/1909.01820.pdf[5] https://journals.aps.org/prl/pdf/10.1103/PhysRevLett.13.321[6] https://journals.aps.org/prl/pdf/10.1103/PhysRevLett.13.508[7] https://journals.aps.org/prl/pdf/10.1103/PhysRevLett.13.585[8] 1984ApJ...282..370B Page 370[9] https://escholarship.org/content/qt9qb0f33k/qt9qb0f33k.pdf[10] http://Physical processes in the universe at the epoch of the quark-hadron transition Quark-hadron phase transition in the early Universe: Isothermal baryon-number fluctuations and primordial nucleosynthesis[11] https://ntrs.nasa.gov/archive/nasa/casi.ntrs.nasa.gov/19900013110.pdf[12] 1991ApJ...376...51W Page 51[13] https://arxiv.org/pdf/astro-ph/9905320.pdf[14] Planck and the cosmic microwave background",
            "date": "July 17, 2020",
            "views": "50",
            "upvotes": " ",
            "upvoters": [
                {
                    "user_id": "Madison Montgomery",
                    "user_href": "/profile/Madison-Montgomery-39"
                },
                {
                    "user_id": "Petar Bobanović",
                    "user_href": "/profile/Petar-Bobanović"
                },
                {
                    "user_id": "Lærke Nørgaard",
                    "user_href": "/profile/Lærke-Nørgaard"
                },
                {
                    "user_id": "Yukio González",
                    "user_href": "/profile/Yukio-González"
                },
                {
                    "user_id": "Nick Nuzzo",
                    "user_href": "/profile/Nick-Nuzzo-1"
                },
                {
                    "user_id": "Dux Oakende",
                    "user_href": "/profile/Dux-Oakende"
                },
                {
                    "user_id": "Douglas Hazelrigg",
                    "user_href": "/profile/Douglas-Hazelrigg"
                },
                {
                    "user_id": "Lawal Quadril",
                    "user_href": "/profile/Lawal-Quadril-1"
                },
                {
                    "user_id": "John Anderson",
                    "user_href": "/profile/John-Anderson-682"
                },
                {
                    "user_id": "Joe O’Connell",
                    "user_href": "/profile/Joe-O-Connell-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher Johnson",
                "href": "/profile/Christopher-Johnson-604"
            },
            "answer_text": "The first elementary particles are thought by scientists to have been created in the first three minutes after the beginning of the Big Bang via Big Bang nucleosynthesis. Here is the Wikipedia article on the subject: Big Bang nucleosynthesis - Wikipedia Since other answers claim energy was converted into matter, I will address this, as it leads to the misconception that matter is made of energy. In reality, nothing is made of energy, as energy in physics is defined as ‘the capacity to do work’, and nothing is made of its own capacity to do work. Energy is not a substance or material, that matter could be made of it. Matter is made of quantum field ‘stuff’ that has energy, and that is a substance akin to a fluid. One can think of a particle of matter as an energetic excitation in a quantum field. Matter has energy in the form of mass energy (e=mc2), and that energy can be released to do other kinds of work, such as powering a nuclear power plant. Here is an article explaining the difference between matter and energy: Matter and Energy: A False Dichotomy ",
            "date": "April 23, 2020",
            "views": "841",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aditya Cherukuri",
                    "user_href": "/profile/Aditya-Cherukuri-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Milan Woodson",
                "href": "/profile/Milan-Woodson"
            },
            "answer_text": "The first elemental particles were formed from the energy that formed as the cosmos itself. Once it became less hot enough energy condensed in various pockets throughout various dense regions of space. Eventually, compound particles formed into hypermassive hydrogen molecular clouds that filled space and then clumped together ",
            "date": "April 22, 2020",
            "views": "238",
            "upvotes": " View 1 Upvoter "
        }
    ]
}