{
    "title": "How is management both an art and a science? - Quora",
    "tags": [
        "Modern Art",
        "The Arts",
        "Management"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Kitson",
                "href": "/profile/David-Kitson-1"
            },
            "answer_text": "I don’t think management is a science and an art at all - in fact, the sort of person who would usually come up with such an idea is probably a manager, and typically, has exercised neither science nor art in the conclusion. However, if you need to decide which category it fits into, consider the difference - An art is subjective, while science is objective. Management actually achieves neither. It’s not objective, because there isn’t a set of rules that define how to manage people successfully. Sure, you can learn the rules of what is required, or how to make reports, or what to do in certain situations, but following these rules does not guarantee a successful outcome. Alternately, it’s not subjective, because the outcome is measured - and it’s measured against figures, achievements ( KPIs ) or some other criteria, that can actually be defined, yet all the skill in the world doesn’t necessarily delivery the outcome - you can be considered, subjectively, a great manager but if you can’t produce results above a numerical threshold, you’re not going to keep your job. As a result, management is one of those interesting ideas that is often poorly executed, leading to failed results and businesses collapse for no other reason than poor management, even when they have no competition. So while management exhibits both aspects of objectivity and subjectivity, it does not conform with the requirements of either a science or an art. To attempt to then classify it as both would be like mixing flour, sugar and  hot water into a slurry and serving it in a cup - and declaring it as both a cake and a drink. Sure, it has aspects of both, yet it lacks specific requirements to categorically fall into either. Management is like that - there’s no necessity to define it as an art or a science - and perhaps that is where is should stay - and it’s not as though it’s not needed. Good managers can save a bad company. Excellent management will drive profits and achieve outcomes. But still there is no precise formula or methodology that holds at any one time over another. So what is it then? I believe that management is a skill. I am a scientist, and have been a manager many times, yet still I don’t have the skill necessary. Sure, I can achieve my outcomes, staff are happy with me and so are my senior managers. But I don’t have the skill and I don’t have the drive and so I am a mediocre manager at best. Interestingly, one of my sons does have it and is an exceptional manager - The sort capable of taking on basket-case projects wherever he works and turning them around. He doesn’t even have to like what he’s doing - I’ve seen him walk into shops to get them ready to shut down, and turn them into the most profitable locations in a chain. I can’t do that. That’s not my ability. I think this is where management truly lies.  In this third quadrant, that is neither art nor science. And if you look for it, you will find that, indeed, skills are considered separate to both arts and sciences. And there are some incredibly skillful managers I’ve met over the years who can achieve the impossible. ",
            "date": "Answered October 23, 2016",
            "views": "18",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elizabeth Acquah",
                    "user_href": "/profile/Elizabeth-Acquah-10"
                },
                {
                    "user_id": "John McGlade",
                    "user_href": "/profile/John-McGlade-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akshada Chavan",
                "href": "/profile/Akshada-Chavan-16"
            },
            "answer_text": "Business Lesson: How management is both art and science?  Much of the controversy of management being art or science is based on a description of the fact that the earlier leaders of industry used intuition, hunches, commonsense, and experience in managing organizations. They were not well educated, they were not trained professional managers, but they managed their businesses brilliantly. However, commonsense and science differ considerably in solving the problems. Examples are Dhirubhai Ambani, Jamsetji Nusserwanji Tata and G.D.Birla…the list is big. In 1919, Ghanshyamdas Birla was in no better position. He had fought hard with his family and the colonial establishment to start a jute mill. World War I broke out before he could place orders for his machinery. He had based his projections on Rs 6,000 per loom. The price shot up to Rs 16,000. He went ahead. In 1950, aged 17, Dhirajlal Hirachand Ambani sailed in a steerage class of ship to Aden to search for a job. For the next eight years, he sweated it out. Later in his life, without a single educational degree he created an empire called Reliance Industries. Management is Science because of several reasons like – it has universally accepted principles, it has cause and effect relationship etc, and at the same time it is art because it requires perfection through practice, practical knowledge, creativity, personal skills etc. Management is both an art and a science. Artistic application of management know-how is a must for solving complex situations in organizations. It is understood that managing is doing things artistically in the light of the realities of a situation. Human skills cannot stand alone; they need to be aligned with conceptual skills and technical skills. Therefore, theoretical knowledge of management is not adequate or relevant for solving the problems… more ",
            "date": "Answered February 3, 2020",
            "views": "227",
            "upvotes": "0"
        }
    ]
}