{
    "title": "How did the snake in the Bible 'talk' to Eve? - Quora",
    "tags": [
        "Adam and Eve (biblical figures)",
        "God and the Christian Bible",
        "Biblical Figures",
        "Bible Study",
        "Snakes",
        "The Bible",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Coomber",
                "href": "/profile/Paul-Coomber-3"
            },
            "answer_text": "That is an interesting question. The best answer I have yet come across is the following copy/paste:- “*** w01 11/15 p. 27 Questions From Readers *** Questions From Readers How did the serpent in the garden of Eden convey to Eve the idea to break God’s law regarding the tree of the knowledge of good and bad? Genesis 3:1 states: “Now the serpent proved to be the most cautious of all the wild beasts of the field that Jehovah God had made. So it began to say to the woman: ‘Is it really so that God said you must not eat from every tree of the garden?’” There have been various suggestions as to how the serpent might have communicated with Eve. One idea is that it did so through body language or gestures. For example, English cleric Joseph Benson commented: “It seems most likely that it was by signs of some kind. Some, indeed, have supposed that reason and speech were then the known properties of serpents, . . . but of this there is no proof.” By using mere body language, however, how could the serpent communicate to Eve the idea that by partaking of the forbidden fruit she would become like God, able to decide what was good and what was bad? Furthermore, Eve participated in the conversation, answering the question raised by the serpent. (Genesis 3:2-5) The view that the serpent communicated only with signs or movements would lead to the conclusion that Eve replied by using gestures, whereas the Bible says that she spoke. Referring to this incident, the apostle Paul warned fellow Christians: “I am afraid that somehow, as the serpent seduced Eve by its cunning, your minds might be corrupted.” The danger Paul spoke of came from “false apostles, deceitful workers.” The threat that such “superfine apostles” presented was not confined to body language and gestures. It included their speech—their cunning words, spoken to mislead others.—2 Corinthians 11:3-5, 13. Although speech was used to misguide Eve in the garden of Eden, there is nothing to suggest that the literal serpent had vocal cords. It actually did not need them. When God’s angel spoke to Balaam through a she-ass, the animal did not need a complex voice box similar to that of a human. (Numbers 22:26-31) Obviously, when this ‘voiceless beast of burden made utterance with the voice of a man,’ the power for the action came from the spirit realm.—2 Peter 2:16. The spirit creature behind the serpent that spoke to Eve is identified in the Bible as “the original serpent, the one called Devil and Satan.” (Revelation 12:9) The audible words that Eve heard and responded to came at the instigation of Satan, who “keeps transforming himself into an angel of light.”—2 Corinthians 11:14.” ",
            "date": "Answered April 29, 2019",
            "views": "17",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lola Simone",
                    "user_href": "/profile/Lola-Simone-11"
                },
                {
                    "user_id": "Jo Thomas",
                    "user_href": "/profile/Jo-Thomas-104"
                },
                {
                    "user_id": "Mark Genn",
                    "user_href": "/profile/Mark-Genn-1"
                },
                {
                    "user_id": "Gunter Piontek",
                    "user_href": "/profile/Gunter-Piontek-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sabri Shahin",
                "href": "/profile/Sabri-Shahin"
            },
            "answer_text": "Question: How did the snake in the Bible \"talk\" to Eve? The scribes wanted to tell interesting stories so they mentioned talking snake and talking donkey Many verses cannot be divinely inspired because they are contradicting the basic wisdom taught by Jesus and by the prophets. It is not an accepted proof to refer to 2 Timothy 3:16 to claim that “All Scripture is inspired by God” That claim was written by Paul to add some credibility to his letters after the disciples denied him and deserted him. Other reason to reject the claim of Paul in 2 Timothy 3:16 is that the letters of Paul were written before Mark, Matthew, Luke, John and revelation; we cannot say “the book of Revelation is inspired by God because Paul said so”. We cannot say “the bible is inspired by God because the bible said so”; that is not a logically accepted argument and is a clear ‘Circular reasoning’. Prophets did not teach that God has preserved the holy book; they have advised that there will be changes and have been warned of such additions and deletions. Amos 8:11-12 teach that People will be thirsty for the true word of God but they will not find it anywhere Psalm 56:5 teaches All day long they twist my words Jeremiah 8:8 teaches the lying pen of the scribes has distorted the word of God Jeremiah 5:30-31 teach that the priests have distorted the religion teachings and that the people love those distorted teachings Instead of the true teaching ‘You shall not murder ‘in Exodus 20:13 and Deuteronomy 5:17 The scribes who glorify defeating their enemies ignored the true teaching and added some verses to justify the killing like Exodus 23:23, Numbers 31:16-18, Joshua 6:20-21, Judges 15:14-16 and Judges 16:30 Instead of ‘Nation shall not lift up sword against nation, neither shall they learn war any more’ in Isaiah 2:4, they have justified atrocities. Instead of the true and most consistent teachings of ‘blessings for obedience and curses for disobedience’ in Leviticus 26, Deuteronomy 28, Deuteronomy 11:26-28, Deuteronomy 4:40, Deuteronomy 6:24-25, Deuteronomy 7:12-15, and Deuteronomy 8, they teach that God has chosen them regardless of their obedience as in the distorted teachings of Deuteronomy 9:5-6 and Deuteronomy 7:6-8 Instead of the true and strict teachings of Jesus in Matthew 7:21-27, Luke 13:25-27, Matthew 22:35-40, Luke 10:25-28, Matthew 25:35-45, Mark 12:28-34, Mark 10:17-19, Matthew 19:16-19, Luke 18:18-20, Luke 6:46-48, John 14:15 and John 14:21 most Christian scholars teach the distorted and attractive teachings like Romans 8:30, 1 Thessalonians 5:9, Ephesians 2:5, Ephesians 2:8-9, Romans 3:28, Galatians 2:16, Colossians 2:14 and Ephesians 1:4 When Jacob’s descendants wanted to glorify him, they claimed that he wrestled with God and was saved. The verses in Genesis 32:24-30 teach that Jacob was able to wrestle with God; he said to God \"I will not let you go unless you bless me” Although the true teachings of Deuteronomy 10:17 teach that God does not favor ‘who shows no partiality’, the descendants of Jacob wanted to glorify him in the name of God; they added the distorted teaching of Genesis 25:23 and Malachi 1:2-3 “Jacob I loved, but Esau I hated” They wanted to say that it is the will of God to choose them regardless of any condition like good work and true faith. That distorted teaching is against the true teachings of Moses that God chooses the righteous who obey and curse the wicked as the core and the most consistent teachings of Exodus 19:5, Leviticus 18:4-5, Leviticus 26, Deuteronomy 11:18-20, 11:26-28 , Deuteronomy 28, Deuteronomy 30:15-16 , and Deuteronomy 30:19, Deuteronomy 32:46-47 Deuteronomy 30:11-14 teach that obedience is possible; the verses have been copied into Romans 10:5-9 in order to change the salvation by obedience into the salvation by faith alone Some teachers teach that obedience is not possible; they do not teach Deuteronomy 30:11-14 anymore; they teach the distorted teachings which teach that obedience is not possible like Romans 7:14-25, Romans 10:5-9 and Galatians 3:10 The original verses of Deuteronomy 30:11-14 are: Now what I am commanding you today is not too difficult for you or beyond your reach. It is not up in heaven, so that you have to ask, “Who will ascend into heaven to get it and proclaim it to us so we may obey it?” Nor is it beyond the sea, so that you have to ask, “Who will cross the sea to get it and proclaim it to us so we may obey it?” No, the word is very near you; it is in your mouth and in your heart so you may obey it The distorted verses of Romans 10:5-9 are: Moses writes that the man who practices the righteousness which is based on the law shall live by it. But the righteousness based on faith says, \"Do not say in your heart, Who will ascend into heaven?\" (that is, to bring Christ down) or \"Who will descend in the abyss?\" (that is, to bring Christ up from the dead). But what does it say? The word is near you, on your lips and in your heart (that is, the word of faith which we preach); because if you confess with your lips that Jesus is Lord and believe in your heart that God raised him from the dead, you will be saved The reason of the change is to shift the faith foundations from obedience, repentance, and good deeds into claims of faith without good works or obedience to God’s law Romans 7:19 teaches For what I do is not the good I want to do; no, the evil I do not want to do--this I keep on doing James has corrected that misunderstanding in James 4:17 If anyone, then, knows the good they ought to do and doesn't do it, it is sin for him Instead of the true and most consistent teachings of ‘blessings for obedience and curses for disobedience’ in Deuteronomy 28, Leviticus 18:4-5, Deuteronomy 11:18-20, 11:26-28 , Deuteronomy 32:46-47, Deuteronomy 30:15-16 , and Deuteronomy 30:19, some teachers teach that God chooses people regardless of their obedience as in the distorted teachings of Deuteronomy 9:5-6 and Deuteronomy 7:6, Malachi 1:2, Romans 9:13 When the scribes wanted to support the doctrine of Atonement they have added verses like Matthew 18:11 For the Son of Man has come to save that which was lost The bible footnotes explain that verse Matthew 18:11 was not in the original old scriptures Hebrews 9:22 “without the shedding of blood there is no forgiveness” is a misunderstanding of verse Leviticus 17:11 which is not about atonement but is about dietary laws. God has clarified that blood in meat is not good for health; that clarification was necessary to the people who did not have advanced medical tools to know that eating the meat with the blood still in it is bad for health The true word of God is not what is written by the unknown writer of Hebrews; it is what has been taught by Moses, Jesus and the Prophets who taught the forgiveness is possible by obedience, repentance, and prayers Proverbs 16:6 teaches that “In mercy and truth atonement is provided for iniquity.” Psalm 69:30-31 teaches that praise worship is better than sacrifice 2 Chronicles 7:14 teaches that forgiveness is obtainable without a blood sacrifice ‘If my people who are called by my name will humble themselves, and pray and seek my face, and turn from their wicked ways, then I will hear from heaven and will forgive their sin’ Jonah 3 teaches that people are forgiven when they repented and fasted, without offering any sacrifice and without shedding any blood Proverbs 17:15 states: ‘He who justifies the wicked, and he who condemns the righteous, both of them alike are an abomination unto God’ That should be considered as a warning to the teachers who promise free salvation to the sinners and who teach that the innocent has been punished on behalf of the sinners Jesus taught the parable of The Prodigal Son in Luke 15:11-32 to highlight the importance of obedience and repentance as the main prerequisites for salvation That is the core Christianity teaching as taught in Matthew 7:21 Not every one that said to me, Lord, Lord, shall enter into the kingdom of heaven; but he that does the will of my Father which is in heaven Jesus has confirmed the teachings of the Old Testimony ‘in repentance and obedience is your salvation’ as taught in Isaiah 30:15 In Matthew 25:31-45 Jesus described the final judgment as being based on good works; he clarified that those who obey the law will be saved Salvation is not based solely on belief and nothing else; salvation is not granted to those who merely profess acceptance of Jesus without performing kind or compassionate deeds Jesus did not teach that a man is justified by faith without the deeds of the law; In Matthew 16:27 and John 5:29, Jesus has confirmed that God will reward each person according to his deeds; those are the basic teachings of the old testimony like the verses taught in Psalm 62:12, Ecclesiastes 12:14, and many other old testimony verses In Luke 13:3 and 13:5, Jesus taught that repentance is necessary for salvation But unless you repent, you too will all perish Mark 12:33 teaches: And to love one’s neighbor as himself, is much more than all burnt offerings and sacrifices What Jesus taught here is not different from the wisdom taught by the old testimony Hosea 6:6 ‘For I desire mercy and not sacrifice, And the knowledge of God more than burnt offerings’ That verse teaches us that forgiveness is possible by repentance and obedience; no sacrifice is necessary Matthew 9:13 teaches that Jesus came to call the sinner to repentance ‘I desire mercy, and not sacrifice, for I came not to call the righteous, but sinners to repentance’. Jesus did not ask the disciples to worship him as a God; he asked them to pray to “the only true God”, “My God and your God”. The bible footnotes show many other additions in King James Version which were added to support the claims of the trinity and which were not in the old scripture; examples are: In I John 4:3 ‘CHRIST is come in the flesh’ is an addition In Matthew 8:2, 9:18, 15:25, 18:26, 20:20, Mark 5:6 the word ‘bow down' was changed to ‘worshiped’. Jesus referred to himself as “son of man”. Jesus was not all-knowledgeable and he prayed to GOD, so this is enough to say that he wasn’t God nor did God come down to earth to be Jesus. Jesus said, “And this is life eternal, that they might know You the only true God, and Jesus Christ, whom You have sent.” John 17:3 Jesus said that he does not know everything; he said that only God knows But about that day or hour no one knows, not even the angels in heaven, nor the Son, but only the Father Mark 13:32 Jesus said that he is not equal to God “I can of mine own self do nothing: as I hear, I judge: and my judgment is just; because I seek not my own will, but the will of the Father which hath sent me.” John 5:30 Jesus said, “The Father is greater than I.” John 14:28 “Jesus answered them, and said, My doctrine is not mine, but his that sent me.” John 7:16 Jesus prayed to God as written in Mark 1:35, Luke 5:16, John 17:11, Matthew 26:39, Luke 10:21, Luke 22:44 “my Father and your Father; my God and your God” John 20:17 The disciples did not pray to Jesus, they prayed to the God and Father of Jesus “Blessed be the God and Father of our Lord Jesus Christ…” 1 Peter 1:3 Jesus introduced himself as a Prophet and people accepted him as a prophet, not as a God in Matthew 13:57, John 9:17, Matthew 21:11, Luke 7:16, Luke 24:19, John 6:14, Matthew 14:5, Matthew 21:46, John 7:40-41, and in Matthew 24:36 Jesus never said I am God; In the Old Testimony God says he is God several times, but Jesus did not say so in the New Testimony Isaiah 45:5 and 46:9 ‘no God beside me’, ‘none like me’ In John 17:6-8 and John 13:3 Jesus explained that God has given power and authority, he did not own it “I have manifested Your name to the men whom You gave Me out of the world; they were Yours and You gave them to Me, and they have kept Your word. “Now they have come to know that everything You have given Me is from You; for the words which You gave Me I have given to them; and they received them and truly understood that I came forth from You, and they believed that You sent Me John 12:49 For I have not spoken of myself; but the Father which sent me, he gave me a commandment, what I should say John 14:24 Anyone who does not love me will not obey my teaching. These words you hear are not my own; they belong to the Father who sent me In Matthew 19:16-17 and Luke 18:19 Jesus denied being good in the sense that God is good. ‘Why do you call me good? No one is good except God alone.’ Jesus is called a “Man” many times in the Bible of John 8:40, Acts 17:31, Matthew 27:54, Luke 23:47, Mark 15:39 ‘a man who has told you the truth’ The disciples have introduced Jesus as a “Man” in Acts 2:22 and Acts 2:23 *reincarnation Prophets have taught that there is no such thing as beforelife or reincarnation. That is according to the teachings of Judaism, Christianity and Islam. There is no such thing as nonexistence; death is the end of the temporary testing stage When we see birth defects or children starving to death, we cannot accept the reincarnation teachings that the children who are suffering were sinful in their previous lives. God has told us that we are born fresh without any previous knowledge; those who claim to remember previous lives must be mistaken. According to the teachings of Christianity and Islam, we will be judged in the afterlife according to our deeds in this life. How those who believe in reincarnation explain population growth? Reincarnation was a wise answer about the issue of suffering; here is the general answer as taught by prophets: We are here for testing; test environment necessitates struggle between good and evil. Testing missions are not supposed to be easy and comfortable. The test questions are not supposed to be known in advance. The wealthy father has the right to test his sons before distributing the wealth The wise father disciplines his children and prepares them for a better life The obedient son who takes care of others should be rewarded better than the disobedient son who persecutes others. Regardless of how successful we are with our personal objectives; we cannot have inner peace without addressing the high-level objective; the purpose of our existence. It is wrong to say ‘let us enjoy the journey and forget about the destination’ If you find yourself in a train, you should not enjoy the beautiful scenes before first ask: why am I here? Where is the destination? We should first ask ‘what is the purpose of life?’ What is the value of life if we do not know the purpose of that life? It is the greatest good for an individual to discuss virtue every day... for the un-examined life is not worth living – Socrates Our life on earth is a very short period compared to the universe time scale; It could be a temporary test period. There are hundreds of verses and teachings about that as mentioned in the following answer: https://www.quora.com/How-do-we-... We have been asked to believe in God and Heaven but we have not seen God or heaven. Our fate will be determined based on that belief and on our good deeds. Why did God make it a difficult test for us? Although God knows what’s in our hearts and what each of us might do, he tests us and wants us to witness our own test results in order to admit that we have been fairly rewarded according to our achievements as recorded in the test results Before the wealthy father distributes his wealth, he may want to record which son is obedient, the records are not for the father who knows, but as a testimony for people who might question the justice of their father Although the wise teacher knows the hard-working student and the lazy student, he prepares regular exams as testimonies so that the students would not say that the teacher had favored some students over the others. Exams also urge students to get prepared in order to succeed Students should not wonder about the intention of the teacher; they are supposed to focus on what the teacher asked them to do If God wants to set up the testing environment to test people, then we are not supposed to advise God on how to set up the terms and conditions of the testing. The students are not supposed to advise the teacher on how to prepare the exams. God has created us, and he knows how to test us. The testing questions and answers are not supposed to be disclosed before the exam; testing environment necessitates some doubts and enables different choices and different decisions. The test does not depend on the level of education, a child may say ‘I do not see the plane any more, it is going far away, it is still there but my sight does not reach it; God must be there but my sight does not reach him’, but a scientist might conclude that, ‘I do not see God, then there is no God’. The test does not depend on the level of religion education, maybe someone who never heard of the religion teachings could pass the test based on the natural original gifts of conscience and reason ‘What I do not want done to myself, I will not do to others. We may find some scholars who know the religion teachings but they accept to persecute and torture others, those are the bad trees which the prophets have warned us of them and of their bad fruits. The wise teacher sets different evaluation criteria for different grades; the students in the first grade are not evaluated as the students in the advanced degrees. We expect that the fair and wise God would evaluate people according to what they have been provided. The person who never heard of Prophets would have an easier test based on the gift of intelligence and conscience; he might get rewards for his good works and he might not be punished if not wicked. God has empowered each of us to be happy and blessed. God does not predetermine plans for us. God has delegated that task to us, it is up to us to be blessed or to be cursed. The message that God has revealed to all prophets is: ‘Blessings for obedience and curses for disobedience’ All prophets taught that we can earn salvation by obedience, repentance, and good deeds to help others. “In obedience and repentance is your salvation” Isaiah 30:15 Based on the above, the obedient believer should be blessed in this life and should be saved in the afterlife. That is the truth which should set you free. For those who have doubts, they can ask God. All prophets have urged us to ask God and taught that God would answer us. Do not worry about how you will receive and understand the answer; God has created us and he knows how to convey his message to us. The following answers include the details: Sabri Shahin's answer to What are God's greatest teachings? Sabri Shahin's answer to How do we know our purpose of existence in this world? Sabri Shahin's answer to What makes a person truly happy? Sabri Shahin's answer to What are some life philosophies that cut across all cultures? Sabri Shahin's answer to What are the differences between the Holy books of different religions? Do all of them promote love & humanity? Sabri Shahin's answer to If God is loving and caring, why does evil and suffering still exist? Sabri Shahin's answer to Is it true that everyone is born innocent? ",
            "date": "Answered April 4, 2020",
            "views": "255",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Zachary Siple",
                "href": "/profile/Zachary-Siple-1"
            },
            "answer_text": "Read Revelation 12:9 and Revelation 20:2. I will put them down below: “And the great dragon was cast out, that old serpent, called the Devil, and Satan, which deceiveth the whole world: he was cast out into the earth, and his angels were cast out with him.” -Rev. 12:9. “And he laid hold on the dragon, that old serpent, which is the Devil, and Satan, and bound him a thousand years.” -Rev. 20:2. There may be a couple of other Revelation verses that cite this, but these are 2 main ones I can name at the top of my head. Anyways, we know from these verses that Satan was the snake that tempted Eve in Genesis 3. Satan made himself a snake. That’s why. Another attacked part of the Bible is Balaam’s Donkey in Numbers 22. How can a donkey talk? Read Num. 22:28: “And the Lord opened the mouth of the ass(donkey), and she said unto Balaam, What have I done unto thee, that thou hast smitten me these three times?” So why did the donkey talk? Technically, it didn’t. God spoke through the donkey to get Balaam’s attention, see verse 31. If an animal talks, it’s an angelic being(Satan is an angel-see 2 Corinthians 11:14) speaking through it to get someone’s attention. It’s not the animal itself speaking. More on that attention thing, read this passage from Revelation: “And before the throne there was a sea of glass like unto crystal: and in the midst of the throne, and round about the throne, were four beasts full of eyes before and behind. And the first beast was like a lion, and the second beast like a calf, and the third beast had a face as a man, and the fourth beast was like a flying eagle. And the four beasts had each of them six wings about him; and they were full of eyes within: and they rest not day and night, saying, Holy, holy, holy, Lord God Almighty, which was, and is, and is to come.” -Revelation 4:6–8. These bizarre creatures, believed to be called Cherubims in deeper study, are saying that phrase non-stop. We are then told in verses 9–11: “And when those beasts give glory and honour and thanks to him that sat on the throne, who liveth for ever and ever, The four and twenty elders fall down before him that sat on the throne, and worship him that liveth for ever and ever, and cast their crowns before the throne, saying, Thou art worthy, O Lord, to receive glory and honour and power: for thou hast created all things, and for thy pleasure they are and were created.” So we can see here that the 4 living creatures chanting about the Holiness and Return of Jesus attracts 420 elders who praise God themselves. These talking animals with multiple eyes and wings make 420 elders pay attention and also worship God. Just like the snake and donkey got Eve and Balaam’s attention, respectively. Sorry that was long, but I hope that helped you out! The verses I did not write out can be Googled or looked up in a Bible. ",
            "date": "Updated May 1, 2020",
            "views": "248",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rebecca Falkenburger",
                    "user_href": "/profile/Rebecca-Falkenburger"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Werner",
                "href": "/profile/Mark-Werner-4"
            },
            "answer_text": "Genesis is a “creation myth”. To try to look for some semblance of history in this is simply a waste of time. You might as well ask how the snakes in Harry Potter can talk to Harry. And, as the other answer points out… That “serpent” is a modern translation the ancient Hebrew which is generally felt by scholars to mean “tempter” or “adversary”…. This is a classic “trickster” figure from all sorts of mythologies… Like Loki in the Norse sagas or the Coyote in many Amerindian traditions. This is the same entity that entered into the little bet with God over Job, and who tempted Jesus in the desert. This is all mythology pure and simple. ",
            "date": "Answered April 29, 2019",
            "views": "225",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alan Stein",
                    "user_href": "/profile/Alan-Stein-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Reddy",
                "href": "/profile/Mike-Reddy"
            },
            "answer_text": "There is no mention of a snake in the Bible. The English translation of the Bible reads Serpent which is a translation of Nachash from the Hebrew. The word has several different meanings and was used to describe a sorcerer, magician, deceiver etc. The “Serpent” in the garden of Eden was not a snake. It was a metaphor for something else. The Serpent is also referred to in the Book of Revelation as the Devil. The “Serpent” was believed to be a pre-historic man-like being that was able to communicate. Satan, a spirit being, entered the Serpent and seduced Eve to commit evil. The sin was not the eating of an apple or fruit. Fruit was a metaphor for something else, i.e. sin of a sexual nature. There are commentaries about this by Jewish Rabbis in the 5th and 9th century Midrash and Kabbalah. ",
            "date": "Answered April 29, 2019",
            "views": "486",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "John McGraw",
                    "user_href": "/profile/John-McGraw-45"
                },
                {
                    "user_id": "Heidi Paul",
                    "user_href": "/profile/Heidi-Paul-3"
                },
                {
                    "user_id": "Tayo Adewunmi",
                    "user_href": "/profile/Tayo-Adewunmi-1"
                },
                {
                    "user_id": "Lawrence Albertyn",
                    "user_href": "/profile/Lawrence-Albertyn"
                },
                {
                    "user_id": "Miao Qiang",
                    "user_href": "/profile/Miao-Qiang"
                }
            ]
        },
        {
            "author_info": {
                "name": "Loy Pressley",
                "href": "/profile/Loy-Pressley"
            },
            "answer_text": "“Now the serpent was more crafty than any other beast of the field that the LORD God had made. He said to the woman, “Did God actually say, ‘You shall not eat of any tree in the garden’?” (Genesis 3:1) The Bible doesn’t say “snake.” It says “serpent.” According to most Bible dictionaries, the term “serpent” is ”an an emblem of cunning and wisdom. The serpent who deceived Eve was regarded by the Jews as the devil.” (Strong’s). The “serpent” (the Devil) is likely not in the form that we recognize as a snake today. At that time, all animals may have been able to talk. The “serpent” is cursed by God, “The LORD God said to the serpent, ‘Because you have done this, cursed are you above all livestock and above all beasts of the field; on your belly you shall go, and dust you shall eat all the days of your life.’ ” (Genesis 3:14). Agape ",
            "date": "Answered May 2, 2019",
            "views": "286",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jo Thomas",
                    "user_href": "/profile/Jo-Thomas-104"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vern Wall",
                "href": "/profile/Vern-Wall-1"
            },
            "answer_text": "First things first: it is impossible for a snake to speak, so we look for a figure of speech. This figure is called hypocatastasis, Greek for “name calling.” Satan is called “serpent.” Genesis 1:27 King James Version (KJV) 27 So God created man in his own image, in the image of God created he him; male and female created he them. God is a spirit; His image is another spirit. A&E had spirits. Spirit can not talk directly to humans, it can only speak to another spirit. (That is why God had to make a burning bush to get Moses’s attention. Moses could believe that and then God could speak to him out of the flames.) Satan is also a spirit, so he spoke to Eve’s spirit. That’s it. ",
            "date": "Answered December 2, 2019",
            "views": "224",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paul Manning",
                "href": "/profile/Paul-Manning-19"
            },
            "answer_text": "This is a long shot, but it is possible that we once had an ability to communicate at a telepathic level and that animals are not—or have not always been—as dumb as we think they are. Readers will accept or reject this more or less according to their philosophy of life and depth of thinking. Most of us only accept what we can verify through life experience and if we haven’t had an animal communicate with us we will be unlikely to accept it. But when the world was new and our minds uncomplicated by centuries of genetic breakdown perhaps our brain had a greater ability to communicate by means other than speaking out loud. Was this ‘subtle’ beast the only one of its kind? Was it an extraordinary example of those days or was it common to have some kind of conversation with animals? Is there a universal kind of language that transcends ‘learned’ languages? The stock answer by those with a Christian church background will probably be that it was a greater power at work but this is unsubstantiated by scripture. ",
            "date": "Answered June 19, 2019",
            "views": "158",
            "upvotes": " Answer requested by Jo Thomas",
            "upvoters": [
                {
                    "user_id": "Rojo Rojo",
                    "user_href": "/profile/Rojo-Rojo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christine Stokes",
                "href": "/profile/Christine-Stokes-7"
            },
            "answer_text": "Remembering this was the time of creation, the time before the Flood; a time that cannot be compared to today. The serpent was not a snake, it was a more subtle creature that had the power of speech, it could repeat what it heard but was not able to reason consequences. We cannot envisage in our time what happened pre-flood as the previous world was wiped away. The serpent was cursed to crawl on its belly and eat dust all the days of its life, thus the serpent became a snake. ",
            "date": "Answered April 29, 2019",
            "views": "139",
            "upvotes": " Answer requested by Jo Thomas",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Piet-Snot-9"
                },
                {
                    "user_id": "Jo Thomas",
                    "user_href": "/profile/Jo-Thomas-104"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Mbechin",
                "href": "/profile/Dan-Mbechin"
            },
            "answer_text": "That serpent in the Garden is mentioned in the Revelation, as the devil ( Satan). I think temped her much the same way we are temped to cheat, steal etc. He tempts by making you go against your conscience. Muslims suggest that one has a good angel on one shoulder and an evil one on the other. This can paint a good picture. The devil is an unclean spirit, not physical and he may also use other people to tempt other people into his evil plans. Hope this helps. ",
            "date": "Answered April 8, 2020",
            "views": "45",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Glenn Brotherton",
                "href": "/profile/Glenn-Brotherton"
            },
            "answer_text": "Snakes do not really talk. However, a ventriloquist can make sounds so that it seems that a dummy is talking. Eve had little experience in life and so she was deceived into thinking that the ‘tree of knowledge' could help a serpent to have knowledge enough to speak. Compare 1 Timothy 2:13-14 and Revelation 12:9. ",
            "date": "Answered May 1, 2019",
            "views": "73",
            "upvotes": " Answer requested by Jo Thomas",
            "upvoters": [
                {
                    "user_id": "Rick Gutbrod",
                    "user_href": "/profile/Rick-Gutbrod"
                },
                {
                    "user_id": "Edward Richardson",
                    "user_href": "/profile/Edward-Richardson-34"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sing Lau",
                "href": "/profile/Sing-Lau-15"
            },
            "answer_text": "Because Adam and Eve were supposed to talk to them. As God created Adam and Eve to take care of the animals, is it too hard for God to make them communicate to each other. Eve was not surprised by the way the snake was talking to her, so talking to other animals had to be normal to her. Men probably lost the ability to talk to animals after the flood. God gave the green light to Noah to eat animals, so their relationship had to be broken since that time. ",
            "date": "Answered June 2, 2019",
            "views": "88",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nero Wright",
                    "user_href": "/profile/Nero-Wright-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Diego Rodriguez",
                "href": "/profile/Diego-Rodriguez-18-1"
            },
            "answer_text": "The snake spoke in Sumerian, the word NAHASh (serpent in Hebrew) comes from the name of the Sumerian serpent god named SATARAN / SAHARAN but spelled backwards (SAHARAN <> NAraHAS). The fruit of the tree of the knowledge of good and evil is writing because the fruit in Hebrew is PARI but PA in Sumerian is branch and RI is to support, that is, PARI means to support the branch (on a writing tablet) ... ",
            "date": "Answered April 4, 2020",
            "views": "65",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dennis Cybulski",
                "href": "/profile/Dennis-Cybulski"
            },
            "answer_text": "We do not know. However, we do KNOW that angels (of which Satan was one, a Cherub) have the ability to materialize human bodies (see Genesis 6) so there is good reason to think that Satan could have materialized the body of a “snake” of some sort. The other possibility is some form of ventriloquism. ",
            "date": "Answered April 29, 2019",
            "views": "196",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Paul Clifford",
                "href": "/profile/Paul-Clifford-27"
            },
            "answer_text": "How did the snake in the Bible \"talk\" to Eve? Telepathically. Read Genesis 1:26. Adam & Eve were created in the image & likeness of God, and whomever else he had been with during the creative period. ",
            "date": "Answered April 29, 2019",
            "views": "47",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Terry Ferguson",
                "href": "/profile/Terry-Ferguson-51"
            },
            "answer_text": "Revelation 12;9 KJV.The sanke or serpent,was Satan,and he could talk just fine.he beguiled Eve.Look up that word beguiled in hebrew and greek,it means seduced.cain is Satan`s son.Ham haslept with his Father`s wife,who was a daughter of the line of Cain.She bore Canaan.Many jews and tribe of Dan,took wives from Canaan.Revelation 2;9 snd 3;9 KJV. ",
            "date": "Answered August 14, 2020",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mary Crosby",
                "href": "/profile/Mary-Crosby-14"
            },
            "answer_text": "Snakes don’t talk. Satan made the snake appear to talk. He used the snake like a ventriloquist uses a dummy. ",
            "date": "Answered May 12, 2019",
            "views": "28",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Pamela Muir",
                "href": "/profile/Pamela-Muir-2"
            },
            "answer_text": "She kept bugging the snake telling him how horny she was for Adam. The snake was very bored by Eve and that surprised her greatly because she just knew all beings should love her. Then she sat down and pinched her lips hoping to entice hot studly Adam. ",
            "date": "Answered October 11, 2020",
            "views": "251",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sanghak Yoon",
                "href": "/profile/Sanghak-Yoon"
            },
            "answer_text": "Adam was created as a spirit. The Garden of Eden is in God’s world. Spirits can communicate with each other. Please see it: Where is the Garden of Eden? ",
            "date": "Answered May 6, 2019",
            "views": "62",
            "upvotes": " Answer requested by Jo Thomas"
        },
        {
            "author_info": {
                "name": "Mat Delano",
                "href": "/profile/Mat-Delano-1"
            },
            "answer_text": "He probably made ‘promises’ to her, that sounded something like this…  ",
            "date": "Answered April 29, 2019",
            "views": "114",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Herman Dormehl",
                "href": "/profile/Herman-Dormehl"
            },
            "answer_text": "Maybe the inverted commas should not be around the word talk but rather around the word snake? ",
            "date": "Answered April 29, 2019",
            "views": "24",
            "upvotes": "0"
        }
    ]
}