{
    "title": "How long will the human species last? What are the main barriers to the survival of our species? Have there been previously dominant species that were completely exterminated? - Quora",
    "tags": [
        "Future of Humanity",
        "The Future",
        "Species",
        "Humans ",
        "Future Scenarios",
        "Human Evolution"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Werner",
                "href": "/profile/Mark-Werner-4"
            },
            "answer_text": "I’ve said before that it’s very difficult to imagine a scenaro that would cause the extinction of the human race. We are very numerous, very adapatable, and we live pretty much all over the planet. At any particular time, a fairly decent percentage of us are in sheltered environments, be that deep in underground buildings or structures, tunnels, mines, etc, etc. So even an “extinction event” sized impact from a large asteroid would likely kill billions but not everybody….And the survivors would crawl out of their shelters and start rebuilding. Pandemics? No disease organism kills 100 percent of victims; there is always a percentage that are immune and our ability to rapidly isolate a diseased population and formulate treatment can be very effective. Nuclear war? See the above regarding a major impact. There would be survival. Just for interest…. For years, it was felt that the “K-T Event”, the impact that caused the extinction of the dinosaurs, caused a global-cooling situation which gradually killed off plant life and then caused the collapse of eco-systems and that the extinction took place over a relatively long period. However, recently a more violent scenario has been proposed, and seems to be born out by evidence. When the big (10 kilometer!) asteroid hits, it penetrates very deeply into the Earth’s crust, likely down past the crust, and causes gigatonnes of “ejecta” in molten form to be violently propelled into space. In space, this enormous mass of material cools and begins, under gravity, to fall back to earth as small globs of glass-like material. As it begins to re-enter the atmosphere, much as meteorites do, it begins to heat the atmosphere. There is so much of this material that the atmosphere heats to an extent that kills all unprotected life within only a few hours. Survivals are those critters that live underwater, underground, in caves, etc, etc. What we see today is the survivors of that event. Plant life would largely survive due to the huge number of buried seeds, protected seed pods (like nuts) etc,etc. NPR’s “Radiolab” show had a nice segment on this idea that’s up on YouTube. ",
            "date": "Answered August 11, 2016",
            "views": "83",
            "upvotes": " View 65 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pamela Belknap",
                    "user_href": "/profile/Pamela-Belknap-1"
                },
                {
                    "user_id": "Aponte Anthony",
                    "user_href": "/profile/Aponte-Anthony"
                },
                {
                    "user_id": "Jeremy Diaz",
                    "user_href": "/profile/Jeremy-Diaz-6"
                },
                {
                    "user_id": "Piyali",
                    "user_href": "/profile/Piyali-27"
                },
                {
                    "user_id": "Alan Wu",
                    "user_href": "/profile/Alan-Wu-13"
                },
                {
                    "user_id": "Chris Regan",
                    "user_href": "/profile/Chris-Regan-12"
                },
                {
                    "user_id": "David Brown",
                    "user_href": "/profile/David-Brown-395"
                },
                {
                    "user_id": "Irving Prentice",
                    "user_href": "/profile/Irving-Prentice"
                },
                {
                    "user_id": "Bob Dylan",
                    "user_href": "/profile/Bob-Dylan-583"
                },
                {
                    "user_id": "Eric Topp",
                    "user_href": "/profile/Eric-Topp-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "John A. MacKay",
                "href": "/profile/John-A-MacKay"
            },
            "answer_text": "Some version of the human race will survive. Homo Sapiens, modern humans, have prevailed for about 50,000 years. Our immediate predecessors were the Neanderthals. The Denisovans, a variation on Neanderthals, did not last long. Neanderthals lived inEorope and in other places around the globe for about 500,000 years. Built for strength, cold living conditions and resistance to many diseases. We are the beneficiaries of this immunity as we have 4–7% of Neanderthal’s genes. That is because our ancestors had intercourse with them and the resulting offspring had this disease resistance. We had an older relative, and perhaps many ones. Homo Erectus moved from Africa about one million years ago and spread through Europe and Asia. We don’t know exactly why they declined but they lasted nearly a million years and there have been many changes in climate and extinction events since. Homo Florensis, a pygmy variation Of Neanderthals lived in the Pacific Basin until relatively recent times. We know about these different humans because of scarce clues. human tissue does not survive long and often, accidental and rare clues are found. Survival of modern humans will be dependent on many factors. We are currently in the middle of what is called the sixth extinction event. Previous extinctions killed off the dinosaurs but encouraged the success of small Mammals, from which we descended. Other extinction events were harmful to one species but often allowed others to survive. Pressure from changing climate conditions, rising sea levels, a buildup on carbon dioxide of unprecedented proportions and the resulting migration of most of the human population away from present cities and countries at sea level to higher ground. This is a huge potential problem for humanity. At about 125 degrees Fahrenheit, plants will not grow. Wheat, corn and soybeans, the bulk of agricultural production, responsible for food supply in the US, may not grow here any longer. Long term survival seems more likely in Canada, Siberia and conversely in South America and Southern Africa. Antarctica may actually be green again as will Greenland. What special adaptation will be made in Homo Sapiens to adjust to this change in population centers. Sherpas in the Himalayas survive at high altitudes where oxygen is scarce. The Inuit have learned to survive in very cold temperatures. Judging from recent sporting events, people from certain areas in Africa are able to win marathons and super marathons by extending their endurance in extreme conditions. What other survival skills will humans need to survive? The population migration will undoubtedly lead to cataclysmic numbers of deaths due to starvation and disease. We only have to look at recent events to guess how difficult survival will be. I believe humans will survive but I don’t know in what form.if we become multi-planetary in the next few years, we will have to learn to survive in low gravity, low or no oxygen and in toxic gasseous atmospheres. The question becomes where will we survive as a species? ",
            "date": "Updated April 24, 2019",
            "views": "176",
            "upvotes": " View 85 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Caitlan Yap",
                    "user_href": "/profile/Caitlan-Yap"
                },
                {
                    "user_id": "Pamela Belknap",
                    "user_href": "/profile/Pamela-Belknap-1"
                },
                {
                    "user_id": "Kathy House",
                    "user_href": "/profile/Kathy-House"
                },
                {
                    "user_id": "Jeremy Diaz",
                    "user_href": "/profile/Jeremy-Diaz-6"
                },
                {
                    "user_id": "Denis Charbonneau",
                    "user_href": "/profile/Denis-Charbonneau"
                },
                {
                    "user_id": "Zachary Abelardo",
                    "user_href": "/profile/Zachary-Abelardo"
                },
                {
                    "user_id": "Wayne Anderson",
                    "user_href": "/profile/Wayne-Anderson-87"
                },
                {
                    "user_id": "Alan Wu",
                    "user_href": "/profile/Alan-Wu-13"
                },
                {
                    "user_id": "Donna Maclean",
                    "user_href": "/profile/Donna-Maclean-17"
                },
                {
                    "user_id": "David Brown",
                    "user_href": "/profile/David-Brown-395"
                }
            ]
        }
    ]
}