{
    "title": "How to read a theory and remember it - Quora",
    "tags": [
        "Memory (information storage)",
        "Human Memory"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gail Johnson",
                "href": "/profile/Gail-Johnson-56"
            },
            "answer_text": "Anything you want to learn can be best learned by utilizing your strongest learning type. I’m kinesthetic learner, meaning I remember things best when I have some sort of experience to connect it to, even if it’s small. I connect heavily with stories (as I’m also an avid reader). For example, in the European History class I took the past semester, I remembered a lot about France in the early 19th century because I remember watching Oliver Twist as a kid (well, I didn’t read the book but eh…), which was written during the time period of and is also set in the time period we were learning about. Another example is that I write all my class notes by hand, even when the teacher says it’s not necessary, or if they allow us to type our notes on our laptops, because the act of physically writing something with a pencil helps me remember it. It also helps when the teacher uses slides and /or group discussion. It also helps me greatly when I can connect things to my personal life experiences (like when I took sociology, I took a look at how a lot of those theories manifested in me and the people around me). It all depends on your learning type. Many people have more than one (I’m visual as well as Kinesthetic), so using more than one method together is a great idea. Maybe writing the theory will help you, maybe reading it or using flash-cards will help, maybe you need to sit down with someone and explain it to them for it to stick. I highly recommend all students to take some sort of online test that helps determine your learning style. ",
            "date": "Answered May 25, 2018",
            "views": "93",
            "upvotes": "0"
        }
    ]
}