{
    "title": "How does an EM wave travel in a vacuum without electrons? - Quora",
    "tags": [
        "Electromagnetic Waves",
        "Vacuum (space)"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Bowen",
                "href": "/profile/James-Bowen-16"
            },
            "answer_text": "I answered a similar question a few months ago and I will give you the same answer.  First, I need to explain a few things. These are Maxwell’s Equations. They are a neat summary of electromagnetism. Perhaps they look difficult to you, but their meaning is pretty straightforward. The first one says that electric charges (denoted as qenc) have an electric field diverging from them (think beams of light from the Sun). The second one says that magnetic fields do not diverge from any space at all, meaning there is no magnetic equivalent of an electric charge (it turns out that magnetic fields are relativistic transformations of electric fields in other reference frames, but that is another discussion). The third says that a non-static magnetic field, i.e. a magnetic field changing with time, will induce an electric field that surrounds the magnetic field. The fourth says that a changing electric electric field, along with an electric current (denoted as ienc), will induce a magnetic field that surrounds the electric field and/or current. Notice that if charge qenc is zero and current ienc is zero, the changing electric field (dphiE/dt) and the changing magnetic field (dphiB/dt) are not necessarily zero. This is the key to understanding how electromagnetic waves propagate without a medium as no specific medium is needed for electric and magnetic fields to exist. Now, if the electric and magnetic fields are not just changing with time but changing with time at a varying rate (like how an object changing speed is accelerating), the magnetic and electric fields they respectively induce are also going to change with time. So, if there is an electric field that is changing at a non-constant rate, it will induce a magnetic field that is also changing with time, which will in turn induce another electric field changing with time, which will induce another changing magnetic field, etc. This is the basic concept behind electromagnetic waves. An electromagnetic wave is an electric field and a perpendicular magnetic field that continuously induce each other and propagate in the direction perpendicular to both fields. I won’t do it here, but using some differential vector calculus, it can be shown that equations 3 and 4 can be transformed into a wave equation similar to that of a traveling wave on a string. This is the simplest way I know of to explain why electromagnetic waves don’t need a medium to propagate in. It is because neither electric nor magnetic fields require such a medium to exist. What they do require, however, is an accelerating charge or current of charges to cause them to propagate. They don’t just come out of nowhere. While a specific volume of space that contains electromagnetic fields does not need charges or currents, somewhere in space and time there do have to be charges and/or currents that the fields emanate from. ",
            "date": "Updated August 5, 2018",
            "views": "512",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Allen Sheldon",
                    "user_href": "/profile/Allen-Sheldon"
                },
                {
                    "user_id": "Venkatramanan S",
                    "user_href": "/profile/Venkatramanan-S-2"
                },
                {
                    "user_id": "Bryant Jackson Green",
                    "user_href": "/profile/Bryant-Jackson-Green-1"
                },
                {
                    "user_id": "Benjamin Daubigney",
                    "user_href": "/profile/Benjamin-Daubigney"
                },
                {
                    "user_id": "Dan Houston",
                    "user_href": "/profile/Dan-Houston-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Justin Christensen",
                "href": "/profile/Justin-Christensen-14"
            },
            "answer_text": "This is a very old question that puzzled scientists over a century ago. It’s an understandable question and still hard to wrap your head around the answer. The reason it is so hard to understand is because we humans like to make connections between similar things. For example, waves travel in water because the water molecules pile up and then push other water molecules out of their way as they try to move downward under the force of gravity, and sound waves move in solids, liquids, and gasses because the atoms in these act like springs that oscillate when compressed or stretched from their equilibrium position. All of these examples only work because there is something there for the waves to travel through. If you take away the medium there are no waves. When light was studied in the 1700s by Isaac Newton, who believed that light was made up of particles, he theorized that that there must be some invisible “Aetherial Medium” that light travels through that causes it to diffract. Later scientists such as Fresnel, Poisson, and Maxwell also used this aether idea to explain how electromagnetic waves propagated. These scientists believed that the universe was filled with a stationary substance called “luminiferous aether” that allowed light to propagate from stars at great distances from us. They believed that light traveled at a fixed speed relative to this stationary aether, and because the earth is not a stationary object they postulated that we should be traveling through this aether, and that the speed of light should be slower when measured in the direction the earth is moving. In 1887 the famous Michelson-Morley experiment was performed which used an interferometer to measure the very small differences in optical path length that this theory predicted depending on the direction they are measured in. However, much to everyone’s dismay, they measured no difference in optical path length no matter how the interferometer was oriented. More experiments to come also seemed to suggest that the expected effects of the earth moving through aether were not there. Finally, in 1905, Albert Einstein published a paper which explained how many of the phenomena that scientists used aether to explain could be accounted for using ideas that he later would solidify in his famous work on special relativity. However, the debate about aether did not immediately die down. Over the last century as technologies have improved there have been many more experiments which have shown with progressively better precision that there is no phase shift due to varying optical path lengths in different directions. In my opinion there is not a satisfactory explanation that makes it easier to understand how light, and electromagnetic waves propagate without a medium. The mathematical concept of fields explains how the forces involved in electrodynamics extend into empty space, however, it does not really explain why it is the way that it is. If you want to understand how electromagnetic fields work, I would say the best way to get this understanding is to study electrodynamics and solve problems until you get a feel for how things work. You have to get used to the idea of invisible field lines extending out from charged objects and wrapping around moving currents. Good luck. :) ",
            "date": "Answered December 26, 2017",
            "views": "779",
            "upvotes": " View 289 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Léon van Heijkamp",
                    "user_href": "/profile/Léon-van-Heijkamp"
                },
                {
                    "user_id": "Arunabha Guha",
                    "user_href": "/profile/Arunabha-Guha"
                },
                {
                    "user_id": "Guy Geens",
                    "user_href": "/profile/Guy-Geens"
                },
                {
                    "user_id": "Mike Parsons",
                    "user_href": "/profile/Mike-Parsons-28"
                },
                {
                    "user_id": "Jim Massa",
                    "user_href": "/profile/Jim-Massa"
                },
                {
                    "user_id": "Gyorgy Kiss",
                    "user_href": "/profile/Gyorgy-Kiss"
                },
                {
                    "user_id": "Mark Fisher",
                    "user_href": "/profile/Mark-Fisher-482"
                },
                {
                    "user_id": "Mandeep Sodha",
                    "user_href": "/profile/Mandeep-Sodha-1"
                },
                {
                    "user_id": "Vasil Maljanovski",
                    "user_href": "/profile/Vasil-Maljanovski"
                },
                {
                    "user_id": "Lycha Rose",
                    "user_href": "/profile/Lycha-Rose"
                }
            ]
        }
    ]
}