{
    "title": "How close are we to making America great again? - Quora",
    "tags": [
        "News Events in U.S. Politics in June 2015",
        "Make X Great Again",
        "Patriotism in the United States",
        "Make America Great Again (campaign slogan)",
        "Culture of the United States of America",
        "Trump-Pence 2016",
        "History of the United States of America",
        "Donald Trump (politician, business person)",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tim Gould",
                "href": "/profile/Tim-Gould-5"
            },
            "answer_text": "I would have to ask why isn’t America great right now. As for getting Trump out of office, all I can say is it will be worse with Biden than with Trump. And when I talk about the world I am not talking about Europe, Canada, and Austria but the rest of the world as well. What the question is is how close are we to making America into a liberal fantasy land and that is never. Venezuela was supposed to be the same thing and look what happened there. If you want to talk Covid then talk percentages and notice that Europe isn’t doing as good as the liberals would like you to believe. In fact, it looks like it is ready to slide back into the dark ages again when you compare it to what has happened in the past. ",
            "date": "Answered July 4, 2020",
            "views": "134",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jeff Lee",
                "href": "/profile/Jeff-Lee-354"
            },
            "answer_text": "Let’s see. More than 125,000 Americans so far have died from the Covfefe virus. (That’s 25 TIMES more dead Americans than those who were killed at Pearl Harbor and on 9/11. 25 TIMES!) Plus more than a million Americans are now unemployed as a result of the pandemic. In 2016, Cheeto promised us we’d be doing so much winning we’d be sick of it. Well, I don’t know about you, but I am sick to freakin’ death of all the winning we’ve been doing since that POS car-jacked the Oval Office. Great again? We aren’t within 40 light years of being great again. ",
            "date": "Answered July 4, 2020",
            "views": "195",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ulf Osterberg",
                    "user_href": "/profile/Ulf-Osterberg"
                },
                {
                    "user_id": "Jade H Wong",
                    "user_href": "/profile/Jade-H-Wong"
                },
                {
                    "user_id": "Nina Renée",
                    "user_href": "/profile/Nina-Renée-1"
                },
                {
                    "user_id": "Richard Howell",
                    "user_href": "/profile/Richard-Howell-47"
                },
                {
                    "user_id": "James Boisclair",
                    "user_href": "/profile/James-Boisclair"
                },
                {
                    "user_id": "Joe Richardson",
                    "user_href": "/profile/Joe-Richardson-127"
                },
                {
                    "user_id": "Ann Wells",
                    "user_href": "/profile/Ann-Wells"
                },
                {
                    "user_id": "Justin Bowen",
                    "user_href": "/profile/Justin-Bowen-66"
                },
                {
                    "user_id": "Al Katz",
                    "user_href": "/profile/Al-Katz-2"
                },
                {
                    "user_id": "Jack Rover",
                    "user_href": "/profile/Jack-Rover-4"
                }
            ]
        }
    ]
}