{
    "title": "How does gravity exist in the universe? - Quora",
    "tags": [
        "Gravity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kyron Wadall",
                "href": "/profile/Kyron-Wadall"
            },
            "answer_text": "Imagine the known interpretation of the universe and space-time as a stretched sheet. Well, now that the sheet is flat, put a blue sphere in it that we'll call \"Earth\". Then, deposited a little further away another grey sphere that we will name \"Moon\". You see that the sheet is curved inwards at each place where we have placed an object. The larger the object, the larger the concavity. We will then say that the object \"curves space time\". You can also see that the two objects we have placed on the canvas are moving in a certain way. This implicitly means that mass plays a role in universal gravitation. However, this property comes from the infinitely small (again linked with the mass of objects), thanks to the elementary particle \"Higgs Boson\", which gives each object its mass (there are several billion per object, but are inside the atomic nuclei). Some will tell you that the energy flows play also a role of \"transporter\" (like a sea current), still others will say that it is related to matter and/or dark energy. What is certain: gravity is mainly due to the mass of objects. ",
            "date": "Answered April 21, 2018",
            "views": "240",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rishi Kumar",
                    "user_href": "/profile/Rishi-Kumar-1629"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Malcomb",
                "href": "/profile/Bob-Malcomb-1"
            },
            "answer_text": "The truth is, we don’t know. WE have lot of equations that predict the effects of regular mass, whici is only about 5% of the total mass of the universe. We don’t have any idea how gravity works on dark matter. Even in our matter, we make up things like “Graviton” to explain it, even though a graviton has never been seen. ",
            "date": "Answered April 21, 2018",
            "views": "9",
            "upvotes": "0"
        }
    ]
}