{
    "title": "How should I study and remember theory for my exams? - Quora",
    "tags": [
        "Exam and Test Studying Strategies",
        "Human Memory",
        "Exam and Test Advice",
        "How-to Question",
        "Studying",
        "Colleges and Universities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Meet Modi",
                "href": "/profile/Meet-Modi-7"
            },
            "answer_text": "That's interesting question.Maybe do you have Monday to Friday working hours.. So do you might not get more time.So try to get concept first of all in those days.Example: If do you learn topic \"Robotics\" in university then you should just Google it or seeing in reference or Wikipedia.. So you just have to clear your concept only.Not have gone through details.On the weekend you might be get a full time, so during that time you should cover books theory and understands what that really want to say.After some weeks, try to talk against your friends or brother or any. And also if you are good at share then teach that theory to your weak friends.I think so it's best way to remind the theory.So All the best and God bless you. ",
            "date": "Answered December 27, 2016",
            "views": "402",
            "upvotes": " Answer requested by Ashish Raj",
            "upvoters": [
                {
                    "user_id": "Sambhaji Bhise",
                    "user_href": "/profile/Sambhaji-Bhise"
                },
                {
                    "user_id": "Nigel Rukarwa",
                    "user_href": "/profile/Nigel-Rukarwa"
                },
                {
                    "user_id": "Avneesh Manian",
                    "user_href": "/profile/Avneesh-Manian"
                }
            ]
        },
        {
            "author_info": {
                "name": "Preetham S Guttiyadehalli",
                "href": "/profile/Preetham-S-Guttiyadehalli"
            },
            "answer_text": "It depends on your ability and commitment.There are so many examples of students who have not scored good even though they studied too long hours. If you are going to score more,you should learn to avoid some of your common mistakes in your reading method and writing practices.After making basics perfect,do not forget to do committed and constant work.Adapt some habits of knowing more than your prescribed syllabus and make the subject your own.Hey,again do not forget to use your creative mind while you are answering.You have to be confident in your study.You should know the question paper pattern and your syllabus for which collecting previous question papers would be helpful.Finally,think you are somehow different and creative , and you can do anything;this will surely boost your confidence.I hope you can do everything and you will do everything.DREAM your 99%.ALL THE BEST. ",
            "date": "Answered July 6, 2016",
            "views": "691",
            "upvotes": " View 3 Upvoters"
        }
    ]
}