{
    "title": "How can one only see one image though having two eyes? - Quora",
    "tags": [
        "Physiology",
        "Eyesight"
    ],
    "response": [
        {
            "author_info": {
                "name": "Supratik Chakrabarti",
                "href": "/profile/Supratik-Chakrabarti"
            },
            "answer_text": "Human eye has such complex structure that it’s unbelievable that it’s not the product of intelligent design, but by looking and studying the eyes of other animals, scientists have concluded that it evolved very gradually from a simple light-dark sensor organ over the course of around 100 million years. It functions in a similar way to a camera, with an opening through which the light enters, a lens for focusing and a light-sensitive membrane at the back. Two optic nerves enter the brain, cross over, coming together at a point called as the optic chiasm. Here, signals from the left side of both eyes are diverted to the left side of the brain, and vice versa, allowing the imagesfrom both eyes to be combined and impress a single object. ",
            "date": "Answered January 20, 2020",
            "views": "347",
            "upvotes": " Answer requested by Yash Dave",
            "upvoters": [
                {
                    "user_id": "Kairav Vadher",
                    "user_href": "/profile/Kairav-Vadher"
                },
                {
                    "user_id": "Monalisha Singh",
                    "user_href": "/profile/Monalisha-Singh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Omkar Barve",
                "href": "/profile/Omkar-Barve-3"
            },
            "answer_text": "Actually you do see 2 images when you see. Both eyes see a different version of the same image because they are separated by some distance. The beauty of the human brain is that these images are merged and one image is formed this gives you depth perception.If you see with one eye closed you can find it difficult to actually touch an object.For a more detailed description visithttps://www.google.co.in/url?sa=t&source=web&rct=j&url=http://www.scientificamerican.com/article/two-eyes-two-views/&ved=0CDsQFjAJahUKEwjH5ZrLv8_HAhXDHo4KHY3wDyE&usg=AFQjCNH3V97VOfLrfZfb5jm5FJ4T5-dVvQ&sig2=ywDOfvjGrwGc-ix5XlyWOQ ",
            "date": "Answered August 29, 2015",
            "views": "12",
            "upvotes": " View 2 Upvoters"
        }
    ]
}