{
    "title": "How do people justify saying that COVID-19 is a hoax? - Quora",
    "tags": [
        "Hoaxes",
        "Conspiracy Theories"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alexander Rose",
                "href": "/profile/Alexander-Rose-6"
            },
            "answer_text": "Obviously, people don't really think that except for crazy people and trolls and that’s just a straw man like saying that US elections are a hoax because Russia or that hate crimes are a hoax because of people like Jussie Smollett. Many people are correctly pointing out that a lot of reporting of COVID-19 is contradictory, inconsistent, sensationalism, hysteria, exaggerations, anecdotes, rumours, conspiracy theories, fear mongering, propaganda, fabrications, and hearsey. Don't just believe whatever is on the TV or the mess that is social media. Many people are also correctly pointing out that the cases and deaths are officially being over counted. I already wrote about this in extensive detail with official medical and government sources. My aswer is more than adequate but I could have easily made it 100 times longer. Alexander Rose's answer to The USA has 5% of the world’s population, but about 30% of COVID-19 cases, despite being the richest nation on the planet. Where did it go wrong? By the way, there are germs, viruses, microorganisms, pathogens, pollutants, and mycotoxins literally everywhere and it's impossible to not breathe them in. Pollution alone kills nearly 10 million people every year, and everybody has latent infections including any of the following: Herpes, E. coli, tuberculosis (1/3rd of people in the world), staph, Hepatitis B, amebiasis, parasites, flesh eating bacteria, and MRSA, but those are just old news and one us scared of any of those things anymore, so really just like with COVID-19, it's all nothing to worry about and you only get sick if you already have preexisting health problems and conditions. COVID-19 is clearly a rare disease with a very low mortality rate, and it not like ebola, smallpox, rabies, bubonic plague, anthrax, or even HIV, so please stop comparing it to those things ",
            "date": "Answered April 24, 2020",
            "views": "453",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mizmyka Rox",
                    "user_href": "/profile/Mizmyka-Rox"
                },
                {
                    "user_id": "Adrian Sebastian",
                    "user_href": "/profile/Adrian-Sebastian-20"
                },
                {
                    "user_id": "Bill Wheeler",
                    "user_href": "/profile/Bill-Wheeler-4"
                },
                {
                    "user_id": "David F. Prenatt Jr.",
                    "user_href": "/profile/David-F-Prenatt-Jr"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Ernsberger",
                "href": "/profile/Daniel-Ernsberger-1"
            },
            "answer_text": "I suppose I could think like a “flat-Earther” and make an educated guess about this as late as 4/22/2020… I do have an answer draft that sarcastically claims the Earth is flat, and despite <sarcasm> before and </sarcasm> after the flat-Earth part, I am reluctant to publish it lest it be construed as a serious “flat-Earth” answer and it gets collapsed by downvotes or moderation. So how could I completely explain away COVID-19 even now, through however ridiculous conspiracy theories? (Note: I do not actually believe any of these): The liberal and conservative media are lying to you. They pay hospital workers to claim that they are “overwhelmed” by this “virus” when in fact everything is going swimmingly in hospitals, with no medical supply shortage. The conservative media fools people incapable of critical thinking, but misleads the left about what the lies are by at least nominally acknowledging this “coronavirus” while otherwise intentionally bumbling the “expert recommended” response to keep the public politically divided.The hospitals themselves could be in on this, too. People with apparent “COVID-19” actually have the original SARS, which there is a vaccine for, but hospitals are forced to assume it’s “COVID-19” due to government orders, and take excessive quarantine measures. Why not just vaccinate? Because that would ruin the “official story” that hospitals are either in on or forced to abide by.Of course, Quora has been completely fooled or is actively in on this too, with human moderators and bots alike collapsing answers challenging how serious “COVID-19” is (let alone challenging its existence at all) as factually incorrect. This makes it important to check the collapsed answers, because they just might have exactly the dissenting opinion you need!So why are governments really imposing all these restrictions? It is either to test us for compliance for something much more sinister (I actually had a Quora question show up in my feed about this, and I’m following it), the U.S. Republicans’ latest voter suppression strategy, or else they are just that power-hungry and think they’ve finally found an excuse to turn the entire world into one big police state.If I wanted to “explain away” COVID-19 MAGA/Trump-supporter style, I could change my claim about media lies to: The liberal media are lying to you. Coronavirus is a hoax, and the only reason that Donald Trump has “acknowledged” this at all is because he was basically at gunpoint from his “medical experts” to do so. Is it any wonder, then, that the “operant truth” seems to change on you so much? Coronavirus is a hoax, and if Trump claims that again, it may seem like backpedaling at first blush, but in fact he is finally free to tell us the truth again!Again, I do not actually believe any of these bullet points. One thing I know for sure is that Donald Trump is exploiting Fox News’ long-standing narrative that “the liberal media are lying to you” to get away with obvious pandemic response blunders and even changing his story all the time (because most, if not all, of his followers either have short memories or don’t trust their own memories, due to the relentless admonitions from Fox News that leave its viewers afraid to turn it off and distrustful of “liberal” news sources (which includes actually moderate/neutral ones.)) Snopes actually rates the claim that “U.S. President Donald Trump referred to the new coronavirus as a ‘hoax’” as “Mixture” because while Trump did “liken the Democrats' criticism of his administration's response to the new coronavirus outbreak to their efforts to impeach him, saying ‘this is their new hoax’” and downplay the severity of the pandemic, he did not literally claim that coronavirus is a hoax (or at least it’s ambiguous): Did President Trump Refer to the Coronavirus as a 'Hoax'? Some other things that Trump said about coronavirus afterwards can be found here, though I take it that “true believers” in Donald Trump would dismiss it as “liberal media”: Trump Said Coronavirus Would 'Miraculously' Be Gone By April. Well, It's April. One other thing: Notice how I didn’t cite any sources for my “coronavirus is a hoax” claims? That’s because there is no actual evidence of this, and the only way I can support claims like that is to speculate on some pretty wild conspiracy theories as to why the ridiculous claims would be true. This comes from something called confirmation bias, where humans have a tendency to want to believe what they already believe, taken to a logical extreme. It is also an example of a fallacious argument called a circular argument, where you assume the very point you are trying to prove! I am going to go ahead and publish this one. Just follow BNBR, and read the whole answer before judging it. Then again, you probably have read it all already if you’re reading this. ",
            "date": "Answered April 22, 2020",
            "views": "453",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gayle Glick",
                    "user_href": "/profile/Gayle-Glick"
                }
            ]
        },
        {
            "author_info": {
                "name": "Felix Rodriguez",
                "href": "/profile/Felix-Rodriguez-187"
            },
            "answer_text": "Allow me to play devil’s advocate. It’s justifiable because you can’t get a second opinion on the matter unless it’s on the dark web somewhere or on some London Real digital freedom platform interview( which are awesome by the way). Creditable doctors are being censored from YouTube for talking on the issue. I guess Dr. Fauci is the only expert on the matter, but even he said at first that the corona virus was not a big deal, before they made everyone wear mask. The mortality rate is at what? 2%? and that’s with the inflated stats. Out of those 100,000 people who supposedly died of covid 19 how many of them would have died from regular flu of whom 50,000 die every year. How many died from pneumonia or other symptoms, but are being classified as covid 19 deaths? There hasn’t even been an increase in death in general compared to other years (Brian Rose, Dr Kaufman interview) If you really read between the lines of these stats we might see that the mortality rate could be much lower than even the flu. Some doctors say that putting some of these patients in ventilators could have probably made the situation worst. It’s a new virus the we are still learning about, and the news sensationalize it, and puts everyone on panic mode. So that’s how people justify it, it’s not right or wrong, and most people don’t say it’s a hoax to be disrespectful or rebellious, they say it because when there is a suppression of information by social media and mainstream media, it just feels like a hoax. Who knows what’s true or not? In my non-expert opinion I think government and media just over reacted, and it’s a lot less worst that they initially thought and that’s a good thing. But the scarcity of it is still out there, and so is the scarcity of a second opinion, because nobody wants to feel like they been lockdown all this time for nothing. ",
            "date": "Answered June 3, 2020",
            "views": "500",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Parich Tangmatitam",
                    "user_href": "/profile/Parich-Tangmatitam"
                },
                {
                    "user_id": "Deepak M",
                    "user_href": "/profile/Deepak-M-217"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kelly La Rue",
                "href": "/profile/Kelly-La-Rue"
            },
            "answer_text": "As much as anything it is Trump and his family who have used the word hoax when discussing the pandemic. Trump whose carelessness is legendary. Instead of heeding the warnings of what might be headed our way he told us with his characteristic cluelessness that ‘It’s going to disappear. One day it’s like a miracle – it will disappear’. Consequently our country is knee-deep in a pandemic because of Trump’s foolish irresponsibility. In the United States, misinformation can come straight from the White House. Unfounded claims from disavowed doctors, controversial studies and outright falsehoods have also found oxygen, often among supporters of the president. Here are some of the most commonly repeated claims. Claim: Stay-at-home orders don’t workReality check: False Claim: The U.S. death toll has been inflatedReality check: The U.S. death toll is likely to be higher than official figures suggest Claim: Covid-19 was made in or released from a labReality check: There is no solid evidence to support this One of the most persistent claims is that the virus was manufactured, engineered or released from a lab. One proponent of this idea was the creator of Plandemic, a viral video espousing disinformation from a discredited scientist named Judy Mikovitz. She has also pushes the long-debunked theory that vaccines could “kill millions”. In fact, they have saved countless lives by preventing severe infectious diseases. However, quashing this piece of misinformation has been complicated by claims from the Trump administration that the virus might have been released by a virology lab in Wuhan, China, the original center of the outbreak. The U.S. secretary of state, Mike Pompeo, recently claimed on ABC News there was “enormous evidence” the virus came from a lab in Wuhan, but provided no corroboration for this claim. And although China has been criticized for failing to be open about the extent of the outbreak, no evidence has yet been produced that the virology lab was responsible. In fact, the most broadly accepted theory of the virus’s introduction is that it originated in a market in Wuhan that sold live, wild animals. The Plandemic Hoax: Debunking coronavirus myths and fighting political misinformation | The Milwaukee Independent Seven of Donald Trump's most misleading coronavirus claims The art of the pandemic: How Trump walked the U.S. into the Covid-19 era  Obama vs Trump ",
            "date": "Updated June 15, 2020",
            "views": "248",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Doug Stevenson",
                    "user_href": "/profile/Doug-Stevenson-30"
                },
                {
                    "user_id": "Mike Nolan",
                    "user_href": "/profile/Mike-Nolan-82"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tim Madden",
                "href": "/profile/Tim-Madden-27"
            },
            "answer_text": "Well to really covince someone they have to first start at the start. To this end we have a few red flags. Starting with “Event 201″ . If you're looking for fishyness - it really doesn't get any better than this nose full of wharf~rot. Event 201 is a John Hopkins, W.H.O. Bill and Melinda Gates Foundation COVID 19 Dress rehearsal featuring Elites and Heads of State from every country with a Central Bank.And not just any virus…No no quite specifically COVID 19.All taking place just a few weeks prior to the first documented case! That, is one hell of a coincidence. What are the odds if them running computer models on this very thing just weeks before? Hmmm.. Now let's look at who has been A) Gotten knee deep in the study of viruses and vaccines for the past 10- 15 years…Why I do declare if Bill Gates hasn't! Billions and billions deep.He has parlayed off enough funds between the WHO and John Hopkins to have put his Foundation in the “this had better pay- off!!” zone. But that's not all , no not even close! There are other entities here with a vested interest in doing this to its Freemasonic ends.You have to realise by now that there is a reason our entire country is littered with square and compass symbolism. It is a very much alive society of persons who have arrived at the corridors of power. But the ways in which they operate are slowly being undone by their own fumblings. It goes without saying that they push every perversion against God that they can dream up.And now they want to dominate even our thoughts and personal drives and beliefs . In a presentation from the CIA archives, a very excited Bill Gates tells the Director And a few other officers and agents. That he possessed the means to infect Taliban fighters with a Corona Virus, that in turn would leave them as “non religious fanatics”. By way if a nanobot ridden version that would actually leave them uncaring of their religions oppression by Isreali led forces.If that isn't dirty pool I can't think of what would be. This scenario is part and parcel the way in which they release future realities to the American public. Slowly at first, and then all of sudden In prices and parts.I think of my self as far more of a intelligently educated man than the average by the doctrine individual. I give anyone, who can realize and commit to the results if critical thinking, their due praise. ",
            "date": "Answered August 29, 2020",
            "views": "107",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kevin Pearson",
                "href": "/profile/Kevin-Pearson-36"
            },
            "answer_text": "Because it is overhyped. 90% of deaths are people suffering from other co-morbidities. 96% are asymptomatic. I had the flu once in the tenth grade. Was I miserable. Yes I was. The next year there were so many people sick with the flu that the school had student act as substitute teachers in other classes because so many teachers were out sick. There were so many students out sick that they closed down the school for a few days. We dealt with it and we got through it. This is no different. The high number of deaths is 1) false reporting, and 2) Cuomo forcing nursing homes to re-admit patients who were Democrat Flu positive. 25 of the first 50 deaths in the US were a single nursing home in Seattle. The elderly are the most vulnerable, as is the case with every flu season. ",
            "date": "Answered May 31, 2020",
            "views": "339",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Parich Tangmatitam",
                    "user_href": "/profile/Parich-Tangmatitam"
                },
                {
                    "user_id": "Wendy Parry",
                    "user_href": "/profile/Wendy-Parry-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Doug Stevenson",
                "href": "/profile/Doug-Stevenson-30"
            },
            "answer_text": "This reeks of trumpet. Yes the drool does come racing out of the horn. If 7billion people are saying covid19 is happening and all other world leaders are saying this is happening and then ALL of the medical and science people say this is happening but some BS artist wants you to consume his malaria mosquito pills and perhaps even suck on bleach, then turn your concepts to truth towards 7 billion people. who live on this planet. As Gabriel stands on Sea and shore and; as he blows his wondrous horn. Old worlds shall die and new be born. (written 587 years ago by a woman called Mother Shipton). I am psychic so was very pleased to meet her. She tells a delightful story or rather a real reality which comes to land at this place now. Her Amazing Poem Tell of The Great Dragon these are her words. learn now about liars and hoax. 587 years ago and she still speaks truth.   MOTHER SHIPTON PROPHECIES Published in 1641 And now a word, in uncouth rhymeOf what shall be in future time Then upside down the world shall beAnd gold found at the root of tree All England's sons that plough the landShall oft be seen with Book in handGreat houses stand in far flung valeAll covered o'er with snow and hail A carriage without horse will goDisaster fill the world with woe. In London, Primrose Hill shall beIn centre hold a Bishop's See Around the world men's thoughts will flyQuick as the twinkling of an eye. And water shall great wonders doHow strange. And yet it shall come true. Through towering hills proud men shall rideNo horse or ass move by his side.Beneath the water, men shall walkShall ride, shall sleep, shall even talk. And in the air men shall be seenIn white and black and even green A great man then, shall come and goFor prophecy declares it so. In water, iron, then shall floatAs easy as a wooden boatGold shall be seen in stream and stoneIn land that is yet unknown. And England shall admit a JewYou think this strange, but it is trueThe Jew that once was held in scornShall of a Christian then be born. A house of glass shall come to passIn England. But Alas, alasA war will follow with the workWhere dwells the Pagan and the Turk These states will lock in fiercest strifeAnd seek to take each others life.When North shall thus divide the south And Eagle build in Lions mouthThen tax and blood and cruel warShall come to every humble door. Three times shall lovely sunny FranceBe led to play a bloody danceBefore the people shall be freeThree tyrant rulers shall she see . Three rulers in succession beEach springs from different dynasty.Then when the fiercest strife is doneEngland and France shall be as one. The British olive shall next then twineIn marriage with a German vine. Men walk beneath and over streamsFulfilled shall be their wondrous dreams. For in those wondrous far off daysThe women shall adopt a crazeTo dress like men, and trousers wearAnd to cut off their locks of hair They'll ride astride with brazen browAs witches do on broomstick now. And roaring monsters with man atopDoes seem to eat the verdant cropAnd men shall fly as birds do nowAnd give away the horse and plough. There'll be a sign for all to seeBe sure that it will certain be. Then love shall die and marriage ceaseAnd nations wane as babes decrease And wives shall fondle cats and dogsAnd men live much the same as hogs. In nineteen hundred and twenty sixBuild houses light of straw and sticks.For then shall mighty wars be plannedAnd fire and sword shall sweep the land. When pictures seem alive with movements freeWhen boats like fishes swim beneath the sea,When men like birds shall scour the skyThen half the world, deep drenched in blood shall die. For those who live the century throughIn fear and trembling this shall do.Flee to the mountains and the densTo bog and forest and wild fens. For storms will rage and oceans roarWhen Gabriel stands on sea and shore And as he blows his wondrous hornOld worlds die and new be born. A fiery dragon will cross the skySix times before this earth shall die Mankind will tremble and frightened befor the sixth heralds in this prophecy. For seven days and seven nightsMan will watch this awesome sight.The tides will rise beyond their kenTo bite away the shores and thenThe mountains will begin to roarAnd earthquakes split the plain to shore. And flooding waters, rushing inWill flood the lands with such a dinThat mankind cowers in muddy fenAnd snarls about his fellow men. He bares his teeth and fights and killsAnd secrets food in secret hillsAnd ugly in his fear, he liesTo kill marauders, thieves and spies. Man flees in terror from the floodsAnd kills, and rapes and lies in bloodAnd spilling blood by man kinds handsWill stain and bitter many lands And when the dragon's tail is gone,Man forgets, and smiles, and carries on To apply himself - too late, too lateFor mankind has earned deserved fate. His masked smile - his false grandeur,Will serve the Gods their anger stir. And they will send the Dragon backTo light the sky - his tail will crackUpon the earth and rend the earthAnd man shall flee, King, Lord, and serf. But slowly they are routed outTo seek diminishing water spout And men will die of thirst beforeThe oceans rise to mount the shore. And lands will crack and rend anewYou think it strange. It will come true. And in some far off distant landSome men - oh such a tiny bandWill have to leave their solid mountAnd span the earth, those few to count,Who survives this (unreadable) and thenBegin the human race again. But not on land already thereBut on ocean beds, stark, dry and bareNot every soul on Earth will dieAs the Dragons tail goes sweeping by. Not every land on earth will sinkBut these will wallow in stench and stinkOf rotting bodies of beast and manOf vegetation crisped on land. But the land that rises from the seaWill be dry and clean and soft and freeOf mankinds dirt and therefore beThe source of man's new dynasty. And those that live will ever fearThe dragons tail for many yearBut time erases memoryYou think it strange. But it will be. And before the race is built anewA silver serpent comes to viewAnd spew out men of like unknownTo mingle with the earth now grownCold from its heat and these men canEnlighten the minds of future man. To intermingle and show them howTo live and love and thus endowThe children with the second sight.A natural thing so that they mightGrow graceful, humble and when they doThe Golden Age will start anew. The dragon's tail is but a signFor mankind's fall and man's decline. And before this prophecy is doneI shall be burned at the stake, at oneMy body singed and my soul set freeYou think I utter blasphemyYou're wrong. These things have come to meThis prophecy will come to be. ",
            "date": "Answered June 15, 2020",
            "views": "274",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aadit Sawant",
                    "user_href": "/profile/Aadit-Sawant"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ethan Henderson",
                "href": "/profile/Ethan-Henderson-24"
            },
            "answer_text": "In short, because the virus hasn’t killed someone they know yet. There’s a guy at work that has a mindset of “everyone’s a buncha sissies fer gettin’ all skeered o’ this virus thing; it ain’t worse’n a cold”. This guy’s also convinced that Antifa and Nazis are the same thing, somehow (don’t ask me how that’s possible), so that gives you a bit of a window into his thinking. Now, I’m willing to bet that he’ll tell the rest of us drivers a much different viewpoint when someone he knows - maybe it’ll be me, right? - catches the virus and comes back physically changed…or doesn’t come back because they’ve died. He’s not the only one in America, as I’m certain at least one or two million people share a similar mindset here in the States. That’s the sort of mindset prevalent among those people, most of whom are ordinary folks, anyways. For some people, it’s a political hoax and overhyped because the pandemic does in fact harm the public perception of the conservative Republican Party and all officials with that (R) next to their name plate. Everything was going along for them just fine until a crisis hit and caught them unprepared; we’re starting to see line-item budget documents popping up that demonstrate the lack of preparation at the federal and state levels. The people who are saying “it’s an overhyped political hoax” understand that their preferred party stands to lose everything if the image of the Republican Party being in control gets shattered, and they’re terrified of what that will mean going forward. Hope this helps. EDIT: I’ve changed a couple of things for clarity. ",
            "date": "Answered May 31, 2020",
            "views": "189",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Paul Cager",
                    "user_href": "/profile/Paul-Cager"
                },
                {
                    "user_id": "Steve Penland",
                    "user_href": "/profile/Steve-Penland"
                },
                {
                    "user_id": "Russell Wright",
                    "user_href": "/profile/Russell-Wright-32"
                },
                {
                    "user_id": "Matt Bahr",
                    "user_href": "/profile/Matt-Bahr-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Smyth",
                "href": "/profile/James-Smyth-9"
            },
            "answer_text": "I don’t think anyone believes it’s a hoax, but has presented an “opportunity the left in this country will not let go to waste.” - that’s from Hillary Clinton politically, the virus has harmed President trumps administration, and harmed all the, Record breaking, economic progress he made during his first three terms. 🤔 President Obama specifically said President Trump “would need a magic wand,” to achieve what he has. Furthermore, Joe Biden doesn’t have to travel, as his health has been an issue. He clearly has good days and bad days, and the virus makes mitigating these easier. Moreover, this nonsense with the mail is Christmad for the Democrats. According to Tucker Carlson, John podesta (Yes, The same guy famous for his strangely coded emails - it’s referred to as “pizza gate” — FYI, Pizza gate has never been “debunked” - it’s just that there’s no evidence of what the coded emails actually mean … hence, a conspiracy … it was called pizza gate because of all of the coded language used in his emails, “pizza,” was the most common one, and if you plug in the FBI’s child trafficking symbols and codes into the email you get the crazy stuff — there’s no definitive Proof that the code word pizza means some thing sinister. 🤯 I’m sorry for my digression, my point is that Tucker Carlson spoke about Podesta “gaming” this coming election (it means using complex statistical algorithms to predict outcomes) and Podesta concluded that the Biden team will succeed using the military to install him — essentially, the election will be so incredibly chaotic that it will take years to sort out, so the left is counting on actually using the military to physically remove President Trump — ☝🏼 how many times have I heard on CNN or MSNBC that they’re looking forward to this ",
            "date": "Answered August 22, 2020",
            "views": "80",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "TJ Berens",
                "href": "/profile/TJ-Berens"
            },
            "answer_text": "Words came out of Trump’s mouth and thumbs, etc. His followers heard the words. They then believed it was a hoax.  Apologists afterwards, rushed to spin it, that implying serious measures to respond to it were the hoax, misinformation spread by do-nothing democrats, and doctors, etc… not the virus. That way, they could pretend he did not say things that convinced his followers that it was a hoax. Later again, of course, he then had to perform the serious measures to respond to it… finally…. as the US passed all other countries in cases and deaths. His followers see that as Trump successfully appeasing those do-nothing-democrats, pretending to kill the monster under our beds so we’d go back to sleep. :D :D ",
            "date": "Answered April 22, 2020",
            "views": "185",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Karen Nelson",
                    "user_href": "/profile/Karen-Nelson-65"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pat McCormack",
                "href": "/profile/Pat-McCormack"
            },
            "answer_text": "A mixture of paranoia and stupidity leavened with a cruel dose of anxiety. A significant number of people are conditioned to believe that life has a plan. And that if that plan is not working out then either they have to take the blame (always uncomfortable) or a malign force us screwing things up. In old Islamic thought “the adversary” was the malign force. Being social creatures we project personalities onto the plan and the malign force. But physics and biology give a more nuanced view. Thermodynamics yields to entropy globally but permits local information self ordering. Life in other words. As a metaphor I think of life as kayaking down the Zambezi. Me and my paddle won't turn back the mighty river but if I get my energy and skills together I might avoid the rocks. If I am really lucky I might find a quiet spot on the bank to rest up a bit. The rocks and the river are not conspiring against me. They don't even know I am passing by. Covid-19 is just the river washing me from my nook but it can feel like someone is out to get me. That was MY spot and now my illusion of control is shattered. ",
            "date": "Answered April 24, 2020",
            "views": "1",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tarun Jindal",
                    "user_href": "/profile/Tarun-Jindal-36"
                },
                {
                    "user_id": "Samuel Dokowe",
                    "user_href": "/profile/Samuel-Dokowe"
                },
                {
                    "user_id": "James Heald",
                    "user_href": "/profile/James-Heald-2"
                },
                {
                    "user_id": "John Knight",
                    "user_href": "/profile/John-Knight-19"
                },
                {
                    "user_id": "Manny Jacobowitz",
                    "user_href": "/profile/Manny-Jacobowitz"
                },
                {
                    "user_id": "Gary Sorgenfrei",
                    "user_href": "/profile/Gary-Sorgenfrei"
                },
                {
                    "user_id": "Pádraic Breathnach",
                    "user_href": "/profile/Pádraic-Breathnach"
                },
                {
                    "user_id": "Laszlo B. Tamas",
                    "user_href": "/profile/Laszlo-B.-Tamas"
                },
                {
                    "user_id": "Jennifer Armstrong",
                    "user_href": "/profile/Jennifer-Armstrong-115"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alan Appleby",
                "href": "/profile/Alan-Appleby-4"
            },
            "answer_text": "Why would anyone think that COVID-19 is a hoax? Their all-knowing leader and his false news media propagandists said it was a hoax, - just as they had done with misleading propaganda about other serious issues which the Pablovian gullible had been conditioned to swallow! Classical conditioning - Wikipedia What evidence are they using for this assumption? The evidence is that uneducated false-news media conditioned Trump Supporters, will swallow any story they are told by their chosen worshipful disinformation sources, stay in their self-delusion bubble, and never learn from their previous foot-shooting activities! They have Trump-rally awarded and applauded, degrees in Dunning-Kruger “knowledge” of EVERYTHING, - and a full list of scape-goats to whom any disasters can be attributed. ",
            "date": "Answered April 22, 2020",
            "views": "234",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jim Brown",
                    "user_href": "/profile/Jim-Brown-437"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gary Page",
                "href": "/profile/Gary-Page-25"
            },
            "answer_text": "What would a hoax look like? First, as a hoax, there really wouldn't be people sick from the disease, or dying from it. The people in on the hoax could pretend to be sick, but they couldn't fill up hospitals unless all the medical people were in on it. Maybe this is possible in a few hospitals, but it is hard to see how it could be done in huge numbers of hospitals around the world. Second, if you tried to have the “patients” at only some hospitals in a region, how do you keep the staff at other hospitals from asking why they weren't seeing it at all? You would need willing or unwilling support from nearly everyone in a health role. Third, media of all sorts would just have to go to any hospital that was supposed to be overrun with patients, but wasn't to crack the whole hoax. Journalists and their relatives go to hospitals for their own needs. I think this means they all have to be in on it. Fourth, so do the coroners and funeral home workers who have to cover up for the fact that there aren't enough deaths. Remember the whole country is supposed to have a pretty big increase in total deaths. That's hard to fake. Fifth, you have a challenge with the general population in places that are supposed to have high rates wondering why they don't know anybody with the disease. Almost every government in the world would have to be in on it too. You may have seen a handful of people claiming to have evidence that this is a hoax, but for it to be a real hoax there would likely be millions of every nation and political alignment. I don't see how you do that. ",
            "date": "Answered August 22, 2020",
            "views": "182",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Roger Willcocks",
                    "user_href": "/profile/Roger-Willcocks"
                },
                {
                    "user_id": "Kym Derose",
                    "user_href": "/profile/Kym-Derose"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leo Miller",
                "href": "/profile/Leo-Miller-33"
            },
            "answer_text": "Anything you have not witnessed for yourself is technically open to debate. Believe it or not, a lot of people believe that the holocaust never happened, simply because they did not witness it, and because they don’t trust the media or the history books. This idea that we must witness something in order to believe it is not always a bad thing, but we also need to exercise some common sense. It’s extremely unlikely that so many thousands of people around the world could be faking the COVID19 pandemic. Somewhere along the way, evidence would leak out that this is all a hoax. The fact that that hasn’t happened (apart from some spurious bits of “evidence”taken out of context), is an indication that there is no hoax, or that everyone except a small majority of us are in on the conspiracy. Which do you think is more likely? ",
            "date": "Answered April 20, 2020",
            "views": "729",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sam Shroff",
                    "user_href": "/profile/Sam-Shroff-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karen Keil",
                "href": "/profile/Karen-Keil-4"
            },
            "answer_text": "When news about the virus started coming out of Wuhan, the WHO told us it was no big deal. When Mr. Trump started taking action to deal with it, the Democrats criticized him for being racist and alarmist. Instead of dealing with the problem of the pandemic, they made a political issue out of it - another in a long list of reasons to attack the president, without any concern about the virus itself. Then, when it seemed that the virus might be something to worry about, they reversed course and attacked the president because he hadn’t done enough. Their whole strategy for dealing with the virus was to use it as a means to attack the president. And now that it’s turned out that it’s not as big a problem as we were led to believe, we still face the nightmare created by the gubernatorial responses to the virus - locking down whole states as if they were New York City (while praising Cuomo as though he’s handed it well when in fact, his decisions made NYC the worst pandemic hotspot in the country.) It’s not that the pandemic was a hoax, it was the misuse and bad decisions made by the governors that were the hoax. ",
            "date": "Answered May 31, 2020",
            "views": "96",
            "upvotes": " Answer requested by Laura Legge",
            "upvoters": [
                {
                    "user_id": "Godelieve Danker",
                    "user_href": "/profile/Godelieve-Danker"
                },
                {
                    "user_id": "Brian R. Sanderson",
                    "user_href": "/profile/Brian-R-Sanderson"
                },
                {
                    "user_id": "Edward Falk",
                    "user_href": "/profile/Edward-Falk-1"
                },
                {
                    "user_id": "Alan Appleby",
                    "user_href": "/profile/Alan-Appleby-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Koen van Hees",
                "href": "/profile/Koen-van-Hees"
            },
            "answer_text": "There’s ample evidence. There’s this  Then there’s this  And finally, most damning of all is this  Who needs more!?!?! Jokes aside, if there’s one upside of the very real covid-19 pandemic, it’s that it shows to everyone with half a braincell that stupidity kills. And it shows those same people there are a depressingly large number of people with less than half a braincell… If you don’t agree, enjoy the pretty pictures and have a nice day. Someone will be along soon to cut your hair. ",
            "date": "Answered April 22, 2020",
            "views": "511",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mabozza Richie",
                    "user_href": "/profile/Mabozza-Richie"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kenneth Goldberg",
                "href": "/profile/Kenneth-Goldberg-7"
            },
            "answer_text": "Here are a couple reasons, but there may be others as well. Belief in Trump. A lot of morons think it is a Chinese, Deep State, or Democratic plot to destroy Trump politically. The Liar-In-Chief certainly hinted at that, and lots of morons still believe in this incompetent ultra-liar.This Pandemic is not pleasant, and some reflexively deny certain things that are unpleasant. Ask doctors about people that reject diagnoses of bad illnesses, or that go thru those seven stages, the first being denial.General cynicism. In some cases fueled by journalistic errors, or the lying idiots at Fox News and other places where truth is not valued.Rural Living. The pandemic is far more pronounced in crowded cities, so some rural or small town residents feel unaffected by it, although it is there too, in lesser numbers. Some of these people are anti-city, but far from all.",
            "date": "Answered June 8, 2020",
            "views": "81",
            "upvotes": " Answer requested by Laura Legge",
            "upvoters": [
                {
                    "user_id": "Paul Cager",
                    "user_href": "/profile/Paul-Cager"
                },
                {
                    "user_id": "Steve Penland",
                    "user_href": "/profile/Steve-Penland"
                },
                {
                    "user_id": "Matt Bahr",
                    "user_href": "/profile/Matt-Bahr-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Calvin Henrick",
                "href": "/profile/Calvin-Henrick"
            },
            "answer_text": "I have yet to here someone claim the disease is a hoax. I’ve heard several people say there is a hoax going on insofar as the death totals being significantly exaggerated. There definitely have been cases where someone died not of COVID, but it was counted as a COVID death. A study from Colorado suggests this might be up to 25% of reported COVID deaths. When I hear someone accused of thinking COVID is a hoax, it’s usually that they’re saying something like the above. It’s also occasionally just a completely unfounded smear. ",
            "date": "Answered June 21, 2020",
            "views": "68",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rocky Cassiano",
                "href": "/profile/Rocky-Cassiano"
            },
            "answer_text": "Question: How can covid possibly be a hoax? Answer: This data was current as of March 9th 2020. Deaths per Day, Worldwide. Tuberculosis: 3014. Hepatitis B: 2430. Pneumonia: 2216. HIV/AIDS: 2110. Malaria: 2002. Shigellosis: 1644. Rotavirus: 1233. Seasonal Flu: 1027. Norovirus: 548. Whooping Cough: 440. What is covid’s deaths per day? How can covid possibly be a hoax? How can the political and social reaction to covid NOT be a sysop? Armageddon 2040. ",
            "date": "Answered August 22, 2020",
            "views": "74",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bob McCown",
                    "user_href": "/profile/Bob-McCown-1"
                },
                {
                    "user_id": "Nick Thornhill",
                    "user_href": "/profile/Nick-Thornhill-2"
                },
                {
                    "user_id": "Ann Wingert",
                    "user_href": "/profile/Ann-Wingert-1"
                },
                {
                    "user_id": "John Morris",
                    "user_href": "/profile/John-Morris-856"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Dixie-Westmoreland"
                },
                {
                    "user_id": "Deb Headley",
                    "user_href": "/profile/Deb-Headley"
                },
                {
                    "user_id": "Wieslaw Szmigiel",
                    "user_href": "/profile/Wieslaw-Szmigiel"
                },
                {
                    "user_id": "Jonathan Werner",
                    "user_href": "/profile/Jonathan-Werner-18"
                },
                {
                    "user_id": "Alan Edmonson",
                    "user_href": "/profile/Alan-Edmonson"
                },
                {
                    "user_id": "Alex Koren",
                    "user_href": "/profile/Alex-Koren-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Don Rolph",
                "href": "/profile/Don-Rolph"
            },
            "answer_text": "Because at the mo,ent that position is politically convenient. If we accept that civic-19 is a serious issue and that significant Federal action is required to deal with it, this will derail Trump’s narrative for the 2020 election. It appears that Trump figures that maybe just maybe, he can pretend it is not an issue just long enough to eek out an electoral victory in Nov before the situation gets so bad it is too obvious to ignore. ",
            "date": "Answered May 31, 2020",
            "views": "76",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Judy Kaelin",
                    "user_href": "/profile/Judy-Kaelin"
                },
                {
                    "user_id": "Nick Thornhill",
                    "user_href": "/profile/Nick-Thornhill-2"
                },
                {
                    "user_id": "Dennis Robison",
                    "user_href": "/profile/Dennis-Robison-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marianne Litton",
                "href": "/profile/Marianne-Litton"
            },
            "answer_text": "There are people in the country that believe the Sandy Hook schooling never happened. They are what is known as paranoid conspiracy theorist. Alex Jones followers I would imagine. We have a lot of people in this country that are close to illiterate and believe everyone is out to get them. They will listen to the craziest of tales and never verify any of the nonsense they hear to find out if it is indeed true or not. These people are also Trump supporters and believe anything he or people like Rush Limbaugh have to say. It is scary sad. ",
            "date": "Answered April 19, 2020",
            "views": "897",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Derrufo Konepke",
                    "user_href": "/profile/Derrufo-Konepke"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suzy McKee Charnas",
                "href": "/profile/Suzy-McKee-Charnas"
            },
            "answer_text": "They don’t think they need to justify it. Their Dear Leader told them it was a hoax back at the start of all this, and their mental denseness is such that it’s impossible for them to move beyond that point, so they just keep repeating his endless, groundless, useless babble like babies saying “DaDaDa!” My advice? Ignore these people. Better to go make friends with rocks; at least they don’t jabber nonsense because their brains have congealed. Rocks are quiet. That’s a virtue. ",
            "date": "Answered April 20, 2020",
            "views": "506",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Parich Tangmatitam",
                    "user_href": "/profile/Parich-Tangmatitam"
                },
                {
                    "user_id": "Bluewater Family",
                    "user_href": "/profile/Bluewater-Family"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Leger",
                "href": "/profile/Richard-Leger-3"
            },
            "answer_text": "I never copy/paste my answers, but I do link to them: Richard Leger's answer to How do you feel that the social media giants openly admit they censor opinions they disagree with and label it as against community standards? The virus is real, but the reasons for its release and actions currently taking place are not as advertised. If anyone is too lazy to follow the link, then they are not looking for an answer in the first place, so no loss, and my writing an answer here would not have been of any use to them. See my comment to Don Ouchy’s answer below for more information. Don Ouchy's answer to I keep hearing of deceased patients being falsely written off as a Covid death. I had initially ignored it and thought it was just a conspiracy theory but I'm finding it harder and harder to ignore now. Why is this happening? ",
            "date": "Answered August 22, 2020",
            "views": "99",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Paul Cager",
                    "user_href": "/profile/Paul-Cager"
                },
                {
                    "user_id": "Steve Penland",
                    "user_href": "/profile/Steve-Penland"
                },
                {
                    "user_id": "Lennie Binale",
                    "user_href": "/profile/Lennie-Binale"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeno M. Vann",
                "href": "/profile/Jeno-M-Vann"
            },
            "answer_text": "Why do some people say that the COVID-19 pandemic is all a political hoax or overhyped? It may be because of statistics like these where during the time the death rate was lied to us. Everybody can have covid but its asymptomatic all of a sudden. First its an airborne threat then it's just a virus that stays alive on surfaces for a week now it airborne again. People are fed up.    ",
            "date": "Answered June 7, 2020",
            "views": "136",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bob Adams",
                    "user_href": "/profile/Bob-Adams-154"
                },
                {
                    "user_id": "Bob McCown",
                    "user_href": "/profile/Bob-McCown-1"
                },
                {
                    "user_id": "Deb Headley",
                    "user_href": "/profile/Deb-Headley"
                },
                {
                    "user_id": "Andrew Ruoff",
                    "user_href": "/profile/Andrew-Ruoff-1"
                },
                {
                    "user_id": "Eloy Montiel",
                    "user_href": "/profile/Eloy-Montiel"
                },
                {
                    "user_id": "Alan Edmonson",
                    "user_href": "/profile/Alan-Edmonson"
                },
                {
                    "user_id": "Alex Koren",
                    "user_href": "/profile/Alex-Koren-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Keith Higgins",
                "href": "/profile/Keith-Higgins-34"
            },
            "answer_text": "A large segment of Americans have lost all faith is the reliability of media reports referred to by Donald Trump as “FAKE NEWS.” Additionally many Americans continuously see important issues politicized to support the agenda of liberals, conservatives or the President. Finally, there is a growing segment of the American public that is literally addicted to conspiracy theories. These conspiracy theories circulate on social media and their adherents grow in numbers while the theories themselves are constantly evolving. Recently a conspiracy theory circulating on the internet is the Corona Virus vaccine will contain a microchip in it. Finally, people hear what they want to hear and see what they want to see in the news. ",
            "date": "Answered June 1, 2020",
            "views": "64",
            "upvotes": " Answer requested by Laura Legge",
            "upvoters": [
                {
                    "user_id": "Ken Bothwell",
                    "user_href": "/profile/Ken-Bothwell"
                },
                {
                    "user_id": "John Morris",
                    "user_href": "/profile/John-Morris-856"
                },
                {
                    "user_id": "Deb Headley",
                    "user_href": "/profile/Deb-Headley"
                },
                {
                    "user_id": "Lois Wright",
                    "user_href": "/profile/Lois-Wright-16"
                },
                {
                    "user_id": "Alan Edmonson",
                    "user_href": "/profile/Alan-Edmonson"
                },
                {
                    "user_id": "Alex Koren",
                    "user_href": "/profile/Alex-Koren-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Helene Disantos",
                "href": "/profile/Helene-Disantos"
            },
            "answer_text": "The tend to be deniers, conspiracy theorists, Trump followers, ignorant or just don't know anyone who has this virus, nor are they usually readers. You will hear “well there are 50,000 + flu deaths every year and nobody closes down for that”. For all my years of practice , mainly geriatric, I don't recall any of my patients dying of the flu. Therefore I am skeptical of these numbers. ",
            "date": "Answered June 7, 2020",
            "views": "78",
            "upvotes": " Answer requested by Laura Legge",
            "upvoters": [
                {
                    "user_id": "Nick Thornhill",
                    "user_href": "/profile/Nick-Thornhill-2"
                },
                {
                    "user_id": "Alex Koren",
                    "user_href": "/profile/Alex-Koren-3"
                },
                {
                    "user_id": "C. Wieprecht",
                    "user_href": "/profile/C-Wieprecht"
                },
                {
                    "user_id": "Joy Nicole",
                    "user_href": "/profile/Joy-Nicole-13"
                },
                {
                    "user_id": "Alan Edmonson",
                    "user_href": "/profile/Alan-Edmonson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dwight Wascom",
                "href": "/profile/Dwight-Wascom"
            },
            "answer_text": "In the beginning of the first virus awareness in the US officials were told that the Corona Virus was the flu. There was even disagreement as to what to name this virus. It was also told that young people don't have to worry and children are immuned. This was an old folks disease. That the virus came from China but actually reversed course and came to New York from Europe. That masks were actually worthless. That the virus is transmitted by touching and rubbing eyes, nose, mouth, ears from exposed surfaces. And for several months no warnings were given out at all These bogus messages made folks very suspicious when leaders kept changing informed information, suspicious and rightly so. ",
            "date": "Answered May 31, 2020",
            "views": "66",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sarah Lascelles",
                "href": "/profile/Sarah-Lascelles-1"
            },
            "answer_text": "Why do some people claim that vaccines cause autism, or that the earth is flat, or that the moon landings were fake? Some people think 5g causes c19, even though it uses the same frequencies as analogue TV. Some people like to believe ridiculous conspiracy theories, and somehow never write work out that the likelihood of literally every political leader and civil servant in the world all agreeing to keep quiet about something is so low as to be non existent. ",
            "date": "Answered May 31, 2020",
            "views": "89",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Charlie Richmond",
                    "user_href": "/profile/Charlie-Richmond-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Davis Appleton",
                "href": "/profile/Davis-Appleton"
            },
            "answer_text": "There seems to be an alarmingly large portion of US conservatives, mostly Republicans, who are completely divorced from all reality. The will believe whatever bizarre conspiracy theory the right-wing media makes up. For example, one of those sites made up that the Democratic Party was running a child prostitution ring out of a pizza shop. One of the followers of that site then went there and shot the place up. Pizzagate conspiracy theory - Wikipedia ",
            "date": "Answered April 19, 2020",
            "views": "771",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Priya Patil",
                    "user_href": "/profile/Priya-Patil-10"
                },
                {
                    "user_id": "Max thomson",
                    "user_href": "/profile/Max-thomson-16"
                },
                {
                    "user_id": "Suhas S",
                    "user_href": "/profile/Suhas-S-124"
                },
                {
                    "user_id": "Gerry Glauser",
                    "user_href": "/profile/Gerry-Glauser"
                },
                {
                    "user_id": "Raymond Khoury",
                    "user_href": "/profile/Raymond-Khoury-5"
                },
                {
                    "user_id": "Charles Knouse",
                    "user_href": "/profile/Charles-Knouse-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Schustack",
                "href": "/profile/Dan-Schustack-1"
            },
            "answer_text": "Normal people don’t say those things. Only people who are angry because it has demonstrated Trump’s lack of leadership ability, ability to empathize lie a normal person, and they can’t accept that in the real world; things like this actually happen. Life has been good for a long time for a lot of people. Now, it’s gong to be real interesting; to put it politely. But at least; it’s give the class of 2020 the right to tell every other generation we survived our challenge. And we did it even with Trump as president. ",
            "date": "Answered May 25, 2020",
            "views": "316",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tom Russe",
                "href": "/profile/Tom-Russe"
            },
            "answer_text": "Primarily a comment that COVID-19 is a hoax, is repeating a political answer started by an individual who thinks he has more knowledge than he does. You see similar comments about global warming. A political justification is what it is, politics. Since science is harder to understand and you need more of a basis to understand it, a political answer is often chosen because it is easier and it is said by a person better known to the public. ",
            "date": "Answered April 19, 2020",
            "views": "1",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Paul Cager",
                    "user_href": "/profile/Paul-Cager"
                },
                {
                    "user_id": "Steve Penland",
                    "user_href": "/profile/Steve-Penland"
                },
                {
                    "user_id": "Matt Bahr",
                    "user_href": "/profile/Matt-Bahr-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Fletcher",
                "href": "/profile/John-Fletcher-226"
            },
            "answer_text": "Because Trump says so and he knows more than most people about virology ( and business, and military strategies, and finance, and construction, and golf, and history, and the US constitution, and diplomacy etc by his own admission). I doubt he would have beaten Kim Jong-sun at golf however who scored 8 holes in one on the very first game he ever played. This was witnessed by thousands of loyal subjects and was featured on N. Korean TV. ",
            "date": "Answered April 19, 2020",
            "views": "814",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joel Gehrke",
                "href": "/profile/Joel-Gehrke"
            },
            "answer_text": "The prevailing defensible suspicion is that the deaths caused by and credited to the corona virus are inordinately a function of a financial compensation structure rewards death attributed to COVID 19; which has led to perverted official incentives to (1) target immuno naive, elderly people for exposure to the virus, thus spiking mortality, coextensive with (2) a bias towards promiscuous attribution of non-COVID 19 mortalities to COVID 19. Thus we are seeing a majority of mortalities occurring in nursing homes. ",
            "date": "Answered May 31, 2020",
            "views": "68",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Salvatore Barrera",
                "href": "/profile/Salvatore-Barrera"
            },
            "answer_text": "Right now, there is too, too much dissemination of disinformation, fake-news and even propaganda, especially within the conspiracy theories that are proliferating continuously 24 hours a day. But, how did the 800,000 victims of COVID-19 perish ? Were they strategically killed to reduce the global populations ? If so, then where are they hiding..maybe under different names in various countries of the world ? It does not make sense..unless we see verifiable, confirmable evidence of this hoax, I will surely state that it is NOT a hoax because by now, someone would have talked. ",
            "date": "Answered August 22, 2020",
            "views": "204",
            "upvotes": " Answer requested by Anne Varvel",
            "upvoters": [
                {
                    "user_id": "Dan Lauffer",
                    "user_href": "/profile/Dan-Lauffer"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Beatty",
                "href": "/profile/John-Beatty-25"
            },
            "answer_text": "Because the threat is overblown, overwrought, and over-played in the media. Already CDC is walking back their earlier pronouncements on how long it lasts on surfaces, and some even have questioned if airborne transmission over three feet is possible. And don't forget those infallible “activists” exercising their rights to burn down what they see fit…not many masks there…very little social distancing in those mobs. ",
            "date": "Answered May 31, 2020",
            "views": "95",
            "upvotes": " Answer requested by Laura Legge",
            "upvoters": [
                {
                    "user_id": "Gerald Tomyn",
                    "user_href": "/profile/Gerald-Tomyn"
                },
                {
                    "user_id": "Anne Varvel",
                    "user_href": "/profile/Anne-Varvel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bernard Peter Gore",
                "href": "/profile/Bernard-Peter-Gore"
            },
            "answer_text": "The majority who think this are using the only “evidence” they pay any attention to - “Trump said it on Fox News, so it must be true”. I know that Trump didn’t say precisely that it was a hoax, but what he did say was clearly intended to suggest that to his followers. ",
            "date": "Answered April 22, 2020",
            "views": "104",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Francine Rizza",
                    "user_href": "/profile/Francine-Rizza"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jess H. Brewer",
                "href": "/profile/Jess-H-Brewer-3"
            },
            "answer_text": "Their Tweeter-in-Chief said it was! He said the opposite later, but those who have pledged their loyalty to him just store up all his declarations and use the ones most convenient at any given time. Once you abandon truth, consistency is easy to ignore! ",
            "date": "Answered April 22, 2020",
            "views": "183",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tim McKenna",
                    "user_href": "/profile/Tim-McKenna-30"
                },
                {
                    "user_id": "Anne Varvel",
                    "user_href": "/profile/Anne-Varvel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Clifford Wright",
                "href": "/profile/Clifford-Wright-8"
            },
            "answer_text": "Be cause they “Believe” in clown POTUS, or big daddy god or that the guvimint is out to get them. Or of course that they agree with Candide that NOTHING bad can happen to them. Or indeed they have already found the “off” switch to their brains despite wearing a tinfoil hat with “make America Great again” on the front. ",
            "date": "Answered June 7, 2020",
            "views": "49",
            "upvotes": " Answer requested by Laura Legge",
            "upvoters": [
                {
                    "user_id": "Marvin Escobar",
                    "user_href": "/profile/Marvin-Escobar-1"
                },
                {
                    "user_id": "Dave Johnson",
                    "user_href": "/profile/Dave-Johnson-269"
                },
                {
                    "user_id": "Karal Daskin",
                    "user_href": "/profile/Karal-Daskin"
                },
                {
                    "user_id": "Dave Cameron",
                    "user_href": "/profile/Dave-Cameron-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Keith H. Burgess",
                "href": "/profile/Keith-H-Burgess"
            },
            "answer_text": "It can’t possibly be a hoax Ann, but some people just have to go against something, anything to try & prove that they have a strong will & personal power. They will reject anything, especially if it is mandatory.Look at anthropogenic global warming & climate change, the ice sheets & permafrost are melting, people are dying in heatwaves, there are prolonged droughts, floods, extreme cold, stronger storms, more devastating cyclones, the sea is rising & displacing people, we are seeing climate refugees by the thousands & yet the world is still burning fossil fuels. Keith. ",
            "date": "Answered August 23, 2020",
            "views": "32",
            "upvotes": " Answer requested by Anne Varvel",
            "upvoters": [
                {
                    "user_id": "Jean Wright",
                    "user_href": "/profile/Jean-Wright"
                },
                {
                    "user_id": "Prudence Beltz",
                    "user_href": "/profile/Prudence-Beltz"
                },
                {
                    "user_id": "Mike Nolan",
                    "user_href": "/profile/Mike-Nolan-82"
                },
                {
                    "user_id": "Dave Cameron",
                    "user_href": "/profile/Dave-Cameron-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Guy Rich",
                "href": "/profile/Guy-Rich-9"
            },
            "answer_text": "Because they are ill-educated simpletons. They believe ill-educated simpletons. They are part of a social movement that worships belief over evidence, authority (as long as it’s not intellectual or scientific) over democracy, themselves over others. They believe that they can believe away unpleasant things, or things that they don’t prefer. When faced with disagreement, or when a democratic majority disagrees with them, they pull out guns. We’ve seen that play out before. Now we are repeating it. ",
            "date": "Answered May 31, 2020",
            "views": "54",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jaquan Rice",
                    "user_href": "/profile/Jaquan-Rice-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thomas Musselman",
                "href": "/profile/Thomas-Musselman"
            },
            "answer_text": "There is no way to know what Trump means when he uses the word “hoax”; he doesn’t mean what the word normally means in English. He seems to use it to mean something like “facts I don’t like since they make me look bad”. I don’t think he literally means that people are planting evidence around the world, or that they are killing hundreds of thousands of people in some other way. But you’d have to ask him and actually get an answer, and that isn’t going to happen. ",
            "date": "Answered August 22, 2020",
            "views": "55",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Bo Thompson",
                "href": "/profile/Bo-Thompson-6"
            },
            "answer_text": "There are many ways to manipulate info about the disease, from making spurious claims(super spreaders!) to reporting statistics that hide truth(ie cases reported but not deaths), to labs lying about how many people tested positive. Anyways many people want Trump out and aren’t moral about how they want it done. ",
            "date": "Answered August 22, 2020",
            "views": "71",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Trausti Thor Johannsson",
                "href": "/profile/Trausti-Thor-Johannsson"
            },
            "answer_text": "No. We have so many people sick, and governments of the whole world working together that this is not a hoax. What we do know is that it is highly contaigaious, and some people just get a runny nose why others just plain die. People get organ failures, need to be in respirators for weeks. In Iceland, a country of just 360,000, absolutely everyone knows someone who has been sick. It is not a hoax. If someone claims this, remove them from your life, THEY are poisonous. Your life will be much better for it. ",
            "date": "Answered August 22, 2020",
            "views": "98",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Lee McCurtayne",
                "href": "/profile/Lee-McCurtayne-1"
            },
            "answer_text": "These are the people that believe in Roswell and anything Fox News serves them up. Opinion pieces instead of “Real” news. These Two Bit forums are only interested in ratings not furnishing the truth. Well ignore the facts and see what happens. ",
            "date": "Answered June 1, 2020",
            "views": "95",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Mark Roseman",
                "href": "/profile/Mark-Roseman-5"
            },
            "answer_text": "Interviews with non-mask wearers at Trump’s rally in Tulsa say the virus is real, but the effect is grossly exaggerated by the media. It will be interesting to see what happens to those who attended a couple of weeks from now. Tulsa has been a hot spot for infection recently. ",
            "date": "Answered June 21, 2020",
            "views": "56",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Ciccarello",
                "href": "/profile/Mark-Ciccarello"
            },
            "answer_text": "Obviously it can’t be. There are a lot of people out there who are shockingly stupid, however, and there are a lot of scumbags on the right who like to take advantage of them. Sometimes the morons even buy they yachts HA HA HA HA HA!!!! ",
            "date": "Answered August 22, 2020",
            "views": "43",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Arnold",
                "href": "/profile/John-Arnold-89"
            },
            "answer_text": "UFO’s, abominable snowman, lock Ness monster, alien abductions, and you want to know how COVID can be a hoax? ",
            "date": "Answered August 22, 2020",
            "views": "52",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Gunther Martens",
                "href": "/profile/Gunther-Martens-1"
            },
            "answer_text": "Why do some people say white lives don,t matter as much as black lives and some people say the world is flat, the answer is there are a lot of crazy people in the world with a big mouth and a small brain ",
            "date": "Answered June 17, 2020",
            "views": "43",
            "upvotes": " Answer requested by Laura Legge"
        },
        {
            "author_info": {
                "name": "Barry Gehm",
                "href": "/profile/Barry-Gehm"
            },
            "answer_text": "Contempt for “the reality-based community” goes back to at least the Reagan administration, and that's just considering US politics. The ability of humans to deny unwelcome facts is practically limitless. ",
            "date": "Answered June 14, 2020",
            "views": "98",
            "upvotes": " View 4 Upvoters"
        },
        {
            "author_info": {
                "name": "Rick VonderBrink",
                "href": "/profile/Rick-VonderBrink"
            },
            "answer_text": "People also say that the Earth is flat, we never landed on the Moon, and that the Twilight books were good. That doesn’t mean any of them are true. ",
            "date": "Answered June 14, 2020",
            "views": "92",
            "upvotes": " View 4 Upvoters"
        },
        {
            "author_info": {
                "name": "David Henze",
                "href": "/profile/David-Henze-2"
            },
            "answer_text": "Nobody has ever thought it was a hoax. And if you are still one of these idiots that try to convey the Trump hoax narrative, go back and read. ",
            "date": "Answered April 22, 2020",
            "views": "35",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brian Kirkpatrick",
                "href": "/profile/Brian-Kirkpatrick-26"
            },
            "answer_text": "It’s the sense of smell doing it’s job. 1968 flu pandemic | History, Deaths, & Facts And four hundred thousand went to Woodstock! A million dead. Don’t you smell something wafting through the air? Does it remind you of a barnyard? ",
            "date": "Answered May 31, 2020",
            "views": "98",
            "upvotes": " Answer requested by Laura Legge"
        },
        {
            "author_info": {
                "name": "Greg Pfeifer",
                "href": "/profile/Greg-Pfeifer-4"
            },
            "answer_text": "Because the ones in charge that mishandled it from the beginning want to take the attention off of themselves and their party will listen to anything from them now as they are a flock of sheep. ",
            "date": "Answered June 1, 2020",
            "views": "96",
            "upvotes": " Answer requested by Laura Legge"
        },
        {
            "author_info": {
                "name": "Howard Fernandez",
                "href": "/profile/Howard-Fernandez-2"
            },
            "answer_text": "There are a number of reasons: stupidity, gullibility and ignorance not to mention misinformation. ",
            "date": "Answered June 7, 2020",
            "views": "21",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Vincent Bellamy",
                "href": "/profile/Vincent-Bellamy-2"
            },
            "answer_text": "Because they would rather believe trump and his wacky moronic rhetoric and theories ",
            "date": "Answered June 7, 2020",
            "views": "20",
            "upvotes": " Answer requested by Laura Legge"
        },
        {
            "author_info": {
                "name": "Syed Hasan",
                "href": "/profile/Syed-Hasan-157"
            },
            "answer_text": "Syed Hasan's answer to Are stay-at-home orders \"abusive and dictatorial,\" or a rational safeguard response to the pandemic? ",
            "date": "Answered May 31, 2020",
            "views": "29",
            "upvotes": " Answer requested by Laura Legge"
        },
        {
            "author_info": {
                "name": "Lee Lightfoot",
                "href": "/profile/Lee-Lightfoot-4"
            },
            "answer_text": "Who said it was a hoax? ",
            "date": "Answered June 14, 2020",
            "views": "82",
            "upvotes": "0"
        }
    ]
}