{
    "title": "How much lava is inside a dormant volcano? - Quora",
    "tags": [
        "Lava",
        "Volcanology",
        "Volcanoes"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pamela B. Zohar",
                "href": "/profile/Pamela-B-Zohar"
            },
            "answer_text": "None. When lava is inside the surface of the earth, we don’t call it ‘lava’. You are asking about MAGMA, which is molten rock INSIDE the earth’s crust. However, the question ‘how much magma is inside a dormant volcano?’ has the same answer: None. If a dormant volcano has magma in it CURRENTLY, it is not dormant, it is ‘active’. Magma moves. It makes its existence known by that movement within the earth, by earth trembles, and escapes of steam, for instance. Such activity is not characteristic of a ‘dormant’ volcano. Magma also doesn’t exist in actual ‘chambers’ inside the earth. Instead, magma forms as droplets inside rock, which tend to gather and coelesce AS the droplets move - you only have a reasonably body of molten rock when you are actually VERY close to eruption of the volcano, typically. Magma droplets can also more or less sit in place, and if conditions are right for it, the droplets grow in size as the rock surrounding melts and joins the growing magma mass. It will still TRY to move ‘up’ (because liquids are not as massive as rock, so the liquid wants to ‘rise’). Maybe the magma will make it to surface before cooling below the crystallization temperature, or maybe it won’t. If the magma cools to a solid while still underground, it becomes an INTRUSIVE igneous rock. Lava - molten rock that flows out on the surface of the earth (which includes under the ocean on the surface of the ocean floor) becomes EXTRUSIVE igneous rock. Dormant volcanoes are non-active volcanoes which have been non-active for a long time, but not such a long time that we can be REALLY sure they won’t become active once again. A lot of factors go into whether or not that will happen, and we are never QUITE sure of the exact timing. Some volcanoes erupt only after VERY long periods of not-erupting (quiescence) but others seem to erupt on an off practically continuously for decades or hundreds of years, or longer. ",
            "date": "Answered November 22, 2019",
            "views": "85",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pamela Davidson",
                    "user_href": "/profile/Pamela-Davidson-1"
                },
                {
                    "user_id": "Shelama Leesen",
                    "user_href": "/profile/Shelama-Leesen"
                },
                {
                    "user_id": "Diego Velasco",
                    "user_href": "/profile/Diego-Velasco-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gregory Benson",
                "href": "/profile/Gregory-Benson-5"
            },
            "answer_text": "How much lava is inside a dormant volcano? Sometimes, none at all. Or a lot. It depends how recently the volcano was active and how thoroughly the eruption cleared the magma chamber. But remember, “dormant” means “sleeping”. They can violently awaken pretty quickly if a new pulse of rising magma approaches the surface, or a landslide lightens the overburden on a chamber. ",
            "date": "Answered November 21, 2019",
            "views": "39",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jeanne Paquette",
                    "user_href": "/profile/Jeanne-Paquette-1"
                }
            ]
        }
    ]
}