{
    "title": "How to improve my science - Quora",
    "tags": [
        "Skills",
        "Computer Science Education",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Akash Agrawal",
                "href": "/profile/Akash-Agrawal-364"
            },
            "answer_text": "As you want to improve science.First of all i want to say that it is not a literature subject or maths which can improve by regular practice or by regular reading.I think science is a fell when you fell that emotion of connection with nature and the reasons of every phenomena. I will suggest some way according to your choice .In which sense 1.if you wnt to increase your marks then.:- 1.read your referd text books only. 2.listen teacher lecture and vedio lecutres which clear your dobuts. 3.make your hand written note which help you jn exam time revision. 4.complete your experiment in labs which increAse your science. I think it is enough to increase marks. 2.if you really want to improve your science approch then;- 1.try to found question around you. 2.answer them with own capacity and try to check it by finding them in internet,books,etc. 3.try to do and find example of theroms and law in your particle life. 4.relate every event with science. 5.read science fiction novel and other magazine which increase your interest for science. 6.never give up. Thanxx i hope you will find a good solutions by may answer ",
            "date": "Answered February 16, 2019",
            "views": "11",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Esnailarge Kwari",
                    "user_href": "/profile/Esnailarge-Kwari"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Jiaying2008-Jiaying"
                },
                {
                    "user_id": "Athena Mai",
                    "user_href": "/profile/Athena-Mai-3"
                },
                {
                    "user_id": "Rohan Verma",
                    "user_href": "/profile/Rohan-Verma-123"
                }
            ]
        },
        {
            "author_info": {
                "name": "András Jónás",
                "href": "/profile/András-Jónás"
            },
            "answer_text": "Try to be very rational and honest with yourself and towards your work or studies. Never assume, unless you are deliberately theoretizing. Check facts. Do not “believe” but “make sure”. Don’t judge in a superficial manner. Check and double check. Ask for peer review/opinion. Show humility. Realize that the more you learn the less you know as more and more things come into view that you are ignorant about. Realize that only certain aspects of knowledge may open to you but of that you will possess thorough understanding. Let your knowledge be shaped by new understanding entering the field. Don’t accept it blindly but also don’t dismiss it off hand smugly. If you can do this, you can be one of the most knowledgeable in the field of your choice. Albeit it’s part of honesty and humility: don’t forget to acknoledge other’s works. Finding valuable works is just as valuable as coming up with them. ",
            "date": "Answered August 28, 2018",
            "views": "452",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marta Zawadzka",
                "href": "/profile/Marta-Zawadzka"
            },
            "answer_text": "Try to read some popular science articles and websites in your free time instead of browsing your facebook feed, watching tv series etc. It will “improve your science”, but it won’t be too boring to be made on regular basis and you won’t get discouraged too quickly. Remember, cosequence is the key to success! ",
            "date": "Answered September 7, 2016",
            "views": "308",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Manoj Kumar",
                    "user_href": "/profile/Manoj-Kumar-25027"
                },
                {
                    "user_id": "Jimmy Will",
                    "user_href": "/profile/Jimmy-Will-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mahendra Nandanwar",
                "href": "/profile/Mahendra-Nandanwar-1"
            },
            "answer_text": "To improve scientific understanding, first step is to ask questions. Question about everything you come across. Inculcate the habit of asking questions, particularly ‘why’ type questions. Also, don’t just stop with questioning. You also have to try to find out the answers yourself if you are not getting satisfactory answers from anyone. Remember, first step of learning is to know what we don’t know. ",
            "date": "Answered September 7, 2016",
            "views": "470",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Manoj Kumar",
                    "user_href": "/profile/Manoj-Kumar-25027"
                },
                {
                    "user_id": "Sagar Mahadik",
                    "user_href": "/profile/Sagar-Mahadik-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Crk Shamli",
                "href": "/profile/Crk-Shamli"
            },
            "answer_text": "If you have a Tuition then it good follow your teacher instructions and if you don't have then first do hard chapter ex for class 10 it is carbon and compound then do it first and take your self test by solving only 1 or 2 mark question . And if you bored then see your chapter on YouTube which entertain you also ",
            "date": "Answered February 14, 2019",
            "views": "183",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Yit Chin Chuan",
                "href": "/profile/Yit-Chin-Chuan"
            },
            "answer_text": "By....Continuing to ask questions.Continuing to studyContinuing to do research and experimentation.Continuing to think about things and trying to figure things out. ",
            "date": "Answered May 13, 2015",
            "views": "342",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ayman Elshawaf",
                    "user_href": "/profile/Ayman-Elshawaf"
                },
                {
                    "user_id": "Brian Blood",
                    "user_href": "/profile/Brian-Blood-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Guneet Kaur",
                "href": "/profile/Guneet-Kaur-160"
            },
            "answer_text": "Which field you want to study? study that field deeply you have to rely on your intuition on which level you are. Are you studying deeply or not. rest is all up to you just study that subject deeply. rest is up and hard work and your guts. Remember there is n best way to study if you want make one of your on. ",
            "date": "Answered November 16, 2017",
            "views": "137",
            "upvotes": "0"
        }
    ]
}