{
    "title": "How are the chemical properties of atoms related to the structure of an atom? - Quora",
    "tags": [
        "Atomic Structure",
        "Physics and Chemistry",
        "Atomic Physics",
        "Atoms",
        "Science",
        "Chemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Annie Cielo Mader",
                "href": "/profile/Annie-Cielo-Mader-2"
            },
            "answer_text": "How does atomic structure produce chemical properties? Atomic structure, specifically the number and arrangement of electrons in shells and orbitals, determines chemical properties of an atom - whether the atom will lose, gain, or share electrons with other atoms to become stable.  The electron shell diagram models the arrangement of electrons of an atom.  The number and arrangement of electrons in the outermost shell, or valence shell, produce chemical properties of an atom. Atoms with filled valence shells are stable. Examples of stable atoms are:  Helium (He) with 2 valence electrons in the first shell. Neon (Ne) with 8 valence electrons in the second shell . Atoms with less than eight valence electrons tend to lose, gain, or share electrons with other atoms to have 8 valence electrons and become stable. There are, of course, exceptions to this \"Octet Rule\". Na has 1 valence electron. Na loses this electron (or Na is oxidized) and becomes the stable cation Na+ with 8 valence electrons. Na+ is the most abundant cation in seawater and extracellular fluid.  Source: Electron_shell_011_Sodium.svg (https://commons.wikimedia.org/wiki/File:Electron_shell_011_Sodium.svg): Pumbaa (original work by Greg Robson)derivative work: Egmontaz Cl has 7 valence electrons. Cl gains 1 electron (or Cl is reduced) and becomes the stable anion Cl- with 8 valence electrons. Cl- is the most abundant anion in seawater and extracellular fluid.  Source: Electron_shell_017_Chlorine.svg (https://commons.wikimedia.org/wiki/File:Electron_shell_017_Chlorine.svg): Pumbaa (original work by Greg Robson) derivative work: Egmontaz C has 4 valence electrons. C neither gains nor loses electrons. Instead, C shares electrons with other atoms to fill its valence shell with 8 electrons.  Source: Electron_shell_006_Carbon.svg (https://commons.wikimedia.org/wiki/File:Electron_shell_006_Carbon.svg): Pumbaa (original work by Greg Robson)derivative work: Kizar The shared pair of electrons stabilizes and \"bonds\" both atoms. This chemical bond is called covalent bond. Atoms joined by covalent bonds form a molecule. Covalent bonds are shown as dashes in the structural formula of a molecule. Example: methane (CH4).  Source: NEUROtiker The following properties are NOT chemical properties. They do not involve changes in  number and arrangement of electrons of an atom. Sodium melts (solid to liquid) at 98°C. Kinetic energy of atoms increase and overcome attractive forces that hold them in the solid state.  Melting point is a physical property. Carbon-14 undergoes radioactive decay (neutron transformed into a proton, electron, and electron antineutrino) and forms nitrogen-14. The number of protons (atomic number) changes from 6 to 7. Radioactivity is a nuclear property. Chemical reaction (or chemical change), physical change, nuclear reaction: Chemical reaction or chemical change: Oxidation, reduction, making and breaking covalent bonds involve change in the number and arrangement of valence electrons. There is no change in the number of protons. Physical change: Melting, boiling involve change in kinetic energy of particles (atoms, molecules, ions), attractive forces between particles that hold them in the solid or liquid phase. There is no change in the number of protons. There is no change in the number and arrangement of electrons. Covalent bonds are not made nor broken. Nuclear reaction: Radioactive decay involves change in the number of protons. An element is transformed into a different kind of element. ",
            "date": "Answered March 5, 2016",
            "views": "119",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ashna Jones",
                    "user_href": "/profile/Ashna-Jones-1"
                },
                {
                    "user_id": "Karen Huntley",
                    "user_href": "/profile/Karen-Huntley-10"
                },
                {
                    "user_id": "Tavga Dargali",
                    "user_href": "/profile/Tavga-Dargali-1"
                },
                {
                    "user_id": "Malay K. Jha",
                    "user_href": "/profile/Malay-K-Jha"
                },
                {
                    "user_id": "Prashant Talreja",
                    "user_href": "/profile/Prashant-Talreja-6"
                },
                {
                    "user_id": "Tanmay Pati",
                    "user_href": "/profile/Tanmay-Pati-8"
                },
                {
                    "user_id": "Monesh",
                    "user_href": "/profile/Monesh-8"
                },
                {
                    "user_id": "Injamamul Haque Mondal",
                    "user_href": "/profile/Injamamul-Haque-Mondal"
                },
                {
                    "user_id": "Roosevelt Wallace",
                    "user_href": "/profile/Roosevelt-Wallace"
                },
                {
                    "user_id": "Jason Tyan",
                    "user_href": "/profile/Jason-Tyan"
                },
                {
                    "user_id": "Ben Llave Mader",
                    "user_href": "/profile/Ben-Llave-Mader"
                },
                {
                    "user_id": "Edward Claro Mader",
                    "user_href": "/profile/Edward-Claro-Mader"
                }
            ]
        },
        {
            "author_info": {
                "name": "Caitlin Sturt",
                "href": "/profile/Caitlin-Sturt"
            },
            "answer_text": "Hey, Atoms form the foundation of chemistry and everything else that exists in the universe. Every matter is composed of densely packed atoms.  ",
            "date": "Answered November 1, 2019",
            "views": "572",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Grecy Jonson",
                    "user_href": "/profile/Grecy-Jonson"
                },
                {
                    "user_id": "Peter Clarke",
                    "user_href": "/profile/Peter-Clarke-242"
                },
                {
                    "user_id": "Gracie Anderson",
                    "user_href": "/profile/Gracie-Anderson-16"
                }
            ]
        }
    ]
}