{
    "title": "How are cathode rays produced? - Quora",
    "tags": [
        "Cathode Ray",
        "Electrochemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Wicida Sarme",
                "href": "/profile/Wicida-Sarme"
            },
            "answer_text": "Cathode rays are produced inside a vacuum tube using a positively charged element called “cathode” on the neck end of the tube and a High voltage negatively charged “anode” at the opposite face end of the tube… When the cathode element is heated, it produces positively charged ions, which are attracted by the high voltage negative potential existing on the anode’s coated face plate… As the electron beams travel between the cathode and the anode plate, they passes in between two other charge bodies called deflection plates which forces the beams to move and be deflected depending on how much the deflection plates are energized /charged.. In a sense the deflection plates influence the ions to move in certain directions before they hit the phosphor coated anode… The cathode to anode can be the equivalent of horizontal sweeps, while the deflection plates causes the vertical sweep..in my perspectives… Like painting the x-y axis onto the face of the tube.. ",
            "date": "Answered January 10, 2018",
            "views": "55",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ajay Kumar",
                    "user_href": "/profile/Ajay-Kumar-8720"
                },
                {
                    "user_id": "Emmanuel Oruamen",
                    "user_href": "/profile/Emmanuel-Oruamen"
                },
                {
                    "user_id": "Rüzgar Mavi Çakın",
                    "user_href": "/profile/Rüzgar-Mavi-Çakın"
                },
                {
                    "user_id": "Hanii Hanii",
                    "user_href": "/profile/Hanii-Hanii-1"
                },
                {
                    "user_id": "Sundas Ali",
                    "user_href": "/profile/Sundas-Ali-9"
                },
                {
                    "user_id": "Shamsuddeen Baba Ahmad",
                    "user_href": "/profile/Shamsuddeen-Baba-Ahmad"
                },
                {
                    "user_id": "Samuel Faruna",
                    "user_href": "/profile/Samuel-Faruna"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Hassig",
                "href": "/profile/William-Hassig"
            },
            "answer_text": "A heating element, usually operating on 6 volts AC, heats a cathode red hot which drives electrons off the surface of the cathode. High positive voltages on various grids and elements in the tube attract and accelerate the electrons toward the phosphor coated glass screen. In the case of an oscilloscope, several thousand volts are applied to the inside of the screen while various voltages applied to grids focus the beam and deflection plates move the beam up and down and back and forth. In the case of a TV set or computer monitor, deflection coils on the outside of the tube move the beam around while up to 30,000 volts are applied to the inside of the screen. In the case of TV, most of the programming is a waste of time and electric power. ",
            "date": "Answered October 4, 2018",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shamsuddeen Baba Ahmad",
                    "user_href": "/profile/Shamsuddeen-Baba-Ahmad"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vinod Gohel",
                "href": "/profile/Vinod-Gohel"
            },
            "answer_text": "The stream of electrons in cathode ray tube constitutes the cathode rays. Electrons are emitted by hot filament by the process of thermionic emission. These electrons pass through controlling and focusing device . They are accelerated by applying appropriate voltage between cathode and anode and finally made incident on a flourascent screen after passing through cross electric and magnetic fields. ",
            "date": "Answered December 28, 2017",
            "views": "39",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shamsuddeen Baba Ahmad",
                    "user_href": "/profile/Shamsuddeen-Baba-Ahmad"
                },
                {
                    "user_id": "Magret Kabanyoro",
                    "user_href": "/profile/Magret-Kabanyoro"
                },
                {
                    "user_id": "Sharda Kriti",
                    "user_href": "/profile/Sharda-Kriti"
                },
                {
                    "user_id": "Nitin Kumar",
                    "user_href": "/profile/Nitin-Kumar-1762"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ethan Rambacher",
                "href": "/profile/Ethan-Rambacher"
            },
            "answer_text": "Cathode rays are produced when a high voltage is applied between two terminals in a low-pressure environment. In this low pressure, it is easier for the electrons to flow from the negative terminal and form a beam of negatively charged electrons, which can be bent, or deflected, by magnetic fields and electric fields. ",
            "date": "Answered May 16, 2016",
            "views": "28",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sakina Sultana",
                    "user_href": "/profile/Sakina-Sultana-4"
                },
                {
                    "user_id": "Jyoti Madaan",
                    "user_href": "/profile/Jyoti-Madaan-6"
                },
                {
                    "user_id": "Nidhi Sharma",
                    "user_href": "/profile/Nidhi-Sharma-571"
                }
            ]
        },
        {
            "author_info": {
                "name": "Felix Yu",
                "href": "/profile/Felix-Yu-13"
            },
            "answer_text": "Cathode rays occur when a high voltage is applied across a vacuumed tube. The electrons will then jump across the space in order to reach a lower electrical potential. The electrons have enough energy to jump across the gap, and hence will “complete the circuit” despite a lack of conductors. You can see the description on the Wikipedia article (Cathode ray). ",
            "date": "Answered May 28, 2016",
            "views": "27",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Fayyaz Ghufran",
                    "user_href": "/profile/Fayyaz-Ghufran"
                },
                {
                    "user_id": "Bhavana Sitaphale",
                    "user_href": "/profile/Bhavana-Sitaphale"
                }
            ]
        },
        {
            "author_info": {
                "name": "Junaid Ali",
                "href": "/profile/Junaid-Ali-32"
            },
            "answer_text": "As soon as there is an electric discharge  in a gas enclosed tube at low pressure such as  The electrons rushing away from cathode were named cathode rays. For details visit: J.J. Thomson's Cathode Ray Tube (CRT): Definition, Experiment & Diagram - Video & Lesson Transcript | Study.com ",
            "date": "Answered December 11, 2016",
            "views": "53",
            "upvotes": "0"
        }
    ]
}