{
    "title": "How is technology affecting society? - Quora",
    "tags": [
        "Society"
    ],
    "response": [
        {
            "author_info": {
                "name": "Clifton Middleton",
                "href": "/profile/Clifton-Middleton"
            },
            "answer_text": "They are one in the same, everything is technology, method, technique and infrastructure, even how we feel and think is high science. We can start with the physical world, the railroads. The development of railroads is a great example of the interdependence of human activity and science, of technology and society. We built a railroad across an unexplored land mass with mountains, rivers and deserts. What followed was society, just as necessity leads invention, technology leads, leads society. Societies are defined by their technologies both physical and social. Religions are wordical technologies used to control the emotions of people. Politics use the psychology of fear, honed to a science, it is technology. I think what you asking deserves a modern example, something like, ‘Is the technology of social media having a dangerous effect on society?’ Is it ruining and changing the world? And the answer is Yes, the Internet is changing everything that uses it and will ultimately be instrumental in changing everyone, forever. But is this change based on Free Will or are the Elite rulers of technology controlling what we see and thus what we think, just to make money? We had an election that was influenced by technology, now what? Whatever technology makes possible will be done, good and bad. And now get ready for the Mother of all Changes. The WWW makes it possible for the whole world to hear and receive the same message, without the filters of Established Thought and respond with Massive and Sovereign Agreement. The power of billions of people all over the World, hearing and agreeing to an Idea, the same Idea would create a spiritual, psychological Tsunami of Change. The buzz will throw everyone into a high energy revival of human potential. We can change Consensus Reality in the twinkling of an Eye. Whatever we agree to will manifest and becomes reality before it even exists. The message will be Universal Birthright. Hard Seed ",
            "date": "Answered October 15, 2018",
            "views": "13",
            "upvotes": "0"
        }
    ]
}