{
    "title": "How can calculate density? - Quora",
    "tags": [
        "Density (physics)",
        "Mathematics and Physics"
    ],
    "response": [
        {
            "author_info": {
                "name": "José Luis Giordano",
                "href": "/profile/José-Luis-Giordano"
            },
            "answer_text": "You have to be more careful when using density d = mass/volume = m/V. In first place: the formula to calculate the density \"d\" ... OF WHAT ? The DENSITY d OF THE MATERIAL OF A SOLID HOMOGENEOUS BODY AND WITHOUT HOLES indeed is d = m / V, the quotient between the mass m and the volume V of a piece of that body. But this relationship does not work in all cases. If the body material is NOT HOMOGENEOUS, one must be careful when using d = m / V. The AVERAGE DENSITY OF A BODY, for example, includes the air spaces. A boat floats on water because its AVERAGE density is less than that of water. Clearly before using d = m / V in this case you have to think a little more. Another important example is when in Materials Science and Engineering the density of a pure metal is estimated, assumed with a perfect crystalline structure. The density is also calculated as “d = mass / volume” BUT ... what mass and what volume? the mass is that of all the atoms that are found in each cell that is repeated within the crystalline material, divided by the volume of this cell. IN ADDITION, we must remember that when we talk about using d = m/V many times we measure m weighing in air. Therefore, a CORRECTION is needed. The formula to calculate with more resolution the density of the material of a small body must consider the BOUYANCY that the volume V of the body submerged in air suffers. ",
            "date": "Updated February 11, 2018",
            "views": "54",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Paula Martínez",
                    "user_href": "/profile/Paula-Martínez-1-1"
                },
                {
                    "user_id": "Paulami Maitra",
                    "user_href": "/profile/Paulami-Maitra"
                },
                {
                    "user_id": "Mohit Mittal",
                    "user_href": "/profile/Mohit-Mittal-262"
                },
                {
                    "user_id": "Oskar Stangenberg",
                    "user_href": "/profile/Oskar-Stangenberg"
                },
                {
                    "user_id": "Kurt Heckman",
                    "user_href": "/profile/Kurt-Heckman-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Wilmshurst",
                "href": "/profile/David-Wilmshurst"
            },
            "answer_text": "Standing on the shoulders of those who have gone before. (And myself who keeps answering the same question) Density = mass / volume Now, there are different conditions under which one might be interested in the density. For some materials (eg timber) it can make a big difference. For others (eg gold) it won’t. For example; Oven dried, Saturated, surface dried Boiled However, let us pick the first. Weigh the oven dry specimen. Record the mass M(od) Now, we need the volume. There are 2 ways. Determine the 3 principle dimensions and multiply them. This works well for prismatic items. Hopelessly, otherwise. Record the dimensions and the volume V(meas)Weigh the item whilst it is suspended in water (but do, please keep the balance out of the water!!!). Record that weight (note I did not say “mass”) as M(imm). The volume will be V (imm) = (M(od) - M(imm)).Now, the Oven Dry Density = prefix x (M(od) / V(meas) or prefix x (M(od) / V(imm) The prefix is to account for shifting some number of decimal places, due to having weighed in units that do not produce the desired answer. ",
            "date": "Answered October 10, 2017",
            "views": "951",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Craig Cornelius",
                    "user_href": "/profile/Craig-Cornelius"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Boettcher",
                "href": "/profile/James-Boettcher"
            },
            "answer_text": "What factors are used to determine plant density?  I assume you mean how many plants to seed, or set, average per area of planting bed. There are a number of factors to consider: First: What are you growing? How big is the plant at maturity? How tall? How big is the root zone? Are you irrigating? Annual or Perennial? There will always be a limiting factor to growth. Plants need nutrients, water, sunlight, and space. They need air and doil temperatures within appropriate bounds. They need to be protected from disease, competition from undesirable weed species, and predation. If you plant too thickly, you spend too much on seed, and the plants compete with each other for resources. You plant too thin, and you encourage weeds. Yield goes down. If you are in a very dry climate, and pulling water from the soil to get your crop, as in dry land farming, then you need the plants far apart, and must till and/or mulch to prevent weeds and sun from taking moisture from the soil. Yield is limited by water availability. You have rich, bottom watered or irrigated soil. You are limited by available sunshine. You don't want plants competing with each other for sunlight. Every crop, or ornamental is different. You also need to consider your planting costs, fertilizer, water, labor, etc. If you were trying to plant a hayfield, a wheat field, maize, tomatoes, beans, or trees; they all have different needs. ",
            "date": "Answered December 28, 2019",
            "views": "100",
            "upvotes": " Answer requested by Anthony Hepton",
            "upvoters": [
                {
                    "user_id": "Yashika Lanjewar",
                    "user_href": "/profile/Yashika-Lanjewar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shubham Ekapure",
                "href": "/profile/Shubham-Ekapure"
            },
            "answer_text": "Density is an intensive quantity and so doesn't depend on the amount of matter present. So you can easily use the given results till your secondary school. Density = mass/volume =m/v Now when you move to a higher level of education the above formula is not completely true. For simplicity we assume mass is uniformly distributed hence the above relation works well. In reality density at every point will be different as the mass isn't uniformly distributed. So at any point on our object We will define point density as the ratio of mass of that point and volume occupied by it. D= dm/dv. So this is the general way of calculating it. Say your density comes out to be directly proportional to distance. The mass occupied increases as we move away from our point of reference. Cheers ",
            "date": "Answered September 26, 2018",
            "views": "29",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Uchiha Fahmi",
                    "user_href": "/profile/Uchiha-Fahmi"
                },
                {
                    "user_id": "Jason Cemra",
                    "user_href": "/profile/Jason-Cemra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mehmët Farabi",
                "href": "/profile/Mehmët-Farabi"
            },
            "answer_text": "Keep in your head the formula ; Density = mass/volume Now if it is a solid piece of something , then do the following Take a measuring cylinder, a calibrated onefill some water in it and measure the initial volume , for better accuracy please keep your eye position leveled with the intial watermarkNow weigh your test solid object in a pen balanceDrop it in the measuring cylinder , and you will notice the water level risingNow subtract the initial volume from the final , you get the volume of the solidNow use this super easy formula Density = mass/volume and you will get the density",
            "date": "Answered February 3, 2017",
            "views": "2",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Choco Byte",
                    "user_href": "/profile/Choco-Byte-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Himanshu Satywali",
                "href": "/profile/Himanshu-Satywali"
            },
            "answer_text": "Formula of density D=M/V where D=Density , M=Mass , V=Volume Density is all about the compactness in molecular arrangement in any substance which decides how heavier or lighter any substance is. Density is a characteristic property of a substance. The density of a substance is the relationship between the mass of the substance and how much space it takes up (volume). Density equals the mass of the substance divided by its volume; D = m/v. Objects with the same volume but different mass have different densities. Density is defined as mass per unit volume. Let us Consider ice cubes on the water we could see ice floats on water which tells us that water is denser than ice.  ",
            "date": "Answered October 20, 2018",
            "views": "31",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rajat Rathi",
                    "user_href": "/profile/Rajat-Rathi-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Johan Erasmus",
                "href": "/profile/Johan-Erasmus-1"
            },
            "answer_text": "The formula for density is so simple, to get to the formula requires no real calculations. The formula is just mass per volume. You weigh the object and determine the volume and the decide the mass by the volume. Density = mass/volume. Now determining the volume might require some calculations but if it is a small object like a stone you can put enough water in a measuring jug to cover the object, note the volume, add the object to the jug and the note the new volume. The difference in volume will be the volume of the object. ",
            "date": "Answered January 26, 2017",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Guy Clentsmith",
                "href": "/profile/Guy-Clentsmith"
            },
            "answer_text": "Well, the density of a substance is given by the quotient…  And, for chemists, this quotient gives units of . Condensed phases, i.e. solids, and liquids, have more or less constant density. Gases can have variable density, as a state function of temperature, and pressure… ",
            "date": "Answered July 13, 2019",
            "views": "273",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Maunin Trivedi",
                "href": "/profile/Maunin-Trivedi"
            },
            "answer_text": "Density is mass per unit volume. In simple terms, it is the mass of 1 cubic meter of the substance.  So, to calculate density, we need the mass of the substance in question and it's dimensions.  Once you have those, divide the total mass by its volume. You can calculate the volume once you have the dimensions of the substance in question.  So the answer you get would be the mass of that substance per unit volume.  Take care that the units of all quantities involved are similar, else you'll have the wrong answer. ",
            "date": "Answered November 12, 2015",
            "views": "31",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Michael Vincent",
                    "user_href": "/profile/Michael-ONial"
                },
                {
                    "user_id": "Dusti James Mason",
                    "user_href": "/profile/Dusti-James-Mason"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Baier",
                "href": "/profile/Steve-Baier"
            },
            "answer_text": "Density is equal to the object’s mass divided by it’s volume. Mass can be determined with a balance. Volume of a regular solid can be determined by measuring the appropriate dimensions and using the proper formula for that shape. If the object is irregular in shape, it is usually easier to measure volume submerging the object in a fluid and measuring the displacement. Just remember D=m/V ",
            "date": "Answered June 24, 2018",
            "views": "376",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anton Rzhevskyi",
                "href": "/profile/Anton-Rzhevskyi"
            },
            "answer_text": "Density is ratio of the mass to the volume of the object. So, the steps are Finding the mass of the given object. It can be done in different ways, but you basically need to weight it.Finding the volume of a body. It can be more difficult. If it is a simple geometrical shape, for example, a cube, you can just use known formulas for it. If it has more complex shape, you can put it in a container with a liquid and measure, how much of liquid the body vents. If you don't have the object itself, but it's shape is given by equation, you can use integration.When you got both mass and volume, you just divide one by another and get the density.D=m/V. ",
            "date": "Answered June 16, 2019",
            "views": "219",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Hohimer",
                "href": "/profile/James-Hohimer"
            },
            "answer_text": "First, you weigh it very carefully to the nearest one hundredth of a gram, to derive its mass. Next you find its volume by placing it in a graduated cylinder of water; noting the reading before and after immersion. Its density is grams of mass per cubic millimeter of volume. Make sure to remove all air bubbles adhering to the plant in the cylinder. ",
            "date": "Answered October 12, 2020",
            "views": "27",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "AL AE",
                    "user_href": "/profile/AL-AE-2"
                },
                {
                    "user_id": "Jozef Mitros",
                    "user_href": "/profile/Jozef-Mitros"
                },
                {
                    "user_id": "Rhys Ho",
                    "user_href": "/profile/Rhys-Ho"
                },
                {
                    "user_id": "Obunwa Emelin",
                    "user_href": "/profile/Obunwa-Emelin"
                },
                {
                    "user_id": "Toby Grandjean",
                    "user_href": "/profile/Toby-Grandjean"
                },
                {
                    "user_id": "Yigit Bireroglu",
                    "user_href": "/profile/Yigit-Bireroglu"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Bouman",
                "href": "/profile/John-Bouman-1"
            },
            "answer_text": "The equation for density is D=M/V M=mass V=volume , if the volume is irregular we can use the over flow can method to find the volume a can with a spout is filled up to the spout with water the object displaces the water ,which is collected and its volume measured in a graduate cylinder. The mass can be found on an equal arm balance. ",
            "date": "Answered November 19, 2019",
            "views": "76",
            "upvotes": " Answer requested by Obunwa Emelin",
            "upvoters": [
                {
                    "user_id": "Star King",
                    "user_href": "/profile/Star-King-45"
                },
                {
                    "user_id": "Akhilesh Pal",
                    "user_href": "/profile/Akhilesh-Pal-25"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhishek Kumar",
                "href": "/profile/Abhishek-Kumar-3356"
            },
            "answer_text": "The following relationship can be used to calculate the density - Mass = Density X Volume Therefore, Density  = Mass/Volume Both the mass and volume are measurable quantities and so you can find the density of the substance using this relationship. ",
            "date": "Answered April 1, 2016",
            "views": "53",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                },
                {
                    "user_id": "John Kestell",
                    "user_href": "/profile/John-Kestell"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wayne Mullen",
                "href": "/profile/Wayne-Mullen"
            },
            "answer_text": "Using a vernier caliper or ruler,measure the length, depth and width of the object in centimeters. Multiply these three measurements to find the volume in cubic centimeters. Divide the object's mass by its volume todetermine its density. Density is expressed in grams per cubic centimeter or grams per milliliter. Ways to Determine Density | Sciencing ",
            "date": "Answered February 15, 2017",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vaishnav Chandra",
                "href": "/profile/Vaishnav-Chandra"
            },
            "answer_text": "Well density in the simplest term is the amount of matter (the quantity of a material) contained in a definite volume Or the amount of substance/volume of the substance . To find the density of a substance find the mass of the substance and divide it by it's volume . Say you have a metal piece of 13.6 gram and it's volume is 1 cm^3 . Therefore the density is 13.6 gram /1 centimetre cube = 13.6 gram per centimetre cube. ",
            "date": "Answered October 19, 2018",
            "views": "775",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Innes",
                    "user_href": "/profile/David-Innes-39"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fabrice Neyret",
                "href": "/profile/Fabrice-Neyret"
            },
            "answer_text": "how much of (whatever unit you are interested in) divided by the volume it occupies. 2 common densities are number density (how many item per m³ or liter) and mass density (often called “density” for short, but this is ambiguous). ",
            "date": "Answered January 23, 2017",
            "views": "421",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Neeraj Sharma",
                    "user_href": "/profile/Neeraj-Sharma-2306"
                }
            ]
        },
        {
            "author_info": {
                "name": "Davis Appleton",
                "href": "/profile/Davis-Appleton"
            },
            "answer_text": "Find the mass of the object, as with a balance scale.Find the volume of the object. For small complex shapes, you can submerge in water in a graduated cylinder, and the change in volume of the total is the volume of the object. Turn object around underwater to get air bubbles out. For larger objects, you might have to do the same in a larger body of water, like a rectangular swimming pool, and multiply the height difference by the surface area to get the volume.Divide the mass by the volume to get the mass density. You may need to convert units.",
            "date": "Answered June 13, 2020",
            "views": "85",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Robert Wolff",
                    "user_href": "/profile/Robert-Wolff-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Colton Thomas",
                "href": "/profile/Colton-Thomas-20"
            },
            "answer_text": "The most commonly used formula for Density is: D=m[math]/[/math]v Where D is density, m is mass, and v is volume. You can remember this because the SI unit for density is kg/m[math]^3[/math]. So kg (kilograms) is a measurement of mass, and m (meters) is a measurement of length, and length x length is a square and length x length x length is a cube, which helps you figure out how much space there is, which is volume. Hope this helped! ",
            "date": "Answered January 15, 2018",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pankaj Thakur",
                "href": "/profile/Pankaj-Thakur-235"
            },
            "answer_text": "Generally when we say density we consider this as Mass density therefore the formula for this density is Mass Density = Mass per unit of volume. SI unit becomes kg/m3 But if we specify the question that we are talking weight density then the formula of this becomes Weight Density = Weight per unit of volume. SI unit becomes Newton/m3 ",
            "date": "Answered June 20, 2018",
            "views": "410",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Suraj Kumar",
                    "user_href": "/profile/Suraj-Kumar-3232"
                },
                {
                    "user_id": "Jassal Sub",
                    "user_href": "/profile/Jassal-Sub"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abdul Rehman",
                "href": "/profile/Abdul-Rehman-2715"
            },
            "answer_text": "D=m/v D=Density of substance to be find M=Mass of given substance whose density can be find V= Volume of given substance For Example A substance have Mass = m=10 kg Volume=V=2cm^3 Solution Density =Mass per unit volume=m/v D=mass/Volume D=10/2 D=5kg/cm^3 ",
            "date": "Answered October 20, 2018",
            "views": "16",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Jess H. Brewer",
                    "user_href": "/profile/Jess-H-Brewer-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Trevor Hodgson",
                "href": "/profile/Trevor-Hodgson-8"
            },
            "answer_text": "Step 1: Determine the mass of the substance Step 2: Determine the volume of the substance Step 3: Calculate the density by dividing mass by volume. ",
            "date": "Answered June 15, 2019",
            "views": "78",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Omar Luis Curetti",
                "href": "/profile/Omar-Luis-Curetti"
            },
            "answer_text": "Archimedes does provide a way to calculate the specific weight of any body heavier than a fluid by just weighting it hanging from a dynamometer (spring type weight meter) above and below fluid level Rho=(Wa-Wb)*Rhof/Wa where Wa=Weight above (N) Wb=Weight below (N) Rhof= specific weight of fluid (9.81 N/lt for water) And density is related to specific weight with gravity constant g=9.81 N/Kg D*g=Rho or D (Kg/lt)=Rho (N/Lt) /g (N/Kg) (units) ",
            "date": "Answered July 26, 2016",
            "views": "932",
            "upvotes": " Answer requested by Manikandan Palani"
        },
        {
            "author_info": {
                "name": "Ali Abdulla",
                "href": "/profile/Ali-Abdulla-15"
            },
            "answer_text": "Any way density d= mass kg/ Volume V m^3 So you must find V and mass by the known physical methods. ",
            "date": "Answered June 13, 2020",
            "views": "64",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kyle Oliver",
                "href": "/profile/Kyle-Oliver-8"
            },
            "answer_text": "The formula for finding the density of a substance is D=M/V. An easy way to remember this formula is that when you place an m over a v, it makes a heart shape. So just divide the mass by the volume, not too difficult. ",
            "date": "Answered October 10, 2016",
            "views": "338",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jagjit Singh",
                "href": "/profile/Jagjit-Singh"
            },
            "answer_text": "From Google search: The density of a substance is the relationship between the mass of the substance and how much space it takes up (volume). The mass of atoms, their size, and how they are arranged determine the density of a substance. Density equals the mass of the substance divided by its volume; D = m/v. ",
            "date": "Answered December 27, 2019",
            "views": "77",
            "upvotes": " Answer requested by Obunwa Emelin"
        },
        {
            "author_info": {
                "name": "Michel Grosjean",
                "href": "/profile/Michel-Grosjean"
            },
            "answer_text": "You weight the mass of the object M. You measure the volume V of the object. For exemple you have a recipient with water. You plunge the object into the water. The difference of volumes of water is the volume of the object. Density = M / V ",
            "date": "Answered June 14, 2020",
            "views": "127",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Divyanshu Singh",
                "href": "/profile/Divyanshu-Singh-200"
            },
            "answer_text": "The most simple formula isDENSITY=MASS/VOLUMEGoogle it to know more. ",
            "date": "Answered June 20, 2018",
            "views": "511",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Eduardo Perini Muniz",
                "href": "/profile/Eduardo-Perini-Muniz"
            },
            "answer_text": "Density = mass/volume. Now, to know the volume of a very irregularly shaped material (like a crown for instance) some water is needed. ",
            "date": "Answered October 10, 2016",
            "views": "254",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Akshay Devikar",
                "href": "/profile/Akshay-Devikar-2"
            },
            "answer_text": "If it is a heterogeneous substance, it makes measurement of density a complex job, since you don’t have a known composition at any given point. So, it can’t be measured. All you can do is estimate the density in terms of minimum and maximum value range. ",
            "date": "Answered September 2, 2016",
            "views": "122",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jay Jacob Wind",
                "href": "/profile/Jay-Jacob-Wind"
            },
            "answer_text": "Mass divided by volume = density 100 kilograms of water / 100 liters of water = 1 kg/liter density Density is a property of matter, by the way. See https://www.angstromsciences.com/density-elements-chart Density of elements is correlated with atomic weight but not entirely. ",
            "date": "Answered June 13, 2020",
            "views": "45",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Adam Freed",
                "href": "/profile/Adam-Freed-4"
            },
            "answer_text": "The density of an object is how close it's mass is together. However, an easier way to think of this is how much mass it has for the amount of space it takes up. Once you get used to this idea, it's easy to connect this and say that density is the mass over the volume. Hope it helped! ",
            "date": "Answered October 10, 2016",
            "views": "609",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Arshdeep Singh",
                "href": "/profile/Arshdeep-Singh-564"
            },
            "answer_text": "In physics density is equal to mass upon volume in chemistry it is equal to mass into type of cubic lattice upon Avogadro number into cube of bond length ",
            "date": "Answered June 20, 2018",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Muhammad Ahsan Ali",
                "href": "/profile/Muhammad-Ahsan-Ali-8"
            },
            "answer_text": "We use following formula for density calculation: density = mass / volume ( d=m/v ) If mass and volume are given, then density of compound or element can be easily calculated. . ",
            "date": "Answered July 28, 2018",
            "views": "61",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hayagreev Jeyandran",
                "href": "/profile/Hayagreev-Jeyandran"
            },
            "answer_text": "Density Just means Mass per unit volume . Using this we can derive the formula of density as Density = Mass/Volume ⇒ ρ = m/V Given that ρ (Rho)=Density  ",
            "date": "Answered May 16, 2019",
            "views": "117",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chhavi Saxena",
                "href": "/profile/Chhavi-Saxena-33"
            },
            "answer_text": "Density is actually mass per unit volume Density= mass/ volume ",
            "date": "Answered June 20, 2018",
            "views": "224",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Akash Berwal",
                "href": "/profile/Akash-Berwal-2"
            },
            "answer_text": "p=m/v p is the density, m is the mass and v is the volume. ",
            "date": "Answered June 20, 2018",
            "views": "158",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Haadiya Usman",
                "href": "/profile/Haadiya-Usman"
            },
            "answer_text": "Density= Mass/Volume Density is measured in g/cm cube or kg/m cube Mass is measured in g or kg Volume is measured in cm cube or m cube ",
            "date": "Answered October 10, 2016",
            "views": "163",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gnanaguru",
                "href": "/profile/Gnanaguru-2"
            },
            "answer_text": "The formula is Density=mass/volume Unit is kg/m^3. ",
            "date": "Answered June 20, 2018",
            "views": "149",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rajeev Prajapati",
                "href": "/profile/Rajeev-Prajapati-16"
            },
            "answer_text": "d=m/V Unit= kg/m^3 d=density m= Mass V= Volume ",
            "date": "Answered October 19, 2018",
            "views": "111",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shivani Swami",
                "href": "/profile/Shivani-Swami-8"
            },
            "answer_text": "Volume =mass × density so,density =volume ÷mass ",
            "date": "Answered June 20, 2018",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Akash Kharwar",
                "href": "/profile/Akash-Kharwar-2"
            },
            "answer_text": "Mass/Volume is the answer of your question. ",
            "date": "Answered June 20, 2018",
            "views": "188",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rajveer Singh Rathore",
                "href": "/profile/Rajveer-Singh-Rathore-26"
            },
            "answer_text": "weight divided volume unit-kg/cube of metre ",
            "date": "Answered June 20, 2018",
            "views": "254",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aishwarya P",
                "href": "/profile/Aishwarya-P-45"
            },
            "answer_text": "density = mass / volume = m / v ",
            "date": "Answered June 20, 2018",
            "views": "185",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Monalisa Saha",
                "href": "/profile/Monalisa-Saha-18"
            },
            "answer_text": "You can find the density byMASS/VOLUME",
            "date": "Answered August 2, 2018",
            "views": "29",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kunal Pandey",
                "href": "/profile/Kunal-Pandey-139"
            },
            "answer_text": "Mass/volume gives density. ",
            "date": "Answered June 20, 2018",
            "views": "44",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Abhijeet Survase",
                "href": "/profile/Abhijeet-Survase-4"
            },
            "answer_text": "Mass per unit volume Kg /m3 ",
            "date": "Answered June 20, 2018",
            "views": "192",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jaidev Nagraj",
                "href": "/profile/Jaidev-Nagraj-1"
            },
            "answer_text": "Mass divided by volume. ",
            "date": "Answered June 20, 2018",
            "views": "114",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tirth Raj Kumar",
                "href": "/profile/Tirth-Raj-Kumar"
            },
            "answer_text": "density = mass/volume ",
            "date": "Answered June 20, 2018",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ali Shakir",
                "href": "/profile/Ali-Shakir-18"
            },
            "answer_text": "Mass divided by volume ",
            "date": "Answered June 24, 2018",
            "views": "107",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ankit Kumar",
                "href": "/profile/Ankit-Kumar-6162"
            },
            "answer_text": "Mass per unit volume ",
            "date": "Answered June 20, 2018",
            "views": "145",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lakshman Mamidi",
                "href": "/profile/Lakshman-Mamidi"
            },
            "answer_text": "Mass per unit volume ",
            "date": "Answered June 20, 2018",
            "views": "323",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Namit Gupta",
                "href": "/profile/Namit-Gupta-39"
            },
            "answer_text": "I think it is Mass/volume ",
            "date": "Answered June 20, 2018",
            "views": "278",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anass Boufrioua",
                "href": "/profile/Anass-Boufrioua"
            },
            "answer_text": "Density equals mass divided by volume ",
            "date": "Answered October 10, 2017",
            "views": "45",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chandan Kumar",
                "href": "/profile/Chandan-Kumar-5911"
            },
            "answer_text": "Density=mass/volume ",
            "date": "Answered June 20, 2018",
            "views": "204",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bibhuti Sahu",
                "href": "/profile/Bibhuti-Sahu-14"
            },
            "answer_text": "Mass per unit volume ",
            "date": "Answered June 20, 2018",
            "views": "203",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Santosh B Hinglaje",
                "href": "/profile/Santosh-B-Hinglaje"
            },
            "answer_text": "mass/volume in kg/m^3 ",
            "date": "Answered October 18, 2018",
            "views": "61",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aryan Sura",
                "href": "/profile/Aryan-Sura"
            },
            "answer_text": "Mass /volume ",
            "date": "Answered June 20, 2018",
            "views": "199",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "NaMRATA Chandrawanshi",
                "href": "/profile/NaMRATA-Chandrawanshi"
            },
            "answer_text": "Mass/volume ",
            "date": "Answered June 20, 2018",
            "views": "169",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Carter Mecham",
                "href": "/profile/Carter-Mecham-1"
            },
            "answer_text": "mass/volume ",
            "date": "Answered August 2, 2018",
            "views": "46",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gaurav Kumar",
                "href": "/profile/Gaurav-Kumar-3032"
            },
            "answer_text": " ",
            "date": "Answered July 11, 2018",
            "views": "2",
            "upvotes": "0"
        }
    ]
}