{
    "title": "How many electrons flow in a 1 ampere current? - Quora",
    "tags": [
        "Electrons",
        "Electricity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Theo van Niekerk",
                "href": "/profile/Theo-van-Niekerk-1"
            },
            "answer_text": "The measurement must be done by taking time into consideration. Like speed, 120km does not mean much, but 120km/h makes more sense. So, we must convert amps to electrons per second, and we can do it with the following mathematical equation: Express the current in amperes as coulombs per second. One ampere represents a flow of one coulomb of electrical charge per second. Divide 1 coulomb by the charge of a single electron to get the number of electrons in a coulomb of charge. An electron has a charge of 1.60 x 10^-19 coulombs, so it takes 6.25 x 10^18 electrons to make up 1 coulomb of charge. (1/1.60 x 10^-19). Multiply current in coulombs per second by 6.25 x 10^18 electrons per coulomb. The result is the number of electrons per second in the current. We now know that there are 6.25 x 10^18 electrons per coulomb, therefore we can convert amps to electrons-per-second with a single calculation: Just multiply by 6.25 x 10^18. Getting a grasp of the amounts, 1 amp flowing for 1 second through a single point in the wire, totals an amount of 6250000000000000000 electrons past that point. ",
            "date": "Answered February 7, 2018",
            "views": "172",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Marce Iris Miana",
                    "user_href": "/profile/Marce-Iris-Miana"
                },
                {
                    "user_id": "Mario Esposito",
                    "user_href": "/profile/Mario-Esposito"
                },
                {
                    "user_id": "Aditya Yadav Aditya Yadav",
                    "user_href": "/profile/Aditya-Yadav-Aditya-Yadav-3"
                },
                {
                    "user_id": "Yogesh Dev",
                    "user_href": "/profile/Yogesh-Dev-1"
                },
                {
                    "user_id": "Mihai Negoita",
                    "user_href": "/profile/Mihai-Negoita-2"
                },
                {
                    "user_id": "Giri Narayana",
                    "user_href": "/profile/Giri-Narayana-2"
                },
                {
                    "user_id": "Kapil Bhagia",
                    "user_href": "/profile/Kapil-Bhagia-1"
                },
                {
                    "user_id": "GAUTAM GAMINGS",
                    "user_href": "/profile/GAUTAM-GAMINGS"
                },
                {
                    "user_id": "Wayne Marshall",
                    "user_href": "/profile/Wayne-Marshall-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bert Hickman",
                "href": "/profile/Bert-Hickman"
            },
            "answer_text": "One ampere is equivalent to one Coulomb of charge flowing per second. Since each electron carries 1.6 x 10-19 Coulombs of charge, a current of one ampere represents a flow of (1/1.6) x 10+19 electrons or 6.22 x 10+18 electrons each second. The above applies to a steady flow of 1 ampere of direct current (DC). However with sinusoidal 50 Hz alternating current (AC), current flows in one direction for one half-cycle, then reverses for the other half-cycle. Electrons flow through the conductor in one direction, then reverse direction during each AC cycle, so their net velocity is zero. The number of electrons flowing through any point in the conductor at any instant depends on the instantaneous current at that instant. For a 1 amp RMS AC current (which has the equivalent heating power as 1 amp DC), the peak current will be 1.414 amps. Thus the maximum flow of electrons at current peaks will be about 1.4142*6.22 x 10+18 or 8.796 x 10+18 electrons. But 1/4 cycle later, at the instant where the current is zero, there will be a flow of zero electrons. ",
            "date": "Answered February 16, 2018",
            "views": "104",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jyoti Naganurmath",
                    "user_href": "/profile/Jyoti-Naganurmath"
                },
                {
                    "user_id": "Lokesh Loki",
                    "user_href": "/profile/Lokesh-Loki-78"
                },
                {
                    "user_id": "Chandan Verma",
                    "user_href": "/profile/Chandan-Verma-9"
                }
            ]
        }
    ]
}