{
    "title": "How to explain the structure of an atom - Quora",
    "tags": [
        "Engineering Technologists",
        "Engineering and Physics",
        "Physics and Chemistry",
        "Atoms",
        "Science",
        "Technology",
        "Engineering",
        "Chemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Noel",
                "href": "/profile/David-Noel-14"
            },
            "answer_text": "Recently, a NEW picture of the structure of an atom has been developed, which gives a better visualization for understanding some properties of matter, such as Gravity, Antimatter, Magnetism, and Energy content, than does the currently popular Proton-Electron model. It's new, but based on earlier work going right back to Lucretius, who invented the concept of an \"atom\". It also uses work by Lord Kelvin (for whom the Kelvin scale of temperature is named) and by Rene Descartes, who devised Cartesian geometry. It's called the SPINDLE VORTEX Model. Einstein showed that Energy and Mass can be inter-converted, but the modern view is that they are Equivalenced -- that is, that viewing an aspect of matter as either Energy or Mass can be just different ways of looking at the same thing. The new model explains some things better than the Proton-Electron model. It will not replace the older model, but stand alongside it, just as the Wave and Particle (Photon) models of Light are each useful, although seemingly mutually exclusive. In the Spindle Vortex model, an atom is treated as a very rapidly rotating Vortex, and its magnitude is measured by its rotational energy. For example, a Copper atom in the Proton-Electron model is regarded as having 64 times the mass of a Hydrogen atom, while in the Spindle Vortex model, it is regarded as having 64 times the rotational energy.  . .  Because energy of rotation increases as the square of rate of rotation, this means a Copper vortex is rotating 8 times as fast as a Hydrogen atom vortex. The animations show this in a visually-perceptible manner, they do not reflect actual physical forms of vortexes. The new model is explained in the following web article: BS802: GEMMA: The Spindle Vortex Model for Gravity, Energy, Matter, Magnetism, Antimatter <The Spindle Vortex Model>. The article also includes a Spindle Vortex Simulator, showing how rotation speeds increase with magnitude in atoms.  Ask a Quora question for more on how the GEMMA model throws new light on aspects of interest to you -- maybe Gravity or Antimatter. GEMMA is also good at explaining how atoms emit photons. My Books In Print page is at http://www.aoi.com.au/BIP/. ",
            "date": "Answered April 17, 2019",
            "views": "1",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Suresh Meena",
                "href": "/profile/Suresh-Meena-109"
            },
            "answer_text": "The structure of an atom Although the word 'atom' comes from the Greek for indivisible, we now know that atoms are not the smallest particles of matter. Atoms are made from smaller subatomic particles.  At the centre of an atom is a nucleuscontaining protons and neutrons. Electronsare arranged around the nucleus in energy levels or shells. Make sure you can label a simple diagram of an atom like this one. Both protons and electrons have an electrical charge. Both have the same size of electrical charge, but the proton is positive and the electron negative. The neutron is neutral. The electrical charge of particles particle relative charge proton +1 neutron 0 electron -1 The total number of electrons in an atom is always the same as the number of protons in the nucleus. This means atoms have no overall electrical charge. The number of protons in an atom is called its atomic number - also called the proton number. Atoms are arranged in the periodic table in order of increasing atomic number. You may need to re-visit the section in AQA GCSE Science on the periodic table to check you recall it. ",
            "date": "Answered July 30, 2018",
            "views": "1",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chun Xu",
                    "user_href": "/profile/Chun-Xu-17"
                },
                {
                    "user_id": "Rathod Amee",
                    "user_href": "/profile/Rathod-Amee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shiv Shankar Nandi",
                "href": "/profile/Shiv-Shankar-Nandi"
            },
            "answer_text": "The basic structure of an atom includes a tiny, relatively massive nucleus, containing at least one proton and usually one or more neutrons. Outside of the nucleus are energy levels (also called shells), which contain one or more electrons. The energy levels are often called rings (see more discussion of the Bohr model below). The neutrons have the greatest mass and have no charge. The protons have slightly less mass than the neutrons and are positively charged. The electrons have almost no mass and are negatively charged. The electrons move around the nucleus in energy levels. The Bohr model of the atom is the easiest way to indicate the location of the different parts of an atom.  ",
            "date": "Answered July 22, 2018",
            "views": "12",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chun Xu",
                    "user_href": "/profile/Chun-Xu-17"
                },
                {
                    "user_id": "Rathod Amee",
                    "user_href": "/profile/Rathod-Amee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Purnima",
                "href": "/profile/Purnima-74"
            },
            "answer_text": "Hello every one, As we Know the Smallest particles in the universe is the Atom. The word Atom comes from Greek. Structure of The Atom- CBSE Notes for Class 11 Chemistry - Learn CBSE Atom is a rudimentary piece of matter. The Atom is made up of 3 particles. They are : ProtonNeutronElectronProton: These are positively charged particles and these occur within the Atomic Nuclei.these are smaller in mass when compared with Neutrons. Neutrons:These occur in the Atom. Neutrons are the particles with a neutral charge.These have the greatest mass but no charge. Electrons:Electrons revolve around the Nucleus in energy level. There are very small when compared with both protons and Neutrons. These have a relative mass of 0.0005439. The number of Protons and Neutrons present in Nucleus are called Nucleons.Then the total number of Nucleons are Known as Mass Number. The number of Protons occurs in the Nucleus are called Atomic Number. ",
            "date": "Answered June 21, 2019",
            "views": "15",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Karthik CBSE",
                    "user_href": "/profile/Karthik-CBSE"
                },
                {
                    "user_id": "Sunny CBSE",
                    "user_href": "/profile/Sunny-CBSE"
                },
                {
                    "user_id": "Raju",
                    "user_href": "/profile/Raju-850"
                },
                {
                    "user_id": "Phani Cbse",
                    "user_href": "/profile/Phani-Cbse"
                },
                {
                    "user_id": "Purnima Yallala",
                    "user_href": "/profile/Purnima-Yallala"
                },
                {
                    "user_id": "Ashwin Patil",
                    "user_href": "/profile/Ashwin-Patil-85"
                },
                {
                    "user_id": "Anusha",
                    "user_href": "/profile/Anusha-520"
                },
                {
                    "user_id": "Safia Cbse",
                    "user_href": "/profile/Safia-Cbse"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashutosh Bijalwan",
                "href": "/profile/Ashutosh-Bijalwan"
            },
            "answer_text": "Initially it was believed that like planets electron revolve in 2D orbits and Bohr called them non radiating energy state and by using this concept he explained various spectrum series but all the postulates are in trouble due to Heisenberg uncertainity principle and De-Broglie introduce wave-particle duality. now we can say atom & electrons are like bee and its hive i.e., like bee sometimes it is very near to hive and other time it is away from it and move in all possible directions, this 3D space is known as Orbital and under the influence of electrostatic force it exhibits simple harmonic motion(conservative field --energy conservation). Now Pauli's exclusion principle exclude grouping of all electron's in one orbital so only two electron with opposite spin can exist. So a giant atom is formed with increasing number of electrons unlike grouping of bosons in BEC. ",
            "date": "Updated March 27, 2015",
            "views": "844",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chun Xu",
                    "user_href": "/profile/Chun-Xu-17"
                },
                {
                    "user_id": "Praveen Rawat",
                    "user_href": "/profile/Praveen-Rawat-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andriya Antony",
                "href": "/profile/Andriya-Antony"
            },
            "answer_text": "Atoms consist of electrons surrounding a nucleus that contains protons and neutrons. Neutrons are neutral, but protons and electrons are electrically charged. Protons have a relative charge of +1, while electrons have a relative charge of -1. The number of protons in an atom is called its atomic number. Edits are always available… Thank you all… ",
            "date": "Answered July 24, 2018",
            "views": "318",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Megan Balind",
                    "user_href": "/profile/Megan-Balind"
                },
                {
                    "user_id": "Chun Xu",
                    "user_href": "/profile/Chun-Xu-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Swarup Somanna",
                "href": "/profile/Swarup-Somanna"
            },
            "answer_text": "If you want to explain the MODERN structure of atoms, you must know the quantum mechanical model of an atom. What are the different types of orbitals how electrons are filled in them?..... Read these two articles to understand the structure of atoms:1)Atomic Structure: The Quantum Mechanical Model2)http://www.pearsonhighered.com/tro2einfo/assets/pdf/tro-ch07.pdf ",
            "date": "Answered March 24, 2015",
            "views": "479",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chun Xu",
                    "user_href": "/profile/Chun-Xu-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ali Abdulla",
                "href": "/profile/Ali-Abdulla-15"
            },
            "answer_text": "Are you sure you still don’t know the atom is of radius 10^’8 cm, with a nucleus mafe of nucleons(p&n) with radius R= rA^2/3, where r is 1.2 fermi and A is its mass number( p&n), around the nucleus are moving electrons,the number of the protons = the electrons numer which usually called the atomic number Z. ",
            "date": "Answered August 30, 2018",
            "views": "230",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chun Xu",
                    "user_href": "/profile/Chun-Xu-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shivam Chaudhary",
                "href": "/profile/Shivam-Chaudhary-2"
            },
            "answer_text": "An atom as a whole is electrically neutral. It  consists of electrons and a nucleus.Nucleus contains protons and neutrons.There are electrons revolving around nucleus in certain fixed paths in circular orbits following Bohr's prediction.Electrons are bounded to nucleus so  energy is always negative. That's enough. ",
            "date": "Answered March 24, 2015",
            "views": "352",
            "upvotes": "0"
        }
    ]
}