{
    "title": "How to get rid of algae in pools - Quora",
    "tags": [
        "Algae"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vicky Ringeisen",
                "href": "/profile/Vicky-Ringeisen"
            },
            "answer_text": "Usually if you have algae growing, the pH and chlorine levels are off. It would also be worth a look to see how much sunlight hits your pool as that can contribute to that growth. Some like more light, others less-it just depends on which type you have. First step: maintain your levels. Get them in balance and check them frequently to keep them in balance. Second: Keep it clean. This means bi-weekly (or if that isn’t enough) weekly vacuuming of your pool to keep growth at bay. I recommend brushing the walls (gently if it’s an above ground pool) with that vacuuming. The more use your pool has, the more water movement there is. This limits the growth as well-hard to form clumps if you’re being pulled apart! Third step: remove toys, leaves & anything that falls into your pool. Leaves in particular can harbor bacteria and fungi and, you guessed it, some nutrients that algae love. When removing toys, be sure to hose or wash them on a regular basic to prevent growth there as well. Hopes this gives you some usable tips! ",
            "date": "Answered May 2, 2018",
            "views": "193",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Julia Smith",
                "href": "/profile/Julia-Smith-973"
            },
            "answer_text": "Vacuuming algae from the base of a pool is no simple task. You may need to manage two sorts of algae. They are dead ones and the ones they are alive. You should apply various procedures to dispose of them. Utilizing a pool vacuum for algae removing would be a smart thought, yet imagine a scenario where you don't have one? The Easiest thing to do will be to turn on the pump and filtration method. As the pump circulates the water, all dead algae will in the end get caught in the filter. It might take a while, depending on how much cleaning needs. Once you are finished, remember to clean the pump filter. This method only works if they are dead. Algae actively living on the floor or walls would not have a lot of impacts. For living algae, you have two choices. You could use chemicals to finish them, or you will have to brush them off. Use the brush to peel off the algae layer from the bottom. Once eradicated, they will float in the water, which will be easy for the filtration process to filter them out. If you have a weak filtration method, get sieve materials. Getting the release of some phytoplankton manually would help the filter. ",
            "date": "Answered August 12, 2020",
            "views": "57",
            "upvotes": "0"
        }
    ]
}