{
    "title": "How to go about thinking through your answer for a question - Quora",
    "tags": [
        "Answers (Quora content)",
        "Questions (Quora content)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Lieberman",
                "href": "/profile/Mike-Lieberman-1"
            },
            "answer_text": "I won’t answer a question that I’m not at least fairly certain I know the answer to already. My process is: Research and make sure I am correct in what I think the answer is.Think about how much background information will be required to understand it.Find some sources to support both the background and conclusion.Start writing. Insert sources and relevant images along the way.Submit answer.Reread and try to edit out typos or grammatical mistakes.Read comments and update / revise if relevant concerns come up.If a major concern is brought up that totally invalidates the answer, delete it. This has only happened once, but nobody’s perfect - and I’m glad it was pointed out in the comments.",
            "date": "Answered November 23, 2017",
            "views": "176",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Carolyn Taylor",
                    "user_href": "/profile/Carolyn-Taylor-64"
                },
                {
                    "user_id": "Daniel Svitek",
                    "user_href": "/profile/Daniel-Svitek"
                },
                {
                    "user_id": "Greg Dahlen",
                    "user_href": "/profile/Greg-Dahlen"
                },
                {
                    "user_id": "Mich Susanto",
                    "user_href": "/profile/Mich-Susanto"
                },
                {
                    "user_id": "Wendi Tibbets",
                    "user_href": "/profile/Wendi-Tibbets"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeanine Joy",
                "href": "/profile/Jeanine-Joy"
            },
            "answer_text": "I really don’t. When I read a question, an answer pops into my mind, or at least the direction the answer will take and I am off and running. Even if I have to do some research, I already know how to locate the research I’m thinking about and it’s just a matter of getting the citation. If the question is on a sensitive subject, I will read it carefully before I submit the answer to try to be sure it is unoffensive while making my point. ",
            "date": "Answered November 23, 2017",
            "views": "78",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jonathan Perez",
                    "user_href": "/profile/Jonathan-Perez-120"
                },
                {
                    "user_id": "Greg Dahlen",
                    "user_href": "/profile/Greg-Dahlen"
                }
            ]
        }
    ]
}