{
    "title": "How do we prove that change in kinetic energy equals to work done? - Quora",
    "tags": [
        "Work (physics)",
        "Kinetic Energy",
        "Energy (physics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sriman Dutta",
                "href": "/profile/Sriman-Dutta"
            },
            "answer_text": "The concept of work-energy theorem is often misunderstood. I'll try to explain it.Firstly, let us understand what work in physics exactly means. Work is the displacement caused by an applied force on a body. In vector representation, W=F.S, which means that work(a scalar) equals the dot product of force (a vector) and displacement (also a vector). Work is actually a quantity that is analogous to energy. Work can be, informally speaking, thought of as a form of energy, according to the first law of thermodynamics. Thus, it can be added to or subtracted from a body's energy value.According to the work-energy theorem, the work done on a body is equal to the total change in its mechanical energy.If the body is acted upon by non-conservative forces, we can say that the work done on it is equal to the change in its kinetic energy. If the body is in a conservative force field, then the change in potential energy as well as kinetic energy is equal to the work done by all external and non-conservative forces. Here it is important to note that work done by conservative forces is defined as potential energy , but with a negative sign. The reason is that if we consider:Change in KE= Work by conservative forces+ Work by non-conservative forces+Work by external forcesOr,Change in KE-Work by conservative forces= Work by non-conservative forces+Work by external forcesOr,Change in KE+ Change in PE=Work by non-conservative forces+Work by external forces ",
            "date": "Answered April 12, 2018",
            "views": "42",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vishal Wilson",
                    "user_href": "/profile/Vishal-Wilson-1"
                },
                {
                    "user_id": "Ramesh Goswami",
                    "user_href": "/profile/Ramesh-Goswami-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leonard Carter",
                "href": "/profile/Leonard-Carter-6"
            },
            "answer_text": "Using as an example an object that is thrown or shot vertically upward (and ignoring air resistance), the change in kinetic energy is expressed as Delta(KE) = 1/2* m*v1^2 - 1/2*m*v0^2 where m is the mass of the object and v1, v0 are the initial and final velocities over some time interval Delta(t). Work done can be expressed as lifting the mass m a height h against the earth’s gravitational field (g), W = m*g*h. With g being acceleration, we can write this as g = Delta(v)/Delta(t), change of velocity with respect to change of time. Then W can be rewritten: W = m*(Delta(v)/Delta(t))*h = m*Delta(v)*(h/Delta(t)) But Delta(v) = v1 - v0 and h/Delta(t) is just the average velocity over the time interval Delta(t), ((v1 + v0)/2) so W = m*(v1 - v0)*(v1 + v0)/2 = 1/2*m*(v1 - v0)*(v1 + v0) = 1/2*m*v1^2 - 1/2*m*v0^2, therefore Delta(KE) = W. ",
            "date": "Updated March 13, 2018",
            "views": "24",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "ŠÂMËĖŘ BHÛMÏHÅŔ",
                    "user_href": "/profile/ŠÂMËĖŘ-BHÛMÏHÅŔ"
                }
            ]
        }
    ]
}