{
    "title": "How useful is studying economics with science subjects? - Quora",
    "tags": [
        "Undergraduate Economics",
        "Studying in Higher Education",
        "Studying",
        "Higher Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carluccio Viscera",
                "href": "/profile/Carluccio-Viscera"
            },
            "answer_text": "Very Useful!!! In fact you’ll need Macro-Economics, Micro-Economics and some advanced Economic courses (like Resource Economics or Applied Decision Analysis, for example) if you want to advance into management or executive management in the research sciences and achieve success in these professional fields; In Engineering, engineering students have at least two required courses in Economics called “Engineering Economics;” While Economics can take a broad perspective of application and venture into many aspects and academic fields (e.g. there is a “social” studies area of economics which is termed “Behavioral Economics” or “Consumer Preference Economics” which came from the Greek thesis “Homo Oikonomicus ( a.k.a Oeconimus)” and attempts to explore Social Planning —Quantitative Economics or as we term it “Empirical Economics” is a numerical science which is closely associated with the Accounting Sciences and became more highly proliferate specifically out of Chemistry, Physics, and Engineering; there are Economics associated with energy (energy usage), economics of motion (paths of least resistance which minimize costs), optimization and minimization methods which utilize basic economic theory, efficient set theories and efficient frontiers were developed in Mathematical Economics and differential equations, costs associated with production and industrialization of scientific principles and manufacturing etc. Also upper level and graduate economic theory and research use science and mathematics which are taken from theoretical physics and statistics because a graduate level Economist has to research demographic and economic data which can scale hundreds of millions of data points; ",
            "date": "Updated September 9, 2018",
            "views": "581",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sankalp Mathur",
                "href": "/profile/Sankalp-Mathur-2"
            },
            "answer_text": "It's very useful. PCM+Economics is one of the best combinations to study. Usually, students with this combination either go for Engineering or Economics (Hons). The underlying idea in both of these streams is very similar: you are learning the skills to maximize the efficiency. In engineering, you learn to maximize the efficiency of a machine while in Economics, you maximize the efficiency of a firm/economy/system. While studying PCM will give you a technical and mathematical prowess, Economics will give you the skills to question logically and get answers to it mathematically. It's a bang-on combination and will make you a much smarter person than any other combination. (except for PCM+Computer Science though) ",
            "date": "Answered June 17, 2016",
            "views": "11",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shashank Kumar",
                    "user_href": "/profile/Shashank-Kumar-1172"
                },
                {
                    "user_id": "Vaibhav Raj",
                    "user_href": "/profile/Vaibhav-Raj-18"
                },
                {
                    "user_id": "Carluccio Viscera",
                    "user_href": "/profile/Carluccio-Viscera"
                },
                {
                    "user_id": "Swagat Kar",
                    "user_href": "/profile/Swagat-Kar-1"
                },
                {
                    "user_id": "Mehakpal Singh Josan",
                    "user_href": "/profile/Mehakpal-Singh-Josan"
                }
            ]
        }
    ]
}