{
    "title": "How to calculate the pH of 2 mixed solutions? If 1 solution has pH of 2 and the other has a pH of 2.1, what would the pH be when I mix - Quora",
    "tags": [
        "PH Scale",
        "Chemical Solutions",
        "pH (chemistry)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tomas De Paulis",
                "href": "/profile/Tomas-De-Paulis"
            },
            "answer_text": "pH is a measure of concentration. If you mix two equal volumes of different concentration, the answer is the combined amount in the double volume. The first solution with pH 2.0 has 10^-2 = 0.01 mol of H+. The second solution has 10^-2.1 = 0.00794 mol of H+. The combined volume has 0.01794 mol, or 0.00897 per the original volume. The negative logarithm of 0.00897 is 2.05. So, the new acidity is simply the mean pH of the two concentrations. ",
            "date": "Answered November 15, 2019",
            "views": "206",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jose Carlos Gomes",
                "href": "/profile/Jose-Carlos-Gomes"
            },
            "answer_text": "pH= -log[h+], Then a solution of pH=2 has [H+]= 10^-2 M. Solution pH=2.1 has a concentration of [H+]= 10^-2.1 M. If volumes mixtured are equal, then pH of the mixture = -log (10^-2 + 10^-2.1). This work for solutions with the same acid. Different acids will have diferents pKas and can ‘strech’ the dissociation. ",
            "date": "Answered November 15, 2019",
            "views": "69",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Toby Block",
                "href": "/profile/Toby-Block"
            },
            "answer_text": "The answer would depend on a number of factors, such as: what are the volumes of the solutions being used in preparing the mixture? will any ions be removed upon mixing (for instance, by precipitation)? are the solutions sufficiently dilute that the volume of the final solution will be the sum of the volumes used in making the mixture? ",
            "date": "Answered November 16, 2019",
            "views": "237",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ameen Skal",
                    "user_href": "/profile/Ameen-Skal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Allen Johnson",
                "href": "/profile/Allen-Johnson-206"
            },
            "answer_text": "You go to the “Related Questions” section to the right of this question, click on the first suggested question: “The equal volumes of two solutions, one having a pH of 4 and the other having a pH of 2 are mixed. What is the pH of the resulting solution?” and then use that method. So, I sent you not only the method, but the method to get the method. Don’’t you think I deserve some credit in your homework submission? ",
            "date": "Answered November 15, 2019",
            "views": "20",
            "upvotes": "0"
        }
    ]
}