{
    "title": "How many calories can a person burn in a day?(The most? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Gord Willms",
                "href": "/profile/Gord-Willms"
            },
            "answer_text": "Michael Phelps, the gold medal swimmer, claimed that he consumed 12,000 calories per day at the peak of his Olympic training. He later admitted that may have been an exaggeration. But it would not be unreasonable to suggest it could have been as high as 10,000 calories on some days.  I’d say 10,000 would represent a pretty good upper limit as to how many calories a human in top condition and working out at an extraordinary level might consume in a day. You can imagine the enormous stress that that would put on your body to keep up with that demand beginning with the digestion and metabolization of all the incoming food required to support that level of energy expenditure. All your bodily functions would have to be operating at peak performance. But what about the average person?  How many calories could the average person burn in a day? Certainly not 10,000. The average person simply would not have the stamina, never mind the amount of time required in full out activity to burn through those calories. Perhaps a reasonably fit person on a weekend bike ride going out for five hours at a reasonably good pace could burn four thousand calories (1500 maintenance plus two and a half thousand extra in the ride). That said, most less active people would find it hard to add even 500 hundred calories to their day by being active without exhaustion setting in. And an elderly person …  … you could be limited to 1500 total calories before exhaustion sets in. So the answer to your question is; anywhere between 1500 and 10,000. Does that help? ",
            "date": "Updated August 22, 2020",
            "views": "5262",
            "upvotes": " View 2.5K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ron Aguirre",
                    "user_href": "/profile/Ron-Aguirre-3"
                },
                {
                    "user_id": "Dhruvil Jadawala",
                    "user_href": "/profile/Dhruvil-Jadawala"
                },
                {
                    "user_id": "Robert Blasi",
                    "user_href": "/profile/Robert-Blasi"
                },
                {
                    "user_id": "Mariska White",
                    "user_href": "/profile/Mariska-White"
                },
                {
                    "user_id": "Puneet Ugru",
                    "user_href": "/profile/Puneet-Ugru"
                },
                {
                    "user_id": "Roberto Ng",
                    "user_href": "/profile/Roberto-Ng"
                },
                {
                    "user_id": "Diana Cionca",
                    "user_href": "/profile/Diana-Cionca"
                },
                {
                    "user_id": "Karim Uddin",
                    "user_href": "/profile/Karim-Uddin-34"
                },
                {
                    "user_id": "Anahit Ashkhatoyan",
                    "user_href": "/profile/Anahit-Ashkhatoyan"
                },
                {
                    "user_id": "Chaitali Sawant",
                    "user_href": "/profile/Chaitali-Sawant-34"
                }
            ]
        },
        {
            "author_info": {
                "name": "RG-FIT",
                "href": "/profile/RG-FIT"
            },
            "answer_text": "You've heard that to lose weight, you must eat less and move more. But understanding just how much more to move can be confusing. How many calories you should burn a day or a week to lose weight depends on many factors — including your weight-loss goal, how much you're eating and how you're burning those calories. In addition to weight control, physical activity affords numerous health benefits, such as better joint mobility, protection against chronic disease, enhanced mood and improved stamina. Be excited with any weight loss you achieve through exercise and know you're doing your body a world of good every time you get out of your chair to move. Calculate a Caloric Deficit for Weight Loss Since one pound of fat equals 3,500 calories, in order to lose one to two pounds per week (generally considered a healthy, reasonable goal), you need to burn 500 to 1,000 calories more per day than you consume — or between 3,500 and 7,000 calories per week. Losing weight more quickly than this isn't recommended by most major health organizations. It's usually unsustainable and can lead to nutrient deficiencies, muscle loss and a stalled metabolism. To create that caloric deficit (meaning you burn more calories than you consume), you first need to figure out how much you're consuming and how many calories per day you burn without exercise. But you must be sure that you add exercise without increasing your calorie intake. If you eat more calories in response to exercise, it won't result in weight loss. For example, a 155-pound person burns 2,000 calories per day and eats 2,000 calories will maintain her weight. But, if she exercises and burns an extra 500 calories per day — perhaps by jogging at 5 mph for 45 minutes — but continues to consume 2,000 calories, she can lose a pound per week. Her efforts can be compounded by cutting an additional 250 to 500 calories out of her diet. How Many exercises to Lose Weight? The American College of Sports Medicine recommends a weekly 200 to 300 minutes of moderate-intensity cardio, or about 2,000 to 3,000 calories burned per week, to lose significant weight. Significant weight loss is defined as more than 5 percent of your body weight. With a pound equaling 3,500 calories, burning this amount results in between 0.6 to 0.85 pounds lost per week — if you don't make changes to your diet at the same time. Approximately 94 percent of the members of the National Weight Control Registry, a group of more than 10,000 people who have lost significant weight and kept it off, report exercising along with diet as leading to success in their weight loss. Ninety percent of these individuals exercise 90 minutes every day, or burn about 2,000 calories per week, to maintain their weight loss. ",
            "date": "Answered December 3, 2018",
            "views": "28",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chavi Dutt",
                    "user_href": "/profile/Chavi-Dutt-2"
                },
                {
                    "user_id": "TJ Monroe",
                    "user_href": "/profile/TJ-Monroe-3"
                },
                {
                    "user_id": "Andrew Nguyen",
                    "user_href": "/profile/Andrew-Nguyen-302"
                }
            ]
        }
    ]
}