{
    "title": "How do we know that exoplanets aren't sunspots (starspots)? - Quora",
    "tags": [
        "Sunspot",
        "Exoplanetology",
        "Exoplanets",
        "The Sun",
        "Theoretical Physics",
        "Astrophysics",
        "Planetary Science",
        "Astronomy",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Prajwal Niraula",
                "href": "/profile/Prajwal-Niraula-1"
            },
            "answer_text": "When first exoplanets were discovered, exoplaneteers had to prove that the signals were real. Spots, stellar puslation are few of the prominent false positives. But that was 1995. We are now more than 20 years into this, and we have not only observed system using complementary methods wobble technique (radial velocity) and transit method, but we are in the process of characterizing the atmosphere, detecting waterbands and doing much more interesting science. The planets transit come as clockwork, and for more than 1000 of them, we can say when the next transit is going to occur within a few minutes, and within seconds for some. Similarly, we have learnt a lot about stellar spots. The major difference between a planet and a stellar spot is that the latter is variable. They change in shape and size, over course of time, and we do actually observe this. Consider Qatar-2b system. Transit means we probe certain cross section of the star which is rotating to begin with. If the planet transits spots, then the transit shape, which is typically U shaped show anomaly features as shown below. The shape deviates from normal U shaped because the shape is determined by the brightness of the region which is occulted. These are seen in the residuals as seen below (Figure burrowed from Dai et al. 2017)  This can be used to find how the planets orbit is aligned with respect to the star, but looking at the spot crossing. In case of Qatar-2b, we can say it is the same spot we are seeing again and again, as the stellar rotation period can be determined, and the position of the spots with respect to the transit also can be predicted. The alignment between the stellar rotation axis and planetary orbital period (obliquity) is one of the interesting parameters we can determine about the system these days.  The actual paper can be found at: https://arxiv.org/pdf/1609.01314.pdf ",
            "date": "Answered June 4, 2019",
            "views": "218",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Noel Bastola",
                    "user_href": "/profile/Noel-Bastola"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leon Roosevelt",
                "href": "/profile/Leon-Roosevelt"
            },
            "answer_text": "Because we can calculate the angular momentum of the host star and compare it to the “spot” which the exoplanet makes in our observations. The comparison makes it clear that these “dark spots” are orbiting the host star, rather than “sunspots”. Besides; it doesn’t make sense to call them “sun spots” in that sense. How would a sun have a “spot”? If there’s any baryonic matter on the surface of the host star, it will crumble under the intense temperature and gravitational tides; making the host star appear mostly homogeneous and uniform. Which is coherent with our observations. ",
            "date": "Answered June 17, 2019",
            "views": "18",
            "upvotes": "0"
        }
    ]
}