{
    "title": "How is air created? - Quora",
    "tags": [
        "Creating Things",
        "Air"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Bazer",
                "href": "/profile/Steve-Bazer-1"
            },
            "answer_text": "Great question. Assuming the question is asking “How was the Earth’s atmosphere formed?”, since the air on Mars or Jupiter has a considerably different composition. First, what is the atmosphere, and what makes up air? The atmosphere is the 6200 mile thick mixture of predominantly 2 gases, Nitrogen and Oxygen, that surrounds the Earth. The atmosphere is held in place by the Earth’s gravitational pull. These are the 5 layers of the Earths atmosphere: Exosphere: 700 to 10,000 km (440 to 6,200 miles)Thermosphere: 80 to 700 km (50 to 440 miles)Mesosphere: 50 to 80 km (31 to 50 miles)Stratosphere: 12 to 50 km (7 to 31 miles)Troposphere: 0 to 12 km (0 to 7 miles) (Variable) The most important layer is the Troposphere, which is defined as the region where air temperatures decrease with altitude. Most of the Earth’s weather occurs in the troposphere. It contains more than 80% of the total atmospheric mass. Its upper altitude varies seasonally and with latitude. The Stratosphere is the region where the air temperature increases with altitude. Jet aircraft can fly within the lower levels of the stratosphere. Together the height of the troposphere and stratosphere equals just under 1% of the radius of the Earth, or 38 miles to the top of the stratosphere, and 3963 miles for the Earth’s radius. What gases comprise the Earth’s atmosphere? These are the gases that make up Earth’s atmosphere: By volume, dry air contains 78.09% nitrogen, 20.95% oxygen, 0.93% argon, 0.04% carbon dioxide, and small amounts of other gases. Air also contains a variable amount of water vapor, on average around 1% at sea level, and 0.4% over the entire atmosphere.  Nitrogen. Nitrogen comprises 78% of the Earths atmosphere, and is its main component. Nitrogen deep in the Earth’s crust form ammonium ions (NH4+), which then bind with silicates. Silicate minerals are among the most abundant kind of minerals in the Earth’s crust. Under high heat and pressure, and in the presence of oxygen or oxygen-containing compounds, the ammonium molecules break down into a mixture of water (H2O) and nitrogen (N2). The nitrogen is released into the atmosphere through volcanic activity. Even though Mars and Venus have similar concentrations of ammonium ions in their crusts, they have no plate tectonics, and therefore relatively little nitrogen in their atmospheres. Oxygen. Oxygen comprises 21% of the Earth’s atmosphere. It is the third most common element in the Universe, after Hydrogen and Helium. Its presence in the Earth ‘s atmosphere is almost entirely from photosynthesis. Tiny organisms known as cyanobacteria, or blue-green algae conduct photosynthesis: using sunshine, water and carbon dioxide to produce oxygen and sugar. Cyanobacteria are prokaryotic cells (the simplest form of modern carbon-based life) in that they lack a DNA-packaging nucleus. Bacteria, including the photosynthetic cyanobacteria, were the only form of life on Earth for the first 2 billion years that life existed on Earth. The chloroplasts in all plants are actually modified Cyanobacteria, which in a symbiotic relationship, are used by the cells of the plant to harness the energy present in the visible light spectrum.  CyanobacteriaFor billions of years eons prior to the evolution of cyanobacteria, which occurred during the Archean eon, ancient organisms—and their \"extremophile\" descendants of today—thrived in the absence of oxygen, relying on sulfate for their energy needs. It was during the Mesoarchaean era within the Archean Eon, that Oxygen was first produced on Earth. This occurred approximately 2.7 billion to 2.8 billon years ago by Cyanobacteria. It was not until about 2.45 billion years ago that the isotopic ratio of sulfur transformed. This indicated that for the first time oxygen was becoming a significant component of Earth's atmosphere. Oxidized iron began to appear in ancient soils, and bands of iron were deposited on the seafloor, a product of reactions with oxygen in the seawater. The Cyanobacteria produced rock formations called stromatolites, which are mounds and columns of multi-layered sedimentary rocks.  Stromatolite Ancient stromatolite formationsThey were originally formed by the growth of layer upon layer of cyanobacteria, a single-celled photosynthesizing microbe that lives today in a wide range of environments ranging from the shallow shelf to lakes, rivers, and even soils. Fossils from Australia show that stromatolites have lived on Earth since the Mesoarchean era. They are generally credited for oxygenating the Mesoarchean Earth.  Fossilized Stromatolite cross section showing layers of Cyanobacteria and stoneThe Great Oxygenation Event. What triggered “the great oxygenation event” that allowed more complex cells, the eukaryotes to evolve? There are several theories, but most involve a mechanism that prevents hydrogen gas from bonding with the newly created oxygen to form water. The oxygen was somehow bonded with other elements to form oxides, or become embedded in the Earth’s crust. 1) oxygen reacted with iron in seawater, and the resulting iron oxide precipitated onto the seafloor, then was buried deep within the Earth; (2) oxygen-rich water in seafloor sediments was buried within the Earth, leaving oxygen in the mantle when the water’s hydrogen was belched out by volcanoes; and (3) oxygen-rich sulfates in undersea hot springs reacted with iron in seafloor sediments, which were buried to put oxygen into the mantle. Burial of oxygen, in the form of oxides, in Earth’s mantle had two effects. First, it allowed hydrogen to continue escaping into space. And second, the buried oxides reacted with hydrogen and other “reduced” gases such as carbon monoxide and and hydrogen sulfide that also were present within Earth’s mantle. That pulled the hydrogen out of circulation. When these buried oxygen-rich sediments got recycled by the Earth, and their gases got vented out by volcanoes, the decreased Hydrogen content of the atmosphere allowed the dioxygen levels to increase without reaction. So oxygen was able to build up in the atmosphere, causing perhaps the most dramatic shift in the history of life on the planet. Before that happened, the amount of oxygen in Earth’s atmosphere was about one ten-quadrillionth of the amount present today. Oxygen is highly reactive and readily combines with other elements, and must be constantly replenished through photosynthesis to maintain the current concentrations in the Earth’s atmosphere. Argon. The third most prevalent gas in the atmosphere. Approximately .934% of the Earths atmosphere is composed of Argon, a Noble gas. It is twice as prevalent as water vapor in the atmosphere. Nearly all of the argon in Earth's atmosphere is radiogenic argon-40, derived from the decay of potassium-40 in the Earth's crust. Carbon Dioxide Carbon dioxide is the 4th most prevalent gas in the atmosphere, but is present in very small concentrations (0.04%). Its presence is the result of photosynthetic activity of plants, volcanic activity, human activity, etc. The anthropogenic contribution is a small portion of total global CO2 generation, but significant.  Most of the increase in CO2 concentrations over the last century can be attributed to the small tip in the Earth’s CO2 balance contributed by the burning of fossil fuels. Although Man’s contribution may be small, it has been enough to tilt the total global CO2 production levels to a point where they exceed the Earth’s ability to remove the extra CO2. The end result has been a doubling of CO2 concentrations to increase from 200ppm to 400ppm in a relatively short time frame. The Carbon Cycle: Carbon Cycle and the Earth's Climate CO2 is a relatively good reflector of heat energy, and causes a positive shift in the Earths albedo, or heat balance. Scientific consensus supports theories that link atmospheric CO2 concentrations directly with increased global temperatures. This fact has triggered great political debate rather meaningful scientific debate.   Man-made CO2 production by year",
            "date": "Updated October 7, 2017",
            "views": "65",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Prathamesh Thakur",
                    "user_href": "/profile/Prathamesh-Thakur-18"
                },
                {
                    "user_id": "Joel Hyland",
                    "user_href": "/profile/Joel-Hyland-1"
                },
                {
                    "user_id": "Stephen Simpson",
                    "user_href": "/profile/Stephen-Simpson-89"
                },
                {
                    "user_id": "Sai Sanath",
                    "user_href": "/profile/Sai-Sanath-2"
                },
                {
                    "user_id": "Maha Nasir",
                    "user_href": "/profile/Maha-Nasir-1"
                },
                {
                    "user_id": "Siva Kanagaraj",
                    "user_href": "/profile/Siva-Kanagaraj-1"
                },
                {
                    "user_id": "James Smith",
                    "user_href": "/profile/James-Smith-3709"
                },
                {
                    "user_id": "Brian Miller",
                    "user_href": "/profile/Brian-Miller-102"
                },
                {
                    "user_id": "Jad Fenergi",
                    "user_href": "/profile/Jad-Fenergi"
                },
                {
                    "user_id": "Andy Sulianto",
                    "user_href": "/profile/Andy-Sulianto"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kanika Khandelwal",
                "href": "/profile/Kanika-Khandelwal-6"
            },
            "answer_text": "The chemistry of the air we breathe is, at least partly, the result of billions of years of photosynthesis. Plant life has transformed our world from one cloaked in a carbon dioxide-rich atmosphere – as seen on Mars or Venus – to one with significant oxygen. About a fifth of the air is made up of oxygen, and almost all the rest is nitrogen. For more info. refer iflscience.com ",
            "date": "Answered August 23, 2017",
            "views": "12",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ganesh Dudi",
                    "user_href": "/profile/Ganesh-Dudi"
                }
            ]
        }
    ]
}