{
    "title": "How to write a scientific paper quickly - Quora",
    "tags": [
        "Scientific Writing",
        "Academic Writing",
        "Academic Publishing",
        "Academic Research Papers",
        "Academic Papers",
        "Academic Research",
        "Scientific Research",
        "Research"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kaycie Butler",
                "href": "/profile/Kaycie-Butler"
            },
            "answer_text": "Writing a paper quickly is possible, but it means that you need to have a great plan in place and you need to be motivated to do it. This can also be done more easily by writing in an effective order such that the writing you do for each part helps your thoughts flow directly into the next part. I recommend starting from the “easiest” sections to write, which are the parts that are closest to the work you did in lab every day, and moving to the more abstract parts only when you already have the more concrete parts written - which helps to flesh out your story! My recommended writing order: Materials and methods/results: these sections are the closest to what you did in the lab every day, so they will be the easiest to write! Start here to get your thoughts flowing and avoid a blank page, and use this to craft a compelling story with a logical flow. Avoid tangents and off-topic ideas here, and you will avoid wasting time on them in future sections also!Discussion: After writing the results, you should already be thinking of what those results meant, which makes moving into your discussion even easier.Introduction: I recommend writing the intro only after the discussion so you know just what you need to introduce to your readers for them to understand your paper…and more importantly, what you DON’T need to introduce! Stick to only what they need to know to understand and evaluate your work.Abstract: Write this last when everything else is composed to make sure it is the most relevant for your paper. It should also be much easier to write when the rest is done.Title: Pick the key words and key points you want your reader to remember from your completed story for your title.If you want more detailed information on this, you can try here: How to best tackle your draft when you have blank-page syndrome Best of luck quickly composing your manuscript! ",
            "date": "Answered August 1, 2019",
            "views": "216",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Patricia Daibes",
                    "user_href": "/profile/Patricia-Daibes"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aj.Raymond James Ritchie",
                "href": "/profile/Aj-Raymond-James-Ritchie"
            },
            "answer_text": "Lots of practice and learning how to do research and write up work alone. I am quite capable of doing a project in a month and submitting the paper to a journal by the end of the month. But that takes experience and independence. Beware of academic parasites and be extremely careful you only show your drafts to people you trust who will not simply return it with their name added to the authorship. On Research Gate I have a course imaginatively entitled “How to Publish in International Journals”. ",
            "date": "Answered August 6, 2019",
            "views": "382",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shreevathsa Chilkunda",
                    "user_href": "/profile/Shreevathsa-Chilkunda-1"
                },
                {
                    "user_id": "Patricia Daibes",
                    "user_href": "/profile/Patricia-Daibes"
                }
            ]
        }
    ]
}