{
    "title": "If a moon cannot have its own moon because the Earth will take the moon's moon, how can we have a moon without the Sun taking the moon? - Quora",
    "tags": [
        "Moons of the Solar System",
        "The Solar System (astronomy)",
        "Moons (astronomy)",
        "The Solar System",
        "The Sun",
        "The Moon (astronomy)",
        "Earth (planet)",
        "Planetary Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Donald Worthington",
                "href": "/profile/Donald-Worthington"
            },
            "answer_text": "Look at it this way. (The sizes I’ll use aren’t exactly accurate, but they might help you visualize the situation.) Imagine the sun is the size of a volleyball, the earth the size of a marble and the moon the size of a BB. In your mind, place the volleyball-sized sun in the middle of a big lawn. We all agree the sun in roughly 93 million miles away from the earth, right? OK - for our example, we’ll say that 1 foot equals 1 million miles. So then, in your mind, measure a distance away from the volleyball of 93 feet. That’s the distance the earth is away from the sun in our model. Place the marble-sized earth down on the ground at the 93 ft distance. The moon is roughly 230,000 miles from the earth. For our model, let’s just round that to 250,000 miles, which makes things a little easier, and won’t affect anything. 250,000 miles equals .25 of 1,000,000 miles, right? (1/4 of 1,000,000 miles) Since we know that 1,000,000 miles equals 1 foot in our model, it also equals 12 inches, right? So what is 1/4 (or .25) of 12 inches? (3 inches). Now take your BB-moon, and place it 3 inches away from the marble. Now take a mental step back and look at our model. Of the marble-sized earth 3 inches away, and the volley-ball sized sun 93 feet away, which do you think has a greater influence over the moon? If you mentally go back to the sun and look towards the marble-sized earth, can you even see it from 93 feet away? What about that BB-sized moon? Can you see that? Does it even matter, from 93 feet away, whether that BB might be as much as 6 inches (the diameter of its orbit around the earth) closer or further away from time to time? Not much, I’m sure you’ll agree. Now if that BB-sized moon had a moon of its own, it might be the size of a speck of dust. It might be somewhere between a half inch and 1 inch away from the BB. If that were the case, and from time to time as it orbited the BB, it might come as close as 2 1/2 or even 2 inches away from our marble-sized earth. If it came that close, between the marble and the BB, which would have the greatest impact or effect? Even if you say the BB, you still have to admit that over time, the marble would continue to exert a relentless effect on the dust speck, greatly distorting it’s orbit and eventually causing it to become destabilized, which would cause the dust particle’s orbit to be destroyed. This would influence the dust particle to leave orbit and crash into the BB, the marble, or just go wandering off in some other direction. Hope this model helps illustrate the answer to your question. ",
            "date": "Answered May 11, 2019",
            "views": "11",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Calin Ceteras",
                    "user_href": "/profile/Calin-Ceteras"
                },
                {
                    "user_id": "David Bodendoerfer",
                    "user_href": "/profile/David-Bodendoerfer"
                },
                {
                    "user_id": "Roger McDermott",
                    "user_href": "/profile/Roger-McDermott"
                },
                {
                    "user_id": "Hugh Fagan",
                    "user_href": "/profile/Hugh-Fagan-2"
                },
                {
                    "user_id": "Polo Parker",
                    "user_href": "/profile/Polo-Parker-1"
                },
                {
                    "user_id": "Bmahesh Jogi",
                    "user_href": "/profile/Bmahesh-Jogi-1"
                },
                {
                    "user_id": "Aditi",
                    "user_href": "/profile/Aditi-973"
                },
                {
                    "user_id": "Santos Eichmann",
                    "user_href": "/profile/Santos-Eichmann"
                },
                {
                    "user_id": "Ethan Fisher",
                    "user_href": "/profile/Ethan-Fisher-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mary Sullivan",
                "href": "/profile/Mary-Sullivan-81"
            },
            "answer_text": "First of all, the image is not how orbits work. Anyway, the answer lies in scale. Let’s remove all planets and the Sun except for the Moon and Earth. The Moon would be in a perfectly stable orbit, since only the Earth is affecting it. Now let’s add the rest of the solar system. The other planets have almost no effect on the Earth-Moon system, so we can ignore them. Now, the Moon gets gravitational tugs from both the Sun and the Earth. If the Sun pulled on the Earth the same as it did the Moon, there’d be no problem, since the Earth and Moon wouldn’t be affected relatively to each other. However, since the Moon is usually closer or farther than the Earth from the Sun, it gets affected slightly differently than the Earth is, and so its orbit is slightly disrupted. The key here is that the Earth is very far away from the Sun, and the Moon is relatively close to the Earth (400 times closer than it is to the Sun) so the Earth and Moon are, from the Sun’s perspective, pretty much in the same place. Therefore, they get pretty much the same gravitational tugs. The Sun might disrupt the Moon a bit, but Earth’s gravitational hold on the Moon is much stronger than the Sun’s. We say that the Moon is in the Earth’s “Hill Sphere,” which is the region where Earth’s gravitational pull overpowers the Sun’s and it can hold a moon. The farther away you are from another massive body, and the more massive you are, the larger your Hill Sphere. Distance is especially important, as shown by this graphic. Though Jupiter is the most massive planet, Neptune is the one farthest out, and so has the largest Hill Sphere.  The difference comes when you have a moon orbiting a moon orbiting the planet. It’s not completely analogous to the Sun-Earth-Moon situation. The moon here is pretty close to the planet. It has to be, or it would be too disrupted by the star. Because of this, the moon and its moon won’t be in “pretty much the same place” from the planet’s perspective. Therefore, they will receive different gravitational tugs from the planet, which will disrupt the moon’s moon’s orbit. (Wow, never thought I’d had to type “moon’s moon’s”). As they say, distance is of the essence. So why not just put the moon closer? There are two limiting factors. Let’s use the Earth-Moon system as an example. If the Moon’s moon were 400x closer to the Moon than the Moon was to the Sun, it would be 1000 km from the Moon, which is inside the moon. That’s our first limiting factor: We can’t put the moon too close, or it’ll be inside the orbiting body. Our second limiting factor especially effects less dense and larger moons. It’s called the Roche limit, and it’s far more limiting for large bodies than the fact that you can’t orbit inside something. Here’s how it works:  Different parts of a body get different gravitational tugs, which pulls them apart. So if you’re too close to your orbiting body, your inner half will be pulled in while your outer half will be flung out. So you can’t get a moon too close. A page later and we have the answer. The Earth can have a moon because it is pretty far away from the Sun, so it can have a moon far enough out to not get ripped apart by the Roche limit, and still be close enough relative to the Earth to be in its Hill sphere. On the other hand, a moon can’t be too far from its planet or it’ll be outside of its Hill Sphere, so any moon it has has (repeating words again!) to be pretty close in. But it also can’t be too close in, since then it’ll get RIP ped appart. Pun intended. Often times, the Roche limit will actually be larger than the Hill Sphere, so it will be impossible to have a moon. It’ll either get ripped apart, flung out, or both. Ouch. This doesn’t mean that moons of moons are impossible. Rhea, a moon of Saturn, has a tiny ring system. Those orbiting particles can be called moons! Even asteroids can have moons or binary partners! Binary partners are like moons but big enough that they’re not moons, but a fellow planet or asteroid. In universe Sandbox^2, a lot of my moons actually have moons! The Earth analogue, for example, has a massive and relatively far-out moon that has its own small, close in moon. The moon is massive and far-out to maximize its Hill Sphere, and the moon’s moon is small so it’s less affected by the Roche limit. I did this with a lot of other moons too, following the same concept. Universe Sandbox You can also try playing with this gravity simulator and test what I have said for yourself. My Solar System 2.04 (Totally not a sellout) It’s just a lot harder since moons are usually closer to a planet than a planet is to a sun, so their Hill Sphere is smaller. Half a page after declaring we had arrived at the answer, we actually arrive at the answer. But why stop there? Can a moon’s moon have a moon? Technically, yes. Practically, no. As cool as it would be, you run into the same problems as giving a moon a moon (a moon a moon… repetition!! repetition!!) but much more extreme. Your moon’s moon is less massive and has to be close to the moon, so the moon’s moon’s moon has to be really close. It’s too close, likely in the moon’s moon’s (again) Roche limit or even literally inside the moon’s moon. So sadly, our fun of mooning ends here. Now I’m actually done. Binary moons and other stuff can be for another time. ",
            "date": "Answered February 11, 2017",
            "views": "138",
            "upvotes": " View 108 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Zino Edafioghor",
                    "user_href": "/profile/Zino-Edafioghor"
                },
                {
                    "user_id": "Julie Ritt",
                    "user_href": "/profile/Julie-Ritt"
                },
                {
                    "user_id": "Kannan Ramasamy",
                    "user_href": "/profile/Kannan-Ramasamy-17"
                },
                {
                    "user_id": "Brandon Clark",
                    "user_href": "/profile/Brandon-Clark-164"
                },
                {
                    "user_id": "Michele Reeves",
                    "user_href": "/profile/Michele-Reeves-4"
                },
                {
                    "user_id": "Rick Brown",
                    "user_href": "/profile/Rick-Brown-50"
                },
                {
                    "user_id": "Corey S. Powell",
                    "user_href": "/profile/Corey-S-Powell"
                },
                {
                    "user_id": "Aloyce Mahaligewi",
                    "user_href": "/profile/Aloyce-Mahaligewi"
                },
                {
                    "user_id": "Weston Morris",
                    "user_href": "/profile/Weston-Morris-3"
                },
                {
                    "user_id": "John Bingamon",
                    "user_href": "/profile/John-Bingamon-1"
                }
            ]
        }
    ]
}