{
    "title": "If a human steps on a bacteria would it be crushed? - Quora",
    "tags": [
        "Bacteriology",
        "Bacteria",
        "Microbiology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vijay Mohakar",
                "href": "/profile/Vijay-Mohakar"
            },
            "answer_text": "It takes a huge amount of mechanical pressure to kill bacteria. There is a food preservation process called Pascalization that uses pressure to kill molds and spores. It is used as an alternative toPasteurization, which uses heat. The pressures involved a pretty huge -- 50,000 PSI. That's giant hydraulic press kind pressure. Pascalization is not as effective as Pasteurization. I've only ever seen it used for very acidic products, like grapefruit juice. Strong acidity excludes many of the most dangerous food-borne pathogens, and so pascalization is more to prevent spoilage than to protect humans. It does not render food completely sterile, but it does extend shelf life. When you step on something as small as a bacterial cell, you are also stepping on the goop the bacteria is living in (microbiologists call it a \"matrix,\" but I think \"goop\" is more illustrative). There is pretty much always goop, or the bacteria wouldn't be able to survive. Some bacteria do swim some of the time, but most of the time, they rely on diffusion to move compounds around their immediate vicinity. If you shrank yourself down to this scale, water would be like damp concrete or hard packed earth that is being vibrated (not a perfect analogy, but close). You can push things through it, but it takes a lot of work. Swimming is very, very hard work, and you'd want to avoid it if you can. Water with other stuff in it -- i.e., goop -- would be even stiffer. The cells are buried in that. Even if the layer of goop is completely invisible, from a cell's point of view, it could still be like sitting at the bottom of a lake. When you step on the goop, what will happen is the goop will squirt around the hard structures to which it is attached. This probably won't bother any cells that aren't already ruptured or breached. They have to be tough to move through the goop, and the kind of violent disturbance you would cause by stepping on the goop is probably not very different from other disturbances that the bacteria rely on for long-distance travel. Reference :- reddit.com ",
            "date": "Answered September 1, 2019",
            "views": "37",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mridula Selin",
                    "user_href": "/profile/Mridula-Selin"
                }
            ]
        }
    ]
}