{
    "title": "If dark matter has not been directly observed, why do scientists feel the need to propose its existence? - Quora",
    "tags": [
        "Dark Energy",
        "Dark Matter",
        "Scientists",
        "Existence",
        "The Universe",
        "Cosmology",
        "Astrophysics",
        "Astronomy",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Gibson",
                "href": "/profile/Mark-Gibson-231"
            },
            "answer_text": "There are a couple of major observations which indicated the presence of an unseen substance which has mass, and therefore gravitational energy. One of the observations was the behavior of galaxies. Galaxies rotate, that is the constituent stars revolve around their galactic center, in the same manner as our planets rotate around the sun. Our own Milky Way galaxy is revolving once every 240 million years. The problem with the rotation of galaxies is that the velocity was too high to have been caused by the observable matter in the galaxy. This inferred the presence of an additional gravitational force, the origin of which was not detectable. There have been observations of the behavior of the cosmic microwave background which are also explained by the presence of dark matter in the universe. I don’t know that I would use the language, “feel the need”, when scientists are in the process of trying to explain observations in the universe. That seems to imply that scientists are grabbing at straws, are frustrated and just trying to make up something so that their observations can be explained. That is not the way scientists work, it is not the way the scientific method functions, and unfortunately, it is a gross misconception by much of the public. But again much of the public is highly uneducated about these matters. There is nothing worse in the human cultures of the world than ignorance. ",
            "date": "Answered February 27, 2019",
            "views": "314",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Gordon",
                    "user_href": "/profile/David-Gordon-149"
                }
            ]
        },
        {
            "author_info": {
                "name": "George Nixon",
                "href": "/profile/George-Nixon-6"
            },
            "answer_text": "If dark matter has not been directly observed, why do scientists feel the need to propose its existence? Dark Matter exists in the minds of Scientists because academia refused to communicate with me due to snobbery they attach to the validity of work produced by a self educated person. My life work now in E-PUB book form, provides a logical reason for the Galactic anomalies in physical detail. Science is now in the dark age of Dark Matter, Black Holes and Dark Energy and unless the boycott attached to my work is lifted, then General Relativity curvature of Space/time will remain an opiate that enables physicists to believe that all is known regarding gravity and gravitation and enable them to dream on and misspend further billions of dollars. The complexity of Gravity and the Gravitational Thermodynamic effect (GTE) is a major study that is potentially very valuable with regard to the advancement of physics. Only a lack of knowledge of GTE by the people in charge of the Rosetta examination of Comet 67/P has prevented that experiment from being considered as equal to the Cavendish measurement of gravitation. ",
            "date": "Answered February 28, 2019",
            "views": "408",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ivica Pesun",
                    "user_href": "/profile/Ivica-Pesun"
                },
                {
                    "user_id": "Abdirahman Abdalla",
                    "user_href": "/profile/Abdirahman-Abdalla-3"
                }
            ]
        }
    ]
}