{
    "title": "If electric current is the flow of electrons, where do all these electrons go (say, in a cable)? Where are the start and end point? - Quora",
    "tags": [
        "Physics and Electrical Engineering",
        "Electrical and Electronics Engineering",
        "Electrons",
        "Physics of Everyday Life",
        "Electricity",
        "Electronics",
        "Electrical Engineering",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Mueller",
                "href": "/profile/Robert-Mueller-6"
            },
            "answer_text": "A metal wire has many free electrons, electrons not bound to any particular atom in the material of the wire. They can easily move in the direction of a hit by a phonon associated with the temperature of the wire but they also have an increased tendency to freely move in the direction dictated by the direction of the electric field in the wire. Thus, averaged over the assembly of free electrons we see a current caused by the electric field. Electrons enter the wire from the battery (or power supply or whatever) which produces the electric field and join the bunch of electrons in the wire while some electrons exit from the other end of the battery, BUT we cannot say too much more about any particular electron. If it goes into the wire it joins the bunch there and if it leaves the wire we cannot identify it in any way because all the electrons are identical. They are not colored and they carry no number or name marking. All we can say is that are members of the bunch of free electrons (but we can count them or something similar). When they go into the battery they become part of the bunch of free electrons there. And so on, and as others have written, the average behavior is that the electrons go around in a circle while the field in turned on. Until you disconnect the wire from the battery and then they stop flowing until restarted if you reconnect the battery to the wire. In space you cannot tell one from another and while flowing there is no stop or start point. In fact, their locations at any one time are poorly defined; about all you can say is that they are free electrons in the wire and it is even possible to describe the densities of electrons as a function of location within the wire within certain limits, but that is pretty much the best allowed. I might add, the physical behavior of those is electrons actually includes this identical nature in calculations in order to get correct answers and the results from the calculation match what is observed very nicely. In short, we should try not to look for effects depending on tracking electrons and just accept some come out of the wire and some are left in the wire. Trying to spy on them beyond that is doomed to failure in most cases. There are some special tricks possible such as spin polarization which can allow grouping them into categories sharing a particular property, but again, within the groups they are identical. ",
            "date": "Answered February 7, 2019",
            "views": "440",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jonathan Crews",
                    "user_href": "/profile/Jonathan-Crews-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Jones",
                "href": "/profile/Steve-Jones-118"
            },
            "answer_text": "“If electric current is the flow of electrons, where do all these electrons go (say, in a cable)? Where are the start and end points?” Firstly, currents only flow in circuits, so in that sense there is no start and end point. However, that doesn’t means electrons necessarily flow all the way around circuits; it depends on how the current is generated. If we ignore AC where the electrons first flow one way then the other and don’t travel any net distance over a cycle and consider just DC then here’s a couple of possibilities a simple resistive circuit powered by a battery.In this circuit, the battery creates a potential differences with a positive charge at the anode and a negative at the cathode. When we complete the circuit, electrons flow from the cathode to the anode through the resistive circuit. However, what happens in the battery is different. These electrons that arrive at the anode electrochemically combine with positively charge ions that have travelled through the electrolyte from the cathode, thereby keeping the cathode negative. Eventually all the available electrochemical material is used up and the battery is fully discharged. So, there are two flows of charge from cathode to anode; a flow of negative electrons through the load and a flow of positively charged ions within the battery. The two exactly balance 2. superconductor coil In a superconductor coil, which has no resistance, a continuous DC current can be made to flow in an endless loop maintaining a magnetic field. The electrons, in essence, just travel continually in one direction round the coil and eventually end up where they started. There are countless other possibilities, but the basic principle remains. Currents flow in circuits, and that can either be by means of electron flows in one direction or positively charged particles in the opposite sense. However, ultimately, it all balances out in any closed circuit. ",
            "date": "Answered October 29, 2019",
            "views": "309",
            "upvotes": "0"
        }
    ]
}