{
    "title": "If electrons are fermions, then how can they have two possible spin values? - Quora",
    "tags": [
        "Electron Spin",
        "Fermions",
        "Spin (physics)",
        "Values and Principles",
        "Electrons",
        "Theoretical Physics",
        "Particle Physics",
        "Quantum Mechanics",
        "Physics of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alfonso De Miguel",
                "href": "/profile/Alfonso-De-Miguel"
            },
            "answer_text": "If you think about a vibrating field moving in a pendular way left to right and right to left, it’s going to have two different spins. When moving towards left it will act as an electron, and when moving towards right it will act as a positron. Electron and positron will be Majorana antimatters because being the same field it can be said they are their own antimatter. But they are going to exist as electron or positron at different moments of time. If they existed at the left and right handed sides simultaneously they would not be fermions ruled by the Pauly Exclusion Principle but bosons. But electrons will always have the same spin, and positrons will also have a same spin.I think this is a reasonable explanation, but currently it's not orthodox physics at all. The problem with the current atomic model is that it has not being built in a reasonable nor rational way but in a utilitarian one by using abstract equations that fit with experiments and measures and let some predictions. And later, people who ask “why” and “how” (the two questions that any physicist would always make) are trying to make sense of that model by using our logic. I think that should be actually make by any real physicist, but if they made it they would not be able to take their physics degree. ",
            "date": "Answered April 27, 2020",
            "views": "34",
            "upvotes": " Answer requested by Jaime Almodovar",
            "upvoters": [
                {
                    "user_id": "Erik Kofoed",
                    "user_href": "/profile/Erik-Kofoed-2"
                },
                {
                    "user_id": "Chuck Britton",
                    "user_href": "/profile/Chuck-Britton"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Morgan",
                "href": "/profile/Dave-Morgan-14"
            },
            "answer_text": "The amount of an electron’s spin is always the same. When you choose a direction along which to measure said spin, the direction of the spin can either be oriented parallel or anti-parallel to that measurement axis. We say that the measurement can be +1/2 or –1/2. ",
            "date": "Answered April 26, 2020",
            "views": "46",
            "upvotes": " View 2 Upvoters"
        }
    ]
}