{
    "title": "If fracking is so bad for the environment, why is it still being done? - Quora",
    "tags": [
        "Hydraulic Fracturing",
        "Environmentalism",
        "Oil and Gas Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Douglas Turner",
                "href": "/profile/Douglas-Turner-15"
            },
            "answer_text": "Fracking is not bad for the environment. All the fake stories a few years ago about fracking were just that….fake! It doe NOT cause shifting of the earths strata with resulting earthquakes. It does NOT poison ground water. Fracking occurrs far, far lower than ground water. Millions have been spent addressing these “issues.” They didn’t exist. Have you wondered why there is not much negative anymore about fracking? Because they were just completely made up stories by the radical left which always…… Always……ALWAYS has to find things wrong with our country whether true or false. They cannot exist without a long litany of horrors about to befall our nation. Gender issues, racism, bad schools, climate emergency…..the list goes on and on. Not to say we don’t have issues that need to be addressed. We do but I, for one, prefer to address them in a common sense, rational way……not with endless histrionics carried out with demonstrations and all-to-frequent violence. But….sadly….. our society, especially media, politicians and others, have lost their minds. They can’t firgure out how to think and discuss anything rationally any more. And those of us who are normals have to put up with it. ",
            "date": "Answered July 28, 2019",
            "views": "22",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tim Broberg",
                    "user_href": "/profile/Tim-Broberg"
                },
                {
                    "user_id": "Michael Baker",
                    "user_href": "/profile/Michael-Baker-457"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ted A. Brewster",
                "href": "/profile/Ted-Brewster"
            },
            "answer_text": "Its not bad. In fact it is why the US is now a net exporter of gas and oil U.S. Manufacturing costs are almost as low as China’s, and that’s a very big deal “Made in the U.S.A” is becoming more affordable. The reason? Fracking. U.S. Manufacturing costs are almost as low as China’s You don’t need to a Nobel Prize in economics to know that the fracking revolution has been good for the U.S. What’s not so well known is just how competitive cheap oil and gas has made American manufacturing. BCG, the Boston consultancy, estimates the average cost to manufacture goods in the U.S. is now only 5% higher than in China and is actually 10% to 20% lower than in major European economies. Even more striking: BCG projects that by 2018 it will be 2% to 3% cheaper to make stuff here than in China. Part of the reason for the narrowing gap is that wages have been rising in China. And American companies have been boosting their productivity faster than many of their international competitors. But perhaps the single largest factor is that fracking has helped dramatically drive down the price of oil and gas that’s being used in energy intensive industries such as steel, aluminum, paper and petrochemicals. BCG calculates that U.S. industrial electricity prices are now 30% to 50% lower than those of other major exporters. “A 5% price discrepancy in manufacturing between China and the US doesn’t amount to much,” says BCG’s David Gee, “when you consider that US manufacturers face the risks of delay when shipping from China, the threat of port strikes, and the local investments and partnerships that Beijing often requires of foreign companies doing business there.”  ",
            "date": "Answered July 28, 2019",
            "views": "67",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stephen Costanzo",
                    "user_href": "/profile/Stephen-Costanzo-1"
                },
                {
                    "user_id": "Michael Baker",
                    "user_href": "/profile/Michael-Baker-457"
                }
            ]
        }
    ]
}