{
    "title": "If heat is the vibration of atoms, what is the frequency and amplitude of this vibration commonly found in atoms? - Quora",
    "tags": [
        "Vibrations (physics)",
        "Atoms"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jonathan Hardis",
                "href": "/profile/Jonathan-Hardis"
            },
            "answer_text": "“If heat is the vibration of atoms, what is the frequency and amplitude of this vibration commonly found in atoms?” A2A: I’m afraid that the previous answers (some of which date back years) are a bit off-the-wall. Let’s see if we can make better sense of this. The premise “heat is the vibration of atoms” is a simplification. Heat, as in temperature, as in thermodynamic equilibrium, is a description of how energy states are populated in a sample of material. That is, among the many, many copies of the atom or molecule in a material, we’re after the answer to the question: What is the probability of one atom (or molecule) being in state A as opposed to state B? For the mathematically inclined, here’s the answer. If state B is higher in energy than state A by an energy E, the ratio of (Number in B / Number in A) equals exp(–E/(kT)), where k is the Boltzmann constant and T is the temperature. As T goes to zero, the exponential gets very small, approaching zero, which is to say all that all the population is in state A. Conversely, as T gets very large, the exponential approaches 1, which is to say that the populations of state A and state B approach equality. As it happens, at the ordinary temperatures we find in our daily lives, the corresponding energies (kT) are characteristic of molecular vibrations. If you’ve ever seen a ball-and-stick representation of a molecule, those stiff sticks should actually be represented as springs. They readily stretch and bend. This is to say that, at ordinary temperatures, the molecules around us are in excited vibrational states. The higher the temperatures, the greater the chance that a molecule will be in an excited vibrational state. This is what is meant by the premise to the question. (By the way, molecules also have rotational energy levels, which require even less energy to excite than vibrations.) The question then goes on to ask what are the frequencies and amplitudes of these vibrations. Each type of molecule (that is, specific chemical composition and isotopes used) has its own characteristic vibrational frequencies. Rotational–vibrational spectroscopy - Wikipedia In solids and liquids, they are also affected by interactions with neighboring molecules. Amplitude is a bit tricker to answer, because quantum mechanically a vibrational state doesn't have a definite amplitude. However, by analogy to classical mechanics and a thing called the Virial Theorem, one can say that, on average, a doubly-excited vibrational state has a larger amplitude than a singly-excited vibrational state. A triply-excited state has a larger amplitude than either of them, and so on. The two key facts are that: (1) the higher the temperature, the greater the chance for multiple excitations, and (2) no matter the temperature, the greater the number of excitations the smaller the chance that a molecule will be in that state. ",
            "date": "Answered September 8, 2020",
            "views": "187",
            "upvotes": " Answer requested by Saswot Lamichhane",
            "upvoters": [
                {
                    "user_id": "Jesus Santos",
                    "user_href": "/profile/Jesus-Santos-20"
                },
                {
                    "user_id": "Timothy Gunby",
                    "user_href": "/profile/Timothy-Gunby"
                },
                {
                    "user_id": "Parmesh Mathur",
                    "user_href": "/profile/परमेश-माथुर-Parmesh-Mathur"
                },
                {
                    "user_id": "Kumar Gaurav",
                    "user_href": "/profile/Kumar-Gaurav-907"
                }
            ]
        },
        {
            "author_info": {
                "name": "Greg Burnette",
                "href": "/profile/Greg-Burnette-1"
            },
            "answer_text": "Frequency is determined by the rate of the electron as it orbits the nucleus. This is why different substances reflect different frequencies of light, since their orbitals are different sizes. Likewise, amplitude is determined by the energy of the electron in its orbital path. This is why an object becomes red hot before it becomes white hot, since red is a lower frequency of light which represents an electron orbiting a nucleus more slowly and therefore emitting a lower frequency of electromagnetic radiation. Then it becomes white hot as it gets hotter because White White is a combination of red with higher frequencies of light, which are generated as electrons move faster. Then the white gets brighter as the amplitude increases. This is how light bulbs work. It is also why light bulbs use a carbon filament, because carbon is the most electrically stable element at higher temperatures because it has the most open orbitals. ",
            "date": "Answered May 13, 2016",
            "views": "32",
            "upvotes": " View 4 Upvoters"
        }
    ]
}