{
    "title": "If I mix hydrogen ion and oxygen we can produce water simply? - Quora",
    "tags": [
        "Chemistry Tips and Hacks",
        "Advice About Water",
        "Properties of Water",
        "Hydrogen",
        "Oxygen",
        "Water",
        "Chemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Keith Allpress",
                "href": "/profile/Keith-Allpress"
            },
            "answer_text": "Not by just mixing, in chemistry many reactions have an activation energy. This is an energy barrier that reduces the rate of reactions, even to the point where you may have to wait many lifetimes before even a few molecules succeed in passing the barrier. In Quantum chemistry you can get \"tunneling\" reactions too, see \"Quantum Tunneling\". But generally speaking the role of a catalyst is to reduce the energy barrier. A match plays the role of a catalyst by setting off a chain reaction in the mixture, (resulting in an explosion) or you can use specially prepared surfaces made from metals like Palladium. This is the basis of a fuel cell, NASA see great value in passing Oxygen and Hydrogen through fuels cells to get electricity, and as a bonus you do produce precious water as a by product. https://en.wikipedia.org/wiki/Fuel_cell ",
            "date": "Updated November 30, 2018",
            "views": "516",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sarnath Sura",
                    "user_href": "/profile/Sarnath-Sura"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Porowski",
                "href": "/profile/Matthew-Porowski"
            },
            "answer_text": "Like Keith said, mixing won't cut it. To break the O=O bonds and the H-H bonds, you need to put in enough energy to start the reaction. Once those bonds are broken, water is formed as the product of the reaction. The formation of water is basically the combustion of Hydrogen. So no, mixing them will not simply create water.   ",
            "date": "Answered April 16, 2016",
            "views": "210",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Greg Dahlen",
                    "user_href": "/profile/Greg-Dahlen"
                }
            ]
        }
    ]
}