{
    "title": "If light waves are larger than an atom, how can the electrons in an atom absorb  light? - Quora",
    "tags": [
        "Visible Light"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daren Scot Wilson",
                "href": "/profile/Daren-Scot-Wilson"
            },
            "answer_text": "Wavelength isn’t important for absorption. The energy is what matters, and that the wave packet of each photon is large enough to overlap with the atom at some instant in time. Suppose you have laser light at, say, 600nm wavelength. It’s best described as a continuous plane wave, but realistically, and especially if it’s a cheap laser, the light has a finite coherence length, which is to say, the waves aren’t perfectly regular but the photons making up the light might be said to have some finite ‘size’. This could be several inches or meters. If we try to turn the laser on and off real fast, or gate the beam somehow, we can’t make a light pulse any shorter than a few wavelengths, that is, a few microns. Attempts to make it any smaller, by diddling with the pulse on a time scale of femtoseconds, make pulses best described as containing a wide range of energies or wavelengths, according to Fourier theory. And still, that pulse will likely be way larger than an atom. An atom absorbing a photon seems as sensible as a cheetah eating a whale. Hard to picture in one’s mind. The electrons have sharply defined energy levels. The hop up from a lower level to a higher level when an external electric field vibrates at a frequency corresponding to the difference in energy levels. If it’s not an exact match, the probability of absorption goes down, less likely as the mismatch increases. The fact that the electron’s former energy level has come to an end, and that its new level has come into being, and that the photons have existed only a finite time over a finite distance from the laser, all mean that Heisenberg allows a little mismatch. The quantum mechanical details are covered well in almost every college level QM textbook. Point it, energy is what determines if a photon has a chance of being absorbed, or just fly by without being affected. When the absorption does occur, the wave-function for that photon, its contribution to the total electromagnetic field around the atom, vanishes. It’s as if a cheetah bites a whale and the whole whale disappears. This is the famous “collapse of the wavefunction” which quantum physicists have never really come up with a good explanation of. Sadly, no one has yet come up with a good, satisfying explanation of what’s really going on, other than to just say: that’s how reality is. Attempts such as de Broglie’s Theory of the Double Solution, or its later watered-down form as Pilot Wave Theory, and the related ideas from Bohm, have philosophical difficulties and can’t deal with more complex situations. Abstract quantum logic does a fine job describing quantum states, quanta, and so on in an abstract mathematical way, but often doesn’t provide any conclusions satisfying to our minds. Many Worlds just seems silly, a matter of blowing words around, without any math or picture of what happens. There are other ways to interpret things, but all fall apart after too much thought, and all have critics. Some very abstract ways of looking at quantum theory, such as David Finkelstein’s quantum relativity logic or “Space Time Code” do away with space, making it a derived concept. Those are the approaches to physics and philosophy I prefer. If “space” isn’t such a fundamental concept, but derived from sequences of sub-quantum operations, then maybe we can’t truly ask embarrassing questions about light waves being larger than atoms :) ",
            "date": "Answered December 4, 2016",
            "views": "682",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Todd Gardiner",
                "href": "/profile/Todd-Gardiner"
            },
            "answer_text": "The wavelength is how far the the light travels before the cycle of EM radiation returns to the starting point of oscillation. The wave does not exist over the entire length of that 500nm. It is a photon, which can also be considered as a tiny point source of energy. ",
            "date": "Answered January 19, 2014",
            "views": "425",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Robbert Bloem",
                    "user_href": "/profile/Robbert-Bloem"
                }
            ]
        }
    ]
}