{
    "title": "If nothing exists, does nothing become everything? - Quora",
    "tags": [
        "Nothing",
        "Existence",
        "Philosophy",
        "Science",
        "Hypothetical Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hans Werner Hammen",
                "href": "/profile/Hans-Werner-Hammen"
            },
            "answer_text": ">>>If nothing exists, does nothing become everything?<<< It is quite sad, that the question about the existence of no-thing, also called abstract objects such as…… All proclaimed sensations, emotions, problems, values (such as beauty and usefulness), ought-, should-, and must-HOODS, relevance, importance and necessity that is; meanings, intentions, purposes, desires-/ wills - and the respective counteremotions. Such as: freedom and captivity, free will and determinedhood, love and hate, appreciation and disgust, bright-NESS and dark-NESS.ALL proclaimed-, measurable parameters in the language of physics: (rest-) MASS, distance, area, space, density, time, velocity, acceleration (gravity is an example), force, impulse, pressure, power, ENERGY, temperatureALL proclaimed numbers, measurable constants, all Axioms, Fields in the language of physics. And all LAWS - of games, legislature, AND of logic, morality, physicsALL proclaimed gods - such as YHWH, Jesus (THE) Christ, Allah……is being forwarded on QUORA on a daily basis. Bcz: Any no-thing = abstract object is - as such, per se - no-thing made up FROM/ABOUT some-thingis, in other words imaginary = does not exist = non-causal = epiphaenomenalONLY, dear friend - ONLY: The utteration = symbolization = materialization = object-IZATION = FAKINGOF an abstract object, OF no-thing that isDOES exist, is obviously a man-made some-thingThe utteration = object-IZATION of an abstract object is often but quite not exclusively a written text. The visible (mostly readible) objectization of no-thing has - forgive me for calling you gullible - people believe that no-thing ought, should MUST, BE existing per se, as such. NOPE! All that DOES exist on this occasion is the observable assertion = objectization = faking. ",
            "date": "Answered October 25, 2020",
            "views": "79",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ajazz Shake",
                "href": "/profile/Ajazz-Shake"
            },
            "answer_text": "NO… Depends, what you mean by Nothing. Science defines Nothing as the Quantum vacuum state with the lowest possible energy state (Energy - Wikipedia). And scientists claim that our universe came into existence from this Nothing, also called “quantum foam.”. As far as Absolute Nothing is concerned it cannot exist because absolute nothing has no attributes or properties as such neither it can act nor it can react. Absolute Nothing neither can be created nor it can create, therefore it cannot exist. But our universe was created and science tells it came from nothing I.e fluctuations in Quantum Foam. If Quantum Foam created our universe, The Quantum Foam did not become our universe. Therefore from scientific point of view nothing does not become everything. But the question remains, where did this Quantum Foam came from? The most logical, rational and scientific explanation.👇👇👇 Ajazz Shake's answer to What makes Islam a rational religion? . ",
            "date": "Answered October 25, 2020",
            "views": "39",
            "upvotes": "0"
        }
    ]
}