{
    "title": "If something like an earthquake is caused by a release of energy in Earth, what is this energy and why is it being released to begin with? - Quora",
    "tags": [
        "Seismology",
        "Earthquakes",
        "Energy (physics)",
        "Physics of Everyday Life",
        "Earth (planet)",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "KC Armstrong",
                "href": "/profile/KC-Armstrong-3"
            },
            "answer_text": "The question is not clear but might be answerable. First, an earthquake is not caused by a release of energy, it IS the release of energy. Triggering an earthquake by adding energy is a different subject. The crust of our planet is made up of many different plates. If you have ever seen a frozen river during the spring breakup you will remember the many pans of ice of many sizes as they shift positions while moving downstream. solids plates on the crust float on deeper liquid rock. Planetary plates can be hundreds of km on a side. There are spreading centres around the world where lava rises, cools, and the plates on either side grow wider. This rising magma is the ultimate energy source for most earthquakes. If two plates are pushing past each other the border is called a slip fault. If the motion is smooth there are no quakes. Sometimes the plates will stick together but the forces on the two will continue. This is like a spring being compressed. If the stuck section suddenly moves the stored energy is released as vibrations in the plates. These vibrations are the earthquake, an example is the San Andreas fault in California. In other places a plate will push into another plate and one of them is forced to move below the other. This plunging is also called subduction. The fault between the plates can be very large in area, If the two stick together they will slowly rise as will the land surface. Think of a spring again. When they finally move they can create a very strong earthquake like the one in the Indian Ocean in 2000. Some earthquakes have other causes. Areas that had thick glaciers on them a few thousand years ago were sometimes pressed downwards. Today they are being pushed up by the liquid core of the earth. If their edges tend to stick then the result is small earthquakes. There are other reasons too. ",
            "date": "Answered October 22, 2020",
            "views": "43",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Edward Hutchinson",
                    "user_href": "/profile/Edward-Hutchinson-12"
                },
                {
                    "user_id": "Dusty Walker",
                    "user_href": "/profile/Dusty-Walker-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jack Paulden",
                "href": "/profile/Jack-Paulden"
            },
            "answer_text": "I will give you my conception as to why, but it’s not mainstream. I assume gravity to have an external source caused by all the energies from all the stars in the universe, whose energy reaches us. The Earth, being so massive, mitigates much of that energy from reaching the center or core of the Earth. This means the molecules and atoms in the Earth’s core are less bounded or contained, and can move around more freely, which creates heat. This heat keeps much of the interior beyond a certain depth, in a molten state. Heat is an electromagnetic emission created by atomic and molecular motion. The Earth is described by having tectonic plates which move. I think of a bird’s egg that has a cracked eggshell. This allows some of this “molten rock” to come to the surface or create pressure that causes the plates to move and thus earthquakes occur. However, for any of my explanation to be true I have to try to prove gravity is an external not internal occurrence on Earth, so we shall see, over time.. ",
            "date": "Answered October 22, 2020",
            "views": "52",
            "upvotes": "0"
        }
    ]
}