{
    "title": "If Star Trek replicators were put out, would they end poverty and disease? - Quora",
    "tags": [
        "Star Trek: Voyager (TV Series)",
        "War on Poverty",
        "Star Trek (TV Series)",
        "Star Trek: The Next Generation (TV series)",
        "Star Trek (creative franchise)",
        "Science Fiction (genre)",
        "Poverty",
        "Medical Conditions and Diseases"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kevin Meixner",
                "href": "/profile/Kevin-Meixner-1"
            },
            "answer_text": "Disease? - no. Even if you could produce as much medicine as you needed easily with replicators you would still need to find the cure for diseases and not all cures would be known just by having replicators available. In regards to poverty? That depends. A lot of the poverty in our world currently is created artificially by our governments, banking system, corporations. If we managed our resources better, putting the well-being of the population of the planet before greed and lust for power then we would most likely solve poverty right now even without replicators. Putting out replicators could help to ensure people have enough to eat and give them tools to be more self-sufficient. However, politics would determine if this would actually eliminate poverty. Would everyone on the planet have equal and adequate access to the replicators? Could replicators produce everything that was needed or would there be limitations? Where does the energy required to run the replicators come from? Would there be a cost for that energy? How would the economy work in a world where many manufacturing jobs and even many jobs involving food production and service would be replaced by replicators? These are all questions that would need to be answered to determine if replicators being put out would eliminate poverty. There are probably a lot of other factors too, it is a complicated problem to imagine how different the world we be with access to replicator technology. Also, currently, we have crude replicators in our reality called 3D printers. They have not eliminated poverty due to their limitations and their high cost. However, they are improving what they can do and becoming cheaper everyday so looking into how they are changing the world might be a good way to see where the future of this crude replicator technology might lead to in the future. I recall seeing a video/article on the Internet that showed that they are able to print parts with 3D printers that can be assembled into somewhat crude but low cost housing currently which could be a step towards limiting poverty in some places for example. Also, they have successfully printed some organic body parts (such as a human ear) which is a step towards eliminating some medical problems at least, they could possibly print human organs for transplants either now or in the very near future. ",
            "date": "Answered July 11, 2020",
            "views": "182",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sean Sivils",
                "href": "/profile/Sean-Sivils-2"
            },
            "answer_text": "It doesn’t work like that. A lot of people look at replicators and assume you get something out of nothing. No. It needs to actually have something first. Replicators use a form of transporter technology, which means it needs something to transport. Replicators are absolutely no different. You need some food items, or matter in general, before you can use them. Another thing is recipes. You have to program the replicator with recipes, or you’ll just get basic food. Janeway had to limit what was replicated during the aptly title Year of Hell, so that only Starfleet rations and cobbled together foods were created. This may not really be a problem for areas that simply want food, but if they want food from their own culture, rather than the basics all the time, you’d need to actually program recipes into the replicator. In short, replicators needed the blueprint for something. You also need something to power the damn thing. Different classes of ships used different means of powering the replicators. For instance, an Intrepid class vessel, such as Voyager, used the bio-neural gel packs to power the ship’s replicators.  Lt. Torres examining one of Voyager’s bio-neural gel packs We currently don’t possess anything that can power a replicator. Well, maybe an RTG, but those things not only have expiration dates, and also the messy problem of radioactivity. You'd need trained personnel to remove the damn thing once it’s no longer operational, and find a designated place to dispose of it. More hassle than it’s worth, just for a replicator. The third problem is that replicators can’t produce overly complex things. When the Vidiians attacked Neelix, and stole his lungs, it was shown that Voyager’s replicators were insufficient to reproducing artificial lungs. The Vidiians had vastly superior transporters, so they transported one of Kes’s lungs into Neelix, both to atone for their act, and as gratitude for Janeway not outright killing the Vidiian who got Neelix’s lungs. Replicators can do a lot, but they have their limits. So some of the medicines needed to treat the nasty ailments here could be too complex. The final problem is we’re still far away from Starfleet replicators. There is something that’s been inspired by the replicators, which I talk about further below. So there are a number of factors currently prohibiting us from just using replicators, in addition to not even having the things: 1) You need something to produce something- If an area has a decided lack of food, that’d make things a but difficult. 2) Power- We’re still far away from clean energy that can power the thing, and those sources that might work have issues of radioactivity. 3) Replicators can’t produce the more complex items- This would be a problem for areas with a decided lack of medicines. Medicines that could prove too complex. 4) We’re still far away from a true replicator. Now, that said, there is an Israeli company that’s closer to replicators than we’ve ever been. Called the Genie, the machine from White Innovation takes pods and creates dishes from them. These pods are good for 2 years. Food Tool Friday: The Real-Life Star Trek Food Replicator While it’s a far cry from Star Trek replicators, it’s still pretty damn impressive. In about 50 years, maybe a century, we could see Genies that are much closer to the replicators found in Star Trek. To stick with Voyager, which takes place in the 24th Century, this would actually be 200 years early. I’d consider that a huge accomplishment. ",
            "date": "Answered May 3, 2020",
            "views": "165",
            "upvotes": " View 33 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andrew Zhang",
                    "user_href": "/profile/Andrew-Zhang-103"
                },
                {
                    "user_id": "Richard Jones",
                    "user_href": "/profile/Richard-Jones-138"
                },
                {
                    "user_id": "Korey Daniel",
                    "user_href": "/profile/Korey-Daniel"
                },
                {
                    "user_id": "Dave Smith",
                    "user_href": "/profile/Dave-Smith-757"
                },
                {
                    "user_id": "Tim Larsen",
                    "user_href": "/profile/Tim-Larsen-29"
                },
                {
                    "user_id": "Natalia Perevalova",
                    "user_href": "/profile/Natalia-Perevalova"
                },
                {
                    "user_id": "A. E. Kabir",
                    "user_href": "/profile/A-E-Kabir"
                },
                {
                    "user_id": "Jeff Muscato",
                    "user_href": "/profile/Jeff-Muscato"
                },
                {
                    "user_id": "Jerry Fisher",
                    "user_href": "/profile/Jerry-Fisher-1"
                },
                {
                    "user_id": "Anjelo Gabriel Gacutan",
                    "user_href": "/profile/Anjelo-Gabriel-Gacutan"
                }
            ]
        }
    ]
}