{
    "title": "If the max speed of light is constant, and that gravity can bend light, then would light accelerate when going directly at a source of gravity? - Quora",
    "tags": [
        "Light (physics)",
        "General Relativity",
        "Special Relativity",
        "Speed of Light",
        "Visible Light",
        "Relativity (physics)",
        "Gravity",
        "Physics of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Thomson",
                "href": "/profile/David-Thomson-17"
            },
            "answer_text": "I have a different view and explanation than from the mainstream view. First of all, the source of gravity is space. Objects with mass are acted upon by space and caused to gravitationally attract. There is no mechanism in the mass of an object that sends out force to any other object. Force is a non-material quantity. The source of the gravitational constant is the mediator of the gravitational force, and the source of the gravitational constant is that same source that gives us space. When neutrons are formed, they fold space. What was two units of space becomes one unit of space. This causes the surrounding “empty” space to stretch toward neutrons. As the space stretches toward neutrons, the space density decreases in the immediate environment of the neutrons, and creates a space density gradient into the surrounding “empty” space. It is this space density gradient that is quantified by the Riemann curvature mathematics of General Relativity. The mass of an object is only coincidental to the neutron content of an object. General Relativity effects have nothing to do with mass or gravity, but instead have to do with the binding forces between electrons and protons (both electrostatic force and a magnetic force - the proportion of these two forces is the dimensionless, so-called weak interaction). Since the space density gradient is lowest near large quantities of neutrons, space is stretched inwards, and this causes photons to advance further along in space near large quantities of neutrons than photons would advance in deep “empty” space (again, this inward stretch is the Riemann curvature around massive objects). The photon is still traveling at c through each unit of space as it approaches a large body, but the space density is lower as it approaches the large neutron quantity, and so the photon appears further along in its path than what would be expected in deep space. The photon does not accelerate, but its location along its travel path does advance. None of this process involves time dilation, changes in photon speed, or gravity. It is strictly a process involving a space density gradient (Riemann curvature) and neutron formation due to the electrostatic force and magnetic force of electrons and protons. ",
            "date": "Answered October 18, 2020",
            "views": "51",
            "upvotes": " View Sharers "
        },
        {
            "author_info": {
                "name": "Derek Ross",
                "href": "/profile/Derek-Ross-9"
            },
            "answer_text": "The speed of light cannot change in a vacuum but the velocity of light can. Velocity is a vector combination of speed and direction. Acceleration is a vector change in velocity but not necessarily a change in speed. So when light changes direction it definitely accelerates. But gravity is not an acceleration. It is really a force. Forces, when applied to masses, cause changes in momentum. Momentum, like velocity, is a vector, but combining mass with velocity. And while light cannot change its speed it can always change its momentum by changing its mass. A photon which is not going directly at a source of gravity will change its momentum partly by changing its mass and partly by changing its direction. A photon which is going directly towards (or away from) a source of gravity will change its momentum by increasing (or decreasing) its mass. Does that mean that it's accelerating? No, not when it's going directly towards a source of gravity. ",
            "date": "Answered October 15, 2020",
            "views": "73",
            "upvotes": "0"
        }
    ]
}