{
    "title": "If the sun is in outer space, how can it shine on Earth, but not shine in the outer space? - Quora",
    "tags": [
        "The Sun",
        "Outer Space",
        "Astrophysics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Harrington",
                "href": "/profile/Chris-Harrington-20"
            },
            "answer_text": "“If the sun is in outer space, how can it shine on Earth, but not shine in the outer space?” Okay, here’s a little experiment you can try at home. In one hand, hold up a ball. Any ball. We will call that the Earth. Now, in a darkened room, shine a flashlight on that ball. That light will be the Sun, yeah? Now, over on your other side, (where your other hand would be if it were also holding a ball) shine the light on that nothing. Pretend your other hand is holding a ball in the same way, and shine the light on the complete absence of anything that is in that spot where your hand would be if it were not holding the light. Move the light around if you like. Shine it from above, below, the side… really examine the space where your other hand would be if it were mirroring your hand with the ball instead of shining a light into it. See the difference? 😁 So when you say “how can light shine on Earth but not on *empty space,*” do you see why I’m answering this question with this highly sarcastic tone? There is nothing, and I can’t stress this enough, *NOTHING!!!* there for the light to shine on. Here on Earth, we have a sky, and the sky has air, and the light can even shine on the air. But in *empty* space there is literally nothing for the light to shine on. The amount of material in empty space is so rarified, it amounts to nothing. It is nothing for all intents and purposes. There is absolutely nothing there at all. Vacuum. Nothing. Again, I cannot over stress this enough. So what is it you are expecting the light to shine *on?* You can’t shine light on something if there is nothing there to shine light on, yeah? ",
            "date": "Answered September 8, 2020",
            "views": "15",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chris Dandry",
                    "user_href": "/profile/Chris-Dandry"
                },
                {
                    "user_id": "Gerard Sanchez",
                    "user_href": "/profile/Gerard-Sanchez-8"
                },
                {
                    "user_id": "Dale Sloan",
                    "user_href": "/profile/Dale-Sloan-3"
                },
                {
                    "user_id": "Daniel Okereke",
                    "user_href": "/profile/Daniel-Okereke-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Parimal Kumar Ghosh",
                "href": "/profile/Parimal-Kumar-Ghosh"
            },
            "answer_text": "Thanks Diya. A few days back someone asked that despite millions of stars in the sky why the night is black and the sky too. I answered the question in details. I would just like to share some important features of light. The Stars, including the Sun, which are balls of gas, (mostly the gases of Hydrogen and Helium) emit radiation. They create energy by fusing Hydrogen and turning it into Helium in their cores. We see the resulting energy as starlight. Atoms are rammed together, producing nuclear energy. Every second, the Sun converts some 4,000,000 tons of matter into energy. The radiant energy is released in the form of electro-magnetic waves, which travel unimpeded from the Sun in straight lines at the speed of light of light — 186282 miles (299792.458 kms) a second. The intensity of the energy diminishes as it travels a distance of 93,000,000 miles (149,000,000 kms) and We, on the Earth receive the visible light, after the charged particles are bombarded by the Atmosphere and the radioactive charged particles are sent back to Space. It's worthwhile to mention here that the amount of energy received by the Earth from the Sun in TEN SECONDS still equivalent to all energy electricity generated on the planet in a WEEK'S TIME. Now, just try to observe the rising sun at horizon. It's seen just a glowing ball and not shining. You can only see the Sun and NOT THE LIGHT, because the is travelling in front of your eyes but yet you cannot see. After about 500 seconds, you can view the SUN shining becsuse the light has reached you. Do a practical demonstration yourself. On the very moment you see the Sun rising on a clear morning, stand at a comfortable position to observe the sun. Go on counting down the time. After about 7 minutes raise your right index finger in front of your left palm as close as possible. You would find the formation of faint shadow after 500 seconds. This is true phenomenon that undoubtedly proves we CANNOT actually see the light but only the objects illuminated by the light or scattered by dust, smoke, water vapour and numerous particles. Another important example. We see the moon shines in the sky but that's the reflection of sun light and not the source of light that is the Sun. The sunlight or the starlight passing through the vacuum in front of our eyes but unless the is reflected on the surface of an object WE CANNOT THE LIGHT ITSELF. THE STARLIGHT escapes deep into the Space and millions of stars and galaxies are emitting Light continuously but due to their enourmous distance from us hardly we see them shining like the Sun, but very dim stars, clusters, etc. Even our Prominent Galaxy, the Milky Way can be viewed just like a faint streak of rays - A River of 400 billion Stars. Thanks. ",
            "date": "Answered June 8, 2019",
            "views": "43",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lakshmi Shekhar",
                    "user_href": "/profile/Lakshmi-Shekhar-1"
                },
                {
                    "user_id": "Soumya Mishra",
                    "user_href": "/profile/Soumya-Mishra-146"
                },
                {
                    "user_id": "Thomas Wm. Hamilton",
                    "user_href": "/profile/Thomas-Wm-Hamilton"
                },
                {
                    "user_id": "Arun Rathore",
                    "user_href": "/profile/Arun-Rathore-22"
                }
            ]
        }
    ]
}