{
    "title": "If transverse waves cannot travel in a liquid, how can ocean waves be transverse? - Quora",
    "tags": [
        "Ocean and Wind Waves"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ryan Carlyle",
                "href": "/profile/Ryan-Carlyle"
            },
            "answer_text": "Ocean waves are both longitudinal and transverse. Technically, they're a special category called surface waves.  At the surface of the water (or generally any place two fluids of different densities meet) the force of gravity acts as the \"returning\" force required for transverse waves to propagate. Gravity wants to level out the surface of the water, so peaks try to flatten and troughs try to fill. This is somewhat similar to the way a guitar string tries to return to a straight line after being plucked.  However there is essentially zero shear strength in water, so pure transverse waves would die out extremely quickly. The trick comes from the fact that the water in an ocean wave does not move with the wave itself -- each bit of water can only give its neighbors a push, not flow. This push increases the local pressure in the water, which allows the wave to become deeper/higher. If you could see the bulk pressure/motion of the water column below the surface, you would immediately see the fact that the \"wave\" is mostly a localized upswell caused by an actual submerged longitudinal pressure wave. Or you could say the upswell from the wave causes a submerged longitudinal pressure wave beneath it! Two ways to say the same thing. Dynamic fluid behavior is tricky like that.  It's a little complicated to visualize but hopefully you get the idea.  ",
            "date": "Answered August 29, 2012",
            "views": "105",
            "upvotes": " View 39 Upvoters",
            "upvoters": [
                {
                    "user_id": "Intezar",
                    "user_href": "/profile/Intezar-1"
                },
                {
                    "user_id": "Aniket Singh",
                    "user_href": "/profile/Aniket-Singh-1766"
                },
                {
                    "user_id": "Vennila Sathyamoorthi",
                    "user_href": "/profile/Vennila-Sathyamoorthi"
                },
                {
                    "user_id": "Ritabrata Ghosh",
                    "user_href": "/profile/Ritabrata-Ghosh-20"
                },
                {
                    "user_id": "ABHIJITH S",
                    "user_href": "/profile/ABHIJITH-S-233"
                },
                {
                    "user_id": "Jake Meadows",
                    "user_href": "/profile/Jake-Meadows-9"
                },
                {
                    "user_id": "Adityaa Mohanty",
                    "user_href": "/profile/Adityaa-Mohanty"
                },
                {
                    "user_id": "Qwerty Tori",
                    "user_href": "/profile/Qwerty-Tori"
                },
                {
                    "user_id": "Rakesh.vsr",
                    "user_href": "/profile/Rakesh-vsr"
                },
                {
                    "user_id": "Pedro Gambaro de Abreu",
                    "user_href": "/profile/Pedro-Gambaro-de-Abreu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex Kritchevsky",
                "href": "/profile/Alex-Kritchevsky"
            },
            "answer_text": "Firstly, both transverse and longitudinal waves exist in the ocean. Waves in the ocean move perpendicular to the shore, so the longitudinal waves are the in-and-out motion of the tides, where energy is transferred towards the shore. The transverse motion would be perpendicular to this, so, the up-and-down motion of the sea - a very real phenomenon for anyone who's ever been seasick.So why do we say transverse waves can't travel in a liquid?Well, a transverse wave requires a restoring force in the wave's direction. In a solid, there's very present electromagnetic forces holding those atoms together; in a liquid or gas we don't expect a particle to get a push back when it goes down, it just keeps going and others take its place.The surface of a liquid allows for for transverse waves, but they dissipate rapidly below the surface so they don't really act like you'd imagine a wave to in a large body of matter. So I suppose it's arbitrary whether we call these transverse or not; I've seen it both ways. Also, we can imagine that a transverse wave could work in a very viscous liquid; however, it will still dissipate very quickly. ",
            "date": "Answered April 28, 2011",
            "views": "46",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "M Zeeshan Afzal",
                    "user_href": "/profile/M-Zeeshan-Afzal"
                },
                {
                    "user_id": "Alexander Silalahi",
                    "user_href": "/profile/Alexander-Silalahi"
                },
                {
                    "user_id": "Md Mostofa",
                    "user_href": "/profile/Md-Mostofa-21"
                },
                {
                    "user_id": "Noel De La Cruz",
                    "user_href": "/profile/Noel-De-La-Cruz-5"
                },
                {
                    "user_id": "Evert De Ruiter",
                    "user_href": "/profile/Evert-De-Ruiter-1"
                },
                {
                    "user_id": "Shivam Tiwari",
                    "user_href": "/profile/Shivam-Tiwari-1097"
                },
                {
                    "user_id": "Warren Franklin",
                    "user_href": "/profile/Warren-Franklin-2"
                },
                {
                    "user_id": "Nathan Petrangelo",
                    "user_href": "/profile/Nathan-Petrangelo"
                },
                {
                    "user_id": "Touseef Ahmad",
                    "user_href": "/profile/Touseef-Ahmad-29"
                },
                {
                    "user_id": "Mohit Ishpupyani",
                    "user_href": "/profile/Mohit-Ishpupyani"
                }
            ]
        }
    ]
}