{
    "title": "If two objects with the exact same momentum collide in a perfectly inelastic collision, what happens? How is momentum conserved? - Quora",
    "tags": [
        "Angular Momentum (physics)",
        "Momentum (physics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Philip Freeman",
                "href": "/profile/Philip-Freeman-3"
            },
            "answer_text": "As was pointed out by others, if the momentum is equal then they are moving in the same direction as well as having the same size of momentum. A collision is still possible in these circumstances because the objects may have different masses and velocities. Let’s consider a concrete example: A 5kg object moving at 2 m/s north collides with a 10kg object, also moving north, but at 1 m/s. Each has a momentum of 10 kg m/s north. After the collision the total momentum is 10 kg m/s N + 10 kg m/s N = 20 kg m/s North. It is an inelastic collision, so the objects stick together afterwards, wheich we can treat as one mass of 15 kg. Since the momentum is 20 kg m/s North the velocity of the combined mass is (20 kg m/s North) / (15 kg) = 1.33 m/s North I an guessing that what is confusing you is not this case, but a case where the momenta have the same size but different directions. In some cases like this it is obvious that the two objects will be at rest after collision (in fact for a perfectly inelastic collision there is some frame in which the motion is zero after the collision… that’s sort of what perfectly inelastic means). I know for many people it looks like momentum can’t be conserved if there is no momentum after the collision. But there was no momentum before the collision either! The vector nature of momentum is essential. For example our previous objects might have momenta of 10 kg m/s north and 10 kg m/s south respectively. Notice that before the collision there is a total of ZERO kg m/s, and so it is not surprising that there should be no motion afterwards. Energy, on the other hand, is a scalar and the kinetic energy really does decrease! In the case of our 5 kg object at 2 m/s north hitting the 10 kg object going 1 m/s SOUTH the total momentum before the collision is zero, but the total kinetic energy is 1/2 (5kg)(2 m/s)^2 + 1/2 (10 kg) (1 m/s)^2 = 10 J + 5 J = 15 J. After the collision the total momentum is still zero, but E_k is zero too! That 15 J will have been converted to other forms of energy (largely heat, as the molecules in the objects vibrate more due to the compression and other internal forces etc. during the collision). ",
            "date": "Answered August 23, 2016",
            "views": "62",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Abhinav Sharma",
                    "user_href": "/profile/Abhinav-Sharma-1115"
                },
                {
                    "user_id": "Brian Kiplangat",
                    "user_href": "/profile/Brian-Kiplangat-8"
                },
                {
                    "user_id": "Paul Polgar",
                    "user_href": "/profile/Paul-Polgar-1"
                },
                {
                    "user_id": "Thein Lin Aung",
                    "user_href": "/profile/Thein-Lin-Aung"
                },
                {
                    "user_id": "Steve Ryan",
                    "user_href": "/profile/Steve-Ryan-33"
                },
                {
                    "user_id": "Patrick Gono",
                    "user_href": "/profile/Patrick-Gono"
                },
                {
                    "user_id": "Manish Pal",
                    "user_href": "/profile/Manish-Pal-164"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Yerzley",
                "href": "/profile/Dave-Yerzley"
            },
            "answer_text": "First of all, the usual disclaimers: a classical discussion, the ubiquitous frictionless surfaces, no air resistance and so on. Conservation of momentum is a principle first realized as a result of Newton’s third law of motion, which we might express as “for every action there is an equal and opposite reaction.” This means that if two objects interact and object a exerts a force F on object b, then object B exerts a force of magnitude F but in the opposite direction on object A. From this the conservation of linear momentum can be derived. To change the momentum of a body, by Newton’s second law: F = ma = m(dv/dt) If we integrate, then: Ft = mΔv\twhere F is the applied force (the action or reaction) t is the total time the force is applied and Δv is the change in velocity. The quantity Ft is called impulse. Because of the equal and opposite reactions, two interacting bodies exert impulses equal in magnitude but opposite in direction on each other, so a change in momentum of one body is accompanied by an opposite change in momentum by the other. To see how this works out in practice, let’s first consider the case where the two masses are equal. In those circumstances the velocities would also be equal. Since the two masses would be traveling at the same speed in the same direction, no collision is possible. If, however, the momenta are equal in magnitude and opposite in direction, then the masses could collide head on. Since the momenta are equal in magnitude and opposite in direction, then the net momentum before the collision is zero. A perfectly inelastic collision means that the maximum amount of kinetic energy is lost. In this case that happens if the two objects stick together once they collide. To preserve the zero momentum the aggregate of the two masses will be stationary, meaning zero momentum. However, the kinetic energy after the collision is zero, meaning that the collision was perfectly inelastic. In general, maximum loss of kinetic energy occurs when two colliding objects stick together during and after the collision. If the momenta are equal but the masses are unequal, then a collision is possible because the two are moving at different velocities. Let’s say that: p1 = (m1)(v1) = (m2)(v2) = (km1)(v2) where\tp1 is the momentum of each mass m1 is the mass of the first object v1 is the velocity of m1 m2 is the mass of the second object v2 is the velocity of m2 k is the ratio of the two masses = (m2)/(m1) so v2 = [(m1)(v1)/(km1) = (v1)/k To get the momentum after the collision (p2) we use the principle of conservation of momentum, so by definition, if we get the algebra right, then momentum will be conserved: p2 = (m1 + m2)(v3) = (m1)(v1) + (m2)(v1)/k where \tv3 is the velocity after the collision and \t\tv3 = 2(v1)/(1+k) If you do the algebra you can prove to yourself that p2 = p1 You can also work out for yourself the change in kinetic energy: e2 - e1 = ½(m1)(v1)^2 + ½(m2)(v2)^2 - ½(m3)(v3)^2 where\te1 is the initial kinetic energy e2 is the kinetic energy after the collision and making the various substitutions to get an expression in terms of m1, v2 and k. If you do this you will note that if k = 1 then the change in momentum and in kinetic energy is zero. This would apply to the situation where velocities and masses were equal and the masses came into contact without an impact force. In this case no energy would be lost. If you observe this same reaction from a different frame of reference moving at velocity v3, you will see that when observed from this frame p1 = -p2, the apparent v3 from this frame is zero, and therefore the final kinetic energy is also zero. ",
            "date": "Answered August 24, 2016",
            "views": "46",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mayank Deshpande",
                    "user_href": "/profile/Mayank-Deshpande-11"
                },
                {
                    "user_id": "Nghia Nguyen",
                    "user_href": "/profile/Nghia-Nguyen-96"
                },
                {
                    "user_id": "Shane Sehgal",
                    "user_href": "/profile/Shane-Sehgal"
                },
                {
                    "user_id": "Gregor Kikelj",
                    "user_href": "/profile/Gregor-Kikelj"
                }
            ]
        }
    ]
}