{
    "title": "If the 'out of Africa' theory were true, how did extreme variations between humans evolve in such a short period of time? - Quora",
    "tags": [
        "Out-of-Africa Theory"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kenneth Archer",
                "href": "/profile/Kenneth-Archer"
            },
            "answer_text": "The “out of Africa theory” is simple, seems logical, is safe, secure and it is the only place scientists have found any skeletons. Primates are not unique to Africa. Climate is a global event not a local event. The geography of the Earth changes more quickly than science wants to admit. The Genus Homo has been around for 3 million years. The Homo sapiens has not changed for 19,000. The Homo sapien sapiens, modern humankind has been dominant for 6,000 years. The human is a wild animal that does not evolve on nature’s slow time. The human stopped evolving naturally 2.5 million years. When Genus Homo learned to use fire as a tool and a weapon, the Genus Homo started on a path to artificial evolution. Changes within the human has occurred because the human can alter its climate, environment, nourishment, and reproduction. Humans have made progress in technology and manufacturing. Humans were in the stone age until 12,000 years ago. When humans learned to use, make, and control fire, the bronze age quickly became the iron age. The steam age is 400 years old and electrical age is 150 years. None of this growth was natural. Man made it and shaped its environment until humans can not longer live in the wild. If humans have changed, it would be to become a weaker, more fragile human incapable of surviving without electricity. With advancement is weapons, a loss of electricity would kill 90% of the people in the USA. ",
            "date": "Answered November 22, 2017",
            "views": "273",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "David M. Prus",
                    "user_href": "/profile/David-M-Prus"
                },
                {
                    "user_id": "John Mortimer",
                    "user_href": "/profile/John-Mortimer-3"
                },
                {
                    "user_id": "Jaime Alonso Rodríguez",
                    "user_href": "/profile/Jaime-Alonso-Rodríguez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martijn Vos",
                "href": "/profile/Martijn-Vos"
            },
            "answer_text": "“If the 'out of Africa' theory were true, how did extreme variations between humans evolve in such a short period of time?” There are no extreme variations between humans (as many others have already pointed out). But more than that, the biggest genetic variations between humans never left Africa. Pick two random sub-Saharan Africans and two people from anywhere else in the world, and the Africans are likely to be far more different in a genetic level than the European, Asian and/or Native American. Most of the genetic diversity in humans appeared long before Homo Sapiens left Africa. The people leaving Africa were genetically not all that diverse, and it’s that relatively small group that ended up populating Asia, Europe, Oceania and America. I realise that this may seem wrong and contrary to what you may have learned, particularly if you were raised in a predominantly white, somewhat racist culture. Racism focuses on a very few very superficial features, but those features are not remotely representative of the true genetic diversity of humanity, and are mostly restricted to adaptations to different climates with less sun and more cold. But humanity goes far deeper than skin-deep. But even if you focus just on skin, it’s useful to check just how many different skin colours there are in Africa. You may have been taught about white, black, yellow and red skin, but what you call black, ranges from fairly light brown to truly coal black, with many subtle variations in hue. Go visit Africa. Many people that you have come to see as “black” would be considered white there. There are populations (like the San people) that are genetically further removed from any other human population than any other two populations you can find. That means that any random non-San African is more closely related to Europeans and Native Americans than to the San. There’s a lot about Africa that most people are completely unaware of. Africa is easily the most underrated continent on Earth. ",
            "date": "Answered November 22, 2017",
            "views": "784",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Paul du Berger",
                    "user_href": "/profile/Paul-du-Berger-1"
                },
                {
                    "user_id": "Timothy Paris",
                    "user_href": "/profile/Timothy-Paris-1"
                },
                {
                    "user_id": "Sangi Arach",
                    "user_href": "/profile/Sangi-Arach"
                },
                {
                    "user_id": "David M. Prus",
                    "user_href": "/profile/David-M-Prus"
                },
                {
                    "user_id": "Juba Malos",
                    "user_href": "/profile/Juba-Malos"
                },
                {
                    "user_id": "Frankie Sullivan",
                    "user_href": "/profile/Frankie-Sullivan-9"
                },
                {
                    "user_id": "Mbeti Hitt",
                    "user_href": "/profile/Mbeti-Hitt"
                },
                {
                    "user_id": "Hemelton Matlonya",
                    "user_href": "/profile/Hemelton-Matlonya"
                },
                {
                    "user_id": "John Mortimer",
                    "user_href": "/profile/John-Mortimer-3"
                },
                {
                    "user_id": "TS",
                    "user_href": "/profile/TS-167"
                }
            ]
        }
    ]
}