{
    "title": "If we had a base on the moon what kind of research could be done? - Quora",
    "tags": [
        "The Moon (astronomy)",
        "NASA",
        "Space Travel",
        "Scientific Research",
        "Space Exploration",
        "Research",
        "Outer Space",
        "Planetary Science",
        "Astronomy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Baker",
                "href": "/profile/Steve-Baker-100"
            },
            "answer_text": "Well, we could look at Moon rocks - but we have 382 kg of the stuff right here on Earth from the Apollo missions - sampled from six different locations - and we’ve already put a geologist onto the moon to pick good rocks to bring home. We might consider looking at the polar regions where there is water - but we know it’s there - it’s hard to say what we could learn that a rover couldn’t tell us. We’d be able to do some human factors research in 1/6th gravity - but this is of limited value if humans aren’t going to be living on the moon. It’s kinda going to be like the ISS…a massively costly research station with nothing much of importance to research. But the cost of maintaining a moon base would be extreme. At the bargain price that SpaceX charges - a single resupply mission to the ISS costs $150 million - and that’s like half of what other companies charge. To send resupply missions to the Moon (which they’d need ever bit as often as the ISS does) cannot be done with a puny reusable Falcon 9. They’d need a much larger craft - and aside from the first stage, none of it would be re-usable. Furthermore - we’d have to be able to return crew from the Moon - about every 3 to 6 months - and each crew exchange would have a price tag similar to an Apollo mission…that’s a LOT more than a soyuz crew capsule or the soon-to-be Dragon Crew capsule. Launching from the lunar surface requires fuel that has to be brought there in a spacecraft from Earth every single time. I doubt VERY much that when push comes to shove - that any country will pay for a moon base without VERY good reason - and I don’t see any very good reasons for being out there. Even the ISS is an “international” space station - and it’s taken a consortium of countries to fund it. With international cooperation having been utterly trashed by Donald Trump - there is ZERO chance of getting another consortium together. The ONLY thing that we know is of value on the moon is Helium-3. That might be useful in future fusion reactors - but robotic missions can handle that research - and nobody seems very interested in putting helium-3 research onto their landers right now - so I surmise that the fusion researchers aren’t currently too excited about it. ",
            "date": "Answered January 20, 2019",
            "views": "95",
            "upvotes": " View 106 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kanishg Shiva",
                    "user_href": "/profile/Kanishg-Shiva"
                },
                {
                    "user_id": "William Fisher",
                    "user_href": "/profile/William-Fisher-106"
                },
                {
                    "user_id": "Jatin Nanda",
                    "user_href": "/profile/Jatin-Nanda"
                },
                {
                    "user_id": "Thomas Domit",
                    "user_href": "/profile/Thomas-Domit"
                },
                {
                    "user_id": "Frederick Mikkelsen",
                    "user_href": "/profile/Frederick-Mikkelsen"
                },
                {
                    "user_id": "Sabesan Sundaralingam",
                    "user_href": "/profile/Sabesan-Sundaralingam"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Einzbern-1"
                },
                {
                    "user_id": "Pranav",
                    "user_href": "/profile/Pranav-271"
                },
                {
                    "user_id": "Jens Andreasen",
                    "user_href": "/profile/Jens-Andreasen-2"
                },
                {
                    "user_id": "Michael Ellison",
                    "user_href": "/profile/Michael-Ellison-31"
                }
            ]
        },
        {
            "author_info": {
                "name": "Corian Valsentres",
                "href": "/profile/Corian-Valsentres"
            },
            "answer_text": "Most research done on the Moon would be studies of the geology and structure of the Moon. Any other kind of astronomical research could be done just as easily in space or on the Earth, and physical research could be done far more easily on the Earth. And although there is a point between the Earth and Moon where their gravity cancels (which is well outside the Moon; everywhere on or in the Moon there is substantial gravity, even though not as high as on the Earth), zero-gravity research can be done on any orbiting satellite of any body (e.g., on the ISS, which is a lot closer to the Earth than the Moon, and a lot easier to get to). There are a couple of things of astronomical interest that might be useful. For instance, when some distant object (e.g., Ultima Thule) passes in front of a star it’s difficult to know where its shadow will fall. If it didn’t fall on the Earth but did fall on the Moon, it would give us an extra chance to observe such events. Also, if we could set up telescopes on the Moon and link them to telescopes on the Earth to form a lunar-orbit-size interferometer, it could give us sharper ‘images’ of distant objects (though making something like that work would be a tremendous challenge, as aside from the light-travel time between Earth and Moon, clocks on the surface of the Moon run at a slightly different rate than clocks on the surface of the Earth because of its lower gravity; so it might be a century or two from now before that becomes practical). ",
            "date": "Answered January 1, 2019",
            "views": "191",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rory Coker",
                    "user_href": "/profile/Rory-Coker"
                },
                {
                    "user_id": "Peter Švančárek",
                    "user_href": "/profile/Peter-Švančárek-1"
                },
                {
                    "user_id": "Charles William Peters",
                    "user_href": "/profile/Charles-William-Peters"
                }
            ]
        }
    ]
}