{
    "title": "If water expands when frozen and therefore melting of the poles would decrease the volume that is released from the poles, why would ocean levels increase with the melting of the poles? - Quora",
    "tags": [
        "Melting",
        "Oceanography",
        "Climate Change",
        "Earth (planet)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brett Harper",
                "href": "/profile/Brett-Harper-4"
            },
            "answer_text": "All other answers so far are incorrect. The rise in water level isn't due to ice caps melting with the resulting water raising the sea level. It is due to the thermal expansion of the ocean water. Of the approximately 332,500,000 cubic miles of water on the Earth, 1.7% is freshwater held in glaciers, ice caps, and permanent snow. Ignoring the permanent snow, the ice caps and glaciers make up a negligible amount compared to the oceans. This amount of water melting would barely*** affect ocean levels. The main culprit is thermal expansion. As objects heat up, they expand. Water is no different. If the oceans raise 1°, it is the ENTIRE OCEAN that is now 1° warmer, all 320,862,000 cubic miles of ocean. 1° might not cause that much expansion, but multiplied by the entire ocean, is drastic. https://www.usgs.gov/special-topic/water-science-school/science/ice-snow-and-glaciers-and-water-cycle?qt-science_center_objects=0#qt-science_center_objects ",
            "date": "Answered March 19, 2020",
            "views": "76",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Michael Martin",
                    "user_href": "/profile/Michael-Martin-111"
                }
            ]
        },
        {
            "author_info": {
                "name": "Riggald Eux",
                "href": "/profile/Riggald-Eux"
            },
            "answer_text": "Sea ice - icebergs floating in the sea - melting does not make the sea level rise. The seas rise from different ice melting.. The seas rise for 4 main reasons: the seas and oceans are getting warmer. The seas and oceans expand as they get warmer.The ice on top of Greenland is melting. That meltwater pours into the sea. More water in the sea makes the sea deeper. Ice on the land at Western Antarctica is also doing this.The ice on top of Greenland is sliding into the sea. More ice on the sea makes the sea deeper. Just like adding a handful of icecubes to to a tall, full, drinks glass makes it overflow. The ice on Western Antarctica is also doing this.In addition, lots of the sea ice at Antarctica is not actually floating in the sea. It is frozen into the land, like a bookshelf attached to a wall. When that joint melts, the whole ice shelf falls into the water. More ice floating in the sea makes the sea deeper.In addition, you seem to be mistaking 2 things. A) reducing the volume and B) increasing the volume, but by slightly less than you were about to have You talk about “decreasing the volume” but we are actually increasing the volume, but by up to 4% less than raw volume of fresh water ice that we add. Any part of an iceberg that sticks up out of the water - known as the tip of the iceberg - is not adding to the volume of the ocean. ",
            "date": "Updated April 7, 2020",
            "views": "186",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alan J. Hesse",
                    "user_href": "/profile/Alan-J-Hesse"
                },
                {
                    "user_id": "Austin Bugden",
                    "user_href": "/profile/Austin-Bugden"
                },
                {
                    "user_id": "David L. Clinton",
                    "user_href": "/profile/David-L-Clinton"
                }
            ]
        }
    ]
}