{
    "title": "If we pass the point of no return for climate change, what is the next focus for sciences to help prepare the world for irreversible change? - Quora",
    "tags": [
        "Climatology",
        "Climate Change",
        "The Environment"
    ],
    "response": [
        {
            "author_info": {
                "name": "Blair Blakely",
                "href": "/profile/Blair-Blakely-1"
            },
            "answer_text": "What is this ‘point of no return’ you speak of? Return to what? Or are you one of those people who thinks the climate has always been the same in the past? Perhaps you are unaware that climate change has happened before and is, in fact, always occurring? Yes, human activity has altered the time line of the change in climate , just as volcanos, comet or asteroid strikes, solar activity and other occurrences can and have altered it in the past. New science will have little to do with how we handle climate change. Just as humans have done in the past, we will alter our personal environments when possible and adapt as we have in the past. ",
            "date": "Answered October 25, 2020",
            "views": "154",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mark Schaefer",
                    "user_href": "/profile/Mark-Schaefer-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Woolverton",
                "href": "/profile/Bill-Woolverton"
            },
            "answer_text": "There is no one point of no return. In any case the idea is to remove carbon from the atmosphere either through regenerative agriculture or free air capture of carbon dioxide. Simply reducing emissions won’t do the job, and we can’t stop using fossil fuels overnight. ",
            "date": "Answered October 28, 2020",
            "views": "51",
            "upvotes": "0"
        }
    ]
}