{
    "title": "In an atom, 99.9% of the space is empty. Does that mean that what we are seeing and touching is not actually there? - Quora",
    "tags": [
        "Atoms",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Effy John",
                "href": "/profile/Effy-John"
            },
            "answer_text": "Haha PLOT-TWIST. Did you really think you were touching things? *Cue dramatic music* TOUCH IS AN ILLUSION In reality, when you try “Touching” something, and your hand seems to touch, it is really actually the electrons in the atoms on the boundary of your hand repelling the electrons in the boundary of the object. You never really come in contact, strictly speaking. To answer your question, imagine you're looking at a piece of sponge. Most of it is air, and very very little of it is solid. Does that mean it doesn't exist? Yet another example. A slab of glass. Sure, when you look at something, like maybe a leaf, what you “see” is the light being reflected off the light. But a clean high quality glass slab doesn't reflect much, it just transmits all it's light. How do you see it then? Glass refracts light. So when you see glass, strictly speaking, you don't see glass. All you're seeing is a patch of space, where light is getting bent. Does that mean glass doesn't exist? And what about the act of seeing. Yup, another lie. All that's happening is that a bunch of photons hit the rods and cones in your eye. Electrons get excited, and bonds are temporarily broken. Excited electrons cause nerves to fire, and signal reaches your brain. Wait a minute…. Does that mean, if I can take some sort of magical torch light and shine photons in the exact order and position as what you would see in the real world(cough cough television cough cough), into your eye, you can't make out the difference? Uh oh. Does anything exist? Ouch. Well, when you go too deep into physics, things get pretty screwy. But what you need to understand is that, that empty space and those tiny particles ARE INDEED THE THINGS YOU SEE. What you are seeing IS emptiness. People have a difficulty in accepting that they are seeing emptiness. Seeing is simply receiving photons. You only need a bunch of electrons ready to emit for that. The rest of the space is irrelevant. ",
            "date": "Updated August 1, 2017",
            "views": "439",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vivek Selvarajan",
                    "user_href": "/profile/Vivek-Selvarajan"
                },
                {
                    "user_id": "Shaaban Karim",
                    "user_href": "/profile/Shaaban-Karim"
                },
                {
                    "user_id": "Keerthan Aline",
                    "user_href": "/profile/Keerthan-Aline"
                },
                {
                    "user_id": "S.S Anish Kumar",
                    "user_href": "/profile/S-S-Anish-Kumar"
                },
                {
                    "user_id": "Deepak Chauhan",
                    "user_href": "/profile/Deepak-Chauhan-40"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Wrixon EurIng",
                "href": "/profile/David-Wrixon-EurIng"
            },
            "answer_text": "No, to other barely perceptible objects such as ourselves then it is very real. ",
            "date": "Answered June 22, 2018",
            "views": "38",
            "upvotes": "0"
        }
    ]
}