{
    "title": "In cathode ray experiment What is the reason behind the green glow observed in glass of tube? - Quora",
    "tags": [
        "Cathode Ray",
        "Cathode Ray Tubes",
        "Green (color)",
        "Electrons",
        "Atoms",
        "Electricity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pierre Smith",
                "href": "/profile/Pierre-Smith-17"
            },
            "answer_text": "Phosphor persistence Various phosphors are available depending upon the needs of the measurement or display application. The brightness, color, and persistence of the illumination depends upon the type of phosphor used on the CRT screen. Phosphors are available with persistences ranging from less than one microsecond to several seconds.[18] In television sets and computer monitors, the entire front area of the tube is scanned repetitively and systematically in a fixed pattern called a raster. An image is produced by controlling the intensity of each of the three electron beams, one for each additive primary color (red, green, and blue) with a video signal as a reference.[2] In all modern CRT monitors and televisions, the beams are bent by magnetic deflection, a varying magnetic field generated by coils and driven by electronic circuits around the neck of the tube, although electrostatic deflection is commonly used in oscilloscopes, a type of electronic test instrument.[2] For visual observation of brief transient events, a long persistence phosphor may be desirable. For events which are fast and repetitive, or high frequency, a short-persistence phosphor is generally preferable.[19]  An Oscilloscope showing Lissajous curve Cathode ray tube - Wikipedia ",
            "date": "Answered April 15, 2018",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shehzad Ahmad",
                "href": "/profile/Shehzad-Ahmad-53"
            },
            "answer_text": "at macroscopic scale the anwer is that the very fast moving electrons comes from the eletronic gun collide with the particle of the medium due which green glow observed as a result of ionization. at microscopic level the draft electrons aline themselves in one direction of the metal and goes to higher energy level as a result a visible light i.e green glow shows ",
            "date": "Answered July 12, 2018",
            "views": "15",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sahar Aqeel",
                    "user_href": "/profile/Sahar-Aqeel-1"
                },
                {
                    "user_id": "Aramilal Dhakad",
                    "user_href": "/profile/Aramilal-Dhakad"
                }
            ]
        }
    ]
}