{
    "title": "In free body diagram calculations, why do we subtract tension (T) from weight (mg) or vice versa to calculate acceleration? - Quora",
    "tags": [
        "Mechanics (physics)",
        "Diagrams"
    ],
    "response": [
        {
            "author_info": {
                "name": "Praveen Jangra",
                "href": "/profile/Praveen-Jangra-1"
            },
            "answer_text": "It will depend on the situation, whether to subtract or add tension. To determine this you should have a good knowledge of Newton’s second law of motion. suppose that the tendency of a mass to move is in the +X direction then you have to subtract the forces which are acting in the negative X direction from the forces that are acting in the +X direction and equate it to the mass times acceleration. This acceleration will be in +X direction. So if a mass is connected to a rope and has a tendency to move downwards then you have to subtract tension from mg and equate it to mass times acceleration. If the tendency of the same mass to move is upward then you have to subtract mg from the tension. ",
            "date": "Answered November 10, 2016",
            "views": "16",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Odeh Abedsalam",
                    "user_href": "/profile/Odeh-Abedsalam"
                },
                {
                    "user_id": "Flaming Lion",
                    "user_href": "/profile/Flaming-Lion-2"
                },
                {
                    "user_id": "Rekha Rajpurohit",
                    "user_href": "/profile/Rekha-Rajpurohit-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ankit Gupta",
                "href": "/profile/Ankit-Gupta-1656"
            },
            "answer_text": "It is simple.. I can answer u from the robotic concept that we study in +2 by the so called great indian education system (no offense)….and by jee coaching institutes. Force is always directional in nature .. and Newton laws says that sum of all forces in any direction on a body is equal to product of it's mass and acceleration in that direction .. Now to your concern .. tension(force) and mg (force) is opposite in direction .. Case1: if a body is going downwards against the tension force we can say that here mg>T. And we assume the direction of acceleration be towards the mg …so here we write Mg-T=Ma Case2:if a body is going upwards against the mg force we can say that here mg<T. And we assume the direction of acceleration be towards the tension(T) …so here we write T-Mg =Ma We substraction forces to get a net force in single direction so that we can apply Newton law..with net force and acceleration in that direction … ",
            "date": "Answered May 11, 2018",
            "views": "692",
            "upvotes": "0"
        }
    ]
}