{
    "title": "In Star Trek, are food replicators also used by everyday people as household items? - Quora",
    "tags": [
        "Star Trek (TV Series)",
        "Star Trek: The Next Generation (TV series)",
        "Star Trek (creative franchise)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steven Matish",
                "href": "/profile/Steven-Matish"
            },
            "answer_text": "Replicators are used only in areas that require them due to space constraints. Even on the Enterprise-E, for all its technological wonderments, people still preferred fresh vegetables, as mentioned by Lt. Hawke of the onboard hydroponics bay onboard. As captain Sisko and others have complained about on occasion, and even his guest Senator Vreenak, replicators often have a hard time replicating the real essence of certain foods and drinks. Picard’s family still tends their vineyards, even as of ST: Picard. The fact that Sisko’s dad owns a restaurant where the food in still prepared, is a testament to this. Old grandpa Sisko had his son scrubbing potatoes in the back alley! He’s an old-fashioned type. Also, let’s not forget, replicators are seen on starships more than on planets. You need a source of antimatter in addition to power and computing technology in order to make a replicator work. Antimatter can get converted into any organic pattern, hence replicated food and drink. So, you probably see very few on planets like Earth, since antimatter warp reactors would be inherently dangerous in the wrong hands, and security precautions would need to be in place. If a photon torpedo, with 1.5 kg of matter and 1.5 kg of antimatter are the equivalent of a 100 megaton nuclear bomb, well, you could level a major Earth city with just one single replicator malfunction! There are probably replicators on Earth, but they are more than likely heavily inspected and licensed. Even at Starfleet Academy in San Francisco, you see the occasional shuttlepod zipping by. There are probably regulations against using Starship technologies or having excess traffic in certain areas, understandably. ",
            "date": "Answered January 13, 2020",
            "views": "42",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Destan Hoots",
                "href": "/profile/Destan-Hoots"
            },
            "answer_text": "On Earth and most Federation colonies, yes. Essentially everyone on Earth had one in their home or had unlimited access to them. Sometimes replicators were even supplied by the Federation to worlds that had need of them. From TNG on, they were essentially a mainstay in most cultures. There are those who preferred not to use them however. Most earth restaurants prepared food naturally. Many people and even entire cultures preferred to keep things the old way. Also, other races preferred “real” food. The Klingons kept gagh (live worms resembling earth worms), targ (a tusked beast resembling a bore with sparse fur), and other animals on their ships, slaughtering them for a feast. There were also more naturalist colonies that liked to live life without too much tech.” But, essentially, all members of the Federation, and all friends of the Federation had access to replicators. ",
            "date": "Answered January 13, 2020",
            "views": "182",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jack Wells",
                    "user_href": "/profile/Jack-Wells-65"
                },
                {
                    "user_id": "Miles Hunt",
                    "user_href": "/profile/Miles-Hunt-2"
                },
                {
                    "user_id": "Tommy C. Lim Jr.",
                    "user_href": "/profile/Tommy-C-Lim-Jr"
                }
            ]
        }
    ]
}