{
    "title": "In the vacuum between the galaxies, is there a vacuum with no atoms, or is there a vacuum with few atoms? - Quora",
    "tags": [
        "Vacuum (space)",
        "Galaxies",
        "Atoms",
        "Cosmology",
        "Outer Space",
        "Astrophysics",
        "Astronomy",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Keith Allpress",
                "href": "/profile/Keith-Allpress"
            },
            "answer_text": "The idea you have in your mind is not the vacuum of science, it is the vacuum of ancient philosophy. The philosophic idea of complete emptiness is no longer useful, if it ever was. Scientists are still interested in what cannot exist, but only to explain what does. In place of that ancient idea we now have a more sophisticated view of space than the ancients could have ever imagined, and atomism as the Greeks understood it, has been demolished. The chemical atom is not atomic in the way that philosophy required, it is composed of fundamental forces which are fully democratic in their use of space. Feynman complained that it had reached the point where the points in space were overloaded, each having too much work to do. Space is more relationship that thing in its own right so it all becomes a mathematical puzzle in the end, how to connect the dots so the whole business of matter and energy interact to produce the observable phenomena, where simple space of everyday life is merely special case of a more general conception of space. The modern conception is based on mathematical knowledge of what it means to be a, space in mathematical terms, and physics cherry picks from mathematics to find models compatible with experiment and observation. The idea of space you carry on your head turns out to be just one example of a whole zoo of spaces, that can contain your primitive experiential conception of space as a special case. ",
            "date": "Answered December 18, 2019",
            "views": "196",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Billy-Perry-III"
                }
            ]
        },
        {
            "author_info": {
                "name": "David A. Smith",
                "href": "/profile/David-A-Smith-13"
            },
            "answer_text": "Vacuum with few atoms (usually as plasma) and LOTS of photons. Most of the “non-Dark Matter” in the Universe is between galaxies. Plus there are strings of “Dark Matter” pulled out between galaxies that passed one through the other. We even see the spectra of normal stars originating from “Voids”. The Rayleigh Criterion limits what we can actually image. ",
            "date": "Answered December 18, 2019",
            "views": "51",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Guilherme Appel",
                    "user_href": "/profile/Guilherme-Appel"
                }
            ]
        }
    ]
}