{
    "title": "In which direction will a compass needle point when a compass needle is placed in the middle of the bar magnet? - Quora",
    "tags": [
        "Compasses",
        "Magnetic Fields"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sudesh Kolte",
                "href": "/profile/Sudesh-Kolte"
            },
            "answer_text": "There needs to be clarity in what the question refers to as 'middle of the bar magnet'. The field lines of the magnet changes w.r.t. the structural changes in bar magnet.If compass is placed centrally over the length of a magnet, the north of the compass shall point to (attract to) south of the magnet.If the magnet is cut in to two, to place the compass in the 'middle', the magnet no more remains one, but acts like two different entities and compass orients itself in N to S as an obvious way.If a slot is cut in to the central region to place the compass in the literal middle of the magnet, the field orientation of the original magnet again changes, but the overall NS polarity still remains the same and north of compass shall hook up with south of the mag. ",
            "date": "Answered September 3, 2017",
            "views": "4",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Divya Mangal",
                    "user_href": "/profile/Divya-Mangal-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gunjan Garg",
                "href": "/profile/Gunjan-Garg-50"
            },
            "answer_text": "If compass is placed centrally over the length of a magnet, the north of the compass shall point to (attract to) south of the magnet.If the magnet is cut in to two, to place the compass in the 'middle', the magnet no more remains one, but acts like two different entities and compass orients itself in N to S as an obvious way. If a slot is cut in to the central region to place the compass in the literal middle of the magnet, the field orientation of the original magnet again changes, but the overall NS polarity still remains the same and north of compass shall hook up with south of the magnet. ",
            "date": "Answered May 19, 2018",
            "views": "17",
            "upvotes": "0"
        }
    ]
}