{
    "title": "International research team has found a lost river that ran through Thar Desert, 170,000 years ago near Bikaner, Rajasthan. What's your opinion? - Quora",
    "tags": [
        "Thar Desert",
        "Deserts (physical geography)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Swati Punaini",
                "href": "/profile/Swati-Punaini"
            },
            "answer_text": "The presence of a river running through the central Thar Desert would have offered a life-line to Paleolithic populations, and potentially an important corridor for migrationsThe timeframe over which this river was active also overlaps with significant changes in human behaviour in the regionResearchers have found the evidence of a \"lost\" river that ran through the central Thar Desert, near Bikaner, as early as 172 thousand years ago, and may have been a life-line to human populations enabling them to inhabit the region.The findings, published in the journal Quaternary Science Reviews, represent the oldest directly dated phase of river activity at Nal Quarry in the central Thar Desert. *Paleolithic means-relating to or denoting the early phase of the Stone Age, lasting about 2.5 million years, when primitive stone implements were used. ",
            "date": "Answered October 22, 2020",
            "views": "8",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Gaja Vasisht",
                    "user_href": "/profile/Gaja-Vasisht"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bhanu Padmo",
                "href": "/profile/Bhanu-Padmo"
            },
            "answer_text": "Something looks like sugar. But it doesn’t taste like sugar. You conclude that it isn’t sugar. Something doesn’t look like sugar. But it tastes like sugar. You conclude that it is sugar. So, you trust tongue more than the eye in the world of perception of edible chemicals, provided the object to be perceived is brought into the perceptible ranges of both. Tongue can perceive the very molecules when the eye can’t. The difference in perceptions of the tongue and the eye vary in kind, not in degree merely. The tongue’s feat in this regard is unachievable by the eye. Transfer this analogy to firstly the domain of “ownership” and then, to the domain of “knowing of the owned thing”. When you “own” an asset, the experience of ownership becomes unique to you. Another person, that is, a non-owner won’t be able to experience that ownership ever ordinarily. If you take that ownership as a “perception”, a non-owner may be deemed to be a blind person in that respect. The Eye-Tongue Analogy becomes handy here to understand and differentiate two types of disparate feelings. Now come to the knowing of the owned thing. You will know the owned thing in a way different from the way a non-owner would know it. The Eye-Tongue Analogy applies here again. This analogy may be extended to “ownership-management scenario” in which the perceptions of the owner and the manager (the employed/ the professional) would vary widely and radically. Finally, we have to take the analogy to the world of historical study where you will find two types of involved beings. The first type would be inherently “owners of history”. The other type would be employees (professionals) in the history project. History Academy is too essentially a history project. It is a national project, although. The point being made is that historicity would be perceived quite differently by these two types of involved beings. For one historicity and historical interest will be blood-deep. For the other, it will be skin-deep, that is, salary-deep, funds-deep. When this is being pronounced, we are not discounting the “ideal sense of morality” in which a non-owner could, through vicariousness and empathy, sense ownership and could contribute to make the mankind more non-dichotomous and seamless. In a similar way, the history workers ideally should have been history owners making national historical involvement seamlessly unitary. That could certainly be achieved through consolidation of the history-owner’s sovereign historical sense into an institutionalized authority that would keep the distraction of the history workers under control and help them become the history owners themselves. But some sort of contrary has been happening all along that has almost completely gnawed away national ownership of history. As a consequence, the national historical sovereignty has fallen prey to history workers’ whim and arbitrariness. This argument may be extended from archaeology to paleontology, geology or even Einstein-recommended “search for fourth dimension”. The national issue is if the manager is deciding on what to manage. The information you have passed down to us is just another instance akin to one in which a greedy unscrupulous businessman sells trash for food. Haven’t you realized that the whole bulk of written Ancient Indian History produced so far is close to null and void – or worse than that, importunately self-effacing? ",
            "date": "Answered October 28, 2020",
            "views": "207",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Manav Kapur",
                    "user_href": "/profile/Manav-Kapur-7"
                },
                {
                    "user_id": "Mohit Panwar",
                    "user_href": "/profile/Mohit-Panwar-168"
                },
                {
                    "user_id": "Gaja Vasisht",
                    "user_href": "/profile/Gaja-Vasisht"
                }
            ]
        }
    ]
}