{
    "title": "Is a distance smaller than the Planck length physically meaningful? - Quora",
    "tags": [
        "Planck Units",
        "Quantum Mechanics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joshua Engel",
                "href": "/profile/Joshua-Engel"
            },
            "answer_text": "Setting aside the text question, which has been answered Planck’s number of times on Quora including Is there anything smaller than a Planck length?, there’s an interesting question in the details. Drop an object to earth and the earth does respond by more than a Planck length. Drop a 1 kg weight from 1 meter, and the earth comes to meet it by about a yoctometer, 10^-24 meters. That’s a trillion times larger than a Planck length, 10^-35 meters. That isn’t actually meaningful. The Earth isn’t moving in Planck lengths. You can’t see it not because of anything quantum but because we don’t have measuring sticks capable of measuring that small a change (percentage-wise). And the earth is neither rigid nor uniform, so the actual motion is much more complicated. But just as a matter of magnitudes, even the earth moving towards a small object is still considerably larger than a Planck length. ",
            "date": "Answered July 25, 2017",
            "views": "16",
            "upvotes": " View 47 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Steven Zitis",
                    "user_href": "/profile/Steven-Zitis-1"
                },
                {
                    "user_id": "Doug O'Brien",
                    "user_href": "/profile/Doug-OBrien-10"
                },
                {
                    "user_id": "Jordan Fearn",
                    "user_href": "/profile/Jordan-Fearn"
                },
                {
                    "user_id": "Natalie Wong",
                    "user_href": "/profile/Natalie-Wong-103"
                },
                {
                    "user_id": "Prabhanjan Sahoo",
                    "user_href": "/profile/Prabhanjan-Sahoo-4"
                },
                {
                    "user_id": "Indi Newall",
                    "user_href": "/profile/Indi-Newall-1"
                },
                {
                    "user_id": "Vincent Hsu",
                    "user_href": "/profile/Vincent-Hsu-22"
                },
                {
                    "user_id": "Brad Kelly",
                    "user_href": "/profile/Brad-Kelly-5"
                },
                {
                    "user_id": "Henry Norman",
                    "user_href": "/profile/Henry-Norman-3"
                },
                {
                    "user_id": "Kamran Khan",
                    "user_href": "/profile/Kamran-Khan-92"
                }
            ]
        },
        {
            "author_info": {
                "name": "David A. Smith",
                "href": "/profile/David-A-Smith-13"
            },
            "answer_text": "Yes. Photons, electrons, neutrinos, and individual quarks are POINT sized, smaller than Planck dimensions. So clearly, this is “physically meaningful”, or at least “size scale” is NOT fundamental in Nature. Which is why you can have Universal expansion without breaking physics. [1610.00012] Cosmic Inflation from Emergent Spacetime Picture “When something very small falls to the ground, the Earth also moves slightly upwards, but that would be a distance smaller than Planck length. Could this really be happening?” Sure, but ultimately that doesn’t matter. There is no spacetime (or size, or speed) in the quantum realm. Our Universe is constructed on / over / using the quantum realm as a sort of underlayment (like a roadbed), and size is an emergent property. Which means Planck units have always been, and will always be, failed Dimensional analysis - Wikipedia. Not some sort of numerology with secret meaning for its cabal. ",
            "date": "Answered July 25, 2017",
            "views": "423",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brad Kelly",
                    "user_href": "/profile/Brad-Kelly-5"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Luxi-Turna"
                },
                {
                    "user_id": "Larold Goodspeed",
                    "user_href": "/profile/Larold-Goodspeed"
                },
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                },
                {
                    "user_id": "Paul Nations",
                    "user_href": "/profile/Paul-Nations-1"
                }
            ]
        }
    ]
}