{
    "title": "Is America great after four years of Trump? - Quora",
    "tags": [
        "Make America Great Again (campaign slogan)",
        "Donald Trump (politician, business person)",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "De’Mario Edwards",
                "href": "/profile/De-Mario-Edwards"
            },
            "answer_text": "Well, the country is in turmoil and divided against each other, America’s public image and standing among the world has plummeted, no one trust America, America’s being ravaged by a super disease and people are being laid off left and right, a recession is coming if it isn’t already here, fires and storms are pounding the country and three of America’s biggest enemies are practicing military drills together, most likely against mock U.S. military assets and all three of them are hacking the U.S. elections together and even the Presidential debates look like a joke. But, this is what Americans wanted when they voted him in. I’m sure plenty of people feel this is a great improvement of America. ",
            "date": "Answered September 30, 2020",
            "views": "49",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brian Ashworth",
                    "user_href": "/profile/Brian-Ashworth-2"
                },
                {
                    "user_id": "Maria Schwab",
                    "user_href": "/profile/Maria-Schwab"
                },
                {
                    "user_id": "Hal Greove",
                    "user_href": "/profile/Hal-Greove"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Smith",
                "href": "/profile/Eric-Smith-2627"
            },
            "answer_text": "Oh absolutely. Rhetoric and little invasions having gotten nice big bonfires burning in some cities, and they really look nice and toasty orange to any space observers. On the ground, citizens look great right where they belong, under the boot of the state. California is on fire and action was slow. Again, really a piece of art to anyone observing from space. This flabby nation is now getting fit, shedding 200,000 pounds through downplaying the pandemic, another 100,000 pounds soon to be lost by years end, and hundreds of thousands more after that. The world including our immediate neighbors see Americans as a covid a class apart, so powerful that they cannot at any cost be admitted into the country even for a quick drive across back to the Alaskan exclave. ",
            "date": "Answered October 3, 2020",
            "views": "22",
            "upvotes": "0"
        }
    ]
}