{
    "title": "Is alkaline water better for you than regular water? Is there evidence to support this claim? - Quora",
    "tags": [
        "Alkaline Water",
        "Health Effects of Water"
    ],
    "response": [
        {
            "author_info": {
                "name": "Timothy McGaffin II",
                "href": "/profile/Timothy-McGaffin-II"
            },
            "answer_text": "There are two different kinds of alkaline water. There is bad alkaline (chemical additive) and good alkaline (electrical restructuring of molecules). Or you can also say there is a difference between alkaline water and alkaLIZED. For example, “bad alkaline” can be found in bottled alkaline waters which are an imitation or counterfeit of good alkaline or alkaLIZED water. In most of the bottled alkaline waters you’ll see the first ingredient after water is “sodium bicarbonate” which is just baking soda. Look at the ingredients of Essentia 9.5 bottled alkaline water for example, and you’ll see the first ingredient after water is “sodium bicarbonate”. Then go read the directions on your baking soda bag or container and you’ll see warnings that if you ingest too much it can build up in your system and cause health problems. And it usually describes the type of health problems that can occur if you ingest too much baking soda. Bottled alkaline water can mess with your stomach acid since baking soda is an antacid. But there is a difference between “alkaline” and “alkaLIZED” or a difference between bad alkaline and good alkaline. See here:  Bottled “alkaline” waters can cause an imbalance in your body because the inorganic minerals can build up and cause an imbalance. This water can make you too alkaline. This water has been altered chemically. Whereas alkaLIZED water does not cause an imbalance in your body and instead balances out your body. Because AlkaLIZED water cannot make you too alkaline but rather alkalizes your body by helping to carry out acidic wastes or toxins from within your cells. AlkaLIZED water doesn’t have anything added to it, but rather has had its molecular structure reorganized with electricity causing the drinking water to become high alkaline or reach a high alkaline pH due to the H2O molecule being split into H2 and -OH and the positively charged acidic hydrogen ions being pulled out of the drinking water. This water has been changed with electricity. The fibromyalgia center of Utah used to direct their patients to drink bottled alkaline water but not for longer than 2 weeks because this water could start building up in their body systems and cause health problems by causing an imbalance in their bodies due to the build up of the inorganic minerals such as baking soda in the water. Later the fibromyalgia center of Utah found out about alkaLIZED water and then directed their patients to drink this water instead because they could drink it in unlimited amounts and for unlimited periods of time because this water does not build up in your system since it does not have inorganic minerals added to the water. Rather alkaLIZED water has been changed through electricity, not by the addition of antacids. AlkaLIZED water cannot mess up your stomach acid either because there is no additive that can cause an imbalance in your body. AlkaLIZED water is living water, and its properties do not last more than a few days. This water needs to be drank fresh in order to enjoy its benefits. Therefore this water cannot be bottled and sold in stores because the properties of the water would be gone before this water even got to the store shelf. This water is found high up in the mountains from glacial melt water, a few rare springs around the world such in Lourdes, France, or can be made in the home with a water ionizer that has the Gold Seal Certification from the Water Quality Association. The reason I bring up the Gold Seal Certification from the WQA is because just as bottled alkaline water is the imitation or counterfeit to alkaLIZED water, there are also imitation or counterfeit ionizers that simply add in an inorganic mineral into the water to artificially raise the pH the same as these bottled alkaline waters artificially raise the pH by adding baking soda into the water. The bottled alkaline waters you see in the store are the imitations of alkaLIZED water. We’ve had our Kangen Water machine model SD501 for 2 years now and we have changed and saved so many lives with this water. We originally got our machine when my wife was 8 months pregnant. She was having a lot of health issues. Shortly after we started drinking the water consistently fresh from our own machine absolutely amazing things happened. We started sharing the water with everyone we could in our neighborhood and with friend and family and soon it seemed almost everyone was asking us how they could purchase the same device that produces this living, electrically-charged water because of all the amazing things that were happening from people drinking this water. The price is not inflated because of the referral program but actually deflated. If Kangen Water machines were sold in stores they would cost $10,000 or more. The medical grade platinum, used on the plates that conduct the electrical charge through the water, costs about $2,000 an ounce. The mark-up on the Kangen Water machines are less than 3 times. Whereas most retail products found in stores have mark-ups from 5 times up to 100 times such as bottled water. It only costs 1 penny to manufacture the plastic bottle and fill it with dead, acidic water and yet these bottles sell for about $1 many times. That is a mark-up of 100 times. Have you thought about the mark-up on products you buy? See here: * Athletic ShoesManufacture Cost: $1Price Sold: $100Mark-up: 100 times * Bottled WaterManufacture Cost: 1 centPrice Sold: 99 centsMark-up: 99 times * DVDManufacture Cost: 70 centsPrice Sold: $19.99Mark-up: 29 times * FurnitureManufacture Cost: $100Price Sold: $799Mark-up: 8 times * Building ConstructionManufacture Cost: $200,000Price Sold: $1 MillionMark-up: 5 times * Kangen Water Machine SD501 by EnagicManufacture Cost: $1400Price Sold: $3980Mark-up: 2.85 times So because there is the referral program included the cost of these devices is actually driven down as people communicate with each other home to home, family to family, friend to friend, heart to heart and spread the good news about this incredible water. Beware of imitation machines or imitation water. For example there is a difference between “alkaline” and “alkaLIZED”. Those “alkaline” waters you see in the health food store simply have an inorganic mineral added to the water such as “sodium bicarbonate” which is baking soda. Look at the ingredients of Essentia 9.5 bottled alkaline water and you’ll see the first ingredient after water is “sodium bicarbonate”. Then go read the directions on your baking soda bag or box and you’ll see warnings that if you ingest too much it can build up in your system and cause health problems. And the competing IMITATION machines to the Kangen Water machines don't work! I spoke with a competing company by way of their online chat. They could never answer my question about how many amps their machines have. Not only did they fail to answer my question but they became very rude and unprofessional as they called me names, made fun of me, and tried to bully and intimidate me. All because I wanted to know how many amps their machines have. When they asked why I wanted to know, I explained that once I found out, then I could determine how many Potential Electrolysis Units (PEUs) their machines produce. Because I learned from Dr. Michael Donaldson, in his excellent presentation here at about the 20-minute mark: https://youtu.be/TugKJW6USAw that you need 250,000 PEUs to disassociate the hydrogen atom from the H2O water molecule. The formula is Amps multiplied by Watts multiplied by Square Surface Area of the Plates (A x W x Sa = PEUs) This competing company falsely told me the formula is watts multiplied by plates. This is incorrect because if you have \"up to 800 watts\" as they claimed but only .5 amps then that reduces in half the amount of wattage supplied. Then when you figure out that their plates are smaller, you will see they do not have 250,000 PEUs. So since these imitation machines do not have enough electrical power, then they can't properly ionize the water and thus they must add in minerals to the water when it runs through their filters to artificially raise the pH, similar to baking soda (sodium bicarbonate). Most of these imitation machines claim to have two filters but their secondary “filter” only serves the main purpose of adding inorganic minerals into the water such as sodium bicarbonate or a related compound. On the other side of things, the Kangen Water machine model SD501 has 230 Watts x 2.5 Amps x 623 cm of square surface plate area = 358,225 PEUs. The Kangen Water machines do NOT add in any additives such as the imitation machines do. The reason why the Kangen machines have a high pH is because they have a high proportion of dissolved hydrogen in the water. That's what pH stands for, \"parts hydrogen\". Also the Enagic ionizers are the only ones in the world that have the coveted Gold Seal Certification from the Water Quality Association (WQA). All of the imitation/counterfeit ionizers could not pass all the test from the WQA and therefore none of them currently have the Gold Seal Certification. Many of these imitation companies will tell people that they are members of the WQA but being a member of the WQA is not the same thing as being awarded the Gold Seal Certification. And to help you understand the difference between bad alkaline and good alkaline refer to the comparisons below… (or watch the video above) Bottled Alkaline water: Bad AlkalineImbalanceChemicalImitation/CounterfeitLiving AlkaLIZED water: Good AlkalineBalanceElectricalReal",
            "date": "Answered April 19, 2018",
            "views": "13",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bharath M",
                    "user_href": "/profile/Bharath-M-132"
                },
                {
                    "user_id": "Diane Kay Turn",
                    "user_href": "/profile/Diane-Kay-Turn"
                },
                {
                    "user_id": "Dennis Heruela",
                    "user_href": "/profile/Dennis-Heruela"
                },
                {
                    "user_id": "AlkaViva Water Ionizers",
                    "user_href": "/profile/AlkaViva-Water-Ionizers"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Ross",
                "href": "/profile/Robert-Ross-110"
            },
            "answer_text": " Live alkaline water has a naturally high pH. This also means it is rich in oxygen, like water in your body or fresh organic vegetables.. Processed tap water or bottled water, like processed food, is often very acidic. In fact, some processed foods and drinks can be from 10,000 times to as much as 100,000 times more acidic than your blood – which doesn’t sound very healthy, does it? The purest organic water once came from remote mountain rivers, streams and springs. But today, you have to buy water in bottles in a futile attempt to find pure water – and then you’ll fail! Because most bottled water is nothing more than processed tap water that may even be contaminated by plasticizers and other contaminants – often with an acidic pH. And high-price, designer bottled waters that are more expensive than gasoline are often not much more than a neutral pH, though some expensive brands can have a 9.0 pH. So if you don’t live near an uncontaminated underground spring in the middle of nowhere, what is your family going to drink? Filtered tap water doesn’t do the trick either as it does nothing more than removing only some of the most toxic chemicals, like chlorine or flouride. But they still cant remove all the toxic chemicals in some tap water and can't restore the alkalinity essential to creating healthy water. To give your family health-giving, alkaline water there is only one reliable and affordable long-term solution – make it yourself! How to Make Alkaline Water Live alkaline water is like live alkaline food — healthier, better tasting and more alive than processed foods or bottled water. Like raw food, alkaline. water has a higher “pH” that helps your body maintain a healthier acid/alkaline balance. The easiest way to make your own alkaline water is to purchase a water ionizer. There are several brands to choose from. Personally, I have a Life Water Ionizer. An ionizer increases the pH, antioxidants and available oxygen in water. You see, making the water more alkaline greatly increases the number of “hydroxyl ions” (OH-), which contain oxygen combined with hydrogen. A water ionizer also increases the negative Oxygen Reduction Potential (-ORP) of the water – which reduces anti-oxidants or free oxygen radicals by combining with them, converting dangerous free radicals into a safe, useful form of oxygen your body can use. You can even build a low cost water ionizer uourself — just see the simple plans on my website! Fresh alkaline water is has a high negative oxygen reduction potential (-ORP), making it a powerful antioxidant — reducing oxidation from free oxygen radicals that can damage DNA, thus slowing the aging process, and providing more of the healthy forms of oxygen your body can use! Organic fruits and vegetables are the main natural source of negative ions (-ORP) that get in a healthy diet. Vitamin C and E, grape seed extract and alpha lipoic acid, for example, are all strong electron donors. Organic, raw fruits and vegetables are also alkaline (or “alkaline-forming”) and have a high –ORP as well, giving you the electrons your body needs to neutralize free radicals. A Water Bottle is Worth More than the Water in It! Only 23% of the 200 billion plastic bottles thrown into landfills each year are recycled, the rest sit there leaking toxic additives such as phthalates into the groundwater and taking 1,000 years to biodegrade. That means bottled water is harming your future water supply. Supplying just the U.S. with plastic water bottles for one year consumes more than 47 million gallons of oil, enough to take 100,000 cars off the road and 1 billion pounds of carbon dioxide out of the atmosphere. AND Bottled water actually increases the price of gasoline, because the manufacturing of the bottles and the transportation of the water simply increases demand for oil. More than 5 trillion gallons of bottled water is shipped internationally each year. You can buy water from Fiji or Norway – as much as 9,000 miles away. In Fiji there are no bottle factories, so the bottles are made in China, shipped to Fiji, where they are then filled and shipped to you. How much does that bottle cost the environment? To read more about this in depth, with references, see my website: You searched for alkaline water - RawFoodLife, LLC ",
            "date": "Updated December 18, 2019",
            "views": "5",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "CEn V",
                    "user_href": "/profile/CEn-V-1"
                },
                {
                    "user_id": "Saskia Denise",
                    "user_href": "/profile/Saskia-Denise"
                },
                {
                    "user_id": "Cat Camp",
                    "user_href": "/profile/Cat-Camp-2"
                },
                {
                    "user_id": "Akash Singh",
                    "user_href": "/profile/Akash-Singh-1852"
                },
                {
                    "user_id": "Parth Korat",
                    "user_href": "/profile/Parth-Korat-2"
                },
                {
                    "user_id": "Neeraj Sachdeva",
                    "user_href": "/profile/Neeraj-Sachdeva-33"
                },
                {
                    "user_id": "Khalil Ajram",
                    "user_href": "/profile/Khalil-Ajram"
                },
                {
                    "user_id": "Engg Vikas",
                    "user_href": "/profile/Engg-Vikas"
                },
                {
                    "user_id": "Edith Kempton",
                    "user_href": "/profile/Edith-Kempton"
                },
                {
                    "user_id": "Linda Row",
                    "user_href": "/profile/Linda-Row-3"
                }
            ]
        }
    ]
}