{
    "title": "Is business an art or science? - Quora",
    "tags": [
        "The Arts",
        "Entrepreneurship",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marco Fuxa",
                "href": "/profile/Marco-Fuxa-1"
            },
            "answer_text": "Do you believe in irrational numbers? Do you believe in infinite numbers? How about imaginary numbers?  Do you actually believe that there is such a thing as a circle, triangle or a square? Really? They are only two dimensional representations. But write that down ink on paper and all of a sudden they have depth. Because even ink has height. By which point they are no longer circles, squares or triangles.  If you say \"it took me a second to shoot this post down\" you are counting from one. Which is why you gave your self a second.  And then you decide to count solid objects in terms of distance. Distance to what? To an imaginary point? Is that in time or space? Because nature abhors a vacuum and a nil point is a logical impossibility. But how do you transition from 1 to less than 1? Because you cannot have negative space or negative time. But you are allowed negative numbers.  \"It will take three weeks to build the MVP\" Sure. If it wasn't for the laws of physics and law enforcement we would all be invincible.  I can pretty much prove anything to my own satisfaction. Because I like making shit up.  But the primitives that escape me are the concept of Zero, the concept of Number and the concept of arithmetic Addition (+) because no two objects are identical, and because an object that does not exist, well, does not exist so it cannot be compared to something that does, either by shape, density, magnetic field, color refraction blah blah blah. 0, N, + are not provable in any obvious logical sense.  And you still have to accommodate the fact that binary numbers are not congruent with base ten numbers and sure as hades, if you are working in base sixty things sum up quite differently because the error rate is smaller. In radians that's 1 divided by 2 times Pi. How many numbers are there in Pi? Pi divided by 12 = 15 degrees or 1/24th of a turn. And we are back to counting in seconds.  So is science art or fact? What if your facts were captured using the inappropriate   cognitive tool? Still facts? Most Euclidean geometry is irrational. So why do we still take 90 degree turns? Vectors are superiour. Try designing an F35 fighter jet with Euclidean geometry. Not going to happen. Nor can F35 execute 90 degree turns. Not going to happen at any speed.  But if I say \"I just bought a round dinner table\" you will understand exactly what that means. Exactly as in precisely. As opposed to a square or rectangular table. It has a precise frame of reference. But does it sit 1, 2, 4, or 8 people? And how effective is a round table that sits sixteen? Can you have a conversation with the person sitting on the other side of the table? Not likely. Because its not about the table but about how many people can you sit at a table in a given dinning room.  Business is no different than mathematics. Your tools work until such time as they no longer work. And speaking to the rationality of business, I have never heard of anybody in the accounting office talk about negative time or negative numbers. Legal tender you don't own is called debt. You either owe it to the bank, or you are reducing the owner's equity. And when you get to zero, you are no longer in business. If you go much beyond the zero, your stealing. And the guys with guns come and fetch your ass. Then you got all the time in the world to consider the meaning of zero, number and arithmetic addition, and why the laws of man apply where the laws of science do not.  Business is no different than science. Science abhors a vacuum. And Business abhors a human with money in his pocket that he is not willing to spend.   Science is techne. That's the greek word we get technique from. Science is a tool. Some tools are good some tools used to be good for the job at hand. The job changes. So do the tools. We no longer have the barber pull the tooth with a cavity. Circa 1864, in the trenches of Virginia, the only scientific way to take care of a limb with gangrene was to call a doctor of science, and have them cut the limb off. Science has since moved on from there. And so has the business of picking crops.  Because everything that you hold on to as scientific truth today, will be debunked tomorrow. Full stop, end of story.  Pacioli codified venetian merchant arithmetic into the double entry accounting system we still use today, in 1494 (Summa de arithmetica). That's a pretty long run, bubba.  He also wrote another mathematical text in 1508 called De Viribus Quantitatis (on true quantities) which also included guidance on how to juggle, eat fire and make coins dance (its here that imaginary numbers started to make sense).  His 1509 book De Divina Proportione was illustrated by Leonardo da Vinci, Pacioli's live in student. Maybe that was why he was a better artist than scientist... Really? Humans flying like birds...   The first printed illustration of a rhombicuboctahedron, by Leonardo da Vinci, published in De divina proportione, 1509  Wikipedia: Luca Pacioli ",
            "date": "Answered April 5, 2016",
            "views": "31",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Vikas Yadav",
                    "user_href": "/profile/Vikas-Yadav-169"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rosie Hartmann",
                "href": "/profile/Rosie-Hartmann"
            },
            "answer_text": "Business is both art and science. The most successful businesses embrace the creative and change the science of what works and how it works. If you look at the science of business, you would see the technical aspects of what the business is all about and the technical side of day to day operations such as payroll, marketing, running a company. If you look at the creative part, you find what makes a company innovative. You will quickly see what makes them unlike other business in their arena. The creative part comes through in the way a company presents itself. Many of the largest businesses that thrive today embrace the creative. ",
            "date": "Answered August 24, 2015",
            "views": "28",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jackson Angel",
                    "user_href": "/profile/Jackson-Angel"
                },
                {
                    "user_id": "Sarab Virdi",
                    "user_href": "/profile/Sarab-Virdi"
                }
            ]
        }
    ]
}