{
    "title": "Is black magic real? - Quora",
    "tags": [
        "Black Magic",
        "Magic (illusion)",
        "Magic (supernatural)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eskild Rasmussen",
                "href": "/profile/Eskild-Rasmussen"
            },
            "answer_text": "Is black magic real? How much can you control a person using black magic? Can it last for months (I don't want to try it, I'm just worried about a friend)? Yes, black magic is real - but it has a nasty habit of backfiring. Imagine for a moment that people exist at various development stages. At stage stage 4 a person can use black magic and control other people, who are at stage 1, 2 and 3 but if you try to use the black magic against people, who have evolved further, the black magic is powerless and will return to harm the person, who practices the black magic. The fear of black magic is widespread in e.g. some African nations, where the society as a whole is at a low development level, but not so in the rest of the world, simply because people in the rest of the world have moved on. Besides, every person has a guardian angel, whose job it is to protect the person. Even if a person at stage 4 succeeds in controlling another person, the guardian angel will find ways to help the controlled person to regain his or her freedom. On the other hand, a person can make himself or herself vulnerable to black magic or to being controlled by others is he/she commits evil acts. But usually the accumulated bad karma doesn’t manifest itself before the moment of death, when the spirits gather around the dying person, who can suddenly see them - and is then filled with fear for what awaits him or her. If you are afraid of black magic, you should pray and/or fast. I was raised in a Christian Evangelical environment, where some of the members of the congregation actually feared evil spirits, so I got a dose of this fear with my upbringing - but I also experienced how prayers would empower me and chase the fear away. Today my fear of evil spirits is replaced with curiousity - when I encounter an evil spirit, I want to know, why it has become evil, where it resides, and I also want to know how this situation can be improved, how the spirit can return to the light again. To conclude the matter: In general you should not be afraid of black magic or evil spirits. Once you examine these phenomena, which are very rare in modern society, they turn out to be crude, primitive and relatively harmless - just like e.g. a hardened criminals or ruthless dictators turn out to be, once he/she has been stripped of his/her powers. “So, first of all, let me assert my firm belief that the only thing we have to fear is… fear itself - nameless, unreasoning, unjustified terror which paralyzes needed efforts to convert retreat into advance.” (Franklin D. Roosevelt) ",
            "date": "Answered November 10, 2019",
            "views": "14",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abhimanyu Sharma",
                    "user_href": "/profile/Abhimanyu-Sharma-469"
                },
                {
                    "user_id": "Rushikesh Kabra",
                    "user_href": "/profile/Rushikesh-Kabra-1"
                },
                {
                    "user_id": "Iris Tseng",
                    "user_href": "/profile/Iris-Tseng"
                },
                {
                    "user_id": "Mahamaya Mishra",
                    "user_href": "/profile/Mahamaya-Mishra-1"
                },
                {
                    "user_id": "Swan Reaper",
                    "user_href": "/profile/Swan-Reaper"
                }
            ]
        }
    ]
}