{
    "title": "Is excess oxygen harmful? Does it make our body go to sleep? - Quora",
    "tags": [
        "Oxygen",
        "Human Brain",
        "Sleep"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vaishali Verma",
                "href": "/profile/Vaishali-Verma-97"
            },
            "answer_text": "Although it seems very ironical, but the fact that oxygen can cause damage to your body and poisoning in certain conditions is really true. Oxygen gas is made up of two atoms of oxygen. Oxygen poisoning is caused by breathing in high concentration of molecular oxygen. The body is affected in various ways by high oxygen level. What exactly it does in the body that causes so much damage? The reason behind this are highly active free radicals. Free radicals are ions atoms or molecules having an unpaired electron in an outer orbital. The formation of free radical is a normal and continuous process that happens in mitochondria. When these radicals are in low concentration, the body guards itself form them by using antioxidants. But as the amount of oxygen increases, the free radicals also increases.The antioxidants becomes unable to control this high number of free radicals.This overwhelmed condition of free radical can initiate the process of lipid damage in cell membrane. High concentration of oxygen also increases formation of other free radicals like nitric oxide, peroxynitrite & trioxidane, which can harm a DNA. The hyperoxygen breathing condition causes major damage to those organs which have more supply of oxygen through blood. These organs are vital & if they became damaged then the condition is like threatening. Understand better-  ",
            "date": "Answered September 26, 2017",
            "views": "618",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sweta Mahato",
                    "user_href": "/profile/Sweta-Mahato-9"
                },
                {
                    "user_id": "Ivy McLarvin",
                    "user_href": "/profile/Ivy-McLarvin"
                },
                {
                    "user_id": "Radhika Verma",
                    "user_href": "/profile/Radhika-Verma-49"
                },
                {
                    "user_id": "Magg Manu",
                    "user_href": "/profile/Magg-Manu"
                },
                {
                    "user_id": "Qrius Minh D",
                    "user_href": "/profile/Qrius-Minh-D"
                },
                {
                    "user_id": "Prashant Verma",
                    "user_href": "/profile/Prashant-Verma-128"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anant Shekhar Verma",
                "href": "/profile/Anant-Shekhar-Verma-2"
            },
            "answer_text": "Here is an article from wikipedia.... :) hope this helps@Oxygen toxicity ",
            "date": "Answered September 12, 2014",
            "views": "466",
            "upvotes": "0"
        }
    ]
}