{
    "title": "Is every reaction between two elements a redox reaction? - Quora",
    "tags": [
        "Reduction-Oxidation",
        "Chemical Reactions",
        "Organic Chemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Solomon Aime",
                "href": "/profile/Solomon-Aime"
            },
            "answer_text": "Absolutely, The every reaction between two elements are Redox reaction. Unlike for compounds where certain reactions are not Redox reaction. Eg, Neutralization reaction. In order to occur Redox reaction the reactant must obey the following factors: The donation and receiving of electron must occur together between elementsThere must be change in the Oxidation Number between both elementsIn fact There must be both Oxidation and Reuction react together spontaneously !.",
            "date": "Answered July 15, 2017",
            "views": "13",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Hashamur Rehman",
                    "user_href": "/profile/Hashamur-Rehman"
                },
                {
                    "user_id": "Roberto Aiassa",
                    "user_href": "/profile/Roberto-Aiassa"
                },
                {
                    "user_id": "Faye Taylor",
                    "user_href": "/profile/Faye-Taylor-4"
                },
                {
                    "user_id": "Amey Gupta",
                    "user_href": "/profile/Amey-Gupta-3"
                },
                {
                    "user_id": "Kavindya Balasuriya",
                    "user_href": "/profile/Kavindya-Balasuriya"
                }
            ]
        },
        {
            "author_info": {
                "name": "Oscar S. Grant",
                "href": "/profile/Oscar-S-Grant"
            },
            "answer_text": "Yes, just about. Reduction and oxidation are incredibly essential for a successful reaction. It is just the law of conservation of matter as follows that in order for a reaction of a chemical reaction to be successful it must lose electrons and gain electrons and thus, create a result that combines reduction and oxidation. I recommend some videos on YouTube about redox reactions are super cool, my favorite is Zinc and iodine powder. Below is a generic equation but it is pretty straightforward.  ",
            "date": "Answered July 20, 2017",
            "views": "606",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Moon Moon",
                    "user_href": "/profile/Moon-Moon-121"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kumaraswamy S Vasan",
                "href": "/profile/Kumaraswamy-S-Vasan"
            },
            "answer_text": "Yes, a reaction between two elements is always a redox reaction. Such a reaction is usually termed a combination reaction or synthesis. For instance, even in a reaction between two highly electronegative nonmetals like nitrogen and oxygen to form nitric oxide, nitrogen is oxidised to +2 state and oxygen gets reduced to -2 state. When the reaction is between one metal and a nonmetal, the former invariably gets oxidised and the nonmetal gets reduced. ",
            "date": "Answered April 22, 2016",
            "views": "19",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gurjeet Dasari",
                    "user_href": "/profile/Gurjeet-Dasari"
                },
                {
                    "user_id": "Eric Ressner",
                    "user_href": "/profile/Eric-Ressner"
                },
                {
                    "user_id": "John Puglisi",
                    "user_href": "/profile/John-Puglisi-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Liau Yuan Cheng",
                "href": "/profile/Liau-Yuan-Cheng"
            },
            "answer_text": "Between two elements meaning like sodium metal and chlorine gas? Or are you referring to any general reaction?As for the former, it would be a redox reaction, but not all reactions are redox. ",
            "date": "Answered April 23, 2016",
            "views": "579",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Swapnil Bhattacharjee",
                    "user_href": "/profile/Swapnil-Bhattacharjee"
                }
            ]
        }
    ]
}