{
    "title": "Is God real, or was it just created by humans to explain what cannot be explained by science? - Quora",
    "tags": [
        "Agnosticism",
        "Science and Religion",
        "Atheism",
        "Theology",
        "God"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jim Casey",
                "href": "/profile/Jim-Casey-19"
            },
            "answer_text": "In the early days, thunder, floodings, earthquakes, the sun, the stars,the moon, the mountains. Everything that could not be explained through science received the label “God” , Yahweh is the mountain god of the jews, Allah is Yahweh replacing the God of the moon hubal, which is why Islamists still carry the moon often in their flag. So at first there were many gods, a god for the sun, a god for the moon, thunder, stars, etc etc. But in the old days many wars were waged not only for territory but also God vs God. We see many times in the bible, quran or Roman history that old gods either got smashed, or blended. Your christmas tree if you have one is a combination of pagan history combined with christianity. But as people started looking around the earth for their Gods, none of them could be found. They were either debunked by science or explained to be something else. Humanity conquered mountains, and even stood on the moon, but no God anywhere in sight. However as science advanced they had no good explanation for what has become known as the near death experience. There are a bunch of lunatics in this world, and they claim many things unfounded. But things become different when the very intelligent people who embrace and pioneer science experience a near death experience themselves. Afteral even professors die, even atheist professors die. A most notable near death experience is that of Howard Storm.  Whom i think embraces the very American lifestyle and thinking style. He before his NDE thought that, after you die. It’s all black, absolutely noting. Maybe a few of your loved ones will remember you for a few years, but then nothing but oblivion. But he said he found himself outside of his body still very much alive, but his wife could not see him or hear him. (for the full story see the video). Now, this from a scientific point of view cannot be seen as evidence. But the problem lies in the number and in the experience itself. Literary thousands and thousands of people have near death experiences. Now, the whole idea of them being on drugs, or hallucinating doesn’t add up. If you were to have a near death experience, for instance in case of a heart attack conscious thoughts stop after 8 seconds. You shouldn’t be able to experience anything at all. Or it should be extremely distorted due to your body being in panic or shock. However, almost all people report of having a life review, and bathing in a sea of love, and remain conscious even though they are dead. Are met by deceased loved ones. And are told that there is a creator, and that all what matters in life is that you need to learn how to love others and obtain knowledge. The idea of a ‘god’ therefore doesn’t seem to fit it in the way as humans used to describe it, like a natural ‘phenomenon’ and it seems that what we describe as ‘god’ doesn’t describe itself so much as a god but as a creator. So to come to the answer of the question. There seem to be indications that a ‘creator’ exists, but it does not look like it fits the description of the ‘man made gods’, from old times like Yahweh or Allah, or Habul or Thor etc etc. And there is no proof yet. So for now humanity is forced to keep on searching, we may never find ‘the creator’ unless ‘the creator’ reveals itself. But the NDE’s are an indication that something is going on that we seemingly don’t understand yet, so it’s a fascinating type of research. However so far nothing has happened for billions of years in our reality. I guess we will not know for sure until we die ourselves. We only know that no animal except human beings ‘worship the unknown god’ as we do. And in that sense, we pay our respect for what we don’t know. But i don’t think it’s a good way of thinking. You should think in scientific terms of proof based thinking, but stay open minded for new possibilities. If there is an afterlife and a creator, it will at least have great consequences. ",
            "date": "Answered January 29, 2017",
            "views": "248",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Keira Peppard",
                    "user_href": "/profile/Keira-Peppard-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Baker",
                "href": "/profile/Steve-Baker-100"
            },
            "answer_text": "There is absolutely no proof anywhere that god or gods exist. Not one tiny scrap. Worse still, the mythologies surrounding them have been carefully constructed to make a solid dis-proof impossible. (Science calls this “unfalsifiable”) Science, over the last 200 years, has steadily reduced the need to have god/gods in order to explain things like the origins of man, the origins of the planet, the sun and the moon, the planets and the stars. So believing in god has, during our lifetimes and for the first time in human history, become completely unnecessary. Belief always had to be a matter of faith - and that hasn’t changed. My question is why would you believe in some very specific god - when you don’t (presumably) believe in the tooth fairy or the loch ness monster? They are equally as likely/unlikely as god(s). The fact is that there is a literal infinity of possible things that you might believe in - despite no evidence and no possibility of disproof. If I said that there were tiny purple aardvarks playing pianos in a cave on the far side of Pluto…you’d probably disbelieve me. You can’t prove that they aren’t there. I can’t prove that they are. Why won’t you believe me? The ONLY reason to believe in god/gods is because our ancestors did…we’re perpetuating an outdated belief. I suppose one might argue that our ancient ancestors DID have proof of their gods - and that proof has been lost somehow - and so we should trust in their knowledge. But there are 4,200 different religions in our world. The people who believe in any one of them will claim that their religion is the only one that could possibly be true. It’s not credible that all 4,200 ancient cultures each had proof. If they did, then there would have to be 4,200 or so distinct god/gods too…but that can’t be true because most of those religions will claim that they know there are no other gods than their own. So if you believe in a particular religion, you’re claiming that 4,199 other cultures got it completely wrong - and your’s didn’t! That seems spectacularly unlikely. Really? What are the odds? It’s safe to assume then that there was a need for religion in the days before we had good science - that none of them were true - but that they served some essential purpose in people’s lives. Maybe it gave them reasons to behave nicely - reasons to celebrate the seasons - reasons to have respect for each other? But with modern society, that need has now gone - and therefore religion is obsolete. ",
            "date": "Answered January 26, 2017",
            "views": "18",
            "upvotes": " View 30 Upvoters",
            "upvoters": [
                {
                    "user_id": "Preston Lee",
                    "user_href": "/profile/Preston-Lee-102"
                },
                {
                    "user_id": "David Kalmakoff",
                    "user_href": "/profile/David-Kalmakoff"
                },
                {
                    "user_id": "Laird Sutherland",
                    "user_href": "/profile/Laird-Sutherland"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/J-S-3309"
                },
                {
                    "user_id": "Paul Boucher",
                    "user_href": "/profile/Paul-Boucher-11"
                },
                {
                    "user_id": "Stewart Gemmell.",
                    "user_href": "/profile/Stewart-Gemmell"
                },
                {
                    "user_id": "Ian Clancy",
                    "user_href": "/profile/Ian-Clancy-2"
                },
                {
                    "user_id": "Alexander Eldståhl-Öhman",
                    "user_href": "/profile/Alexander-Eldståhl-Öhman"
                },
                {
                    "user_id": "Gabriel Miranda",
                    "user_href": "/profile/Gabriel-Miranda-12"
                },
                {
                    "user_id": "Scott Barusek",
                    "user_href": "/profile/Scott-Barusek"
                }
            ]
        }
    ]
}