{
    "title": "Is God in nature? - Quora",
    "tags": [
        "Nature",
        "Theology",
        "God"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Fitzjohn",
                "href": "/profile/Michael-Fitzjohn-1"
            },
            "answer_text": " (Pinterest) God is in nature. There are scientific answers about how nature was formed. I’ve never read, however, any good explanation about who the conductor is. Nature is alive. Take a walk and feel the wind blowing. Animals of all kinds call nature home. Walk in the spring and listen to the birds in the trees. Every type of bird has a different song. Look at the sky.  (YouTube) How does everything or creature sync with each other in Nature? Believe what you want and follow any spiritual journey you wish. There is a higher power. I’ve felt nourished every time I’ve been in nature. “It is one of the perils of our so-called civilized age that we do not yet acknowledge enough, or cherish enough, this connection between soul and landscape - between our own best possibilities, and the view from our own windows. We need the world as much as it needs us, and we need it in privacy, intimacy, and surety. We need the field from which the lark rises - bird that is more than itself, that is the voice of the universe: vigorous, godly job. Without the physical world such hope it: hacked off. Is: dried up. Without wilderness no fish could leap and flash, no deer could bound soft as eternal waters over the field; no bird could open its wings and become buoyant, adventurous, valorous beyond even the plan of nature. Nor could we.” ― Mary Oliver ",
            "date": "Answered December 11, 2018",
            "views": "11",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Annemarie Stojkovic",
                    "user_href": "/profile/Annemarie-Stojkovic"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Prem-Sekar-G-R-प्रेम-शेखर-जी-आर"
                },
                {
                    "user_id": "Karen McKearn",
                    "user_href": "/profile/Karen-McKearn"
                },
                {
                    "user_id": "Satyam Kumar",
                    "user_href": "/profile/Satyam-Kumar-447"
                },
                {
                    "user_id": "James Jo",
                    "user_href": "/profile/James-Jo-17"
                },
                {
                    "user_id": "Bhargav",
                    "user_href": "/profile/Bhargav-185"
                },
                {
                    "user_id": "Lisa Emard",
                    "user_href": "/profile/Lisa-Emard"
                },
                {
                    "user_id": "Libby Mehaley",
                    "user_href": "/profile/Libby-Mehaley"
                },
                {
                    "user_id": "Vlad Miu",
                    "user_href": "/profile/Vlad-Miu"
                },
                {
                    "user_id": "Mario Caruselli",
                    "user_href": "/profile/Mario-Caruselli"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adrian Crowe",
                "href": "/profile/Adrian-Crowe-1"
            },
            "answer_text": "The better question is: “Is nature God?” My answer is that nature is as close as it is possible to get to God. Not just the cute young deer prancing in the dappled shade beside a gurgling stream type of nature, but the harsher nature of the desert, of outer space, of the volcano, too. ",
            "date": "Answered December 11, 2018",
            "views": "41",
            "upvotes": "0"
        }
    ]
}