{
    "title": "Is hypnosis medical science or pseudo-science? - Quora",
    "tags": [
        "Pseudoscience",
        "Medical Sciences",
        "Hypnosis"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dorothy M Neddermeyer",
                "href": "/profile/Dorothy-M-Neddermeyer"
            },
            "answer_text": "Based on the choice of words and juxtaposition of your question, I have a distinct impression you have a bias on this topic. Having said that, I will give you the 411* on the 911 of Hypnosis. The term \"hypnosis\" comes from the ancient Greek word ὕπνος hypnos, \"sleep\", and the suffix -ωσις -osis, or from ὑπνόω hypnoō, \"put to sleep\" (stem of aoristhypnōs-) and the suffix -is. Albeit one is not asleep during the process of a highly focused level of concentration. The words \"hypnosis\" and \"hypnotism\" both derive from the term \"neuro-hypnotism\" (nervous sleep), all of which were coined by Étienne Félix of henin of Cuvillers in 1820. It was popularized in English by the Scottish surgeon James Braid (to whom they are sometimes wrongly attributed) around 1841. Braid based his practice on that developed by Franz Mesmer and his followers (which was called \"Mesmerism\" or (“animal magnetism”), but differed in his theory as to how the procedure worked. The human mind goes into a focused state while concentrating on reading, watching TV, working, driving and many other tasks. A deeper state of concentration is achieved during meditation. In fact, many people who meditate can achieve the level of a focused state as an assisted level of focus and concentration. The signs that someone has reached an assisted deep level of focus and concentration can be detected in the breathing pattern, and eye movement beneath closed eyelids. I am here only to be truly helpful. If you have questions contact me. *Urban Dictionary: 411 Another term used for \"information.\" Hence dialing 411 for information. ",
            "date": "Answered October 8, 2017",
            "views": "786",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Scallan",
                    "user_href": "/profile/John-Scallan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prabhaker N Thakur",
                "href": "/profile/Prabhaker-N-Thakur"
            },
            "answer_text": "Thanks for A2A. . Before I attempt an answer to help you understand it, please explain your PERSONAL meaning of the word “science” to me. If you feel like doing it, I would also like to learn about your personal definitions of the words “medical’ and “pseudo”. Kindly DO NOT give me dictionary meanings. I wait for your reply. ",
            "date": "Answered October 8, 2017",
            "views": "178",
            "upvotes": "0"
        }
    ]
}