{
    "title": "Is it possible to have a unified theory of everything? - Quora",
    "tags": [
        "String Theory",
        "Theoretical Physics",
        "Science",
        "Physics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Juan José Gómez Ibarra",
                "href": "/profile/Juan-José-Gómez-Ibarra"
            },
            "answer_text": "No chance. There are four singularities, four one of a kind phenomena in the world and each one demands its own theory. The reason is that in each case the variables are different; there is a problem of incompatibility. Quantum mechanics is a theory about the space-less, intemporal units of energy we call quanta that existed before the Big Bang. Then you have general relativity, a theory about space, time, matter and gravity. Next comes biology, a theory about abiogenesis, metabolism, reproduction, homeostasis, mutation, etc. Finally, there is the human science(s). The point is that you cannot reduce human behavior to mere biology; you cannot reduce biology to mere physics; and you cannot reduce spacetime and matter to space-less energy. There are two general physical theories, general relativity and quantum mechanics, and physicists are trying to unify them for no better reason than two theories are one too much to explain the single phenomenon of the universe. The theories are known to be incompatible (physicists are aware of this) because they refer to different phenomena. Nevertheless, to the end of unification, since quantum mechanics has identified three fundamental interactions between the elementary particles (the electromagnetic, strong nuclear, and weak nuclear “forces”) physicists are looking for a missing particle, the graviton, that would carry the fourth force, gravity. They are trying to reach the unification of the four forces with brute force, i.e. math, but have no chances of succeeding. One good reason is that first you must come with a physical picture of whatever phenomena you have in mind, and only then you figure out the math. Working the other way will give you math with no physical meaning (yes, there are famous examples of physicists clever enough to translate seemingly senseless math into physical situations, but this was because they had worked first on the physical side of the problem). Starting with the very beginning, before the Big Bang there was energy. Energy cannot be created, it existed on its own, it has no earlier source, it is the simplest substance in the world. Imagine a body so archaic that it lacks space, time, matter or gravity; an energy singularity made of uncountable energy packets we know as quanta. Consider now the possibilities open to such a body, or a region of it. A “false vacuum” is an unstable state of energy that spontaneously changes to a more stable state through a bubble that spreads at the speed of light. This looks very much like the creation of space-time. Within the bubble, more quanta self-assemble into the few dozen elementary particles we know and further aggregate into more complex objects that again, accrete into colossal structures. This gives us matter. The energy-matter density inside the bubble gives space its geometric property. This results in gravity. Here is the whole story (expect a few twists). What was before the Big Bang? Before the Big Bang there was energy. Imagine a body so archaic that it lacks space, time, matter or gravity; an energy singularity with zero density, made of uncountable energy packets we know as “quanta”. There is a way to still “see” this primeval body that predated the Big Bang, continues to exist now, and will remain undisturbed in its “place” (out of our space-time) even if our local universe disappears. Why do cosmologists disagree on what existed before the Big Bang? The tested instrument that made the Big Bang a necessity is of no application before the very beginning. General relativity concerns space, time, mass, energy and gravity, but the theory says these phenomena debuted together 13.8 billion years ago, throwing no light on what may have existed before such a bizarre epoch. Events prior to the Big Bang are deemed to be unobservable, their information lost to us. Even in the face of such impediments, cosmologists lack no ideas on what may have caused the universe into being. Scenarios range from a universe undergoing an endless cycle of birth, collapse and rebirth; a mechanism—eternal inflation—bringing into being a myriad of universes, making ours a part of a “multiverse”; the idea that the universe is confined to a sort of membrane inside a higher dimensional space—the “hyperspace”—and many others, including the possibility that the nothingness split in two opposite halves so that the total energy of the universe is zero (0=1-1), have been advanced. Why have physicists never proposed a singularity made solely of energy? Physicists, perhaps persuaded that physics is a senior science taking precedence over the rest, have overlooked the known solution to the only other two “origins” dilemmas. Evolution, an old subject. Science first stumbled with an “origins” mystery in the second half of the 19th century. A couple of English biologists faced a seemingly impossible question: Were current lifeforms created in their present shape or were they descended from earlier ancestors? What they found was evidence for an evolution. A series of slightly varying creatures, increasingly fewer and more rustic as one got into the past, produced the astonishing variety of earth’s life—science now places a single cell as the ancestor to all modern life. The ensuing scandal was to be made worse by one of the two Victorians who clung to the matter in regard to humans. Did we also descend from more primitive animals? He said yes and devoted a book to examine the issue at length. What about the top question, the emergence of life itself? Before the creation of the first living creature there was only ordinary matter, so Darwin envisioned life arising out of self-assembling organic compounds in a “warm little pond” bathed in heat, light and electricity. The key to all “origins” conundrums. Darwin showed how discontinuous, seemingly incongruous qualities emerge from an unbroken chain of events. His method to the origin of new phenomena was to look in the preexistent, simpler environment. By following it he got the right answers, twice. Humans originated from nonhuman primates and life from nonliving organic compounds made of ordinary matter. Where the arrow of simplicity points to. The straightforward mechanism of evolution forces us to look for some simpler (non-spatial, intemporal, matter-less, gravity-less) preexisting body capable of spawning the entire universe. It should have known traits; because nobody has seen it, it should be completely “dark” in our eyes and yet very visible if properly looked for; its constituent stuff should be very ordinary, simple and omnipresent, yet capable of taking many different shapes. The law of conservation of energy. The law states that energy cannot be created or destroyed, only transformed. By this law there should be an initial inventory of energy to create the universe. Energy lacks corporeality and yet it is a real physical property. As a conserved quantity, energy is also unaffected by time—Einstein showed that time and space are part of the same continuum, spacetime, so anything alien to space is also so to time. Lacking corporeality and time does not prevent energy to transform itself into other, even tangible, forms. The mass-energy equivalence principle. Einstein showed that mass and energy are equivalent. Initially just a convenient theoretical tool, experimental physicists found practical ways to use this principle to transform mass and energy into each other. Atomic bombs and reactors have been made to release huge quantities of energy. In the other end, protons brought to a speed close to light have been made to clash in frontal collisions to produce much more massive particles than those of the protons involved. More complex, tridimensional mass, abounding in uncountable chemical varieties, is made of energy. The energy of the void. By the end of the last century, cosmologists found that the universe is expanding at an accelerated rate. A low-density, “dark” energy, first proposed by Einstein as a “cosmological constant”, is doing the pushing. It has been referred to as the “energy of space itself”, the “energy of the void”, or “vacuum energy”. There is a catch. As the universe expands, in order to keep the thrust of “dark energy” constant, more and more space has to be created. At the scale of the whole universe, energy is not conserved; more energy is coming from an unknown source. The other space, the quantum vacuum. Quantum mechanics is the other general physical theory. It describes nature at the scale of atoms, nuclei and subatomic particles. It is inconsistent with general relativity because quantum phenomena have no counterpart in general relativity. One fine example is the uncertainty principle. Quantum field theory treats the void as populated by fields that never go away. The uncertainty principle forbids knowing with precision the value of a field at a point in space. If a point in space were to lack particles, the field’s precise value would be known—it would have zero energy. The vacuum is thus populated by quantum fluctuations, virtual particles that pop into and out of existence. Because their contribution is however positive, the quantum vacuum has energy—even infinite energy. Unlike the constant density of the “dark” energy, in the quantum realm, the smaller the scale, the greater the vacuum energy density—as smaller wavelengths traduce into higher frequencies. Calculations jump many zeroes when going from the scale of atoms to that of nuclei to that of a thousandth of nuclei. Physicists stop their estimates at the Planck scale because beyond this scale existing theories make no sense. At this point the vacuum energy density reaches 110^112 ergs/cm3. The measured density of “dark energy” is just 10^-8 ergs/cm3. There is a gap of 120 zeroes between the energy of the space at the cosmic scale and that of space at the quantum scale. This disparity alone should tell physicists that the two vacuums do not refer to the same phenomenon. The energy singularity. The incredibly thick energy barrier—much denser than matter—surrounding the universe in the direction of the very small is the energy singularity. This body is so archaic that it lacks spacetime; this is how it managed to exist before the Big Bang. Since gravity is a geometric property of spacetime, the huge energy of this singularity does not have any gravitational effect on our universe. From the energy singularity to the universe. Starting with the energy singularity, the first step to produce the universe is the creation of spacetime; a bubble, membrane, higher-dimensional world “inside” the dimensionless singularity. A self-reaction of the original medium driven by inflation, a false vacuum, or some other spontaneous quantum fluctuation would be the cause. The accompanying event is the assemblage of more quanta within space into the few dozen known species of elementary particles that further bond and aggregate into the tridimensional arrays we know as matter. Quantum phenomena and why no one understands them. The simplest pieces of a structure cannot disappear without causing it to also vanish. In other words, if the most elementary pieces of our universe come from the pre-Big Bang era, we should be able to confirm this today. By taking a close look at the smallest chunks of matter—elementary particles, atoms and molecules—physicists have “seen” them dissolve into waves. The particles reappear after some sort of interaction, usually a collision with a macroscopic object; an event called a “measurement”. Much of this process is actually unobservable; the waves are mathematically modelled and there is a strong indication that they are just “probability waves”—a piece of math—describing unphysical objects that at best exist in some sublayer of reality. We have a problem in dealing with this other, subtler layer of reality because our mind is not well suited to ponder events occurring in the absence of space and time. Violations of spatiotemporal logic by quantum phenomena. Nontechnical accounts of quantum phenomena have provided us with illustrations such as the following. Quantum objects exist as superpositions of different states; they can be in more than one place at the same time. An electron within an atom can jump from one place to another without crossing the intervening space. Quantum objects can tunnel through barriers. If one wants to know the precise position of a particle then one cannot know its precise momentum and vice versa. Quantum objects going from point A to point B follow all possible paths simultaneously. Entangled particles can interact instantly across space. One cannot observe anything without disturbing it. In these examples the concepts of space, time and corporeality are violated. The reason is that quantum objects interact in the absence of space, time and corporeality—whether immersed in space or even in matter. If freely flying, when “measured”—or disturbed—by a collision such objects behave weirdly. Depending on the type of interaction, they can show wave or particle-like characteristics, and the measurement of the whole set of their properties by classical standards, as if they were true particles, is unattainable. The origin of probability in quantum mechanics. Quantum formalism—its mathematical apparatus—cannot predict the outcome of single events such as the precise spot where an electron fired against a screen will appear or the direction of its spin. Rather, it provides precise probabilities of observing one among several valid outcomes. The predicted distribution of probabilities has been confirmed after many runs of the same experiment. What lies behind this probabilistic behavior? There is no exact equivalent between an unphysical object existing in a realm below space and one fully existing in space-time. Imagine a cat posing for us, in complete darkness. At one time it will be standing and at a different one, sitting. It can be licking its right paw or the left one. It can face us, show us one of its sides, or appear tail first. All these are valid postures for the cat to be in. Suppose that we have a light that lets us take a glance at the cat each time we flash it. With each flash we will see a single posture of the cat. In no case we will be able to anticipate which, all we can be sure of is that we will see it in a valid posture. All the possible postures of the cat—its entire shape or structure—will be evident only after many flashes. Entanglement. The phenomenon of entanglement is especially illustrative on how objects in a space-less realm behave in spacetime. Two electrons are entangled if the properties of each depend on the properties of the other—the pair is said to share the same wavefunction. For instance, if one is in a “spin up” configuration, the other will be in the only other valid, “spin down” configuration. While freely flying the electrons are supposed to be in a superposition of the two states, with equal probabilities of showing either one when measured. Now, it is possible to send the electrons in opposite directions. Suppose that we do send them away and a measurement is performed on one. If the outcome is “spin down”, when measured, the partner will be in the opposite, “spin up” configuration. In other words, the particles are communicating instantly across space since they are getting the right configuration every time. How do they do it? In their primary state there is no space between them. This connection is more elemental so it prevails over their actual spatial relationship. Their bond is broken when disturbed, when one of the pair establishes a new bond with other objects. Conclusion. Four singularities: the energy singularity, the universe, life, and humans. Biologists use the term “singularity” to refer to events or properties that are single or unique, for instance, landmarks in the history of life. From a broader perspective, Spanish biochemist Juan Oró says that there are three large singularities in the world: the universe, life, and humans (1). The problem with this statement is that there are two mutually inconsistent physical theories competing to describe Oró’s first singularity, the universe. The solution to this conundrum requires acknowledging that the problem of the origin of the universe belongs in the same category as the other two solved by Darwin. Once the necessity of a simpler cosmological body is realized, its nature is easy to deduce. What follows is the question of how a space-less, timeless body fits in the panorama of science. Realizing its relationship with the many weirdnesses of quantum mechanics requires much harder work. At its inception, the present work had nothing to do with physics. Its purpose was to device a way to a science concerning the fourth singularity, human history, but that is a different story. (1) Life’s Origin: The beginnings of biological evolution. University of California press, p. 7 ",
            "date": "Answered August 8, 2019",
            "views": "393",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jeswik Jeswik",
                    "user_href": "/profile/Jeswik-Jeswik"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tiberiu Tesileanu",
                "href": "/profile/Tiberiu-Tesileanu"
            },
            "answer_text": "In short: we don't know, but it seems unlikely that we will ever have a theory that explains everything in perfect detail because it seems likely that the complexity of everything is infinite. There are many things to say, though. Einstein's dream First of all, Einstein was not looking for a 'theory of everything'. Indeed, the term was introduced after his death (and probably motivated by his work). His goal was to reduce electromagnetism to geometry, just like he did with gravity, so he was trying to obtain a unified theory of gravity and electromagnetism. That is very different from reducing all of the complexity of reality to a single theory (even during his life it was known that other forces exist -- the strong and weak nuclear forces). Single equation fallacy In his Lectures on Physics, Feynman pointed out that it's very easy to write all of physics in a single equation:[math]\\Box U = 0\\,.[/math]The problem is to define what [math]U[/math] is and what [math]\\Box[/math] means. Whether or not all of reality can be described by a single equation is kind of irrelevant. The standard model or particle physics can be written in a few lines and, together with the equations of general relativity (which can be summarized in less than a line: [math]G_{\\mu\\nu} = \\mathrm{const.} \\cdot T_{\\mu\\nu}[/math]), describe 99% of everything that happens around us with 99% accuracy. However, understanding what those equations mean requires a decade or two of learning, and defining everything \"from scratch\" requires entire books. So perhaps the question should be whether all the complexity of reality can be condensed into an understandable form, where by 'understandable' we mean something that can feasibly be learned during a lifetime. Explaining everything Getting more to the point: is there a way to create a theory that describes all of the laws of the universe? There are two important issues here. One of them is in what circumstances and in how much detail? See, classical mechanics is a great description of the universe if you don't zoom in too much and don't move too fast. If you do zoom in a lot, quantum mechanics is your friend. The point is, every known scientific theory has a certain (finite) regime in which it is applicable, and within that regime it makes predictions that are accurate within some limits. Even if a theory we're aware of had no known limitations (though there are no such theories), we still couldn't say with confidence that limitations don't exist, because our experiments have finite accuracy. This is probably the most important thing to realize: the only way to know whether a theory is right or wrong is to go out and check it, compare it to observations made in the real world. Since at any given point there are only a finite number of observations that we have made, it's not clear how we could ever be sure that our theory explains everything. Perhaps people after us will figure out a way to make infinitely many observations in a finite time; but for now that is unimaginable, and so if we did find a perfect theory of everything, we would have no way of knowing it. More is different Phil Anderson wrote this great essay called More is different. Whenever questions of a 'theory of everything' come up, this is usually seen through the prism of fundamental physics. The idea is that perhaps we can keep dividing the known elementary particles until we reach some \"fundamental\" ones that obey some \"fundamental\" laws of physics, and once we know those laws, everything else follows from them. This may well be true, and the standard model gets pretty close to achieving this (though gravity is still posing some problems). However, knowing the fundamental laws of physics will not mean that all the complexity of reality suddenly becomes understood! As an example, no one really doubts that chemistry follows from the already-known laws of quantum physics (the corrections necessary because of gravity are very likely to be irrelevant). However, it is impossible to predict complicated chemical reactions starting from basic principles simply because we do not have the computational power. A simple example is that of protein folding -- a process whose fundamental physical basis is well-understood. We can't predict the folded form of a protein except in very special cases. Scale up to something like psychology, and you'll see that understanding the laws of physics, while helpful, is not even close to enough for understanding a host of important questions, like why Alzheimer's happens and how to solve it. The point here is that reality seems to have a hierarchical structure. Understanding the microscopic details of a system does not equate to an understanding of the macroscopic details, and in fact, sometimes the precise microscopic details don't even matter for the macroscopic behavior. This latter point is both a blessing and a curse. It means we can work on our biology without worrying that we haven't yet understood how quarks interact with gravitons, but it also means that we need to perform more and more awkward experiments to get at the behavior of fundamental particles, because our macroscopic world is simply not very sensitive to that precise behavior. So, if someone ever comes up with a microscopic theory of everything, it will do absolutely nothing to help us understand the mesoscopic scales that cover everything from chemistry to biology to psychology. Including those into an even bigger 'theory of everything' is so far-fetched at this point that it's not really worth thinking about. We would be happy enough to understand them in isolation; once we do that, we can worry about unifying that understanding. EDIT: I realized that what I wrote sounds a lot like suggesting that the problem is limited computational power. That is not what I mean. As an example, if we ever build a computer large and powerful enough to simulate every single neuron in the brain of a mouse, to the point where we can connect it to an animatronic mouse and it behaves like the real thing, it would still not mean we understand the mouse brain! In contrast, although we can't simulate every one of the [math]\\sim 10^{23}[/math] molecules in a room full of air (that's many many orders of magnitude more than the number of neurons in a brain), we understand how air behaves quite well if we think about it in thermodynamic terms. This kind of understanding replaces the microscopic concepts with well-chosen macroscopic ones, in such a way that the laws that govern the macroscopic motions are relatively simple, easy to understand, and easy to simulate. This doesn't allow us to predict the motion of each independent molecule in the air, but we aren't even interested in that. In the same way, in the case of a brain, we aren't particularly interested in knowing which exact neuron fires at which exact time; in order to understand the brain, we need to define new concepts that describe it in macroscopic terms. ",
            "date": "Answered January 28, 2015",
            "views": "19",
            "upvotes": " View 18 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bart de Koning",
                    "user_href": "/profile/Bart-de-Koning-3"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Koen-Vochten"
                },
                {
                    "user_id": "Dan Wjeer",
                    "user_href": "/profile/Dan-Wjeer"
                },
                {
                    "user_id": "Zenan L",
                    "user_href": "/profile/Zenan-L"
                },
                {
                    "user_id": "Irene Molina",
                    "user_href": "/profile/Irene-Molina"
                },
                {
                    "user_id": "Alex More",
                    "user_href": "/profile/Alex-More-7"
                },
                {
                    "user_id": "Niklas Hervé",
                    "user_href": "/profile/Niklas-Hervé"
                },
                {
                    "user_id": "Domének Vidal",
                    "user_href": "/profile/Domének-Vidal"
                },
                {
                    "user_id": "Özgür Aydın",
                    "user_href": "/profile/Özgür-Aydın-4"
                },
                {
                    "user_id": "Kevin Erwins",
                    "user_href": "/profile/Kevin-Erwins"
                }
            ]
        }
    ]
}