{
    "title": "Is it possible to stop or even reverse the polar ice cap melting? - Quora",
    "tags": [
        "Polar Ice",
        "Polar Ice Caps",
        "Melting",
        "Ice",
        "Environmental Science",
        "Climatology",
        "Climate Change",
        "The Environment",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dan Karner",
                "href": "/profile/Dan-Karner"
            },
            "answer_text": "Yes, but it will take time. There are many positive and negative feedbacks in the climate system that determine the extent of polar ice. It is clear that atmospheric warming has been less than expected from CO2 increases alone because the oceans have absorbed a great deal of that atmospheric heat. As the oceans warm up, their circulation patterns change. As has been observed in recent years, the polar ice has melted from above (by warmer air temps) and below (by warmer ocean waters), discharging large quantities of fresh meltwater onto the surface of the polar seas, which disrupts the overturning and ventilating of the deeps oceans (see thermohaline circulation on Wikipedia). What's more, surfaces of the ice sheets are becoming less reflective of direct sunlight as snow is replaced by liquid water and dirty snow (see cryoconite). These changes (in ocean circulation and high latitude heating as snow is replaced by liquid water and dirt or rock) in turn cause changes in atmospheric heat transport from Equator to poles (i.e. there is less temperature gradient, so less latitudinal storm tracks). So, atmospheric circulation is reorganizing as well. All of these disruptions to what had been a relatively stable polar ice system will not reach equilibrium for decades to centuries even if we stopped producing ANY additional CO2 right now. What's more, we do not have a full understanding which feedbacks within the climate system will be the most critical for stabilizing the polar ice sheets. So, in my opinion, catastrophic monetary losses will come first, and then governments will eventually respond when there is no more wiggle room left for them to continue deflecting responsibility. We're getting closer, but probably will need multiple New Orleans sized failures in the same year to tip the scales. ",
            "date": "Answered July 24, 2019",
            "views": "71",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kristoffer Jay Martin",
                "href": "/profile/Kristoffer-Jay-Martin"
            },
            "answer_text": "Counter to what everyone else is saying; yes it is possible. We can take measures to drop CO2 in the atmosphere thus reversing heating. One report showed that if we planted around 250 billion acres of trees worldwide, we could cut our atmosphere CO2 to 1/3rd to 1/4th of what it is now and we’d see relatively immediate environmental response. However, as things are going currently, no actions we take on a technological level or in simply reducing CO2 production will not help stop heating and the loss of the polar ice caps. ",
            "date": "Answered July 24, 2019",
            "views": "30",
            "upvotes": "0"
        }
    ]
}