{
    "title": "Is it possible that an object is moving without being any force acting on it? - Quora",
    "tags": [
        "Force (physics)",
        "Acting"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brian Klock",
                "href": "/profile/Brian-Klock"
            },
            "answer_text": "This is actually kind of a quirky question. Although you probably are thinking \"accelerating\" rather than \"moving\". For one, motion is always relative. There's no such thing as a fixed point in space, there's only a fixed point in space in relation to a planet, a star, or a galactic center. And then for each of these, there's two possible contexts, for example for a planet you can be motionless in relation to the planet surface, or you can be motionless in relation to the planet's orbital path around the Sun. So just the notion of whether an object is moving is vague and subjective. It could be said that there's no such thing as an object perfectly at rest. If an object is seemingly at rest outside our solar system, but is still within the Milky Way galaxy, it's still going to be in motion orbiting around the galactic center. We can consider an object seemingly sitting in space not moving, but what is it not moving in relation to? It's perhaps not moving with relation to one galaxy, but it would be moving in relation to any other galaxy. The object could be not moving in relation to your self, but then it should be obvious that you and the object are moving with respect to something in your surroundings. There isn't really a point of reference other than a galaxy (the galactic center) or any singular celestial object such as a spacecraft, star, moon, planet, or random comet/asteroid. We can talk about an object not moving within a laboratory environment, because it can be at rest on a table and we can see that it isn't moving. But technically it's still moving since we're on a planet surface and that surface is spinning with the planet, which at the equator would be a velocity of around 1000 mph. To go ahead and try to answer your question... Is it possible that an object is accelerating without any force acting on it? Force is really the only thing that can make an object move (i.e. accelerate). There isn't a cause of movement (acceleration) other than force, so the plain answer to your question really is this short. If an object is observed to accelerate in some direction (going into motion in a new direction) you can conclude that some kind of force acted upon that object. The other possibility, of course, is that the observer started moving and the observation is invalid... but we're more or less assuming a valid observation has been achieved and verified, if we're watching the object for movement. By the way, if you’re interested in the forces required for celestial mechanics that causes entire planets, moons, and stars to follow orbital paths, and many other cosmic dynamics, then it’s worth studying what I believe to be the true cause of gravity, which illuminates gravitational force as a result of the impartation of particle momentum from asymmetrical background permeative particle fields. STUDY ASTROPHYSICS: Brian Klock's answer to What are some of the coolest phenomena that result from gravity? ",
            "date": "Updated October 20, 2020",
            "views": "48",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Decheng Fan",
                    "user_href": "/profile/Decheng-Fan"
                },
                {
                    "user_id": "Bikash Panda",
                    "user_href": "/profile/Bikash-Panda-17"
                },
                {
                    "user_id": "Nirmal Kumar P",
                    "user_href": "/profile/Nirmal-Kumar-P-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Todd Gardiner",
                "href": "/profile/Todd-Gardiner"
            },
            "answer_text": "Yes. In fact this is normal. There is no frame of reference in which something is sitting still, but not described as moving when viewed from a different frame of reference. You have made a very simple misunderstanding. Force doesn't cause movement, per se. It causes a change in the current speed of movement. It causes acceleration. But perhaps you were asking this another way. If there is an object that is not moving, and then it is moving later, must a force have acted upon it? There is a case where no force acted on the object. That case is where the force acted on the observer and the observer's frame of reference is accelerating, not the object being observed. Consider: You are siting in a car and looking at a stop sign. The stop sign is fixed to the ground. Now, using only your eyes for observation, the sign (and the ground) all appear to be moving. -- But in fact, it is the car that started moving. The force acted on you, not the sign. ",
            "date": "Answered February 20, 2016",
            "views": "21",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Patricia Hronich",
                    "user_href": "/profile/Patricia-Hronich"
                },
                {
                    "user_id": "Nirmal Kumar P",
                    "user_href": "/profile/Nirmal-Kumar-P-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rafal Muszynski",
                "href": "/profile/Rafal-Muszynski-2"
            },
            "answer_text": "Yes, no problem. If you accelerate then in your reference frame you are stationary but the object in question will accelerate (coordinate-wise) even though you will not be able to identify any real force acting on it. For example, when I sit still on the chair in the night and stare at the stars then they seem to run around me in the circular motion (and circular motion means centripetal acceleration) , even though there is no force to make them do so. That is what makes difference between inertial and non-inertial frames of reference. ",
            "date": "Answered August 29, 2018",
            "views": "12",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Paul Oroborust",
                    "user_href": "/profile/Paul-Oroborust"
                },
                {
                    "user_id": "Uday Teja",
                    "user_href": "/profile/Uday-Teja-72"
                },
                {
                    "user_id": "Udit Katiyar",
                    "user_href": "/profile/Udit-Katiyar-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Phil Sherb",
                "href": "/profile/Phil-Sherb"
            },
            "answer_text": "If everything in the world was moved in the same direction, except for your object, you could say that it moved without a force being applied. Now, because short answers are discouraged on quora, I will elongate it by saying pneumonoultramicroscopicsilicovolcanoconiosis, which is a word that refers to a lung disease contracted from the inhalation of very fine silica particles, specifically from a volcano; medically, it is the same as silicosis. ",
            "date": "Answered November 14, 2016",
            "views": "861",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Reetu Agrawal",
                    "user_href": "/profile/Reetu-Agrawal-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ayush Kashyap",
                "href": "/profile/Ayush-Kashyap-12"
            },
            "answer_text": "Just take a object in vacuum and let it be moving at a uniform speed so there is no acceleration on the object.Now,So, it will be moving without being any force acting on it. ",
            "date": "Answered February 17, 2016",
            "views": "22",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Uday Teja",
                    "user_href": "/profile/Uday-Teja-72"
                },
                {
                    "user_id": "Dunnex Samuel",
                    "user_href": "/profile/Dunnex-Samuel"
                },
                {
                    "user_id": "Nirmal Kumar P",
                    "user_href": "/profile/Nirmal-Kumar-P-1"
                },
                {
                    "user_id": "Jyoti Prakash Nayak",
                    "user_href": "/profile/Jyoti-Prakash-Nayak-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Muthineni Abhinay",
                "href": "/profile/Muthineni-Abhinay"
            },
            "answer_text": "That's a good question. The answer is no because a body should acted by internal or external force which tend them to move. we all know that 3 Newton's laws of motion According to law:1 No body can change their state of position until and unless acted by an external force to change it's state of being. I guess u got the answer. ",
            "date": "Answered August 6, 2018",
            "views": "262",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tony Goldsmith",
                "href": "/profile/Tony-Goldsmith-6"
            },
            "answer_text": "Many of the responders (and Newton fans) are not going to like this. It is possible and that's cut to the quick and talk about gravity. An object in Space-time will naturally follow the geodesics to Earth. If you stop it with something (i.e. your hand or the surface of the Earth) then the upward force from you gives the illusion of a downward force from the object. There doesn't have to be any force of acceleration. I know ? ! ",
            "date": "Answered August 29, 2018",
            "views": "364",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rafal Muszynski",
                    "user_href": "/profile/Rafal-Muszynski-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wendy Krieger",
                "href": "/profile/Wendy-Krieger"
            },
            "answer_text": "Inertia is movement without force.  There's even a word for it, so i suppose it's possible. A ball rolling on the ground has the same energy as what set it rolling, and nothing is adding to it, so it keeps moving under inertia. Is it possible that an object is moving without being any force acting on it? ",
            "date": "Answered February 19, 2016",
            "views": "12",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Uday Teja",
                    "user_href": "/profile/Uday-Teja-72"
                },
                {
                    "user_id": "Nirmal Kumar P",
                    "user_href": "/profile/Nirmal-Kumar-P-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Omar Luis Curetti",
                "href": "/profile/Omar-Luis-Curetti"
            },
            "answer_text": "It will be quite difficult to find a point in the universe where no external forces were exerted, and everything is moving if you change the reference but from physic point of view, given an initial impulse the mass will keep moving until some other opposed impulse make it to stop. ",
            "date": "Answered February 17, 2016",
            "views": "889",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Nirmal Kumar P",
                    "user_href": "/profile/Nirmal-Kumar-P-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fakhri As'Ad",
                "href": "/profile/Fakhri-AsAd"
            },
            "answer_text": "If there is no force , then the acceleration is zero according to Newton first and second laws , and the object either at rest or moving with constant velocity .Voyeger 1 and voyeger 2 are moving for about 40 years without any force acting on them . ",
            "date": "Updated September 16, 2018",
            "views": "182",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Zane Jakobs",
                "href": "/profile/Zane-Jakobs"
            },
            "answer_text": "Sure! Newton's second law states that [math]F=dp/dt[/math], or, as you're probably more familiar with, [math]F=ma[/math]. If speed doesn't change, acceleration is [math]0[/math]. Therefore, [math]F=0[/math]. Speed could have any value, but it won't change.   ",
            "date": "Answered February 18, 2016",
            "views": "221",
            "upvotes": " Answer requested by Maria Hitang"
        },
        {
            "author_info": {
                "name": "Steve Noskowicz",
                "href": "/profile/Steve-Noskowicz"
            },
            "answer_text": "Q: Is it possible that an object has an acceleration but no force is applied on it? A: Nope. Newton’s First Law can be re-worded to: “A force is required to accelerate any mass.” ",
            "date": "Answered August 29, 2018",
            "views": "160",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mir Musaib",
                "href": "/profile/Mir-Musaib-4"
            },
            "answer_text": "Yes when a body is throwen down from an inclined surface Galileo observations ",
            "date": "Answered May 18, 2018",
            "views": "62",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robin Brackman",
                "href": "/profile/Robin-Brackman"
            },
            "answer_text": "NO ",
            "date": "Answered August 29, 2018",
            "views": "85",
            "upvotes": "0"
        }
    ]
}