{
    "title": "Is it true that war accelerates technological advancements? - Quora",
    "tags": [
        "Warfare"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gauthier Arnould",
                "href": "/profile/Gauthier-Arnould"
            },
            "answer_text": "No, that’s a myth. War accelerates the improvement of some mature technologies only when they can provide a operational net value on the short term. Advandced prototypes and proven designs are oftenly the only recipients of war efforts. Every other application is left behind Allocation of human ressources (engineers and scientists), fundings and material ressources (factories, raw materials) must be optimal during war times and thus long term research and studies are impossible. This is a state of survival. War let the last word on the sole military on what technology is worth some bucks. Most technological and scientific breaktrough of WW2 where in fact prior to the war: radar (operationnal in 1938), jet engine (first flight in 1939), missile (advandced prototypes in 1937) and even nuclear weapons (conceptualized in 1939). Pre-war or cold-war are surely way more productive in term of technological advancement. War actually freeze the developpement of promising technologies to focus on what is the more likely to be a weapon in a near future. By late 1939, every major power was aware that a nuclear weapon was feasible they just had no idea on how to do it. Japan and Germany (France being occupied) were already wartime economy and devellopement of nuclear weapons was a minor concern during the whole war because of the lack of secured design at its very beginning. On the other hand, the US that gets involved later in war was able (with the help of the British) to go beyond feasibility studies. They saw the glimpse of an operationnal device that deserved major efforts by 1941. Peaceful uses of nuclear energy were left behind despite the tremendous progress made in nuclear physics in the 30’s. Without the war, there would have been no limitations on academic publication and more emulation within the scientific community. ",
            "date": "Answered August 23, 2017",
            "views": "589",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mihai Badita",
                    "user_href": "/profile/Mihai-Badita"
                },
                {
                    "user_id": "Henning Eriksen",
                    "user_href": "/profile/Henning-Eriksen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Gruszynski",
                "href": "/profile/Jeff-Gruszynski"
            },
            "answer_text": "Yes and no. Military and war goals often create incentives and funding for early R&D. But. Military purchasing is NEVER cost effective enough to bring products to the broader economy. The example of semiconductors is illustrative. Early semiconductor development in the 1950s and early 1960s was driven and funded by military funding and the Cold War. However by 1965, the ROI of military spending of 0.0001% - it cost $10,000 to generate $1 in the broader economy. That’s grotesquely wasteful and not sustainable. So what happened in the entire industry “pivoted” to commercial applications and the military applications we left far behind. In fact this reality is what led to the creation via DARPA of the fabless/foundry system. DOD paid for most of the development so they could “piggyback” on the vibrant commercial fab system they envisioned - DOD couldn’t support the commercial industry. The only problems that few to no US companies embraced the foundry system and the first major company to adopt the economic model was TSMC (Taiwan Semiconductor Manufacturing Corporation), and since then most foundries are now in Asia. The failure of US corporations to “play ball” was not anticipated and pretty much ruined things for the US military specifically. This is also how we “achieved” the current “counterfeit IC” problem for DOD. FICS Counterfeit Integrated Circuit Database ",
            "date": "Answered August 24, 2017",
            "views": "558",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ram Gowda",
                    "user_href": "/profile/Ram-Gowda-2"
                },
                {
                    "user_id": "Karan Mehta",
                    "user_href": "/profile/Karan-Mehta-8"
                }
            ]
        }
    ]
}