{
    "title": "Is it common for a scientist to be multilingual? - Quora",
    "tags": [
        "Multilingualism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nelson Laker",
                "href": "/profile/Nelson-Laker"
            },
            "answer_text": "Yes. Scientist come from all over the world. From Africa to Asia. From Europe to America. From Russia to South America. However English is the international language of science. All ideas are communicated through this language. All scientist have to be able to read and write in English. Most will also be able to speak in English. The English used is also full of technical terms which are not used in day to day speech. So it can even sound like a foreign language to a non scientist English speaker. If you are a native english speaker it is also useful to speak another language. The scientific endeavor is also an international one. So as a scientist you may end up working in multiple countries over your lifetime. For instance you maybe working in China for a while. And though your lab co-workers will speak English (to one degree or another), the person who you buy your groceries from will probably not. So being multilingual will allow you to expend into other nations. ",
            "date": "Answered April 14, 2019",
            "views": "101",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Felicity Oliver",
                "href": "/profile/Felicity-Oliver"
            },
            "answer_text": "Not in my experience. My first husband, a computer scientist, joined a company in the German speaking part of Switzerland in 1971. There were several other English speaking employees and most of them did not make any attempt to learn German. Luckily for them, most of their wives spoke either German and/or French. Mind you, as a mulilingual, I admit to having problems with ‘maths’. ",
            "date": "Answered April 15, 2019",
            "views": "56",
            "upvotes": " Answer requested by Joshua Withers"
        },
        {
            "author_info": {
                "name": "Gary Reid",
                "href": "/profile/Gary-Reid-10"
            },
            "answer_text": "Yes it is. Science is worldwide. Scientist come from around the world and they must communicate. Hence English is the language of scientist. I had to have a second language to earn my Ph.D. Luckily I could choose from a number of languages. My advisor spoke Spanish so that was my second language. Good luck ",
            "date": "Answered April 15, 2019",
            "views": "28",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jerome Zoeller",
                "href": "/profile/Jerome-Zoeller"
            },
            "answer_text": "Oh sure. Practically all the graduate schools in the world require minimum proficiency in two languages; this must be exhibited as partial fulfillment of the requirements for the degree of Doctor of Philosophy. ",
            "date": "Answered April 14, 2019",
            "views": "23",
            "upvotes": "0"
        }
    ]
}