{
    "title": "Is it possible to change the DNA and genes of humans? If not, then why? - Quora",
    "tags": [
        "Genetic Engineering",
        "DNA"
    ],
    "response": [
        {
            "author_info": {
                "name": "Martha Kirtley",
                "href": "/profile/Martha-Kirtley-1"
            },
            "answer_text": "This is done every time a woman has a baby. If you are talking about artificial means, we’ve been doing it for at least 20 years (probably more like 40 ) every time a bone marrow transplant is done to cure blood cancers. If you are talking about individual genes being swapped out, that was first tried many years ago, using viruses as the transport mechanisms. It failed pretty spectacularly, by causing cancers in the recipients, without fixing the genetic problems they were trying to fix. Today, with the use of the CRSPR CAS 9 technology, it has been successful in animals up to the size of rodents. It is still considered extremely unethical and inhumane to attempt with humans. ",
            "date": "Answered October 18, 2017",
            "views": "78",
            "upvotes": " Answer requested by Manish Patel",
            "upvoters": [
                {
                    "user_id": "Alex Love",
                    "user_href": "/profile/Alex-Love-42"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Breeden",
                "href": "/profile/Mike-Breeden-1"
            },
            "answer_text": "Hard to say just what you mean. Sex changes them every generation. If you mean by another method, yes it is possible. There are a number of potential methods of genetic engineering, but again it may depend on what you mean. Look on Amazon for my (short) book about my take on it - Genetics For A New Human Ecology. It has to be done carefully, but there is great potential in humans husbanding their genes and really, we have no choice if we want to survive as more than animals. Genes are the greatest wealth and the gift that keeps on giving. ",
            "date": "Answered October 18, 2017",
            "views": "41",
            "upvotes": " View 1 Upvoter "
        }
    ]
}