{
    "title": "Is medicine a science or art? - Quora",
    "tags": [
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rafael González del Solar",
                "href": "/profile/Rafael-González-del-Solar"
            },
            "answer_text": "Strictly speaking, medicine is not a science, rather a basic science, because it is not mainly interested in the generation of testable descriptive and explanatory knowledge about the world, but in the generation of effective knowledge to control a piece of the world, namely the human body. More precisely, medicine is a collection of applications of knowledge, both ordinary and scientific, theoretical and practical, to the maintenance and restauration of integral human health.  The Doctor by Luke Fildes (detail) As such, medicine is a technology and an art, not a science. Its main goals are practical so explanations are not as important in medicine as, say, they are in biology. This is not to say that explanations are never relevant to the medical practice, of course they are. More often than not physicians need a certain understanding of what is wrong in a human body in order to try to fix it. Yet the relevance of an explanation in each case depends on it being a means to controlling the process of interest. In so many words, patients ask for cures not for explanations. For example, if a patient consults a physician about a hurting ear, and the latter diagnoses a bacterial infection on the basis of the patient’s syndrome (acute otitis externa), the doctor’s most likely response will be to prescribe some antibiotic to stop the infection, but not further tests in order to know precisely what kind of bacteria is responsible for this particular case of ear infection. If the prescribed antibiotic is effective, that is, if the otitis recedes, then the physician has fullfiled her task.  A moderate case of otitis externa. In sum, medicine is a biotechnology and it need knowledge from a variety of sources in order to solve practical health problems. Thus, the field makes use of all the branches of knowledge that are relevant to the correct functioning and maintenance of the human body. Those include all biological knowledge describing the components of the human body, as well as its functioning, at different scales and at different stages of its development, from molecular biology to genetics, from embryology to neuroinmunoendocrinology, from the anatomy to the physiology of the varied body systems (circulatory, digestive, excretory, endocrine, integumentary, exocrine, immune, muscular, nervous, urinary, reproductive, and skeletal systems). In addition, since human beings do not exist isolated in vacuum but are embedded in an environment, medicine also uses knowledge about the ways (organs and processes) humans relate to their environment, especially to their social environment. This makes many other branches of knowledge, among them, biopsychology (for psychological pathologies), epidemiology (for a population view of disease), and social science (for the social determinants of health), relevant for the exercise of medicine. And since medicine is devoted to the maintenance and restauration of human health, its sources include knowledge of what can go wrong in the emergence and maintenance of a human body. In other words, medicine is especially interested in human pathologies. Likewise, medicine includes a wide variety of conceptual, operative, manual, and instrumental techniques to monitor the health state of the human body, as well as to diagnose, prognosticate, and intervene the pathological processes of interest. Now, medicine is a branch of general human knowledge, both descriptive and practical, but physicians, the ones who apply such knowledge, do not practice it in general. Indeed, physicians provide health care to individuals in particular circumstances, so the idiosyncrasies of each case are likely to be fundamental for the adequate treatment of each medical problem the physician has to face. This is why medicine is also an art.  French surgeon Ambrose Paré (c. 1510-1590) attending to a soldier's amputated leg. A deeper reason why medicine is a form of art is the following. Many medical problems are inverse problems, that is, problems of finding the causal factors that produce a syndrome from the set of observations describing such syndrome. Since usually more than one cause can originate the same set of observations, the physician needs to use her imagination and discernment, as well as her background knowledge (both theoretical and practical), to tackle the health problem of her patient. Many of these abilities and skills are forms of tacit knowledge and cannot be formally taught. Instead, they are acquired through personal experience and watching senior practitioners practice their art. ",
            "date": "Answered April 4, 2020",
            "views": "512",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "David Cardew",
                    "user_href": "/profile/David-Cardew"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven Ford",
                "href": "/profile/Steven-Ford"
            },
            "answer_text": "Medicine is not a single discipline. It is a seething mass of interlocking disciplines, with very fuzzy edges, with a broad relation to human health in its widest possible form.The deeper you dig yourself into a specialist silo the more like a scientist you become. Whereas the generalist, especially in primary care, has to deal with whatever comes through the door, regardless of nature or aetiology - this can make you artful but not necessarily artistic.The primary care physician will attempt to synthesise the physical, psychological and social dimensions of a presenting symptom cluster into a broad diagnostic formulation or differential diagnosis before proceeding to investigation and/or treatment. For many conditions this process can be telescoped into a few minutes but for even the most apparently straightforward presentation there may be clues to problems of which the patient is unaware or which have remained unspoken.The art, if that is the right word, lies in developing clinical 'antennae' that respond to subtle and especially covert irregularities in the whole person before you.Biology is inherently chaotic and therefore outcomes are unpredictable - hence the aphorism: The operation was a success but the patient died. There can be no guarantees.Are instinct or clinical accumen sometimes confused for art? Even they are wrong sometimes.Being a clinical practitioner is complex but probably the most interesting job in the universe - if you have eyes to see and ears to hear etc. ",
            "date": "Answered January 8, 2012",
            "views": "19",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alfredo A. Sadun",
                    "user_href": "/profile/Alfredo-A-Sadun"
                },
                {
                    "user_id": "Agrim Jain",
                    "user_href": "/profile/Agrim-Jain-32"
                },
                {
                    "user_id": "Rachel Ng",
                    "user_href": "/profile/Rachel-Ng-83"
                },
                {
                    "user_id": "Çağrı Mert Bakırcı",
                    "user_href": "/profile/Çağrı-Mert-Bakırcı-1"
                },
                {
                    "user_id": "Charlie Skie",
                    "user_href": "/profile/Charlie-Skie"
                },
                {
                    "user_id": "Ping Sun",
                    "user_href": "/profile/Ping-Sun-1"
                },
                {
                    "user_id": "Jen Rieger",
                    "user_href": "/profile/Jen-Rieger"
                }
            ]
        }
    ]
}