{
    "title": "Is nature and God the same thing? - Quora",
    "tags": [
        "Theology",
        "God"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ron Gordon",
                "href": "/profile/Ron-Gordon-18"
            },
            "answer_text": "You must define your terms before such a comparison is possible. Do you mean by “God” the God of Abraham? History is replete with thousands of gods. You cannot assume we all have the same definition, and I would submit that even within the same religion no two adherents have exactly the same concept of their shared god. Is this god omnipotent, eternal, all-knowing, creator of all, compassionate, and involved with individual destinies? Does he promise eternal salvation? Does he punish sinners? Maybe your god never interferes and only had sway in the distant past. Let us know and we’ll talk. If by nature you mean the “natural order of reality” or the rules governing the physical world around us, you will find that many peoples have equated “mother nature” with a god as the initial originator and rule-setter of all we perceive. Most define nature merely as the “way things are”; there is no why or cause, it simply is. What do you mean? Fundamentally, however, one must decide whether either term connotes some level of purpose. Here in lies the modern distinction. Nature, as defined by scientific evidence, has direction and rules of behavior that we can readily observe and predict; but, it has no purpose. Gods usually have a purpose in mind when they act to interference in human affairs or in the “normal” processes we observe. Again, you need to be more specific before we can fully engage. ",
            "date": "Answered August 1, 2018",
            "views": "274",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steve Ruis",
                "href": "/profile/Steve-Ruis"
            },
            "answer_text": "If you ask people to define what they mean by “god,” some will equate such a thing to nature. If you keep asking, you will find that almost everyone has a different answer. Some will give pat answers like “I believe in the god of the Bible.” If you press and ask for specifics, those who do not have them will cut off the discussion. Those that do have them will provide specifics that are different from those of other people. I suspect that everyone’s definition of god is like a golf swing: everyone is different … which tells you a lot about gods and religion, most of it is made up in your own imagination. ",
            "date": "Answered August 4, 2018",
            "views": "48",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brenda Last",
                    "user_href": "/profile/Brenda-Last"
                },
                {
                    "user_id": "Helen Von Schrottky",
                    "user_href": "/profile/Helen-Von-Schrottky"
                }
            ]
        }
    ]
}