{
    "title": "Is over-dependence on technology deteriorating the human brain? - Quora",
    "tags": [
        "Human Brain",
        "Neuroscience"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kashinath Jalay",
                "href": "/profile/Kashinath-Jalay"
            },
            "answer_text": "Friends over the years we have increasingly became dependent on technology and becoming addicted to the digital screen. Young boys are girls are no longer required to go outside to play with their friends because thanks to play station and Xbox you could even compete in virtual Olympics with lots of online friends. No longer anyone, remembers his local streets and locality thanks to GPS embedded cell phones. No longer, we know our next door neighbourhood grocery shop owner or book store owner as everything could be purchased online now. Friends aren’t we imprisoning ourselves in virtual prison??? ☺technology in certain cases is drifting us apart but as with many inventions of particular age it has both ups and downs. I would say more ups than downs. Why are we forgetting the same technology brought the citizens of the world together who were divided by their selfish leaders? Why are we forgetting that the technology brought the services such as banking and virtual doctor to remote villages? Why are we forgetting wireless technology made it possible for a person in remote villages more connected to cities? technology has both ups and downs. It’s the primary issue we are not debasing importance of technology in everyone’s life but its overdependence. The term that should be used here is judicious use of technology. Use of mobile phones to be in touch with your friends and families is no problem at all but we often should get out and explore remote areas without network connection and wi-fi  I would like to state few points that could be useful in bringing fruitful conclusion to the discussion. 67% of people feel themselves checking their cell phones frequently for messages or missed calls. 44% people can’t sleep without their cell phones by their side and finally 29% of all people can’t imagine a single day without cell phone. Friends at this point one need to think if technology is mere necessity or obsession the facts stated could seem driving to conclusion but I would like to question the veracity of these facts. Students of a prestigious MBA institution, XLRI were taken to outbound training for three days. Before the training many complained about the compulsory trip and were unable to survive even for a day without cell phone but during the trip nearly everyone was whole heartedly enjoying the trip. Technology appeals to curious human mind so we remain attached to it but I don’t call it overdependence I would like to point out another side of coin. May be in the instance you discussed people were merely dependent on technology and not over dependent but what you would call of a case of a Korean couple who let their child starve to raise virtual baby in an online game. Can you call this merely dependence? I will not and it’s not singular cases. It was observed tendency of US army personnel posted in Iraq and Afghanistan to be more violent and aggressive after playing call of duty on their X box if there was any thin line between dependence and overdependence we have crossed it long ago. In academic spheres also the impact of technology could be seen clearly. Learning is a long process which passes through stages of experience, observation, analysis and action but thanks to Google we are now just going for action leaving our learning incomplete. Can you imagine 40000 required online demonstration of how to boil water? I wonder where are moving when we can’t ask our friends, family and neighbours about basic things Conclusion Technology is no matter need of today and in now manner its importance could be neglected in this century but we are becoming overwhelmingly dependent on technological solution and feel helpless in absence of that. There is need for self-control and efforts need to be taken by family and society to make kids of this generation aware of the surroundings. Blending technological solutions with traditional learning technique could solve the issue Facts related to the topic •\t67% of people feel themselves checking their cell phones frequently for messages or missed calls •\t44% people can’t sleep without their cell phones by their side •\t29% of all people can’t imagine a single day without cell phone •\t55% of American teens use social network as predominant form of communication  ",
            "date": "Answered July 26, 2018",
            "views": "19",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sai Surya",
                    "user_href": "/profile/Sai-Surya-180"
                },
                {
                    "user_id": "Abinayashree Sethuraman",
                    "user_href": "/profile/Abinayashree-Sethuraman"
                },
                {
                    "user_id": "Anushka Chopra",
                    "user_href": "/profile/Anushka-Chopra-15"
                },
                {
                    "user_id": "Gulkesh Domun",
                    "user_href": "/profile/Gulkesh-Domun"
                },
                {
                    "user_id": "Xenab Xz",
                    "user_href": "/profile/Xenab-Xz"
                },
                {
                    "user_id": "Not Ellehcim",
                    "user_href": "/profile/Not-Ellehcim"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akash Chakrabarty",
                "href": "/profile/Akash-Chakrabarty-4"
            },
            "answer_text": "Yes, over-dependence of technology has its bad impacts. When you take drugs or smoke or drink alcohol why can't you leave it? Its because taking that releases a hormone called dopamine in the brain. This is our escape from stress. Now, heres the interesting part. Studies have found out the same dopamine is produced when you are surfing through Facebook or texting your friend. Thats why it feels good when someone replies to your text. So what can be said? Dopamine causes addiction like alcohol or drugs. The same is caused due to over dependence of social media. Technology is good but addiction is bad. Its the same as telling a 5 year old kid to smoke.Secondly, social media induces a comparision between our peers. He has more likes, she has more comments on her picture ‘wow, look how cool he is looking, he must be tremendously successful in life’. Such thoughts can lead to inferiority complex, inconfidence in our abilities and depression which will lead to several diseases.Hence, over dependence of technology is not only bad for the brain but also for the conscious mind and body. Instead, use technology as much is necessary. Helps to be the best version of yourself.",
            "date": "Answered July 26, 2018",
            "views": "554",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sooraj Honavar",
                    "user_href": "/profile/Sooraj-Honavar"
                }
            ]
        }
    ]
}