{
    "title": "Is organic chemistry a better option for pre-med than biomedical science? - Quora",
    "tags": [
        "Learning About Biomedical Science",
        "Biomedical Science",
        "Pre-Medical",
        "Biomedical Engineering",
        "Organic Chemistry",
        "Medical School",
        "The College and University Experience",
        "Science",
        "Chemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eric Ressner",
                "href": "/profile/Eric-Ressner"
            },
            "answer_text": "Is organic chemistry a better option for pre-med than biomedical science? I don’t know what your college’s “biomedical science” curriculum contains. If it is only a one- or two-semester course, it sounds like a very superficial treatment of many topics — probably including a superficial introduction to organic chemistry — that will not prepare you for the MCAT or other related professional aptitude tests. I won’t pretend that all the content of a majors’ course in organic chemistry will come back useful in a medical career, but a great deal of it is preparation for biochemistry, which is central to medicine, and which you will see again in your first-year professional curriculum. You need that. Further, the way of thinking — and learning — that are necessary for you to be successful in organic chemistry are very much echoed by a medical school curriculum. If you can’t hack OChem, you might want to rethink your future plans. ",
            "date": "Answered October 23, 2020",
            "views": "209",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "John Collins",
                    "user_href": "/profile/John-Collins-211"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Devor",
                "href": "/profile/Robert-Devor-4"
            },
            "answer_text": "Q. Is organic chemistry a better option for pre-med than biomedical science? A. No one is a “pre-med” major. 😱You have to major in something substantial and which is offered by your school. One doesn't need to be a science major to get into medical school, but you should have some science background and a degree which will earn you a living should you not get accepted. Medical Technology, Nursing, Biochemistry, Pharmacy are great careers to pursue for admission. They will also acquaint one with the medical side before applying for medical school. Organic chemistry will be part of the classes required with those majors. 🎃 ",
            "date": "Answered October 23, 2020",
            "views": "210",
            "upvotes": " Answer requested by Joe Jackson"
        }
    ]
}