{
    "title": "Is psychology a pseudoscience? - Quora",
    "tags": [
        "Scientific Method",
        "Pseudoscience",
        "Psychology",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Dunn",
                "href": "/profile/Mark-Dunn-64"
            },
            "answer_text": "No, but some institutions and persons try to sell it as pseudoscience.  Psychology, like psychiatry, is not a science and would be academically and practically stunting itself to claim the mantle of being scientific. Of course, it can still appeal to science, and to principles and research which apply the scientific method. There is enrichment to be found in incorporating contemporary scientific theories with psychosocial practices such as psychology and psychiatry. However, that does not mean psychology is itself scientific or that theories which incorporate scientific ideas are magically transformed into science by doing so. Science is one of many tools which psychology and practitioners can employ, but most psychological and psychiatric theories violate one or more of three essential tenets of the scientific method: limiting theorizing to the natural world, basing theories on objective observations and measurements, and proposing falsifiable theories. Due to the intense focus on ‘the mind’ rather than the brain in much of psychology and psychiatry, the non-falsifiable metaphysical claims making up their core are understandably quite far from science.  “Pseudoscience” is what we call conclusions, programs, or bodies of work which allege to run on scientific philosophies but, in fact, depart from their somewhat restrictive rulesets in at least one manner. The difference between “non-scientific” and “pseudoscientific” is honesty. Being “pseudoscience” does not make something right or wrong, helpful or harmful, it just means something is falsely claiming to follow a certain collection of predetermined precepts. Likewise, a process following the rules of scientific inquiry does not mean we come to correct or useful results. It would be ridiculous and counterproductive to expect all useful knowledge to be “scientific” in nature. That would hold back humanity as a species, and hold back societies and communities as expressions of species. “Scientific”, despite all the marketing, is neither an honorific nor an elevation. It is simply a flavor of philosophizing. If we are to warn against pseudoscience, it is to warn against something claiming to work differently than it really does. Misrepresentation in this manner compromises things like objective critical analysis and informed consent.  Psychology is better off not restricting itself to the perspectives which science would impose, and not trying to give the impression that science is the route to—or measure of—all meaningful knowledge. Science is not something psychology aspires to be wholly subjected to and defined by, and we would lose out if it did. Because of the immense marketability of pseudoscience rather than honest non-science, most mainstream institutions and standards as well as many practitioners trade in accountability for a profitable image of social relevance. This is not inherent to psychology, and undermines the integrity of psychology as a field. ",
            "date": "Updated June 23, 2018",
            "views": "243",
            "upvotes": " View 74 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Raul Alonso",
                    "user_href": "/profile/Raul-Alonso-5"
                },
                {
                    "user_id": "Parameswaran B Annapoorani",
                    "user_href": "/profile/Parameswaran-B-Annapoorani"
                },
                {
                    "user_id": "Suha Nourin",
                    "user_href": "/profile/Suha-Nourin"
                },
                {
                    "user_id": "Joyanne MacDonald",
                    "user_href": "/profile/Joyanne-MacDonald-1"
                },
                {
                    "user_id": "Cagdas Ege Cafer",
                    "user_href": "/profile/Cagdas-Ege-Cafer"
                },
                {
                    "user_id": "Guilherme Xavier",
                    "user_href": "/profile/Guilherme-Xavier-10"
                },
                {
                    "user_id": "Nadia Nicole",
                    "user_href": "/profile/Nadia-Nicole-17"
                },
                {
                    "user_id": "Ray Richard",
                    "user_href": "/profile/Ray-Richard-21"
                },
                {
                    "user_id": "Peter Jones",
                    "user_href": "/profile/Peter-Jones-288"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Lethal-Strike-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anthony Tepas",
                "href": "/profile/Anthony-Tepas"
            },
            "answer_text": "Most of psychology that’s \"legit\" are axiomatic and were long known and established by philosophers, theologists, anthropologists, and biologists, each in their own way. Everything else in the field of psychology - that is, everything that psychology has attempted to contribute that is NOT copypasted from other fields - can be discarded through the age-old adage, \"correlation does not equal causation\" Every one of their claims and studies presupposes the validity of platitudinous, trite or outright false beliefs, generally based on leftist or humanist ideologies (\"people are inherently good/benevolent\", \"morality is subjective\", \"X is a social construct\"). Whenever they attempt to make a claim about some \"fact\" that is NOT purely metaphysical and can be studied physically, such as the idea that \"depression is a result of a chemical imbalance\", it gets debunked six ways from sunday and they end up having to recant their statements, but not before peddling trillions of dollars of yummy habit forming, toxic, brain structure-changing psychotropic drugs to millions of hapless \"patients\"!!! The void left in society by its systematic secularization has been filled by a new, godless religion of \"Science\", where pop scientist like Neil deGrasse Tyson, Michio Kaku, Elon Musk and other media darlings are the new televangelists, double-blind placebo controlled studies are gospel, and psychotropic drugs are the sacrament. Thus the progressive new-age lobbyists which are responsible for this change in society are increasingly able to use \"psychology\" and other forms of science as a political tool by which to advance their own agenda. It is the perfect plan because anyone who attempts to deny or reject their ideologies (which they subtly imbue into the \"scientific truths\" they have published is branded as a \"heretic\" (\"anti-science\"), and loses credibility with the public. There is no reason why psychology needs to exist other than as a mallet with which to beat the social collective consciousness into a given shape. ",
            "date": "Answered November 26, 2018",
            "views": "27",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nate Savage",
                    "user_href": "/profile/Nate-Savage-8"
                },
                {
                    "user_id": "Noah Nellis",
                    "user_href": "/profile/Noah-Nellis-1"
                },
                {
                    "user_id": "Miguel Cotto",
                    "user_href": "/profile/Miguel-Cotto-6"
                },
                {
                    "user_id": "Raffaello Fratini",
                    "user_href": "/profile/Raffaello-Fratini"
                },
                {
                    "user_id": "Northern Frog",
                    "user_href": "/profile/Northern-Frog"
                },
                {
                    "user_id": "Jim Springer",
                    "user_href": "/profile/Jim-Springer-8"
                },
                {
                    "user_id": "Katie Graven",
                    "user_href": "/profile/Katie-Graven"
                },
                {
                    "user_id": "Michael J. McFadden",
                    "user_href": "/profile/Michael-J-McFadden"
                }
            ]
        }
    ]
}