{
    "title": "Is science in danger because people choose to ignore reality and throw insults at any opinion they don't 100% already believe? - Quora",
    "tags": [
        "Humans ",
        "People",
        "Sociology"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Ford",
                "href": "/profile/David-Ford-71"
            },
            "answer_text": "I don’t think science is in danger. People might be in danger, but not science. Science is just a method for creating knowledge. If people want to ignore what is known about creating knowledge, they do so at their own peril. If we want to believe our prejudices as the expense of objective reality, then the world will still respond in its objective way no matter how strongly we may hold our opinions. The scientific method will still go on being a method whether or not anyone uses it. It will still be a method even if no people are left. Even though it is an idea of human beings, it is a method that can be used by any entity that seeks to create knowledge, human or not. Humans may believe they are the center of the universe and everything that happens has to do with us, but that doesn’t make it so. It probably makes sense for us to relate to the world as if we have the only point of view that matters, since it is our lives at stake, but that does not rule out the possibility that other entities exist in the universe that have their own self-centric point of view. Still, no matter how much we believe what we believe instead of paying attention to objective measures of our environment, the environment will continue to act as it acts, even if we don’t believe it will. Our beliefs may influence objective behavior a bit, but I don’t know that they can totally rule reality. Mostly, I think reality takes precedence over our beliefs. Still, that’s not certain. It’s possible that our beliefs may determine reality more than reality determines reality. If so, all those people who follow belief instead of trying to make objective determinations about reality will laugh us all the way into our graves. ",
            "date": "Answered January 2, 2018",
            "views": "63",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mark Dunn",
                    "user_href": "/profile/Mark-Dunn-64"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Shapiro",
                "href": "/profile/Dave-Shapiro-3"
            },
            "answer_text": "That people choose to “ignore reality” is not new. There are still people today who believe the Earth is flat, that the Sun revolves around the Earth and of course the most popular item at this time - that global warming is a myth. (Before anyone protests, if you had basic science in high school they explained that the we are coming out of the last Ice Age - the normal state of the planet is warmer. If you want to debate Man’s contributions to this, fine but the science is sound. I believe there are three main reasons that people choose to ignore (or deny) the science. First, it conflicts with their religious or personal beliefs. There are those that still believe the entire Universe was ‘created’ simply for the benefit of humans on Earth. There are billions upon billions of stars, most cannot be seen with the human eye. This belief is ludicrous. Second is the profit motive. It may be more profitable to deny science, to deny reality because accepting it may result in a financial loss. Consider someone who had invested his life savings in a cigarette company prior to the revelations about the harmful effects of cigarettes. He could possibly lose his life savings. He becomes a science denier. Finally there is an anti-science movement/attitude among many young people today. Very often, while teaching a math class, I was asked: Why do we have to know this? Are we ever going to use this? Today, people who study science are considered ‘nerds’ or ‘geeks’. It is a sad state when college students believe that DNA can be influenced by what you eat or that strapping magnets to your arms will build muscles. (Actually it will build muscle mass if the magnets are heavy enough.) ",
            "date": "Answered January 2, 2018",
            "views": "149",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Donald Steiny",
                    "user_href": "/profile/Donald-Steiny-1"
                }
            ]
        }
    ]
}