{
    "title": "Is science just another religion? - Quora",
    "tags": [
        "Science and Religion",
        "Science of Everyday Life",
        "Science",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Craig Weiler",
                "href": "/profile/Craig-Weiler"
            },
            "answer_text": "Is science just another religion? This is an ageless question and it is more complicated than it appears. You can’t answer this with a simple yes or no. To answer this question you have to take a deep dive into philosophy and human behavior. Science and religion have both similarities and differences and are not as easily divided as first appears. To begin with, science and religion are both closely related branches of philosophy. They both deal with the question of “what is our existence?” and “what is reality?” Both support their particular answers with evidence. Where they differ isn’t in the need for evidence, but rather in the rules for evidence and the underlying assumptions. Let’s take the Catholic church and how they go about giving someone sainthood. To start with, a person must have been dead for five years before the process can begin. This puts some distance between the person and the emotional attachments involved and hopefully makes the process more objective. However, if the evidence is deemed to be sufficient, this waiting period can be waived. An investigation is opened. The person must have lived a life of sufficient virtue and holiness to be considered. There are agreed upon criteria for this. If the person passes the investigation at this level their status is elevated to “Servant of God.” The person must demonstrate “Heroic Virtue.” This is a term with specific meaning for the church. The person has met all the criteria and passed every level of the investigation so far. Their status is elevated to “Venerable.” There must be a documented miracle based on praying to the individual after their death. In other words the soul of the person being considered for sainthood must be demonstrated to answer prayers with miracles. This is, after all, the job of a saint. And this is, of course, where most candidates for sainthood wash out because objectively verifiable miracles are rather rare. Even a verifiable miracle will not get you sainthood. It does however, get your status elevated to “beautification.” When I say verifiable, this isn’t just testimonials and heresay; there must be concrete evidence of events that can only be explained as miracles. (These are usually healings of some sort as they have normal, documented paper trails by health professionals throughout the entire process.) A second miracle must be documented based on praying to the individual after their death. Then, and only then, will a person be granted sainthood. The thing I want to point out here is that while the underlying assumptions, beliefs and goals guiding this process are different from fields of science, the investigative process itself is indistinguishable from a scientific investigation. The church, like science itself, is striving for objectivity and verified evidence. The scientific method derives from this methodology.  Over on the other side in the realm of science, we have scientism. Here’s a description from the American Association for the Advancement of Science: Scientism today is alive and well, as evidenced by the statements of our celebrity scientists: “The Cosmos is all that is or ever was or ever will be.” –Carl Sagan, Cosmos “The more the universe seems comprehensible, the more it also seems pointless.” –Stephen Weinburg, The First Three Minutes “We can be proud as a species because, having discovered that we are alone, we owe the gods very little.” –E.O. Wilson, Consilience While these men are certainly entitled to their personal opinions and the freedom to express them, the fact that they make such bold claims in their popular science literature blurs the line between solid, evidence-based science, and rampant philosophical speculation. In the natural sciences, when someone questions the underlying materialist assumptions that guide so many theories, including evolution and the Big Bang, the emotional response that follows has more in common with religious terms such as “heresy” and “blasphemy” than it does with scientific inquiry. The scientific world as a whole is utterly at a loss when it comes to things that don’t lend themselves to traditional reductionism, such as consciousness itself. So they tend to brush it off and trivialize it. When their beliefs are challenged, scientists can look every bit as deranged as the most fundamentalist religious believer.  My point here is that we can find situations where religion is acting like science and where science is acting like religion. The line is not clear cut; the boundaries are not black and white. Both are philosophical positions that establish certain criteria for what they accept as real. Both require belief at a certain level. Science is generally considered more rational than religion because it is supposed to follow the evidence it finds through experimentation and observation and change its theories when new evidence no longer fits existing theories. In practice, of course, science, like religion, is done by people. And people have a tendency to bend things to benefit their own beliefs and self interest. Both scientists and religious leaders are supposed to be better than that, but in practice, neither are.  Now that we’ve explored the gray area, we’re ready to address the question directly. The difference between science and religion is that science will eventually follow the evidence and change, even if it goes kicking and screaming and every skeptic has to die of old age in the meantime, science will eventually move forward. You could argue that religions become more progressive over time, but the difference is that religions change with overall cultural changes and science changes based on an accumulation of evidence. Perhaps the most telling sign of the differences is that when one is a scientist, this does not exclude that person from any religion they care to join. This is because science is not considered a specific belief, even if beliefs often accompany it. Although you wouldn’t want to be a student interested in doing a thesis exploring intelligent design under a professor who actively hates the idea, you could probably find a school and a professor that would allow you to explore that area of research. Science itself doesn’t have an opinion, and that’s really what separates it from religion. ",
            "date": "Answered November 19, 2019",
            "views": "421",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jacob Ningen",
                    "user_href": "/profile/Jacob-Ningen-1"
                },
                {
                    "user_id": "Fred Schlimm",
                    "user_href": "/profile/Fred-Schlimm"
                },
                {
                    "user_id": "Patricia Marshall",
                    "user_href": "/profile/Patricia-Marshall-68"
                }
            ]
        },
        {
            "author_info": {
                "name": "JT Deth",
                "href": "/profile/JT-Deth"
            },
            "answer_text": "No. Absolutely, positively, 100%, beyond the shadow of a doubt No.  Both science and religion have very different underlying theories of knowledge (epistomologies).  To understand why I am so confident in the statement is worth considering the epistemology of science and the epistemology of religion.  There are two different major branches  of logic. In deductive logic you reason from premises to a conclusion – as in geometry – and can be confident that your conclusions are absolutely true if your premises are. There is a second, often less familiar, branch of logic referred to as \"inductive logic\". In inductive logic the goal is to reason from specific examples to a general principle. For example, you see the sun rise in the east every morning and inductively deduce from that the general principle that the sun always rises in the east every morning. As it turns out, it is impossible to ever prove any general principle true no matter how many individual examples you find. For example if you selected marbles from an infinitely sized barrel of marbles, no matter how many black marbles you found, you could never absolutely prove that all of the marbles in the  barrel were black.  But, fortunately, as the great philosopher of science Karl Popper noted, there is an asymmetry in induction.  While finding any number of black marbles can never prove that all the marbles in the barrel are black,  finding even a single white marble definitively disproves the generalization that all of the marbles in the barrel are black. Popper realized that this is the key to science. The thing that makes a statement a scientific statement is that it is stated in such a way that it is in principle  possible to disprove that statement if you found the right data. Popper refer to this as \"falsifiability\" . A scientific statement may be true or false but it has to be saved in such a way that is in principle possible to refute it. For example, the statement  \"there is a God\"  is NOT  a scientific statement because there are no conceivable data that could disprove the existence of a God to a true believer or that could prove the existence of a God to a dedicated atheist (who could for example dismiss any data that they saw as a hallucination).  Now presumably there either is a God or is not a God but from the point of view of science it is impossible to actually test the hypothesis and therefore whether the idea is true or false, it is not a scientific idea, it resides in a different realm of knowledge that science does not touch in any way.  On the other hand, the theory of evolution, may be true or maybe false but it is a scientific  theory because it is stated in such a way that could conceivably be proved false. For example, if we were to find a completely genetically normal modern man buried in a 2 billion year old geologic strata – perhaps even better a geologic strata on another planet -  these data would definitively  disprove the concept that modern man evolved from the primates over the last million years or so.   Evolution has been tested many many times in many ways – probably most interestingly because it made a whole series of predictions about the relationships of different fossils to one another that became susceptible to testing once DNA typing came into existence – and in general what we have learned more about the details of evolution theory has stood up remarkably well so far. But this must always be viewed in the context that all scientific hypotheses, theories, or even laws are always tentative and dependent on the results of the next experiment. Newtons mechanical view of the universe  withstood every challenge for nearly 300 years until it failed faced with the Michaelis-Menton experiment  and was ultimately replaced by Einstein's theory of relativity.  Religion is based not on inductive logic but rather is based on beliefs. In some religions  the beliefs are few simple and are elaborated on by a logical theology while other religions entertaining a very complicated set of beliefs, usually formulated in a founding book of some sort that is seen as divinely inspired, and then may also give rise to theological implications. The key to the epistemology of religion at is that it is based on these beliefs, it is based on Faith.  And the very essence of Faith is the fact that no amount of contrary data will cause the believer to renounce their belief.  It is tempting to think of religion as being based on deductive logic and this is true to some degree of some religions. But many religions, perhaps most religions, reject the entire idea of any limitations on their founding deity including the limitations of logic. As is true with scientific statements, religious statements may be true or they may be false, but they differ from scientific statements because they are not falsifiable with observational or experimental data. So the belief in science is not a belief in a religion. Not in the least.   Hope this answers your question. ",
            "date": "Answered October 31, 2014",
            "views": "366",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Izidore El-Naghoun",
                    "user_href": "/profile/Izidore-El-Naghoun"
                },
                {
                    "user_id": "Jacob Ningen",
                    "user_href": "/profile/Jacob-Ningen-1"
                },
                {
                    "user_id": "Malavarayan Kabilan",
                    "user_href": "/profile/Malavarayan-Kabilan"
                }
            ]
        }
    ]
}