{
    "title": "Is the computer the most important invention? - Quora",
    "tags": [
        "Technological Innovation",
        "Innovation",
        "Invention and Inventions",
        "Computers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Li Jin",
                "href": "/profile/Li-Jin-29"
            },
            "answer_text": "Yes, absolutely. I don’t want to talk about how important computer is for our daily life or science research and how computer affects our world. I just want to say that the appearance of computer is inevitable for every civilization which evolves to a certain level. Maybe some people will refute that the computer is not the most important invention while electricity is because every computer must use electricity. I have to say this idea is totally wrong because even if a civilization cannot invent or more exactly, discover, electricity, it can discover and use energy of other forms as the same. And the civilization using another form will also invent computer, maybe completely different from the computer we human use but with the same principle. I don’t know if anyone has ever read some science fictions, in which there are some description of computer in other forms. In fact, computer in other forms are quite common in science fictions. I can give you some examples in Threebody Trilogy by Liu Cixin. There are several different forms of computer, including Human-formation computer(Threebody Problem, Chapter 17:Three Body: Newton, Von Neumann, the First Emperor, and Tri-Solar Syzygy), Trisolaran-formation computer(Threebody Problem, Chapter 18: Meet-up) and neuron-formation computer(Death’s End, Chapter 6, English verson hasn’t been published yet).  (From Three-body Problem, Chapter 18: Meet-up, Liu Cixin, tanslated by Ken Liu) Maybe you’ll say those are just fantasies in science fiction. But we have to admit that the fundermental principle of computer is not very complex and it can be realized in different ways, not only like the computer we human use today. In conclusion, the importance of computer isn’t reflected in how computer changes our world, but in that computer’s appearance is inevitable, no matter whatever form it will be in. ",
            "date": "Answered August 5, 2016",
            "views": "35",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ray Lin",
                    "user_href": "/profile/Ray-Lin-106"
                },
                {
                    "user_id": "Smriti Gautam",
                    "user_href": "/profile/Smriti-Gautam-27"
                },
                {
                    "user_id": "Omar Leon",
                    "user_href": "/profile/Omar-Leon-10"
                },
                {
                    "user_id": "Lukas Yin",
                    "user_href": "/profile/Lukas-Yin"
                },
                {
                    "user_id": "Thomas Bill",
                    "user_href": "/profile/Thomas-Bill-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "William E. Madden Jr.",
                "href": "/profile/William-E-Madden-Jr"
            },
            "answer_text": "No.  The computer is only a tool.  There will always be room for unbridled avarice.  :-) The computer is a communication tool.  Now, I know you are thinking “WTF are you talking about, Holmes?” (Yes, I’m old.)  But think about it.  What can a computer do? It can do arithmetic.  In binary.  Very fast.  (That’s just a shift from base 10, which humans use, to base 2.)  And it doesn’t understand the decimal point, so irrational numbers have to be simulated. It can combine logic equations of AND, OR, NAND, NOR, XOR, NOT, EQUAL and NOT EQUAL  Very fast. It can store data for very short or very long periods of time. Other than that, the Arithmetic Logic Unit (ALU) doesn’t do much else.  And the latest graphic chip is just a specialized ALU.  The Von Neuman machine goes back about 80 years… Everything else it can do, even in a neural network, or quantum configuration, is essentially a manipulation of that in either hardware or software.  And it’s ultimate use it to communicate results faster.  All that happened was that the technology needed to do things got smaller and needed less power. The first communication technology was the spoken word, starting with “Umgawa!”  (Hey There!)  and “Nagabish!”  (Screw You!)  You had to be face to face to do that.  And you’d probably get hit by a club as a response to “Nagabish!” Slowly, we evolved to painting on cave walls, so people in our tribe could figure out where we were, building fires (another important, binary communication technology) to show where we were so people could find us, to arranging rocks so people could find us, to telling our kids what to do (not that they listened,) to scratching things out on stones, to building roads so people could run a couple of miles over to tell somewhat what happened, or say “John has money.  Do you want some?”  Or, “Someone said ‘Screw You’ and now they’re coming to hit you with a club!’” Eventually, we evolved to the point where we were able to modulate electrical signals over a wire so that we could transfer money almost instantaneously, kill people from a long distance, look at pictures of cats doing funny things, and videos of naked people having sex in the comfort of our own living room.  And Donald Trump. But it’s all a variation of the ALU from the Von Neuman machine (or an occasional Harvard Architecture design.) I think if our ancestors knew Trump was the end game, they would have just climbed back into the trees, but that’s a discussion on a different thread. ",
            "date": "Answered August 5, 2016",
            "views": "38",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Viki Tom",
                    "user_href": "/profile/Viki-Tom"
                },
                {
                    "user_id": "Catherine Cate",
                    "user_href": "/profile/Catherine-Cate"
                },
                {
                    "user_id": "Caoimhín Waelisc",
                    "user_href": "/profile/Caoimhín-Waelisc"
                },
                {
                    "user_id": "Pedro Alves",
                    "user_href": "/profile/Pedro-Alves-54"
                },
                {
                    "user_id": "Thomas Bill",
                    "user_href": "/profile/Thomas-Bill-2"
                }
            ]
        }
    ]
}