{
    "title": "Is there a cure for all diseases? - Quora",
    "tags": [
        "Medical Conditions and Diseases"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tracy Kolenchuk",
                "href": "/profile/Tracy-Kolenchuk"
            },
            "answer_text": "Of course not. First of all, “disease” is simply not well defined. The World Health Organization’s list of diseases - the ICD10 - lists over 70,000 disease codes, but probably most of them are not diseases, they are billing codes. Next.. CURED is not defined at all for most diseases. If cured is not defined for a disease, the disease cannot be cured and proven to be cured. Cured is currently defined for diseases caused by parasites. That’s it. All other diseases, from arthritis to cancer, depression to diabetes, hypertension to scurvy, cannot be cured because cured is not defined. No medical textbook contains a scientific testable definition of cured for diseases - except those caused by a parasite. It more accurate, perhaps, to say that “every illness can be cured”, and to define illness as “that which can be cured” and all medical conditions that cannot be cured as “not illness”. eg. An incurable illness might be a disability, a handicap, a natural incurable feature - but it’s not a curable illness. Every (curable) illness can be cured. There are three basic types of (curable) illnesses, each with specific types of causes (three ) and three types of cures. Causal illnesses are caused by an active health process. Scurvy is caused by eating a diet deficient in Vitamin C. Infections are caused by bacterial processes. Poisoning is caused by the process of exposure to a poison. A causal illness is cured by addressing the cause. If the cause is encountered again, a new illness occurs. Many causal illnesses, like the common cold, measles, and influenza, are cured by health, by healthy activities of life. Attribute illnesses are caused by unhealthy attributes. Cataracts and hernias are attributes, not processes - as are slivers and cavities. Attribute illnesses are cured by transformation - by transforming the unhealthy attribute to neutral or healthy status. By addressing the cause, the attribute, not the cause of the attribute. A surgeon transforms cataracts, hernias and tooth cavities. A psychologist transform unhealthy relationship attributes - and cures community illnesses. Injury illnesses have a cause in the past. They cannot be cured by addressing the cause and can only be cured by healing. Healing is seldom perfect. Chronic illnesses are illnesses with chronic causes. All three types of illness can be chronic if the cause is repeating or chronic. Chronic illnesses are cured by addressing the chronic nature of the cause. All three types of illness, causal illnesses, attribute illnesses, and injury illnesses can have causes in body, mind, spirit, community, or the environment, and all three can have negative effects on body, mind, spirit, community or the environment. An illness is cured when: the cause has been addressed the signs and symptoms have faded or gone no more medicines are required. ================================== to your health, tracyFounder: Healthicine ",
            "date": "Answered June 13, 2018",
            "views": "16",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Miguel Valdespino",
                    "user_href": "/profile/Miguel-Valdespino"
                }
            ]
        },
        {
            "author_info": {
                "name": "Toni Tandra",
                "href": "/profile/Toni-Tandra"
            },
            "answer_text": "The answer is yes and it would be our own natural immune system. I think we should try to find a way to boost or maximize our own natural Immune system, so we will be naturally cured, without any side effect and Our natural immune system is supposed to be able to handle all kind of diseases, even a few at once without complication. If this could be done, we will only use 1 cure for all diseases, that means diagnose is not that import anymore. Misdiagnose which lead to mistreatment is still a big problem at the moment, it was the third highest cause of death in the US in 2016. Imagine how many lives can be saved by just skipping this step. Another big problem now is many medicine are too expensive for most people can afford. Many new technology invented during the search for medications to fight diseases, but seems like the more advance the medication is, the more complicated the side effect it causes. I think this is because we force chemical to our body trying to replace the job of our natural immune system. Since all medicine has side effect and we have been taking them for so long, it might just be one of the reasons our cell mutate and became cancer., It is not impossible, all we need is to find out how herbal like porcupine dates, agarwood oil, agarwood hydrosol or other herbal does this exactly, boosting our immune system and stamina, it works naturally help with almost all diseases and without side effect, even for toddler. By knowing and understand how the herbal boost our immune system, we might one day be able to replicate/synthesize it could be available for all of us in very cheap price ",
            "date": "Answered March 14, 2018",
            "views": "16",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jef Spalding",
                    "user_href": "/profile/Jef-Spalding"
                },
                {
                    "user_id": "Ranjan",
                    "user_href": "/profile/Ranjan-195"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Lawrence-Viggo"
                },
                {
                    "user_id": "Salahuddin Ayyubi",
                    "user_href": "/profile/Salahuddin-Ayyubi-1"
                },
                {
                    "user_id": "Selime Demir",
                    "user_href": "/profile/Selime-Demir"
                },
                {
                    "user_id": "Bhanu Sharma",
                    "user_href": "/profile/Bhanu-Sharma-185"
                },
                {
                    "user_id": "Monica S",
                    "user_href": "/profile/Monica-S-112"
                },
                {
                    "user_id": "Muhammad Fayyaz",
                    "user_href": "/profile/Muhammad-Fayyaz-30"
                }
            ]
        }
    ]
}