{
    "title": "Is there a planck mass? How is it derived? - Quora",
    "tags": [
        "Planck Units",
        "Quantum Mechanics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dmitry Vakhtin",
                "href": "/profile/Dmitry-Vakhtin"
            },
            "answer_text": "Plank mass is just the simplest possible combination of fundamental constants (speed of light, Newton’s gravitational constant, and Planck constant) that has the dimension of a mass. It is actually an extremely large mass for a world of particle physics: about the mass of a dust mote. According to present understanding, it is the mass of the smallest possible back hole. If there were (point-like) elementary particles heavier that the Planck mass, they would turn into black holes. All the known massive elementary particles have masses VASTLY smaller than the Planck mass. The reason is believed to be that all known particles are naturally massless (mass 0), and some of them obtain mass only through the Higgs phenomenon. It may turn out that the famous Dark matter consists of yet unknown elementary particles that have masses in the ballpark of the Planck mass. But right now it is only a speculation that is not supported by any observations. ",
            "date": "Answered January 17, 2017",
            "views": "513",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Damon Craig",
                    "user_href": "/profile/Damon-Craig-2"
                },
                {
                    "user_id": "Jeff Obunga",
                    "user_href": "/profile/Jeff-Obunga"
                },
                {
                    "user_id": "Erik Anson",
                    "user_href": "/profile/Erik-Anson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Troy Jason",
                "href": "/profile/Troy-Jason-1"
            },
            "answer_text": "Planck mass is derived by using 4 constants - Pi; the Gravitational constant (G); the speed of light (C); and Planck constant (h). It's written mathematically as: Pm = [ h c / (2Pi) x (G)] SQRT. However, nature has its own 'recipe' of different proportions and different substances that it uses to \"bake\" Planck mass as follows: [ (1836.152 to1 - proton mass/electron mass) x ( 137.036 - inverse fine-structure constant) x (2.268 x 10^39 to 1 - electric force / gravitational force) ] SQRT x (9.109 x 10^-31kg - electron mass) = 2.176 x 10^-8kg or Planck mass. ",
            "date": "Answered August 1, 2019",
            "views": "75",
            "upvotes": "0"
        }
    ]
}