{
    "title": "Is the space in between atoms vacuum? - Quora",
    "tags": [
        "Atoms"
    ],
    "response": [
        {
            "author_info": {
                "name": "SHIVAM SAHIL",
                "href": "/profile/SHIVAM-SAHIL-1"
            },
            "answer_text": "Nucleus, protons or electrons can be found in spaces between atoms, depending upon charge, masses and sizes. Whereas if you go for further elementary level for exam two electrons, since no smaller elementary particle has been discovered below that range hence, yes we can say that the space between them is vacuum. But at the same time defining the space between them as complete vacuum won’t also be accurate because although it is an empty space, but is of very very high energy density. This actually differentiates it with actual vacuum, so I would like to conclude that it is not exactly vacuum, theoretically it is but the electrons revolving around would never feel it as vacuum. Thanks! ",
            "date": "Answered November 15, 2017",
            "views": "248",
            "upvotes": " Answer requested by Harry Bhatia",
            "upvoters": [
                {
                    "user_id": "Swaraj Kumar",
                    "user_href": "/profile/Swaraj-Kumar-53"
                },
                {
                    "user_id": "RB",
                    "user_href": "/profile/RB-125"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mithilesh Biradar",
                "href": "/profile/Mithilesh-Biradar"
            },
            "answer_text": "The electrons and the protons/neutrons are constantly interacting, either electromagnetically or through the weak force. In quantum field theory we would say that these particles are constantly exchanging photons (in the case of electromagnetism) or heavy gauge bosons (in the case of the weak force). Thus you might say that the otherwise 'empty' space between the electrons and nucleus is 'filled' with these quanta carrying forces. so according to me there is no vacuum another reason which makes me confident is that if there was vacuum then the atom would have contracted and collapsed so i think its not vacuum its a quanta carrying forces ",
            "date": "Answered February 8, 2018",
            "views": "269",
            "upvotes": " View 2 Upvoters"
        }
    ]
}