{
    "title": "Is the Big Bang cosmology a science or a religion? Which one is it close to? - Quora",
    "tags": [
        "Science and Religion",
        "The Big Bang",
        "Big Bang Cosmology",
        "The Universe",
        "Cosmology",
        "Science of Everyday Life",
        "Astrophysics",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Pollock",
                "href": "/profile/Michael-Pollock-12"
            },
            "answer_text": "It depends on how someone would interperet Edwin Hubbles observations of galaxies expanding from each other. If one assumes just the galaxies are expanding in a static universe, a reason can be given for why the galaxies are expanding. An event could have caused this expansion. A massive collision perhaps. This would be an assumption made of science. If one assumes that the entire universe is expanding, the outcome becomes much more murky. If one rewinds time in the above theory, there is two objects that came together to cause it. If time is rewinded with our current theories, everything becomes nothing. Everything seems to be created just for us. The story is a familiar one. This assumption would be the more religious one of the two. Of course, needless to say, this theory was spearheaded by a priest named Georges Lamaitre. Edwin Hubble, the true pioneer in this situation, disappeared from view. ",
            "date": "Answered October 24, 2020",
            "views": "612",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Theodore Tsistinas",
                "href": "/profile/Theodore-Tsistinas"
            },
            "answer_text": "The big bang has to do with all of creation not just how did all this start. There was a question called ‘The first Cause” that has confounded the science world for hundreds of years. At first they though that it just happened but then certain things just did not add up. So what they now conclude is that Something caused the beginning. Though they would not say what the only thing that is implied is God. Going from there we then have the story of God’s creation told to us in scriptures. in it we find many who have witnesses many things that only God could have had control over. But it seems that is not enough for most scientist. But for men of faith built upon what has been said and witnessed The bible is what is telling us the truth about how all things started. How the scientist say and depict the beginning of life is far fetched and unprovable. Mans existence is proven by us being here just as the scriptures said we will be. The scriptures also tell us why we die and that to is truth since we do die even though that explanation for why confounds even the scientist. ",
            "date": "Answered October 24, 2020",
            "views": "519",
            "upvotes": "0"
        }
    ]
}