{
    "title": "Is there presently a ‘theory of everything’? - Quora",
    "tags": [
        "Theories of Everything (physics)",
        "Theory and Theories"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dilip James",
                "href": "/profile/Dilip-James"
            },
            "answer_text": "The problem with this question is more one of epistemology than of any real science. At present mainstream physics does not have anything that comes even close to being a theory of everything, however, this is not for want of trying. A brief overview of the theories in contention might be a good idea: It is well known that quantum mechanics fails on several fronts to provide a theory of everything but this failure is most apparent in the significant lack of any kind of explanation for gravity. String theory was, for a short time, a strong contender in spite of claiming that it needed up to 26 extra dimensions to explain the Universe, but the biggest blow of all was from Brian Greene's assertion that according to string theory there were [math]10^{500}[/math] Dimensions, or compacted calabi-yu manifolds. The M Theory claims that it needs only 11 dimensions as compared to the 26 needed by string theory to explain the Universe, but like string theory M-Theory also offers a fantastic [math]10^{500}[/math] theories that claim to explain the Universe as well as [math]10^{500}[/math] Universes (multiverses). Both Special relativity and General Relativity are incomplete theories. Look at the absurdity of claiming that the speed of light (electromagnetic radiation) is constant yet offers no explanation as to why this the speed of electromagnetic radiation is constant , and at the same time completely ignores the question of how electromagnetic radiation propagates. Which when seen in context is a significant if not fatal omission to the theory. According to both special and general relativity space and time vary according to the frame of reference of a person viewing an event. Gravity forms the foundation of general relativity, the theory that much of modern physics is built on. It warps space time and allows galaxies, stars, and planets to form. Think about these theories that are at the forefront of science, Look for a long time at the number [math]10^{500} [/math]and spend some time in meditation. Does this number [math]10^{500}[/math] have any meaning for you at all? If this number does have a meaning for you think about what this meaning is. This is such a massive number that it falls out of the realm of the conscious, it would account for every atom in the entire universe and still leave plenty over for atoms in other Universes! It is a totally ridiculous and senseless number that fits neither into philosophy nor into science nor logic. Does it make sense to think in terms of such numbers? Anyone who has been on a plane would have noted the similarity that exists between us and Dr. Seuss's Horton the elephant and the who. It is my contention, as an ordinary sentient being, that the use of such numbers automatically disqualifies these two theories. Special relativity and General Relativity on the other hand are incomplete theories based on dodgy premises, such as time dilation and length contraction. When calculating the trajectory of the asteroid 2012 TC4 that is scheduled to make a close pass to earth, less than one eight the distance of the moon on 23/08/2017, for instance Newtonian mathematics was used. Any artillery manual (or computer) would similarly use Newtonian mechanics. What is agreed however, is that General relativity does increase the accuracy of Newtonian results by merely putting in mathematical iterations that increase the accuracy of what after all is a fairly inexact mathematical formula to begin with. The formula also has an uncanny resemblance to the Lorentz transformation. This improvement on Newton's, in some cases, equations does not automatically mean that the rest of General Relativity is true [math]a = \\frac{GM}{r^2}  [/math] [math]a = \\frac{GM}{r^2}\\frac{1}{\\sqrt{1-\\frac{2GM}{c^2r}}}[/math] [math]\\frac{1}{\\sqrt{1-\\frac{2GM}{c^2r}}}[/math]  The modification is small as far as large distances are concerned i.e. when the distance r is much greater than [math]c^2/2GM[/math]. To gain some idea of scale, at the Earth's distance from the Sun the factor is about 1.00000001 and even at the Sun's surface the factor is still only 1.000002. Tangible effects can only be observed in the vicinity of a Black Hole and at the event horizon it goes to infinity! These corrections to Newton's law may seem insignificant, but they are responsible for phenomena like the correct solution for the precession of Mercury. Although the precession of Mercury is a well known test of GR, people tend to forget just how small it is . In order to rotate Mercury's orbit by the angle subtended (half a degree) by the Moon from Earth would take over 4,000 years for the precession. For those who think I am talking through my hat. I implore you to meditate once more on the number [math]10^{500} [/math]and consider whether this is what you recommend as being the absolute acme of science? Coming now to the Gestalt Aether Theory although not as yet mainstream, if any theory can claim to be a theory of everything surely it is Gestalt Aether Theory. The theory comprehensively explains with great exactitude the manner in which light propagates without recourse to superposition, or entering into a disembodied state and existing as a wave function that has to travel through multiple dimensions in order go from point A to point B, while at the same time scrupulously maintaining all of the properties of the photon as well as explaining how light ( electromagnetic radiation) follows the inverse square law and at the same time maintains the integrity of the identity ( energy) of each individual photon in the wave formation.  Similarly as far as gravity is concerned one of the objections of General Relativity to Newton's theory of Universal Gravitation was that gravity manifested itself instantaneously. (i.e., it does not take time for the force of gravity to be felt. Einstein's somewhat debatable answer to this is that gravity in some mysterious way travels in front of wherever it is going to act, rather like a sonic boom in front of a plane. The GAT explanation for this is much simpler. It states that when electrons are orbiting the nucleus of atoms, they are constantly emitting and absorbing 'virtual photon'. The emission and absorption of these virtual photon' results in the alignment of the 'virtual photons' of the aether ( universal field) for extremely short ([math]10^{-15}[/math]s ) periods of time. This alignment of the aether is obviously almost instantaneous and much faster than the propagation of energy along these aligned lines of 'virtual photons'. This explains not only why gravity is such a weak force but also why it appears to manifest almost instantaneously. More details are available at my book; A Gestalt Aether Theory on the Nature of Light and Related Phenomena.\" It is available at Amazon. ",
            "date": "Answered October 4, 2017",
            "views": "263",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vikram James",
                    "user_href": "/profile/Vikram-James"
                }
            ]
        },
        {
            "author_info": {
                "name": "Keith Bluestone",
                "href": "/profile/Keith-Bluestone"
            },
            "answer_text": "Yes. ",
            "date": "Answered October 3, 2017",
            "views": "18",
            "upvotes": "0"
        }
    ]
}