{
    "title": "Is the moon of the Earth cracking? - Quora",
    "tags": [
        "Moons (astronomy)",
        "Earth-Moon Relationship",
        "Earth Science",
        "The Solar System",
        "The Moon (astronomy)",
        "Earth (planet)",
        "Planetary Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Philip Young",
                "href": "/profile/Philip-Young-13"
            },
            "answer_text": "The Moon does have cracks forming in its surface, but it is not cracking up. The findings were published online March 12 in the Journal of Geophysical Research: Planets. The Moon's Surface Is Totally Cracked Asteroid impacts can cause fissures in the lunar crust down to 20 km. That alone would be important to lunar colonists. There are 981±19 NEO in the 1 km size that could create such impacts and 93% are being tracked. The likelihood of impact is much less than 1 every 10,000 years. Meteoroids around 1 metre are much more likely and enter the Earth’s atmosphere once per year. The Moon is a smaller but more vulnerable target. The Moon is a self rounding object. It “is massive enough to be plastic – for its gravity to maintain it in a hydrostatically equilibrious shape”. That means that when the cracks form, they collapse in on themselves. Ejecta from an asteroid strike lands nearby. If a large asteroid were able to crack all the way through, the Moon would gather itself back together. ",
            "date": "Answered October 3, 2020",
            "views": "19",
            "upvotes": " Answer requested by Prashant Verma",
            "upvoters": [
                {
                    "user_id": "John VanValkenburg",
                    "user_href": "/profile/John-VanValkenburg"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Crowley",
                "href": "/profile/Robert-Crowley-25"
            },
            "answer_text": "That would depend upon scale, I imagine. Certainly, there are cracks and fissures from previous impacts which would be easily present to considerable depth, under the largest craters. But if you are asking whether the body, as a whole, is fracturing into separate pieces, I don't believe we've managed to collect any data that indicates that. We have set up seismological monitoring stations on the surface during the Apollo missions, and from the gathered data, the Moon doesn't appear to be active to any level that would produce such an event. It's essentially a dead world, in that regard. I very large impact event could certainly initiate the fracture and massive upheaval it would cause, but that's something along the lines of colliding with another body somewhat near its own mass. And it would almost certainly be the end of anyone on this planet capable of really caring, were it to occur. ",
            "date": "Answered October 1, 2020",
            "views": "37",
            "upvotes": " View 1 Upvoter"
        }
    ]
}