{
    "title": "Is Trump actually worried about COVID-19? - Quora",
    "tags": [
        "COVID-19 in the USA",
        "COVID-19 (2019-2020)"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Takamiya",
                "href": "/profile/David-Takamiya-2"
            },
            "answer_text": "Does President Donald Trump care about COVID-19? Only as far as how it affects his reelection efforts. A normal president would have acted decisively for the welfare of the people of our country. (Please discount most counter-arguments about Trump quickly shutting down travel from China; loopholes allowed around 47,000 people to still enter the US, coming from China, without being tested or isolated. And, the virus had free entry for three months because travel from Europe to the US was not curtailed during that same time! That’s why New York State became the epicenter of Covid-19 infection for the United States during that initial period.) But, since Donald Trump does not really care about people, per se, he mostly ignored the virus; that is, until it became a bigger problem that he could no longer continue to wish away. Yet, he still downplayed the importance of fighting this virus to his supporters — by not vigorously pushing the wearing of masks, social distancing, washing hands, etc. He’s criticized his top infectious disease experts, to the point where Dr. Anthony Fauci has received death threats and needs bodyguards to protect him from some — shall we say, “overly-enthusiastic” (or, just plain whack-o!) — Trump supporters. Trump supposedly caught the virus, and managed to survive through the combined efforts of the best governmental and private medical institutions in the nation. And some experimental drugs that you could not possibly get right now. So, does President Donald Trump care about COVID-19? No; not really. He’s already got whatever tangible benefits he could out of this crisis he was trying to hide. (Okay — downplay). Unfortunately, those therapeutics that probably saved him are drugs that you — the general public — just can’t get… to save your own life. Trump just needs to keep most of you alive long enough to cast a vote for him in this election. After that, you’re on your own. ",
            "date": "Answered October 23, 2020",
            "views": "48",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steve Allen",
                "href": "/profile/Steve-Allen-309"
            },
            "answer_text": "I think no because he does not understand it and there is no obvious solution and no quick fixes. And he thinks that you make a decision if works fine ,If not forget it and move on and I think all the shut downs and masks etc are not really working in his eyes so he want to move on and people are not letting him. A lot of people think this way. He is the sort of person if something is broke just throw it away and just get a new one. And being mega rich and access to silly credit , he can .So fixing things are not in his mindset ",
            "date": "Answered October 23, 2020",
            "views": "49",
            "upvotes": "0"
        }
    ]
}