{
    "title": "Is the life span of humans decreasing because of increasing technology? - Quora",
    "tags": [
        "Longevity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anurag Mittal",
                "href": "/profile/Anurag-Mittal-17"
            },
            "answer_text": "Yes, our life span is decreasing day by day with this modernization. A few decades back we had many environmental problems. What I mean to say is we had very less medical facilities available for the patient during particular sickness back then. Now a day we have cure for almost all the deceases but we are becoming lazy day by day. Increasing technology no doubt increases our mental fitness to some point, also we are connected to the world through it. But it has very adverse effect on out average life span. According to Wikipedia, the average world age is increased from 31yr to 67.2yr. Now that is something.But let's look at the advancement in technology. We have  all the resources needed nowadays at our fingertips (like cell phone, elevator, motor vehicles and not to forget advance medicines). But is that really increasing our life span? Well NO. If we put effort the way our ancestors used to do, then with the help of this technology, we can still increase our life span.In short, if in older ages, they had this amazing technology + their effort in everyday life than, their average life span would have been greater than ours. ",
            "date": "Answered August 29, 2014",
            "views": "58",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Matthew Koenst",
                    "user_href": "/profile/Matthew-Koenst"
                },
                {
                    "user_id": "Nisarg Mistry",
                    "user_href": "/profile/Nisarg-Mistry"
                }
            ]
        },
        {
            "author_info": {
                "name": "Manav Chaudhary",
                "href": "/profile/Manav-Chaudhary-2"
            },
            "answer_text": "Let's see like this of course lifespan have increased as we have lots of medicines for cure But in pharma language medicines are called drugs that a chemical compound so it can be boon or poison depends on the treatment u get In India their is use irrational use of antibiotics which result in ressistance which is carry forward to generation and this is due to improper course So if u go this way the life span is going to decrease ",
            "date": "Answered May 7, 2018",
            "views": "811",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nisha Rai",
                    "user_href": "/profile/Nisha-Rai-43"
                }
            ]
        }
    ]
}