{
    "title": "Is the wave function a real physical thing? - Quora",
    "tags": [
        "Quantum Mechanics",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Price",
                "href": "/profile/Michael-Price-29"
            },
            "answer_text": "The nature of the wavefunction depends on which interpretation of quantum mechanics you are most comfortable with - or perhaps least uncomfortable with... There are three main contenders, or classes of interpretations of quantum mechanics: Copenhagen, Hidden variables, Many worlds. Each has a different view of the reality of the wavefunction. Copenhagen. This includes a whole spectrum of various ideas, but they all involve some sort of observer-triggered collapse of the wavefunction. The wavefunction itself is not viewed as physically real but merely represents what we can find out about reality; as we gain more knowledge about a system we have to update its wavefunction. The problem - or merit, depending on taste - with this viewpoint is that it suggests observers have a special role to play in the cosmos. So some people love it and others detest it as akin to magic.Hidden Variables AKA Pilot Wave. David Bohm, following a suggestion by Louis de Broglie, showed that you could introduce a quantum potential that exerts a force on classical particles that duplicates the effect of the Schrodinger wave equation. Problems with this revolve around the quantum potential, which is non-relativistic and non-local, and depends on the wavefunctions of all the other particles. Another problem is that the wavefunction doesn't collapse, so you could argue that this is really a many worlds interpretation in disguise.Many Worlds. The wavefunctions are assumed to be physical, objectively existing fields, and each classical possibility therefore exists somewhere within the enormous phase space (called a Hilbert space) that results. Do you feel comfortable with that? Personally I do - but a lot of people don't. There a number of technical objections raised, such as energy conservation, but they are based on misunderstandings. (See the many worlds FAQ http://www.hedweb.com/everett/ ). The real reason people don't like it is simply .... that people don't like it.There are other interpretations, including variants of the above, but I think it is fair to say that they haven't caught on because they are more implausible/whacky than any of the above.. ",
            "date": "Updated February 14, 2020",
            "views": "23",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rishab Pal",
                    "user_href": "/profile/Rishab-Pal-22"
                },
                {
                    "user_id": "James Smith",
                    "user_href": "/profile/James-Smith-3709"
                },
                {
                    "user_id": "Scott Currier",
                    "user_href": "/profile/Scott-Currier"
                },
                {
                    "user_id": "Stephen Stephen",
                    "user_href": "/profile/Stephen-Stephen-120"
                },
                {
                    "user_id": "Luo Peng",
                    "user_href": "/profile/Luo-Peng-2"
                },
                {
                    "user_id": "Boris Krumov",
                    "user_href": "/profile/Boris-Krumov"
                },
                {
                    "user_id": "Mark Garrett",
                    "user_href": "/profile/Mark-Garrett-20"
                },
                {
                    "user_id": "Harjo Winoto",
                    "user_href": "/profile/Harjo-Winoto"
                },
                {
                    "user_id": "Jonathan Mckeown",
                    "user_href": "/profile/Jonathan-Mckeown-1"
                },
                {
                    "user_id": "Junaid Manzoor",
                    "user_href": "/profile/Junaid-Manzoor-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ari Royce",
                "href": "/profile/Ari-Royce-1"
            },
            "answer_text": "Yes, it is. And I would like to tell you why it is. It is a mechanism that explains why the outcome of an experiment is the way it is, and it explains it extremely well. If this mechanism isn't real, it would not explain it extremely well. It would be plain wrong, so it doesn't exist. But it's not, so it's very real. Some would object that it's just a mathematical statement, thus it may not be real. No. Physics doesn't start with a mathematical statement, it starts with... well, physics! Sometime we take a long detour to math, but we would always finally come back to physics, and that is exactly at the place where we left. Only by then when we have understood the physics, we look for a mathematical statement to describe it, and if we don't have one yet, we are going to invent a new mathematical statement for it. This is just when we have a new born baby, then we look for a new name for her. We don't do this in reverse. So, I have made it easy. Is the baby real? Then, is the wave function. Some may still find it fun to play words with it, but they are not physicists. We have passed those philosophical debates way behind a long long time ago. A gentleman ever said this: shut up and calculate! ",
            "date": "Updated January 24, 2016",
            "views": "15",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alexandros Aslanidis",
                    "user_href": "/profile/Alexandros-Aslanidis-2"
                },
                {
                    "user_id": "Alex Romero",
                    "user_href": "/profile/Alex-Romero-46"
                },
                {
                    "user_id": "Heather Jesudowich",
                    "user_href": "/profile/Heather-Jesudowich"
                },
                {
                    "user_id": "Abhishek Pant",
                    "user_href": "/profile/Abhishek-Pant-13"
                }
            ]
        }
    ]
}