{
    "title": "Is there such a thing as perfect DNA? If so what makes it “perfect”. - Quora",
    "tags": [
        "Perfection",
        "DNA",
        "Molecular Biology",
        "Science of Everyday Life",
        "Genetics and Heredity",
        "Human Biology",
        "Biology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rui Silva",
                "href": "/profile/Rui-Silva-85"
            },
            "answer_text": "No. Why? Because perfection doesn't exist. Not as something anyone or anything can achieve. A perfect DNA would need to manifest a perfect lifeform. A perfect lifeform in order to be perfect would need to be all-powerful and all-knowing. Which is something no lifeform can ever be. Perfection as an idea, concept and even as a word is nothing more than an illusion. There is no such thing as perfection. There are limits. The limits you can take something towards. Biology and thus DNA has limits. Limits we haven't even began to scratch, less alone explore. But there will never be a perfect DNA. I wonder where the idea of perfect DNA came from? Maybe people subconsciously picked that up from the movie The 5th Element. Where you hear a “scientist” (if we can even call him that) say Leeloo DNA was “perfect”. ",
            "date": "Answered June 22, 2019",
            "views": "155",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Virat Rathore",
                    "user_href": "/profile/Virat-Rathore-18"
                },
                {
                    "user_id": "Nishen Samuel",
                    "user_href": "/profile/Nishen-Samuel"
                },
                {
                    "user_id": "Shin Akuma",
                    "user_href": "/profile/Shin-Akuma-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lynn Little",
                "href": "/profile/Lynn-Little-29"
            },
            "answer_text": "What would make DNA perfect? DNA contains the genetic code for all the proteins your body makes and uses. And all of life depends on the use of proteins, in biochemical reactions. If you like the body you have, your DNA is perfect for you. But, of course, regardless of the make-up of your DNA, having a healthy body requires good nutrition, staying active, and getting lots of quality sleep. ",
            "date": "Answered June 22, 2019",
            "views": "6",
            "upvotes": " Answer requested by Joshua Roebuck"
        }
    ]
}