{
    "title": "Is there any possibility that ghosts, demons, and angels are made with dark matter? - Quora",
    "tags": [
        "Dark Energy",
        "Demons (malicious preternatural beings)",
        "Dark Matter",
        "Ghosts",
        "The Paranormal",
        "Supernatural Phenomena"
    ],
    "response": [
        {
            "author_info": {
                "name": "Verkisto Swift",
                "href": "/profile/Verkisto-Swift"
            },
            "answer_text": "I’ve met all and as such no I don’t believe so. Ghosts, demons and angels are individual beings, each with their own minds and intelligence. Consider 5% of the universe is seen, 95% is unseen, so we only see very little. So just because there are a (large) number of things that our spectrum of sight etc cannot witness does not mean that it must all be dark matter.. As per the current definition of what black matter is I don’t believe it is possible for each molecule of black matter to be an individual being that can change size, shape, colour and choose to be unseen, and also seen according to it’s will. So in answer to your question “highly unlikely” bordering on the impossible. ",
            "date": "Answered August 30, 2020",
            "views": "40",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paul Hannah",
                "href": "/profile/Paul-Hannah"
            },
            "answer_text": "To use Douglas Adams’ analogy it is quite possible that there is a planet entirely populated with intelligent mattresses. I will leave it to you to calculate the probability of that. Dark Matter isn’t a thing. It is a place marker. We know there seems to be something there and beyond its apparent mass, we know nothing else about it. If and when we do know more about it then some of our questions will be answered. However. It the entire history of science. In every scientific enquiry. EVERY SINGLE QUESTION has been answered with a natural explanation. Not one with supernatural nonsense. ",
            "date": "Answered August 26, 2020",
            "views": "83",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Gander",
                    "user_href": "/profile/James-Gander-4"
                },
                {
                    "user_id": "Michael Goldstein",
                    "user_href": "/profile/Michael-Goldstein-49"
                }
            ]
        }
    ]
}