{
    "title": "Is “Orange Theory” workout system really based on good science? - Quora",
    "tags": [
        "Orange Theory Fitness",
        "Pseudoscience",
        "Strength Training and Weightlifting",
        "Working Out",
        "Exercise",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rayhan Khan",
                "href": "/profile/Rayhan-Khan-2-1"
            },
            "answer_text": "Some of you have likely heard of \"orange theory fitness\" - it's a franchised hour-long class-style gym that has been popping up a bunch over the U.S., and into some other countries. There have been some posts here about how orange theory slams CrossFit in their marketing strategy - typical vague claims to how other fitness programs push people into unsafe movements and orange theory doesn't yada yada typical bs. However, I haven't seen any posts on it that really discuss what it is and how it impacts the fitness industry with respect to CrossFit. I'll attempt to explain a bit about how it works and where it differs from CrossFit here. Regardless of how CrossFit owners feel about this fitness trend, I thought it might be helpful for folks to get a little insight into what this competition looks like. These orange theory gyms are attempting to appeal to a similar client base as CrossFit gyms, so I figured it was worth at least understanding it a bit more. My wife has been taking their classes for a few months now (long story), so I finally took a free class this weekend and here are some takeaways below - warning this is pretty long, skip to part 4 for a summary. ",
            "date": "Answered May 11, 2019",
            "views": "363",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paul Hogarth",
                "href": "/profile/Paul-Hogarth-1"
            },
            "answer_text": "Maybe I can't say for sure as I had never heard of it till just now (I live in the UK) I googled it and its strength training mixed with high intensity interval training, it should be good. Its basically strength training and cardio in one! Its expensive though I never recommend people do these sort of classes or pay for personal trainers, fitness is free and there is free information everywhere! If you have the money and feel you really need help training then go for it! I wish you all the best with your goals! ",
            "date": "Answered May 31, 2019",
            "views": "65",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jay Wright",
                    "user_href": "/profile/Jay-Wright-5"
                }
            ]
        }
    ]
}