{
    "title": "It is possible to hack a satellite? - Quora",
    "tags": [
        "Satellites",
        "Hackers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vivek Tulja",
                "href": "/profile/Vivek-Tulja"
            },
            "answer_text": "Yes, anything can be hacked. However, to hack a satellite you need to know the following: The orbital periods and positions (=ephemeris data) of the satellite. Only geostationary satellites can be communicated with at all times; others must be passing overhead before they can be communicated with.The frequencies that the satellite uses for command and control, both for uplink and downlink. You need hardware that can communicate via those frequencies which sometimes means you need a large antenna that would be hard for a hacker to hide.There are multiple layers of security. First of all, there is always a well-defined command-and-control protocol to communicate with a satellite. Satellites do not respond to garbage commands and will probably raise an alarm if someone is attempting to communicate with it. Secondly, signals are most likely encrypted and hackers need to break the code. Thirdly, there are additional authentication mechanisms to prevent hacking.If someone can get through all this and manage to hack a satellite, it is the surest way of getting oneself a government job. Because that person will be caught, and the government will offer him a deal: Either cooperate with us to hack other countries’ satellites or spend the rest of your life in jail. ",
            "date": "Updated April 27, 2020",
            "views": "72",
            "upvotes": " View 41 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Łukasz Lewandowski",
                    "user_href": "/profile/Łukasz-Lewandowski"
                },
                {
                    "user_id": "Fernando Gutierrez Torres",
                    "user_href": "/profile/Fernando-Gutierrez-Torres"
                },
                {
                    "user_id": "Mike Grogan",
                    "user_href": "/profile/Mike-Grogan-1"
                },
                {
                    "user_id": "Dusty McGarry",
                    "user_href": "/profile/Dusty-McGarry"
                },
                {
                    "user_id": "Varuag Alkuhs",
                    "user_href": "/profile/Varuag-Alkuhs-2"
                },
                {
                    "user_id": "Mansoor Asghar",
                    "user_href": "/profile/Mansoor-Asghar-2"
                },
                {
                    "user_id": "Jitendra",
                    "user_href": "/profile/Jitendra-172"
                },
                {
                    "user_id": "Cassia Holmes",
                    "user_href": "/profile/Cassia-Holmes"
                },
                {
                    "user_id": "Nady Mohamed",
                    "user_href": "/profile/Nady-Mohamed-1"
                },
                {
                    "user_id": "Thabsheer Tkd",
                    "user_href": "/profile/Thabsheer-Tkd"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gautam Kumar",
                "href": "/profile/Gautam-Kumar-291"
            },
            "answer_text": "One might hope that the communications satellites  suspended in orbit above the earth might be one component of the  planet’s technology infrastructure that is safely out of harm’s way.However, at the end of last year, a report from the US-China Economic  and Security Review Commission claimed that hackers, believed to be  operating from China, had managed in 2008 to interfere with two US  government satellites.The hackers took control of the Landsat-7 and Terra AM-1 satellites for a  grand total of 12 minutes and two minutes respectively, the report  claimed.But as satellite communications enthusiast Paul Marsh explained at the  London Security B-Sides event in April, there are reasons to doubt the  reports. He spoke about a similar story, reported in the late 1990s,  about hackers supposedly accessing UK military satellite communications  network SkyNet and ‘nudging’ one satellite out of synch.“First off,” he explained, “jamming a satellite is easy to trace. Every  time a command is sent up to the satellite, it gets counted. If you send  one wrong frame up to then a red light will start flashing at RAF  Oakingham.”Marsh presented some back- of-the-envelope calculations for the power  that would be needed to launch a “brute force” attack on a Skynet  satellite.He used Google Earth to estimate that the dish that controls Skynet  satellites from RAF Oakingham is about seven meters in diameter, meaning  the transmitted power is about five million watts.“That’s a lot,” said Marsh. In fact, it is about as much power as is  produced by a train. A typical wind turbine has an output of just one to  the three million watts.Marsch said he doubted whether hackers would have had the wherewithal to  send tracking and telemetry data up to the Skynet satellite. Whether  Chinese hackers have that capability now is just one more matter of  speculation to add to the opaque field of cyber warfare. 6937 36 0 3googleplus1 ",
            "date": "Answered July 27, 2015",
            "views": "23",
            "upvotes": " Answer requested by Amey Yeole"
        }
    ]
}