{
    "title": "Just how small is an atom? - Quora",
    "tags": [
        "Atoms",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Trevor Cheung",
                "href": "/profile/Trevor-Cheung"
            },
            "answer_text": "An atom is unimaginably small, and that’s why you cannot even imagine it. But I’ll try to let you see how small it is. I don’t want to scare you, so let’s start with the largest atom (in theoretical calculations), which is around 300 pm in radius, which gives us a diameter of 0.6 nm. 0.6 nm is 0.0000000006 m, which is 0.0000006 mm. You can check with a ruler how small is 1 mm, right?  Can you see the markings? Each small marking represents 1 mm, so for a 15 cm ruler like the above, we have 150 mm. But this is immensely huge when compared with atoms. We consider the thickness of paper. 1mm can already contain 20 A4-sized paper stacked on top of each other. Come on, you know how small this is? We usually refer an A4 paper to be 2-dimensional!  But this is unimaginably giant when compared with atoms. We consider the length of a bacterium. An A4 paper can already contain 25 bacteria stacked tip to tail. Come on, you know how small this is? This is already close to the maximum resolution of a light microscope you use in the laboratory, since light microscope is limited to the wavelength of visible light.  But this is very large when compared with atoms. We consider the the width of cell membrane, which is often only a line in the light microscope. We can have 200 cell membranes to get the length of a bacterium.  This is now close when compared with atoms. However, this is more than 10 largest atoms stacked together (without chemical reactions). Not to mention, we are considering the largest atom. If you are considering the atoms like hydrogen, you will have to zoom in 6 times. In fact, if you are an atom, you will view normal people, just like normal people viewing the distance between the moon and the Earth! ",
            "date": "Updated May 30, 2020",
            "views": "1433",
            "upvotes": " View 629 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shawn Hutto",
                    "user_href": "/profile/Shawn-Hutto-1"
                },
                {
                    "user_id": "Ashwat Acharya",
                    "user_href": "/profile/Ashwat-Acharya"
                },
                {
                    "user_id": "Eddie Sikhondze",
                    "user_href": "/profile/Eddie-Sikhondze"
                },
                {
                    "user_id": "Suman Singha",
                    "user_href": "/profile/Suman-Singha-94"
                },
                {
                    "user_id": "Isabella Hernandez",
                    "user_href": "/profile/Isabella-Hernandez-1-1"
                },
                {
                    "user_id": "Rajib Biswas",
                    "user_href": "/profile/Rajib-Biswas-214"
                },
                {
                    "user_id": "Umakanth V S",
                    "user_href": "/profile/Umakanth-V-S"
                },
                {
                    "user_id": "Richie Parrish",
                    "user_href": "/profile/Richie-Parrish-4"
                },
                {
                    "user_id": "Horacio De Dona",
                    "user_href": "/profile/Horacio-De-Dona"
                },
                {
                    "user_id": "Colin de Jager",
                    "user_href": "/profile/Colin-de-Jager"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cynthia Avishegnath",
                "href": "/profile/Cynthia-Avishegnath"
            },
            "answer_text": "First the question could be, how large is an electron, or neutron, or proton. An electron can be incredibly large. It can be the size of the planet we dwell on, or even the size of our solar system. Perhaps, even the size of the universe itself. When someone gives you a hard and fast purported “size” of an atom, that is not actually the size of an atom. That is the range of the accepted threshold field effect of the atom, or electron, or proton, or whatever. That is like the null-hypothesis exercise - prove that Democrats hate Trump, by proving the null-hypothesis of the case where at least 10% (± 1%) of Democrats will vote for Trump. That is, if at least 11% will vote for Trump, than it is definitive according to the proposal that Democrats hate Trump is false. Who willy-nilly defines it is 10%(±1)? Why shouldn’t it be 5%(±2) or 45%(± 7)? Who decides that 99.97% is the bounds of normality? Why is ±3-sigma window considered the accepted effect of normality? Why not 4-sigma? Or 2-sigma? How do you determine the accepted bounds of the electron? How faint must the field effect of an electron be, before we consider the edge of the size of an electron? Let’s say in a vast empty space, and you wish to have an area clear of any contamination of the field effect of a proton. How far must you be from the proton before you can say, you are not affected by the presence of the proton? The molecule, the atom, the electron, they are simply probabilistic distribution of the effects. When we bring them into absolute zero, their boundaries vanish into a pool of continuum. ",
            "date": "Answered November 6, 2016",
            "views": "24",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Buckwell",
                    "user_href": "/profile/John-Buckwell-1"
                },
                {
                    "user_id": "Dale Poteet",
                    "user_href": "/profile/Dale-Poteet"
                },
                {
                    "user_id": "Dadi Jordy",
                    "user_href": "/profile/Dadi-Jordy"
                }
            ]
        }
    ]
}