{
    "title": "My partner likes to be cold at night. I like to be hot. Are there double blankets where half are very warm and half are mild? - Quora",
    "tags": [
        "Wool",
        "Blankets",
        "Sleep Advice",
        "Sleep Habits",
        "Sleep"
    ],
    "response": [
        {
            "author_info": {
                "name": "Janet Thaeler",
                "href": "/profile/Janet-Thaeler"
            },
            "answer_text": "The best solution that I’ve found is the BedJet and their dual sided sheet that you can buy separately. I tested it and it works really well, plus it works fast once you turn it on. The BedJet has a nozzle that’s connected to a fan. You put it between their specially designed sheet and it fills the sheet pockets with cooler or warmed air. It has an app and remote to control the temperature and fan speed. You can have one on your side and turn it on warm while your partner can have a BedJet on their side and have it on cool (or nothing at all - this is only an economical solution if it cuts down on your heating/cooling bill, it’s more for comfort or for people who sweat or have a medical condition). ",
            "date": "Answered October 14, 2017",
            "views": "509",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sarah McClutchy",
                    "user_href": "/profile/Sarah-McClutchy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peri Collins",
                "href": "/profile/Peri-Collins-1"
            },
            "answer_text": "There are dual control electric matress pads that go under the fitted sheet and dual control electric blankets also. I have owned both and prefer the matress pad. If one person likes being cool, they can leave their half of the pad switched off while a blanket would still be covering them even if switched off. Expect More. Pay Less. ",
            "date": "Answered October 28, 2016",
            "views": "645",
            "upvotes": " Not for Reproduction"
        }
    ]
}