{
    "title": "Plutonium, Uranium, and Strontium-90 are isotopes, so what are the other isotopes including Americium-241? - Quora",
    "tags": [
        "Radioactive Isotopes",
        "Plutonium",
        "Isotopes",
        "Uranium",
        "Nuclear Physics",
        "Nuclear Energy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lyle McElhaney",
                "href": "/profile/Lyle-McElhaney"
            },
            "answer_text": "plutonium and uranium, without explicit weights, aren’t isotopes, they’re elements. uranium-235 is an isotope, as is plutonium-238. So here’s the big picture:  All the colored dots (except the purple ones in the “Island of Stability”) are isotopes of an element. Some of the elements are pointed out explicitly. The black dots are stable isotopes, the other colors are unstable (radioactive) isotopes. Uranium-235, for example, is circled in the row marked “uranium”. As you can see, there are unstable isotopes of every element from free neutrons up through element 118, organessen. Americium is three columns to the right of uranium, and -241 is the topmost green dot in that column. Later edit: I need to start a change here. “Isotopes” is not the right word for either the OP nor I to be using in this context. The correct word is “nuclide”, which is the actually “flavors” of proton and neutron combinations. I ran across an article in Wikipedia (Isotope - Wikipedia) that I need to quote from: “A nuclide is a species of an atom with a specific number of protons and neutrons in the nucleus, for example carbon-13 with 6 protons and 7 neutrons. The nuclide concept (referring to individual nuclear species) emphasizes nuclear properties over chemical properties, whereas the isotope concept (grouping all atoms of each element) emphasizes chemical over nuclear. The neutron number has large effects on nuclear properties, but its effect on chemical properties is negligible for most elements. Even in the case of the lightest elements where the ratio of neutron number to atomic number varies the most between isotopes it usually has only a small effect, although it does matter in some circumstances (for hydrogen, the lightest element, the isotope effect is large enough to strongly affect biology). However, because isotope is the older term, it is better known than nuclide, and is still sometimes used in contexts where nuclide might be more appropriate, such as nuclear technology and nuclear medicine.” ",
            "date": "Updated February 7, 2020",
            "views": "42",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David A. Smith",
                    "user_href": "/profile/David-A-Smith-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Avun Jahei",
                "href": "/profile/Avun-Jahei"
            },
            "answer_text": "The question as asked makes little sense. Every nuclid has a certain number of protons and a certain number of neutrons. When two nuclides have the same number of protons, but different numbers of neutrons, they are called isotopes of the same element. For example, strontium-88 and strontium-90 have both 38 protons, but strontoim-88 has 50 neutrons, while strontium-90 has 52 neutrons. So they are different isotopes of strontium. So plutonium is not an isotope. It is an element, consisting of different isotopes like plutonium-239 and plutonium-244. And americium-241 is obviously an isotope of the element americium. ",
            "date": "Answered February 2, 2020",
            "views": "30",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Edward Melaika",
                    "user_href": "/profile/Edward-Melaika-1"
                }
            ]
        }
    ]
}