{
    "title": "Science reports 'wearing masks could save more than 100000 US lives through Feb'. Why does Trump refuse to set an example for the whole country, instead of just his supporters? - Quora",
    "tags": [
        "Masks",
        "Science",
        "Donald Trump (politician, business person)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thomas Edward Friedrich",
                "href": "/profile/Thomas-Edward-Friedrich"
            },
            "answer_text": "I was a former Obama supporter, now Trump supporter, and spent 20 years living in Canada (and other countries before that), just to put this answer into perspective. First of all, President Trump has never said not to wear masks. At first he followed Dr Fouci's ‘science' that masks weren't important. Some will argue Fouci said this because we didn't have enough masks, yet later he reversed his stance, and was recommending ‘face coverings' of whatever type you could come up with, for example bandanas. So… there was Dr Fouci. However I think the main reason Trump doesn't wear a mask unless it is absolutely necessary is that the world expects the USA to lead the way in the global economy, and China is busy capitalizing on this pandemic to gain economic influence. As Trump has said repeatedly, you can't just shut down the greatest economy in the world. The ramifications would far exceed the danger from the virus. For one thing, Medicare and Medicaid rely on tax revenue, and an economic depression isn't healthy under any circumstances. These are some of the reasons Trump has stated, “the cure can't be worse than the disease.” Trump is in a no-win situation with this virus. If he locks down, he faces a backlash because of an economic depression. If he pushes too far forward to reopening the economy, he faces a backlash on being responsible for covid deaths. No president is going to win in this shituation (misspell intended). So, being a businessman Trump chose to lean forward, to put on a brave face, (without a mask on it), and, in his words, not to let the virus dominate. However I don't take his not wearing a mask during press conferences and rallies as anything other that setting an example for how a president to show bravery instead of covering up in fear. This brings me to the real statistics on the virus, which I encourage you to look at on the CDC site, or more accessible the CEBM site (Centre for Evidence Based Medicine - Oxford University). Make an assessment of where you stand with regard to your risk from the virus. I did that early on, and continue, and my risk is minimal, almost negligible, even as a male in my mid-fifties. (I'm pretty sure I had it early in the pandemic here in NYC, and in my case it was slightly different than the flu). The real positive here is the advance with therapeutics, which have lowered the mortality rate by about 80%. I think Trump deserves credit first by shutting down travel early on, with widespread criticism, and then with Operation Warp Speed, which has unravelled bureaucracy and sped up the processes for the development of therapies and of course vaccines. (Though it's looking like the therapeutics are where the best news is, as Trump proved by his rapid recovery). I have always hated “the blame game,” and with this election, that's what is going on with our Democrats. “The virus is a gift to the Left,” as Jane Fonda so accurately stated of behalf of the Democrats. To me this is the sickest part of this virus - that people would use it for political gain. Back when G.W. Bush won his second term, there was the “Fahrenheit 911” factor that Michael Moore made a film about - using the fear over terrorism to appeal to voters. Well, I would call this election the “Fahrenheit Covid-19” election for the Democrats. They're blowing this thing up, and playing the blame game to seize power. I'm not buying it. I think President Trump could have done more to encourage mask wearing (though you can read right on the CDC site that 85% of people who get covid are mask wearers - but good points are made for wearing them anyway). But if you want to blame our countries poor record with the virus, I think you need to just blame our country for what it is - the most vibrant country in the world, the country people most travel to, from around the world, and the country where air travel is most prevalent (see link at the bottom), which has enabled this highly contagious virus to ‘get around' so well, enjoying it's free ride through the friendly skies of our airspace. This is how NYC, a city of the world, became the epicenter, and it's why now that we're moving around again, the virus is spreading to the areas that weren't badly affected before. And it's the reason President Trump was so wise to shut down travel early on, when so many voices opposed it (including Nancy Pelosi and Joe Biden). (See the link at the bottom. NYC second only to London for volume of international air travel, and the UK has worse statistics with the virus than the US. And note how many of the most internationally travelled-to cities are in the USA. We are by far the most internation nation). If you want to argue for lock-downs, then get ready to argue for an economic depression, with all that that entails, starvation, loss of healthcare, suicide, death in general, and in the big picture loss of our economic dominance and leadership in the world as the champion of freedom. Trump chose to lean forward, and he may have leaned too far forward, but at the same time we all are responsible for assessing our level of risk and acting accordingly. I'm for wearing masks, as Trump is. But shutting down the country to protect the few is not protecting the few, it's placing them at greater risk in terms of the effects of an economic catastrophe. No president was going to get the balance right for everybody. Trump has for me, as I haven't lost my job in aviation, and I'm grateful for that. Passenger Traffic by Air List of busiest city airport systems by passenger traffic - Wikipedia ",
            "date": "Answered October 23, 2020",
            "views": "103",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Roger DiPaolo",
                    "user_href": "/profile/Roger-DiPaolo"
                },
                {
                    "user_id": "Dale Brooks",
                    "user_href": "/profile/Dale-Brooks-40"
                },
                {
                    "user_id": "Patricia Wirry",
                    "user_href": "/profile/Patricia-Wirry"
                }
            ]
        },
        {
            "author_info": {
                "name": "Keith Stepp",
                "href": "/profile/Keith-Stepp-3"
            },
            "answer_text": "Well, now, he doesn’t need to set the example. He’s had the virus and, I assume, he can’t get it again. As to before, I just think he did not think wearing a mask portrayed the right image. I would have preferred a different example, but I understand his decision. Also, we have gone back and forth amongst scientists, so which time were they right and which time were they wrong? Two weeks ago there was an article saying COVID had mutated to something that could bypass a mask. I don’t believe it, but the article was there. Now, you are saying that not wearing a mask is only an example to his supporters? So, only Trump supporters don’t wear masks? So, I guess Pelosi not wearing a mask when getting her hair done makes her a Trump supporter? Also, Feinstein didn’t wear a mask at the airport. Today, Chris Cuomo didn’t wear a mask. So, they are all Trump supporters? Next fallacy - If it is only Trump supporters that don’t wear masks, then you, being a democrat, has nothing to worry about because you are wearing a mask, right? And, as it is only Trump supporters who are not wearing masks, all future deaths will be Republicans, Right? Final point - Are you an adult? Why do you need someone to give you an example to make you do something? As an adult, you should be making adult decisions, no matter what anyone else is doing, Right? So, Trump’s example should not influence your decision. Everyone is responsible for their own actions. ",
            "date": "Answered October 23, 2020",
            "views": "36",
            "upvotes": "0"
        }
    ]
}