{
    "title": "Scientists: What makes a great scientific talk? - Quora",
    "tags": [
        "Lecture Etiquette",
        "Lecture Recommendations",
        "Science Education",
        "Lecturers",
        "Philosophy of Science",
        "Public Speaking",
        "Academia",
        "Scientists",
        "Graduate School Education",
        "Science of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Philip Howie",
                "href": "/profile/Philip-Howie"
            },
            "answer_text": "Tell a story.  Too many talks at scientific conferences are given by people who have devoted years of their lives studying some minute research field, and then assume that a) their audience is familiar with previous developments in the field and b) their audience cares as much as they do. Give an introduction that clearly sets out the problem you're trying to solve.  That's what scientific research is - the solution to problems.  Lay out the current state of knowledge (briefly!) and explain why there is a problem - a new observation that doesn't fit with the accepted model, a limitation in the currently used apparatus, a desire to extend the model for a particular application, or whatever it is.  Knowing your audience is important, but it is very rare for this sort of introduction to be 'too simple'.  At the very least, make it broad enough that the person who came along to hear one talk in a completely different conference session and is in your talk because she has nothing better to do can understand why you're working on this. If you can do that, your audience is now invested in your talk.  They've seen that there's a problem in the current understanding - surely someone should do something about it!  Well, as it happens, you have... and now's the time to explain what you've done.  Keep your problem in mind and resist the temptation to throw in extra work just to pad out the talk; you want to keep them with you and keep them paying attention. Deliver some results and explain your analysis or any new model.  Make sure you explain why your work solves the problem you outlined earlier.  Even if their eyes glazed over a bit when you got into the technical details, if you can convince them that you've filled a hole and solved a problem, you can still salvage this! Give them a conclusion they can jot down in one or two sentences.  Sure, it's tempting to stick up a slide with fifteen bullet points, but one single conclusion - that your work solves the problem because x - that they remember will make your talk stand out above just about anything else they sat through today. Finish a couple of minutes early.  The session chair and your audience alike will love you for it. ",
            "date": "Answered September 17, 2015",
            "views": "489",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Felix Lu",
                    "user_href": "/profile/Felix-Lu-9"
                },
                {
                    "user_id": "Christopher VanLang",
                    "user_href": "/profile/Christopher-VanLang"
                },
                {
                    "user_id": "Anirban Ray",
                    "user_href": "/profile/Anirban-Ray-6"
                },
                {
                    "user_id": "Aleksandr Blekh",
                    "user_href": "/profile/Aleksandr-Blekh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Turan Birol",
                "href": "/profile/Turan-Birol"
            },
            "answer_text": "There is no short but complete answer to this question. Below is only a part of what you should and should not do, in no particular order of importance:  Never say or act like something is trivial. After doing your PhD on a topic, various things can feel trivial for you, but they probably are not. Have a complete story. Yes, we all want to impress everyone with our long and heroic efforts to solve a particular equation, but what is important is not the details of how you do something. What is important is what you do, and why you do it. Make these clear, and only then explain how you did what you did, but the details of this are not important for the audience. (The ones who actually care about those can read your actual papers on their own.) Figures, figures, figures. A figure is much better to show a distribution than a table full of numbers, or to display a trend than a differential equation. I am not saying that you should not have tables or equations, but show what you can on a figure to make it clear, and then have those on the side. Figures, figures, figures. But only meaningful figures. Being clear and impressive is good, but you are not a businessman trying to sell a stupid product to some idiots. So, don't have unnecessarily shiny, animated, fancy figures. Keep it simple. Know your audience, know yourself, and know why you are there. A conference talk is very different from a job talk, which is very different from a department colloquium. Know who is in your audience, and what they want to learn from you. Know why you are where you are, and what you can give the audience. Cite people, cite yourself. It is proper scientific practice to cite people whose data/ideas you use. This also helps people in the audience to dig deeper on what you mention. But also cite yourself, have the references to your paper. Do this on every slide that you can, someone can just have a desire to look up what you have done in detail in the middle of the talk. Have a summary slide. If you have time, go over a very brief version of your story showing this slide in the end. Why you did what you did, what your most important result is, etc. Do not finish with a thank you slide. Yes, it is nice to thank the audience for suffering your boring results and terrible speech for an hour, but you really don't need to have a slide that says nothing but thank you. This is a huge waste - that slide will possibly stay there for few minutes while you answer questions. Instead, leave your summary slide up there during the question period.Bonus: Don't make jokes. No one laughs at your jokes in scientific talks. Or, at least, no one laughs at mine, which might be because I am lame, in which case, feel free to make some jokes. They don't necessarily make a talk more interesting, but people will have a greater tendency to not fall asleep if you make them laugh every once in a while.",
            "date": "Answered April 20, 2015",
            "views": "937",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thara Merrygold",
                    "user_href": "/profile/Thara-Merrygold"
                },
                {
                    "user_id": "Felix Lu",
                    "user_href": "/profile/Felix-Lu-9"
                },
                {
                    "user_id": "Iván Novák",
                    "user_href": "/profile/Iván-Novák"
                },
                {
                    "user_id": "Doga Murat Kurkcuoglu",
                    "user_href": "/profile/Doga-Murat-Kurkcuoglu"
                },
                {
                    "user_id": "Onur Erten",
                    "user_href": "/profile/Onur-Erten"
                },
                {
                    "user_id": "Arthur Vyver",
                    "user_href": "/profile/Arthur-Vyver"
                }
            ]
        }
    ]
}