{
    "title": "Should I stop giving money to an alcoholic father who is not willing to work? He's just 50 years old and I have to pay a lot of debt for him before. - Quora",
    "tags": [
        "Alcoholism",
        "Debt",
        "Fathers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Barbara Hill",
                "href": "/profile/Barbara-Hill-72"
            },
            "answer_text": "Yes. There is Medicaid, foodstamps etc that your Dad probably quality’s for. When you stop working it’s only logical that you run out of money etc. your job (at his age of 50) is to learn to be an adult and provide for yourself. If he was 80 and needed help after a long work life, that’s a different story. I think it’s hard to cut off those you love. I suggest you go to Alanon meetings (I probably misspelled it!). They support you as a child ,spouse, or adult who loves an alcoholic. As people who are also experiencing the same or similar problems they can give you some insight. I would suggest you try different groups. The dynamic of each Alanon is different. ",
            "date": "Answered October 22, 2020",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kim Fredrick",
                "href": "/profile/Kim-Fredrick-7"
            },
            "answer_text": "Absolutely. Dont pay his debts or buy his booze. If you want to be nice about it, let him know you came to the realization that this isnt helping him and you are no longer going to enable him to continue this path as he is not only hurting himself but the whole family. I would say that its not negotiable and end the conversation with the fact he will be responsible from this point on in what he decides to do ",
            "date": "Answered October 19, 2020",
            "views": "25",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vicki Webster",
                    "user_href": "/profile/Vicki-Webster-18"
                },
                {
                    "user_id": "Pete Smoot",
                    "user_href": "/profile/Pete-Smoot"
                }
            ]
        }
    ]
}