{
    "title": "Should I pursue learning math for real at 35? - Quora",
    "tags": [
        "Mathematics Education",
        "Learning New Things",
        "Learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Auk Tanmay",
                "href": "/profile/Auk-Tanmay"
            },
            "answer_text": "Age is just a number. Not really, it is a word. But you get it. Do it. Follow your dreams, learn mathematics. What do you have to lose, I mean you are 35, it’s not like the teacher is going to scold you or your parents would do anything. You will learn something new, even if you fail. Then try again or maybe not, but at keast give it a try. Mathematics is like the 3 best subject after Physics and Sex ed(the practical one). It may help you someday, you never know. My father’s friend learned flying an airplane at 58 or 59. My friend studied and understood and learned half the calculus textbook 3 nights before our high school exam. He failed and today is his exam again. He prepared wll this time and he will surely do good ",
            "date": "Answered July 17, 2017",
            "views": "155",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Wajeeh Ur Rehman",
                "href": "/profile/Wajeeh-Ur-Rehman"
            },
            "answer_text": "I am not sure if you are aware of www.khanacademy.org Khan Academy offers practice exercises, instructional videos, and a personalized learning dashboard that empower learners to study at their own pace in and outside of the classroom. They tackle math, science, computer programming, history, art history, economics, and more. Their math missions guide learners from kindergarten to calculus using state-of-the-art, adaptive technology that identifies strengths and learning gaps. They have also partnered with institutions like NASA, The Museum of Modern Art, The California Academy of Sciences, and MIT to offer specialized content. If you look at Steve Jobs he also attended lectures at University that he was not signed up for to learn knowledge he was interested in. Fear of failure is an interesting fear, if you were my client, I would ask you how do you know you have this fear of failure, as we are born with only 2 Fears according to Dr Bandler, one the fear of falling and the other the fear of loud noises, the rest we teach ourselves. If I say to you there is a part in your brain called the RAS which is the gateway between your unconscious and conscious mind. Have you noticed that when you buy a new item or you desire a new item you suddenly become aware of that item in your world. So that which you focus on is highlighted in your brain and consciousness. If you interested in more tips and ideas, take a look at exploreyourself andsuccessfacilitator Ps remember Einstein taught himself Geometry and calculus, he would be for me be a great role model of someone who was passionate about his subject and this love kept him focused on his curiosity. ",
            "date": "Answered July 28, 2017",
            "views": "87",
            "upvotes": "0"
        }
    ]
}