{
    "title": "Should we focus on being positive or just having a lack of negativity? - Quora",
    "tags": [
        "Positive Psychology",
        "Negativity (personality trait)",
        "Success",
        "Optimism",
        "Self-Confidence",
        "Self-Improvement"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jill Bamford",
                "href": "/profile/Jill-Bamford"
            },
            "answer_text": "It's not really about being positive or negative. It's about what you are thinking in relation to what you are experiencing and what you want to experience. When you say negative things about yourself others or situations your energy reflects those negative things. But the negative comments and thoughts that preceded them reflect your deeper seated beliefs about yourself, others and your life. Thinking and verbalising negative thoughts compounds the negative impact. You can't\"t say you don't like something or someone and it not impact you. You get what you focus on and so saying no to things, people or situations by being negative about them doesn't give you the opposite of what you're saying no to. You will still attract these things whether you focus on them negatively or positively. Also one thing it's easy to get wrong is thinking that if you are always positive even about bad things and pretend that things are OK and put a positive front on this will be helpful. If you feel bad about something listen to that feeling and start to think things that make you feel better. It isn't about always being completely upbeat and joyful all the time. It's about understanding what impact what you're thinking is having by the way it makes you feel and then moving towards more positive feelings. So if you're having a bad experience it's not helpful to pretend it's ok. But what you can do is think about something completely different like how much you love an important person in your life or your cat, anything to shift your focus off the negative. This will have a more positive impact than trying to pretend the experience is fine when you know it isn't. However, once the experience is over don't dwell on it, don't talk about it. The stories we tell ourselves and others about our past present and future are powerful. So we need to choose good stories that support what we want rather than thinking we'll it happened so I should talk about it. Talk about it if you want more of it. ",
            "date": "Answered September 4, 2018",
            "views": "52",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gayle Maree",
                "href": "/profile/Gayle-Maree"
            },
            "answer_text": " You should always focus on what you want rather than what you don’t want. Your focus determines your mood and your dominant mood creates your future reality. So if you are focusing on something you don’t want, whether its real or imagined, you get more of it. It’s like giving that subject an invitation to your exclusive dinner party, even though you don’t like it. There will always be an array of things to focus on. What you need to decide is what of those things you want more of. If you want more money, then focus on abundance instead of the lack.If you want good health then focus on being healthy instead of that pain.If you want a great relationship then focus on what that relationship will feel like, not what not having one feels like.People get very confused with manifestation because they think that when they talk about money they are focused on it in a positive way. But a subject is like a sword. It has two ends. That which will empower you and that which will cut you. So when you talk about not having enough money and desperately wanting more, you are focused on the end that will cut you. This is focusing on the lack of money and it will stay away from you. When you are focused on the abundance, imagining yourself as wealthy and happy, then you are asking for what you want. You don’t ask with your words, you ask with your vibration (but that’s another subject). No matter what you ask for, you will eventually receive it in manifestation form, so just be aware that what you are asking for is what you want. ",
            "date": "Answered September 3, 2018",
            "views": "69",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jill Bamford",
                    "user_href": "/profile/Jill-Bamford"
                }
            ]
        }
    ]
}