{
    "title": "There is a source of light emitting spectrum which lies in the wavelength range from 0.3 μm to 0.4 μm. What metal can a cathode of a photocell be made to create the photoelectric effect? - Quora",
    "tags": [
        "Photoelectric Effect",
        "Electromagnetic Spectrum",
        "Waves (physics)",
        "Visible Light",
        "Metals"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Upton",
                "href": "/profile/Peter-Upton-2"
            },
            "answer_text": "At a guess - I imagine none! Here is a method. Use v= freq x wavelength to find the frequency of 0.3 and 0.4 μm light.Use E= hf (h is planck’s constant) to find the energy in joules.Now search for a metal with an ionisation energy equal to or less than your answers to 2.If I had to guess- I would go for a reactive alkali metal like caesium. It is also possible that a very large atom like say uranium may have a low ionisation energy. The outer electrons are along way from the nucleus and there are a lot of electrons between the outer electrons and the nucleus (shielding). This might make the ionisation energies low. After thought- your energy resulting in 2 will be in joules. Use the google converter to turn joules into eV if your sources of ionisation energies are in eV. ( all this does is multiply by 1.6 x 10 ^-19) ",
            "date": "Answered April 13, 2019",
            "views": "20",
            "upvotes": " Answer requested by Christian Ayerh",
            "upvoters": [
                {
                    "user_id": "Marko Sokolich",
                    "user_href": "/profile/Marko-Sokolich"
                },
                {
                    "user_id": "Robert Harvey",
                    "user_href": "/profile/Robert-Harvey-41"
                },
                {
                    "user_id": "David Wilmshurst",
                    "user_href": "/profile/David-Wilmshurst"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alan Robinson",
                "href": "/profile/Alan-Robinson-47"
            },
            "answer_text": "Caesium-activated antimony is commonly used as a photocathode in photomultiplier tubes, but other compositions are suitable. Photomultiplier tube - Wikipedia Sb-Cs photocathodes are sensitive to UV and visible wavelengths in the 185 nm to 650 nm range. Check out figure 4–2a (below) of https://www.hamamatsu.com/resources/pdf/etd/PMT_handbook_v3aE-Chapter4.pdf for the spectral response of this and other photocathode materials. Curve 350U is Sb-Cs with a UV-transparent glass window. 350K is Sb-Cs with a borosilicate glass window. Co-doping with rubidium or potassium can give lower dark current and higher sensitivity, as shown in curves 452U and 456U.  The Hamamatsu handbook includes data on the quantum efficiency, response time and linearity of photomultiplier tubes, amongst other information. ",
            "date": "Answered April 13, 2019",
            "views": "63",
            "upvotes": " View 3 Upvoters"
        }
    ]
}