{
    "title": "To what extent do top physicists believe that string theory is true? - Quora",
    "tags": [
        "String Theorists",
        "String Theory",
        "Physicists",
        "Theoretical Physics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Kesselman",
                "href": "/profile/Jeff-Kesselman"
            },
            "answer_text": "There is a fundamental problem with this question, and this is the word \"true.\" Science never claims to ascertain truth.  In fact, the scientific method is very explicit in stating that a theory can never be proven true in any absolute sense.  Regardless of how well it performs in experiments or how often, there is always the possability that the next experiment will prove it false.  In fact, that has happened many times already with some of the most basic and intuitively \"obvious\" theories such as Newtonian physics and the conservation of mass and energy. Quantum mechanics in particular is not about \"what is\" on a sub-atomic level.  We have no way to gauge or access that.  Rather it is about coming up with mathematical models that correctly describe and predict the *behavior* of whatever is down there. String theory is an interesting mathematical model that elegantly solves some problems of past models however it also creates new questions and issues.  Some physicists believe these can be worked out, others feel they are fatal flaws that point to a model ultimately to be abandoned. Only time will tell who is right. ",
            "date": "Answered June 2, 2013",
            "views": "112",
            "upvotes": " View 63 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ashraful Kader Mahin",
                    "user_href": "/profile/Ashraful-Kader-Mahin"
                },
                {
                    "user_id": "Ryan Clark",
                    "user_href": "/profile/Ryan-Clark-64"
                },
                {
                    "user_id": "Francisco Manuel Bernal",
                    "user_href": "/profile/Francisco-Manuel-Bernal"
                },
                {
                    "user_id": "Fabien Paillusson",
                    "user_href": "/profile/Fabien-Paillusson"
                },
                {
                    "user_id": "Quinn Olynyk",
                    "user_href": "/profile/Quinn-Olynyk"
                },
                {
                    "user_id": "Aryaan Singh",
                    "user_href": "/profile/Aryaan-Singh"
                },
                {
                    "user_id": "Yogita Taluja",
                    "user_href": "/profile/Yogita-Taluja"
                },
                {
                    "user_id": "Anand Bhattacharya",
                    "user_href": "/profile/Anand-Bhattacharya"
                },
                {
                    "user_id": "Valentin Ghincolov",
                    "user_href": "/profile/Valentin-Ghincolov"
                },
                {
                    "user_id": "Gary Teichrow",
                    "user_href": "/profile/Gary-Teichrow"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Tabassi",
                "href": "/profile/Richard-Tabassi"
            },
            "answer_text": "Define \"top physicists\".  If you do sufficient reading on most of the new detector arrays looking for dark matter/energy and exotic interactions with baryonic matter, you can see how much string theory has permeated physics due to the funding provided to look for these interactions. http://en.wikipedia.org/wiki/IceCube_Neutrino_Observatory The vast majority of physicists do not like the probability driven aspects of Quantum.  Einstein was never particularly happy with the consequences and believed there was something more fundamental that would allow us to have absolute quantitative ability, about all aspects, of a particle, i.e. momentum, position, spin, etc. There are many different theories, String Theory just seemed to \"answer\" a number of issues, while opening a whole number of other doors.  I believe as more of the advanced detectors and CERN fail to confirm aspects of string theory we can test, it will fall from favor. ",
            "date": "Answered January 6, 2011",
            "views": "18",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kyle Shimek",
                    "user_href": "/profile/Kyle-Shimek"
                }
            ]
        }
    ]
}