{
    "title": "What if all the ice caps melted? - Quora",
    "tags": [
        "Polar Ice Caps",
        "Melting",
        "Ice",
        "Climate Change",
        "Science of Everyday Life",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alicen Lyne",
                "href": "/profile/Alicen-Lyne"
            },
            "answer_text": "The planet would changed drastically.  Here is the USA. As you can see, Florida is completely underwater, while most of Mississippi, Alabama, and Louisiana are missing. Half of Texas is gone as well. On the east coast, Long Island is submerged, as is Charleston, SC and DC.  Europe. Italy is now a sliver of what it once was, and Barcelona, Spain is now a coastal town. Lisbon is as well. A lot of France has disappeared, and London is half underwater as well. The Netherlands, like Florida is completely gone.  On the left of another picture of the east coast of USA and Cuba. On the right side is South America. There is now a large passage of water in Brazil. Buenos Aires is gone.  Australia now has a large lake.  This is Antarctica.  Asia. A lot of China and India are missing.  Africa. Not that much has changed here. Here is a more drastic picture:  Scary, right? ",
            "date": "Answered August 9, 2019",
            "views": "126",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Jr Kitchings",
                    "user_href": "/profile/John-Jr-Kitchings"
                },
                {
                    "user_id": "Abdul Jabbar Khan",
                    "user_href": "/profile/Abdul-Jabbar-Khan-35"
                }
            ]
        },
        {
            "author_info": {
                "name": "Loren Javernick",
                "href": "/profile/Loren-Javernick"
            },
            "answer_text": "Well, they have melted more than once in the past. In fact, some scientists consider an ice age to be a period where the earth has ice caps. So technically we're on the tail end of an ice age now. So they WILL melt, and when they do, the sea levels around the world will go up by 3 or 4 inches. It might not seem like much but the coastal cities will be flooded permanently when it happens. Most of Florida will be under water. New York, New Orleans, etc will have to figure something out. This is going to be a major problem for the generations ahead of us. I don't know what they'll do but if anything will challenge human intellect, it's going to be the melting of the ice caps :) ",
            "date": "Answered August 9, 2019",
            "views": "48",
            "upvotes": "0"
        }
    ]
}