{
    "title": "What is the charge on an electron? - Quora",
    "tags": [
        "Electrons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Keeler",
                "href": "/profile/Andrew-Keeler-9"
            },
            "answer_text": "This is a surprisingly difficult question to answer, because when you get right down to it, it’s like asking “In simple terms, how fast does a train go?” Electrical charge is a fundamental aspect of matter. It has two different types called positive and negative (these are just conventional names, there’s nothing special about being positively charged vs. negatively charged). It has the peculiar property where like charges (two positive or two negative) will repel each other while two opposed charges (one each of positive and negative) will attract each other. Electric charge is conventionally measured in units called Coulombs, just like speed is conventionally measured in (for example) miles per hour. A coulomb happens to be a very large amount of electrical charge. Electrons are negatively charged, and have an individual charge of -1.6 * 10^-19 Coulombs. This is something that can be (and has been) measured directly. This number isn’t particularly significant, though. There’s nothing preventing us from deciding that an electron’s charge be assigned the label “positive” instead of negative. There’s nothing stopping us from changing the units we use to measure the “amount” of charge such that an electron’s charge becomes 1. Physicists do this all the time, choosing units of measure or sign (+/-) conventions that make things more convenient for themselves. So ultimately, the electron’s charge is just a number that helps describe how the electron behaves around other charged particles. ",
            "date": "Answered January 21, 2018",
            "views": "9",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Somya Mishra",
                    "user_href": "/profile/Somya-Mishra-110"
                },
                {
                    "user_id": "Dineshkumar Varadharajulu",
                    "user_href": "/profile/Dineshkumar-Varadharajulu-1"
                },
                {
                    "user_id": "Joshua James Hillerup",
                    "user_href": "/profile/Joshua-James-Hillerup"
                },
                {
                    "user_id": "Adam Powell",
                    "user_href": "/profile/Adam-Powell-78"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cheran Ilango",
                "href": "/profile/Cheran-Ilango-1"
            },
            "answer_text": "An electron is a fundamental particle, unlike protons and neutrons which are made up of partial charges known as quarks. Protons, neutrons and electrons are called the sub-atomic particles which make up an atom. Protons are positively charged and electrons are negatively charged while neutrons have zero charge. Electrons are found in the orbitals, outside the nucleus of an atom which contains the protons and neutrons which are collectively called the neucleons. It was J.J.Thompson from Cambridge University who discovered the electron in the latter half of the 1800’s. When compared to protons and neutrons, an electron has an extremely small mass. However, both the electron and proton have the same magnitude of charge. Charges are measured in units called coulombs(C). The charge on one electron is –1.6 x 10–19 coulomb. During nuclear reactions or radioactive decay, a positively charged electron known as positron is released from the nuclei of certain atoms. Although positively charged, a positron has an extremely small mass like an electron. ",
            "date": "Answered March 20, 2018",
            "views": "72",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ben",
                    "user_href": "/profile/Ben-2296"
                }
            ]
        }
    ]
}