{
    "title": "What are the relationship between sociology and other social science? - Quora",
    "tags": [
        "Learning About Sociology",
        "Social Sciences"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dorothy M Neddermeyer",
                "href": "/profile/Dorothy-M-Neddermeyer"
            },
            "answer_text": "Your question reminds me of the essay answers I wrote for many undergrad, grad, and doctorate papers. I am excited to challenge myself to write a scholarly answer. Social Sciences: Anthropology—archaeology. cultural. linguistics.Economics—microeconomics, macroeconomics.Geography—human. integrative.History—cultural. economic. military.Law.—jurisprudence. legal history. legal systems.Political science—international relations. psephology.Sociology—criminology. demography. economic. environmental. institutionsSpirituality—biological. dysfunctional. physiological. psychologicalThe concise definition of Sociology includes the science of society, social institutions, and social relationships; specifically; the systematic study of the development, structure, interaction, and collective behavior of organized groups of human beings. Sociology's subject matter is diverse, ranging from crime to religion, the family to the state, the divisions of race and social class to the shared beliefs of a common culture, and from social stability to radical change in whole societies and the environment and the juxtaposition of humanity on the environment and—plants, animals and all living things. Sociology provides a distinctive and enlightening methodology of seeing and understanding the world in which we live and which shapes our lives. Sociology looks beyond the indoctrinated and conditioned take-it-for-granted views of facts, to provide deeper, more illuminating and challenging understandings of the juxtapositions of life on this planet and the entire constellation of planets, star, sun and moon. Through its particular analytical perspective, social ideology, and research methods, Sociology is a discipline that expands our awareness and analysis of the human social relationships, cultures, and institutions that profoundly shape both our lives and history. The in depth definition of Sociology includes all social sciences. Sociological research focuses on only one aspect of the Social Sciences and its impact on and within all Social Sciences. Sociology research/study often brings up the dilemma of ‘Which came first the chicken or the egg.’ And therein lies the confusion and over simplification of the vastness of life in the 3rd, 4th, 5th, 6th, 7th, 8th, and 9th dimension. The first sociological dilemma was in the beginning. “In the beginning, that which Is is all there was, and there was nothing else. Yet, all That IS could not know itself—because All That Is is all there was, and there was nothing else. And so All That is…was not. For in the absence of something else. All That Is, is not.” 1 “This is the great Is/Not Is to which mystics have referred from the beginning of time.” 2 “All That Is knew that It was all there was—but this was not enough for It could only know its utter magnificence conceptually, not experientially. Yet the experience of itself is that for which it longed, for it wanted to know what it felt like to be so magnificent. Still, this was impossible, because the term “magnificent” is a relative term. All That Is could not know what it felt like to be magnificent unless that which is not showed up. In the absence of that which is not, that which IS, is not.” 3 “The one thing that All That Is knew is that there was nothing else. And so it could, and would, never know itself from a reference point outside of itself. Such a point did not exist. Only one reference point existed and that was the single place within. The ‘Is-Not-Is.’ The Am-Not Am.” 4 “Still, the all of Everything chose to know Itself experientially.” 5 “This energy—this pure, unseen, unheard, unobserved, and therefore unknown-by-anyone-else vibration—chose to experience Itself as the utter magnificence It was. In order to do this, It realized It would need to use a reference point within.”6 “It reasoned, quite correctly, that any portion of Itself would necessarily need to be less than the whole, and that if It, thus simply divided Itself into portions, each portion, being less than the whole, could look back on the rest of Itself and see magnificence.” 7 “And so All That Is divided Itself—becoming, in one magnificent moment, that which is this, and that which is that. For the first time, this and that existed, quite apart from each other. And still, both existed simultaneously. As did all that was neither.” 8 “Thus, three elements suddenly existed: that which is here. That which is there. And that which is neither here nor there—but which must exit for here and there to exist.” 9 “It is the nothing which holds the everything, It is the non-space which holds the space. It is the all which holds the parts.” 10 Thus, the construct of Sociology existed in one glorious millisecond—the science of society, social institutions, and social relationships; specifically; the systematic study of the development, structure, interaction, and collective behavior of organized groups of human beings. Everything in the Universe is connected to the one source…The All That Is that created everything. Everything impacts everything at the microscopic level. Source: Searching for answers when I was 7 years 9 months old, I asked the question—”What is this life about? What does God have to do with all this?” I received this profound message from ‘The Source— The Is.’ Many decades later Neale Donald Walsch received the same message, which he wrote in his book—”Conversations with God—Book 1. Page 22 - 23.IbidIbidIbidIbidIbidIbidIbidIbidIbidThese 10 quotes took only a nano second to receive and comprehend. It was then that I knew why I was a ‘strange duck’ in my family. I had been receiving messages from The Source since I was 19 months old. I assumed everyone else did too, except they didn’t talk about it. I chattered away thinking everyone would know the same things. My Mom often said, ‘NOW, Dorothy don’t get carried away.’ I was confused because NO one talked about the things I knew and experienced. Later, I realized the majority of people are unaware of the magnificence of The Source. Then, I realized my Mom cautioned me not to get carried away so I wouldn’t blurt out something that would cause people to think I was ‘hallucinating or psychotic’. And many people reading this now will think I am off in the bushes in ‘craziness.’ Thank you Arjhay Sonido for asking me to answer your question. I have enjoyed answering it. I am here only to be truly helpful. If you have a question contact me. ",
            "date": "Updated January 24, 2018",
            "views": "7",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tawanda Shawn Kuimba",
                    "user_href": "/profile/Tawanda-Shawn-Kuimba"
                },
                {
                    "user_id": "Asdfs Mkii",
                    "user_href": "/profile/Asdfs-Mkii"
                },
                {
                    "user_id": "Angelo Garcia",
                    "user_href": "/profile/Angelo-Garcia-85"
                },
                {
                    "user_id": "Rahul Kishore",
                    "user_href": "/profile/Rahul-Kishore-46"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adam Ciacelli",
                "href": "/profile/Adam-Ciacelli"
            },
            "answer_text": "The teacher's pet answer to your question is that social studies is more rooted in the past which feeds the inspiration and drive to understand how we can scientifically tackle social issues now. But I fell very strongly that these terms are actually abuses of the English language meant to accomplish specific progressive agenda items. Here's why: Social Studies was the new age label given to the study of History because it has been viewed that history is only a study from 'one's own perspective.' In politically correct circles it is seen as virtue to say we that past xenophobia in the term History, is absolved by donning a sheepskin term like Social Studies. The real meaning behind the words Social Studies, is \"History is a racist term and we want to be globalist, so we will also throw statistical analysis and revisionism into our field to allow controversy which will make us feel like we are trying to be more attractive and not at all people who generally wear glasses while they read and write for a living.\" The people who have authority in this field are still called Historians, and they study History, and saying otherwise is a vanity project by people who want to sell you something. Social Science is of the two, the more nefarious and metaphysical of the two subjects. Social science assumes the mantle of scientific study, yet any scientific layman would tell you that Anthropology is the true study of humans and humanity in every truly scientific facet. Social science is based on human engineering. It's data is polling statistics, journals and findings which are anecdotal at best, and positions within the field can reverse months after they have reached a conclusion. This is because unlike the observable and experimental physical world; humanity doesn't actually follow laws and rules in such a predictable fashion. Political, Economic, Psychologic, and all sorts of other human fields have been studied and written about under the banner of 'Social Science' and in my experience these ideas and predictions put forth by the 'social scientists' of our time are largely false. Society has a real academic crisis on our hands, we are publishing and labeling many false and categorically untrue statements and conclusions with the sheep's skin of science when the conclusions are more entrenched with opinion than facts. The truth is that in this Age of Information, we can no longer decide what the truth is, because taking an authoritative absolute position is taboo. So anyone who is anyone can get a webcam and convice people of stupid things, like the earth being flat, or that man controls weather, or that Trump can never be president. The underbelly to having access to the thoughts of everyone in society is that some of those thoughts are wrong, and since we have established the rights of people to have wrong thoughts, we are cursed with the problem of sorting out which facts are in fact, good and true. Social studies and social science ought to be solving this problem, but I fear they have caused it to start and it will be other societal fields that solves it. ",
            "date": "Answered April 23, 2018",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Suzan Malik",
                    "user_href": "/profile/Suzan-Malik-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Mullens",
                "href": "/profile/Tom-Mullens"
            },
            "answer_text": "I think the best way to understand the relationships and differences is to consider the central question each is trying to answer. Psychology is the study or science of the mind and asks questions about the individual and what shapes deeply personal traits like intelligence and personality. It also asks questions about the behavior of individuals, how that behavior is influenced and changed.  Economics studies the production, consumption and transfer of commodities and wealth. It asks a lot of questions about how people arrange exchanges of commodities  and they deal with scarcity and the desire for acquisition. Political Science focuses on systems of government and political activity and behavior. It asks questions about how governments arise, how they function, and the behavior of citizens.  Sociology studies the development, structure and functioning of human society. It asks questions about why and how human societies form, from nations to families. It asks how they function, and whether they function successfully. It asks questions about human behavior in groups and it's influences.  There is of course an enormous amount of crossover between the social sciences. Sociology, for example, has branches that include social psychology, economic sociology, and political sociology.  The other social sciences have branches, or at least specializations, that are concerned with social groups and behavior. The biggest difference is the focus.  Psychologists are going to be looking to answers through the lens of the individual mind. Economists may look for market based behavior. Political scientists will be looking for the impact of political action and government. Sociologists will be examining the relationships between individuals and groups. ",
            "date": "Answered April 28, 2016",
            "views": "63",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Preeti Singh",
                    "user_href": "/profile/Preeti-Singh-3684"
                },
                {
                    "user_id": "Carl Roodnick",
                    "user_href": "/profile/Carl-Roodnick"
                },
                {
                    "user_id": "Raghavendra Rao K.N",
                    "user_href": "/profile/Raghavendra-Rao-K-N-1"
                },
                {
                    "user_id": "Ruslan Aliyev",
                    "user_href": "/profile/Ruslan-Aliyev-16"
                },
                {
                    "user_id": "Swarali Raikar",
                    "user_href": "/profile/Swarali-Raikar"
                },
                {
                    "user_id": "Abdullah Khan",
                    "user_href": "/profile/Abdullah-Khan-635"
                },
                {
                    "user_id": "Rida Rana",
                    "user_href": "/profile/Rida-Rana-14"
                },
                {
                    "user_id": "Jim McCrory",
                    "user_href": "/profile/Jim-McCrory-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chuck Moore",
                "href": "/profile/Chuck-Moore-48"
            },
            "answer_text": "John Donne said that No Man is an Island. Well, neither is any science. Just about all sciences interact somewhere within the fringes of their various disciplines. Sociology makes regular use of statistics , biology, medicine, psychology, neuro-science, economics, and political science. I am sure I could think of many other direct ties if I put my mind to it. Other sciences utilize sociology even more than it uses them. Almost all clinical studies require at least some rudimentary understanding and implementation of sociological methods. Archaelology and zoology use it to some degree to understand behaviors of people in past civilations and animal behavior, respectively. One could even make a case for its usefulness in paleontology and anthropaleontology. I recently heard that physicists were experiementing with game theory to better understand subatomic particle behavior in our early universe, and though game theory is primarily a mathematical discipline, it also incorporates many sociological principles. ",
            "date": "Answered August 21, 2018",
            "views": "21",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Suzan Malik",
                    "user_href": "/profile/Suzan-Malik-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fel Rouse",
                "href": "/profile/Fel-Rouse"
            },
            "answer_text": "What are the relationship between sociology and other social science? The question is better rephrased as what relationships exist between sociology and other social sciences? At this point, concluding from the number of questions that the anonymous questioner has asked about sociology, I’m going to suggest that the questioner take a course in sociology to learn all about the various elements that are related to that field of study. ",
            "date": "Answered March 28, 2018",
            "views": "12",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Suzan Malik",
                    "user_href": "/profile/Suzan-Malik-1"
                },
                {
                    "user_id": "Alungile Gxabu",
                    "user_href": "/profile/Alungile-Gxabu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sara Matthews",
                "href": "/profile/Sara-Matthews-5"
            },
            "answer_text": "Social Studies - the term - is Not a New Age term but is rather the name given to it by an early 20th century educator who believed that secondary curriculum should include instruction in the new social sciences - primarily anthropology and sociology. He envisioned and advocated for a course offering that would teach those new disciplines - and suggested it be called Social Studies. Dr.Jones's idea - and the term- was fairly well-received - but the reality was - secondary teachers were not grounded in the new social sciences and Social Studies was pushed down into elementary education and 'junior high' where it's basically history, a bit of geography, and some cultural studies. ",
            "date": "Answered June 8, 2018",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gervasoni Quentin",
                "href": "/profile/Gervasoni-Quentin"
            },
            "answer_text": "Sociology is part of social sciences the same way chemistry and physics are subcategories of “natural sciences”. The “social sciences” (much like natural sciences) category is ill defined, but you could say it’s made up of disciplines such as sociology, social psychology, cultural/social anthropology, history, linguistics, to only cite the most common and worldwide, as well as some more national disciplines. ",
            "date": "Answered November 28, 2018",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Suzan Malik",
                    "user_href": "/profile/Suzan-Malik-1"
                },
                {
                    "user_id": "Carl Roodnick",
                    "user_href": "/profile/Carl-Roodnick"
                }
            ]
        },
        {
            "author_info": {
                "name": "Basit Azar",
                "href": "/profile/Basit-Azar"
            },
            "answer_text": "Simply it is said that sociology is the mother of all social sciences. And also it links other social sciences to form a homogeneous cluster, as it takes every allied as its own subject matter because it is the study of human groups and societies with every aspect including any factor , related to humans and has effect on them. ",
            "date": "Answered March 16, 2017",
            "views": "582",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Akinyemi Akinwale",
                "href": "/profile/Akinyemi-Akinwale"
            },
            "answer_text": "Social studies makes it a duty to bring all the primary components of all other social science subjects needed for dad to day survival of man under an umbrella so as to make for easy knowledge of the environment and easy integration of human into their society ",
            "date": "Answered June 19, 2018",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Cousins",
                "href": "/profile/John-Cousins-10"
            },
            "answer_text": "Good question and one I questioned at one time. Put simply: Psychology is the investigation of the hidden internal influences (inside the head) that occur subconsciously that manipulate us without us realising it. Sociology is the investigation of the hidden external influences (outside in society) that equally manipulate us without us realising it. ",
            "date": "Answered February 19, 2019",
            "views": "609",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Matt Krzystek",
                "href": "/profile/Matt-Krzystek"
            },
            "answer_text": "All other social science came from sociology. However, sociology came from philosophy. Sociology has been created as applied philosophy.  Any other understanding of sociology and social science is horrendously wrong.   ",
            "date": "Answered May 7, 2016",
            "views": "733",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Carl Roodnick",
                    "user_href": "/profile/Carl-Roodnick"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Stuart",
                "href": "/profile/Matthew-Stuart-28"
            },
            "answer_text": "This may be an oversimplification, but here we go. I tend to get into discussions with people that are along the lines of “what's the difference between sociology and psychology?” They’re sometimes mixed up, and even used interchangeably. And while they are similar, there is a clear difference. The way I usually describe the difference is as follows: Sociology is the study of what occurs on a broader, more societal level. Psychology is the study of what occurs on the individual level. The behavior of the individual informs society and vice versa, and that is how the two fields are interlinked. ",
            "date": "Answered December 3, 2017",
            "views": "23",
            "upvotes": " Answer requested by Robert Mela",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Major-Dunross"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Miller",
                "href": "/profile/James-Miller-128"
            },
            "answer_text": "Sociology (the study of groups of peoples or societies) is a branch of social science. Other social science subjects include psychology (the study of the individual), anthropology (the study of culture) and lots more. ",
            "date": "Answered January 21, 2017",
            "views": "565",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Maduneme Nzubechukwu",
                "href": "/profile/Maduneme-Nzubechukwu"
            },
            "answer_text": "The relationship between sociology and field in social science can be seen a mutual relationship that exist between a mother and her children , ",
            "date": "Answered March 14, 2017",
            "views": "278",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Zakariyau Yahaya",
                "href": "/profile/Zakariyau-Yahaya"
            },
            "answer_text": "Social studies is the studies of people while social science is the branch of science that deal with human behavior in its social and cultural aspect ",
            "date": "Answered August 7, 2018",
            "views": "565",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chris Goodwin",
                "href": "/profile/Chris-Goodwin-27"
            },
            "answer_text": "All equally non scientific, they are just literature, or philosophy, or studies in Narrativium, word games. Each piece of nonsense is there to support the next. ",
            "date": "Answered January 14, 2020",
            "views": "84",
            "upvotes": "0"
        }
    ]
}