{
    "title": "What is a wave? How is it formed? - Quora",
    "tags": [
        "Waves (physics)",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vιshwas P",
                "href": "/profile/Vιshwas-P"
            },
            "answer_text": "Everything you look around are waves.(We'll discuss about this later) “A wave can be simply described as a disturbance that travels through a medium from one location to another location.” A medium can be anything, air, water, solid and even vaccum. “It's a means of transfer of energy from one place to another.” Every morning when you wake up you see the nature around yourself beautiful and colourful, that's because infinite light waves enter your eyes.On a hot sunny day you feel the heat of the sun, that's because of waves hitting your skin at a speed of 3 lakh Km per second(infrared waves). When you open your mouth to speak waves rushes out. All those wonderful musics that you hear or a person's speech, that's because waves quickly find a way into your ears and later brain tells the meaning of it. Swing a pendulum and notice that the Bob traces the same path(of course it slowly dampens over a time) this is called a wave. The ripples in water when you drop a stone is wave. The water surfing the shore is a wave You are reading this Answer that's again due to waves, first it is converted from digital to analog and then back to digital in your device.If we were able see also those wonderful waves that swirl around us, then we wouldn't be able to see the person standing right in front of us. This is how waves form. But what is a wave mathematically? Believe me, no one can understand you a concept better than mathematics, that's the beauty of it. All waves can be represented by using trigonometric functions. A simple representation of a simple wave, say, a wave of a pendulum swung in vaccum is given by  Y=A sin(ωt) Where, Y is the displacement at any instant of time. A is its amplitude. ω is the angular velocity t is the instantaneous time As I already said, everything is a wave. Everything you look around are waves. Because matter is a wave, yes it was a long debate in the history of science, when scientists scratching their heads off wondering whether light is a particle or wave, a guy came and said “light has both the natures..!”. If this is true then matter should also be a wave, it is then we understood that matter could also behave as a wave. λ = h/mυ The above equation speaks about matter waves, what will be it's wavelength when it travels at a certain speed. For an average person moving at an average speed de-broglie wave turns out to be 6.5x10^-33 m, really a very very negligible quantity, that's the reason why we won't see person moving like a wave. This concept of matter wave was proposed by De-broglie in 1942 and it's amazing. There are much more things to say about waves, it's types, it's characteristics, it's anomalous behavior etc. The above is just a very brief introduction to waves. If you need any detail please feel free to request. ",
            "date": "Answered July 12, 2017",
            "views": "12",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Keerthigambigai Shekar",
                    "user_href": "/profile/Keerthigambigai-Shekar"
                },
                {
                    "user_id": "Anirudh Swaminathan",
                    "user_href": "/profile/Anirudh-Swaminathan-3"
                },
                {
                    "user_id": "Vishwas RV",
                    "user_href": "/profile/Vishwas-RV"
                },
                {
                    "user_id": "Bharath Hiremath",
                    "user_href": "/profile/Bharath-Hiremath-1"
                },
                {
                    "user_id": "Vishal",
                    "user_href": "/profile/Vishal-618"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sarfraz Ahmad",
                "href": "/profile/Sarfraz-Ahmad-136"
            },
            "answer_text": "Waves are most commonly caused by wind. Wind-driven waves, or surface waves, are created by the friction between wind and surface water. As wind blows across the surface of the ocean or a lake, the continual disturbance creates a wave crest. ... The gravitational pull of the sun and moon on the earth also causes waves ",
            "date": "Answered February 12, 2018",
            "views": "304",
            "upvotes": "0"
        }
    ]
}