{
    "title": "What are the parts of the electromagnetic spectrum? - Quora",
    "tags": [
        "Electromagnetic Radiation",
        "Electromagnetic Spectrum",
        "Electromagnetism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gerard Bassols",
                "href": "/profile/Gerard-Bassols-1"
            },
            "answer_text": "The split of the EM spectrum in parts is a human construct due to the different bands of wavelenghts having been discovered at different times and via different effects, often originally being thought of as completely different kinds of radiation, until people like Maxwell, Hertz and Röntgen realised that they were all the same phenomena. The spectrum is usually split in these major regions, but the boundaries are not precisely defined, they merge into each other, same as the colours of the rainbow: Ultra-low frequency: from the longest wavelength (potentially as large as the universe) down to around 100 km Radio: from 100 km to around 1 m Microwaves: from 1 m to around 1 mm Infrared: from 1 mm to around 700 nanometers  10 μm Visible light: from 700 nanometers to 400 nanometers   Ultraviolet: from 400 nanometers to 10 nanometers X-Rays: from 10 nanometers to 10 picometers Gamma-Rays: from 10 to 1 picometer (for reference, the diameter of an hydrogen atoms is estimated to be around 62 picometers). ",
            "date": "Answered August 14, 2015",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chris Lotino",
                    "user_href": "/profile/Chris-Lotino"
                },
                {
                    "user_id": "Hanmala Aravind",
                    "user_href": "/profile/Hanmala-Aravind"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vishnuthirtha Madaksira",
                "href": "/profile/Vishnuthirtha-Madaksira"
            },
            "answer_text": "The following are the different regions of the electromagnetic spectrum in the increasing order of their wavelengths : Cosmic rays, gamarays , X- rays , UV, Visible, Infrared, Microwaves , Radio waves. ",
            "date": "Answered February 25, 2019",
            "views": "120",
            "upvotes": " View Sharers"
        }
    ]
}