{
    "title": "What degrees are higher than a PhD? - Quora",
    "tags": [
        "Quantum Biology",
        "Academic Degrees",
        "Doctor of Philosophy Degrees"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eric Anderson",
                "href": "/profile/Eric-Anderson-115"
            },
            "answer_text": "There have been a bunch of good answers on here, but I feel a need to write a compact summary. So here it is: There are different systems of what degrees are called, which ones come after which others, and what’s involved in earning each one. These vary between different parts of the world, and sometimes between universities and fields. As I read it, they mostly seem pretty similar in spirit, but I can only speak from direct experience about the U.S. system, especially in the sciences. Unless I say otherwise, that’s what I’m talking about.It depends what you mean by higher. In the sense of “what degree can a person go to school for after getting their PhD to learn and demonstrate an even greater mastery of their subject?” the answer is none. The basic progression (for a PhD) in the US goes “BA/BS → MA/MS → PhD” and then there’s no further to go. It’s a terminal degree. That doesn’t mean you know all there is to know about your field at the end of your PhD, but in your particular precise area(s) of interest you should be the world’s leading expert. You’re expected to be able to figure out what you don’t know, find whatever answers are out there, and learn them. “Higher” might also mean the most prestigious, the most qualified, in some sense “the best.” In that case, there will often be higher degrees. The PhD is a research degree. A person with a PhD is (supposed to be) good at creating new knowledge. They’re good at learning, they’re good at analyzing the world and what we know about it, finding things we don’t know (or things we think we know, but there’s a good chance we’re wrong about) and finding the answers. They’re good at evaluating, communicating, critiquing, and verifying ideas. They’re good at figuring out what the important underlying phenomena and issues are in a lot of situations. Not everyone with the degree is as good at all of those things all the time as they might like, but they’re representative skills (according to me). I think that’s all awesome. I’m pro-research and I’m pro-PhD. But those are not the only skills that matter, and in non-research settings, other skills and knowledge can be really important. One of my doctors is an MD/PhD, and the MD is definitely the degree that matters the most to me.There are some “higher doctorate” degrees that are more like lifetime achievement awards. Examples are Doctor of Science (DSc) and Doctor of Letters (DLitt). You donI’ve never encountered any of these in memorable way in a decade+ in academia (in the US and US-centric, English language, international research), but it sounds like they’re more common in Europe.In a similar vein, there are a variety of forms of recognition bestowed by other organizations in one’s field. For example, I’m a computer scientist, and our primarily research organization, the Association for Computing Machinery (ACM), awards the title of “Fellow of the ACM” to particularly impactful researchers [About ACM Fellows]. It’s not a degree, but if someone’s e-mail signature says “Prof. Something, PhD , ACM Fellow” that definitely suggests a higher level than just the “PhD” part.Some professions follow completely different sequences. In Law, the Juris Doctor (JD) is the standard “practitioner working in the field” degree, and the Master of Laws (LLM) is a higher, more specialized degree. The most PhD-like degree is Doctor of Juridical Science (SJD) (according to Types of Law Degrees).That’s all I’ve got. ",
            "date": "Answered November 27, 2019",
            "views": "137",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Christine Foo",
                    "user_href": "/profile/Christine-Foo-10"
                },
                {
                    "user_id": "Zayed Ahmed",
                    "user_href": "/profile/Zayed-Ahmed-11"
                },
                {
                    "user_id": "Sean Walker",
                    "user_href": "/profile/Sean-Walker-301"
                },
                {
                    "user_id": "Syed Shafay",
                    "user_href": "/profile/Syed-Shafay-2"
                },
                {
                    "user_id": "Dr Francis Ero",
                    "user_href": "/profile/Dr-Francis-Ero"
                },
                {
                    "user_id": "Libertine Tina Simon",
                    "user_href": "/profile/Libertine-Tina-Simon"
                },
                {
                    "user_id": "Sara Fort",
                    "user_href": "/profile/Sara-Fort-1"
                },
                {
                    "user_id": "Sattik Chakraborty",
                    "user_href": "/profile/Sattik-Chakraborty"
                },
                {
                    "user_id": "Andrew Ferguson",
                    "user_href": "/profile/Andrew-Ferguson-102"
                },
                {
                    "user_id": "Ayushmaan Mazumder",
                    "user_href": "/profile/Ayushmaan-Mazumder"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chuck Matthews",
                "href": "/profile/Chuck-Matthews"
            },
            "answer_text": "One of the terms used in describing a PhD (or other designation for a doctorate, such as EdD, DM, DBA, etc.) is terminal degree. This does not mean that it’s the end of your education, but it does mean that you’ve mastered a body of knowledge, and what’s left is research, consulting, and expanding the body of knowledge in the field of study. This means that there is nothing “higher than a PhD” other than recognition for discoveries, a body of work, or admission to societies that promote common interests. In some fields, licensing or certification may exist, but these are also available (generally) to those with bachelor’s or master’s degrees, too. In the latter category, I am thinking of licensed professional engineers. On the other hand, there are bar exams for lawyers and medical boards for medical doctors that allow those professionals to practice their chosen career. In these cases, the doctorate (JD and MD) are required for admission to that club. ",
            "date": "Answered March 7, 2020",
            "views": "55",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ray Abadi",
                    "user_href": "/profile/Ray-Abadi-1"
                },
                {
                    "user_id": "Chris Davis",
                    "user_href": "/profile/Chris-Davis-515"
                },
                {
                    "user_id": "Ali Khodadadi",
                    "user_href": "/profile/Ali-Khodadadi-1"
                }
            ]
        }
    ]
}