{
    "title": "What are the 4 new Elements in Periodic Table? - Quora",
    "tags": [
        "Periodic Table",
        "Chemistry of Everyday Life",
        "Science of Everyday Life",
        "Physics of Everyday Life",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shah Siamoon",
                "href": "/profile/Shah-Siamoon"
            },
            "answer_text": "The IUPAC officially recognized the following elements in December 2015: At no. 113, NIHONIUM (Nh):Earlier called ununtrium.Discovered by scientists at the RIKEN Nishina Center for Accelerator-based Science in Japan. They are the first Asians to earn the right to propose an addition to the table.Nihonium comes from ‘Nihon’, one of the two Japanese words for Japan.At no. 115, MOSCOVIUM (Mc):Earlier called ununpentium.Named for Moscow, which is near the Joint Institute for Nuclear Reasearch in Russia.At no. 117, TENNESSINE (Ts):Earlier called ununseptium.Gets its name from the state of Tenessee, where Oak Ridge National Laboratory is.The second element to be named for one of the 50 states of the USA, after Californium.At no. 118, OGANESSON (Og):Earlier called ununoctium.Named after Yuri Oganesson, who helped discover several superheavy elements.The second element to be named for a living person, first being seaborgium (at no. 106) for Glenn T. Seaborg.Naming rights for elements 115 and 117 were jointly given to: The Joint Institute for Nuclear Research (JINR) in RussiaOak Ridge National Laboratory in TennesseeLawrence Livermore National Laboratory in CaliforniaNaming rights for element 118 belonged to the same Russian researchers from the JINR and the same American researchers from the Livermore National Laboratory. The proposed names had to follow IUPAC rules. (With data from The Hindu) ",
            "date": "Answered January 17, 2017",
            "views": "548",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Raisa Arief",
                    "user_href": "/profile/Raisa-Arief"
                },
                {
                    "user_id": "Soumya Sanoria",
                    "user_href": "/profile/Soumya-Sanoria"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sekhar Bonagiri",
                "href": "/profile/Sekhar-Bonagiri"
            },
            "answer_text": "The International Union of Pure and Applied Chemistry (IUPAC) has announced that four new elements — with atomic numbers of 113, 115, 117, and 118 — will be added to the periodic table.This is a big deal, since these four elements — all super heavy, lab-made, and very radioactive — complete the unfilled spaces on the seventh row of the periodic table. Their discoveries also open the door for scientists to create even heavier, perhaps useful, synthetic elements in the future.Here, we break down what the discoveries mean (that is, other than the fact that people who haveperiodic table tattoos will now be out of date).These four new elements don't exist naturally Every element is given an atomic number, which corresponds to the number of protons in its nucleus. Hydrogen, the lightest element, has an atomic number of one, and its nucleus contains one proton. Element No. 2 — helium — has two.These new elements have 113, 115, 117, and 118 protons respectively. Atoms with that many protons are too unstable to exist in nature. That's because protons naturally repel one another. In smaller atoms, the strong nuclear force — the powerful energy that is unleashed in a nuclear explosion — keeps the protons bonded. But in larger atoms, it loses its grip, and the atoms decay into more stable elements with fewer protons.(Uranium, with 92 protons, is theheaviest element to exist naturally.) ",
            "date": "Answered January 5, 2016",
            "views": "501",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Manohar Badam",
                    "user_href": "/profile/Manohar-Badam"
                },
                {
                    "user_id": "Arpit Shukla",
                    "user_href": "/profile/Arpit-Shukla-50"
                },
                {
                    "user_id": "Sayantan Pramanik",
                    "user_href": "/profile/Sayantan-Pramanik"
                },
                {
                    "user_id": "Rachit Mathur",
                    "user_href": "/profile/Rachit-Mathur-11"
                }
            ]
        }
    ]
}