{
    "title": "What does an electric shock feel like? - Quora",
    "tags": [
        "Scientific Explanations",
        "Human Brain",
        "Neuroscience",
        "Electricity",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gary McCarty",
                "href": "/profile/Gary-McCarty-5"
            },
            "answer_text": "I have several shocking stories regarding electricity passing in and through me. The most memorable, or perhaps the ones I’d like to forget were the biggies. Before that I’ll say I’m a very experienced home handyman who does a fair amount of electrical work and sometimes, I just have to work on live circuits and it should go without saying that you will get shocked sometimes when doing this. Fortunately the amperage of a home in the US is generally a tolerable event. Now the good stuff. I used to own retail stores and we had several neon signs. Once up on a ladder cleaning glass, a wire broke loose from a sign and sprung right into the back of my bicep and just stuck there. Because of it’s position, and the fact I was up a ladder and did not want to fall off, I got zapped pretty good for a quite a few seconds. Left a nice scar too where it dragged across my arm. For those not familiar with neon sign transformers, they output 9000 volts. Another time and again this was stupid, I was holding a neon transformer in my hand, plugged in, and I pulled the on/off cord switch and thing was clearly not grounded and the current just ran through me. At the time it was the worst shock of my life and unfortunately I did this while standing over a glass-top display case so I could not just drop it. I placed it gently down while the current had my head spinning. This was pretty terrible and one of those teaching moments in life. Without knowing the details, my understanding is that it’s not the volts, but the amps that kill you and that’s why I’m still here. But that shock was easily surpassed later in life during a clinical trial for a cancer treatment. The procedure is called “electroporation”. The idea behind this experimental treatment is the fact that human cells “open up” under electrical charge making the cells walls more porous. The treatment involved injecting a drug into a tumor directly, than zapping the tumor with what amounts to a 12,000 volt cattle prod. Maybe worse because there are spikes at the end of the prod and it is literally stabbed into you prior to the shock. This was done repeatedly on several subcutaneous tumors per treatment cycle. To give you an idea of just how strong a jolt this is, the doctor administering the shock would lean with all his weight onto my chest, to hold me down on the table. But the body reflex from the shock was so strong my entire body would still lift off the table momentarily. The level of pain from this procedure is what I believe the most painful thing I have ever endured. Despite being drugged with multiple agents, and a blistering dose of morphine. To call this a brutal torture would be too kind. (I did it in the name of science and hope it would help my condition). Each time going back to repeat the procedure got a bit tougher emotionally knowing what I was in for. I suppose I was relieved when it was determined it did not help my case and ended. But here’s the interesting part. There is absolutely no lingering pain after the bolt of fire. All that pain is concentrated at the moment of delivery, and once the morphine had worn off enough, I would walk out on my own. The interesting takeaway from all this is when you see a movie where the the subject is being tortured by electric shock, know that pain would be very very real if it was actually happening. And yet pain from electric shock leaves no residual pain afterwards which may be the bigger surprise. ",
            "date": "Answered October 11, 2020",
            "views": "787",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gregory Scott",
                "href": "/profile/Gregory-Scott-5"
            },
            "answer_text": "It's the total energy that matters most, and how much of it goes through your heart. A high frequency shock may only burn your skin, because it will tend to travel primarily on the surface. A dc shock can be more dangerous flowing deep in your body, and affecting your heart because blood is the path of least resistance in the body. Shocks you can have, or can easily experience at very low risk:An electric fence on a farm, the spark from an engine ignition, a dog training collar, or a squirrel shocker to discourage squirrels on a bird feeder . These are high voltage, medium frequency alternating current, and low power.  A much different shock is to touch your tongue to the electrodes of a small 9v direct current dry cell. This is low voltage, medium resistance, medium current. Since the tongue is a muscle that reacts to very small nerve impulses, the effect is quite strong, but not likely to be dangerous. now more dangerous shocks: The shock from a Wimhurst electrostatic generator or a van de graff generator is high voltage dc, but most such machines are classroom demstration machines, and they generally have small capacitance and low power. But a 20,000 v shock will grab your attention. Some tessla coils (classroom models) give low energy medium or high frequency shocks of high voltage. These are generally harmless, but can be dangerous if the machine has too much energy.  A stun gun is usually safe, it's much like the electric fence shock, but much higher voltage and perhaps more amps. Sometimes, rarely, these are fatal depending on heart condition and other variables. But such deaths do occur. Generally, one of three sensations occurance in a shock: You feel a weak or strong tingling sensation.  Muscles (heart, tongue, hand are strongly activated, and you feel this like a very strong, instantaneous cramp. Your skin gets a burn, varying in degree from a small 1st degree burn to a large 3rd degree burn in the entire body. Crispy critter. You may smell burning flesh.  I was once shocked in a physics lab by 500v, and fairly strong amps, but  luckily it went in my little finger and out of the same hand. Luckily,  it was not through my heart, and it hurt much like a wasp bite, perhaps, and  removed about about 1 cubic mm of skin from my skin. You could smell the  fried skin. This would have been lethal, probably, if the circuit had  gone to another limb.  I've had 110 v 60 cycle AC electric shocks under similar conditions, but with dry skin and no ground, again current only through the hand. A medium tingle. Safety precautions to help avoid lethal mistake: When you first touch an electric circuit, make sure you're not touching ground, such as via a metal ladder. Touch it with just one hand, and use the back of your fingers. The most dangerous 110v shocks are often aggravated by the shock causing your muscles to lock up on the hot contact in a firm grip. A momentary shock on dry skin where you do NOT clamp down on the wire is quite a bit less dangerous. using the back of your hand assures you don't grasp the hot electrode. I've seen electricians work on hot energized circuits. If they are careful to work on fiber glass ladders, avoid contact with ground, wear shoes with good insulation, and perhaps wear a glove on the left hand, they can do this in marginal safety. (Mistakes are very easily made.) If you do this right, you will probably not feel any shock at all, because there is NO circuit through your body.  On a much more extreme level, high voltage, high energy power transmission towers are maintained by linemen working from helicopters. There is a strong induced current on any conductor near this, but the human body has very low capacitance. But the helicopter has much capacitance, and a large induced charge occurs. They minimize this charge by using faraday cage, and a conductive wire, held by a non-conducting pole, which they use to short this induced power to the transmission line. There is a big visible, lethal sized arc during this process. Once the linesman and the helicopter are at the same potential, he can \"relatively\" safely climb onto the energized transmission line.Here is a very cool video showing this process. The whole thing here is to avoid the shock entirely by connecting to the wire, ironically. This link is a video of the process: (if it doesn't work, go to youtube and search for high voltage lineman helicopter, and you''ll see the video near the top of the results.     Then there is the navy electronics student who killed himself by cutting each thumb, and putting the probes of multimeter in ohmmeter mode into each cut. The blood stream provided a good conductor and low resistance through his heart. (9 vold dry cell, I think, on an old Simpson multimeter.) Here's a good summary article on the subject:The Electric Shock Questions ",
            "date": "Answered May 5, 2013",
            "views": "257",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stanley Ibe",
                    "user_href": "/profile/Stanley-Ibe-4"
                },
                {
                    "user_id": "Jordan Race",
                    "user_href": "/profile/Jordan-Race-1"
                },
                {
                    "user_id": "Kane Chauhan",
                    "user_href": "/profile/Kane-Chauhan-1"
                },
                {
                    "user_id": "Ashton Marciano",
                    "user_href": "/profile/Ashton-Marciano"
                },
                {
                    "user_id": "Walid Walid",
                    "user_href": "/profile/Walid-Walid-115"
                },
                {
                    "user_id": "Elizabeth Idol",
                    "user_href": "/profile/Elizabeth-Idol"
                },
                {
                    "user_id": "Matthew Schenker",
                    "user_href": "/profile/Matthew-Schenker"
                },
                {
                    "user_id": "Vladimír Galla",
                    "user_href": "/profile/Vladimír-Galla"
                },
                {
                    "user_id": "Tom Stevenon",
                    "user_href": "/profile/Tom-Stevenon"
                },
                {
                    "user_id": "Olaoluwa Olanrewaju",
                    "user_href": "/profile/Olaoluwa-Olanrewaju"
                }
            ]
        }
    ]
}