{
    "title": "What is the least frequency in electromagnetic spectrum? - Quora",
    "tags": [
        "Electromagnetic Radiation",
        "Electromagnetic Spectrum",
        "Quantum Mechanics",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Barak Shoshany",
                "href": "/profile/Barak-Shoshany"
            },
            "answer_text": "The frequency of a wave is a number which specifies how many times the wave pattern repeats itself per unit time (for example, per second). The frequency of a given wave can be anywhere from zero, which means that the wave pattern never repeats itself, to infinity, which means that the wave pattern oscillates so fast it looks like it's not changing its shape at all. Since wavelength is inversely proportional to frequency, zero frequency equals infinite wavelength and infinite frequency equals zero wavelength. These match the intuitive descriptions above. However, this was all very naive since we did not take quantum mechanics into account. Electromagnetic waves are made of photons, and a photon's energy is proportional to it frequency. But a photon cannot have zero energy (due to the uncertainty principle) and it cannot have infinite energy (since nothing can have infinite energy). So the lowest frequency in the electromagnetic spectrum is the frequency corresponding to the lowest energy a photon can have, which is not zero but still very very small (the exact number is indeterminable). ",
            "date": "Answered February 26, 2015",
            "views": "26",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert Pätzold",
                    "user_href": "/profile/Robert-Pätzold"
                },
                {
                    "user_id": "James Proctor",
                    "user_href": "/profile/James-Proctor"
                },
                {
                    "user_id": "Harish Gadiya",
                    "user_href": "/profile/Harish-Gadiya"
                },
                {
                    "user_id": "Amitya Narayan",
                    "user_href": "/profile/Amitya-Narayan-1"
                },
                {
                    "user_id": "John Henry McCann",
                    "user_href": "/profile/John-Henry-McCann"
                },
                {
                    "user_id": "Haider Alwasiti",
                    "user_href": "/profile/Haider-Alwasiti-1"
                },
                {
                    "user_id": "Lori Ann White",
                    "user_href": "/profile/Lori-Ann-White"
                },
                {
                    "user_id": "Joshua Engel",
                    "user_href": "/profile/Joshua-Engel"
                },
                {
                    "user_id": "Tejasvi Gaurav Mishra",
                    "user_href": "/profile/Tejasvi-Gaurav-Mishra"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Natalia-Nezvanova"
                }
            ]
        },
        {
            "author_info": {
                "name": "Art Johnson",
                "href": "/profile/Art-Johnson"
            },
            "answer_text": " Steven J Greenfield is correct in his answer, of course. Here is a very simplistic representation of the range of frequencies of the EM spectrum. The “boundaries” are fuzzy, with overlap. While the waves differ only in wavelength and energy (proportional to frequency), the different types arise from different interactions of matter. Now, here is the educator in me speaking—not being snarky: If you can ask this question on Quora using technology, and you don’t have access to any ordinary high school physics text, why not use a search engine and key in “electromagnetic spectrum” to locate an answer that fits your needs? Much quicker, and much more satisfying to answer for yourself! ",
            "date": "Answered February 12, 2018",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "LeRoy Barnhart",
                    "user_href": "/profile/LeRoy-Barnhart"
                }
            ]
        }
    ]
}