{
    "title": "What is a mixture? Explain its types. - Quora",
    "tags": [
        "Mixtures",
        "Mixture"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rohan Naik",
                "href": "/profile/Rohan-Naik-175"
            },
            "answer_text": "The majority of substances that we see in our surrounding neighbourhood are actually not pure substances. They are all mixtures! Therefore, what are they?  Mixtures are substances composed of two or more forms of matter. You can separate them by physical methods. Examples include a solution of salt and water, a mixture of sugar and water, different gases, air, etc. In any mixture, the various components do not combine through any kind of chemical changes. Therefore, the components do not lose their individual properties. Types of Mixtures Based on their composition, they can be divided into two types: HomogeneousHeterogeneousHomogeneous Mixture Mixtures having a uniform composition throughout their body are called Homogeneous Mixtures. For example – a mixture of salt and water, a mixture of sugar and water, air, lemonade, soda water, etc. Here, a mixture of salt in water is a classic example. This is because here, the boundary, between salt and water can never be differentiated. When a ray of light is passed through the mixture of salt and water, the path of light is not seen. Properties All solutions are examples of a homogeneous mixture.The particles in such a case are less the one nanometer.They do not show a Tyndall effect.You cannot differentiate the boundaries of particles.You cannot separate the constituent particles here using centrifugation or decantation.Alloys are examples of a solution.Heterogeneous Mixture Mixtures lacking a uniform composition throughout are called Heterogeneous Mixture. Therefore, a mixture of soil and sand, sulfur and iron filings, oil and water etc. are heterogeneous as they do not have a uniform composition. You can identify the various boundaries of the constituent particles of a homogeneous mixture. This is because in such a case it has two or more distinct phases. Properties Most of the mixtures are heterogeneous except solutions and alloys.The constituent particles are present uniformly here.You can identify the components easily.Generally, two or more phases are present in a heterogeneous mixture.The size of the particles here is between one nanometer and one micrometre.They show a Tyndall effect.For more information, you can also watch the below video.  ",
            "date": "Answered May 3, 2019",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Uyioghosa Nosa-Ihaza",
                "href": "/profile/Uyioghosa-Nosa-Ihaza"
            },
            "answer_text": "A mixture is a combination of substances not chemically chemically joined together. Each substance retains its individual properties In homogenous mixture, the individual constituents present have a constant composition and may be indistinguishable e.g. air in an heterogenous mixture, the constituents are distinct and they can be distinguished e.g. Soil. ",
            "date": "Answered September 9, 2018",
            "views": "385",
            "upvotes": "0"
        }
    ]
}