{
    "title": "What are the similarities of politics and political science? - Quora",
    "tags": [
        "Learning About Political Science",
        "Political Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Stinson",
                "href": "/profile/Mark-Stinson-15"
            },
            "answer_text": "(A2A - thanks for asking) Politics and Political Science are related. It’s perhaps easiest to think about politics as one of the things that political science studies while the results of political science research (both good research and bad) are sometimes used in political contexts. It is also possible to think of them in terms of the practical (politics) versus the theoretical (political science). I rather like Bismark’s description of politics being “the art of the possible, the attainable—the art of the next best,” while much work in political science begins with assumptions of an ideal. In this conception political science might be thought of as the “could be” or “should be” and politics as the “is.” At its core, political science tries to describe a small-r reality while politics tries to shape that small-r reality. ",
            "date": "Answered February 24, 2019",
            "views": "19",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Stephen Godek",
                    "user_href": "/profile/Stephen-Godek"
                },
                {
                    "user_id": "Farrah Mariz Encarnacion",
                    "user_href": "/profile/Farrah-Mariz-Encarnacion"
                },
                {
                    "user_id": "Jay Dimes",
                    "user_href": "/profile/Jay-Dimes"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sami Ullah",
                "href": "/profile/Sami-Ullah-637"
            },
            "answer_text": "the word “politics” has been coined from Greek word polis which mean” city state “.it was the form of state which the ancient had in their country.all the activities and affairs of city state were called by them as” politics”.but what is politics it takes strong concentration. politics is used in variety of meaning.it may mean ,an event a process or conflict or struggle among group of people.politics is a universal phenomenon in human life and society. now what is political science,political science consist of two term ;politics and science so thus poltical science is the systamatic and scientific study of govt and state. similarities between the two;despite of difference we have some similarities between the two as well. the first similarities is understood is that ,politics study present and past,political science also do the same job. in politics we used observation of practical and non practical things and political science also include observation in its study area. ",
            "date": "Answered March 1, 2019",
            "views": "25",
            "upvotes": " Answer requested by Lydia Mimiaga",
            "upvoters": [
                {
                    "user_id": "Cely Gumilao",
                    "user_href": "/profile/Cely-Gumilao"
                },
                {
                    "user_id": "Richard Morris",
                    "user_href": "/profile/Richard-Morris-444"
                },
                {
                    "user_id": "Jay Dimes",
                    "user_href": "/profile/Jay-Dimes"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Godek",
                "href": "/profile/Stephen-Godek"
            },
            "answer_text": "Politics and political science are both human activities. While politics is the process by which influence is used to organize groups, communities and societies, political science is the systematic examination, theorizing and testing of theories about how influence is distributed and used in groups, communities, and societies. As human activities, both politics and political science involve practitioners, political activists and scientists, in the exercise of influence on behalf of their preferred courses of social action, whether building societies or constructing an understanding of how societies are built. Both are learning processes which means that both involve a good deal of trial and error. The difference between politics and political science is that politics may involve the use of violence, force or manipulation, while science is inherently based on reasonable attempts at persuasion and legitimate authority. ",
            "date": "Answered March 5, 2019",
            "views": "41",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sadid Hasan",
                    "user_href": "/profile/Sadid-Hasan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Z Sun Gang",
                "href": "/profile/Z-Sun-Gang"
            },
            "answer_text": "Yes and no. Political science is a liberal arts that use quasi-scientific methods to gauge the validity of various political paradigms past, present and future. It stems from and borders to economics, philosophy, sociology and international relations, to name a few. The end goal Political Science is to allocate limited resources (of own or others), via economic, military or diplomatic means. Where politics is the practicum, political science is the theory/science. ",
            "date": "Answered November 3, 2019",
            "views": "829",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Bharat Times",
                "href": "/profile/Bharat-Times"
            },
            "answer_text": "Yes. Dynamic politics is different from the subject taught at educational institutions. Political science provides background and training in the field of politics. Once you actually step in politics, anything goes. It’s an open game. ",
            "date": "Answered January 19, 2018",
            "views": "599",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Louis Douglas Williams",
                "href": "/profile/Louis-Douglas-Williams"
            },
            "answer_text": "Similarly, the contention among socialist populations for governmental favoritism is at play, nepotism and cronyism ensue as the science attempting to achieve favoritism. None of the contenders achieve success to their satisfaction while the rotation of contenders, by election, maintain the example of political science at government control. ",
            "date": "Answered February 24, 2019",
            "views": "521",
            "upvotes": " Answer requested by Lydia Mimiaga"
        },
        {
            "author_info": {
                "name": "Prashant Dubey",
                "href": "/profile/Prashant-Dubey-201"
            },
            "answer_text": "there is one major difference between politics and political science that political science is a theory-based knowledge of Indian constitution, laws and Politics is an implementation of the theory. ",
            "date": "Answered July 22, 2019",
            "views": "535",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Shtalman",
                "href": "/profile/Michael-Shtalman"
            },
            "answer_text": "“Politica science” gets more and more polluted with Marxism and other strains of leftism. Politics has hardly ever been a place for very moral people, but nowadays, it gets increasingly influenced by leftism, just like “political science”. ",
            "date": "Answered March 10, 2019",
            "views": "401",
            "upvotes": " Answer requested by Lydia Mimiaga"
        },
        {
            "author_info": {
                "name": "Doug Plumb",
                "href": "/profile/Doug-Plumb"
            },
            "answer_text": "Jurisprudence in practice is very different from that of theoretical jurisprudence. No case fits the mold perfectly. I suspect the same is true with politics and political science. ",
            "date": "Answered January 18, 2018",
            "views": "242",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joe Cocimano",
                "href": "/profile/Joe-Cocimano"
            },
            "answer_text": "Politics is the actually pursuing of ends through political means,whether through democratic elections or other activities. Political science is the study of various types of political systems and parties for education purposes. Both are generally found in Western democracies.. ",
            "date": "Answered February 23, 2019",
            "views": "385",
            "upvotes": " Answer requested by Lydia Mimiaga"
        }
    ]
}