{
    "title": "What is the best site to learn online courses? - Quora",
    "tags": [
        "Learning to Program Website Recommendations",
        "Online Programming Courses",
        "E-learning Website Recommendations",
        "Computer Programming Website Recommendations",
        "Massive Open Online Courses (MOOCs)",
        "Online Training",
        "E-learning",
        "Website Recommendations",
        "Learning to Program",
        "Computer Programming"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ashmodhrav Vaswani",
                "href": "/profile/Ashmodhrav-Vaswani-1"
            },
            "answer_text": "Schools and universities throughout the country recognize the value of incorporating an e-Learning platform into their arsenal of educational tools. Such tools help expand the reach of education beyond the doors of the school by granting students, teachers, and parents easy access to classroom material.It is no surprise that schools would seek to bring technology into the classroom. The problem many educators face is choosing between the many available platforms to identify which is the best choice for their setting. With this blog, I hope to eliminate some of the confusion surrounding this important decision.BlackboardAs one of the oldest e-Learning platforms, Blackboard has the distinction of reaching every aspect of the educational experience for millions of online learners, instructors and educators around the Globe. Blackboard has several functions which instructors and students find invaluable, such as instructor-students and student to student interaction through the dynamic use of discussion threads.Asynchronous discussion boards, blogs, and e–mail are an important aspect of each version of blackboard. Blackboard also features upgraded assessment tools as part of the grade function boards. Students can attach files and images to discussion and assignment threads, which increases the ease-of-use of the learning platform.Pros: Blackboard’s hierarchical structure produces a textual approach to teaching and learning.The class roster feature has two additional communication tools that allow all participants to manage a list of class members. This feature includes links to student’s homepages and e–mail addresses, which helps streamline communication regardless of student location.Search and communication functions allow students to find study material based on their preferred learning styles, which enhances the learning experience for the end-user.Cons: Instructors and students have little control over how they wish to structure their online learning experience.In the default view user’s replies are not listed unless the user is in tree view or expand all, which can complicate discussions that occur over multiple discussion threads.The grading system is convenient, but it completely decontextualizes student-student and student-instructor messages. This means that during the grading process, only communications from an individual student are visible and therefore the message may be lost.E-CollegeE-College is the widely popular learning portal dedicated to professional students, teachers, educators and corporations worldwide. It provides a virtual learning environment that is easy-to-use and adapts easily to suit the needs of professionals. E-college manages, develops and hosts eLearning software applications and support services for institutions, colleges and universities. Educators use the e-College learning management system to deliver a professional online course to students via live video conference hosted by faculty. As educators, students and instructor explore the site, they will come across various programs that will help them achieve their personal and professional goals.Pros: E-College requires less software and hardware because it provides a learning and teaching environment via the Cloud.Complete academic support services and professional development training is available through this platform.e-College boasts a high quality set of assessment and analytics tools to allow educators and students to quantify the learning experience.Cons: The back, forward, and refresh buttons are disabled in this platform, making it difficult to switch between units.The discussion threads are complex- students sometimes have difficulty selecting appropriate discussion threads for class discussions.Uploading and downloading large files is affected by factors such as user connection speed and the time of day. This can be problematic in situations where class materials have a strict deadline that coincides with times where many users are online.CaptivateAdobe Captivate is a part of the adobe eLearning suite. It has become one of the most popular and widely used e-Learning platforms among students and educators worldwide. Captivate’s learning tools allow users to develop any type of e-Learning course without any prior technical knowledge. Adobe Captivate has a wide range of features such as customizable skins, multimedia support, and audio synchronization, just to name a few. It allows for users to produce output files in a wide range of file formats such as AVI, which can be used for both web and LMS delivery.Pros: Easy drag and drop component allows educators make learning fun through the use of drag and drop e-Learning modules, games, quizzes. This ‘gamification’ is cross-browser and cross-operating system compatible, which means that users can easily access these features from anywhere- even from an iPad or mobile device.Captivate features HTML5 support for Microsoft Power Point which allows users to add text, animation, and shape into Adobe Captivate.Educators can publish Captivate projects for both Web and Learning Management Systems. If a project contains audio and text, the program can compile the information in one SWF file that is supported by all video publishing sites.Cons: The program does not have the ability to allow users to save customized interaction themes.There are no updates available for advanced action functionality.Captivate is unable to send large files, which means alternative means of delivery must be used for large or bulky files. This is an inconvenience for faculty and students using the Captivate learning platform to transmit class documents.ArticulateArticulate is another highly popular eLearning tool for delivering effective e-Learning solutions. It allows users to create high quality e-Learning software quickly and easily. Articulate’s rapid e-Learning solutions supports Microsoft PowerPoint add-ons for its all functions. There are plenty of advanced features such as easy-to-use user interface, multimedia support, customizable players, content importing facility, screenshot tools etc. Articulate’s e-Learning products like Presenter and Quizmaker simplify the creation of content to enhance the learning experience. There are various built-in question handling options in the Articulate quiz maker that allow users to develop their own questionnaires.Pros: Articulate easily integrates with other tools, supercharging the existing functionality of PowerPoint with animation, multimedia supports and other interactive features.It is an excellent tool for learning advanced PowerPoint creation by incorporating audio and quiz features.Intuitive user interface makes Microsoft PowerPoint users feel right at home.Cons: Engage tools have some limitation, engage interactive and multimedia features does not appear on the power point slide for added them we have to shift the power point interface and view in separate places.Add-ons are very limited in numbers in Articulate.Articulate takes long time to publish the content slide by slide, every time we publish content.LearnMateLearnMate is a powerful eLearning tool that enables teachers to manage classroom and lab activities, as well as trace the student’s progress and performance with real time data. The LearnMate learning management systems enable teachers or instructors in learning virtual community and collaboration of students. LearnMate content modules support rich multimedia or interactive features such as animation, Graphics, quiz, video, audio etc. LearnMate content modules are easily delivered to student desktops through the Internet.Pros: LearnMate provides meaningful assessment and real-time feedback on student progress.LearnMate provides valuable information to teachers or instructor that enables differentiated teaching methods.LearnMate features unique learning styles which determine individual learning needs of students and adapts teaching methods to fulfill their needs and goals.Cons: My research did not reveal any cons to this system.MoodleMoodle is a type of open source software package under the GNU general public license for conducting online learning course management which provides you a virtual learning environment. It has become very popular among educators around the globe. Many institutions use Moodle to conduct online courses or blended learning. It can run on any machine that runs PHP and support SQL database types. It allows educators to manage and promote learning. Moodle gives many features to educators as discussion forums, Moodle instant messages, online news and announcements, grading, files downloads, online calendars, online quizzes and Wiki.Pros: As an open-source software it is free to download.Great community supports, there are lots of Moodlers in the community who are always ready to solve any problems with the software.There are many plugins and add-ons available for download for free that allow users to customize Moodle to fit their needs and requirements.Cons: Moodle has browser compatibility issues. If you check Moodle on different browsers like Safari, Chrome, Firefox, IE etc. it will have different formatting.Reporting is difficult in Moodle, especially if we want to report on several courses at the same time.The software is updated frequently; however, some plugins and modules which were developed for older verisions may not be compatible with newer versions.Importance of Mobile Devices in e-LearningIPhones, iPads, BlackBerrys and other smart phone devices grow in number day by day. The use of such devices for e-Learning purposes must be taken into account when developing or choosing the platform that best suits the needs of the learning environment. There are many advantages to developing platforms that are compatible with mobile devices.Users can easily access the learning application on their mobile device at any time, even when desktop devices are not available.Users can use their smartphone devices as supportive educational tools and can access articles, essays and other academic items. This ease of access can improve student performance in the classroom without wasting time.Mobile learning can increase the flow of communication between teacher and student. It can encourage shy students to communicate more openly when they are in class.Each student has their own way of getting information through mobile learning they can able to learn according their preferred strategy.Mobile learning can facilitate the student to personalize and enjoy learning in their own way. Through mobile device they can contact with industry experts and read reviews and blogs by field experts.Many students feel shy and hesitant in the class room, but through mobile learning they can openly ask their questions and feel more comfortable in the class room.More and more gadgets are being developed every day to help students with learning difficulties including distance, available time for learning, and disabilities. These gadgets help increase the productivity of the student and help them find a learning style that suits their needs.What is SCORM Compliance and Why is it Important?SCORM is the collection of technical standard and specification for web based eLearning software products. In other words SCORM allows the programmers how to develop software so that it can compatible with other eLearning software. SCORM governs how online learning management system interoperates each other in the way of packaging content and exchanges data at the run time. It is all about creating modules of online training material that can be easily shared across systems. Both SCORM conformant and compliant means that eLearning products developed according SCORM standard or specifications, for claiming the SCORM conformance is to pass the corresponding within the ADL Conformance Test Suite of the corresponding SCORM version.SCORM certified means we can use SCORM published content in any other learning management sites. SCORM allows to interoperability between learning software products and also define how online learning content and learning management system communicate with each other. There are many advantages for using SCORM, some of them are:Interoperability: SCORM, determine how online learning content and learning management system communicate with each other.Reusability: SCORM gives flexibility to incorporate online learning content in various application and contexts.Durability: SCORM keep entire standard and thinks constant, allows redesign, reconfigure and recode the in cost effective manners.Accessibility: the main features of scrum its accessibility. SCORM packaged course easily delivers from one location to another with any installation or reconfiguration.Adaptability: SCORM adaptability enables author to mix and create training course for different group. This features works well for some scenarios, but not for others.In essence, e-Learning platforms are changing the way students, professionals, and educators interact with the educational environment. Understanding the pros and cons of each platform can help educators around the world design tailored learning solutions that fit their budget and environment. This technology is robust and constantly changing to meet the demands of students and educators world-wide. As I demonstrated through this blog, there are benefits and drawbacks with every learning platform so it is important that students and educators research each platform carefully to ensure the platform suits their purposes without causing too many problems for students and faculty. ",
            "date": "Answered June 27, 2015",
            "views": "117",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chetan Mhatre",
                    "user_href": "/profile/Chetan-Mhatre-10"
                },
                {
                    "user_id": "Avi K",
                    "user_href": "/profile/Avi-K-62"
                },
                {
                    "user_id": "Aady Aadil",
                    "user_href": "/profile/Aady-Aadil"
                },
                {
                    "user_id": "Ashmodhrav Vaswani",
                    "user_href": "/profile/Ashmodhrav-Vaswani-3"
                },
                {
                    "user_id": "Ashmodhrav Vaswani",
                    "user_href": "/profile/Ashmodhrav-Vaswani"
                },
                {
                    "user_id": "Luciana Viter",
                    "user_href": "/profile/Luciana-Viter"
                }
            ]
        },
        {
            "author_info": {
                "name": "Welgim Porter",
                "href": "/profile/Welgim-Porter"
            },
            "answer_text": "Whether you’re five or ninety five, the internet has a lot to offer. Particularly when the topic is education, the resources on the internet are endless. Best of all, many high quality sites are completely free. From history to coding, excellent free online education awaits on the following 25 sites. 1. Coursera  Coursera is a website that partners with universities and organizations around the world. This brings a wide variety of topics and perspectives to one searchable database. Coursera is a powerful tool for free online education, and includes courses from many top universities, museums and trusts. This gives the site an extremely wide range of in-depth courses. Coursera is extremely useful if you’re looking to study many different topics, or want courses from different schools and groups. 2. Khan Academy  Partnering with many post secondary schools, Khan Academy offers a useable, well organized interface. Also curating many courses from around the web, Khan Academy offers impressive depth on many different subjects. Among the more well known educational sites, Khan Academy is also incredibly useable, which may make it easier to keep learning goals. 3. Open Culture Online Courses  If you are struggling to find exactly the material you are looking for, try Open Culture’s listing of free online education courses. The page highlights 1000 lectures, videos and podcasts from universities around the world. The site features a lot of material found only on universities private sites, all in easy to browse categories. This means you can find hundreds of university courses, without having to visit and search each university’s own site. Open Culture’s list features courses from England, Australia, Wales and many state universities around the United States. A very helpful resource for finding many courses in one area of study. 4. Udemy  Udemy’s free courses are similar in concept to Coursera’s but additionally allows users to build custom courses from lessons. Working with many top professors and schools, the site mixes the customizable platform of other sites with a heavy emphasis on top quality content. This is another site however, that mixes free and paid content. 5. Academic Earth  Another site with courses from many different schools is Academic Earth. Much like the three sites above, Academic Earth brings together top notch courses from many different sources, and focuses on offering a wide variety of subjects. Academic Earth lists courses by subject and school, so it might be easier to find what you’re looking for. 6. edX  Another great option for free online education is edX. Also bringing together courses from many different schools, the site has impressive, quality information for everyone. edX covers a great range of topics. 7. Alison  Unlike the previous sites on this lists, Alison is a free education site offering certification in some areas. Alison offers courses mainly in business, technology, and health, but also includes language learning courses. It’s a great option if users need certification for their learning as Alison also offers school curriculum courses. 8. iTunesU Free Courses  A very convenient place for free online education is iTunesU, because it integrates seamlessly with your iPod, or any app-ready Apple mobile device. On iPad, iPhone, or iPod touch, users download the iTunesU app. Desktop users can access iTunesU on the upper right hand corner of the iTunes Store. iTunesU is also convenient because the store is categorized much like iTunes. Users can search learning materials in many different ways, including genre and topic. However, courses are often a mix of free podcasts or videos, and paid content. ITunesU does include courses on a pretty wide scope of topics, but does not integrate with Android, Google or Windows mobile devices. 9. Stanford Online  Your hub for all the online offerings from Stanford University, Stanford Online offers self-paced and session based courses. While Coursera features some courses from Stanford, many classes are only available via other hosts. Some courses require iTunes, but most are completed in your web browser. 10. Harvard Extension  Like Stanford Online, Harvard Extension features free online education courses from Harvard only. This is another excellent source for top notch course material, though the course variety is less rich than multi-school sites. Additionally, Harvard Extension allows you to search for courses by professional certificate. This makes it much easier if your online education goal includes certification. ",
            "date": "Answered July 7, 2020",
            "views": "2",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Chetan Mhatre",
                    "user_href": "/profile/Chetan-Mhatre-10"
                }
            ]
        }
    ]
}