{
    "title": "What is it like to study planetary science? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Brendan Mackey",
                "href": "/profile/Brendan-Mackey"
            },
            "answer_text": "Exciting and depressing. Exciting because we do not yet have a Theory of Earth. Therefore, while our ability to observe and model planetary phenomena accelerates, our ability to explain what we observe and to predict future planetary system behaviour remains woefully inadequate. Planetary science, therefore, is in its infancy and there is so much more to be discovered - probably by the emerging generation of researchers. It is also somewhat depressing because the more one understand the nature of planetary dynamics, the less sustainable appears the human endeavour. The Anthropocene may be defined by the magnitude of human actions on Earth geochemistry and energy balance but this does not mean we are in control of anything. All we have done is perturb natural processes and set of positive feedback responses in complex Earth system dynamics that will be felt for millennium. ",
            "date": "Answered July 12, 2014",
            "views": "609",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Matt Johnson",
                    "user_href": "/profile/Matt-Johnson-923"
                },
                {
                    "user_id": "Sanduni Gunawardana",
                    "user_href": "/profile/Sanduni-Gunawardana"
                },
                {
                    "user_id": "Max Karmazin",
                    "user_href": "/profile/Max-Karmazin"
                },
                {
                    "user_id": "Srishti Sharma",
                    "user_href": "/profile/Srishti-Sharma-42"
                },
                {
                    "user_id": "Fatemeh Majd",
                    "user_href": "/profile/Fatemeh-Majd-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Broiles",
                "href": "/profile/Tom-Broiles"
            },
            "answer_text": "Boring with brief periods of extreme excitement. You spend years developing these missions, preparing for the results you might get, and waiting for your spacecraft to reach its target. Then when it gets there, you receive this constant deluge of data and a strong pressure to publish all the exciting things you see before another instrument team scoops you; it is very stressful. However, the data rarely looks like what you expected, and you have to spend a lot of time thinking up a good reason why. Eventually you figure it out, but by then a new problem has developed so there's no time to celebrate. In summary, it's incredibly tiring, confusing, and exciting all at once. I really enjoy my job. ",
            "date": "Updated December 4, 2015",
            "views": "13",
            "upvotes": " View 25 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ravikumar Bhadram",
                    "user_href": "/profile/Ravikumar-Bhadram"
                },
                {
                    "user_id": "Matt Johnson",
                    "user_href": "/profile/Matt-Johnson-923"
                },
                {
                    "user_id": "Jonathon Dobson",
                    "user_href": "/profile/Jonathon-Dobson"
                },
                {
                    "user_id": "Mark Goodwillie",
                    "user_href": "/profile/Mark-Goodwillie"
                },
                {
                    "user_id": "Harsha Jayanthi",
                    "user_href": "/profile/Harsha-Jayanthi-2"
                },
                {
                    "user_id": "Bramhatanu Banerjee",
                    "user_href": "/profile/Bramhatanu-Banerjee"
                },
                {
                    "user_id": "Max Karmazin",
                    "user_href": "/profile/Max-Karmazin"
                },
                {
                    "user_id": "Srishti Sharma",
                    "user_href": "/profile/Srishti-Sharma-42"
                },
                {
                    "user_id": "Vibodh Jadhav",
                    "user_href": "/profile/Vibodh-Jadhav"
                },
                {
                    "user_id": "Fatemeh Majd",
                    "user_href": "/profile/Fatemeh-Majd-1"
                }
            ]
        }
    ]
}