{
    "title": "What is the difference between melting point and freezing point? - Quora",
    "tags": [
        "Freezing Point",
        "Melting Points"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Kaukler",
                "href": "/profile/William-Kaukler"
            },
            "answer_text": "None except melting is when you heat up and freezing when you cool down. Pure materials have a unique temperature that is the same for both. It is properly called an invariant point. To add to the answer for clarity, even though I gave the answer already, melting is the addition of heat or energy to a crystalline solid at the melting temperature to drive a solid-liquid interface through the crystal until all crystal structure is changed to liquid and all at the one unique melting temperature for that material. Freezing is crystal growth and it starts off where a cluster of the same molecules or atoms that statistically collected into the crystal structure of the solid phase forms a solid-liquid interface. Then energy or heat is removed from the baby crystal and the liquid around it to cause the solid-liquid interface to move away from the solid and convert liquid to crystal. In other words the crystal grows and does so at the one unique freezing temperature. Funny, but that unique temperature for freezing is the same value of temperature for melting. You can prove that with a glass of water and an ice cube floating in it. Leave the glass out in the room and the ice melts. Put the glass into the freezer and the ice cube grows bigger converting the water to ice. Take the glass with the big ice cube out of the freezer and the ice cube gets smaller. All this time for all those scenarios, the temperature was 0.0 C. If you now want to talk about impure materials or alloys, then there is no more a single melting point or freezing point. Melting or freezing happens over a wide range of temperatures because you have a binary or ternary or higher solution if the temperature is above the melting point which us now a line on a graph instead of a point on that same graph. For perspevtive, most metal commercial alloys have 5 or more alloying elements ehich makes ghem far more comllex than a binary alloy. To go further requires a textbook worth of explanation. The study of crystal growth is what my career was based on so it is not easy to explain more for Quora. ",
            "date": "Answered July 22, 2018",
            "views": "28",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arya Bhagwat",
                    "user_href": "/profile/Arya-Bhagwat-1"
                },
                {
                    "user_id": "Kumar Chirra",
                    "user_href": "/profile/Kumar-Chirra"
                },
                {
                    "user_id": "Santanu Pal",
                    "user_href": "/profile/Santanu-Pal-11"
                },
                {
                    "user_id": "Keshav Singh",
                    "user_href": "/profile/Keshav-Singh-124"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Griffin",
                "href": "/profile/Eric-Griffin-50"
            },
            "answer_text": "This seems a simple question but it is actually very important in particular for the behavior of alloys. Freezing point is the temperature where a liquid starts to solidify and melting point is the temperature where a solid begins to liquefy. Now for pure substances (water for example) this is the same temperature but for mixtures (alloys for example) these are two different values. For alloys the formal terms are liquidus and solidus. When different metals are mixed together they form a variety of compounds with different ratios of the pure elements(the formal term is stoichiometry). Each of these compounds will have its own melting/freezing point and those can change depending on the liquid that surrounds the solid portions. It is possible for there to be a large gap between the solidus and liquidus temperatures of an alloy and this presents some problems if you are wanting to make something by casting or welding. While this seems a simple question it really gets down into some core issues of materials science and phase relationships. Many books have been written on this topic and still there is a great deal more to know. Good question! ",
            "date": "Answered December 29, 2017",
            "views": "45",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ekta Chhaila",
                    "user_href": "/profile/Ekta-Chhaila"
                },
                {
                    "user_id": "Edward Willhoft",
                    "user_href": "/profile/Edward-Willhoft"
                },
                {
                    "user_id": "Madison Kim",
                    "user_href": "/profile/Madison-Kim-5"
                },
                {
                    "user_id": "Hrithick Sundar",
                    "user_href": "/profile/Hrithick-Sundar"
                }
            ]
        }
    ]
}