{
    "title": "What are the strongest critiques of the 'Black Lives Matter' movement? - Quora",
    "tags": [
        "Critiques",
        "Black Lives Matter (movement)",
        "Sociology of Everyday Life",
        "Protests",
        "Black People",
        "Race and Ethnicity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ashley Lande",
                "href": "/profile/Ashley-Lande-2"
            },
            "answer_text": "The Lies. If you are black, the odds of you being shot by a police officer are unbelievably small. You are significantly more likely to be killed by a black criminal. Yet when cops shoot said black criminals, the riots ensue. And if you present said rioters (who the left claim are protesters) with evidence that the criminal they’re rioting over was a criminal, it goes from “Justice for X” to “this ain’t about one man. It’s a movement!”. In other words, the members are convinced they can do no wrong, even if a specific protest is based on a false narrativeThey are violent. They just are. Not blacks. Not all BLM protesters. But after watching the protests here’s how they tend to go. The start of the protest is multi ethnic and multi generational. From young white millennials to black pensioners, local congressmen, students, workers, etc. Then as the night goes on, the crowd transforms to almost exclusively under 30 year old blacks and only blacks. Then the crowd changes from “no justice, no peace” and “black lives matter” to “burn that shit down!” and “yo they beating up all the white people!”.The fact that the protests are blatantly anti police, yet because it comes in the wake of a shooting, you get shut down if you say so. A friend of mine (a black friend) used to be in BLM. Used to go on the protests after killings and call for body cameras and trials…which she still does. But she got scared. Why? Because if you hung around long enough, you’d see the crowd transformation I talked about in point 2. Black youths (usually unemployed) start to show up. They bring switchblades, pocket knives, the makings of a Molotov cocktail and the occasional gun. She didn’t like that. She stuck around for one that saw riot police coming in during the riot to have bricks and such thrown at them, the occasional Molotov being thrown. Cars were being pushed on their side or vandalised, people were breaking into stores and stealing TVs, DVD players, Xboxes (no books obviously). How was this helping anything? This isn’t about racial justice, it’s about opportunism. “Well, those people clearly aren’t true black lives matter supporters” you say. Yeah they are. Don’t fool yourself, they absolutely are. They showed up for the protest but stuck around and looked to make a buck from the problems.Black Lives Matter attacking white people. Now, if I recall this particular “protest” as liberals call it was started after a black police officer shot a black armed suspect as he pointed his gun at the officer. This is not a rarity for a BLM “protest”. Chief Flynn after Nov. 6 police commission meeting This is a sane person providing a pretty good analysis of the whole “black injustice” thing. I don’t have the stats here but if I recall the breakdown of black killing victims are something like 90% blacks killed by blacks, 6% blacks killed by cops and 4% by whites, but I’m sure I’m off there. That’s a rough breakdown of it. What I want to know is how a group that calls itself Black Lives Matter has chosen to focus on the 6% of black shooting victims of police rather than the 90% of blacks shot by other blacks. It seems to me that if black lives mattered, surely 90 black lives are more important than 6. This is not to say you should ignore those 6, but at least include the other 90! When asked, BLM give some weak response like “oh we’ve protested inner city crime before”. Yet they protest the people whose job it is to stop inner city crime. It’s a messed up organisation/movement and this is without touching on the whole socialist policies their leaders advocate for ",
            "date": "Answered January 5, 2018",
            "views": "164",
            "upvotes": " View 339 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sarah Yue",
                    "user_href": "/profile/Sarah-Yue-4"
                },
                {
                    "user_id": "Sabrina Henry",
                    "user_href": "/profile/Sabrina-Henry-37"
                },
                {
                    "user_id": "Kathryn Fitch",
                    "user_href": "/profile/Kathryn-Fitch-4"
                },
                {
                    "user_id": "Diana Rose",
                    "user_href": "/profile/Diana-Rose-249"
                },
                {
                    "user_id": "Ilya Zhitomirskiy",
                    "user_href": "/profile/Ilya-Zhitomirskiy-2"
                },
                {
                    "user_id": "Craig Bowes",
                    "user_href": "/profile/Craig-Bowes-1"
                },
                {
                    "user_id": "Diane Riley",
                    "user_href": "/profile/Diane-Riley-11"
                },
                {
                    "user_id": "Jaan Kurtulan",
                    "user_href": "/profile/Jaan-Kurtulan"
                },
                {
                    "user_id": "Kimberlie Colson",
                    "user_href": "/profile/Kimberlie-Colson"
                },
                {
                    "user_id": "Adam Pasaribu",
                    "user_href": "/profile/Adam-Pasaribu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chukwuemeka Onyimadu",
                "href": "/profile/Chukwuemeka-Onyimadu-2"
            },
            "answer_text": "I have one critique of the black lives matter movement. It is in my view the only legitimate critic of the movement. If there was a “white lives matter” movement, or an “Asian lives matter” or “fathers matter”, or “ blah blah blah matters” movement, it would still be the same objection I would have. I object to the assumptions that are implied in crying black lives matter: that Blacks are under a unique threat.People in general act as if black lives don't matter.My only critique of the black lives matter movement is that it is based on a false premise. Are black lives under a unique threat? The numbers indicate that blacks are victims of homicide more frequently than people from other races.  This data seems to justify the necessity of the black lives matter movement. Afterall, if there are more blacks killed than people of any other race, it means there is a problem. By that logic, a “male lives matter movement” is justified. I doubt anyone would look at the data and believe there should be protests over the disparity in homicide victims between the sexes. Furthermore, most blacks who are homicide victims are killed by other blacks. Of the 2925 blacks murdered in 2018, 2600 (almost 90%) of them were committed by other blacks. The black lives matter movement not only avoids such discussions, but sees the mention of black on black crime as disingenuous, and a distraction from the main issue. Hence, despite the numbers indicating that the major threat to black lives comes from other blacks, the movement focuses on the 10% of cases when a black is killed by people of other races. The movement seems to be a black lives matter when taken by other races movement. Even if you think the major issue is inter racial killings. You'll expect, given the data that there would be a “white lives matter” or “Latino lives matter” movement. The number of whites killed by blacks (514) is more than double the number of blacks killed by whites (234). You can find the data for inter racial killings here. I do not believe the disparity in numbers is because whites are under a unique, racially motivated threat. However, the black lives matter movement is based on the assumption that that blacks are under a unique racially motivated threat. The data doesn't support that assumption. When you consider the rate of police killings of civilians, a disproportionate number of blacks are killed.   First, if the mere existence of a disparity justifies the need for a black lives matter movement, a “male lives matter” movement is warranted too. It should be obvious that there are more variables than just race that need to be considered.  I don't think anyone would jump to the conclusion that because the police kills far more men than women, the killings are motivated by gender, yet there are many that jump to those kind of conclusions with regards to race. There are studies that indicate that there is no racial bias involved in a cop’s decision to pull the trigger. At least four careful studies have done this—one by Harvard economist Roland Fryer, one by a group of public-health researchers, one by economist Sendhil Mullainathan, and one by David Johnson, et al. Not only is the central claim of the black lives matter movement —that racist cops target blacks —false, the claim is usually extrapolated to other parts of society. Many in the black lives movement would not object to the claim that: cops target blacks, this shows that America is racist. The claim about racist cops isn't true, and the conclusion that the country is racist is not supported. Do people act as if black lives don't matter? I think its obvious that society at large doesn't act as if black lives don't matter. People are generally more outraged by the brutal death of a black man than for the death of a white man. There is more media coverage when a black person is killed. Its more likely that you can name more black people who have been killed by cops than white people who have been killed by cops. Most news outlet spend more time covering stories involving a cop killing an unarmed black person than they spend for an unarmed white person. This proves that the black lives matter movement is based on a false narrative, that people act as if black lives don't matter. Coleman Hughes gives some stories that drive home the point. Each story in this paragraph involves a police officer killing an unarmed white person. (To demonstrate how commonly this happens, I have taken all of them from a single year, 2015, chosen at random). Timothy Smith was killed by a police officer who mistakenly thought he was reaching into his waistband to grab a gun; the shooting was ruled justified. William Lemmon was killed after he allegedly failed to show his hands upon request; the shooting was ruled justified. Ryan Bolinger was shot dead by a cop who said he was moving strangely and walking toward her; the shooting was ruled justified. Derek Cruice was shot in the face after he opened the door for police officers serving a warrant for a drug arrest; the cops recovered marijuana from the property, and the shooting was ruled justified. Daniel Elrod robbed a dollar store, and, when confronted by police, allegedly failed to raise his hands upon request (though his widow, who witnessed the event, insists otherwise); he was shot dead. No criminal charges were filed. Ralph Willis was shot dead when officers mistakenly thought that he was reaching for a gun. David Cassick was shot twice in the back by a police officer while lying face down on the ground. Six-year-old Jeremy Mardis was killed by a police officer while sitting in the passenger seat of a car; the officer’s intended target was Jeremy’s father, who was sitting in the driver’s seat with his hands raised out the window. Autumn Steele was shot dead when a police officer, startled by her German shepherd, immediately fired his weapon at the animal, catching her in the crossfire. Shortly after he killed her, bodycam footage revealed the officer’s despair: “I’m f------ going to prison,” he says. The officer was not disciplined. For every black person killed by the police, there is at least one white person (usually many) killed in a similar way. The day before cops in Louisville barged into Breonna Taylor’s home and killed her, cops barged into the home of a white man named Duncan Lemp, killed him, and wounded his girlfriend (who was sleeping beside him). Even George Floyd, whose death was particularly brutal, has a white counterpart: Tony Timpa. Timpa was killed in 2016 by a Dallas police officer who used his knee to pin Timpa to the ground (face down) for 13 minutes. In the video, you can hear Timpa whimpering and begging to be let go. After he lets out his final breaths, the officers begin cracking jokes about him. Criminal charges initially brought against them were later dropped. None of these victims led to protests. They received less media coverage and chances are you don't know most of there names. On the other hand, stories of blacks killed by police spark a lot of outrage. There is a lot of media coverage. Shirts are printed with the names of the victims. Conclusion There are many policies which would solve the policing problems to a large extent. Ending qualified immunity, demilitarizing the police, ending the war on drugs amongst others. There is no doubt that racism exists. However, the whole black lives movement is based on a series of untruths. ",
            "date": "Updated August 4, 2020",
            "views": "357",
            "upvotes": " View 1.7K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sarah Yue",
                    "user_href": "/profile/Sarah-Yue-4"
                },
                {
                    "user_id": "Peter C Roberts",
                    "user_href": "/profile/Peter-C-Roberts"
                },
                {
                    "user_id": "Jane Xiaojing Guo",
                    "user_href": "/profile/Jane-Xiaojing-Guo"
                },
                {
                    "user_id": "Teresa Hayes",
                    "user_href": "/profile/Teresa-Hayes-1"
                },
                {
                    "user_id": "Ocean Child",
                    "user_href": "/profile/Ocean-Child-5"
                },
                {
                    "user_id": "Dean Cardno",
                    "user_href": "/profile/Dean-Cardno"
                },
                {
                    "user_id": "Ilya Zhitomirskiy",
                    "user_href": "/profile/Ilya-Zhitomirskiy-2"
                },
                {
                    "user_id": "Tarnima Andalib",
                    "user_href": "/profile/Tarnima-Andalib"
                },
                {
                    "user_id": "MJ Seitz",
                    "user_href": "/profile/MJ-Seitz"
                },
                {
                    "user_id": "Raul Perez",
                    "user_href": "/profile/Raul-Perez-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Moore",
                "href": "/profile/David-Moore-408"
            },
            "answer_text": "I am fascinated by the reaction to the Black Lives Matter movement, and after some discussions with very observant friends I’ve realised something quite important about what’s going on. BLM poses a challenge to the entire progressive narrative of our time. Firstly, BLM is an obviously valid movement. It began as a very simple public indication of racial persecution. There’s no valid criticism of that. Black people have suffered injustice, continue to do so, and that ought to be appreciated and corrected. However, there is a sting in the tail… Black Lives Matter necessarily invokes identity politics, and this is where the modern social narrative begins to crumble under the weight of the BLM’s claims on justice. Black people are defining themselves in contrast to other people and refusing to have that identity degraded. BLM says to white guys like me ‘you are not us, you cannot be us, and you do not speak for us’ - and they are right. But such claims are hardly acceptable in this day and age. Imagine if someone of exclusively Caucasian physical characteristics were to declare that they identified as black? Imagine what the reaction from the Black Community would be if someone decided they were going to live as a black person because that’s who they are and any opposition to that is trans-racio-phobic? What’s wrong with people of ‘other races’ becoming what they know themselves to be? How dare cis-racial communities be so exclusivist and ignorant such that they deny the fact that ‘race’ and ‘culture’ is entirely equivalent to ‘sex’ and ‘gender’? What is ‘race’? What is ‘blackness’? In what way do they differ from the chromosomal kaleidoscope and spectrum of human physical existence that we have already transcended and fluidly traverse in judgement-free power? Why should any person be saddled with their ‘birth race’, and refused recognition by those who just so happen to have the segregational social power to declare who is and who isn’t something because they were apportioned certain physical phenotypes without any intention being involved? Hence, ‘‘All lives matter”, because the assertion that ‘Black’ lives are somehow different in a way that is exclusively defined and defended from ideological incursion is antithetical to the progress of western social norms and serves as a stark reminder that identity is something that is not merely an individual matter but a corporate one. ‘‘All lives matter” (whilst superficially serving as a self-evident and egalitarian statement) is ironically acting as a sort of silencer of black pride and the pain that is associated with it. Blackface is becoming illegal in a world where Drag is celebrated. The resilience and resistance of a community to the efforts of outsiders to force them to conform to conditions defined by that out-group is undermining all sorts of efforts by all sorts of other movements to dissolve boundaries and remove distinctions. Black Lives Matter is drawing lines of contrast that modern cosmopolitans have long been uncomfortable with. In a moment of righteous anger they have rebelled against something even bigger than race relations, and no mechanisms of amelioration exist that do not threaten the interests of others. Black Lives Matter has dared to say who is who and what is what. Black Lives Matter, in the name of equality and cohesion, has violated the new sacred code of non-resistance. Black Lives Matter have refused to let others take what belongs to them - their identity - and redefine it in a way that renders all lives equally individual and thereby homogeneous. Black Lives Matter has, in pursuit of justice, put a dark stain on the rainbow tapestry of today’s progressive ideals. Oh, the irony. What shall we do, when ‘they’ are not ‘us’ and boundaries are being built rather than blurred?  Hence, blackness is what everything else determines it to be edit: in no way is this article intended to be ‘x-phobic’. It is making the point that the ‘-phobic’ terminology itself emerged from certain groups defining themselves exclusively. If anything, everyone is ‘‘xenophobic”, sheerly by virtue of the fact of conflict. People want people to have ‘‘common sense”, but we all want to decide what that is. As a friend of mine, one of the most tolerant and peacemaking people I know once said: “I oppose only those who oppose others”. Later I believe he saw the infinite irony of the statement. ",
            "date": "Answered June 28, 2020",
            "views": "161",
            "upvotes": " View 256 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Furlong",
                    "user_href": "/profile/Michael-Furlong-10"
                },
                {
                    "user_id": "Norman Boeck",
                    "user_href": "/profile/Norman-Boeck"
                },
                {
                    "user_id": "Bob Costello",
                    "user_href": "/profile/Bob-Costello-1"
                },
                {
                    "user_id": "Jean Barnard",
                    "user_href": "/profile/Jean-Barnard"
                },
                {
                    "user_id": "Larissa Makeeva",
                    "user_href": "/profile/Larissa-Makeeva"
                },
                {
                    "user_id": "Terry Cole",
                    "user_href": "/profile/Terry-Cole-143"
                },
                {
                    "user_id": "JP",
                    "user_href": "/profile/JP-1222"
                },
                {
                    "user_id": "Sarah Yue",
                    "user_href": "/profile/Sarah-Yue-4"
                },
                {
                    "user_id": "Dave Douma",
                    "user_href": "/profile/Dave-Douma"
                },
                {
                    "user_id": "Mike Dannatt",
                    "user_href": "/profile/Mike-Dannatt"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kelechi Asika",
                "href": "/profile/Kelechi-Asika-1"
            },
            "answer_text": "I have a lot of things to say about Black Lives Matter, so I’ll just cut right to the chase. Here are some of my critiques regarding the movement: Hypocrisy = my biggest pet peeve about BLM. If you’re White, Native, Asian or Hispanic/Latino and you kill you a black person there will be outcry, riots, protests, mass media coverage, social media posts and great speeches from professional race baiters e.g. Maxine Waters, Don Lemon and Al Sharpton. In a nutshell, there will be a backlash. But where’s that same anger and rage when a black person kills another black person? The silence from BLM whenever there’s black-on-black crime is deafening. The same can be said for Planned Parenthood, black babies are aborted at rates higher than any other racial group. In fact, almost 20 million black babies have been killed since Roe v. Wade (1973), and black women make up only about 13% of the female population yet at the same time 35.6% of all abortions in the U.S. are performed on black women. So again, I ask … where is the noise from BLM activists?Black Abortions by the Numbers Poor role models = if you’re against violence then fine but please don’t use people like Linda Sarsour and Snoop Dogg as role models of your movement. This is the same Linda Sarsour who tweeted this not too long ago: … and this is the same Snoop Dogg who spent years glorifying crime and violence in the black community and only recently made a video of himself doing this:  Looking up to these sort of people means that your movement automatically loses all credibility. Internal racism = this also drives me up the wall with BLM. Their members are mostly black liberals and they have shown nothing but contempt towards black conservatives, who have been referred to as “coons”, “Uncle Toms, “coconuts”, “house negro”, “sellout”, the lot. Thomas Sowell, Ben Carson, Stacey Dash, Omarosa Manigault and Sheriff David Clarke are examples of people who have been treated with such vitriol. This is racism, period. The new feminism = I called it ages ago. BLM is the new feminism, it began with good intentions but the movement allowed itself to get hijacked by bigots and eventually become a hateful, divisive group. Going around saying things like “What do we want? Dead cops! When do we want it? Now!” threatening white people with violence and beating them up simply because they’re white and coming up with asinine demands for white people like them giving up their homes for black people is doing little to further their cause.Poor tactics = Protesting and raising awareness on social media are good but will only take you so far, there has to be some sort of follow up after that … but it seems as though the BLM leaders don’t have a Scooby’s on what to do afterwards and more often than not, they go back to square one. A movement without any real tactics or strategies is doomed for failure.",
            "date": "Updated April 9, 2018",
            "views": "141",
            "upvotes": " View 859 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gaming Senpai",
                    "user_href": "/profile/Gaming-Senpai"
                },
                {
                    "user_id": "Michael Lindo",
                    "user_href": "/profile/Michael-Lindo-9"
                },
                {
                    "user_id": "Jaan Kurtulan",
                    "user_href": "/profile/Jaan-Kurtulan"
                },
                {
                    "user_id": "Kimberlie Colson",
                    "user_href": "/profile/Kimberlie-Colson"
                },
                {
                    "user_id": "Edwin Ames",
                    "user_href": "/profile/Edwin-Ames"
                },
                {
                    "user_id": "Allan Glass",
                    "user_href": "/profile/Allan-Glass-1"
                },
                {
                    "user_id": "Amanda Johnson",
                    "user_href": "/profile/Amanda-Johnson-1485"
                },
                {
                    "user_id": "Jaejin Choi",
                    "user_href": "/profile/Jaejin-Choi-2"
                },
                {
                    "user_id": "Soma Chakraborty",
                    "user_href": "/profile/Soma-Chakraborty-171"
                },
                {
                    "user_id": "Kevin Chen",
                    "user_href": "/profile/Kevin-Chen-1253"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Mead",
                "href": "/profile/Brian-Mead-5"
            },
            "answer_text": "Hooooooh boy, I can already see the ‘you’re a racist’ comments and BNBR violations coming by the truckload, but I’ll bite. Just lemme grab something I posted elsewhere… Their protest do more often than not turn violent.There isn’t data on how often violence happens with BLM. But at the biggest ones, Fergusson and Baltimore, things got really bad. At my college, people got assaulted for not participating or for disagreeing. Students got put on suspensions and had charges filed. I saw these people up close and they could not have left a worse impression. 2. BLM presents a false narrative. 90%+ of black homicide deaths are done by other blacks, and that’s inlcuding all the unknown assailant races as nonblack. Out of the 5–6k/yr, black people who die by homicide, only about 400–500 die by cop gunfire. Anticipating a busy year for cops and a slow year for homicides, the cop kill count barely cracks 10% at MOST. Where are the marches against the gangs and the hoodlums? Where are the demands to make that madness stop? Why aren’t they crucifying gangstas in public opinion? Why aren’t they DEMANDING crackdowns on those? 3. BLM uses terrorist playbook and methods. Cries of “No justice, no peace” don’t help matters, because it sounds a lot like threats of violence and rioting — ‘to hell with civilized society, give us what we want or blocks will burn’, and more than once, they have. Terrorism can be defined as using fear to force political outcomes, then that is terrorism. 4. BLM deals horribly with allies In the way it treats the idea that all lives matter, well, according to Black Lives Matter, saying that is racist. Unironically. That is a splendid way to come off as stupid. I know exactly what they mean, that some people who are claiming all lives matter to take away from the distinctly black aspects of racialized violence in the USA, but a better handling would be “all lives, even black lives, have value” instead of shouting down all who disagree or attempt to elaborate as racists. And in their manifesto, they seem to make a point of calling anything that isn’t about them or in support of them as ultimately being white supremacy. Not even joking. That’s the with or against fallacy at work, and it is scary what people do with that kind of thinking. When most people say all lives matter, it’s not to detract from the value of black lives, but as more a “well duh of couse they matter”. And try telling them that blue lives matter (fun fact: ~20% of all cops are black despite blacks being 15% of the US population), and you’ll get some pretty amazing rage. 5. The way they deal with law enforcement issues makes things worse. It is the fact that police officers have been murdered by supporters and sympathizers of BLM, to my knowldge, all the perpetrators have been black. This is only going to make relationship WORSE, because now the cops really do have reasons to be fearful of people, especially black people. Their thinking is the last times they weren’t hyperreactive and on edge, people were murdered and cities were burned. Like hell they’re going to play nicer now. And in trying to appease BLM, they pulled back and crime exploded. This has ironically lead to the destruction of more black lives, mostly by other black people. Way to go! 6. BLM picks the worst people to get up in arms over. It also does not at all help that the people they choose to stand for after their slayings are some of the very worst possible choices. Michael Brown? Robber who picked a fight resulting in suicide by stupidity via cop. Freddy Grey? Thug with a rap sheet a mile long who killed himself trying to get hurt enough on purpose to sue Baltimore. The guy who got shot around the paramedics? Wife beater who, again, picked a fight first with her, then with the paramedics who got called, and then with the cops who got called. Play stupid games, win stupid prizes. Nearly every single day, black children, innocent ones, are killed by stray gang gunfire. Where the fuck are the rallies for them? Where the fuck are the protests? Where the fuck are the cries for justice and sanity? Oh wait, they were killed by black non cops, so their deaths really don’t matter. 7. Their premise and ideology really is kinda racist. Lastly, imagine an organization called White Lives Matter, and what they do is protest where white people have been slain by people of color and call for an end to the targeting of whites. That would be called racist, and rightly so. I know why Black Lives Matter isn’t really racist due to the power dynamics which necessitate things like it, but it does have more than a few aspects that rub people the very wrong way. Black Lives Matter has a noble goal which they insist on pursuing in the worst possible ways. And those are my issues with Black Lives Matter. ",
            "date": "Updated January 11, 2018",
            "views": "631",
            "upvotes": " View 2.1K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Annabelle Brooks",
                    "user_href": "/profile/Annabelle-Brooks-7"
                },
                {
                    "user_id": "Teresa Hayes",
                    "user_href": "/profile/Teresa-Hayes-1"
                },
                {
                    "user_id": "Sabrina Henry",
                    "user_href": "/profile/Sabrina-Henry-37"
                },
                {
                    "user_id": "Ilya Zhitomirskiy",
                    "user_href": "/profile/Ilya-Zhitomirskiy-2"
                },
                {
                    "user_id": "Sushant Parab",
                    "user_href": "/profile/Sushant-Parab-4"
                },
                {
                    "user_id": "Cheek Clappin Back Breaker",
                    "user_href": "/profile/Cheek-Clappin-Back-Breaker"
                },
                {
                    "user_id": "Stan Abramski",
                    "user_href": "/profile/Stan-Abramski"
                },
                {
                    "user_id": "Malta Saldana",
                    "user_href": "/profile/Malta-Saldana"
                },
                {
                    "user_id": "Mia Garrett",
                    "user_href": "/profile/Mia-Garrett-18"
                },
                {
                    "user_id": "Jonathan Ross",
                    "user_href": "/profile/Jonathan-Ross-250"
                }
            ]
        },
        {
            "author_info": {
                "name": "Geo Murphy",
                "href": "/profile/Geo-Murphy-1"
            },
            "answer_text": "Wow! This is insane. I find it odd that the same issues that citizens of the United States of America that are classified as Black/African American have had since the inception of the US are the same complaints I hear in this thread by non-Black Americans. This actually proves the point of why the BLM movement exists and able to manipulate the collective. Where is all this backlash to get justice for the murder 17 year old Trayvon Martin and prosecute George Zimmerman? The murder of the 12 year old Tamir Rice and prosecute Timothy Loehmann? Hello!!! I cant hear you?!!! I really don't think European/Caucasian Americans and immigrants want to deflect and use so called \"black on black crime\" as the statistic to justify the slaying of BLM. If European/Caucasian Americans and immigrants were so concerned why aren't they in impoverished black communities and churches assisting with these issues? The impoverished Black community has been asking for help dealing with the drug problem since the 1980's and many groups have been established to stop the bs. Locking up a bunch of 12-18 year old corner boys doesn't solve the problem. The problem must be resolved from the source, what wealthy person is pushing the drugs into impoverised communities for these kids to fight for the pennies after wholesale? Matter of fact let's go to each dormitory on every Ivy League campus and see what drugs we find? I bet you'd find more drugs there than any street corner and 30% of the students would get locked up. Who's ready to test this theory? Hahaha! Crickets?!?! See, thats why it's best for European/Caucasian Americans and immigrants to STFU and listen this go-round. Non-Black people have dictated the lives of Black Americans for long enough and the government of the United States of America owes it to it's Black citizens since it's laws are what's crippled the wealth in the Black American community. It's disrepectful for non-Black Americans to open their mouths and dictate at this time. The very reason any immigrant or even Caucasion of non-British/Spanish decent is in the United States is because of the table that was built and milk and honey put on it by the work, intelligence, and skill of the American Black labor force that was never paid for their efforts. Women and Gays even owe it to American Blacks for being on the forefront of the fight to enact the Civil Rights act where the biggest beneficiaries of it are European/Caucasian women - smdh! European/Caucasian Americans and immigrants have received loans and access to capital to build businesses and own land since 1865. American Blacks were asked to lift themselves up by their bootstrap in which they did. American Blacks built some of the finest communities this side of heaven where they had the least crime and highest marriage rates between 1865 - 1965. American Blacks were hit again in the late 1960's once their communities were riddled with drugs that flowed from the caskets of dead soldiers that fought in Vietnam; and another influx from the caravans of immigrants that flowed into the US after the Civil Rights Act. American Blacks lost wealth in the 1970s as their communities were either redlined or turned into interstates for \"white flighters\" to have easy access to their jobs and entertainment in the city. So-called, \"Black on Black crime\" is a poverty problem created by the influx of drugs into impoverised black communities. You all need to understand history before running your mouth all willy nilly. Who's onboard to lockup the white collar criminals who's pumping this stuff in? If you are not about getting to the root of the problem STFU so you can hear the 400 year cries of American Blacks who's supported every other group in the US without very little support. This isn't a cry for help either since there's a middle to upper class group of Black America who are invisible to the collective yet prospered throughout the madness with no handouts. This is info for other groups to stop muddying the waters so American Blacks can take up their beef with state and federal governments who has added hurdles to their livelihood. If you dont like it, go back to your country of origin to field your complaints. Their weak ways are the reason people had to migrate for more oppurtunity in a land that was staged by American Blacks. Also, contrary to the history taught in the open, American Blacks are the longest standing settlers on the continental United States land, since 1526 when the first Blacks arrived, burned down the Spanish colony (San Miguel de Gualdape) and settled in with the natives. Stop with the deflection so we're able to listen, learn, love and protect each other. ",
            "date": "Updated August 7, 2020",
            "views": "1",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sarah Yue",
                    "user_href": "/profile/Sarah-Yue-4"
                },
                {
                    "user_id": "Teresa Hayes",
                    "user_href": "/profile/Teresa-Hayes-1"
                },
                {
                    "user_id": "Sabrina Henry",
                    "user_href": "/profile/Sabrina-Henry-37"
                },
                {
                    "user_id": "Richard Smyth",
                    "user_href": "/profile/Richard-Smyth-5"
                },
                {
                    "user_id": "Peter Kucera",
                    "user_href": "/profile/Peter-Kucera-3"
                },
                {
                    "user_id": "Audrey Rose",
                    "user_href": "/profile/Audrey-Rose-172"
                },
                {
                    "user_id": "Tiggy Brunswick",
                    "user_href": "/profile/Tiggy-Brunswick"
                },
                {
                    "user_id": "Jim Bradbury",
                    "user_href": "/profile/Jim-Bradbury-2"
                },
                {
                    "user_id": "E. Sinsel",
                    "user_href": "/profile/E-Sinsel"
                },
                {
                    "user_id": "Claire Chase",
                    "user_href": "/profile/Claire-Chase-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Bates",
                "href": "/profile/Matthew-Bates-27"
            },
            "answer_text": "I’ll add my two cents. Imagine that someone just woke up from being in a coma for the last five years, and on their ride home, they asked why so many people were saying that black lives don’t matter. When asked, they say that they’ve arrived at that conclusion, because so many people (around here at least) have put signs in their windows saying: Black Lives Matter. The messaging implies that there is some large, powerful group of people who think the opposite... that black lives don’t matter. There isn’t.* There are a few crazies and internet trolls who think that while behind the anonymity of the screen and keyboard. Those people have been able to make their numbers seem inflated thanks to the way the internet and the media work, but they’re still a really, really small, powerless group. According to the Anti-Defamation League, there are around 3,000 members of the most famous racist group, the KKK. Three thousand people in a country of more than 350,000,000. Three thousand people with little to no power in the real world, confined mostly to very rural areas, whose biggest accomplishments as far as helping their organization usually involve printing racist fliers and leaving them in people’s mailboxes. My oldest daughter wanted to put a BLM poster in our window. I told her to go for it, and put a “World Is Round” poster up, too, since she’s making posters that state the obvious, because a handful of crazies with internet access think the opposite. I wouldn’t be surprised if the BLM movement has actually led to an increase in enrollment in anti-black racist organizations. Signs like this actually remind people that the KKK exists. It’s like free advertising for them:  The best way to get rid of organized racist groups, in the modern era at least, is to treat them as what they are: small and relatively inconsequential. Acting like they’re this looming menace over society just gives them what they want: unearned importance. But I’m probably missing the whole point. I’ve been accused of that a lot in the last few years. *Unless you really want to wade into the political thickets and bring up abortion, Planned Parenthood and its founder, and racial statistics when it comes to abortions. ",
            "date": "Answered July 13, 2020",
            "views": "586",
            "upvotes": " View 2.9K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Fern",
                    "user_href": "/profile/Fern-14"
                },
                {
                    "user_id": "Kaisha Adams",
                    "user_href": "/profile/Kaisha-Adams"
                },
                {
                    "user_id": "Julie Cartee",
                    "user_href": "/profile/Julie-Cartee"
                },
                {
                    "user_id": "Michel Green",
                    "user_href": "/profile/Michel-Green-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Flippo",
                "href": "/profile/Andrew-Flippo-1"
            },
            "answer_text": "Getting right to it. I know my opinion doesn’t matter because I’m white and male and hence, have no rights to an opinion of a different race. However, when you directly affect my life, I gain that right. There are a lot of reasons the movement doesn’t work for many but I will only point to one since others have already answered good points. Tactics This is the biggest ‘shake my head’ moment. The idea behind every movement is to gather support from the masses. The masses are where the weight of the anger starts making progress. Yet, instead they piss off the people they need support from. At least half of the BLM people are unemployed or on some kind of state assistance, either EBT (food stamps) or welfare. So you would think that the people who work in public assistance that supplies them with money would be given a pass on anything that happens that is not related to them…e.g. police shooting. Last week in Sacramento, just as State workers of California got off work and into rush hour, the BLM movement decided to protest the shooting of a criminal by blocking the highway. The people that are WORKING for the those people partaking in BLM are prevented from going home to their families. As someone who was also caught up in the traffic, I can say, fuck you. I didn’t work all day so you can illegally block the highway and prevent me from getting to my family. The police were between the line of cars and the BLM protesters because, if they weren’t, I have little doubt they would have been run over and those who did the running over would have been applauded. This is a terrible tactic for a movement trying to gain support. Don’t piss off the people who you NEED. Each time it happens, more and more people jump off the BLM bandwagon and without the support, the movement will never accomplish what it originally wanted which is a righteous cause. The second piece to it…PICK THE RIGHT PERSON to rally behind. Just because a black person was shot by the cops, doesn’t mean you immediately jump up and start protesting. Pick the innocent man, not the criminal. The Ferguson shooting was stupid. The guy was a criminal AND he attacked the officer. Not a good person to rally behind. Too much support for the cop protecting himself. The cop who shot the black man running away…that angered me. That is where my support was. The man was unarmed and just running. Because you’re too lazy to chase him doesn’t mean you get to shoot him. Rally behind him and you have my support. Pick and choose who to protest for. It has to make sense. Don’t look at it as just black vs white. Recently the Sacramento shooting. The guy was a criminal. He was caught breaking into a truck and maybe a home. When confronted, he ran from the police. When he stopped running he turned to the cops with a black cell phone in hand. In the darkness of the evening, with flashlights the only light, they had to make a decision and based on the footage, the cops really believed he was armed (you can objectively tell by their actions of taking cover). Dont rally behind this idiot. If he wasn’t breaking into property that was not hisIf he immediately surrendered when confrontedIf he didn’t pull out his cell phone when he probably already believed cops are trigger happyThen he would probably be alive today. He made bad decisions because he started off in the wrong. His hands weren’t clean. Don’t rally behind him. The police chief (who is black) immediately provided the footage from the body cams and police helicopter to try and stem the tide of the cops vs black people argument. He went for full transparency but because it didn’t fit into the narrative of cops shooting innocent unarmed black people, BLM still got all riled up by focusing on cops vs blacks instead of cops vs criminals. some blacks are criminals, but not all criminals are black. Take color out of it. I’m all for peaceful protest. Do what you want, but don’t interfere with my rights in your protest or I will fight back just as hard. ",
            "date": "Answered March 28, 2018",
            "views": "29",
            "upvotes": " View 53 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daniel Tousey",
                    "user_href": "/profile/Daniel-Tousey"
                },
                {
                    "user_id": "Nick Barnez",
                    "user_href": "/profile/Nick-Barnez"
                },
                {
                    "user_id": "Sarah Yue",
                    "user_href": "/profile/Sarah-Yue-4"
                },
                {
                    "user_id": "Rishu Verma",
                    "user_href": "/profile/Rishu-Verma-3"
                },
                {
                    "user_id": "Chris Peter",
                    "user_href": "/profile/Chris-Peter-60"
                },
                {
                    "user_id": "Jillian Yates",
                    "user_href": "/profile/Jillian-Yates"
                },
                {
                    "user_id": "Daniel Cho",
                    "user_href": "/profile/Daniel-Cho-101"
                },
                {
                    "user_id": "Noah Rosen",
                    "user_href": "/profile/Noah-Rosen-6"
                },
                {
                    "user_id": "Joseph Muldoon",
                    "user_href": "/profile/Joseph-Muldoon"
                },
                {
                    "user_id": "Fan Tan",
                    "user_href": "/profile/Fan-Tan-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rue Chalen Koegel",
                "href": "/profile/Rue-Chalen-Koegel"
            },
            "answer_text": "So, although others have answered this question very well, I’m going to add another voice to the conversation anyway. Because there’s much more at play here than can been seen on the surface. BLM specifically is combative, exclusive, and reactionary. All these characteristics cause problems, but, more importantly, none are likely to influence any desirable change. The biggest problem with any movement that possesses these characteristics is that, at best, they shine more light on the symptoms of the actual problem than they do on the problem that caused the symptoms. And likewise, participants in the movement often spend a great deal of time and effort working to take action to address those symptoms rather than their cause. The problem is not that any one person or more were killed wrongly by a Police Officer. The problem is how Police Officers operate (not necessarily due to any fault of their own, as individuals). And ultimately that Police Officers exist at all. That’s not to suggest that they don’t provide some valid services, but that by giving them ‘too much’ power they have become something more than what a civilized society needs (a civilized society needn’t be policed); and that they therefore interfere with our societies ability to get on in a civilized manner. Further, the problem that BLM is attempting to address is rooted in prejudice; and prejudices can ultimately not be eradicated. They form as a natural response to a persons ‘perception’ of the world around them. Yes, some are highly irrational and dysfunctional, and some people foolishly fight to protect their right to be prejudice regardless, but ultimately ‘prejudices’ are normal and have purpose. If you can’t eradicate prejudices in general, how do you address them? In regards to the Police, I suggest starting from scratch: replace Police with unarmed, but arms trained, Civil Servants who actually answer to the communities they serve. Don’t give them the powers the Police posses now that make them dangerous. Don’t give them the incentives to hurt rather than help people that the Police have now. And make it easy to identify and replace any of these Civil Servants who insist on harboring dysfunctional prejudices. -They have the right to maintain their prejudices, but they can’t necessarily do the job they’re hired for if they exercise that right. And they don’t have a right to maintain their employment if they can’t do the job they are hired for.- These civil servants could still keep guns in their trunks for ‘special’ occasions. And we could still have SWAT groups in heavily populated or dangerous areas. After all, we have firemen for when there’s a fire right? But firemen don’t run around hosing people down or ‘axing’ them when they get drunk, or when they get in fights with their family members, or when they have mental breakdowns. Use the right tool for the job, as they say. We need trustworthy and skilled people who are hired by the community to help it’s members even when they aren’t aware they need help. We need people who can safely intervene and resolve conflicts between members of our society. We need people who can investigate crimes. We need people who can do a lot of the things that cops do. But we don’t need cowboys/gunslingers. We don’t need uncivilized, or unskilled, and/or easily scared, gun toting maniacs wandering around our streets or highways on the ‘prowl’ for their next victim. Even good cops often take on this persona, the persona of a hunter, seeking out criminals, because that’s often exactly what they are employed to do. So they see everyone as a potential criminal, and as their enemy; and any prejudice they may have will only worsen this uncivilized behavior. Nobody would complain if they were on the streets hunting for the next homeless person they could provide helpful services to (food, a blanket, a smile, a conversation). Nobody would complain if they were targeting old people while looking for opportunities to make unsolicited ‘welfare checks’. Nobody reasonable would complain if they were ‘offering’ people who appeared strung out rides to free rehab clinics… Ultimately, if they were actually out there just looking to properly help each and every person they encountered (even those committing or guilty of crimes), the prejudices they have would likely just help them do their jobs. But when their job is to appear ‘nice’ while treating everyone like a monster, an enemy, the outcome is not going to be civilized. Crimes, even those committed by those in power, are usually just symptoms of deeper problems. And, when this is true, those deeper problems can’t be solved by seeking vengeance against those committing the crimes. Both BLM and the current US Criminal Justice system continue to perpetuate this uncivilized behavior. If you want solutions to your societies problems, look elsewhere. ",
            "date": "Answered January 7, 2018",
            "views": "27",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Teresa Hayes",
                    "user_href": "/profile/Teresa-Hayes-1"
                },
                {
                    "user_id": "Kimberlie Colson",
                    "user_href": "/profile/Kimberlie-Colson"
                },
                {
                    "user_id": "Cheek Clappin Back Breaker",
                    "user_href": "/profile/Cheek-Clappin-Back-Breaker"
                },
                {
                    "user_id": "Sonya Dinky",
                    "user_href": "/profile/Sonya-Dinky"
                },
                {
                    "user_id": "E. Sinsel",
                    "user_href": "/profile/E-Sinsel"
                },
                {
                    "user_id": "Gloria Banks",
                    "user_href": "/profile/Gloria-Banks-7"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Abraham Pereira",
                    "user_href": "/profile/Abraham-Pereira-2"
                },
                {
                    "user_id": "Daniel Boerger",
                    "user_href": "/profile/Daniel-Boerger-1"
                },
                {
                    "user_id": "Mark Urso",
                    "user_href": "/profile/Mark-Urso"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ash Murthy",
                "href": "/profile/Ash-Murthy-1"
            },
            "answer_text": "Recently a San Antonio police officer was killed and three other officers were shot at in unrelated incidents which closely mimic the recent ambush attacks on law enforcement officers in Baston Rogue and Dallas by Black Lives Matter supporters, all in a single day. The vicious cycle of ambushes on police officers and the killings of unarmed black citizens, have led to unprecedented tension between law enforcement and Black Lives Matter activists.   The Black Lives Matter movement, which seeks to prevent the untimely deaths of people of color, has an indisputably noble goal, but do police officers really pose the most serious threat to the lives of African Americans, as we have been led to believe? While statistics on police shootings do reveal that young black men are disproportionately the victims of police shootings, crimes simply do not breakdown on proportionate demographic lines. Blacks constitute only 13% of the population, but they represent a majority of the homicide and robbery arrests. Over the past decade, 40% of those arrested for killing police officers have also been black. Some argue that a disproportionate number of black arrests does not mean that African Americans commit more crime, but is merely a result of living in heavily policed neighborhoods. While this argument has some merit, studies based on anonymously self-reported crime data also find that blacks are disproportionately involved in violent crimes. Given these disturbing disparities, it is unfortunate, but not entirely unreasonable, that African Americans experience a higher likelihood of being killed in a police shooting than a white person. If the mere disproportionate representation of black men as victims of police shootings is indicative of organized racism, why are Asians(adjusted for population) less likely than whites to be shot by police? Surely, no reasonable person would think that the police are more racist to whites than Asians. Undoubtedly there are individual racist officers, like the San Francisco police officer who sent text messages referencing African Americans as “wild animals”. Discrimination against blacks, such as being pulled over more often for traffic stops, does exist, but it is a result of unconscious bias by well meaning officers. As FBI director James Comey pointed out, “The two young black men on one side of the street look like so many others the officer has locked-up. Two white men on the other side of the street—even in the same clothes—do not. And that drives different behavior. The officer turns toward one side of the street and not the other.” Police shootings are a serious problem in our society. According to The Guardian, “In the first 24 days of 2015, police in the US fatally shot more people than police did in England and Wales, combined, over the past 24 years.” What is almost just as troubling as the shootings themselves is that the officers involved even in the most questionable shootings almost always go unpunished. In 2014, a SWAT team that maimed an infant by throwing a flash grenade into an infant’s crib in a drug raid gone wrong did not face any criminal charges. In 2011, Officers Jay Cicinelli and Joseph Wolfe of the Fullerton police department beat a white homeless man to death under the pretext of arresting him. A jury acquitted both of them. Based on what we know so far, the shooting of Philando Castle is beyond senseless. Striving to hold these rogue officers accountable is laudable. But to suggest that every police shooting of a man of color is racist is a great disservice to white victims of police shootings, African Americans and law enforcement officers. Blacks are six times more likely to be victims of homicides. Heather MacDonald, a conservative scholar, points out that 12 percent of white and Hispanic homicide deaths are due to police officers, while only four percent of black homicide deaths are the result of police officers. The lower proportion of black deaths due to police shootings is because most blacksare killed by fellow citizens, overwhelmingly black, and not police officers. To make a serious dent in the mortality rate of young African Americans, we have to answer some very tough questions: Why are blacks so over represented in violent crime, both as offenders and victims? What can we do to address the some of the most serious issues facing the black community, such as poverty, low school graduation rate and single parent homes. The Baltimore Sun reported, “Blood was shed in Baltimore at an unprecedented pace in 2015, with mostly young, black men shot to death in a near-daily crush of violence.” How many of these lives could have been saved had we looked beyond the idea of homicidal racist cops out to kill young African Americans? ",
            "date": "Answered December 23, 2016",
            "views": "23",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kimberlie Colson",
                    "user_href": "/profile/Kimberlie-Colson"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Mark Urso",
                    "user_href": "/profile/Mark-Urso"
                },
                {
                    "user_id": "Katya Nikitina",
                    "user_href": "/profile/Katya-Nikitina"
                },
                {
                    "user_id": "Chris Beach",
                    "user_href": "/profile/Chris-Beach-7"
                },
                {
                    "user_id": "Graham Chidwick",
                    "user_href": "/profile/Graham-Chidwick"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frank Silbermann",
                "href": "/profile/Frank-Silbermann"
            },
            "answer_text": "I would consider their biggest failing to be their frequent reliance on lies. I’m talking about their own belief in lies to pump of their own outrage, their propagation of lies to generate outrage among others, and their use of lies to justify their demands for the punishment of the targets of their protests. I’m not saying that this typifies what they do, but that doing it at all is a huge turn-off for some people who might otherwise be sympathetic. Examples: Their claim that Trayvon Martin was a cute little boy who was hunted and killed merely for daring to walk in a white neighborhood. (It was a mixed neighborhood, some of the neighbors who complained of thefts and break-ins by young black strangers to the neighborhood were themselves black. Evidence not admitted to the trial suggests Martin was a proficient street fighter. Evidence that _was_ submitted strongly suggests that Martin was the one who initiated the use of violence.)The claim that Eric Garner was choked to death. (He wasn’t. He was choked into submission. Then he died of an asthma-induced heart-attack while negligent cops on the scene who didn’t know of his asthma were skeptical of his complaints of inability to breathe.)The claim that Officer Darren Wilson shot Michael Brown in the back while he was fleeing, and then while he had his hands up in surrender.(There may be more to the Freddie Gray case as well, but I don’t know whether the allegations are true: Were Freddie Gray's injuries self-inflicted?)People can fall for lies; I, too, long assumed that the Michael Brown narrative was true, for example. But when falsehoods are discovered, it would seem that the BLM leaders would prefer not to hear of it. (Some of the original claims of abuse are so outrageous, you’d think they’d be glad to hear that things are not that bad.) Another serious critique is that, though the leadership’s official position is that BLM opposes the assassination of random police officers, I’m told that chants and cheers at demonstrations suggest otherwise. (I have not been at their demonstrations, so I have no way of knowing whether these are isolated events or typical of the protests.) A third critique is the overgeneralized nature of their accusations against police. It would be untrue and obnoxious to claim that the typical young black man is a criminal; yet BLM accuses the police as an institution of being racist even though the incidence of racist behavior among police may be no higher than the incidence of crime among young black men. (Yes, we have higher expectations for police than for people in general, but expectations do not change the inappropriateness of prejudice and over-generalization.) ",
            "date": "Answered July 24, 2016",
            "views": "25",
            "upvotes": " View 29 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richard Smyth",
                    "user_href": "/profile/Richard-Smyth-5"
                },
                {
                    "user_id": "Thomas McGuire",
                    "user_href": "/profile/Thomas-McGuire-5"
                },
                {
                    "user_id": "E. Sinsel",
                    "user_href": "/profile/E-Sinsel"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Bob Griscavage",
                    "user_href": "/profile/Bob-Griscavage"
                },
                {
                    "user_id": "Judy Gust",
                    "user_href": "/profile/Judy-Gust-1"
                },
                {
                    "user_id": "Onyemobi Desta Anyiwo",
                    "user_href": "/profile/Onyemobi-Desta-Anyiwo"
                },
                {
                    "user_id": "Leigh Settoon",
                    "user_href": "/profile/Leigh-Settoon"
                },
                {
                    "user_id": "Samuel Soohoo",
                    "user_href": "/profile/Samuel-Soohoo"
                },
                {
                    "user_id": "Aditya",
                    "user_href": "/profile/Aditya-715"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Frederick",
                "href": "/profile/Brian-Frederick-9"
            },
            "answer_text": "The Black Lives Matter movement is about racism; not about black lives. If it were about black lives then the movement would logically focus on areas and situations in which a high proportion of black lives are impacted such as health related issues like obesity, diabetes and heart disease, and crime within predominantly black communities, not on situations in which proportionally much fewer black lives are at risk such as due to wrongful killings by police. The phrase “black lives matter” is a sensationalist implication that black lives are not important to non-black police officers and non-black people, in general. It is intended to stir up emotions and it does that successfully, but, for many, not in a way that garners their support of the movement. The phrase “black lives matter” is offensive to the many who work to protect the lives of those in predominantly black communities (and all communities) such as fire fighters, health care professionals, police officers, government administrators, lawmakers, soldiers and others because (with, admittedly, the exception of a few) they are trying very hard to protect and save the lives of black people (and all people) and some put their own lives at risk in doing so. There are specifically many black police officers who are killed in the line of duty due to violence in predominantly black communities. Their black lives matter, too. And there are many innocent black lives that matter which are lost due to violence in predominantly black communities. In August, 2016 eight year old Gabrielle Hill Carter was accidentally shot and killed in Camden, NJ due to gang (or other) violence. As far as I know, this did not make the national news like the police shootings of black men did nor is there any nationwide movement to stop the kind of violence that caused this innocent young girl’s death.  On the same day that I heard about the murder of this girl I heard more of the recurring news about “black lives matter”. The phrase “black lives matter” which is about racism doesn’t make me think of racism. It makes me think of the many innocent black lives lost due to violence in predominantly black communities. Hearing the sad news about Gabrielle Hill Carter and seeing her picture was upsetting to me and it confirmed my feelings that black lives matter. ",
            "date": "Answered November 21, 2016",
            "views": "31",
            "upvotes": " View 42 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kimberlie Colson",
                    "user_href": "/profile/Kimberlie-Colson"
                },
                {
                    "user_id": "Richard Smyth",
                    "user_href": "/profile/Richard-Smyth-5"
                },
                {
                    "user_id": "E. Sinsel",
                    "user_href": "/profile/E-Sinsel"
                },
                {
                    "user_id": "Christopher Kosel",
                    "user_href": "/profile/Christopher-Kosel"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Carl Jacobson",
                    "user_href": "/profile/Carl-Jacobson-2"
                },
                {
                    "user_id": "Daniel Boerger",
                    "user_href": "/profile/Daniel-Boerger-1"
                },
                {
                    "user_id": "Amanda Combs",
                    "user_href": "/profile/Amanda-Combs-67"
                },
                {
                    "user_id": "Kenny Nguyen",
                    "user_href": "/profile/Kenny-Nguyen-44"
                },
                {
                    "user_id": "Judy Gust",
                    "user_href": "/profile/Judy-Gust-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ron Pleece",
                "href": "/profile/Ron-Pleece"
            },
            "answer_text": "One of my biggest criticisms and I am sure echos throughout the US is the destructive and costly rioting, violence, and aggressive nature, it does more to widen any ethnic or cultural gap that mend it. Sure it brings attention to issues, but the issues are often one sided, unwilling to admit there is only their side. If I were undecided or had racial issues but had not acted upon them, all this that the BLM movement has done would likely push me to the other side. I am sure enlistment into most white supremist groups is at an all time high and likely things will get worse before they get better. My second is the logic in black lives matter pertaining to cops or whites when many more unarmed whites are killed by cops than blacks which is understandable considering whites are 70% of the population and blacks are 13%. Also that blacks at 13% of the population are responsible for 50% of all homicides, this and the fact that 80% of all crimes including homicide are same race crimes. This means that in fact, blacks kill more blacks than any other racial group. At this rate, if black families only had 2 or less children per family, their population would decrease through no fault of anyone but there own. Black Lives Matter should be enficised more on blacks caring about their own enough to stop killing each other. My third is that all lives matter, cops kill more than just blacks, and many deaths are justified. There are bad cops out there, also stupid, fearful, poorly trained and genuinely good ones, blacks whites, women and other races too, BLM lumps them all into one, no matter the ethnicity or individual history, there are more racial groups than just blacks. Asians have surpassed whites in productivity and prosperity as well as education, but then they are more driven to achieve. Blacks have become the opposite, they, not all but many look down upon those who choose to achieve, leave the pack, educate themselves and adapt to Excell. Asians look up to those who achieve or attempt to and assist them, blacks seem to try and drag them down. Blacks who immigrate here do far better than those born here because for one they know first hand how much better it is here, they come here driven to achieve and have not yet been assimilated into our black mind set. The same goes for most immigrants in comparison to American born of the same racial group. ",
            "date": "Answered November 30, 2016",
            "views": "18",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Carl Jacobson",
                    "user_href": "/profile/Carl-Jacobson-2"
                },
                {
                    "user_id": "Daniel Boerger",
                    "user_href": "/profile/Daniel-Boerger-1"
                },
                {
                    "user_id": "Robert Cody",
                    "user_href": "/profile/Robert-Cody-22"
                },
                {
                    "user_id": "Aisah Mayford",
                    "user_href": "/profile/Aisah-Mayford"
                },
                {
                    "user_id": "Laura Laurita",
                    "user_href": "/profile/Laura-Laurita-9"
                },
                {
                    "user_id": "Tiffany Law",
                    "user_href": "/profile/Tiffany-Law-3"
                },
                {
                    "user_id": "David Cardellini",
                    "user_href": "/profile/David-Cardellini"
                },
                {
                    "user_id": "Emily Haldane",
                    "user_href": "/profile/Emily-Haldane-3"
                },
                {
                    "user_id": "Carolina Yibirin-Stovall",
                    "user_href": "/profile/Carolina-Yibirin-Stovall-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jaylin Pringle",
                "href": "/profile/Jaylin-Pringle"
            },
            "answer_text": "It can be argued, their approach and one specific demand.             A lot of individuals are upset that they are bypassing \"the old guard.\" The  likes of  the NAACP, Jesse Jackson, Al Sharpton, John Lewis, etc. Some older individuals feel like the won't take the advice of experienced civil rights leaders and that it could be their downfall.  Criticisms from \"the old guard\" are more or less rooted in the absence of the church as well. The Civil Rights movement was held up by black Southern churches and up until recently if you had the churches, you had the black vote too. Like a growing number of millenials, the black millenials running BLM are increasingly secular and aren't rooting arguments in the bible. BLM is a complete 180 degree turn in terms of demeanor compared to past civil rights groups. I see a style of leadership and adherence to peaceful but disruptive protest similar to MLK. However, there's an anger, a justified anger, similar to the Black Panthers. I think the BLM is heavily influenced by how much social progress our nation and world have had when it comes to the treatment of Black people. They are just trying to get us over that next uncomfortable edge to address problems that need to be addressed. It's not about basic civil rights anymore but that doesn't make an issue any less pressing.  Now to the part I can completely disagree on. Several prominent members have basically advocated for the removal police an almost any capacity from black communities because of acts of brutality. This is a mistake. Some people are choosing to live by the mantra that we can \" 'fend for ourselves.\" There's a belief, from what I've seen, that the removal of officers from our communities will benefit us and that it's our responsibility to keep each other in check. I don't ascribe to that. It's ridiculous to think that as a community we'll just somehow look out for each other, it's borderline segregationist. They don't seem to have any plans to address poverty in black communities. We have to, as a nation, raise the overall economic standing of African-American to levels comparable to Whites and Latinos. Without addressing poverty we will not get very far. Poverty is the root cause of most inequality. Frustration will continue without addressing poverty and the wealth gap, even with the policing reforms they want. PS: I also don't like this culture of screaming dowm any argument, suggestion, or opinion that doesn't come from someone within the organization or that they may initially disagree with. A compromise or proposal made be suggested and it seems like individuals within BLM's may disagree with it and if it has any problems at all people shut the idea down for being racist because it's not exactly what they came up with. PPS: If I run for office, my Quora answer will probably bite me in the ass. ",
            "date": "Answered October 23, 2015",
            "views": "42",
            "upvotes": " View 41 Upvoters",
            "upvoters": [
                {
                    "user_id": "E. Sinsel",
                    "user_href": "/profile/E-Sinsel"
                },
                {
                    "user_id": "Daniel Boerger",
                    "user_href": "/profile/Daniel-Boerger-1"
                },
                {
                    "user_id": "Donjanelle Robinson",
                    "user_href": "/profile/Donjanelle-Robinson"
                },
                {
                    "user_id": "Bob Griscavage",
                    "user_href": "/profile/Bob-Griscavage"
                },
                {
                    "user_id": "Judy Gust",
                    "user_href": "/profile/Judy-Gust-1"
                },
                {
                    "user_id": "Victoria Smith",
                    "user_href": "/profile/Victoria-Smith-888"
                },
                {
                    "user_id": "Aisah Mayford",
                    "user_href": "/profile/Aisah-Mayford"
                },
                {
                    "user_id": "Tiffany Law",
                    "user_href": "/profile/Tiffany-Law-3"
                },
                {
                    "user_id": "Amar Ali",
                    "user_href": "/profile/Amar-Ali"
                },
                {
                    "user_id": "Ana Tan",
                    "user_href": "/profile/Ana-Tan-28"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anthony Galli",
                "href": "/profile/Anthony-Galli-5"
            },
            "answer_text": "Some people think if you dislike BLM then you're ignorant at best and racist at worst. If BLM simply meant \"black lives matter\" then okay I’d largely agree (although I don’t love the message in of itself because in my mind just because you have a pulse doesn’t mean you matter. Maybe instead of society telling young people that “you matter” (leave that for Grandma) we should say “you can matter!”), but moving on my main problem with BLM is that is also means... F*** the police.Abolish the police.BlackLivesMatter DC on Twitter Abolish free speech as it pertains to race, i.e. \"hate speech\"White people are racist by default and therefore need to shut up and listen to people with darker skin who may or may not be educated in politics.America was created by racists and therefore will always be racist.Republicans are racist.And ironically, the state is systemically racist therefore we must give more power to the state so it can take even more control over our education, housing, healthcare, food, transportation, etc.For one or all of those reasons, we shouldn’t support BLM. H*ll is paved with good intentions. And to hammer home my point, when the Democrat Mayor Jacob Frey came before the almighty BLM protestors (the protestors weren't even nice enough to let him get up on the platform to address the crowd), he talked about his own \"brokenness\" and how the “systemic racist system needs to be revamped” and how the “police union needs to be put in its place”, but as soon as he disagreed with abolishing the police altogether, which is an absolutely absurd proposition unless you want these cities that are already overrun by gang violence to be controlled by them, then the BLM protestor shouted at him to, \"Get the f*** out of here!\" \n And then everyone started chanting SHAME as if we live in the literal Game of Thrones.  \n BLM is dangerously wrong here whereby if they succeeded in abolishing the police department we’d actually see millions of black people dead in the streets as gangs fight it out in turf wars… black lives matter? Your right to be upset doesn’t supersede my right to think. If you believe in the continued existence of police officers then join me in telling BLM to, \"Please go away.\" This answer is not a book so don't expect me to address all the reasons why you support BLM because it's irrelevant since BLM is not an inclusive tolerant movement that welcomes many points of view... as you saw in the video, if you disagree on something so ludicrous as \"defunding the police\" then you are being told to, \"Get the f*** out of here!\" Happily. ",
            "date": "Answered June 7, 2020",
            "views": "17",
            "upvotes": " View 27 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tiggy Brunswick",
                    "user_href": "/profile/Tiggy-Brunswick"
                },
                {
                    "user_id": "E. Sinsel",
                    "user_href": "/profile/E-Sinsel"
                },
                {
                    "user_id": "Christopher Kosel",
                    "user_href": "/profile/Christopher-Kosel"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Carl Jacobson",
                    "user_href": "/profile/Carl-Jacobson-2"
                },
                {
                    "user_id": "Barry van Wagner",
                    "user_href": "/profile/Barry-van-Wagner"
                },
                {
                    "user_id": "Nerdy Weirdo",
                    "user_href": "/profile/Nerdy-Weirdo"
                },
                {
                    "user_id": "Kon Scheon",
                    "user_href": "/profile/Kon-Scheon"
                },
                {
                    "user_id": "Andy Watson",
                    "user_href": "/profile/Andy-Watson-60"
                },
                {
                    "user_id": "Victoria Smith",
                    "user_href": "/profile/Victoria-Smith-888"
                }
            ]
        },
        {
            "author_info": {
                "name": "Terrance Munro",
                "href": "/profile/Terrance-Munro"
            },
            "answer_text": "Frankly a lot of the message coming from BLM is a red herring, the reality is that vast majority of violent black deaths in America are not at the hands of law enforcement, or for that matter at the hands of white Americans. The ugly truth that most in the black community refuse to acknowledge or are ignorant of is that the majority of violent deaths of black Americans occur at the hands of other black Americans. Here are just a few stats outlining the problem Fewer than 400 people a year are killed by law enforcement, and 61 percent of them are white.Ninety percent of murdered blacks are murdered by other blacks.A law enforcement officer is 18.5 times more likely to be killed by a black male than an unarmed black male is likely to be killed by a police officer.Black males have comprised 40 percent of law enforcement officer killers in the last decade, even though they make up six percent of the population.Four percent of all black homicide victims are killed by police officers.More than 6,000 blacks are murdered each year. Even though blacks are only 13 percent of the population, they are dying at a rate more than eight times that of whites and Hispanics combined.Up to 75 percent of black children are raised without fathers. Dallas police chief David Brown mentioned this in a recent press conference, saying that law enforcement is often unfairly expected to deal with many of these damaged individuals who turn to crime after growing up without discipline, guidance and role models.The DOJ has found that 85 percent of violence involving a black and a white is black on white.Now, no one is suggesting the problem lies with the average law abiding black American, any more than responsibility for crimes committed by white individuals lies with law abiding white citizens. Where the problem with Black Lives Matter is they are targeting the wrong group, they should be screaming for the heads of the small minority of individuals within their own communities that are committing the crimes and taking the lives of Black Americans. Looking at the above statistics, maybe what is needed is a “Blue Lives Matter” campaign to support the police. ",
            "date": "Answered July 14, 2016",
            "views": "18",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "E. Sinsel",
                    "user_href": "/profile/E-Sinsel"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Judy Gust",
                    "user_href": "/profile/Judy-Gust-1"
                },
                {
                    "user_id": "Victoria Smith",
                    "user_href": "/profile/Victoria-Smith-888"
                },
                {
                    "user_id": "Becca Anzalone",
                    "user_href": "/profile/Becca-Anzalone-2"
                },
                {
                    "user_id": "Siv-Lise Selma Gansmoe",
                    "user_href": "/profile/Siv-Lise-Selma-Gansmoe-1"
                },
                {
                    "user_id": "Lori Obernberger",
                    "user_href": "/profile/Lori-Obernberger"
                },
                {
                    "user_id": "Alejandro Rocha",
                    "user_href": "/profile/Alejandro-Rocha-1"
                },
                {
                    "user_id": "Elizabeth Gilbert",
                    "user_href": "/profile/Elizabeth-Gilbert-9"
                },
                {
                    "user_id": "Caryssa Kramer",
                    "user_href": "/profile/Caryssa-Kramer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Lunsford",
                "href": "/profile/Richard-Lunsford-5"
            },
            "answer_text": "I see two contrasting ideologies designed to serve the same agenda. When I was a kid in 2nd grade, we were actively taught black people were the same us as, only with black skin, and it didn’t matter. It’s the ‘color-blind’ perspective. The t.v. show the Jefferson’s summed it up in the concept of regarding black people as Oreos. The hope was getting enough people to think this way would largely eliminate racism agains blacks, who would gradually assimilate into mainstream society and their social metrics improve. But it didn’t happen fast enough and well enough, and it seemed active efforts (whether you’re a MLK Jr. or Malcolm X fan) seemed necessary. I imagine black youth got a lot of negative messages growing up - that a lot of people ‘hate’ or view you as inferior because of your skin color, and blacks are often depicted as doing dismally in a range of social metrics. Basically, a black kid could infer from all this that being black means you’re screwed. Plus the sense of vague, pervasive oppression. What to do? Now we’ve got identity politics. Create the concept of the ‘black community’ to raise solidarity into a politically powerful unit and work for change. Give members a sense of pride and positive identity in ‘belonging’ to a proud group, a noble people who have endured and survived harsh oppression yet did not fall. A sense of meaning in pursing a higher purpose to achieve MLK Jr’s dream and be ‘free at last!’ Understandable appeal. There are a few problems. In public schooling, separate but equal didn’t go well. If the basis for treating blacks equally is that they're the same as us, how far do you want to go portraying them as different? Humans are inherently tribalistic; does portraying blacks as being in their own tribe others are excluded from sound like a good idea? Many people want to make neighborhoods more integrated to aid poor blacks, but from whites’ perspective, if ‘they’ aren't like us, and we’re in different ‘communities,’ and theirs has a grudge against ours, is that in our best interest? Oddly, I don't see a lot of discussion of how this tribalism-based mentality will deal with shades of gray (mixed race people). Famous ones like the first bi-racial President may get claimed (called black). I’ve read some in the black community prefer lighter skinned members, so there’s color-bias even within the so-called black community itself. I’m solidly in the ‘color-blind’ camp, believing there’s one race, the human race, that so-called races differ on minor cosmetic bases and we ought to downplay and ignore it as much as practical. But I’m an aging white guy; maybe it’s easier to think like that. I do wonder how much damage identity politics are doing to America. Shortly after the George Floyd video got out, there was a lot of sympathy toward blacks. Once the riots and looting started and the BLM bit got pushed stronger, I saw a backlash on Facebook. There’s a balance between reaching out for help, and making some other people feel attacked. People who wish to be politically effective would be well-advised to master that balance. ",
            "date": "Answered July 13, 2020",
            "views": "416",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jane Williamson",
                    "user_href": "/profile/Jane-Williamson-39"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Daniel Boerger",
                    "user_href": "/profile/Daniel-Boerger-1"
                },
                {
                    "user_id": "Cham Azmeh",
                    "user_href": "/profile/Cham-Azmeh"
                },
                {
                    "user_id": "Krist-Yon Narain",
                    "user_href": "/profile/Krist-Yon-Narain"
                },
                {
                    "user_id": "Chris Wilson",
                    "user_href": "/profile/Chris-Wilson-1554"
                },
                {
                    "user_id": "Judy Gust",
                    "user_href": "/profile/Judy-Gust-1"
                },
                {
                    "user_id": "Alexander Belstra",
                    "user_href": "/profile/Alexander-Belstra"
                },
                {
                    "user_id": "Michael Dehart",
                    "user_href": "/profile/Michael-Dehart-6"
                },
                {
                    "user_id": "Emily Ward",
                    "user_href": "/profile/Emily-Ward-48"
                }
            ]
        },
        {
            "author_info": {
                "name": "M Markus Harrison",
                "href": "/profile/M-Markus-Harrison"
            },
            "answer_text": "UPDATED JUNE 2020 Great answer from Habib. Personally, I've had real concerns with North American police practices for decades and I'm not even black, so my emphasis is on how to reform very poor police procedures and organizational culture so as to benefit everyone, especially black folks. My biggest concern with the BLM movement is that its entire focus is on racism. It's not well known by the public that British police are far, far better trained than North American police. Not knowing that, it's natural to assume that the sole cause of shootings of unarmed black males is racism. The fact that black officers are often involved gets no attention but it's highly significant. Canadian Update June 2020. What I wrote about improper police procedures has become sadly relevant in Canada. A 26 year old native woman from BC, Chantel Moore, was killed by the RCMP officer she allegedly ‘threatened’ during a “wellness check” called in by her own family. In Brampton, a similar tragedy happened to 26 year old D'Andre Campbell, someone with known mental health issues who, being in distress, was even the one who called police! The police always say their officers were threatened and had no choice but to shoot to kill. This is nonsense. It always takes more time to draw, aim and shoot a weapon than it does to simply step back or even run away. At worst, they could train their tasers on their victims as they back away. In short, Police need to be trained to DISENGAGE before killing mentally ill people, or anyone who doesn't immediately comply with their orders for whatever reason. Making this solely a race issue may not be helpful. People of all colours are endangered by the poor training in crisis management of our police. But maybe the current BLM movement will be the catalyst we need to finally see positive change. TLDR: Until police procedures are changed, NEVER call the police to check on a loved one! Personal Story: I was on private property, rather depressed, so didn't answer calls. My mother called the police for one of those wellness checks and I didn't want to open the door; I said come back with a warrant. The police made it quite clear that they needed no warrant and WERE coming in, by force if needed. Being sane, I complied. But for someone unstable, they could perceive this police threat as worthy of arming themselves. Minutes later, they'd be dead. For a wellness check! We have to DEFUND the police and start funding mobile crisis intervenors to help people in distress, not kill them! There are also underlying cultural SAFETY issues.. In North America, we are taught from childhood that “you can never be too safe”. Children aren't allowed to go to the playground unescorted and much of our thinking is fear-based. Franklin Veaux has written about how US political parties play fear like a violin and the media has a huge role in this. When a child is kidnapped, the coverage is huge, parents everywhere become fearful. There's never a single voice saying that the likelihood of your child bring kidnapped by a stranger is very low, less than the chance of being hit by lightning. So keep your children inside! Ok… Skip ahead 20 years. That child is now a police officer. S/he's been told his whole life “don't take chances, you can't be too safe”. And the (totally innocent) black suspect has something in his hand! Start shooting! Now! In short, we need far, far better training of police in a new atmosphere of “you CAN be too safe” and “I'm NOT afraid of black people.” ",
            "date": "Updated June 9, 2020",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "E. Sinsel",
                    "user_href": "/profile/E-Sinsel"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Daniel Boerger",
                    "user_href": "/profile/Daniel-Boerger-1"
                },
                {
                    "user_id": "Judy Gust",
                    "user_href": "/profile/Judy-Gust-1"
                },
                {
                    "user_id": "Hanna Shader",
                    "user_href": "/profile/Hanna-Shader"
                },
                {
                    "user_id": "Sam Watson",
                    "user_href": "/profile/Sam-Watson-1"
                },
                {
                    "user_id": "Susan Scogin",
                    "user_href": "/profile/Susan-Scogin"
                },
                {
                    "user_id": "Victoria Smith",
                    "user_href": "/profile/Victoria-Smith-888"
                },
                {
                    "user_id": "Kenneth Bircher",
                    "user_href": "/profile/Kenneth-Bircher"
                },
                {
                    "user_id": "Rainer Visser",
                    "user_href": "/profile/Rainer-Visser"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex Ong",
                "href": "/profile/Alex-Ong-90"
            },
            "answer_text": "Firstly, they enjoy using an analogy ,like a house on fire, and the other houses around it are fine, and people from other houses would tell the firefighters , “My house matters too, all house matters” A false analogy. The one realistic analogy is not only is that one house on fire, but plenty dozens more are on fire. Because all lives are suffering. Wanna know why all lives are suffering? Because not only black lives are killed around the world. Asians are being killed , middle eastern are being killed , natives are being killed, Hispanics are being killed. You think discrimination only happens in America? Fuck no, it's everywhere , it existed since the dawn of time. And it WILL continue to exist , because of its necessary existence Do NOT give me that BS that other lives are not taken just because you don't see them. Did you just discover that all lives are in pain and suffering? Just by living, people hurt others without even realizing it. So long as humanity exists, hate will also exist. There is no peace in this world. War is just a crime paid for by the pain of the defeated. But that doesn't mean that peace is not possible. Permanent peace is not possible ,but a temporary one is. Oh? So only those shown on the media are true? Anericans love to think the world revolves around them. They love to think they are the center of the world. I have an African friend , wanna know what he thinks? He actually thinks majority of Americans are hilarious, fighting over this one man's death, and think the African Americans in America are the only ones suffering,whereas Africans have witnessed more suffering than they ever did. Stop playing the role of a victim. As Gautama Buddha mentioned before , and I quote \"Pain is inevitable ,but suffering is optional\" There will be pain , there will be inequality, there will be injustice , there will be conflicts , there will be wars. HOWEVER, you can choose to cling on them , by blaming all the downfalls in your life on them. Or you can rise above by not letting them to dictate your life. You can't change the world. You think raising awareness would do anything? No, the conflict will continue , the inequality, the injustice , the cycle of hatred will continue. As I mentioned earlier , creating peace and bring about justice. From what most people who supported the \"black life matters\" movement. Yes, it is noble of you ,wanting to bring justice upon this world. That's justice indeed HOWEVER, there will ALWAYS be someone who will say \"What about my family? My friends? My country?\" Such as people from war-torn countries like Syria , or the middle East countries , who suffered the same fate as your country, torn apart by meaningless conflict. How is it fair to only allow you people to preach about peace and justice? In the end, you and I seek the same thing. We are trying to establish the peace we all desired so much. You and I are not so different after all. We each act according to our own sense of Justice. The justice the terrorists delivered to America and the rest of the world is no different from what you all are trying to do to each other in America. The pain of losing something dear to you is the same. And we all know the pain all too well. You have your justice . . .And they have theirs. We are all but ordinary men, driven to seek vengeance under the banner of Justice. However, if there is justice in vengeance, then justice will only breed more vengeance and trigger a cycle of hatred. We are living in the middle of such a phenomenon right now. We know what the past has been, and we can predict what the future will be. That is history, as we know it. So we cannot help but believe that human beings are incapable of understanding each other. This world is ruled and governed by hatred since the dawn of time. In this world, wherever there is light, there pare also shadows. As long as the concept of winners and oppressors exist, there must also be victims and losers. The selfish desire of wanting to maintain peace causes wars, and hatred is born to protect love. When a man learns to bear love, he must also bear the risk of hate. The causality and interdependence of these opposing forces means that peace can only be for those who wins at the expense of the losers, the weak. Humans desire peace , yet on the other hand create conflict as well. That duality is mankind for you. What will you do then? Will you repeat the same cycle again, just like our ancestors , and continue this cycle of hatred? Or will you rise above and stop this madness once and for all? So . . . Tell me, enlighten me! How would you confront this hatred in order to create peace?   ",
            "date": "Updated July 6, 2020",
            "views": "14",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "E. Sinsel",
                    "user_href": "/profile/E-Sinsel"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Daniel Boerger",
                    "user_href": "/profile/Daniel-Boerger-1"
                },
                {
                    "user_id": "Barry van Wagner",
                    "user_href": "/profile/Barry-van-Wagner"
                },
                {
                    "user_id": "Hayla Aziz",
                    "user_href": "/profile/Hayla-Aziz"
                },
                {
                    "user_id": "Bob Griscavage",
                    "user_href": "/profile/Bob-Griscavage"
                },
                {
                    "user_id": "Victoria Smith",
                    "user_href": "/profile/Victoria-Smith-888"
                },
                {
                    "user_id": "Yuriy Lyashchuk",
                    "user_href": "/profile/Yuriy-Lyashchuk"
                },
                {
                    "user_id": "Aisah Mayford",
                    "user_href": "/profile/Aisah-Mayford"
                },
                {
                    "user_id": "Horace Thon",
                    "user_href": "/profile/Horace-Thon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pascal Morimacil",
                "href": "/profile/Pascal-Morimacil"
            },
            "answer_text": "I would argue that the biggest issue is that it is people being enraged by the symptoms, and few people are actually looking at the actual causes. And fighting the symptoms without treating the disease is a losing battle.  There are many movements that are like that. Occupy Wall Street was also like that, outrage at the symptoms, but no real focus on the mechanisms. Another example: Defunding the police. Which actually means not cutting the police entirely, but funding them less, and funding other stuff instead. What exactly are we funding instead? Other stuff. How does that solve the problem exactly? Should we perhaps talk about that, about exactly what we want to do? And how we decide on that?  Why is it that people have to stand around in the street and break shit to be heard? Why is the democratic process so broken that people don't feel like they can realistically improve anything through normal means? Is having people protest in the streets really the best way to do things? Is it like a show of hands type of voting? Why cant we do normal voting on how we want policing to be done? Do you ever get to vote on any of the stuff that matters? Or just on some politician’s face? Did you vote for the recent bailouts? Or do you remember which politician campaigned on handing out huge bailouts? Or how did it happen without anyone in the population having a say about it?  If we go to the root causes of stuff, we might be able to change something. If we fight against the symptoms of broken systems, without addressing the systems themselves, we are not going anywhere.  You can fire the “couple of bad apples” cops, and the broken police system will ensure that new ones appear to replace them. You can destroy the whole police department, and rebuild it from scratch. And if you are using the same method, measures, goals etc to build the new one as for the old one, you will recreate the same thing. ",
            "date": "Answered June 22, 2020",
            "views": "35",
            "upvotes": " View 147 Upvoters ",
            "upvoters": [
                {
                    "user_id": "E. Sinsel",
                    "user_href": "/profile/E-Sinsel"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Daniel Boerger",
                    "user_href": "/profile/Daniel-Boerger-1"
                },
                {
                    "user_id": "Victoria Smith",
                    "user_href": "/profile/Victoria-Smith-888"
                },
                {
                    "user_id": "Yuriy Lyashchuk",
                    "user_href": "/profile/Yuriy-Lyashchuk"
                },
                {
                    "user_id": "Bob Dole",
                    "user_href": "/profile/Bob-Dole-493"
                },
                {
                    "user_id": "Naomi N",
                    "user_href": "/profile/Naomi-N-26"
                },
                {
                    "user_id": "Tiffany Law",
                    "user_href": "/profile/Tiffany-Law-3"
                },
                {
                    "user_id": "Laura Wrzeski",
                    "user_href": "/profile/Laura-Wrzeski"
                },
                {
                    "user_id": "Temoin Pensee",
                    "user_href": "/profile/Temoin-Pensee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Raffety",
                "href": "/profile/Andrew-Raffety"
            },
            "answer_text": "The movement at its core is good, but some of the members really aren't. The BLM movement is a movement wherein protester protest the violence some cops have shown towards the African American community and racial injustices in our society. There work highlights instances of violence and tries to inform the world that there are racist cops and we do still have an imperfect justice system. It is important to highlight these topics and share them for many might not even know these things are going on, and it is impossible to be a good police officer/have a good justice system wherein racism is prevalent. But now onto the negatives BLM has some violent/extremist members (like all movements do) that actually make situations worse. They turn peaceful protests into violent riots and spout racism against white people/violence towards police officers. Neither of which helps the BLM movement.They sometimes protest before due diligence is done. I've seen a number of smaller protests thst happened because a young African American man was shot by the police without anyone actually learning why. The man in question assaulted an officer and was shot in self defense but some people still protested it as if the officer had gone out of his way to attack the African American man/assuming the officer in question was racist. Another instance happened between an African American officer and an African American suspect, yes African Americans can be racist against themselves but they were still some yelling about white cops and white peoples in general. Now this doesn't take away from the overall message that there is racism inherent to our system but it does show people “jumping the gun” and being “protest happy”. Or just wanting to protest something so badly they neglect to appraise the actual situation.Many feel it's a less inclusive group. Yes most memebers of BLM do believe that all lives matter but want to highlight violence towards the African American community, however the number of extremists put a very bad light on the movement as a whole. Like I said before there are some members of BLM who try to spread anti white/racist ideologies, most members don't but some definitely do.In some places white people weren't aloud to protest in solidarity with the African American community. Again mainly because of the small number of extremists inside the group. But a group against racism shouldn't be racist.So basically the only thing wrong with the movement are a few of its members. Most members are peaceful and just want to be heard. They stand up against injustices and try to outline what is wrong with our current system in an attempt to help us understand. It's a good movement but it has been trivialized by the actions of a few of its members. I do believe that Black Lives Matter and I will continue to support said organization as long as I feel the message and community as a whole is geared towards a better more inclusive future. I however do not condone the actions of racism and violence perpetrated by a few of the members. ",
            "date": "Answered November 18, 2016",
            "views": "11",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Daniel Boerger",
                    "user_href": "/profile/Daniel-Boerger-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cal Stowe",
                "href": "/profile/Cal-Stowe"
            },
            "answer_text": "There’s a fundamental contradiction here. The black murder rate is so high, it hard to get your head around. Blacks have a murder rate 5.7 times higher than non-hispanic whites in 2018 according the FBI. Yet the narrative is they are brutally policed. I don’t think anyone disputes police enforcement inhibits crime, so why are these numbers so high? It’s pretty much a given the truth of any liberal claim is exactly the opposite, that’s how they keep the franchise going, with a media reality suited to their fascist goal of total control of money, power, behavior, and thought. Blacks are just a pawn in the liberal elite game. They fund movements like BLM to inhibit police enforcement to keep the crime rate high, which guarantees lots of crimes. This means there will be really nasty, poor black areas they can splash on TeeVee, to keep the race business going strong. This allows them to manipulate people out of their votes, money, and independence, and it’s working a treat. We spend a $trillion dollars more per year than we have, but if Trump tries to cut a program 5 cents, there’s howling to the moon. Propaganda induced lunacy. I would also note the majority of blacks murders occur in about 10 hot spots in the country, not cities, but individual neighborhoods within a city. All out enforcement, shooting gang bangers and dealers on sight could end all this in about 90 days. I’ve read you only have to shoot about 1 out 10, and the rest will change. So we could shoot about 1000 guys and end the black poverty and crime problem for generations. Murder Rates by Race White (non-hispanic) 9.7/million Hispanic 20.6/million Hispanic/White 2.1 Black murder offenders 55.6/million. Black/White 5.7 Percentage of All White Homicides by Police: 3% Percentage of All Black Homicides by Police: 1% Black Murders by: Blacks 89% Whites (non-hispanic) 3.4% Hispanic 2.8% White Murders by: Blacks 16% Whites (non-hispanic) 56% Hispanic 24% ",
            "date": "Answered July 14, 2020",
            "views": "22",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Siv-Lise Selma Gansmoe",
                    "user_href": "/profile/Siv-Lise-Selma-Gansmoe-1"
                },
                {
                    "user_id": "Harrison Butchart",
                    "user_href": "/profile/Harrison-Butchart"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rene Lee",
                "href": "/profile/Rene-Lee-26"
            },
            "answer_text": "People are always quoting statistics and statistics is a valuable tool in determining outcomes. However the cold hard facts of what really takes place in ‘race ‘ interactions are much harder to define. Another way at looking at the truth is not just about the ratios of police killings between black and white people but the amount of interactions that people have with the police and how they are handled. How many times does a black person get stopped by police, not just in their cars but in the street or sitting at a bus stop. How hard is the law enforced for misdemeaners. What happens in society that makes them suspect that they are going to get arrested,fined and are more likely to experience, a ‘second rating’ in all kinds of ways from being served in a store to even selling a house. Recently a case was posted up where a couple were selling their house. They had it valued and they felt for the area it was undervalued. The husband was white his partner black. She removed all evidence of a black existence in the house, no family pictures, no celebratory cultural motifs and had the house revalued, with only her white husband present. The price went up by a 100,000 usd. The perception that I can fully understand is when you are stopped by the police as long as you've done nothing wrong, it's just a stroll in the park. It just isn't going to be that way for many people, for many black and brown people and that doesn't mean you are going killed but that if not handled correctly could be life changingly bad. We have recently seen this in Central Park NYC. A white woman calls the police, because a black man asks her to put her dog on a lead. She claims he's being aggressive, with the possible threat of violence. This as you know was being recorded and was blatantly not true. This was from a high status white women, that you would not normal think of as being ignorant. There comes a time when people think, when they they get stopped on the street in the car after so many other times, has their number been called. Statistically so I'm told it isn't., but statistics are not about how you feel, society is. Do you feel good in your society has Trump made you feel better, does Biden make you feel worse? Black Lives Matter is about the black experience and the mistreatment that whole swathes of people suffer in American society. It has become, never intentionally, a bandwagon for a host of people, minorities and those that feel the protest/ debate is an examination of the notion ‘ what is fair in society’ and what is patiently not. When you're driving your car in downtown Jamaica, you know your not being stopped because you are black, you do not know that in America. ",
            "date": "Answered October 28, 2020",
            "views": "8",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Melissa Hoy",
                "href": "/profile/Melissa-Hoy-2"
            },
            "answer_text": "Alright. I’ve been shying away from this question because I don’t want to lose followers or lose my sister status. But here goes. I understand the general position. I live in Arizona where racial profiling has been a standard (not necessarily for blacks, but for hispanics). I get that this does happen and I do not doubt there are egregious violations of morals and the law. It’s been shown that horrific things happen because of skin tone. But the range that this movement has and the offshoots of what this movement started bother me. Maybe it’s because I just don’t quite understand the issue. Personally, I don’t care what color you are unless you act like an ass. I have met the literal stereotypes of most races (I have some of the Mexican ones in my own family). I have used racial slurs against those stereotypes. I expect I am now being unfollowed and blocked because of that statement. I can’t apologize. To me, there is a difference. I have also met or seen exemplary examples of humanity in all colors. Maybe it’s because I don’t care what color or gender or sexuality people are that I don’t understand or appreciate the lengths that BLM goes to. Maybe it’s because I keep forgetting that in social media BLM stands for Black Lives Matter because in my work BLM stands for Bureau of Land Management. Maybe it’s because my boyfriend has to keep pointing out to me that I’m an exception, not the rule, in my beliefs. I know that peaceful protests can change a nation. It’s been done before. But the tone of a lot of these protests isn’t peaceful. It shifts from the original organizers of the movement to something darker (no, that is not a skin tone reference) as others pile on. Others with slightly different motives. And I don’t want the darkness becoming the norm. ",
            "date": "Answered November 18, 2016",
            "views": "51",
            "upvotes": " View 114 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Louise Robertson",
                    "user_href": "/profile/Louise-Robertson-10"
                },
                {
                    "user_id": "E. Sinsel",
                    "user_href": "/profile/E-Sinsel"
                },
                {
                    "user_id": "Loulou Beckett",
                    "user_href": "/profile/Loulou-Beckett-1"
                },
                {
                    "user_id": "Asoka Indrasoma",
                    "user_href": "/profile/Asoka-Indrasoma"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Bob Griscavage",
                    "user_href": "/profile/Bob-Griscavage"
                }
            ]
        },
        {
            "author_info": {
                "name": "Linda Keres Carter",
                "href": "/profile/Linda-Keres-Carter"
            },
            "answer_text": "I'll confess something. I do hate the name. Somebody can explain all day long that the name isn't meant to imply that ONLY black lives matter. I can 100% know that, never needed anyone to explain it, but the words still sit there, oozing salt. First you have to keep in mind that level of 'not mattering' you have to achieve to be genocided into extinction the way we were in Operation Storm. I mean, the first thing that comes to an American's mind when they the hear the word 'Serb' are the words 'genocidal maniacs.' And I can't talk about what really happened, who was really doing who, without somebody throwing that at me. I mean, think about it, the minority culture (Krajina Serbs) that produced Tesla is now gone forever. A couple more generations and nobody will even be claiming that identity. All that suffering for so many generations, to end up like that. It was 600 years of struggling to survive that horrible predicament, colonized, enslaved, exploited people, less than human, raped, powerless. And then there's the runaway slaves that we were, sitting in the no-man's-land on the other side of the border fighting those mf's who had our brothers and sisters in bondage on the other side of the border. That was 350 years stuck in a vibe like buffalo soldiers fighting the Civil War. That's the kind of crucible that produces a Tesla -- us inferior, stupid people, the gorillas of Europe. And where did it go? All that heart for nothing. And all the mindless turmoil roiling through my family, adrift here with no memory of ourselves, no clue why we were such a mess -- all lost except who was familiar -- that spun me out into such a maligned life living on what the world thought was the wrong side of the color line, reaching for something that just mattered so much that was never really mine. And never will be. So every time I hear that name I feel some salt in that wound. If there was any discussion when the name was being decided on that maybe it would make some people feel left out or ignored, an obvious decision was made that, no, we don't matter. And I'm asked to be sensitive to people who are being insensitive. And what they appear to me is callow youth who have some growing up to do. After forty years on what this culture thinks is the wrong side of the color line I have reached an impasse. I am not going to make an effort to make allowances and understand people who are not making an effort to do the same for me. It's full equality, or it's nothing. I want to talk about what that word really means. ",
            "date": "Updated June 2, 2020",
            "views": "24",
            "upvotes": " View 18 Upvoters ",
            "upvoters": [
                {
                    "user_id": "E. Sinsel",
                    "user_href": "/profile/E-Sinsel"
                },
                {
                    "user_id": "Kathy Li",
                    "user_href": "/profile/Kathy-Li-133"
                },
                {
                    "user_id": "Ismail Hamdy",
                    "user_href": "/profile/Ismail-Hamdy"
                },
                {
                    "user_id": "Lensei Nishizawa",
                    "user_href": "/profile/Lensei-Nishizawa"
                },
                {
                    "user_id": "Abraham Pereira",
                    "user_href": "/profile/Abraham-Pereira-2"
                },
                {
                    "user_id": "Anu",
                    "user_href": "/profile/Anu-1581"
                },
                {
                    "user_id": "Antony Pateman",
                    "user_href": "/profile/Antony-Pateman"
                },
                {
                    "user_id": "April Schroeder",
                    "user_href": "/profile/April-Schroeder-1"
                },
                {
                    "user_id": "Chukwuemeka Onyimadu",
                    "user_href": "/profile/Chukwuemeka-Onyimadu-2"
                },
                {
                    "user_id": "Nonso Nzenwa",
                    "user_href": "/profile/Nonso-Nzenwa"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lance Berg",
                "href": "/profile/Lance-Berg-2"
            },
            "answer_text": "While I generally agree with the point they’re making, I think they picked a clumsy catchphrase and doubled down on it, and now they’re stuck with a poor choice for a name. The immediate, visceral response to “Black Lives Matter” is “Of course they do, what sort of shit would think otherwise” followed by “but so do white lives, yellow lives, red lives, hell, green lives. Lives matter.”, followed by “All Lives Matter.” Not because anyone thinks that “Black Lives” don’t matter, but because it sounds like it’s saying that “Black Lives” are the ONLY ones that matter. Then you have to try to backpedal and say that no, of course everyone gets that, but people are acting like “Black Lives” don’t matter. Which, I agree is an actual problem that needs to be addressed. But which reads poorly. The point gets buried down deep under a stack of other reactions which aren’t intended. The people you are most trying to reach are the ones who get the message wrong, and it sticks in their craw. This isn’t a good way to get people on your side. It’s sort of like the current catchphrase “Love Trumps Hate”. Sounds good, assuming you read it as “Love” trumps “Hate”. But there’s a presidential candidate, now assumed president-elect, named Trump. So you might be saying Love “Trump’s Hate”. IS love better than hate, or are we embracing the hate that Trump is spreading? This confusion is again the hallmark of a sloppy catchphrase invented on the spur of the moment. But nobody is taking that and defiantly turning it into the name of an organization. So far, anyway. ",
            "date": "Answered November 16, 2016",
            "views": "893",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mia Garrett",
                    "user_href": "/profile/Mia-Garrett-18"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Alina Smith",
                    "user_href": "/profile/Alina-Smith-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Soo J. Oh",
                "href": "/profile/Soo-J-Oh"
            },
            "answer_text": "Although I generally support Black Lives Matter, I do have a few criticisms. At first, I thought that while they were effective at getting the word out about violence against black Americans, they lacked a cohesive approach towards policy change. Now that they do have a platform based around policy, I find it unwieldy and too large. For instance, I don’t fully understand why their platform includes military cuts and a statement on climate change. I personally feel they would be better off allocating their resources to a focused policy and liaising with other activist-organizations that focus on issues like climate change. The launch of their platform was marred by a media focus on BLM’s anti-Israel, pro-Palestine stance. As someone who is pro-Palestine, I totally get it — but still, is it really part of American domestic race issues? I also believe that organizations focusing on change in race in the U.S. will fare better in the long run if they can create bonds with white blue collar workers. Although race issues have a dimension beyond class struggles in the U.S., I also think that the white blue collar worker is the demographic to be most likely against racial equality in the U.S. Yet, many African Americans and lower-class Americans face similar struggles to access equal services and equal opportunities. As long as conservative politicians use race to antagonize lower-class Americans against minorities, it will be difficult for the country to truly integrate. Lastly, I would say that whenever I hear/read a statement by BLM activists, it always seems a little too idealistic — a little too much like the activism on college campuses. It might speak to my age that I don’t always find that appealing or the best approach. I feel that some of the activists do not consider the wide-ranging audience of all demographics who might be listening. If they are truly to have a lasting national impact, I think they need to move beyond an internal language and shift to a broader, more powerful rhetoric. ",
            "date": "Answered November 16, 2016",
            "views": "14",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "E. Sinsel",
                    "user_href": "/profile/E-Sinsel"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Joey Pickett",
                    "user_href": "/profile/Joey-Pickett-3"
                },
                {
                    "user_id": "Jake Morgan",
                    "user_href": "/profile/Jake-Morgan-8"
                },
                {
                    "user_id": "Ganashyam Subramaniyan",
                    "user_href": "/profile/Ganashyam-Subramaniyan"
                },
                {
                    "user_id": "Michael Rouse",
                    "user_href": "/profile/Michael-Rouse-29"
                },
                {
                    "user_id": "Trish Smith",
                    "user_href": "/profile/Trish-Smith-116"
                },
                {
                    "user_id": "Chris Boze",
                    "user_href": "/profile/Chris-Boze"
                },
                {
                    "user_id": "Clemens Katzer",
                    "user_href": "/profile/Clemens-Katzer"
                },
                {
                    "user_id": "Jackie Pemberton",
                    "user_href": "/profile/Jackie-Pemberton-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amber Handy",
                "href": "/profile/Amber-Handy-3"
            },
            "answer_text": "That it's not actually in support of black lives! It's a lot of racist blaming that goes no where. Why is it a travesty that a cop kills or beats someone who is actively breaking the law but the young black kids who are shooting each other or dying from drug abuse are just sacrificed to the system on a daily basis? Layers and layers of corruption and racial tension stem so much deeper than a cop using excessive force because that's what they're trained to do. Do I believe the cops are targeting certain CLASSES of people? YES! These classes of people are not JUST black. They're poor. Because the true root of all evil is money. And to live without it is the ultimate sin. Police assume if you are poor you are a criminal. Poor people, like police, like assholes, come in all different colors. If BLM was a legitimate movement, what's the plan? Why does no one have step by step guidelines to make it better for blacks and other people targeted by ANYONE? Actually, I read an interesting article the other day about Martin Luther King Jr's plan. Yeah, he wrote it all out! And then he was assassinated. And that plan, that speech, exists still. It contains very legitimate legal procedures to reform police, economic, welfare, and educational systems. Yet no one ever gave it another shot. Is that white suppression? Maybe! But if it still exists and people know about it, maybe it's time to actually DO something. As Americans, we love our protests. Sit ins, stand ins, yelling slogans. For some reason, we genuinely believe that by sitting around and whining about what we don't like that we will get important things done. That, my friends, is American privilege. ",
            "date": "Answered September 24, 2020",
            "views": "73",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Connor Strynkowski",
                "href": "/profile/Connor-Strynkowski"
            },
            "answer_text": "Let me start the by saying that I agree with the concept that police shootings should ideally have no base in race or gender. With that said, the number one thing that prevents me from caring much about BLM is… the overwhelmingly more prevalent discrimination. Here is a breakdown of fatal police shootings by race and gender:  Notice anything? Now, keeping in mind that there are ~5.7 white people for every black person in the US, and roughly 1 man for every woman, we can calculate the following: If you are black, your chance of being killed is ~105/180*5.7 = 3.325x that of a white person.If you are male, your chance of being killed is roughly 365/20 = 18.25x that of a female.I’m not saying that the protest is wrong. But when I see a black woman discussing how she’s afraid to go out at night because of police, despite the fact that she’s 1-(5/171*5.7) = 83% less likely to get shot than a white man, the racial aspect strikes me as rather superficial. I have no critique of the BLM advocacy; black people should not be killed by police at a higher rate than white people…. But it’s hard to get worked up about a movement where half of the people involved already have it much better than you do, and are campaigning to have it even better than they currently have it. If I’m not motivated to protest the more egregious sexual discrimination for my own sake, then I really can’t motivate myself to protest the lesser racial discrimination for theirs. ",
            "date": "Answered March 24, 2018",
            "views": "12",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "E. Sinsel",
                    "user_href": "/profile/E-Sinsel"
                },
                {
                    "user_id": "Kon Scheon",
                    "user_href": "/profile/Kon-Scheon"
                },
                {
                    "user_id": "Kenneth Childers",
                    "user_href": "/profile/Kenneth-Childers"
                },
                {
                    "user_id": "Aisah Mayford",
                    "user_href": "/profile/Aisah-Mayford"
                },
                {
                    "user_id": "A Brennan",
                    "user_href": "/profile/A-Brennan-3"
                },
                {
                    "user_id": "Jordan Sanon",
                    "user_href": "/profile/Jordan-Sanon-1"
                },
                {
                    "user_id": "Tiffany Law",
                    "user_href": "/profile/Tiffany-Law-3"
                },
                {
                    "user_id": "Praetorian",
                    "user_href": "/profile/Praetorian-7"
                },
                {
                    "user_id": "Ashley Maher",
                    "user_href": "/profile/Ashley-Maher-5"
                },
                {
                    "user_id": "Ana Tan",
                    "user_href": "/profile/Ana-Tan-28"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marcos Aurélio Rondineli de Oliveira",
                "href": "/profile/Marcos-Aurélio-Rondineli-de-Oliveira-1"
            },
            "answer_text": "Well… By saying Black lives matter, I’m saying, implicitly, that black people are different from yellow, red, and white people, which they’re not. So, lying is not a good start for a movement. All lives matter. That’s a non-racist politics, so the problem is violence, absence of understanding, not racism. Those are strong enough critiques for anyone to realize that this is a death at the birth situation. See… let’s solve it… from now on, black people can no longer be killed, yeah, but neither red, white, or yellow, nor albinos, indeed, humans can’t be killed by humans, intentionally, I mean. What is going to happen to the violent people, especially in law enforcement, if they decide to kill only the red, or yellow, they would choose the white instead? No, that’s absurd, they continue to kill the poor, but not the black. The blacks are poorer because they were slaves back a century ago, but same happened to red, yellow, and white. The Slavers are rich people, not colored, their color is money, gold, diamonds, precious minerals, rocks, not trees, cattle, or people, that’s blindness to us all. It’s … ridiculous a campaign restraining rights to this or that color. We preserve culture, not colors, we’re humans, all of us, from any color, and also albinos. Human… we are human, all of us and violence is against poor, rich black are not killed by the police with a knee on their neck. Let’s face it, the problem is social, not race… We’re one only species, each of the same kind and capabilities of any other. Let’s not direct it to mediatic colorific business… Life is not a paint and if it was, what’s so problematic with the colors God used to make us different beauties among ourselves? We’re all different, and hypocrisy is the name of our common disease, our inherited plague, in ourselves, perhaps in the DNA itself, since we don’t realize it for ourselves. The Sunlight makes our skins more yellowed at East, redder at West, more whitish those up North and darker at South because in the South the Sun spends more time than in the North, every year, every century, and perhaps… all the millenniums. The pyramids exhibit that prism, any pyramid, anywhere it’s found, it’s human-made, to understand we’re Sunlight oriented on our skins. We’re not blue, nor green, and green is the grass wherever it may be found, and some under the surface of the seas and our rivers. Color is abundant in nature, but not in humans? We need to pay more attention to who really we are. We’re divine, with or without God, life is a present, always and … not our future. We are learning beings… and that’s why we learn from our past. What color was Adam? And how about Eve? We… all descend from them. ",
            "date": "Answered August 5, 2020",
            "views": "406",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tarnima Andalib",
                    "user_href": "/profile/Tarnima-Andalib"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Allan Nilsson",
                    "user_href": "/profile/Allan-Nilsson"
                },
                {
                    "user_id": "Kenneth Bircher",
                    "user_href": "/profile/Kenneth-Bircher"
                },
                {
                    "user_id": "Robert Cody",
                    "user_href": "/profile/Robert-Cody-22"
                },
                {
                    "user_id": "Aisah Mayford",
                    "user_href": "/profile/Aisah-Mayford"
                },
                {
                    "user_id": "Ana Tan",
                    "user_href": "/profile/Ana-Tan-28"
                },
                {
                    "user_id": "Scott Goldman",
                    "user_href": "/profile/Scott-Goldman-34"
                },
                {
                    "user_id": "MJ Seitz",
                    "user_href": "/profile/MJ-Seitz"
                },
                {
                    "user_id": "Becca Anzalone",
                    "user_href": "/profile/Becca-Anzalone-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edward Conway",
                "href": "/profile/Edward-Conway"
            },
            "answer_text": "The biggest problem with BLM is that it is focused on anger, rather than solutions. I get that blacks are angry. They have every right to be angry, and I would be angry as Hell if I were in their shoes. Anger is not enough. Real change requires solutions. Solutions require understanding all sides of a dispute. Understanding requires people to hear each other out, and to articulate their experiences. If we as a society are going to solve this problem, we need to find answers to some key questions: How can we bring police officers and the communities they serve together, so that they know, understand, and can trust each other?How can we change the way civilians and police interact, so that everyone leaves these interactions alive?How can we channel the anger and mistrust into positive changes that make the sacrifices of the many good men and women on both sides who have died meaningful?BLM and all the other parties need to focus on those core questions. They need to sit down together and start working on the hard solutions. The vast majority of Americans want an end to the killing of black civilians. The vast majority of Americans want an end to the killing of police officers. Americans as a whole want solutions to this problem, and we need to make finding solutions the focus. I see anger, and I get that this anger is justified, but for these tragedies to mean anything, we need solutions. We need voices from all sides, and understanding of each other, to solve these problems. That needs to be the focus: how do we solve these problems. Not whose hashtag is better, not whose lives mean more or less, not even who did what wrong: how do we stop the killing and bring people together. The day that BLM makes that their focus is the day I will support them with all my heart. Until then, I can only shake my head in frustration at the many distractions people are fighting over. ",
            "date": "Updated September 8, 2020",
            "views": "19",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chaz Bowen",
                    "user_href": "/profile/Chaz-Bowen"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Bob Griscavage",
                    "user_href": "/profile/Bob-Griscavage"
                },
                {
                    "user_id": "XURUI HU",
                    "user_href": "/profile/XURUI-HU"
                },
                {
                    "user_id": "Samuel Soohoo",
                    "user_href": "/profile/Samuel-Soohoo"
                },
                {
                    "user_id": "Ross Dickey",
                    "user_href": "/profile/Ross-Dickey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andre Finn",
                "href": "/profile/Andre-Finn-1"
            },
            "answer_text": "It’s based on lies. Police do not kill blacks disproportionately, this is a lie based on faulty statistics. These statistics use general population but do not adjust for crime. There is also no evidence that these killings are racially motivated. 95% of those killed by police are male. Does this show that police hate males? Or is it because males commit most crime? Blacks make up 24% of those killed by police, but commit 27% of crimes, and about 30–50% of serious crimes. This lie is perpetuated by media reporting, who hardly ever report when whites or even Hispanics and Asians are killed by police, even though they are killed more frequently. Three people are killed by police every day, but a black person is only killed once every 1.5 days. This also does not adjust for age - the typical white person in America is 58 years old today, while the typical black person is 26 years old- who is more likely to be shot by police? The other lie is that police killings are a “genocide” or “public health crisis” when the fact is that police make 10 million arrests per year and only 1,000 result in a shooting, that’s 99.99% success rate. Out of the 1,000 shootings, over 90% were armed and threatening the officer, and out of the unarmed shootings that includes people trying to run over the officer with their car, reaching for the officer’s weapon, fighting back with fists, etc. Of the unjustified shootings, most of the time the officer was charged. The goal of BLM is Marxist revolution. note- this is not to say racism, legacy of racism, and institutionalized racism in the justice/prison system do not exist in America. Or that crime is correlated with poverty. Or that police reform is not necessary, and that policing cannot be improved. However it must be noted that BLM does not directly address any of these things. Although they take in millions, even billions of dollars in donations, it seems like all BLM does is promote demonstrations in the street. ",
            "date": "Answered September 14, 2020",
            "views": "159",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Andrea Herrero",
                    "user_href": "/profile/Andrea-Herrero"
                },
                {
                    "user_id": "Tiffany Law",
                    "user_href": "/profile/Tiffany-Law-3"
                },
                {
                    "user_id": "Ana Tan",
                    "user_href": "/profile/Ana-Tan-28"
                },
                {
                    "user_id": "Samuel Soohoo",
                    "user_href": "/profile/Samuel-Soohoo"
                },
                {
                    "user_id": "Vaan Cotton",
                    "user_href": "/profile/Vaan-Cotton"
                },
                {
                    "user_id": "Matthew Jensen",
                    "user_href": "/profile/Matthew-Jensen-2"
                },
                {
                    "user_id": "Richard Perez",
                    "user_href": "/profile/Richard-Perez-71"
                },
                {
                    "user_id": "Simon Kinahan",
                    "user_href": "/profile/Simon-Kinahan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fel Rouse",
                "href": "/profile/Fel-Rouse"
            },
            "answer_text": "I encourage those in the BLM movement to take a page from the Black Panther Party, if they haven’t already. I’m writing of the original BPP here. The original Black Panthers used to give out tracts and pamphlets to community residents, particularly young black men, with printed advice on them about what to do if they were stopped by police. They would patrol communities and when they saw a resident stopped by police, they would watch from a legal distance to observe the encounter. This can be done far more easily these days with cameras. If the police officer noticed them watching and told them to move along, they would quote from the Constitution and from local statutes that described how a police encounter could be legally observed from a specified distance. The BLM could have tutorials for residents throughout the country on how to speak, act, and move when encountered by police. They could have legal teams they could call to help people with bail, trials, and filing complaints of police abuse. They certainly could fund raise to help offset legal costs that are incurred by community residents when arrested. And, they could provide instruction and guidance for residents to combat crime in their communities, including helping start town-watch patrols and setting up personal security systems. These are not criticisms, I know, but I feel there will probably plenty of critical views available. ",
            "date": "Answered August 12, 2017",
            "views": "714",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chaz Bowen",
                    "user_href": "/profile/Chaz-Bowen"
                },
                {
                    "user_id": "Thomas McGuire",
                    "user_href": "/profile/Thomas-McGuire-5"
                },
                {
                    "user_id": "E. Sinsel",
                    "user_href": "/profile/E-Sinsel"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Aisah Mayford",
                    "user_href": "/profile/Aisah-Mayford"
                },
                {
                    "user_id": "Steve Seidel",
                    "user_href": "/profile/Steve-Seidel-2"
                },
                {
                    "user_id": "Brandon Xia",
                    "user_href": "/profile/Brandon-Xia-2"
                },
                {
                    "user_id": "Dustin Rausch",
                    "user_href": "/profile/Dustin-Rausch"
                },
                {
                    "user_id": "Jonna Edelen",
                    "user_href": "/profile/Jonna-Edelen"
                },
                {
                    "user_id": "Sahil Ramane",
                    "user_href": "/profile/Sahil-Ramane-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charles Locke",
                "href": "/profile/Charles-Locke-1"
            },
            "answer_text": "(1) Their media spokespeople leave much to be desired. Whenever I watch them in one-on-one interview settings, be it CNN or where ever, they usually come across like arrogant, one-note jackasses. I get the youthful energy and all of that. We all think we know more than we do at that age. But these guys have a way of turning off people who actually agree with them. Evidently, somewhere in their relatively short lifespans they bought into the notion that diplomacy and “big picture” persuasiveness is a sign of weakness; and that somehow being narrow-minded and stubborn is a show of strength and character. I would advise that they consider the temperament of a gentleman like CNN’s Van Jones, who is no doubt an advocate of the BLM cause, but leagues more personable to a larger swath of people. (2) The fact that BLM is more of a spiritual/sentiments/ideas movement, and not so much a full-fledged organization, leaves a lot of room for confusion. It seems that anybody can go out and do whatever in the name of BLM. Sometimes that’s a good thing. Sometimes it’s a really bad thing. (3) As others have said, it is difficult to applaud a movement dubbed “Black Lives Matter” that seems so fixated on police-based homicides yet so dismissive of non-police homicides, which needless to say outweigh the former. Indeed, it comes off as a rather glaring contradiction at best. But if that’s what the movement is about, that’s what it’s about, and what it isn’t about is probably not worth a long, drawn-out squabble. ",
            "date": "Updated August 13, 2016",
            "views": "43",
            "upvotes": " View 43 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Logan Michael Lemaire",
                    "user_href": "/profile/Logan-Michael-Lemaire"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brenda Barlow",
                "href": "/profile/Brenda-Barlow"
            },
            "answer_text": "What are the strongest critiques of “Black Lives Matter” movement? The thinking of white Americans that African Americans have no right to want to “matter”. The simple truth is an expressed desire to enjoy the same rights” of protections as all Americans. Questioning stated cause and/or adding to the conversation “all life matters ”; or some other distractions to their purpose such as terriorists; and/or by choosing just to disbelieve BLM’s defined messaging that is clearly stated over and over, is attempt to deflect. “Black Lives Matters” are voices to raise awareness that systemic racism towards Black citizens, including but not limited to the brutal, horrific and unjustified shootings by law enforcement of African Americans citizens is not right and must stop. The messaging is that Civil Rights is for all Americans, including Black Lives and to be enjoyed by everyone.The African American experience should be significantly better in 2017, but it isn't. So African Americans are using there voices and American’s “freedom of speech rights” to let it be known that Black Lives Matter just as much as all other Americans. Definition of Terrorist Group: Act of terrorism, terrorism, terrorist act - the calculated use of violence (or the threat of violence) against civilians in order to attain goals that are political or religious or ideological in nature; this is done through intimidation or coercion or instilling fear. ",
            "date": "Answered October 13, 2017",
            "views": "978",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Antonella Femia",
                    "user_href": "/profile/Antonella-Femia-1"
                },
                {
                    "user_id": "Yuriy Lyashchuk",
                    "user_href": "/profile/Yuriy-Lyashchuk"
                },
                {
                    "user_id": "Aisah Mayford",
                    "user_href": "/profile/Aisah-Mayford"
                },
                {
                    "user_id": "Daniel Wolf",
                    "user_href": "/profile/Daniel-Wolf-3"
                },
                {
                    "user_id": "Diane Palmer",
                    "user_href": "/profile/Diane-Palmer-5"
                },
                {
                    "user_id": "Adam Rowling",
                    "user_href": "/profile/Adam-Rowling"
                },
                {
                    "user_id": "Rachel Winters",
                    "user_href": "/profile/Rachel-Winters-5"
                },
                {
                    "user_id": "Linda Nguyen",
                    "user_href": "/profile/Linda-Nguyen-41"
                },
                {
                    "user_id": "Kei",
                    "user_href": "/profile/Kei-41"
                },
                {
                    "user_id": "Jennifer Brown",
                    "user_href": "/profile/Jennifer-Brown-118"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Weill",
                "href": "/profile/Andrew-Weill"
            },
            "answer_text": "I’m generally a supporter. But I’m not uncritical. A few come to mind: Some followers have tried to tie BLM with the anti-Zionist BDS movement. I would like to believe that this is based on ignorance of BDS’s goals. In any event, I believe this tie is unnecessary, uncalled for, and in fact detrimental.At times, I believe some BLM supporters reflexively recirculate questionable narratives. I fully believe in the existence of systemic racism in many institutions in society. I also believe that altogether too many incidents of police violence involve racism. But I do not believe that one should rush to judgment or disregard evidence to the contrary. Yes, there should be examination of incidents. But it should be fair examination, not prejudgment. Critical appraisal of all allegations is essential for a movement to have moral authority.There are occasions where I find some — remember, the word is “some”, not “all” — BLM supporters to be intolerant of viewpoints other than what they deem to be appropriate. This can take many forms, including insistence on particular jargon. In my view, this tends to lead to diminishment of authentic communication and the perpetuation of a sort of group-think.Every so often, I’ll run into a BLM supporter who tries to tell me that I can’t possibly understand any of the issues, or that I must necessarily defer to their point of view, merely because of the color of my skin. That’s just silly.I emphasize: these are occasional and situational issues, and I should be viewed as generally a supporter of BLM. I tend to have considerably more, and louder, criticisms of their opponents. ",
            "date": "Answered November 16, 2016",
            "views": "121",
            "upvotes": " View 467 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chris Peter",
                    "user_href": "/profile/Chris-Peter-60"
                },
                {
                    "user_id": "Logan Michael Lemaire",
                    "user_href": "/profile/Logan-Michael-Lemaire"
                },
                {
                    "user_id": "Paul Kellner",
                    "user_href": "/profile/Paul-Kellner-3"
                },
                {
                    "user_id": "D. C. Amber",
                    "user_href": "/profile/D-C-Amber"
                },
                {
                    "user_id": "Gary Grant",
                    "user_href": "/profile/Gary-Grant-150"
                },
                {
                    "user_id": "Jon Whitlow",
                    "user_href": "/profile/Jon-Whitlow-1"
                },
                {
                    "user_id": "M Harris",
                    "user_href": "/profile/M-Harris-26"
                },
                {
                    "user_id": "Reed Hansen",
                    "user_href": "/profile/Reed-Hansen-4"
                },
                {
                    "user_id": "Mirek Kowal",
                    "user_href": "/profile/Mirek-Kowal-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raven Williamson",
                "href": "/profile/Raven-Williamson"
            },
            "answer_text": "I dont know . I have my own. Black lives matter ,to black people ,only when a white person kills on of us. Blacks have been killing blacks for years ,and where were the \"black lives matter\" signs? Black lives , DONT MATTER!!! until they matter to the people that have black lives.....Black People!!! When we stop killing each other , they we can truly say \" Black Lives Matter! beause ,those lives must matter to \"US \"  first ,before we can point the finger at anyone else!!!! other than that, it's being hyprocirtical. Would you tell your child \" Dom't do drugs\" while smoking crack ? We are treated the way we are , because people see ,we  have no respect for each other. Change the way you are viewed ,you change the way people see you. There was a song called \"Respect Yourself. BY THE STAPLE SINGERS. If you disrespect anybody that you run in to How in the world do you think anybody's s'posed to respect you If you don't give a heck 'bout the man with the bible in his hand, y'all Just get out the way, and let the gentleman do his thing You the kind of gentleman that want everything your way, yeah Take the sheet off your face, boy, it's a brand new day Respect yourself, respect yourself, respect yourself, respect yourself If you don't respect yourself Ain't nobody gonna give a good cahoot, na na na na Respect yourself, respect yourself, respect yourself, respect yourself ",
            "date": "Answered March 9, 2016",
            "views": "26",
            "upvotes": " View 28 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eric Wagnon",
                    "user_href": "/profile/Eric-Wagnon-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joe Mills",
                "href": "/profile/Joe-Mills-23"
            },
            "answer_text": "I think back to a fantastic Reagan speech when I consider most of the Black Lives Matter movement, which I recommend all of you listen to, when he goes, “The trouble with our Liberal friends is not that they're ignorant; it's just that they know so much that isn't so.” Black Lives Matter as a movement is largely founded upon the notion that there exists such systemic racism in the United States that a young black teen was shot and killed for simply being in the wrong neighborhood and his killer was not brought to justice(Trayvon Martin). Which, while certainly being a heart wrenching story, is entirely incorrect. When you beat a person’s head into the sidewalk, you’re inviting lethal force be used against yourself. Much of the movement has continued on in the same fashion. Ferguson Missouri was where I first became aware of the movement, following an altercation between Mike Brown and a police officer. For weeks the movement repeated the lie that he had his hands in the air when shot, while the coroners report showed otherwise. Ultimately, I believe that to be the biggest criticism of the movement. It’s based on a victim-hood mentality that resorts to making the available evidence fit a pre-conceived idea, as opposed to allowing an investigation (or the evidence) come to light in a manner such that we can have a rationalized conversation on the topic. ",
            "date": "Answered July 30, 2020",
            "views": "334",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Latagia Copeland-Tyronce",
                    "user_href": "/profile/Latagia-Copeland-Tyronce"
                },
                {
                    "user_id": "Christopher Fredrick Allen",
                    "user_href": "/profile/Christopher-Fredrick-Allen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Uriah A. Blacke",
                "href": "/profile/Uriah-A-Blacke"
            },
            "answer_text": "Ooh. This’ll be fun. I’ve been waiting to take a crack at this for a while. ><><><>< Approximately 1% of all killings by police officers are black people. I’m sorry. We’ve been lied to.Black people are statistically more likely to break the law at some point in their life. This doesn’t mean they’re all criminals, or that they can’t turn around. They’re just more likely to.Black Lives Matter is a section of the Social Justice movement, which is the mother of Third Wave Feminism, and the notion that only Caucasians can be racist, since they supposedly are the only race that benefits from racism.Many of the boys and men killed by police officers had or still had ties to criminal activity at the time of their untimely death.The movement is indirectly responsible for the modern coining of the term “white privilege”, which is just not true. If it was, Barack Obama couldn’t have been nominated as the American Democratic Party’s lead candidate, or have been elected President of the Unites States altogether.Many protests for Black Lives Matter have become violent, yet the movement has been compared to the Civil Rights Movement of the 1950s, 60s, and early 70s.",
            "date": "Answered September 27, 2016",
            "views": "798",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chaz Bowen",
                    "user_href": "/profile/Chaz-Bowen"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Suade Bergemann",
                    "user_href": "/profile/Suade-Bergemann"
                },
                {
                    "user_id": "Aisah Mayford",
                    "user_href": "/profile/Aisah-Mayford"
                },
                {
                    "user_id": "James Bell",
                    "user_href": "/profile/James-Bell-230"
                },
                {
                    "user_id": "Leilani Pigatt",
                    "user_href": "/profile/Leilani-Pigatt"
                },
                {
                    "user_id": "Anna Richter",
                    "user_href": "/profile/Anna-Richter-1"
                },
                {
                    "user_id": "Samuel Soohoo",
                    "user_href": "/profile/Samuel-Soohoo"
                },
                {
                    "user_id": "Christopher Allenza",
                    "user_href": "/profile/Christopher-Allenza"
                },
                {
                    "user_id": "Jana Knezevic",
                    "user_href": "/profile/Jana-Knezevic"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathan Ketsdever",
                "href": "/profile/Nathan-Ketsdever"
            },
            "answer_text": "Here are two: Community Policing. They have a list of 10 demands. One of the 10 has to do with getting rid of community policing, but there are some huge benefits to community policing.Methods and Means. Some of the methods seem questionable. Some of this is that people take advantage of the movement. True non-violence protest wouldn’t seem to spill over into this violence and chaos.I think the way the movement is framed creates lots of distractions, as opposed to focusing on the real issues.  I’ll say the violence and chaos seems to depend a bit on the city, although there has been some everywhere. It’s worth noting in the case of the early June outbreak, the primary issues were around 5 pm to midnight. Although, I think curfews were declared between 8pm to 10 pm in many of the cities. In Washington DC the extent of the violence and the source of that violence seemed to be mixed. I’m glad to see that the 2nd Saturday of marches finally subside. The problem with the marches that turn violent is they only escalate the rationalization of the violence used against them. There are videos of individual groups doing good and these should be highlighted. Violence in the movement doesn’t solve anything. And its terrrible, terrible PR for the movement.  To the extent that the leaders of BLM have failed to denounce violence and actually encourage it in various interviews and news coverage, Martin Luther King Jr’s Letter from a Birmingham Jail is insightful as a critique. King in some sense is also a critique of the CRT model of approach to race issues. ",
            "date": "Updated August 5, 2020",
            "views": "462",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michel Green",
                    "user_href": "/profile/Michel-Green-2"
                },
                {
                    "user_id": "Marie Powers",
                    "user_href": "/profile/Marie-Powers-18"
                },
                {
                    "user_id": "John Wieja",
                    "user_href": "/profile/John-Wieja"
                }
            ]
        },
        {
            "author_info": {
                "name": "Honey Maya",
                "href": "/profile/Honey-Maya"
            },
            "answer_text": "The audience it targets. Here’s the reality: Most teens and young adults on the internet are not intentionally racist, they understand it is wrong and they strive to do better. Most adults and elderly too recognise a change and support it. There are racist people and those whom are racist will stay racist even if you scream until you’re blue. When teens post photos or protest in the name of BLM, it reaches an audience of thousands of teens who are doing the exact same thing! They don’t need to be convinced, they already are. The people that need to be convinced are the ones who can’t be convinced and that is why the frustration within this movement is so evident, the sad truth is that whilst black lives matter, we will not be able to reach true equality within this generation. It will be the children of these internet savvy teenagers who will be raised to know that racism is UNACCEPTABLE. It will be their generation in which true equality will be founded. It is an ugly truth but a truth nonetheless. Yes, we must still fight for change, but the reality is this, BLM is an important cause that can’t change the minds of those who make their cause needed. Racism is institutionalised in our society, we need to change our society and then we will rid ourselves of racism.  ",
            "date": "Answered June 3, 2020",
            "views": "837",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tom Giles",
                    "user_href": "/profile/Tom-Giles-16"
                },
                {
                    "user_id": "Adam Hill",
                    "user_href": "/profile/Adam-Hill-135"
                },
                {
                    "user_id": "Akshaj Purandare",
                    "user_href": "/profile/Akshaj-Purandare-1"
                },
                {
                    "user_id": "Suade Bergemann",
                    "user_href": "/profile/Suade-Bergemann"
                },
                {
                    "user_id": "Aisah Mayford",
                    "user_href": "/profile/Aisah-Mayford"
                },
                {
                    "user_id": "Marc Green",
                    "user_href": "/profile/Marc-Green-21"
                },
                {
                    "user_id": "Jessica Rem",
                    "user_href": "/profile/Jessica-Rem-2"
                },
                {
                    "user_id": "Dihandrijayanti",
                    "user_href": "/profile/Dihandrijayanti"
                },
                {
                    "user_id": "Kelli Nakamura",
                    "user_href": "/profile/Kelli-Nakamura-2"
                },
                {
                    "user_id": "Liz Marsh",
                    "user_href": "/profile/Liz-Marsh-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andy Zhang",
                "href": "/profile/Andy-Zhang-160"
            },
            "answer_text": "They are just a desperate group who refuse to actually put efforts in improving their conditions but choose to ignore the real problem, blame the obvious target and victimize themselves for sympathy. An obvious argument for this is that 90% black people death are caused by black people, while kills made by cops is said to be less than 1%. Yet the media did not heisitate to put extra gas on the fire, after all that’s how they make a living. And so there goes this so called BLM movement. Blaming won’t help anyone. Unless the black community as a whole decides to make a change from within, the situation is not going to change. US is a liberal country, that means nobody should tell you what to do, but it also means nobody would help you unless you decide to help yourself first. Since helping you before you show your intention equals to telling you what to do. Like if I told any black people how they could put more decipline in themselves in order to improve their condition, then I were getting over myself. Unless they are already doing that. Yet if they are already doing that, there would be no need to say anything. ",
            "date": "Updated August 12, 2020",
            "views": "605",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Barry van Wagner",
                    "user_href": "/profile/Barry-van-Wagner"
                },
                {
                    "user_id": "Renee Tupaz",
                    "user_href": "/profile/Renee-Tupaz-1"
                },
                {
                    "user_id": "Ashley Maher",
                    "user_href": "/profile/Ashley-Maher-5"
                },
                {
                    "user_id": "Svein Langeteig",
                    "user_href": "/profile/Svein-Langeteig"
                },
                {
                    "user_id": "Keith Jackson",
                    "user_href": "/profile/Keith-Jackson-82"
                },
                {
                    "user_id": "Steve Bertschi",
                    "user_href": "/profile/Steve-Bertschi-1"
                },
                {
                    "user_id": "Misaki Amasawa",
                    "user_href": "/profile/Misaki-Amasawa"
                },
                {
                    "user_id": "Eric Fischer",
                    "user_href": "/profile/Eric-Fischer-18"
                },
                {
                    "user_id": "Brenda Barlow",
                    "user_href": "/profile/Brenda-Barlow"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maciel Krutko",
                "href": "/profile/Maciel-Krutko-2"
            },
            "answer_text": "\"You're not allowed to tell black people how to react, or how to protest\". Let's take race out of it. We're allowed to tell ANYONE what the limits of their actions are, regardless of their race or their grievance. Because we're living in a SOCIETY (cue George Costanza). And because, you know, we're all equal before the law. Are people unable to think critically about the logical implications of what they say? This morning I woke up to a video of a husband and wife in NY trying to defend themselves from looters. 4 men then proceeded to beat them with fists and 2x4 planks of wood. This was an older woman, and I watched it from several different angles. I'm not even going to post the video. Given the expert intersectional unlogic that so many of my well-intentioned but ideologically deluded friends have provided for me, I am not allowed to opine that smashing innocent women in the face with a 2x4 isn't an acceptable protest or acceptable reaction to their grievance. I should just shut up and flog myself to rid myself of my privilege, apparently. This is just one example of the many ludicrous slogans repeatedly plastered over my feeds but the only one I feel like addressing at the moment, for cathartic reasons. ",
            "date": "Answered June 2, 2020",
            "views": "511",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Ryan Hall",
                    "user_href": "/profile/Ryan-Hall-34"
                },
                {
                    "user_id": "Sathyajith M S",
                    "user_href": "/profile/Sathyajith-M-S"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Spahn",
                "href": "/profile/Daniel-Spahn"
            },
            "answer_text": "Black lives don’t matter to them. -They are a very pro-abortion group. Abortion was expanded by Margaret Sanger as a method of genocide against blacks- specifically their race! -they express their anger by burning down the life’s work of POC’S who are trying to make a better life for themselves. -their political causes champion the destruction of many things that have made the western world prosperous. That’s a paraphrase and summary based on their own website. if they are against racism then why can’t we say ‘all lives matter’? Seems odd that they want to fight racism by point out race. Don’t we all bleed red anyway? From a Christian standpoint, are we all members of the human race and all equally in need of forgiveness? Why not make this a pan-race approach and truly need it people by eradicating racism? I’m not against blacks or any other race and am generally color blind- I have a hard time distinguishing many of the races anyway- but the politics of the BLM movement is something I cannot get behind. I have checked my viewpoints with my friends and have no disagreement- including blacks, whites, and Asians. Not sure if some might be Hispanic or other variants on these but they have confirmed that I do have a healthy viewpoint on this and they agree with me. ",
            "date": "Answered August 9, 2020",
            "views": "17",
            "upvotes": " View 41 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Yuriy Lyashchuk",
                    "user_href": "/profile/Yuriy-Lyashchuk"
                },
                {
                    "user_id": "Aisah Mayford",
                    "user_href": "/profile/Aisah-Mayford"
                },
                {
                    "user_id": "Kelvin Griffiths",
                    "user_href": "/profile/Kelvin-Griffiths-1"
                },
                {
                    "user_id": "Dean Velasco Jr.",
                    "user_href": "/profile/Dean-Velasco-Jr"
                },
                {
                    "user_id": "Aria Elizabeth Love",
                    "user_href": "/profile/Aria-Elizabeth-Love"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charles Park",
                "href": "/profile/Charles-Park-123"
            },
            "answer_text": "It is swimming in money from so very many donations, but it doesn’t establish scholarships for black high school graduates, it doesn’t rebuild black-owned businesses which were destroyed by terrorist looters, it doesn’t invest in tutoring/mentoring programs for black teenagers who need guidance from elders, it doesn’t invest in tutors/teachers who can offer supplementary educational assistance to black kids who attend failing schools and/or are the modern day children being left behind, it doesn’t provide free-of-charge social services (covering the dangers of STDs, teenage pregnancy, drinking and driving, and drugs) in needy neighborhoods, it doesn’t provide low-interest or interest-free loans to aspiring black entrepreneurs, it doesn’t invest in vocational programs for young blacks for whom college may not be an option but who could definitely build stable lives through trades. It disrupts the western family model in a country where 7 of 10 black babies are born out of wedlock - it therefore fosters the very family instability that causes exhausting, tiring, vicious, and frequent dysfunctionality in the lives of young blacks. It lies about how certain young blacks died; it claims they were murdered when they were killed but not through criminal homicide. It does nothing to stop its potesters from harassing, threatening, and assaulting bystanders and anyone who won’t raise a fist. ",
            "date": "Answered September 5, 2020",
            "views": "73",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Bryan Rosander",
                    "user_href": "/profile/Bryan-Rosander"
                },
                {
                    "user_id": "Janie Dunn",
                    "user_href": "/profile/Janie-Dunn"
                },
                {
                    "user_id": "David Williams",
                    "user_href": "/profile/David-Williams-328"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Henry",
                "href": "/profile/James-Henry-122"
            },
            "answer_text": "Black Lives Matter came about mostly because of the Mike Brown case in Ferguson, Mo. I know that wasn’t their actual start, but that is when they picked up steam. This movement (or organization) claims that black men are being killed in disproportionate numbers when compared to white men. If you look solely at the numbers this is blatantly false. About twice as many white men are killed each year by cops than black men. If you dig just a tiny bit past that you’ll see what they’re talking about though. If you adjust the numbers by population you’ll find that white men have a 0.000246% chance of being killed by a cop. That number more than doubles to 0.000567%. This is clearly proof that cops are racist against black men, right? After all, if you have a higher chance of being killed because you’re black that means cops are bad. It might mean that, if you decided to stop your research exactly at the point where you find the numbers that you want to find. So let’s look at it a little bit more. Men (white and black) have a 0.000608% of being killed by police and women have a 0.000042% chance. Huh, so men are killed at a rate of 15 times higher than that of women. Maybe they should rename the movement Male Lives Matter. ",
            "date": "Answered September 29, 2017",
            "views": "775",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Shivam Gupta",
                    "user_href": "/profile/Shivam-Gupta-3925"
                },
                {
                    "user_id": "Stephanie Rivera",
                    "user_href": "/profile/Stephanie-Rivera-453"
                },
                {
                    "user_id": "Ashley Glasgow",
                    "user_href": "/profile/Ashley-Glasgow"
                },
                {
                    "user_id": "Rivki Schwartz",
                    "user_href": "/profile/Rivki-Schwartz"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Whitesell",
                "href": "/profile/John-Whitesell-3"
            },
            "answer_text": "I am going to cite my answer for John Whitesell's answer to Have you become more aware of having white privilege since movements like Black Lives Matters and videos of unfair racial treatment by police? What BLM should have done: -Cooperate with police departments to reduce the brutality of police tactics. -Lobby for more women of color to become cops (women of color are theoretically less brutal and less racist than other candidates for police officers). -Lobby for subsidies for self-employed entrepeneurs of color. -Lobby for subsidies for small businesses run by people of color. -Lobby for peer mentoring and/or police mentoring for adolescents of color (father-figures reduce crime rates, that’s an empirical fact). -Lobby for restrictions on divorce (fatherless homes are more vulnerable to producing criminals). What BLM actually does: -Riot. -Block Roads. -Loot businesses during riots. -Condone through silence racial hate crimes done against Caucasians, such as #BLMKidnapping. -Complain about White Privilege. -Expect to be respected despite all of the above. ",
            "date": "Answered May 8, 2018",
            "views": "371",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Amanda Combs",
                    "user_href": "/profile/Amanda-Combs-67"
                },
                {
                    "user_id": "Don Dondoyano",
                    "user_href": "/profile/Don-Dondoyano"
                },
                {
                    "user_id": "Michael Askins",
                    "user_href": "/profile/Michael-Askins-1"
                },
                {
                    "user_id": "Nirav Domah",
                    "user_href": "/profile/Nirav-Domah"
                },
                {
                    "user_id": "Alan Wilton",
                    "user_href": "/profile/Alan-Wilton-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joan Hoffman",
                "href": "/profile/Joan-Hoffman-1"
            },
            "answer_text": "I think it's unnecessarily divisive. It's not only black people who are killed by police, or Hispanics. I can think of two white men in my area who were killed by police in the last year. Neither was committing a crime, but in both cases it was determined the police had reason to fear for their lives. And just the other day a video came out of a young unarmed white man being killed by police in Fresno, California. New video shows portion of deadly Fresno police shooting “All Lives Matter” isn't focused enough, not to mention it makes people mad. It seems to me that the real issue is “Suspects’ Lives Matter,” which sadly doesn't make a very good chant. Once someone is a suspect, some police officers seem to be so on edge that anything unexpected can be interpreted as a threat to their lives, and then anything can happen. If the movement focused directly on that issue, there wouldn't be as much controversy on whether it’s “Black Lives” or “All Lives.” ",
            "date": "Answered July 10, 2016",
            "views": "27",
            "upvotes": " View 30 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Aisah Mayford",
                    "user_href": "/profile/Aisah-Mayford"
                },
                {
                    "user_id": "Patrice Green",
                    "user_href": "/profile/Patrice-Green-35"
                },
                {
                    "user_id": "Renee Tupaz",
                    "user_href": "/profile/Renee-Tupaz-1"
                },
                {
                    "user_id": "Bob Dole",
                    "user_href": "/profile/Bob-Dole-493"
                },
                {
                    "user_id": "Andrea Herrero",
                    "user_href": "/profile/Andrea-Herrero"
                },
                {
                    "user_id": "Luana Bogić",
                    "user_href": "/profile/Luana-Bogić"
                }
            ]
        },
        {
            "author_info": {
                "name": "Damien Paul",
                "href": "/profile/Damien-Paul-6"
            },
            "answer_text": "The strongest critique is that the basis of BLM is a complete fraud. The last thing in the world Black Lives Matter is concerned about is black lives. They’d be demanding more policing if that were the case. 7400 black Americans die at the hands of other black Americans every year. More effective policing would put a dent in that and save…..black lives. The only lives BLM are concerned about are black folks killed by white police officers. That number was ten (10) last year. Turns out that 9 of the 10 were not unlawful. The tenth case was prosecuted. That black men are being gunned down in the street by racist police officers is just not true. It is a delusion perpetrated by BLM and related groups. BLM is a violent political group piggybacking on a black community long manipulated by the American left. the goal is, and always has been…..power. ",
            "date": "Answered June 21, 2020",
            "views": "214",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Carl Jacobson",
                    "user_href": "/profile/Carl-Jacobson-2"
                },
                {
                    "user_id": "Laurence Gillespie",
                    "user_href": "/profile/Laurence-Gillespie"
                },
                {
                    "user_id": "Brian Machesney",
                    "user_href": "/profile/Brian-Machesney-1"
                },
                {
                    "user_id": "Daniel Boerger",
                    "user_href": "/profile/Daniel-Boerger-1"
                },
                {
                    "user_id": "Michael Nagle",
                    "user_href": "/profile/Michael-Nagle-12"
                },
                {
                    "user_id": "David Gernhart",
                    "user_href": "/profile/David-Gernhart-1"
                },
                {
                    "user_id": "John Freeberg",
                    "user_href": "/profile/John-Freeberg-1"
                },
                {
                    "user_id": "Bill Collins",
                    "user_href": "/profile/Bill-Collins-133"
                },
                {
                    "user_id": "Aaron Loebeck",
                    "user_href": "/profile/Aaron-Loebeck"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joe Pepersack",
                "href": "/profile/Joe-Pepersack"
            },
            "answer_text": "The strongest critique I have of “Black Lives Matter” is that their branding sucks. It’s inherently racist and divisive. I have yet to hear a cogent response to the question why saying “White Lives Matter” is racist and offensive but “Black Lives Matter” isn’t. Racism is completely unacceptable in our society.Police brutality and misconduct are completely unacceptable in our society. Those are real problems that need to be addressed. They require all of us, of all races and all political affiliations, to work together to fix them. That’s not going to happen unless you come up with inclusive messaging. The problem is that when you say “Black lives matter,” what conservative white people hear is “Your life doesn’t matter”. That’s bad branding and messaging. How hard is it to come up with slogans that protest racial injustice and police brutality that don’t make conservative white people feel like they’re being personally attacked, or (even better) actually appeal to the things they say they care about, like accountability and responsibility? There are more effective ways of getting your message out than a slogan that’s going to antagonize people whose support you need to actually change things. ",
            "date": "Answered October 16, 2020",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William Reich",
                "href": "/profile/William-Reich-13"
            },
            "answer_text": "There are two facets of BLM. There is the grassroots effort to end mistreatment of People of Color by law enforcement and there the people who founded the movement and some other self-appointed spokespersons. I support the grassroots effort 100% and have no criticism to offer. Those who claim to speak for BLM and demand other, far-reaching changes in our society may not even want a reform of police behavior. If we seriously address police behavior, they will lose their rank and file. All that will be left will be the extremists and those who only want to see the world burn. ",
            "date": "Answered September 5, 2020",
            "views": "80",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nathan Ye",
                "href": "/profile/Nathan-Ye-4"
            },
            "answer_text": "They do too much stupid shit and are overly antagonistic to anyone who even mildly critizes them. Just recently, Black Lives Matter Canada called Justin Trudeau “a white supremacist”. That's right. Justin fucking Trudeau, self proclaimed feminist and poster child for the progressive left is apparently a white supremacist.  They are overly disrespectful to police officers, and just about anyone who does not completely agree with them. Reminder the time they interrupted the Toronto gay pride parade so they could talk about their own issues? They also provoke violence against police officers, start riots, and even support racism   That is a tweet from the co-founder of Black lives matter Canada, I thought they were supposed to be against racism? So killing white people is ok now? Honestly, I've had it with their bullshit. I used to be neutral on thembut they've slowly become worse and worse by the day. Honestly, they do more harm than good for their cause. I mostly agree in principal, but the execution is goddamn terrible. Side note, if they really cared about black communities, they should address black-on-black killings, which cause the most death in black communities instead of focusing on the few cases of police shootings(many of which were justified). ",
            "date": "Answered February 5, 2017",
            "views": "27",
            "upvotes": " View 31 Upvoters",
            "upvoters": [
                {
                    "user_id": "Diane Dorbin",
                    "user_href": "/profile/Diane-Dorbin"
                },
                {
                    "user_id": "Logan Michael Lemaire",
                    "user_href": "/profile/Logan-Michael-Lemaire"
                },
                {
                    "user_id": "Paul Kellner",
                    "user_href": "/profile/Paul-Kellner-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Trask",
                "href": "/profile/Tom-Trask"
            },
            "answer_text": "As far as I can see the biggest problem is white people that don’t see excessive use of force as a white problem as long as black people bear the brunt of it. BLM needs some amount of cooperation from the community at large but the community at large seems to spend a lot of time taking the legitimate claims of racially inequitable treatment as a personal accusation of racism. The only racism here is when people of my racial cohort think “well I’m ok with the status quo and they should just walk it off…and stop when the cop says stop”. Dismissing the claims of some other group than my own is easy - Fox news is full of instructional videos on this. Seeing their grievances as statistically plausible claims is a bit harder and then letting them drive the show with my backing is just really hard. ",
            "date": "Answered July 17, 2016",
            "views": "694",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lauren Campbell",
                "href": "/profile/Lauren-Campbell-21"
            },
            "answer_text": "They come up with their narratives preemptively before any real evidence has been provided. In many cases, all they need to know is that a black person got shot by a police officer before they label it was “racism” and move to protest. They don’t seem at all interested in hearing the circumstances around the shooting before they simply declare that it was racially motivated and unjustifiable. Some even well-known members of BLM have openly hateful messages  Black Lives Matter Toronto speaks out on controversy over 'cuss/kill' tweet BLM protesters have stormed numerous events to get their message across at the expense of others. On numerous occasions they have halted LGBTQ events. Politics on parade: How Black Lives Matter halted a gay pride parade in Toronto Black Lives Matter crashes LGBT mural unveiling in Toronto The manner in which some have stormed and shut down events has been nothing short of unacceptable. This isn’t even going into the violence and anti-cop rhetoric that has been spread by some members of BLM. ",
            "date": "Updated June 17, 2017",
            "views": "96",
            "upvotes": " View 161 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Suade Bergemann",
                    "user_href": "/profile/Suade-Bergemann"
                },
                {
                    "user_id": "Renee Tupaz",
                    "user_href": "/profile/Renee-Tupaz-1"
                },
                {
                    "user_id": "Ashley Maher",
                    "user_href": "/profile/Ashley-Maher-5"
                },
                {
                    "user_id": "Dean Velasco Jr.",
                    "user_href": "/profile/Dean-Velasco-Jr"
                },
                {
                    "user_id": "Mike Anderson",
                    "user_href": "/profile/Mike-Anderson-340"
                },
                {
                    "user_id": "Adriaan Kovac",
                    "user_href": "/profile/Adriaan-Kovac"
                },
                {
                    "user_id": "Matthew Putnins",
                    "user_href": "/profile/Matthew-Putnins"
                },
                {
                    "user_id": "Curtis Smith",
                    "user_href": "/profile/Curtis-Smith-60"
                },
                {
                    "user_id": "Walter Chow",
                    "user_href": "/profile/Walter-Chow"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bobby L Welbor",
                "href": "/profile/Bobby-L-Welbor"
            },
            "answer_text": "Anytime you call for any preferential treatment for a particular group regardless of circumstances involved, there will be supporters and definitely detractors. BLM has a lot of both throughout the world. Minority empowerment movements are nothing new, the 1960s and 1970s spawned many of them including the Black Panthers and the growth of the Nation of Islam to name a few. What makes BLM unique in my eyes are two things: the growing numbers of white people involved in their cause and of course my least favorite action the burning of American symbols and destruction of businesses (many ironically owned by minorities). The fact that they have recruited or attracted white people definitely separates them from other movements that didn’t want to do that. The extreme radicals within their movement have not been called out by peaceful members in large part and that fact has placed them all in the eyes of many with other historical terrorist groups. ",
            "date": "Answered July 13, 2020",
            "views": "215",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Renee Tupaz",
                    "user_href": "/profile/Renee-Tupaz-1"
                },
                {
                    "user_id": "Andrea Herrero",
                    "user_href": "/profile/Andrea-Herrero"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jule Teasley",
                "href": "/profile/Jule-Teasley"
            },
            "answer_text": "I see nothing in this that is true. Article One of the Constitution states that Blacks are 3 fifthsof a human being. There have been centuries of institutions saying Black lives do not matter from Jim Crow laws to Black Codes and spitting on a little girl who simply wants an education. Lynchings or killings by vigilantes, shot by police for no reason. One of the Stasi s you mentioned is: 90% of Blacks are killed by Blacks. But, alas 83% of Whites are killed by Whites. But Blacks are less than 15% of the total. 73 percent of the population are white. If the Black population are so much trouble then it makes you wonder how all those miscreants got here in the first place. I’ll tell you how. Illegal immigration. All of those “slave ships” weren’t filled with persons who were destined to only pick cotton. Some of them were filled with teenagers for Pedophiles, some with women who were destined for prostitution, some for medical experimentation. It is an inconvenient truth that is hardly spoken. Black lives do matter. ",
            "date": "Answered June 4, 2018",
            "views": "304",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Thomas Hobbes",
                "href": "/profile/Thomas-Hobbes-13"
            },
            "answer_text": "I would like to quote a response I gave to an Anonymous person about BLM “‘False! Police Violence is much less of a factor for black deaths than black on black violence! Police Violence against Black Men Is Rare Table 43 Race and ethnicity in the United States - Wikipedia List of ethnic groups in the United States by household income - Wikipedia If you look at the crime statistics, blacks outnumber whites in the number of murders and robberies and proportionately, despite making up about 13.3%, commit proportionately and I’d like to repeat, proportionately more crimes than whites, Hispanics and especially Asians!(IQ might have something to do with the low Asian Crime Rate.) Also, white privilege ain’t a thing. Wanting to remain a majority in a country which was historically white isn’t racism. (Assuming you don’t want an ethnostate)” ",
            "date": "Answered January 8, 2018",
            "views": "741",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Marc Bodnick",
                    "user_href": "/profile/Marc-Bodnick"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Aisah Mayford",
                    "user_href": "/profile/Aisah-Mayford"
                },
                {
                    "user_id": "Andrea Herrero",
                    "user_href": "/profile/Andrea-Herrero"
                },
                {
                    "user_id": "Ashley Maher",
                    "user_href": "/profile/Ashley-Maher-5"
                },
                {
                    "user_id": "Leilani Pigatt",
                    "user_href": "/profile/Leilani-Pigatt"
                },
                {
                    "user_id": "Aria Elizabeth Love",
                    "user_href": "/profile/Aria-Elizabeth-Love"
                },
                {
                    "user_id": "Maggie Ng",
                    "user_href": "/profile/Maggie-Ng-2"
                },
                {
                    "user_id": "Rahul Kumar",
                    "user_href": "/profile/Rahul-Kumar-2755"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Calexas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Moshier",
                "href": "/profile/Jon-Moshier"
            },
            "answer_text": "They do too much. Just look at their principles web page, they've listed 15 things. Focus down to one goal. They have no quantifiable goals. There's no much mention of “X is a problem and we aim to cut X in half in N years time”. Goals are best when they're measurable. Actually, if they're not measurable, they're not really goals. My approach would be to say “people of color suffer fatalities at the hands of police that are statistically higher than other groups [here's our evidence]. We plan to cut that number in half in 5 years. Once that number is reduced we will focus on reducing police to citizen directed violence, and citizen to police directed violence, regardless of race.” Also, I'm sure the media wouldn't cover my campaign because frankly, that kind of actionable campaign is just boring. ",
            "date": "Answered November 20, 2016",
            "views": "15",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aaron Silverman",
                "href": "/profile/Aaron-Silverman-5"
            },
            "answer_text": "The BLM movement has a legitimate gripe about police mistreatment of black people. However, when they published their official platform, it was full of all kinds of unrelated positions that ranged from reasonable liberalism to downright radical. When they insist on non sequiturs like accusing Israel of genocide, they only distract from their main purpose and alienate allies. ",
            "date": "Answered January 5, 2018",
            "views": "19",
            "upvotes": " View 67 Upvoters",
            "upvoters": [
                {
                    "user_id": "Horace Thon",
                    "user_href": "/profile/Horace-Thon"
                },
                {
                    "user_id": "Antonella Femia",
                    "user_href": "/profile/Antonella-Femia-1"
                },
                {
                    "user_id": "Geoff Chiddell",
                    "user_href": "/profile/Geoff-Chiddell"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Matjan Tutul",
                    "user_href": "/profile/Matjan-Tutul-1"
                },
                {
                    "user_id": "Léon Van Gulik",
                    "user_href": "/profile/Léon-Van-Gulik-1"
                },
                {
                    "user_id": "Aisah Mayford",
                    "user_href": "/profile/Aisah-Mayford"
                },
                {
                    "user_id": "Renee Tupaz",
                    "user_href": "/profile/Renee-Tupaz-1"
                },
                {
                    "user_id": "Raj Kumar",
                    "user_href": "/profile/Raj-Kumar-17424"
                },
                {
                    "user_id": "Lori Obernberger",
                    "user_href": "/profile/Lori-Obernberger"
                }
            ]
        },
        {
            "author_info": {
                "name": "Linden Ray",
                "href": "/profile/Linden-Ray-1"
            },
            "answer_text": "Belligerent individuals within the movement that are antagonistic not only to white people, but white individuals within the movement.Their methods of protesting are typically ineffective and on occasion, even counter intuitive.perpetuating inaccurate statistics, information etc.BLM only addresses an incident in which a white person kills a black person, all this does is reinforce the “oppressed by white man” notion Even if that's not what all BLM advocates believeLastly, the BLM movement is revolved around the very notion that black people are oppressed. An exemplification of victim mentality. ",
            "date": "Updated July 25, 2016",
            "views": "531",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chukwuemeka Onyimadu",
                    "user_href": "/profile/Chukwuemeka-Onyimadu-2"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Suade Bergemann",
                    "user_href": "/profile/Suade-Bergemann"
                },
                {
                    "user_id": "George Williams",
                    "user_href": "/profile/George-Williams-717"
                },
                {
                    "user_id": "Bryan Katz",
                    "user_href": "/profile/Bryan-Katz-1"
                },
                {
                    "user_id": "Fox Hendrix",
                    "user_href": "/profile/Fox-Hendrix-1"
                },
                {
                    "user_id": "Victoria Smith",
                    "user_href": "/profile/Victoria-Smith-888"
                },
                {
                    "user_id": "Kenneth Hau",
                    "user_href": "/profile/Kenneth-Hau-2"
                },
                {
                    "user_id": "Robert Cody",
                    "user_href": "/profile/Robert-Cody-22"
                },
                {
                    "user_id": "A Light",
                    "user_href": "/profile/A-Light-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Daniel Longman",
                "href": "/profile/John-Daniel-Longman"
            },
            "answer_text": "The backlash against Black Lives Matter is a direct indication of how badly skewed American society is and how badly needed the BLM movement is. It is a long time coming and the open hostility shown by white people toward it says so much more about them than it says about BLM itself. They are accused of every crime under the sun as if they were some monolithic revolution that would murder all white people. They are just peolpe who do not like getting murdered by cops. The responses to this question has revealed some of the most vile people I have ever seen in print. I know that Russia and the FSB are delighted to have this whole new venue to exploit in their efforts to undermine the United States. They have been responsible for some of the most inflamatory material produced on both side of the argument. This just aids in bringing out the home born extremists. You guys are idiots. ",
            "date": "Answered August 15, 2020",
            "views": "74",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Igor Rouzine",
                "href": "/profile/Igor-Rouzine-1"
            },
            "answer_text": "False premise: BLM is based on the assertion that Black are unfairly targeted by the police. In fact, White criminals are killed by the police twice more often, both in total and per criminal. And only 0.1% of unarmed Black are killed by the police (usually resisting arrest), the remaining 99,9% are killed by the city violence. Also, BLM used for a pretext the case of a felon who, as we know now, died from overdose while resisting arrest, and not by the officer. Race and crime in the United States - Wikipedia  False goals: \"Behind the victim position there is the acquisition of political and media power, and also of money, positions, compensation, of special treatment, of quotas, all clearly to the detriment of merit, competence, and equal rights.”  ",
            "date": "Updated September 3, 2020",
            "views": "347",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                }
            ]
        },
        {
            "author_info": {
                "name": "De'Ontrey Reddish",
                "href": "/profile/DeOntrey-Reddish"
            },
            "answer_text": "The misconception behind the Black Lives Matter movement is that many black people are saying, \"ONLY\" black lives matter. We as black people are simply saying we matter, too. I would never discredit the life of someone else, especially based on their race. But, what is happening is, we are being refused to be treated as equals. We are being shot without question, jailed without evidence, and killed without reason. What is happening is a revolutionary movement that is going to become so powerful that no one can stop it. Either you are on our side or you are the enemy. Many lives will be shaped or destroyed based on the events which are about to take place. Racism needs to come to an end and equality needs to be given across the board. If this does not happen, I fear for the lives of those who side with hate. ",
            "date": "Updated May 2, 2016",
            "views": "767",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "James Bell",
                    "user_href": "/profile/James-Bell-230"
                },
                {
                    "user_id": "Brady Bell",
                    "user_href": "/profile/Brady-Bell-1"
                },
                {
                    "user_id": "Graham Chidwick",
                    "user_href": "/profile/Graham-Chidwick"
                }
            ]
        },
        {
            "author_info": {
                "name": "Scott Roberts",
                "href": "/profile/Scott-Roberts-147"
            },
            "answer_text": "Well I think that the strongest criticism is that they are only concerned about white cops (or whites, or white-Hispanics like Zimmerman) killing black people. They aren’t concerned about black people killing black people. So they are probably not really even about saving black lives at the hands of un-justified killings by cops (and there have been some of those). No, they are trying to capitalize on police misconduct (which happens all too often to both blacks and whites, as well as any other color). And since their agenda encompasses much more radical ideas than “police reform” one can’t really take their claim about black lives seriously. ",
            "date": "Answered July 13, 2020",
            "views": "140",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Suade Bergemann",
                    "user_href": "/profile/Suade-Bergemann"
                },
                {
                    "user_id": "Marcella Cruser",
                    "user_href": "/profile/Marcella-Cruser"
                },
                {
                    "user_id": "Fredricka Louise Baker",
                    "user_href": "/profile/Fredricka-Louise-Baker"
                },
                {
                    "user_id": "Steve Hamilton",
                    "user_href": "/profile/Steve-Hamilton-61"
                },
                {
                    "user_id": "Nader Hatter",
                    "user_href": "/profile/Nader-Hatter"
                },
                {
                    "user_id": "Samuel Soohoo",
                    "user_href": "/profile/Samuel-Soohoo"
                },
                {
                    "user_id": "Alex Houston",
                    "user_href": "/profile/Alex-Houston-7"
                },
                {
                    "user_id": "Omer Jonuzi",
                    "user_href": "/profile/Omer-Jonuzi"
                },
                {
                    "user_id": "David McEntire",
                    "user_href": "/profile/David-McEntire"
                },
                {
                    "user_id": "Dennis Mills",
                    "user_href": "/profile/Dennis-Mills-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Walt Karas",
                "href": "/profile/Walt-Karas"
            },
            "answer_text": "People criticize actions by particular BLM supporters. But “BLM supporter” is like “Whitney Houston fan” in that you are one because you say you are. Osama Bin Laden was a big Whitney Houston fan, so I personally don’t pay much attention to this approach to critiquing informal groups. Otherwise, the criticism is that black lives already matter in the US. That, present day, the problems of black people are all of their own making, including those with the police. To believe this, you really must have a rather Putin-esque idea of what proper behavior is for police, prosecutors and judges. ",
            "date": "Answered December 21, 2016",
            "views": "463",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ohav Ben Yanai",
                    "user_href": "/profile/Ohav-Ben-Yanai"
                },
                {
                    "user_id": "George Glen",
                    "user_href": "/profile/George-Glen-1"
                },
                {
                    "user_id": "Rj Wentz",
                    "user_href": "/profile/Rj-Wentz"
                },
                {
                    "user_id": "David Cross",
                    "user_href": "/profile/David-Cross-89"
                },
                {
                    "user_id": "Neil Patel",
                    "user_href": "/profile/Neil-Patel-35"
                },
                {
                    "user_id": "Micheal Smith",
                    "user_href": "/profile/Micheal-Smith-120"
                },
                {
                    "user_id": "Melisa Alegría López",
                    "user_href": "/profile/Melisa-Alegría-López"
                },
                {
                    "user_id": "Joshua Nguyen",
                    "user_href": "/profile/Joshua-Nguyen-13"
                },
                {
                    "user_id": "James Bell",
                    "user_href": "/profile/James-Bell-230"
                },
                {
                    "user_id": "Rich Moore",
                    "user_href": "/profile/Rich-Moore-29"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dimitri Scholz",
                "href": "/profile/Dimitri-Scholz"
            },
            "answer_text": "Risking to be crucified by liberals but... The BLM is a local US-American movement, highly political, hypocrite, racist. All lives matter equally. Who claims differently is racist. Most nations outside of the US have no history of the enslavement of the African blacks, no guilt complex. Therefore, they consider Blacks as equals, not as a kind of handicapped in need of extra support, and BLM as a local, not global movement. BLM is supported by one of the major US parties shortly before the presidential elections, with a goal to get advantages over their opponents and get rid of Trump. Therefore, highly political. To pretend the BLM support is justice, is hypocrite. ",
            "date": "Answered July 31, 2020",
            "views": "159",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aisah Mayford",
                    "user_href": "/profile/Aisah-Mayford"
                },
                {
                    "user_id": "Ashley Dawkins",
                    "user_href": "/profile/Ashley-Dawkins-6"
                },
                {
                    "user_id": "Laura Wrzeski",
                    "user_href": "/profile/Laura-Wrzeski"
                },
                {
                    "user_id": "Tommy Martin",
                    "user_href": "/profile/Tommy-Martin-15"
                },
                {
                    "user_id": "Robert Goldstein",
                    "user_href": "/profile/Robert-Goldstein-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Caleb Evans",
                "href": "/profile/Caleb-Evans-47"
            },
            "answer_text": "Here is my biggest one, it is called Black Lives Matter but should be called Black Lives Matter*. The reason I add the asterisk is because to the movement only certain Black Lives Matter. Every year a few hundred black are killed by police, but 10-20 times more every year with the majority killed by other black people. Black Lives Matter does not really comment or even really care about those murders. You can look to Don Lemon's interview with Terry crews about BLM. It basically because Don telling Crews that BLM isn't about black on black crime. So that is why I said it should be BLM*. ",
            "date": "Answered July 16, 2020",
            "views": "547",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Don Dondoyano",
                    "user_href": "/profile/Don-Dondoyano"
                },
                {
                    "user_id": "Kaningjeiliu La Montagne",
                    "user_href": "/profile/Kaningjeiliu-La-Montagne-1"
                },
                {
                    "user_id": "Mark Zachman",
                    "user_href": "/profile/Mark-Zachman"
                },
                {
                    "user_id": "Hayden Finch",
                    "user_href": "/profile/Hayden-Finch-2"
                },
                {
                    "user_id": "Nathaniel Bixby",
                    "user_href": "/profile/Nathaniel-Bixby"
                },
                {
                    "user_id": "Scott Steward",
                    "user_href": "/profile/Scott-Steward-7"
                },
                {
                    "user_id": "Patrick McDonald",
                    "user_href": "/profile/Patrick-McDonald-234"
                },
                {
                    "user_id": "Gerard Smorowski",
                    "user_href": "/profile/Gerard-Smorowski"
                },
                {
                    "user_id": "Michael Johnson",
                    "user_href": "/profile/Michael-Johnson-4813"
                },
                {
                    "user_id": "David Gwartney",
                    "user_href": "/profile/David-Gwartney-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael David Cobb Bowen",
                "href": "/profile/Michael-David-Cobb-Bowen"
            },
            "answer_text": "They can’t count. [1] Racist murders only affect a small percentage of all American murders. American murders only affect a small percentage of Americans. An organization that focuses on a particular type of racist murder does not deserve the national spotlight for years. Footnotes[1] You People Don't Count",
            "date": "Answered November 19, 2016",
            "views": "13",
            "upvotes": " View 37 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amber Collins",
                    "user_href": "/profile/Amber-Collins-2"
                },
                {
                    "user_id": "Johanna Kok",
                    "user_href": "/profile/Johanna-Kok"
                },
                {
                    "user_id": "Meredith Lesly",
                    "user_href": "/profile/Meredith-Lesly"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stijn Hommes",
                "href": "/profile/Stijn-Hommes"
            },
            "answer_text": "Some people try to use Black Lives Matter as an excuse to justify a black person committing a crime, because “obviously” a cop shouldn’t be allowed to shoot them. I totally agree that if someone who complies with police demands dies, an investigation and possible prosecution should follow, but if you burgle a house or point a gun at police, you should be well aware that you run the risk of getting shot. It comes with the territory of doing something stupid regardless of your skin color. ",
            "date": "Answered November 27, 2016",
            "views": "632",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Muhammad Rasheed",
                "href": "/profile/Muhammad-Rasheed-4"
            },
            "answer_text": " There are no strong critiques of the Black Lives Matter movement. The entire point of BLM is to lessen the amount of police brutality in the Black community, so all those who criticize the organization lack empathy for Black people and see nothing wrong with an inherently biased and hostile police force beating and killing Black people to keep them subjugated for exploitation. ",
            "date": "Updated October 27, 2018",
            "views": "412",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Samuel Soohoo",
                    "user_href": "/profile/Samuel-Soohoo"
                },
                {
                    "user_id": "Richard John Watts",
                    "user_href": "/profile/Richard-John-Watts"
                }
            ]
        },
        {
            "author_info": {
                "name": "Weston Sanders",
                "href": "/profile/Weston-Sanders"
            },
            "answer_text": "Lack of a plan, the movement has good intentions and their demands are for the most part justified however no one within the movement has really put forward a solution that would allow us to implement those changes. A few good ideas have been proposed (accountability organizations to persecute cops that break the law for example) however talks tend to break down pretty quickly when it gets down to the nitty-gritty legal stuff… Basically the movement needs to organize their demands better and start offering practical solutions and reforms instead of just focusing on the end goals and relying on the government to “work it out” on how to get there. ",
            "date": "Answered September 10, 2020",
            "views": "37",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paris Cummings",
                "href": "/profile/Paris-Cummings-3"
            },
            "answer_text": "Division creators, hate instigators, condone and encourage violence for the sake of it. Hating the good law enforcement officers protecting us. they generally like being a minority and like the ideal of being the victim. Because it gives them the excuse to ‘rally their troops’ and cause a public outcry. Their biggest fear is that we will all get equality, as right now that is overtly in their favour. ",
            "date": "Answered April 7, 2020",
            "views": "244",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Igor Skryabin",
                    "user_href": "/profile/Igor-Skryabin"
                },
                {
                    "user_id": "Logan Michael Lemaire",
                    "user_href": "/profile/Logan-Michael-Lemaire"
                },
                {
                    "user_id": "Vladimir Lebedev-Schmidthof",
                    "user_href": "/profile/Vladimir-Lebedev-Schmidthof"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fredrick Wheatley",
                "href": "/profile/Fredrick-Wheatley"
            },
            "answer_text": "I don't have a problem with the message of their movement. If police officers are shooting people that don't deserve it, they need to be investigated and punished in appropriate fashion. But the way they go about making their case... They villanize not the individual but all his kin. That is, the rest of the police force in general whom the vast majority are of are outstandingly ethical people. I can't stand behind people who denounce the sacrifice and loyalty of those sworn to protect them. ",
            "date": "Answered March 23, 2017",
            "views": "463",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Donovan",
                "href": "/profile/Chris-Donovan-30"
            },
            "answer_text": "Maybe the family of the 60 something man four blackbmen jumped while yelling black.lives.matter, bitch. He had stage 4 canver and he was mexican just walking back fe the store with his friemd getting a. soda and the 4 black men he didn't know jumped out of a car and beat him to death. And then there is this. REPORT: Teens Beating Pregnant Mom, Kicking Toddler Caught On Video Oh wait all the people in the video are black so it must oh to keat a pregnant lady and kick a toddler I'm the.head. They are fucking animals!!!! ",
            "date": "Answered July 16, 2020",
            "views": "181",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Suade Bergemann",
                    "user_href": "/profile/Suade-Bergemann"
                },
                {
                    "user_id": "Bob Dole",
                    "user_href": "/profile/Bob-Dole-493"
                },
                {
                    "user_id": "Steve Hamilton",
                    "user_href": "/profile/Steve-Hamilton-61"
                },
                {
                    "user_id": "Samuel Soohoo",
                    "user_href": "/profile/Samuel-Soohoo"
                },
                {
                    "user_id": "David McEntire",
                    "user_href": "/profile/David-McEntire"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Blue-Sapphire"
                },
                {
                    "user_id": "Daniel Lobo",
                    "user_href": "/profile/Daniel-Lobo-11"
                },
                {
                    "user_id": "Sam Morningstar",
                    "user_href": "/profile/Sam-Morningstar"
                },
                {
                    "user_id": "Charles Locke",
                    "user_href": "/profile/Charles-Locke-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bryan Rosander",
                "href": "/profile/Bryan-Rosander"
            },
            "answer_text": "Radley Balko has my favorite:The Black Lives Matter policy agenda is practical, thoughtful — and urgent He is a libertarian investigative journalist. I like his opinion in general on civil liberties and especially police / courtroom issues. In general, he likes most of their policy suggestions which is rare when it comes to this stuff. He thinks we usually get a new law which is intended to fix a very specific problem, doesn't actually fix it, and generally makes the law more confusing. ",
            "date": "Answered September 10, 2015",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Stanley Rabinowitz",
                    "user_href": "/profile/Stanley-Rabinowitz-1"
                },
                {
                    "user_id": "Samuel Soohoo",
                    "user_href": "/profile/Samuel-Soohoo"
                },
                {
                    "user_id": "David McEntire",
                    "user_href": "/profile/David-McEntire"
                },
                {
                    "user_id": "Philip O'Connell",
                    "user_href": "/profile/Philip-OConnell-3"
                },
                {
                    "user_id": "Alejandro Rocha",
                    "user_href": "/profile/Alejandro-Rocha-1"
                },
                {
                    "user_id": "Henry House",
                    "user_href": "/profile/Henry-House-1"
                },
                {
                    "user_id": "Helen Smith",
                    "user_href": "/profile/Helen-Smith-54"
                },
                {
                    "user_id": "Tara Nitka",
                    "user_href": "/profile/Tara-Nitka"
                },
                {
                    "user_id": "Diogo Silva",
                    "user_href": "/profile/Diogo-Silva-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Schuck",
                "href": "/profile/James-Schuck"
            },
            "answer_text": "The strongest critique is that the organization, “Black Lives Matter” has nothing to do with black lives. It is a political organization which believes in Marxism, the end of the United States as a free nation and the end of the traditional family in favor of children being raised by the state. All of these facts are freely offered on their own web site. ",
            "date": "Answered August 6, 2020",
            "views": "655",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ji Hae",
                    "user_href": "/profile/Ji-Hae-4"
                },
                {
                    "user_id": "Latagia Copeland-Tyronce",
                    "user_href": "/profile/Latagia-Copeland-Tyronce"
                },
                {
                    "user_id": "Jennifer Xu",
                    "user_href": "/profile/Jennifer-Xu-36"
                },
                {
                    "user_id": "Matthew James",
                    "user_href": "/profile/Matthew-James-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Sibbald",
                "href": "/profile/Stephen-Sibbald-1"
            },
            "answer_text": "I fully support BLM in the United States. Much of its energy has spilled over into Canada too, and points out systemic injustice against Canadian blacks. Although blacks are not as poorly treated in Canada as in the US, there is still work to be done, and I hope BLM reduces the gap here. But… A 2015 study by our major newsmagazine, Maclean's, showed that Canadian aboriginals are treated much worse than American blacks, in almost every metric, and several times worse in some metrics:  What we need in Canada is a much bigger Aboriginal Lives Matter, to rectify a much bigger injustice. Canadians love to point out how terrible our neighbours to the south are, and the sheer hypocrisy sickens me. ",
            "date": "Answered June 28, 2020",
            "views": "289",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Xander Becker",
                    "user_href": "/profile/Xander-Becker"
                },
                {
                    "user_id": "George Hutto",
                    "user_href": "/profile/George-Hutto-3"
                },
                {
                    "user_id": "Balthazar Sforza-Krasinski",
                    "user_href": "/profile/Balthazar-Sforza-Krasinski"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Valentine",
                "href": "/profile/Brian-Valentine-10"
            },
            "answer_text": "How about this: i don’t need some quasi-righteous movement to educate me, to encourage me, or to empower me. None of those people know what their complaint is or who it’s for. They just band together and do what big families do: LOUDEST PERSON WINS. I think that ‘Time’s Up’ is gonna change the entertainment industry in a big way, for two reasons. it isn’t a migrating protest that just pops wherever the oil is the hottest.It isn’t something, whatever IT is, that’s trying to be heard by being the loudest in the room.",
            "date": "Answered January 11, 2018",
            "views": "428",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Renee Tupaz",
                    "user_href": "/profile/Renee-Tupaz-1"
                },
                {
                    "user_id": "Samuel Soohoo",
                    "user_href": "/profile/Samuel-Soohoo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Khan Phan",
                "href": "/profile/Khan-Phan-3"
            },
            "answer_text": "It’s in the name Black Lives Matter. It sounds like a black supremacist movement. If they are fighting against police brutality, they should consider change the name to “People Lives Matter”. ",
            "date": "Answered April 6, 2020",
            "views": "197",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Ron Atchley",
                    "user_href": "/profile/Ron-Atchley-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Chapman",
                "href": "/profile/Paul-Chapman-32"
            },
            "answer_text": "My only criticism because I believe ALL lives matter is that some aspects of the black community seem to excuse the true lawbreakers and those that are our thugs who feel entitled and have no respect for others and the expected roles of our society. Why do they say “black” lives…all lives. ",
            "date": "Answered November 25, 2016",
            "views": "220",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Genéa Stewart",
                    "user_href": "/profile/Genéa-Stewart"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dolph Watts",
                "href": "/profile/Dolph-Watts"
            },
            "answer_text": "Mr Onyimadu has a good answer, but my critique is where is the money? And where did it go? The organization has raised or been donated millions - for a platform that only espouses protest as its purpose. No other called for changes or actions - no official national structure and absolutely NO accountability for funding. We would not tolerate this kind of black hole for funding from ANY other organization. ",
            "date": "Answered August 9, 2020",
            "views": "312",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Patrick McDonald",
                    "user_href": "/profile/Patrick-McDonald-234"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Logan Michael Lemaire",
                    "user_href": "/profile/Logan-Michael-Lemaire"
                },
                {
                    "user_id": "Dave Saruya",
                    "user_href": "/profile/Dave-Saruya"
                },
                {
                    "user_id": "Lisa Sanders",
                    "user_href": "/profile/Lisa-Sanders-66"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sean McGinnis",
                "href": "/profile/Sean-McGinnis-48"
            },
            "answer_text": "Ignorance is the problem, not racism. Racism, sexism, sectarianism, classism, ageism, anti-semitism, basically all the bad ‘isms’ are a result of ignorance. I think it would make more sense to deal with the disease rather than the individual symptoms. Every human is guilty, everybody finds it easier to shout their own opinions instead of listening to the opinions of others, it is human nature. Black Lives Matter is an important struggle, but when that war is won there are so many more battles to fight. The sooner we realise that the real enemy is fear, not hate, the sooner we can find a way to deafeat it.  ",
            "date": "Answered June 9, 2020",
            "views": "185",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "WynnAnne Sibbald",
                    "user_href": "/profile/WynnAnne-Sibbald"
                },
                {
                    "user_id": "Julian Erikson",
                    "user_href": "/profile/Julian-Erikson-1"
                },
                {
                    "user_id": "Karen McKearn",
                    "user_href": "/profile/Karen-McKearn"
                },
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                },
                {
                    "user_id": "Ian MacKinnell",
                    "user_href": "/profile/Ian-MacKinnell"
                }
            ]
        },
        {
            "author_info": {
                "name": "Patrick Swatton",
                "href": "/profile/Patrick-Swatton"
            },
            "answer_text": "The names incorrect it should be when black people die in an interaction with police we go ape shit, smash neighbourhoods, cause trouble and sometimes murder cops, regardless or whether the person was a innocent, scum bag or druggy, we don't care when black people kill black at all, it's not like they kill over 9 out of 10 black people All lives matter. ",
            "date": "Answered January 6, 2018",
            "views": "109",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Sutton",
                "href": "/profile/Paul-Sutton-43"
            },
            "answer_text": "I’m a 100% supporter of the reality that black lives do indeed matter. Where I have a problem is with the victims that are paraded out. So often, they are people who were shot by the police in the process of committing a crime, notably, resisting arrest. I just don’t get how taking a swing at a cop can ever end up good. Why do they do it? ",
            "date": "Answered January 12, 2018",
            "views": "179",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Paris Cummings",
                    "user_href": "/profile/Paris-Cummings-3"
                },
                {
                    "user_id": "Gayle Arrington",
                    "user_href": "/profile/Gayle-Arrington-1"
                },
                {
                    "user_id": "Mae Tierny",
                    "user_href": "/profile/Mae-Tierny"
                },
                {
                    "user_id": "William Knight",
                    "user_href": "/profile/William-Knight-91"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sorin Turiac",
                "href": "/profile/Sorin-Turiac"
            },
            "answer_text": "Besides the looting, violence, rioting, destruction of property and calls for killing cops? Can’t think of any. ",
            "date": "Answered December 5, 2016",
            "views": "305",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Ilana Halupovich",
                    "user_href": "/profile/Ilana-Halupovich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Wallace",
                "href": "/profile/Peter-Wallace-50"
            },
            "answer_text": "The BLM when it was originally conceived is very different than it is now. BLM in the current year is little more than a racketeering organization run by racist black supremacists. They strong arm cities, organizations, and corporations for donations just so a violent mob doesn’t show up to their door. Then there is the obvious ignoring of black on black crime along with the propensity to ignore the obvious issues of various black communities. ",
            "date": "Answered July 25, 2020",
            "views": "71",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Stacy",
                "href": "/profile/Paul-Stacy-7"
            },
            "answer_text": "It seems to largely focus on threats to young black males coming from police yet seems to ignore that a young black male is in far more danger from other young black males than police. It seems to need to spend far more effort at looking inward at the black community. ",
            "date": "Answered April 6, 2020",
            "views": "114",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Logan Michael Lemaire",
                    "user_href": "/profile/Logan-Michael-Lemaire"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ken Mitchell",
                "href": "/profile/Ken-Mitchell-35"
            },
            "answer_text": "All the uproar about white cops shooting black people. What about the whites that are killed by blacks? White lives matter, too? But not “white lives matter” group. Why not an “all lives matter” group? Cant we all just get along? ",
            "date": "Answered February 27, 2017",
            "views": "133",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Irwin",
                "href": "/profile/Daniel-Irwin-12"
            },
            "answer_text": "They were founded on a lie. The Trayvon Martin shooting. They are Marxists, who want to do away with capitalism. Don’t care who it hurts, or how many. ",
            "date": "Answered July 14, 2020",
            "views": "123",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher Aspen",
                "href": "/profile/Christopher-Aspen"
            },
            "answer_text": "Not every police officer is bad or racist. Not every black person is innocent, law abiding citizen with good intentions.  Education to be a good human starts at home, not on the street. ",
            "date": "Answered June 8, 2020",
            "views": "150",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Renee Tupaz",
                    "user_href": "/profile/Renee-Tupaz-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Smith",
                "href": "/profile/Robert-Smith-1088"
            },
            "answer_text": "Not providing statistics and if they do, providing terrible ones that are either false or taken out of context. Caring more about rioting than trying to achieve their goal. Ignoring the compliance issues. Being racist. ",
            "date": "Answered November 20, 2016",
            "views": "229",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Norbert Szczęch",
                    "user_href": "/profile/Norbert-Szczęch"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Renee Tupaz",
                    "user_href": "/profile/Renee-Tupaz-1"
                },
                {
                    "user_id": "Bob Dole",
                    "user_href": "/profile/Bob-Dole-493"
                },
                {
                    "user_id": "Marcella Cruser",
                    "user_href": "/profile/Marcella-Cruser"
                },
                {
                    "user_id": "Charlie Fortin",
                    "user_href": "/profile/Charlie-Fortin-1"
                },
                {
                    "user_id": "Steve Hamilton",
                    "user_href": "/profile/Steve-Hamilton-61"
                },
                {
                    "user_id": "Louis Botes",
                    "user_href": "/profile/Louis-Botes-1"
                },
                {
                    "user_id": "Robert Ryan",
                    "user_href": "/profile/Robert-Ryan-35"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nikolaos Vafeidis",
                "href": "/profile/Nikolaos-Vafeidis"
            },
            "answer_text": "Their leaders would wipe out all non blacks if they could.Toronto Black Lives Matter co-founder says white people are ‘genetic defects’ ",
            "date": "Answered January 11, 2018",
            "views": "200",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Randall Goodman",
                "href": "/profile/Randall-Goodman"
            },
            "answer_text": "Black lives do matter. Even ones who don’t agree with you politically. Or children. Or business owners. Going out and killing people isn't saying that any lives matter. Going out and destroying property and creating chaos isn't showing anybody that your life matters. It only shows that your life is becoming a problem to many people who didn't think it was a problem before. Including some of the black lives that seem to matter a little less to you. ",
            "date": "Answered July 13, 2020",
            "views": "598",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "George Hutto",
                    "user_href": "/profile/George-Hutto-3"
                },
                {
                    "user_id": "Balthazar Sforza-Krasinski",
                    "user_href": "/profile/Balthazar-Sforza-Krasinski"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michelle Redwood",
                "href": "/profile/Michelle-Redwood"
            },
            "answer_text": "The sexism in the movement. The movement is very male-centric. Black women are unjustly murdered too but some black men always make excuses like oh “She had an attitude”. Which is hypocritical because they would never make an excuse to justify the death of a black man. ",
            "date": "Answered June 1, 2020",
            "views": "188",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Brian Mead",
                    "user_href": "/profile/Brian-Mead-5"
                },
                {
                    "user_id": "Aria Elizabeth Love",
                    "user_href": "/profile/Aria-Elizabeth-Love"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aditya Jaiswal",
                "href": "/profile/Aditya-Jaiswal-94"
            },
            "answer_text": "Now a day, every Indian is crying against racism. Also, Indians give this to their Kid.  This is really sad to see such such things in the textbook of our kids. This is the harsh reality of our society. We should make our kids understand from their early years that everyone is Beautiful no matter whether he/she is white or black. #Black_Live_Matters Hope things will change very soon. ",
            "date": "Answered June 5, 2020",
            "views": "297",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mohan Kalaiselvan",
                "href": "/profile/Mohan-Kalaiselvan"
            },
            "answer_text": "It is not just one white police killing one black man. The whole police system in America is maintained by penalysing and oppressing poor people. As African Americans are generally poor , they live without freedom in the so called free country. They have to bring reform in their most undemocratic democracy. They can start from abolishing electrol colleges system of presidential election. PM of India is elected more democratically than President of America. ",
            "date": "Answered June 8, 2020",
            "views": "151",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marcos Sheldon Padilla",
                "href": "/profile/Marcos-Sheldon-Padilla"
            },
            "answer_text": "They’re not white and they’re uppity. The decent folks are so bothered by those people complaining when they’ve done so much for them. (sarcasm) ",
            "date": "Answered April 8, 2020",
            "views": "108",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Patrick McDonald",
                    "user_href": "/profile/Patrick-McDonald-234"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Michael Yoos",
                    "user_href": "/profile/Michael-Yoos-1"
                },
                {
                    "user_id": "Angelo Jones",
                    "user_href": "/profile/Angelo-Jones-24"
                },
                {
                    "user_id": "Chris Allen",
                    "user_href": "/profile/Chris-Allen-1166"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jack Houman",
                "href": "/profile/Jack-Houman"
            },
            "answer_text": "Not a critique, but positive suggestions posted here: Jack Houman's answer to What is the best optimum outcome advice you can offer Black Lives Matter (BLM) as a world leading organization? ",
            "date": "Answered July 15, 2020",
            "views": "70",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Renee Tupaz",
                    "user_href": "/profile/Renee-Tupaz-1"
                },
                {
                    "user_id": "Richard David John",
                    "user_href": "/profile/Richard-David-John"
                }
            ]
        },
        {
            "author_info": {
                "name": "Keith Jackson",
                "href": "/profile/Keith-Jackson-82"
            },
            "answer_text": "When black lives matter start to realise that blacks kill more blacks in gang and drug crime than white killing black,then they need to get their own house in order before trying to cause friction in communities . ",
            "date": "Answered January 7, 2018",
            "views": "133",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Renee Tupaz",
                    "user_href": "/profile/Renee-Tupaz-1"
                },
                {
                    "user_id": "Steve Hamilton",
                    "user_href": "/profile/Steve-Hamilton-61"
                },
                {
                    "user_id": "Ilana Halupovich",
                    "user_href": "/profile/Ilana-Halupovich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Dolan",
                "href": "/profile/Tom-Dolan-23"
            },
            "answer_text": "That, of course, it is an intolerant and racist movement, to the extent that it has any unity, and that it refuses to condemn violence against police officers of any color. ",
            "date": "Answered November 6, 2017",
            "views": "133",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                },
                {
                    "user_id": "Renee Tupaz",
                    "user_href": "/profile/Renee-Tupaz-1"
                },
                {
                    "user_id": "Charyl Truax",
                    "user_href": "/profile/Charyl-Truax"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jonathan Samuels",
                "href": "/profile/Jonathan-Samuels"
            },
            "answer_text": "In the UK its simply they don’t answer these questions. Which new laws do you want?Which existing laws do you want changed?.What changes in government spending do you want? Put that in writing and we can then debate whether they are a good idea. Just saying stop being racists isn’t a legal or budgetary change, its not in the governments power to do ",
            "date": "Answered July 14, 2020",
            "views": "256",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Alberton",
                "href": "/profile/Robert-Alberton"
            },
            "answer_text": "Mostly that it’s based on a false narrative created by Democrats and their mainstream media allies and powered by social media. A small amount of research will show that whites are killed in greater numbers and in greater proportions, despite the fact that whites commit less crime. Nobody cares about facts anymore. https://www.washingtonpost.com/graphics/2018/national/police-shootings-2018/ ",
            "date": "Answered October 26, 2019",
            "views": "292",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alicen Lyne",
                "href": "/profile/Alicen-Lyne"
            },
            "answer_text": "They’re funded by Soros and the money donated to them goes to the Democrats. So anyone thinking they’re sending money to help Black people, you’re actually contributing to Biden’s campaign instead. ",
            "date": "Answered June 13, 2020",
            "views": "120",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Michael J. McFadden",
                    "user_href": "/profile/Michael-J-McFadden"
                },
                {
                    "user_id": "Jim Arona",
                    "user_href": "/profile/Jim-Arona"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fred Pope",
                "href": "/profile/Fred-Pope-9"
            },
            "answer_text": "In the UK, as a distant observer, it lacks the two most fundamental components: visible strong leadership and a manifesto. Stuff about statues and PC language is playing into the hands of the ruling class. While this continues it will go nowhere and fizzle out. The white middle class SJWs will get bored and move on. If people are not fighting these issues every day at work collectively, they are not even at base camp. ",
            "date": "Answered August 9, 2020",
            "views": "143",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kenneth Dawson",
                "href": "/profile/Kenneth-Dawson-8"
            },
            "answer_text": "There are no strong critiques. Black Lives Matter came into to being because they don’t really matter that much in America and certainly not as much as white lives. ",
            "date": "Answered October 11, 2016",
            "views": "160",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joe Neri",
                "href": "/profile/Joe-Neri-5"
            },
            "answer_text": "BLM COSTS MORE THAN IT CURES. BLM can not win the election for Biden, but BLM can lose the election for Biden. BLM can not eliminate criminal acts committed by blacks on blacks, but BLM can eliminate effective policing of crime ridden black neighborhoods. ",
            "date": "Answered October 17, 2020",
            "views": "5",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steve Thompson",
                "href": "/profile/Steve-Thompson-199"
            },
            "answer_text": "ALL lives matter! ",
            "date": "Answered January 8, 2018",
            "views": "170",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Qwantitu"
                }
            ]
        },
        {
            "author_info": {
                "name": "August Roa",
                "href": "/profile/August-Roa"
            },
            "answer_text": "they are blackthey are saying that black lives matter2 very large no no, in this country ",
            "date": "Answered November 30, 2016",
            "views": "105",
            "upvotes": "0"
        }
    ]
}