{
    "title": "What is the average age for high school juniors? - Quora",
    "tags": [
        "High Schools",
        "High School Education",
        "Age",
        "The High School Experience",
        "Schools"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lawrence Wescott",
                "href": "/profile/Lawrence-Wescott"
            },
            "answer_text": "In general, to quickly figure out age at any grade level, add 6. You’ll be within a year, provided the person has been promoted normally. Junior Year is Grade 11 in the USA, so 11 + 6 is 17. Now, that said, most students will start Junior Year at age 16 and turn 17 at some point during the year or the ensuing Summer Vacation. There are exceptions. I was born in September, but right before the cut-off for my state, and started school at age 4 (!) in Kindergarten. I was 15 for about three weeks at the beginning of my Junior year and turned 16 during my Junior year. I didn’t turn 18 until the September AFTER I graduated High School. Doesn’t really make a difference, so long as the student is socially, emotionally, and intellectually at grade level. Personally, I hated being among the youngest in my class, but it really becomes a moot point. Incidentally, others have posted that age 18 is the maximum age for school. That is not true in the USA; if a person reaches 20 years of age he or she is generally encouraged to seek out an Adult Education program or Hi-Set (the new form of G.E.D.) in which to complete his or her education. Many times we have students who receive Special Education services who stay in school right up to their 20th birthday and then transition into an adult program. Long answer! ",
            "date": "Answered June 1, 2018",
            "views": "291",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ben Juny",
                    "user_href": "/profile/Ben-Juny"
                },
                {
                    "user_id": "George R Peterson",
                    "user_href": "/profile/George-R-Peterson"
                },
                {
                    "user_id": "Halima Ali",
                    "user_href": "/profile/Halima-Ali-32"
                },
                {
                    "user_id": "Allen Nunley",
                    "user_href": "/profile/Allen-Nunley"
                },
                {
                    "user_id": "Don Erico",
                    "user_href": "/profile/Don-Erico"
                },
                {
                    "user_id": "Marla Wait",
                    "user_href": "/profile/Marla-Wait"
                },
                {
                    "user_id": "Wanjiru Karanja",
                    "user_href": "/profile/Wanjiru-Karanja-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Stagliano",
                "href": "/profile/Tom-Stagliano"
            },
            "answer_text": "Junior high school is typically 7th and 8th grades and in some school districts it included 9th grade. My wife attended a junior high with 7th - 9th grades and those are students who typically are 12 years old when they start 7th grade and are 15 or almost 15 when they finish. A more standard is now Middle School and that is typically 6th grade through 8th grade. Then they are typically 11 years old when they start 6th grade and are 14 or almost 14 when they finish. ",
            "date": "Answered June 14, 2019",
            "views": "97",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "George R Peterson",
                    "user_href": "/profile/George-R-Peterson"
                }
            ]
        }
    ]
}