{
    "title": "What is hydrogen bonding? What are its types? - Quora",
    "tags": [
        "Hydrogen Bonds",
        "Hydrogen",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shivam Choudhary",
                "href": "/profile/Shivam-Choudhary-61"
            },
            "answer_text": "A hydrogen bond is a special type of dipole-dipole attraction which occurs when a hydrogen atom bonded to a strongly electronegative atom exists in the vicinity of another electronegative atom with a lone pair of electrons. These bonds are generally stronger than ordinary dipole-dipole and dispersion forces, but weaker than true covalent and ionic bonds. Without hydrogen bonding earth would have no water cycle, no ocean, no floating ice, no life as we know it. There are two types of Hydrogen Bonding. They are : Intramolecular hydrogen bonds: Intramolecular hydrogen bonds are those which occur within one single molecule. This occurs when two functional groups of a molecule can form hydrogen bonds with each other. In order for this to happen, both a hydrogen donor and acceptor must be present within one molecule, and they must be within close proximity of each other in the molecule. For example, intramolecular hydrogen bonding occurs in ethylene glycol (C2H4(OH)2) between its two hydroxyl groups due to the molecular geometry. Intermolecular hydrogen bonds: Intermolecular hydrogen bonds occur between separate molecules in a substance. They can occur between any number of like or unlike molecules as long as hydrogen donors and acceptors are present an in positions in which they can interact.For example, intermolecular hydrogen bonds can occur between NH3 molecules alone, between H2O molecules alone, or between NH3 and H2O molecules. I hope you got your answer… ",
            "date": "Answered September 12, 2018",
            "views": "24",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "All in One Aman Gupta AG",
                    "user_href": "/profile/All-in-One-Aman-Gupta-AG"
                },
                {
                    "user_id": "Astha Suryavanshi",
                    "user_href": "/profile/Astha-Suryavanshi-1"
                },
                {
                    "user_id": "JAYANTI MISHRA",
                    "user_href": "/profile/JAYANTI-MISHRA-30"
                }
            ]
        },
        {
            "author_info": {
                "name": "Luke Allen",
                "href": "/profile/Luke-Allen-100"
            },
            "answer_text": "When two atoms are covalently bonded they are sharing electrons. Different atoms have different electronegativities. The electronegativity is the ability of an atom to attract a bonding pair of electrons. when there is a difference in electronegativities the covalent bond is polar. When H is bonded to a highly electronegative atom (fluorine, oxygen or nitrogen) the electron density of the bond is more focused around the elctronegative atom. this gives the H atom a large partial positive charge. this partially positively charge H is then attracted to, for instance, a lone pair of electrons on an oxygen atom of a different molecule. A great example is water, study the image below to understand the explanation above.  ",
            "date": "Answered September 9, 2018",
            "views": "618",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hari Haran",
                    "user_href": "/profile/Hari-Haran-882"
                },
                {
                    "user_id": "Sandhya Chougule",
                    "user_href": "/profile/Sandhya-Chougule-2"
                }
            ]
        }
    ]
}