{
    "title": "What are your thoughts on string theory? - Quora",
    "tags": [
        "String Theory",
        "Theoretical Physics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Watkins",
                "href": "/profile/Tom-Watkins-11"
            },
            "answer_text": "String “theory” is an interesting extrapolation of imagination supported by enabling math and a significant number of assumptions. For instance: In physics, a “dimensionless physical constant”, sometimes called a fundamental physical constant, is a physical constant that is dimensionless. It has no units attached and has a numerical value that is independent of the system of units used. There is no exhaustive list of such constants. But it is meaningful to ask about the minimal number of fundamental constants necessary to determine a given physical theory. Thus, the Standard Model requires 25 physical constants and String theory uses 128. What is significant is that these “constants” keep changing. They are not calculated, they are measured and/or derived by what is necessary to make the math match observation. Most are tweaked by small percentages every few years but some have changed significantly over the past few decades. For instance, Einstein stuck one into his GTR to make the universe match his then concept of a static universe rather than an expanding one. He later took it out. Then when we found Dark Matter/Energy, we put it back in at a different value. One perspective of these dimensionless constants is that they are fudge factors to make the math work,i.e. assumptions based on extrapolation and inductive logic. String Theory uses 128 of these. That doesn’t make it wrong but it speaks to what is necessary to make the math work. Another perspective is that one of the hallmarks of science is that any idea has to be testable. If it can’t be proven right or wrong, then it isn’t really science - it is faith or a philosophy or an “interesting” idea, but it is not science. String Theory falls into this category and it is for this reason that it doesn’t really qualify as a “theory” in the sense that science uses that word. Those that advocate ST are working very hard to find any possible test or predicted action or measurement that might agree with the String concept. So far they have not found one. It may very well be that something like this is necessary to resolve the general unified field theory (GUT), sometimes called the theory of everything and to unify GTR with quantum mechanics. Once that is done, then the long-sought goal of theoretical physics to find the true and fixed fundamental dimensionless constants can be calculated and then compared to our measured values. Until then, Strings remain an interesting “concept”. ",
            "date": "Answered January 8, 2018",
            "views": "516",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Rio-46"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rämöt Kalra",
                "href": "/profile/Rämöt-Kalra"
            },
            "answer_text": "On Philosophy of String Theory String theory is very intense. String theory is a retreat into complexity and abstraction. Despite that, I hold that there are genuine insights in string theory; see the reference right below this sentence. Drageset, Olav. \"String theory with a new interpretation can model the mind.\" first international conference on “Life Energy, Syntropy and Resonance,” Viterbo, Italy. 2013. Calling string theory “not even wrong” is too harsh, but I do echo some of the sentiments of the critics of string theory. What is needed is for someone to parse through the vast data and knowledge of string theory to bring a deep simpleness to counter-balance the deep complexity. Basically, I’m saying someone needs to clean up and bring in new insight to string theory to make it more comprehensible. At this point, string looks like abstraction feeding-back on itself to produce more needless abstraction. I’m just an amateur philosopher of physics. Take my views with the extreme skepticism that they deserve. I could be dead wrong about my postulates in this thread. Sources and References: https://en.wikipedia.org/wiki/String_theory#CriticismHas theoretical physics moved too far away from experiments? Is the field entering a crisis and, if so, what should we do about it?Is String Theory Testable?Why String Theory Is Still Not Even WrongThe Admiral of the String Theory Wars - Issue 24: Error - NautilusWoit, Peter. \"Is string theory even wrong?.\" American Scientist 90.2 (2002): 110-112.Drageset, Olav. \"String theory with a new interpretation can model the mind.\" first international conference on “Life Energy, Syntropy and Resonance,” Viterbo, Italy. 2013.Woit, Peter. Not even wrong: The failure of string theory and the continuing challenge to unify the laws of physics. Random House, 2011.",
            "date": "Answered January 8, 2018",
            "views": "278",
            "upvotes": "0"
        }
    ]
}