{
    "title": "What are the reasons for heating of a smartphone? - Quora",
    "tags": [
        "Heating",
        "Smartphones Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ardhendu Chakraborty (अर्धेंदु चक्रवर्ती)",
                "href": "/profile/Ardhendu-Chakraborty-अर्धेंदु-चक्रवर्ती"
            },
            "answer_text": "Hey there Chayan. Namaste from India. Thank you for the answer request. There are 2 scenarios I can imagine. The smartphone gets heated up during charging or when you're using it.The smartphone gets heated up when you're doing nothing.Also, there are two ways I can use to solve this crisis. First law of thermodynamicsSecond law of thermodynamics.Using First law of thermodynamics. First part of first case. In this case, it is pretty obvious for smartphones to heat up. I'm not an electronic engineer, and thus my explanation will be from a Physics and/or thermodynamics (since you've tagged thermodynamics too) point of view. You see, for any component to work, you need to put in energy. Consider your mobile as a system. A closed system. You're putting in energy in the form of work (Non-Boundary work in this case) and that is, electrical energy. Now, we know that no system in this universe is perfect/ideal. Thus, if you put in 100J of energy into your phone per second, your mobile will not be able to convert all of that 100J into stored chemical energy (in your battery). Instead, it may convert 80J into stored energy. And by virtue of the first law of thermodynamics, the remaining 20J HAS TO BE rejected as heat to the surroundings. We just cannot avoid it from happening. First case's second part. Why does it get heated up when you're using it? I can again use thermodynamics to demonstrate it. Imagine you have 1000J of stored energy in your battery. And it is dispensing 10J/second for your work to be done (maybe playing games or listening to music). But since not all of the 10J will be used by the system to perform the required task, you're again going to lose some energy per second in the form of heat energy. Second case. When you're doing nothing, even then, the phone keeps working. Syncing itself with the GPS location details and keeping a track of background activities and so on. Again the same first law will assist me here. If the battery is dispensing just 1 J of energy to perform all these tasks, not all of the energy will be used to perform these tasks and thus, your phone is bound to get heated up. Using second law of thermodynamics. I'll solve all the three scenarios with just one statement. Any and everything which undergoes some form of real process (whether eating, playing, charging, displaying, sleeping, syncing, dancing etc) in this universe, is BOUND to lose energy during the completion of the process. This is given by the concept of entropy. Footnote- If you wanted a descriptive answer from a technological point of view, kindly mention the same in the question and prefer not attaching “thermodynamics” and “heat” to the question. Thank you. Happy reading. Ardhendu Chakraborty. ",
            "date": "Answered April 27, 2019",
            "views": "483",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anand P",
                    "user_href": "/profile/Anand-P-134"
                },
                {
                    "user_id": "Chayan Chakraborty",
                    "user_href": "/profile/Chayan-Chakraborty-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ajinkya Khobragade",
                "href": "/profile/Ajinkya-Khobragade"
            },
            "answer_text": "Your phone is like a computer, which doesn't have a exaust fan to cool it down. One of the main reason is processor. Actually Processors works by either enabling electric signals to pass through its microscopic transistors or by blocking them. As electricity passes through the processors or gets blocked inside, it gets turned into heat energy. So when you perform tasks which are highly demanding and need a lot of processing power, they tend to heat up to catchup with the need. Also battery is one of the reasons, We charge our phones which causes heating since electricity is transferred to your battery. Heat gets lost when your phone gets charged so it causes heating. Hope this have solved your queries. ",
            "date": "Answered June 23, 2017",
            "views": "363",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anil Kumar",
                    "user_href": "/profile/Anil-Kumar-3152"
                },
                {
                    "user_id": "Asif Ansari",
                    "user_href": "/profile/Asif-Ansari-205"
                },
                {
                    "user_id": "Shubham Kuchhal",
                    "user_href": "/profile/Shubham-Kuchhal"
                },
                {
                    "user_id": "Rajat Srivastava",
                    "user_href": "/profile/Rajat-Srivastava-56"
                },
                {
                    "user_id": "Anubhab Kundu",
                    "user_href": "/profile/অনুভব-কুন্ডু-Anubhab-Kundu"
                },
                {
                    "user_id": "Fayiz",
                    "user_href": "/profile/Fayiz-2"
                },
                {
                    "user_id": "Sahil Gupta",
                    "user_href": "/profile/Sahil-Gupta-485"
                }
            ]
        }
    ]
}