{
    "title": "What are signs of contaminated food? - Quora",
    "tags": [
        "Contamination",
        "Food Safety"
    ],
    "response": [
        {
            "author_info": {
                "name": "Garry Wall",
                "href": "/profile/Garry-Wall-1"
            },
            "answer_text": "Pathogens (microorganisms that make you sick) are odorless, colourless and tasteless. You can't tell from looking at, smelling or tasting whether the food is contaminated. Obviously, if the food does look, smell or taste off, there's something there that shouldn't be. But if it looks, smells and tastes good it could still make you very sick. So what can you do? But your food from a reputable source you can trust. Store and handle it properly, keeping food out of the temperature danger zone as much as possible. Foods that most support the growth of pathogens are low acid protein foods. They must be below 4C (40F) or above 60C (140F). They shouldn't be in that danger zone for more than 2 hours max but the less the better. Note that the 2 hours is cumulative. If it's been in the car for 45 minutes coming home from the store, you have 75 minutes safe time left whether you put it in the fridge or freezer or not. There are other factors but time and temperature are the most important. You need to be careful with hygiene, washing your hands often, particularly when handling protein foods. Be diligent about cross contamination. Cutting onions on the same board that you just used to cut raw chicken without washing the board contaminates the onions. A common cause of e coli poisoning (a nasty and violent illness) is BBQing burgers in the summer and putting the cooked burgers on the same plate that the raw ones were on. The majority of food borne illness doesn't come from restaurants. Staff are trained in sanitation and safety and there needs to be at least one person in a managerial or supervisory position with food sanitation certification. Most food borne illness results from incorrect practices in the home. ",
            "date": "Answered February 19, 2019",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joseph Mccray",
                "href": "/profile/Joseph-Mccray-3"
            },
            "answer_text": "Well, aside from Stijn Hommes correctly stated but scary answer, my answer is “not always.” Now there are some obvious signs like mold growing out of the container, or black deposits all over the food, and other visual hints, but not always. You may detect either a sour or rancid smell, again, not always. You may feel a slippery or oily feel to the food, but as usual, not always, and you may with a brief taste (not advisable) detect an off or odd taste. Salmonella is one of those foodborne pathogens that will not always be detectable by any of the above, and still make you sick. Campylobacter is another pathogen that will not always provide any noticeable hints, yet can make you sick, and the symptoms are more likely to manifest after 24–36 hours and not be recognized as a foodborne illness because it mimics other common ailments. So if you want to know a sure fire way to detect is a food is contaminated by a foodborne pathogen, the only true method is through lab testing and samples allowed to grow in a lab dish to determine the contamination level. For most foods by the time you can detect by sight, smell, feel or taste it is well nigh time to trash it. Thus the phrase, “When in doubt, throw it out.” Frankly, if you look at outbreaks of E. coli and salmonella recently, people who have gotten sick thought they were eating perfectly good food and only until symptoms manifested did they find out. In those cases, when multiple people get the same illness, health personnel try to find places or foods in common that each has eaten to allow them to narrow down the source of the pathogen. So you can see that it is not hard to get a foodborne illness and not have any idea that it has happened or why. Always practice good food safety procedures and your chances of acquiring a foodborne illness will be distinctly reduced. ",
            "date": "Answered August 3, 2019",
            "views": "1",
            "upvotes": " Answer requested by Boris Ursu"
        }
    ]
}