{
    "title": "What materials, science, and skills are needed to be taught and mastered by the young climate activist, and any useful resources? - Quora",
    "tags": [
        "Activism",
        "Educational Resources",
        "Climatology",
        "Environmentalism",
        "Climate Change",
        "Skills",
        "Science of Everyday Life",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ken Warren",
                "href": "/profile/Ken-Warren-43"
            },
            "answer_text": "What materials, science, and skills are needed to be taught and mastered by the young climate activist, and any useful resources? No need to worry about science. All the young climate activist needs to know is that 97 percent of scientists say the world will boil over in eleven years unless we bring down capitalism and the patriarchy. Skills are mostly social, eg shouting, singing and dancing in the streets. Other skills needed are map-reading, so as to coordinate maximum disruption of cities, and breaking through padlocked gates to daub paint on buildings owned by polluting capitalists. Materials must include superglue to stick yourself to cars, trains, railings and the reception areas of offices of the aforementioned polluting capitalists. They must ideally be too posh to work with a supercilious disregard for working people trying to go about their business. Here is the training video: https://banned.video/watch?id=5da0a9167c5c42001315ee6b ",
            "date": "Answered October 24, 2020",
            "views": "29",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Miriam Miriam",
                    "user_href": "/profile/Miriam-Miriam-82"
                },
                {
                    "user_id": "Lacee LeClercq",
                    "user_href": "/profile/Lacee-Marie-LeClercq"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alasdair Fairbairn",
                "href": "/profile/Alasdair-Fairbairn"
            },
            "answer_text": "To me the use of the term Activist here rings warning bells. If you really want to be useful to society on climate matters then you need to equip yourself with the technical and scientific knowledge to enable you to honestly make a contribution. Activism without that is just a pain in the neck for the rest of us. For starters you need to convince yourself whether the CAGW Meme is valid or not and back that up with your own detailed analysis, free of influence from the opinions of others. That will take a great deal of effort, particularly as there is currently a relentless propaganda agenda in place selling it’s validity. Perhaps one should start by asking why there is this propaganda and what it is that needs hiding. ",
            "date": "Answered October 25, 2020",
            "views": "27",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Miriam Miriam",
                    "user_href": "/profile/Miriam-Miriam-82"
                },
                {
                    "user_id": "Torben Mølgaard",
                    "user_href": "/profile/Torben-Mølgaard"
                }
            ]
        }
    ]
}