{
    "title": "What are the applications of space technology for societal life? - Quora",
    "tags": [
        "Space Technology",
        "Social and Behavioral Norms",
        "Society",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kiran Kandel",
                "href": "/profile/Kiran-Kandel-5"
            },
            "answer_text": "Just imagine, when we are not having any space technology, what could be the effect on Earth? Without space technology, we would be congested only to normal life. Here are some benefits of space exploration and its technology for the sake of Earth: Navigation system: Satellite plays a major role in navigating the geographical distribution and thus it is only because we are able to travel far away within an hour or more.Understanding of Space and celestial bodies: Being curious creature on Earth, humans always wonders about the formation of the universe and life. With gradual advancement in space technology, it has made possible for humans to increase their knowledge in the great domain including different solar planets, black holes and beyond.International relations: Today, it plays a crucial role to establish relationships among different countries as it is believed that space technology mandates wide knowledge and expenses. For instance, a joint mission of India with France called SARAL.Weather forecasting: It’s because of the satellite, we are able to forecast weather and be prepared for upcoming disasters.Medical research: With this technology, we can conduct an experiment on the biology of life in outer space which helps to get deeper knowledge and understanding of its. How the osteology varied from Earth to space and gene transcription, are some fields of research which provide a better understanding of biology.Improvement in Air-breathing flight: It’s because of Ramjet engine, we can see some supersonic planes today.Space-based economy: Economical status of the company is improved by launching payloads of different countries.There are more than benefits on Earth due to space technology. If it is misused, I can’t say it will benefit us. But it is obvious that the proper use of sources can benefit more than we expect from current and upcoming space technology. ",
            "date": "Answered November 17, 2019",
            "views": "129",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gagandeep Kour",
                    "user_href": "/profile/Gagandeep-Kour-21"
                },
                {
                    "user_id": "Sanket Dixit",
                    "user_href": "/profile/Sanket-Dixit-12"
                },
                {
                    "user_id": "Bharti Sharma",
                    "user_href": "/profile/Bharti-Sharma-708"
                },
                {
                    "user_id": "Jenesh Lal Shrestha",
                    "user_href": "/profile/Jenesh-Lal-Shrestha"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thakur Vivek Singh",
                "href": "/profile/Thakur-Vivek-Singh-7"
            },
            "answer_text": "The application of science and engineering to the exploration and utilization of outer space is known as space technology. Space technology is technology that is related to entering, and retrieving objects or life forms from space. \"Every day\" technologies such as weather forecasting, remote sensing, GPS systems, satellite television, and some long distance communications systems critically rely on space infrastructure. Of sciences, astronomy and Earth sciences most notably benefit from space technology. Computers and telemetry were once leading edge technologies that might have been considered \"space technology\" because of their criticality to boosters and spacecraft. They existed prior to the Space Race of the Cold War but their development was vastly accelerated to meet the needs of the two major superpowers' space programs. While still used today in spacecraft and missiles, the more prosaic applications such as remote monitoring of patients, water plants, highway conditions, etc. and the widespread use of computers far surpasses their space applications in quantity and variety of application. Space is such an alien environment that attempting to work in it requires new techniques and knowledge. New technologies originating with or accelerated by space-related endeavors are often subsequently exploited in other economic activities. This has been widely pointed to as beneficial by space advocates and enthusiasts favoring the investment of public funds in space activities and programs. Political opponents counter that it would be far cheaper to develop specific technologies directly if they are beneficial and scoff at this justification for public expenditures on space-related research. ",
            "date": "Answered July 22, 2019",
            "views": "116",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Muhammad Waqas Anjum",
                "href": "/profile/Muhammad-Waqas-Anjum-4"
            },
            "answer_text": "Space technology is becoming a useful tool for mankind. Space technology is allowing us to explore space with more accuracy. It is affecting us in many ways because we are using many things like cell phones using GPS. Satellites are helping us to contact with our loved ones sitting on other corner of earth. We use GPS to see directions, to track someone etc. We are using weather satellites telling us about weather condition every second. They are also helping in making scientific studies.  This is Meteorological Operational Satellite A (METOP-A). We have many more like this helping us everyday. We are doing scientific studies and research on space which is possible because of space technology. Then there is a Hubble Space Telescope which is capturing space pics and sending it back to earth since April 24, 1990 so that scientists can make a look on outer space.  After that many other missions have been sent to space to increases knowledge about space. Astronauts are working 24 hours and researching on space in International Space Station (ISS) which is also a result of space technology. Some rovers (Spirit, Opportunity, Curiosity) have been sent to Mars to study conditions on that planet. All of this is possible because of Space technology. Thanks to it! ",
            "date": "Answered October 7, 2020",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Anish M",
                    "user_href": "/profile/Anish-M-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Larson II",
                "href": "/profile/Tom-Larson-II"
            },
            "answer_text": "I think there are two main factors: re-application for Earth needs and further application for beyond Earth needs. Space technology is highly sophisticated and complex, as well as highly efficient. This means space tech can help Earth tech do better. Also, space tech can help us go beyond our planet so that we can either get new resources from extraterrestrial sources or to find an extraterrestrial back-up home. There are a lot of things to say here but I think the most important factor is that if we can conquer space we can apply that technology in many other ways that will do us good on the surface of Earth. ",
            "date": "Answered October 7, 2020",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Edward",
                    "user_href": "/profile/John-Edward-295"
                }
            ]
        },
        {
            "author_info": {
                "name": "Majid Hussain",
                "href": "/profile/Majid-Hussain-75"
            },
            "answer_text": "In space we cannot afford to lose even a Watt of energy. Space engineers are probably the most energy-conscious scientists on Earth as they try to preserve every single microwatt used. They have taken energy efficiency to a new high and are sharing this knowledge for use in applications on Earth. Energy is one of the big challenges on Earth and space technology is one of the tools to resolve some of the issues involved. The space sector is a forerunner in developing renewable energy, for instance, the first major use of solar cells was to power satellites during their operation in space. Energy preservation Energy storage Energy transfer Hope to have answered the question ",
            "date": "Answered November 25, 2019",
            "views": "181",
            "upvotes": " Answer requested by Gyan R. Biswal",
            "upvoters": [
                {
                    "user_id": "Indrajeet",
                    "user_href": "/profile/Indrajeet-32"
                }
            ]
        },
        {
            "author_info": {
                "name": "Phantom Works",
                "href": "/profile/Phantom-Works-1"
            },
            "answer_text": "We all know the population is rise ×2 in every year And also resouces like rare elements, also water From asteroid mining If we find some habitable planet which is reachable means we can shift some people there To colonize our galaxy one by one But importantly we are curious to know everything in the dark side Even if we foumd alien think about it they advance technology which is incredible to learn many things Also if they are primitive we might notice them from long distance and help them There were lot in space technology man Its endless ",
            "date": "Answered August 23, 2020",
            "views": "115",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aditya Santhosh",
                    "user_href": "/profile/Aditya-Santhosh-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Asimendrakumar Dhirendrakumar Dechaudhari",
                "href": "/profile/Asimendrakumar-Dhirendrakumar-Dechaudhari"
            },
            "answer_text": "Electricity was discovered for light but it has now hundreds of uses. Similarly space technology can have hundreds of uses. For example space technology is used for telecommunication and weather forecasting, not just for space travel and space resesrch. It has uses inference. Human beings can make settlements in space. We can discover the origin of creation etc. ",
            "date": "Answered December 15, 2019",
            "views": "68",
            "upvotes": " Answer requested by Gyan R. Biswal"
        },
        {
            "author_info": {
                "name": "Tuhin Kr. Dutta",
                "href": "/profile/Tuhin-Kr-Dutta"
            },
            "answer_text": "Many scientific experiments are conducted in zero gravity to improve life of people on Earth ! The advancement of Medical Sciences, Advancement of Agricultural Sciences, Computer Sciences etc are because of the experiments conducted in Space Station (ISS) ! ",
            "date": "Answered November 24, 2019",
            "views": "100",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Rishabh Jain",
                "href": "/profile/Rishabh-Jain-3241"
            },
            "answer_text": "There is a lot that we use in our daily life that is totally dependant on space technology. A very simple example is Google Maps. Impossible without satellites. Google : NASA spin-offs ",
            "date": "Answered November 30, 2019",
            "views": "18",
            "upvotes": " Answer requested by Gyan R. Biswal"
        },
        {
            "author_info": {
                "name": "Ray Nieves",
                "href": "/profile/Ray-Nieves-4"
            },
            "answer_text": "The nasa.com site has a section on all the inventions and benefits space science has given to society. Too long to repeat in this space. ",
            "date": "Answered October 7, 2020",
            "views": "13",
            "upvotes": "0"
        }
    ]
}