{
    "title": "What are examples of ethical absolutes? - Quora",
    "tags": [
        "Ethics and Morality",
        "Hackers",
        "Ethics",
        "Morals and Morality"
    ],
    "response": [
        {
            "author_info": {
                "name": "Desmond Ravenstone",
                "href": "/profile/Desmond-Ravenstone"
            },
            "answer_text": "An ethical absolute is basically a rule of conduct assumed to be applied in all circumstances. “Do not kill another person, or cause another to be killed” is an example; “Do not lie or conceal the truth” is another. But what happens when you’re put into a situation where two such absolute rules are in conflict? The classical example is when a psychotic killer breaks into your house, and demands to know where a friend of yours is located, because he wants to kill her. Do you tell him, thus causing your friend’s death? Or do you refuse, or mislead him, which is dishonest? Most folks would choose the latter, but when not lying or concealing the truth is considered as absolute a rule as not killing or causing another to be killed, you’re still in conflict. This is why so few people embrace the idea of moral/ethical absolutes. While we certainly don’t consider all rules to be totally relative, most people recognize that ethical decision-making requires careful discernment of all factors, with the goal of the best (or least objectionable) outcome possible. ",
            "date": "Answered September 5, 2016",
            "views": "52",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Tull",
                    "user_href": "/profile/Michael-Tull-6"
                },
                {
                    "user_id": "Asd Jo",
                    "user_href": "/profile/Asd-Jo"
                },
                {
                    "user_id": "Zeast H",
                    "user_href": "/profile/Zeast-H"
                },
                {
                    "user_id": "Maya Rasheed",
                    "user_href": "/profile/Maya-Rasheed-1"
                },
                {
                    "user_id": "Andrew Kingland",
                    "user_href": "/profile/Andrew-Kingland"
                },
                {
                    "user_id": "Michael Harbach",
                    "user_href": "/profile/Michael-Harbach-1"
                },
                {
                    "user_id": "Surya Ari",
                    "user_href": "/profile/Surya-Ari"
                }
            ]
        }
    ]
}