{
    "title": "What are the career options in science stream for a general maths student after 10th? - Quora",
    "tags": [
        "Mathematics Education Advice",
        "Academic Advice for Careers",
        "Education and Career Advice",
        "Career Choice Advice",
        "Mathematics Education",
        "Career Choices",
        "Academic and Educational Advice",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Seema Shah",
                "href": "/profile/Seema-Shah-8"
            },
            "answer_text": "A smart choice for you i ncase you do not want to get into any rat race of XI, XII or Diploma+ Lateral entry into degree: B. TECH. (6 YEARS INTEGRATED DIPLOMA & DEGREE PROGRAM) at MPSTME . Admissions are on, check out the notifications: Unique Features of the ProgramSix year Integrated Diploma and Degree programDegree in Civil ,Computer, Electronics and Telecommunications, and Mechanical Engineering with opportunity to pursue B. Tech. in Mechatronics for meritorious students.Well-knit curricula eliminating overlap and enhancing mathematics component lacking in diploma studentsCurriculum co-designed with active industry and professional bodies’ participationDifferent modes of delivery like online learning, experiential learning, summer courses etc.State of the Art laboratories and classroom facilitiesHighly qualified and competent faculty involved in teaching as well a researchOne year industry internship enabling students to relate theory with practiceImparting and inculcating soft as well as life skillsProgram Duration Six years full time integrated Diploma & Degree program Intake (Mumbai Campus) Computer Engineering – 120 SeatsCivil Engineering – 60 SeatsElectronics & Telecommunication Engineering – 60 SeatsMechanical Engineering – 60 SeatsCourse Structure The Programme would consist of 10 Semesters, spread over a period of 5 years, with each year having 2 semester of 6 months duration. The last year i.e. 6th year is dedicated to industrial training. The broad design of the Programme includes instructions in domain specific subjects, Natural Sciences and electives including communication skills. Accordingly, 30% of the Programme would focus on subjects related to the following areas: Mathematics, Statistics, Logic and Computer ScienceNatural Sciences: Physics, ChemistrySoft skills: Leadership Development, Personality Development, Team work and Communication Second Module would consist of all functional areas of engineering, this would account for the next 55% of the course design. The remaining 15% of the Programme would focus on industry exposure and internships in various organizations in India.The remaining 15% of the Programme would focus on industry exposure and internships in various organizations in India. ",
            "date": "Answered May 30, 2018",
            "views": "13",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rahul Chavan",
                    "user_href": "/profile/Rahul-Chavan-307"
                },
                {
                    "user_id": "Satyam Ghimire",
                    "user_href": "/profile/Satyam-Ghimire-1"
                },
                {
                    "user_id": "Krishna Swaroop",
                    "user_href": "/profile/Krishna-Swaroop-6"
                },
                {
                    "user_id": "Nirali Arora",
                    "user_href": "/profile/Nirali-Arora"
                },
                {
                    "user_id": "Junior Shiv Nadar",
                    "user_href": "/profile/Junior-Shiv-Nadar"
                }
            ]
        }
    ]
}