{
    "title": "What is the gravity on the moon compared to earth? - Quora",
    "tags": [
        "Earth-Moon Relationship",
        "Gravity of Earth",
        "The Moon (astronomy)",
        "Gravity",
        "Earth (planet)",
        "Astrophysics",
        "Planetary Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ron Brown",
                "href": "/profile/Ron-Brown-120"
            },
            "answer_text": "Not to be too pedantic, but “gravity” is a concept, it is not something that an object has. By that I mean, objects which have mass interact each other via a gravitational force. If that force is the only one that acts on some particular mass, that mass accelerates accordingly. So we can talk about the gravitational force acting on one object due to another or we can talk about the gravitational acceleration at the surface of a spherical object due to its own mass. So there are a couple of ways to interpret your question. Are you asking “What is the gravitational force on the Moon (due to the Earth) compared to the gravitational force on the Earth (due to the Moon)?” Or are you asking, “What is the gravitational acceleration of an object in free fall at the surface of the Moon compared to the gravitational acceleration of an object in free fall at the surface of the Earth?” Those are two very different questions. The other answers here seem to be addressing the second of those questions, and maybe that is what you were asking. But if you are asking how the gravitational forces on the Moon and Earth compare due to their interaction, then they are necessarily the same. That is what Newton’s third law is trying to say. Objects which interact exert equal and opposite forces on each other. If you are comparing the surface gravitational acceleration on the Moon to that on the Earth due to those object’s masses, then the other answers are correct. The surface gravitational acceleration due to any spherical mass M with radius R, is given by g=GM/R^2 according to Newton’s universal law of gravitation. And that allows you to compare the values for the Earth and the Moon (and any other celestial object). ",
            "date": "Answered February 18, 2019",
            "views": "24",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Io Dkd",
                    "user_href": "/profile/Io-Dkd"
                },
                {
                    "user_id": "Paul Ross Sandilands",
                    "user_href": "/profile/Paul-Ross-Sandilands"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Flavin",
                "href": "/profile/John-Flavin-1"
            },
            "answer_text": "The force of gravity is dependent on the mass of an object. The Earth’s mass is M⊕ = 5.9722×10(24) kg, while the mass of the Moon is 7.347 x 10(22) kg. The Earth’s gravity weighs in, no pun intended, at 9.8 m/s(2) and the Moon is 1.63 m/s(2). The number in parentheses indicates the power a number is raised, for example (2) would be the number squared. The force of gravity at the Moon’s surface is roughly 17% of that on Earth. This means that an object that weighs 90 kilos on Earth would weigh about 15 kilos on the Moon. Here is a handy moon weight calculator Weight On the Moon Calculator or if you prefer, on any planet. Your Weight on Other Worlds ",
            "date": "Answered February 15, 2019",
            "views": "4",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Paul Ross Sandilands",
                    "user_href": "/profile/Paul-Ross-Sandilands"
                }
            ]
        }
    ]
}