{
    "title": "What are the best ways to get ahead in your career? - Quora",
    "tags": [
        "Job Advice",
        "Best Practices",
        "Best of X",
        "Workplace and Professional Etiquette",
        "Work",
        "Jobs and Careers",
        "Survey Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jim Jacob",
                "href": "/profile/Jim-Jacob-6"
            },
            "answer_text": "People who learn to take responsibility for their actions are eventually picked by the company to lead. So remember everyone screws up. The important thing is to apologize when you are in the wrong. An effective and a sincere apology has three parts a) Acknowledge how your action affected the person b) say you’re sorry c) describe what you’re going to do to make it right or make sure it doesn’t happen again. Don’t give excuses.Don’t half ass on any assignments given to you. Regardless of how important or non-important your boss makes it sound, don’t half ass it. You build credibility with consistent output and not one or two big moments.Ask your boss exactly what you are supposed to deliver against for your next promotion. Most people just show up at office without any long term planning. They have no clue why they’re spending 90 hours a week at office except to get their salary. if you want to progress have clear goals and communicate it with your boss. And get clarity on what his/her expectation is of you. This way you have a good reason to ask for your promotion in your next review.Invest in workshops and seminars in your industry instead of buying the next iPhoneDon’t say yes to each and everyone – even when you are a junior. Take only the work you can realistically do and do it extremely well. That’s the only way you will gain respect. Have a clear work philosophy. Have your do’s and don’ts and express them very clearly to the people you work with. Without a philosophy people will overstep your boundaries, take a dump on you and walk all over you whenever they please. Master the art of saying NO.Read non fictions on management, productivity, personal finance and leadership. Make a habit of it.Make sure your personal life is sorted too if you want to do well in your career. Your personal life and professional lives are not separate. If one of them’s screwed, the other is not going to be extraordinary. Or at least you won’t be able to sustain at an extraordinary level.Pay attention to dressing. Dress not for the job you have, but for the job you want.Invest time to network. If you don’t your career trajectory will stagnate after a point. Network relentlessly within the organization and the industry you work in. Your network is going to determine how big of a jump you will make from your current job. So invest a lot of time networking.Learn to sell yourself. Know that in the corporate world you are a resource. A product. People buy into products that is sold to them in the most attractive way. Your boss is people, your next hiring manager is people, your team is people. So learn the basic principles of sales and marketing and learn to apply some of it to make yourself visible in the organization (and later as you grow – be visible in the industry) If you are wondering why you haven’t got that promotion even after working 90 hours a week, it’s because people above you don’t see you as an attractive product.",
            "date": "Answered January 23, 2018",
            "views": "12",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sidra Choudhry",
                    "user_href": "/profile/Sidra-Choudhry-2"
                },
                {
                    "user_id": "Vishnu Sharma",
                    "user_href": "/profile/Vishnu-Sharma-46"
                },
                {
                    "user_id": "Candy",
                    "user_href": "/profile/Candy-179"
                },
                {
                    "user_id": "Arun Gahlot",
                    "user_href": "/profile/Arun-Gahlot-3"
                },
                {
                    "user_id": "Azkaranaufath Al-Qirafa",
                    "user_href": "/profile/Azkaranaufath-Al-Qirafa"
                },
                {
                    "user_id": "Sayali Naik",
                    "user_href": "/profile/Sayali-Naik-44"
                },
                {
                    "user_id": "Alan George",
                    "user_href": "/profile/Alan-George-32"
                },
                {
                    "user_id": "Victoria Kolotov",
                    "user_href": "/profile/Victoria-Kolotov"
                },
                {
                    "user_id": "Sayali Kawale",
                    "user_href": "/profile/Sayali-Kawale"
                },
                {
                    "user_id": "Bharadwaj Pemmaraju",
                    "user_href": "/profile/Bharadwaj-Pemmaraju"
                },
                {
                    "user_id": "Ram",
                    "user_href": "/profile/Ram-1315"
                },
                {
                    "user_id": "Dhruv Suri",
                    "user_href": "/profile/Dhruv-Suri-6"
                },
                {
                    "user_id": "Gaurav Gaur",
                    "user_href": "/profile/Gaurav-Gaur-148"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rafael Sarandeses",
                "href": "/profile/Rafael-Sarandeses-3"
            },
            "answer_text": "I can summarise it as “You can only connect the dots backwards.” (Steve Jobs). Let me explain what I mean by this: 1. Change your idea of what “making an impact” means I see young people nowadays starting their careers with a lot of enthusiasm, just to become bored and disappointed after a few months, the most common feedback being “I am not making an impact”. But as my ex-colleague at Goldman Sachs Joseph Mauro famously said one day, you have to “stay on the bus”. We can make an impact every day with tiny things, but we tend to discard this as valuable because we reject simple stuff in favour of complex matters. This is also applicable to how we feel. Simple is boring and not sophisticated, and you and I are fun and sophisticated people, correct? Well, you don’t need to feel “sophisticated” about your impact. It is more rewarding to change the approach and build your contribution sequentially. Helping our team book meetings, bringing lunch to the desk, mentoring a friend at work… are all good ways of helping make a better world from a micro perspective. Small and simple things matter, for big things are made of small stuff. Focus on the impact you can make at every step of the way and stop worrying about the impact you think you should be making. 2. Set the right goals at each stage of your career The other day I was talking to one of my students at IE Business School. We were discussing career matters, and he was telling me that he was struggling to make an important decision: become a quant structurer in banking or take a different path in finance. He is in his early twenties. And so I asked: what are the things you can do to help yourself make the best decision? What is holding you back from acting upon that choice? If there was no downside, what would you choose here and now, on the spot? Treating a decision like that as an immediate goal is paralysing. To make that BIG decision you need to gather quality information first: info about the industry, the things you need to master to be successful, devoting enough time to interact with people doing that job, understanding the challenges, the growth path and the typical “day in the life”… you need to tick off the right “process goals” first before you can tackle the “end goal”. The former will take you to the latter. Choose goals that drive you to your ultimate ambitions but make sure you keep moving and acting, not just thinking and planning. Unpack problems and tackle things bit by bit, day after day. Avoid focusing only on the big, longer-term aspirations and keep moving. 3. The “return on time invested” in growing professionally is not linear People tend to focus on their big goals, without realising that sometimes it takes several years to get the building blocks right. Moreover, the path as you go from breakthrough to breakthrough is never linear. You can never bet on a straight line, but you can surely bet on gradually acquiring the right skills for the future, and keeping a “can do” attitude and the right work ethics. Those are things that depend on you, so focus on those and let “time” do the rest. It is a lot more useful to our careers to focus on the process, on doing what needs to be done today, so that we can make progress. Deliberate practice compounds like interest. Unfortunately, most people don’t have the patience to wait for the big pay-offs. 4. Don’t fall for cheap marketing. Discovering your purpose is a lifelong journey As Peter Drucker once said, “Successful careers are not planned. They develop when people are prepared for opportunities because they know their strengths, their method of work, and their values.” I have done many things in life. I think I am on my 7th “career stint” at 39 years of age. And I don’t believe I am done yet. Life, for me, was never meant to be a straight line. What keeps me moving is my constant eagerness to learn, and to tackle opportunities that contribute to my skill set and my career capital as I grow. You just don’t follow your passion, you work on it. Discovering your purpose is a lifelong journey, and meaning lies in the path, not the destination. ",
            "date": "Answered October 5, 2018",
            "views": "22",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Emmanuel Ori",
                    "user_href": "/profile/Emmanuel-Ori"
                },
                {
                    "user_id": "Kanica Jain",
                    "user_href": "/profile/Kanica-Jain"
                },
                {
                    "user_id": "Sven Clanzett",
                    "user_href": "/profile/Sven-Clanzett"
                },
                {
                    "user_id": "Mira Zaslove",
                    "user_href": "/profile/Mira-Zaslove"
                },
                {
                    "user_id": "Faisal Anwar",
                    "user_href": "/profile/Faisal-Anwar-5"
                },
                {
                    "user_id": "Stewart Stokes",
                    "user_href": "/profile/Stewart-Stokes-2"
                },
                {
                    "user_id": "Sneha Singh",
                    "user_href": "/profile/Sneha-Singh-237"
                },
                {
                    "user_id": "Ujwal Chaudhari",
                    "user_href": "/profile/Ujwal-Chaudhari-11"
                },
                {
                    "user_id": "Aaron DelSignore",
                    "user_href": "/profile/Aaron-DelSignore"
                },
                {
                    "user_id": "Suraj K",
                    "user_href": "/profile/Suraj-K-2"
                },
                {
                    "user_id": "Hannah Wei",
                    "user_href": "/profile/Hannah-Wei-11"
                },
                {
                    "user_id": "Niklas Göke",
                    "user_href": "/profile/Niklas-Göke"
                },
                {
                    "user_id": "Vivienne",
                    "user_href": "/profile/Vivienne-58"
                }
            ]
        },
        {
            "author_info": {
                "name": "Qasim Khwaja",
                "href": "/profile/Qasim-Khwaja"
            },
            "answer_text": "For about half of my professional career I was an employee and for the past 15 years, I have run my own business with about 75 employees. I will relate my experiences.. As an employee, I was good. I worked hard, I finished my projects well before time, never gave my bosses any reason to worry, Mr. Dependable is what they called me. You know what? I never got anywhere in my career. It would tick me off that I am doing everything that was expected of me and still, I was bypassed every time an opportunity for a promotion came up. My last job before starting my own business was for a huge corporation. By this point, it was already in my head, that I would remain a lowly level employee no matter how well I worked, so this time around when I got this job, I was not expecting anything so I stopped caring. Not that I stopped caring about my work, I still worked hard, but I didnt live with this fear of always keeping upper management happy. If my manager was making a mistake, I quite literally told him that he was an idiot and I do the task the correct way myself. Since I didnt care about ever getting a promotion, I never hesitated to stick my neck out voice my opinion. I would go into other departments and help other people out, just because … When I handed in my resignation at this place it shocked me that upper management were really upset at my resignation. Down the rumor mill, I got word that they wanted to take me down the path of eventually being a director. Needless to say, I was in absolute shock! At the time, I couldn’t figure out what they saw in me. Jumping ahead to starting my own business. After years of learning the ropes and building experience in the role of boss, I now realize what I always did wrong, and what I did right in my last job. The whole thing is that as an owner of a company with around 75 employees (no I dont know the exact amount of people that work for me), I have seen all types of employees. What I can tell you is that there are two type of people that get the attention of management, one is obviously the incompetents. They are the ones who cannot get the job done right, and when the job doesnt get done, it effects the rest of the business, so these types of people do not escape notice. There are those that are working hard, doing exactly what is expected of them. They are the ones that hardly get noticed. They get their work done, the mechanics of the company work as expected, so there is no attention paid to that or those who are struggling to keep it that way (I was always that kind of person). The third type of employee who does get the attention of management are the risk takers. They are not afraid to get their feet wet, they go above and beyond what their requires of them. These types of people dont worry only about if they are getting their job done, but they also worry about those who are not getting the job done and they pick up the slack. They take chances and sometimes they fall flat on their faces, but you know what? They tried. They made an effort when they didnt need to. They tried to do what is best for the company. These are the people who get promoted. That was what I was inadvertently doing at my last job before quitting that I now understand. ",
            "date": "Answered June 27, 2020",
            "views": "187",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Judith Begley Trimarchi",
                "href": "/profile/Judith-Begley-Trimarchi"
            },
            "answer_text": "Print out this list. (Now.)Declare what your life is for. Make it something extraordinary. It doesn’t matter if it’s becoming a billionaire or ending world hunger. It doesn’t have to the “right” thing, it’s not forever. Now if you make a declaration for your purpose or your goal(s), it does not mean you cannot change it later or expand it or just drop it and declare something else. Just declare what your life is for right now. Right now, *my* life is for “being in action towards a world that works for everyone.” I’ll never accomplish it, but it is a good thing to be working towards. Make some big promises for what you are going to accomplish. Chicken shit tiny promises will result in chicken shit tiny results.Write down a plan. Set deadlines and create milestones. Good ideas without concrete dates are just good ideas. Plan your work and work your plan. Understand that actions cause things to happen, words do not. Make promises to others about what you are going to do and by when. We are more likely to complete a task when someone else is counting on us to do it. If you break a promise, admit that you did that, clean up any mess that you caused, make a new promise. Share your promises and your life goals with anyone and everyone who will listen. (I shared my goal of running an eco-friendly bed and breakfast in New Mexico, US for 10 years. I probably told over 5000 people about it. I handed out business cards on 4 continents. Now I’m running an eco-friendly B&B in New Mexico.) Ask for help and support. Any project worth doing will probably be big enough and complicated enough to need more than one person. Don’t be afraid to make big, bold requests for help, materials, advice, money and anything else you need for your project. You’ll be surprised how often the answer will be Yes! Keep your integrity squeaky clean. No dirty money, no stolen goods, no unpaid bills, etc.I’ve used this list, and it works. Really. When you give your word to yourself that you will move from thinking into action, you will get motivated, you will take risks, you will learn, and as you work toward this goal, either it will become what inspires you, or it will lay the groundwork for you to discover something else that inspires you. ",
            "date": "Answered May 1, 2018",
            "views": "279",
            "upvotes": " Answer requested by Alexis Jane Gan",
            "upvoters": [
                {
                    "user_id": "Azul Sofia Von Glasberg",
                    "user_href": "/profile/Azul-Sofia-Von-Glasberg-1"
                },
                {
                    "user_id": "Mert Aktas",
                    "user_href": "/profile/Mert-Aktas"
                },
                {
                    "user_id": "Shantanu",
                    "user_href": "/profile/Shantanu-189"
                },
                {
                    "user_id": "Srividhya Arun",
                    "user_href": "/profile/Srividhya-Arun"
                },
                {
                    "user_id": "Elabbas Nasr",
                    "user_href": "/profile/Elabbas-Nasr"
                },
                {
                    "user_id": "Jacob Mammen",
                    "user_href": "/profile/Jacob-Mammen-7"
                },
                {
                    "user_id": "Harshvardhan",
                    "user_href": "/profile/Harshvardhan-50"
                },
                {
                    "user_id": "Jason Ma",
                    "user_href": "/profile/Jason-Ma-117"
                },
                {
                    "user_id": "Anas Albrrak",
                    "user_href": "/profile/Anas-Albrrak"
                },
                {
                    "user_id": "Baptiste Debever",
                    "user_href": "/profile/Baptiste-Debever"
                },
                {
                    "user_id": "Stephanie Doan",
                    "user_href": "/profile/Stephanie-Doan-6"
                },
                {
                    "user_id": "Sophie Lhoutellier",
                    "user_href": "/profile/Sophie-Lhoutellier"
                },
                {
                    "user_id": "Jayne Head",
                    "user_href": "/profile/Jayne-Head-1"
                },
                {
                    "user_id": "Vivian",
                    "user_href": "/profile/Vivian-39"
                },
                {
                    "user_id": "Jordan Grant",
                    "user_href": "/profile/Jordan-Grant-35"
                },
                {
                    "user_id": "Pauline Lefort",
                    "user_href": "/profile/Pauline-Lefort"
                },
                {
                    "user_id": "Cameron Waters",
                    "user_href": "/profile/Cameron-Waters-3"
                },
                {
                    "user_id": "Bryan Jimenez",
                    "user_href": "/profile/Bryan-Jimenez-70"
                },
                {
                    "user_id": "Frank Stein",
                    "user_href": "/profile/Frank-Stein-14"
                },
                {
                    "user_id": "Shabnam Sio",
                    "user_href": "/profile/Shabnam-Sio-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rajneesh Rana",
                "href": "/profile/Rajneesh-Rana-13"
            },
            "answer_text": "While the start and progressing through a prosperous career may be smooth sailing for quite a few individuals, others might use a little aid and guidance. At bit.ly/expertrons , experts from over 200 businesses working in all levels and management are directing aspirants to direct a thriving career. Below are a few suggestions that might allow you to receive an excellent job and be rewarding in your career. When the performance test period rolls around, think about it seriously. Don't dismiss or worry about how you can improve yourself through some thoughts that are supplied. Take them on and aim to show progress. It can be beneficial once you're having trouble with some pieces of your job. Lots of women and men focus on fostering themselves in their workplace. It might be helpful, but to concentrate on making your boss look good. You could help improve livelihood by inviting your manager, and you'll probably get a productive advocate with interest in maintaining you. It's ideal for making your co-workers look high as your team's success reflects a lot of your success. Be a kind, beautiful, respectful, and co-worker that's agreeable. If it is cool for you to remain with apparel at the workplace, those in the amounts above you're mostly wearing suits, so it might be smart to wear uniforms. In this manner, folks can envision you working at higher levels. Go outside of your wardrobe. Be professional in experiences when interacting with them and show a dedication to the company and the job. In the event you're unexpectedly trying to find a new gig and will need to turn to your network of relations, it's advisable if it isn't the first time they're hearing from you in several decades. Keeping in touch somewhat by sending articles or things of interest by discussing meals, keep you in mind if opportunities appear, and make people feel like you personally. The networks comprise individuals who understand you like you and also to some degree and therefore are people you met here or there. Try to say yes if presented with opportunities (a brand-new place, the chance to provide a considerable demonstration, a substantial company trip), even if they seem frightening. When co-workers request help, say. You will be seen as valuable if you're known as someone who steps up. Find a guide Consider a few superiors which you admire and decide whether someone will tend to become your mentor. The two of you can meet to review achievements, and your objectives, together with your mentor, will help groom one to urge you. ",
            "date": "Answered June 3, 2020",
            "views": "113",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steve Benson",
                "href": "/profile/Steve-Benson-7"
            },
            "answer_text": "I think that a good exercise for career development is to break each of your jobs down into a set of activities. Each one of those activities can be isolated and the skills can be improved upon. If you need help breaking your job down into its key activities, think of it like a game of basketball. Throughout a game, you spend your time running, defending shots, shooting, passing, dribbling, etc. You can get even more granular and break each activity into its different parts (ex. shooting includes layups, jump shots, and free throws). So, if you’re looking to expand your role, learn new skills and add new activities to the role.  Next, you can step back even further and not just think about your job, but your career in the same way. A lot of times, company executives will have to know and be able to manage not just one role, but other roles as well. For example, a VP of Marketing needs to manage the Product Marketing team, Corporate Marketing team and the Advertising team. If you are the Director of the Product Marketing team and you want to become the VP of Marketing, you need to develop your skills and expertise in those other areas, or else you aren't really qualified to take the next steps ",
            "date": "Answered June 4, 2018",
            "views": "13",
            "upvotes": " View 43 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Swarnav Choudhury",
                    "user_href": "/profile/Swarnav-Choudhury-1"
                },
                {
                    "user_id": "Henry Ized",
                    "user_href": "/profile/Henry-Ized"
                },
                {
                    "user_id": "Josna Joseph",
                    "user_href": "/profile/Josna-Joseph-20"
                },
                {
                    "user_id": "Krunal Makwana",
                    "user_href": "/profile/Krunal-Makwana-6"
                },
                {
                    "user_id": "Vipin Chandran",
                    "user_href": "/profile/Vipin-Chandran-5"
                },
                {
                    "user_id": "Rohit Gadagkar",
                    "user_href": "/profile/Rohit-Gadagkar"
                },
                {
                    "user_id": "Tina Joy",
                    "user_href": "/profile/Tina-Joy-17"
                },
                {
                    "user_id": "Khalandhar Basha",
                    "user_href": "/profile/Khalandhar-Basha"
                },
                {
                    "user_id": "Irvan Mupid",
                    "user_href": "/profile/Irvan-Mupid-1"
                },
                {
                    "user_id": "Matthew John May",
                    "user_href": "/profile/Matthew-John-May"
                },
                {
                    "user_id": "Shubhangi Remanache",
                    "user_href": "/profile/Shubhangi-Remanache"
                },
                {
                    "user_id": "Stacy Medford",
                    "user_href": "/profile/Stacy-Medford-2"
                },
                {
                    "user_id": "Ryan Adams",
                    "user_href": "/profile/Ryan-Adams-24"
                },
                {
                    "user_id": "Zohaib Akhter",
                    "user_href": "/profile/Zohaib-Akhter-3"
                },
                {
                    "user_id": "Arnav Mathur",
                    "user_href": "/profile/Arnav-Mathur-7"
                },
                {
                    "user_id": "Chinmay Patel",
                    "user_href": "/profile/Chinmay-Patel-9"
                },
                {
                    "user_id": "Aryan",
                    "user_href": "/profile/Aryan-608"
                },
                {
                    "user_id": "Lucy Mitchell",
                    "user_href": "/profile/Lucy-Mitchell-75"
                },
                {
                    "user_id": "Ritik Jain",
                    "user_href": "/profile/Ritik-Jain-316"
                },
                {
                    "user_id": "Santan Kumar",
                    "user_href": "/profile/Santan-Kumar-12"
                },
                {
                    "user_id": "Asad Baig",
                    "user_href": "/profile/Asad-Baig-14"
                },
                {
                    "user_id": "Shreyas Naigude",
                    "user_href": "/profile/Shreyas-Naigude"
                },
                {
                    "user_id": "Kumar Rounak",
                    "user_href": "/profile/Kumar-Rounak-10"
                },
                {
                    "user_id": "Sai Pranav Thallada",
                    "user_href": "/profile/Sai-Pranav-Thallada-1"
                },
                {
                    "user_id": "Slyman Mustafa",
                    "user_href": "/profile/Slyman-Mustafa"
                },
                {
                    "user_id": "Rajas Rade",
                    "user_href": "/profile/Rajas-Rade"
                },
                {
                    "user_id": "Ajay Muralidharan",
                    "user_href": "/profile/Ajay-Muralidharan-2"
                },
                {
                    "user_id": "Aditya Sree Bysani",
                    "user_href": "/profile/Aditya-Sree-Bysani"
                },
                {
                    "user_id": "Rayne Sazaki",
                    "user_href": "/profile/Rayne-Sazaki"
                },
                {
                    "user_id": "Aditya Gupta",
                    "user_href": "/profile/Aditya-Gupta-581"
                },
                {
                    "user_id": "Rick Sanchez",
                    "user_href": "/profile/Rick-Sanchez-597"
                },
                {
                    "user_id": "Harshita Sharma",
                    "user_href": "/profile/Harshita-Sharma-1219"
                },
                {
                    "user_id": "Shantanu Ghumade",
                    "user_href": "/profile/Shantanu-Ghumade"
                },
                {
                    "user_id": "Kevin So",
                    "user_href": "/profile/Kevin-So-36"
                },
                {
                    "user_id": "Dimitri Slodrovetcz",
                    "user_href": "/profile/Dimitri-Slodrovetcz"
                },
                {
                    "user_id": "Kieren Patel",
                    "user_href": "/profile/Kieren-Patel"
                },
                {
                    "user_id": "Nashir Jay",
                    "user_href": "/profile/Nashir-Jay"
                },
                {
                    "user_id": "Steven Davis",
                    "user_href": "/profile/Steven-Davis-189"
                },
                {
                    "user_id": "Be Wong",
                    "user_href": "/profile/Be-Wong-2"
                },
                {
                    "user_id": "Lynette VJ Marfa",
                    "user_href": "/profile/Lynette-VJ-Marfa"
                },
                {
                    "user_id": "Federico Tomassetti",
                    "user_href": "/profile/Federico-Tomassetti"
                },
                {
                    "user_id": "Irfan Buddaseth",
                    "user_href": "/profile/Irfan-Buddaseth"
                },
                {
                    "user_id": "Dina Al Saeedy",
                    "user_href": "/profile/Dina-Al-Saeedy"
                },
                {
                    "user_id": "Soundarya Subudhi",
                    "user_href": "/profile/Soundarya-Subudhi"
                },
                {
                    "user_id": "Christopher Tan",
                    "user_href": "/profile/Christopher-Tan-121"
                },
                {
                    "user_id": "Aliridha Habib",
                    "user_href": "/profile/Aliridha-Habib"
                },
                {
                    "user_id": "Divyam Khaitan",
                    "user_href": "/profile/Divyam-Khaitan"
                },
                {
                    "user_id": "Tetzel Parato",
                    "user_href": "/profile/Tetzel-Parato"
                },
                {
                    "user_id": "Abhishek Sharma",
                    "user_href": "/profile/Abhishek-Sharma-2144"
                },
                {
                    "user_id": "Dristi Rupa Patgiri",
                    "user_href": "/profile/Dristi-Rupa-Patgiri"
                },
                {
                    "user_id": "Rajan Kerai",
                    "user_href": "/profile/Rajan-Kerai-1"
                },
                {
                    "user_id": "Lineesh Neel",
                    "user_href": "/profile/Lineesh-Neel"
                },
                {
                    "user_id": "Radhwana",
                    "user_href": "/profile/Radhwana"
                },
                {
                    "user_id": "Rithik John",
                    "user_href": "/profile/Rithik-John-1"
                },
                {
                    "user_id": "Wangui Hinga",
                    "user_href": "/profile/Wangui-Hinga-1"
                },
                {
                    "user_id": "Chaitanya Mogal",
                    "user_href": "/profile/Chaitanya-Mogal"
                },
                {
                    "user_id": "Alexander Skow",
                    "user_href": "/profile/Alexander-Skow"
                },
                {
                    "user_id": "Adedeji D. Ajibola",
                    "user_href": "/profile/Adedeji-D-Ajibola"
                },
                {
                    "user_id": "Ike Abioye",
                    "user_href": "/profile/Ike-Abioye"
                },
                {
                    "user_id": "Dilnoor Singh",
                    "user_href": "/profile/Dilnoor-Singh"
                },
                {
                    "user_id": "Muskan",
                    "user_href": "/profile/Muskan-77"
                },
                {
                    "user_id": "Ravi Bhatia",
                    "user_href": "/profile/Ravi-Bhatia-2"
                },
                {
                    "user_id": "Himanshu Lalwani",
                    "user_href": "/profile/Himanshu-Lalwani-11"
                },
                {
                    "user_id": "Guru Charan",
                    "user_href": "/profile/Guru-Charan-17"
                },
                {
                    "user_id": "Ajatsatru Ranjan",
                    "user_href": "/profile/Ajatsatru-Ranjan"
                },
                {
                    "user_id": "Abhinav Bm",
                    "user_href": "/profile/Abhinav-Bm"
                },
                {
                    "user_id": "Nikesh Prasad",
                    "user_href": "/profile/Nikesh-Prasad-9"
                },
                {
                    "user_id": "Aditya Rai",
                    "user_href": "/profile/Aditya-Rai-20"
                },
                {
                    "user_id": "Francesc Gabriel Marti Jorba",
                    "user_href": "/profile/Francesc-Gabriel-Marti-Jorba"
                },
                {
                    "user_id": "Mahmood Nabi",
                    "user_href": "/profile/Mahmood-Nabi-1"
                },
                {
                    "user_id": "Aditya Mukherjee",
                    "user_href": "/profile/Aditya-Mukherjee-75"
                },
                {
                    "user_id": "Varghese Philip",
                    "user_href": "/profile/Varghese-Philip-1"
                },
                {
                    "user_id": "Aditya Pandit",
                    "user_href": "/profile/Aditya-Pandit-79"
                },
                {
                    "user_id": "Angela Winchester",
                    "user_href": "/profile/Angela-Winchester-9"
                },
                {
                    "user_id": "Marcin Bartoszuk",
                    "user_href": "/profile/Marcin-Bartoszuk"
                },
                {
                    "user_id": "Neha Rajashekhar",
                    "user_href": "/profile/Neha-Rajashekhar"
                },
                {
                    "user_id": "Harish Bhp",
                    "user_href": "/profile/Harish-Bhp"
                },
                {
                    "user_id": "Ella Green",
                    "user_href": "/profile/Ella-Green-68"
                },
                {
                    "user_id": "Aguolu Kingsley",
                    "user_href": "/profile/Aguolu-Kingsley"
                },
                {
                    "user_id": "Kh Elyes",
                    "user_href": "/profile/Kh-Elyes"
                },
                {
                    "user_id": "Suresh Kumar",
                    "user_href": "/profile/Suresh-Kumar-5275"
                },
                {
                    "user_id": "Aidan Burleson",
                    "user_href": "/profile/Aidan-Burleson-1"
                },
                {
                    "user_id": "Amay Kaikini",
                    "user_href": "/profile/Amay-Kaikini-1"
                },
                {
                    "user_id": "Mahendra Nayal",
                    "user_href": "/profile/Mahendra-Nayal-4"
                },
                {
                    "user_id": "Siddharth Sah",
                    "user_href": "/profile/Siddharth-Sah-7"
                },
                {
                    "user_id": "Prashant Pokhriyal",
                    "user_href": "/profile/Prashant-Pokhriyal-1"
                },
                {
                    "user_id": "Happy Cat",
                    "user_href": "/profile/Happy-Cat-73"
                },
                {
                    "user_id": "Piyush Mishra",
                    "user_href": "/profile/Piyush-Mishra-21"
                },
                {
                    "user_id": "Aviral Singh",
                    "user_href": "/profile/Aviral-Singh-52"
                },
                {
                    "user_id": "Jerzy Dziubel",
                    "user_href": "/profile/Jerzy-Dziubel"
                },
                {
                    "user_id": "Emeka Uchendu",
                    "user_href": "/profile/Emeka-Uchendu"
                },
                {
                    "user_id": "Narendra Patel",
                    "user_href": "/profile/Narendra-Patel-17"
                },
                {
                    "user_id": "Nabhishek Singh",
                    "user_href": "/profile/Nabhishek-Singh"
                },
                {
                    "user_id": "Ravi Mishra",
                    "user_href": "/profile/Ravi-Mishra-947"
                },
                {
                    "user_id": "Gaston Advent",
                    "user_href": "/profile/Gaston-Advent"
                },
                {
                    "user_id": "Jaiprakash Pari",
                    "user_href": "/profile/Jaiprakash-Pari"
                },
                {
                    "user_id": "Manjiri Deshpande",
                    "user_href": "/profile/Manjiri-Deshpande-3"
                },
                {
                    "user_id": "Suryansh Gupta",
                    "user_href": "/profile/Suryansh-Gupta-120"
                },
                {
                    "user_id": "Saurav Bhagat",
                    "user_href": "/profile/Saurav-Bhagat-10"
                },
                {
                    "user_id": "Nitin P",
                    "user_href": "/profile/Nitin-P-63"
                },
                {
                    "user_id": "Darika Nupadram",
                    "user_href": "/profile/Darika-Nupadram"
                },
                {
                    "user_id": "Samir Joglekar",
                    "user_href": "/profile/Samir-Joglekar"
                },
                {
                    "user_id": "Harpreet Singh",
                    "user_href": "/profile/Harpreet-Singh-348"
                },
                {
                    "user_id": "Matrina Ofisa",
                    "user_href": "/profile/Matrina-Ofisa-1"
                },
                {
                    "user_id": "Katherine Segen",
                    "user_href": "/profile/Katherine-Segen"
                },
                {
                    "user_id": "António B Salgueiro",
                    "user_href": "/profile/António-B-Salgueiro"
                },
                {
                    "user_id": "Viraj K",
                    "user_href": "/profile/Viraj-K-20"
                },
                {
                    "user_id": "Mark Woolerton",
                    "user_href": "/profile/Mark-Woolerton"
                },
                {
                    "user_id": "Ruby Kau",
                    "user_href": "/profile/Ruby-Kau"
                },
                {
                    "user_id": "Shilpa Mamtani",
                    "user_href": "/profile/Shilpa-Mamtani"
                },
                {
                    "user_id": "Nishat Fatima",
                    "user_href": "/profile/Nishat-Fatima-158"
                },
                {
                    "user_id": "Francois Allotey",
                    "user_href": "/profile/Francois-Allotey"
                },
                {
                    "user_id": "Jyotsana Baurai",
                    "user_href": "/profile/Jyotsana-Baurai"
                },
                {
                    "user_id": "Shehabeddeen Ashraf",
                    "user_href": "/profile/Shehabeddeen-Ashraf"
                },
                {
                    "user_id": "Yeswanth Devisetty",
                    "user_href": "/profile/Yeswanth-Devisetty"
                },
                {
                    "user_id": "Jestin Roy",
                    "user_href": "/profile/Jestin-Roy-2"
                },
                {
                    "user_id": "Lalit Gandhi",
                    "user_href": "/profile/Lalit-Gandhi-12"
                },
                {
                    "user_id": "Jayant Maurya",
                    "user_href": "/profile/Jayant-Maurya-1"
                },
                {
                    "user_id": "Manish Basavalinga",
                    "user_href": "/profile/Manish-Basavalinga"
                },
                {
                    "user_id": "Nimit",
                    "user_href": "/profile/Nimit-16"
                },
                {
                    "user_id": "Alaa Naser",
                    "user_href": "/profile/Alaa-Naser-10"
                },
                {
                    "user_id": "Ella Asihin",
                    "user_href": "/profile/Ella-Asihin"
                },
                {
                    "user_id": "Shivam Singh",
                    "user_href": "/profile/Shivam-Singh-915"
                },
                {
                    "user_id": "Chigurupaty Sri Karthik",
                    "user_href": "/profile/Chigurupaty-Sri-Karthik"
                },
                {
                    "user_id": "Michael Louis",
                    "user_href": "/profile/Michael-Louis-97"
                },
                {
                    "user_id": "Dungeon Master",
                    "user_href": "/profile/Dungeon-Master-69"
                },
                {
                    "user_id": "Prateek Pranjal",
                    "user_href": "/profile/Prateek-Pranjal"
                },
                {
                    "user_id": "Narayanan Ganesh",
                    "user_href": "/profile/Narayanan-Ganesh-3"
                },
                {
                    "user_id": "Torger Naerland",
                    "user_href": "/profile/Torger-Naerland"
                },
                {
                    "user_id": "Prasad Thakare",
                    "user_href": "/profile/Prasad-Thakare-12"
                },
                {
                    "user_id": "Nikhil Kunnath",
                    "user_href": "/profile/Nikhil-Kunnath"
                },
                {
                    "user_id": "Vijaita Thakur",
                    "user_href": "/profile/Vijaita-Thakur"
                },
                {
                    "user_id": "Gopinath Perumal",
                    "user_href": "/profile/Gopinath-Perumal-23"
                },
                {
                    "user_id": "Mwanafunzi Ganza Cedric",
                    "user_href": "/profile/Mwanafunzi-Ganza-Cedric"
                },
                {
                    "user_id": "Pratham Pai",
                    "user_href": "/profile/Pratham-Pai"
                },
                {
                    "user_id": "Vedang Arekar",
                    "user_href": "/profile/Vedang-Arekar"
                },
                {
                    "user_id": "Riya Kheskwani",
                    "user_href": "/profile/Riya-Kheskwani"
                },
                {
                    "user_id": "Izu Etoniru",
                    "user_href": "/profile/Izu-Etoniru"
                },
                {
                    "user_id": "Amoo Hammed",
                    "user_href": "/profile/Amoo-Hammed"
                },
                {
                    "user_id": "Brendon Leong",
                    "user_href": "/profile/Brendon-Leong"
                }
            ]
        },
        {
            "author_info": {
                "name": "Asim Qureshi",
                "href": "/profile/Asim-Qureshi-17"
            },
            "answer_text": "Just over a decade ago, I was at my desk in Morgan Stanley's London office, on a teleconference call with about 10 people. We were finalising the details of a €1.3B deal. There were, amongst others, 2 lawyers and a few bankers on the call. One guy asked if everything was in order so we could proceed. An Italian lawyer said he didn't understand something. The other lawyer tried explaining it, but he still didn't understand. After an hour several had tried explaining, in increasingly patronising tones, and the frigging Italian lawyer still didn't get it. Not only was this Italian lawyer clearly stupid, but he didn't seem to care that everyone now knew he was. At some point, a banker on the call suddenly understood what the Italian was going on about. And guess what? It turned out there was a problem with the structure of the deal, which is why it didn't make sense to him. Lucky he kept asking. I was like wow, what an Italian Stallion. We all have plenty of snippets of information in our little heads, but I assure you very few actually understand what the hell is going on in a fundamental and holistic sense. If you do, and you'll only get there if you're brave enough to ask and challenge, which few do, you'll eventually build an incredible advantage over those around you. ",
            "date": "Answered October 3, 2018",
            "views": "1656",
            "upvotes": " View 13.4K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aditi Gupta",
                    "user_href": "/profile/Aditi-Gupta-102"
                },
                {
                    "user_id": "Dinakar K",
                    "user_href": "/profile/Dinakar-K-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karthik Subramani",
                "href": "/profile/Karthik-Subramani-32"
            },
            "answer_text": "Give this a read: The dog days of summer are a great time to take stock of your career and its trajectory or lack thereof. There are times in the summer where things slow down as teammates and managers are taking their requisite trip to the beach. And as stewards of your own career, you should be consistently managing yourself. Your manager is not responsible for your career, you are. They are responsible for your output. So waiting until annual review time to determine your goals and accomplishments is a bit foolhardy. But here are 10 things you can do today and this year to improve your career. 1. Set small goals regularly When it comes to annual reviews, there is so much focus on goals for the year. A year is a long time; too long in fact to set tangible, achievable goals. Therefore, it is far more wise to set smaller goals throughout the year. Think about your day-to-day work. What could you be doing to elevate that work? Are there skills you could learn to help you advance? Think about this for a bit and then make a list of goals that relate to these items. And then, once you’ve set the goals, give yourself a deadline to have learned these things. When you’ve hit the deadline… give yourself a grade. Seriously. It works. Did you do it? Did you do it well? Then ask someone else how they would score or grade you on these new skills. Then rinse and repeat. 2. Stretch yourself The smartest of us say that success is just outside our comfort zone. So, it goes without saying that you must stretch beyond your area of expertise. Do something that scares you. Don’t like public speaking, start signing up for presentations at work or networking events. Does it terrify you to put your industry thoughts out there? Ask someone for the opportunity to guest post. Whatever gives you the collywobbles; sign up for it, today. 3. Get feedback While self-assessment is important, it is also important to get feedback. And it is important to get feedback all the time. I happen to ask at the end of each and every meeting I lead with the following questions: “What really worked for you?” and “What would make it even better if?” You can learn a lot from these two questions. So much about your work product and performance can be gleaned with these two questions. Give it a try and see what you learn. 4. Curate your work Do you have any idea how many amazing things you’ve done this year? Probably not, because you aren’t curating that great work anywhere to revisit it. There are countless places for you to store this work in a cloud. Check out Dropbox, CredHive, or OneDrive and start curating your work. When you’ve got a great file of work you’ve produced and are proud of, it’s like writing your resume as you go. It is also easy to share with your manager at review time. You’re better prepared to wow them when you’ve got yourself visual proof of your awesome-ness. 5. Be curious about your industry Spend time each and every week as a student of your industry or company. Study your industry and company as if there is a constantly approaching final exam. Ask questions of people in your space. Ask questions to your manager and colleagues. Ask your companies customers how they feel. Develop thoughtful insights about the industry and your company. And don’t be shy about sharing those insights. 6. Read Spend time reading blogs big and small. Spend time reading books about your profession. Read business books that stretches your thinking. But at the end of the day… read. Reading new things can start conversations when you’re networking and can also build your own career with new ways to do things and different work and life hacks to make life flow a little more smoothly. 7. Network brilliantly Never, ever, ever send a standard LinkedIn invite. Ever. Cannot stress this enough. Personalize the message and tell the recipient what you need from them and how you can help them as well. If you do not know someone, ask someone in your network for an introduction. Networking brilliantly is about leaving a positive impression. And it isn’t just LinkedIn. Attend industry events, local events and meet as many people as you can. This will also help in being curious about your industry. 8. Get a mentor Mentors are great resources for all of these elements. Need feedback? Ask your mentor. Need to bounce off industry or company insights? Looking for ways to stretch… Mentor! 9. Get a protégé Conversely, a good protégé can also be a tremendous resource to learn from as well. A protégé can bust some of your paradigms. They can also expose you to new thinking and present you with new ways to solve problems and look at things. 10. ABL (Always be listening) Even if you are really happy in your current role, it never hurts to listen to other opportunities and build relationships with new people in the industry. These relationships may build in the future because you never know how you will cross paths in the future. Always be open to new opportunities and people, plus it feels really good when you get noticed! ",
            "date": "Answered July 19, 2018",
            "views": "471",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Muhammad Irfan Khan",
                    "user_href": "/profile/Muhammad-Irfan-Khan-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "LaRae Quy",
                "href": "/profile/LaRae-Quy"
            },
            "answer_text": "4 Effective Tips On How To Take Your Life To The Next Level  After 20 years of working counterintelligence cases, I was asked to become the spokesperson for the FBI in Northern California. My first reaction was “No”—I was very comfortable in my position as a case agent. By this time, I knew every step in the manual and had my network of informants in place so I could launch an investigation against a foreign intelligence officer with very little effort on my part. I felt the quiet pleasure of smug satisfaction with my existing situation. But in the back of my mind, I knew I wasn’t continuing to hone my skills; I wasn’t striving to do my best. In truth, I had become complacent; I had reached a plateau. When I said “NO,” I was refusing to take my career to the next level. I was successful as a case agent, but my complacency was not nurturing a desire to grow professionally, or personally either. “The tragedy of life is often not in our failure, but rather in our complacency; not in our doing too much, but rather in our doing too little; not in our living above our ability, but rather in our living below our capacities.”—Benjamin E. Mays Stanford researcher Carol Dweck observed, \"There is no relation between students' abilities or intelligence and the development of mastery-oriented qualities. Some of the very brightest students avoid challenges, dislike effort, and wilt in the face of difficulty. And some of the less bright students are real go-getters, thriving on challenge, persisting intensely when things get difficult, and accomplishing more than you expected.” In other words, it’s not always the people who start out the smartest who end up being the smartest. I had always been a go-getter, but somewhere in those 20 years, I had settled into a comfort zone that produced mediocrity. Complacent strength is our greatest weakness—LaRae Quy I eventually did say “Yes” and represented the FBI for 4 years in Northern California. I’m going to share 4 effective ways that I took it to the next level, and so can you: 1. BUST THROUGH A PLATEAU Joshua Foer, author of Moonwalking with Einstein, talks about the “O.K. plateau.” It's when we reach a skill level where we’re able to do the task without having to really think about it. Your performance is automatic. While the OK plateau can what be we need in certain areas of our life, there may be other areas where OK really means that we've hit a wall. We're not unhappy, exactly, but not entirely sure where to pinpoint the growing sense of restlessness. We say, \"We're fine\" rather than \"excited about the next step in life or career.\" There's a niggling feeling that assures us there's more out there for us to conquer in the world. People used to believe that they couldn't bust through plateaus because they represented the limit of our talent or genetic ability. In recent years, Psychologists have discovered that all it takes to bust through a plateau is the right attitude. How To Make It Work For You: Take the long view. When we look at the big picture, it's easier to see plateaus as temporary breaks where we can take the time to strategize about not only our vision for the future but the steps it will take to get there. Take risks. No one likes to move out of their comfort zone but only wimps use them as an excuse to hunker down and stay in a place that looks more like a rut over the years than an exciting life. Often, it's your ego that you want to protect because there’s a chance you might fail if you try something new. The result is that you stay in a safe and boring pattern that involves no risk. In the process, you’ve just become Wikipedia's image of a wimp. Embrace the suck. Unless you want to live on a plateau, going nowhere for the rest of your life, you will need to embrace things that are hard and difficult. Yes, it sucks but once you've gotten in touch with your vision for your life, the sprint will be worth a few knocks to the ground. But here's the thing: unless you learn from the failures that will litter your path along the way, it will all be for nothing. Each failure has the potential to make you smarter than before, but only if you embrace the lesson. 2. FEEL THE BURN IN YOUR BELLY  Self-help books can't offer you guidance on this one. The burn in your belly comes from a deep understanding of what is important to you and why you'll persist even when things look hard. Often, our career or path in life is influenced by a teacher or parent in our youth. We find ourselves stuck on a treadmill to nowhere because our heart isn't in it; the path we took belonged to the parent or teacher, not to us. Complacency is often a pinprick to our heart that we've taken the wrong turn somewhere along the road. You can’t take it to the next level until you take a closer look at why you’re doing what you’re doing. Complacency can be flat terrain that's an opportunity for you to assess the direction your life is going and decide whether this is where you really want to go. The number one reason most people don't take their life to the next level is that they feel they don't have control over their life. It's far easier to take the wimp's way out and blame their situation in life on someone else—the government, the demands of their job, their crappy childhood, their partner...the pathetic list goes on. Wimps see themselves as victims of life, but what really separates wimps from victors are the choices they make. Your choice is 100% within your control. How To Make It Work For You: Stop using loser words like \"I can't\" and \"I shouldn't.\" Turn those thoughts around and claim control of your situation. Your current work environment may not be ideal, but you choose the attitude with which to approach it. Would you rather eat or starve on the street? That question can be a jolt to the way you look at your job. Does it mean you need to stay in a bloodless profession for the rest of your life? No! Give yourself a kick in the butt and get off-center but it does mean you need to take ownership of the way you approach your life. When you stop being a victim and understand that everything really is your choice, you develop the mental toughness to take your life to the next level. Are you mentally tough? Take this FREE assessment. 3. DISTINGUISH BETWEEN A PLATEAU AND BURNOUT You can’t take your life to the next level until you know whether you’re experiencing a plateau or a burnout. In a plateau, you can find ways to become empowered and recharged. Burnout is trying to do the same old things, or do things in the same old ways, without recognizing your need for reassessment. People in high-intensity jobs like first responders and law enforcement are very prone to burnout but they're not the only ones. One of the best ways to detect burnout is to answer this question: \"Do you notice that you're working hard and long hours but accomplishing less than you used to?\" Yep, that's burnout. According to psychologist Ellen Hendriksen, author of How to Be Yourself: Quiet Your Inner Critic and Rise Above Social Anxiety, the signs of burnout are: —Emotional exhaustion: Drained, unmotivated and tired—both physically and psychologically. —Depersonalization: You stop seeing the people you work with as people and instead start to see them as burdens, which builds up a mounting sense of resentment. —Lack of ability to focus: Working hard and long hours but accomplishing less. While it can be hard to distinguish between a plateau and burnout at times, the cures are much different: The cure for a plateau is enthusiasm. Enthusiasm will propel you to learn new skills and acquire more information to keep moving forward.The cure for burnout is excavating the resentment you feel for what you've had to sacrifice in order to get where you are in life.How To Make It Work For You: Take the time to envision what a perfect work environment would look like for you. Take small, realistic steps to bring your reality closer to what you imagine a perfect work environment looks like. Think not only in terms of physical space but of the actual work you'd be involved in as well. 4. RECOGNIZE THE LURE OF MEDIOCRITY  While success is defined differently by all of us, mediocrity is a word we all recognize for what it is: settling for less than we deserve in life. It's a place that's often soft and safe, but at the same time, offers little fulfillment or self-respect. When we slide into mediocrity, we settle for less than we know we can be in life. It's giving up on finding a path that will bring us greater joy and happiness. Mediocrity is a rut that looks a lot like a coffin over time. The reason most people get stuck in mediocrity is that they refuse to fail. The reason people refuse to fail is that they associate failure with defeat. Their fear of defeat paralyzes them to the point that they won’t move forward. People are not finished when they’re defeated; they’re finished when they quit. How To Make It Work For You: Hacks will tell you to start living your dreams. A much more effective approach is to stop living your fears. Fear produces anxiety that paralyzes the way we think, feel, and behave. The only way to move out of mediocrity is to be brave enough to face your fears. Don't face them all at once. Be strategic and pick off the easier ones first because once you slay them, you'll gain the confidence to move on to the bigger bullies that keep you cornered and afraid to move forward. © 2020 LaRae Quy. All rights reserved. https://laraequy.com/blog/2020/03/17/4-effective-tips-on-how-to-take-your-life-to-the-next-level/ ",
            "date": "Updated July 7, 2020",
            "views": "305",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Touhid Kamal",
                    "user_href": "/profile/Touhid-Kamal"
                },
                {
                    "user_id": "Arun Gahlot",
                    "user_href": "/profile/Arun-Gahlot-3"
                },
                {
                    "user_id": "Shubham Singh",
                    "user_href": "/profile/Shubham-Singh-1114"
                },
                {
                    "user_id": "Ah Mad",
                    "user_href": "/profile/Ah-Mad"
                }
            ]
        },
        {
            "author_info": {
                "name": "Expertrons",
                "href": "/profile/Expertrons"
            },
            "answer_text": "Recognition and career progress are on each professional's set of aims. However, what sets the practitioners that are exceptional? The solution is a desire and openness to do. You are able to start scaling ladder As soon as you have got the openness and the ideal mindset. At Expertrons, career upskilling is provided by interacting with experts from more than 100 sectors working in top companies and designation. Here are five career secrets to get ahead in your career. 1. Adaptability/Flexibility This is an idea, and it summarizes the simple fact that to operate in many environments, you have to have the ability also to be open to different methods of thinking, and also to adapt to a situation that is changing. Can you determine or summarize some events or events in, if you think back to your career? If that's the case, adapt to change at work, and you may want to work on the way you respond to. It may be handy to practice a few exercises using this ability. Also, a fantastic way to begin changing is to ensure you take a while before responding to emails, coworkers or issues or challenges at work, and to think about all of the possibilities. This form of thinking up can open your actions. 2. Listening Skills There are few things worse than moving just to discover they've subsequently gone, and speaking at a meeting for one hour continued doing the same thing after your conversation. Being a fantastic listener is more than simply being'engaged' and creating sounds when somebody is speaking to you and nodding personally; it is about engaging with the material of dialogue, and taking in what's being stated. When action is needed, you then take the essential steps, and refer back to this message should you require clarification. Then ask if it'd be fine to list meetings on your phone if you know you are pretty bad at getting information in meetings. You may get your listing of this assembly because this might be a source for the office, typed up. 3. Confidence We do not mean arrogance here. The assurance which you will need to get ahead in your career will revolve around your capacity to have the nous to proceed with a job when you are feeling uncertain to stand up to your thoughts and also to encourage the accomplishments of others. Confidence at work will make sure you can perform the job that's demanded of you. 4. Networking The ability to have the ability to maintain a conversation and at any location is an element of you getting yourself beforehand. After all, you can't know what's going to change as a consequence of dialogue, and you never know who you're likely to fulfil. To striking up a dialogue the advantages are many - if you're equipped with a few business cards if you're a speaker, also which you can head out to pick parties. If you are enthusiastic about exactly what it is that you do, then people will be impressed with your ability to converse what your career is, and are far more inclined to participate in a feeling with you. 5. Innovation It is all very well to take management, and act based upon everything you've been told, and then the ideal thing to do would be to listen. But it is highly robust, and the perfect thing to ask questions, to do and also to attempt to find out a better way of doing something. If you are aware that you are not as successful as you can, or something is in desperate need of a revamp or upgrade, you are likely to be rewarded for the invention and thoughtfulness - provided you approach the ideal people in an ideal way. This signifies is that you have to be respectful of others' power, but also brave enough to challenge something whether it might be achieved in a better way, or if you know that it's not appropriate. ",
            "date": "Answered June 17, 2020",
            "views": "79",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rama Krishnan",
                "href": "/profile/Rama-Krishnan-117"
            },
            "answer_text": "This is a Good question ad I love to answer the same. I am taking the liberty of using some of the sentences & questions I used to ask in the management lecture to my subordinates : ME : What are all the asset classes you have my dear colleagues ? GROUP: Shares, Fixed Deposits, Gold, Cars, Houses etc. ME : OK Fine. From this please tell me What are the assets give you return every year and the value also keeps on increasing ? GROUP: Few assets give returns every month and some do not. Similarly value also increases only for very few assets such as House etc. ME: You have forgot to add one Asset in your list which is your Career. A career gives Monthly returns and the value also keeps on increasing every year. Hence find ways to add value to your career. If you add value then automatically advancement pf career also will happen. Now coming to your question of Advancing Your career. First step is keep on adding or improving your skill set every year.Whatever job you are doing think you own that business and act accordingly. Have an entrepreneurial mindset but within the frame wrk of your organisational policies and guidelines.Keep abreast of what is happening in your field of work outside of your workplace. Watch the technological updates , trends etc.Have such a mindset that One day you are going to declare your Boss surplus. You do not have to be arrogant or anything but you are going to replace him soon.Never discuss about the people and discuss about Ideas.Never think your fellow worker is your competitor.Every year prepare s SWOT analysis on your career and honestly accept the same. Then only you will find ways for improvement.Hope the above helps. Rama Krishnan ",
            "date": "Answered March 13, 2019",
            "views": "633",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harry Smith",
                    "user_href": "/profile/Harry-Smith-598"
                },
                {
                    "user_id": "Ananya",
                    "user_href": "/profile/Ananya-259"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Franklin",
                "href": "/profile/Andrew-Franklin-49"
            },
            "answer_text": "I have clients who came to me because they stuck in their careers. They hadn’t get a promotion for 5+ years. They have been doing the same thing. Their pay is not going up. They’re tired. Here is my advice for getting ahead in a job or career: no matter how frustrated/tired you’re, take care of the work at your desk. Do as good a job as you can. Ask yourself: have I done a job that is as good as anyone else can do? Give your 100% and more.are you genuinely interested in your job? Be honest with yourself. Time is the most precious resource (not money). Don’t waste your life. If you don’t like what you do, do something about it. However, this does NOT mean you should slack off at your current job. You need to maintain the highest level of professionalism, and still do your best. On the side, you need to have a plan.are you just reacting? or you actually have a plan? Most people do NOT have a plan. They wake up, go to work, and then go home. They’re reacting to whatever come up at work. They do what their boss tells them. You need to be different. You need to take charge of your job and your career. Have a plan. Having a plan means 1) you know what you want 2) you have a plan of attack to get what you want 3) you adjust if you’re not getting the result and 4) you measure and track your result to make sure you’re executing.Start with physical changes. If there is one thing you can do, it’ll be starting to exercise 30 minutes first thing in the morning. Do this for 30 day straight. It’ll give you a nice energy boost, improving your mood, and give you confidence. This one small change could have profound impact on the rest of your life and career.Andrew Franklin Author: How to Get a Job at Amazon & How to Get a Job at Google & Smart Move: How to become a Product Manager ",
            "date": "Answered May 19, 2018",
            "views": "317",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Emmanuel Ori",
                    "user_href": "/profile/Emmanuel-Ori"
                },
                {
                    "user_id": "Maithili Murty",
                    "user_href": "/profile/Maithili-Murty"
                },
                {
                    "user_id": "Yash",
                    "user_href": "/profile/Yash-988"
                },
                {
                    "user_id": "Malky McEwan",
                    "user_href": "/profile/Malky-McEwan"
                },
                {
                    "user_id": "Rachel John",
                    "user_href": "/profile/Rachel-John-103"
                },
                {
                    "user_id": "Ammar Kantawala",
                    "user_href": "/profile/Ammar-Kantawala"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brandon Redlinger",
                "href": "/profile/Brandon-Redlinger"
            },
            "answer_text": "Leave your job the moment you stop learning and growing. This means you just be constantly assessing whether you’re learning or not. And you must know what you aim to learn.Become best friends with executive assistants and HR personnel. They have the pulse on the organization. If you want to get the inside scoop, befriend them. I’m not talking about sucking up, because then you’re just a brown noser, and no one likes that. Genuinely be friends with them help them in those jobs and careers. Support the people who are only used to giving support and you’ll soon have an insider look at the organization.Know your value. How much are you worth in today's job market? Does your salary reflect the level of contribution you have been making to your employer? Going on to sites like Comparably, Glassdoor, Monster or just google it.Find a mentor. Mentors can help you in so many ways. They provide information and knowledge. They can see where we need to improve where we often are blind. They stimulate our personal and professional growth. They offer encouragement and help keep us going. They are sounding boards so we can bounce ideas off them for an unfiltered opinion. They have the experiences you can learn from to prevent making the same mistakes beginners make.Be a mentor. If you can’t teach it to someone else, you haven’t learned it well enough. And you should always Give back to the community. Word will get around about your good deeds and it will create new opportunities for you. When you help others get what they want in life, they will help you get what you want in yours.Ask for what you want and be unapologetic about it. If you don’t get what you want in life if you don’t ask for it. And you only have one life, so there’s no pulling punches.Always be looking for our next opportunity. The best time to fill your job opportunity pipeline is before you need it. Even if (especially when) you’re happy at your job. These days, things can turn on a dime and the last thing you want is to be high and dry without a job. I’m not saying you should become a job-hopper, but you should know your options. This also gives you leverage at your current job.Network both inside and outside your company. First, you need allies at work in other departments, especially in management positions. Second, referrals are the best way in to a new job, but I caution people to blatantly ask for an interview or job in a professional setting. Ask them for advice (for example, on your resume) but don’t put them in an awkward position - let them offer it and be the judge if it’s appropriate.Be the first one in the office. Set the tone. Make people chase and aspire to you. Plus, you will get so much done in the 60–90 minutes before everyone else gets in. Starting the day with an advantage everyday multiplies over time.Work with a recruiter. They have access to unlisted jobs, connections with hiring managers, inside information on the job requisition, and an incentive to place you (they get paid by the company, not you). Also, work with multiple recruiters. Get them to compete for your talent.Be picky with your job. Are you optimizing for learning, career trajectory or money? Choose accordingly. Then, only say yes to a job that will get you there AND you will be happy at. If you’re optimizing for learning, don’t let money distract you. The money will come later. You must always be thinking ahead.Bend the rules. I’m not advocating for breaking rules, but you should always be questioning convention. When you find yourself on the side of the majority, it’s time to stop and reflect. Are there better ways to do this? What haven’t you considered? How get I get the outcome that I want? Also, when someone asks you for 10 professional life hacks, give them how many you want to give.Go above and beyond. Do more than what’s expected of you. Going the extra mile will always pay off. You’ll learn more, you’ll gain respect, and you’ll be setting yourself up for the future. When you help others, they will help you. Also, when someone asks you for 10 professional life hacks, give them more. Related: What is a life changing book?  If you like this, check out some of my other Quora answers: What makes a bad boss?What are 20 psychological hacks that you know?When you think of your best boss ever, what makes them stand out?Thanks!  If that was helpful, please follow me on Quora. ",
            "date": "Answered October 31, 2018",
            "views": "43",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Deeksha Sharma",
                    "user_href": "/profile/Deeksha-Sharma-982"
                },
                {
                    "user_id": "Reena Kalra",
                    "user_href": "/profile/Reena-Kalra-1"
                },
                {
                    "user_id": "Vipul Singh Thakur",
                    "user_href": "/profile/Vipul-Singh-Thakur-8"
                },
                {
                    "user_id": "Rohini",
                    "user_href": "/profile/Rohini-222"
                },
                {
                    "user_id": "Grace Medina",
                    "user_href": "/profile/Grace-Medina-26"
                },
                {
                    "user_id": "Candy",
                    "user_href": "/profile/Candy-179"
                },
                {
                    "user_id": "Hashim Ali",
                    "user_href": "/profile/Hashim-Ali-274"
                },
                {
                    "user_id": "She Khar",
                    "user_href": "/profile/She-Khar-4"
                },
                {
                    "user_id": "Srinithya Dheravath",
                    "user_href": "/profile/Srinithya-Dheravath-1"
                },
                {
                    "user_id": "Vamshi",
                    "user_href": "/profile/Vamshi-162"
                },
                {
                    "user_id": "Yugoporo",
                    "user_href": "/profile/Yugoporo"
                },
                {
                    "user_id": "Alina Khan",
                    "user_href": "/profile/Alina-Khan-675"
                },
                {
                    "user_id": "Arun Gahlot",
                    "user_href": "/profile/Arun-Gahlot-3"
                },
                {
                    "user_id": "Thanh Cao",
                    "user_href": "/profile/Thanh-Cao-13"
                },
                {
                    "user_id": "Dr Jai Pal Bisht",
                    "user_href": "/profile/Dr-Jai-Pal-Bisht"
                },
                {
                    "user_id": "Ahsan Habib",
                    "user_href": "/profile/Ahsan-Habib-57"
                },
                {
                    "user_id": "Ambika Sharma",
                    "user_href": "/profile/Ambika-Sharma-320"
                },
                {
                    "user_id": "Pritam Sinha",
                    "user_href": "/profile/Pritam-Sinha-1"
                },
                {
                    "user_id": "Anjana Singh",
                    "user_href": "/profile/अंजना-सिंह-Anjana-Singh"
                },
                {
                    "user_id": "Promit Bachhar",
                    "user_href": "/profile/Promit-Bachhar"
                },
                {
                    "user_id": "Emmanuel Ori",
                    "user_href": "/profile/Emmanuel-Ori"
                },
                {
                    "user_id": "Amir Ali",
                    "user_href": "/profile/Amir-Ali-306"
                },
                {
                    "user_id": "Ramesh Patel",
                    "user_href": "/profile/Ramesh-Patel-955"
                },
                {
                    "user_id": "Krantibodh Mahajan",
                    "user_href": "/profile/क्रान्तिबोध-महाजन-Krantibodh-Mahajan"
                },
                {
                    "user_id": "Sharjeel Azhar",
                    "user_href": "/profile/Sharjeel-Azhar"
                },
                {
                    "user_id": "Swetha",
                    "user_href": "/profile/Swetha-411"
                },
                {
                    "user_id": "Sagar Jha",
                    "user_href": "/profile/Sagar-Jha-25"
                },
                {
                    "user_id": "Piyush Singh Rathore",
                    "user_href": "/profile/Piyush-Singh-Rathore-1"
                },
                {
                    "user_id": "Saba Ali",
                    "user_href": "/profile/Saba-Ali-28"
                },
                {
                    "user_id": "Alexa",
                    "user_href": "/profile/Alexa-688"
                },
                {
                    "user_id": "Sakshi Shrivastava",
                    "user_href": "/profile/Sakshi-Shrivastava-113"
                },
                {
                    "user_id": "Sudeshna Mondal",
                    "user_href": "/profile/Sudeshna-Mondal-5"
                },
                {
                    "user_id": "Anurag Anand",
                    "user_href": "/profile/Anurag-Anand-129"
                },
                {
                    "user_id": "Safa Paloba",
                    "user_href": "/profile/Safa-Paloba"
                },
                {
                    "user_id": "Srinithya Dheravath",
                    "user_href": "/profile/Srinithya-Dheravath"
                },
                {
                    "user_id": "Mazin Faiz",
                    "user_href": "/profile/Mazin-Faiz-1"
                },
                {
                    "user_id": "Tuba Ashraf",
                    "user_href": "/profile/Tuba-Ashraf-9"
                },
                {
                    "user_id": "Neha Sharma",
                    "user_href": "/profile/Neha-Sharma-3501"
                },
                {
                    "user_id": "Kakul Singh",
                    "user_href": "/profile/Kakul-Singh-3"
                },
                {
                    "user_id": "Prerna Gupta",
                    "user_href": "/profile/Prerna-Gupta-300"
                },
                {
                    "user_id": "Duc Vu",
                    "user_href": "/profile/Duc-Vu-39"
                },
                {
                    "user_id": "Yuvaraj",
                    "user_href": "/profile/Yuvaraj-81"
                },
                {
                    "user_id": "Piyush Sapra",
                    "user_href": "/profile/Piyush-Sapra-5"
                },
                {
                    "user_id": "Huma Irfan",
                    "user_href": "/profile/Huma-Irfan-4"
                },
                {
                    "user_id": "Krushna Mohapatra",
                    "user_href": "/profile/Krushna-Mohapatra-13"
                },
                {
                    "user_id": "Samina Fatima",
                    "user_href": "/profile/Samina-Fatima-14"
                },
                {
                    "user_id": "Shafahat Hussain",
                    "user_href": "/profile/Shafahat-Hussain"
                },
                {
                    "user_id": "Nimisha Mendiratta",
                    "user_href": "/profile/Nimisha-Mendiratta-1"
                },
                {
                    "user_id": "Manish Kumar",
                    "user_href": "/profile/Manish-Kumar-7843"
                },
                {
                    "user_id": "Rupali",
                    "user_href": "/profile/Rupali-96"
                },
                {
                    "user_id": "Swapna Reddy",
                    "user_href": "/profile/Swapna-Reddy-97"
                },
                {
                    "user_id": "Vidushi Shukla",
                    "user_href": "/profile/Vidushi-Shukla-7"
                },
                {
                    "user_id": "Suryansh Singh",
                    "user_href": "/profile/Suryansh-Singh-17"
                },
                {
                    "user_id": "Aishwarya Gowda",
                    "user_href": "/profile/Aishwarya-Gowda-54"
                },
                {
                    "user_id": "Aqib Zubair",
                    "user_href": "/profile/Aqib-Zubair-1"
                },
                {
                    "user_id": "Sucheta Mukherjee",
                    "user_href": "/profile/Sucheta-Mukherjee-19"
                },
                {
                    "user_id": "Deekshith Prabhu",
                    "user_href": "/profile/Deekshith-Prabhu"
                },
                {
                    "user_id": "Sahil Anand",
                    "user_href": "/profile/Sahil-Anand-15"
                },
                {
                    "user_id": "Ayon Chowdhury",
                    "user_href": "/profile/Ayon-Chowdhury-10"
                },
                {
                    "user_id": "Shailendrakumar Singh",
                    "user_href": "/profile/Shailendrakumar-Singh-1"
                },
                {
                    "user_id": "Chitra Jegadeeswari",
                    "user_href": "/profile/Chitra-Jegadeeswari"
                },
                {
                    "user_id": "Karthika Nambiar",
                    "user_href": "/profile/Karthika-Nambiar-6"
                },
                {
                    "user_id": "Zainab samreen.",
                    "user_href": "/profile/Zainab-samreen-5"
                },
                {
                    "user_id": "Tanisha Gupta",
                    "user_href": "/profile/Tanisha-Gupta-8"
                },
                {
                    "user_id": "Yashi",
                    "user_href": "/profile/Yashi-32"
                },
                {
                    "user_id": "Gunjan Verma",
                    "user_href": "/profile/Gunjan-Verma-64"
                },
                {
                    "user_id": "Irshad Khan",
                    "user_href": "/profile/Irshad-Khan-737"
                },
                {
                    "user_id": "Aparna Purohit",
                    "user_href": "/profile/Aparna-Purohit-2"
                },
                {
                    "user_id": "Apoorva Tiwari",
                    "user_href": "/profile/Apoorva-Tiwari-26"
                },
                {
                    "user_id": "Sakshi",
                    "user_href": "/profile/Sakshi-149"
                },
                {
                    "user_id": "Shubham Tripathi",
                    "user_href": "/profile/Shubham-Tripathi-488"
                },
                {
                    "user_id": "Arpitha P Nair",
                    "user_href": "/profile/Arpitha-P-Nair"
                },
                {
                    "user_id": "Suprabha Senapati",
                    "user_href": "/profile/Suprabha-Senapati"
                },
                {
                    "user_id": "Saurya Yadav",
                    "user_href": "/profile/Saurya-Yadav"
                },
                {
                    "user_id": "Akshar",
                    "user_href": "/profile/Akshar-34"
                },
                {
                    "user_id": "Om",
                    "user_href": "/profile/Om-217"
                },
                {
                    "user_id": "Debashish Barik",
                    "user_href": "/profile/Debashish-Barik-1"
                },
                {
                    "user_id": "Velu Dhananjayan",
                    "user_href": "/profile/Velu-Dhananjayan"
                },
                {
                    "user_id": "Myself",
                    "user_href": "/profile/Myself-87"
                },
                {
                    "user_id": "Rakesh RS",
                    "user_href": "/profile/Rakesh-RS-15"
                },
                {
                    "user_id": "Jeevan Mali",
                    "user_href": "/profile/Jeevan-Mali"
                },
                {
                    "user_id": "Deepa I",
                    "user_href": "/profile/Deepa-I"
                },
                {
                    "user_id": "Mritunjoy Sen",
                    "user_href": "/profile/Mritunjoy-Sen"
                },
                {
                    "user_id": "Jamila Mae",
                    "user_href": "/profile/Jamila-Mae"
                },
                {
                    "user_id": "Sakshi",
                    "user_href": "/profile/Sakshi-562"
                },
                {
                    "user_id": "Sagar Arekar",
                    "user_href": "/profile/Sagar-Arekar-1"
                },
                {
                    "user_id": "Sachi Mishra",
                    "user_href": "/profile/Sachi-Mishra-4"
                },
                {
                    "user_id": "Mansi Thapa",
                    "user_href": "/profile/Mansi-Thapa-5"
                },
                {
                    "user_id": "Jashanjot Kaur",
                    "user_href": "/profile/Jashanjot-Kaur-9"
                },
                {
                    "user_id": "Saro S",
                    "user_href": "/profile/Saro-S-2"
                },
                {
                    "user_id": "Vibhanshu Singh",
                    "user_href": "/profile/Vibhanshu-Singh-7"
                },
                {
                    "user_id": "Sky Barahalikar",
                    "user_href": "/profile/Sky-Barahalikar"
                },
                {
                    "user_id": "Pathik Reshamwala",
                    "user_href": "/profile/Pathik-Reshamwala"
                },
                {
                    "user_id": "Jaspreet Singh",
                    "user_href": "/profile/Jaspreet-Singh-927"
                },
                {
                    "user_id": "Satyam Sharma",
                    "user_href": "/profile/Satyam-Sharma-28"
                },
                {
                    "user_id": "Digvijay Srivastav",
                    "user_href": "/profile/Digvijay-Srivastav"
                },
                {
                    "user_id": "Asfiya Tabassum",
                    "user_href": "/profile/Asfiya-Tabassum-6"
                },
                {
                    "user_id": "Mahtab Alam",
                    "user_href": "/profile/Mahtab-Alam-78"
                },
                {
                    "user_id": "Ami",
                    "user_href": "/profile/Ami-436"
                },
                {
                    "user_id": "Asad Ali",
                    "user_href": "/profile/Asad-Ali-85"
                },
                {
                    "user_id": "Meghana Rajesh",
                    "user_href": "/profile/Meghana-Rajesh"
                },
                {
                    "user_id": "Jiarul Hoque",
                    "user_href": "/profile/Jiarul-Hoque-5"
                },
                {
                    "user_id": "Akshita",
                    "user_href": "/profile/Akshita-121"
                },
                {
                    "user_id": "Navish Ahmad",
                    "user_href": "/profile/Navish-Ahmad"
                },
                {
                    "user_id": "Arshida Husain",
                    "user_href": "/profile/Arshida-Husain"
                },
                {
                    "user_id": "Smriti Priyadarshini",
                    "user_href": "/profile/Smriti-Priyadarshini"
                },
                {
                    "user_id": "Zaid Hussain Siddiqui",
                    "user_href": "/profile/Zaid-Hussain-Siddiqui"
                },
                {
                    "user_id": "Shashwat Pandey",
                    "user_href": "/profile/Shashwat-Pandey-49"
                },
                {
                    "user_id": "Shruti Chahar",
                    "user_href": "/profile/Shruti-Chahar-1"
                },
                {
                    "user_id": "Rashika Sharma",
                    "user_href": "/profile/Rashika-Sharma-50"
                },
                {
                    "user_id": "Krithika Iyer",
                    "user_href": "/profile/Krithika-Iyer-22"
                },
                {
                    "user_id": "Atashi Chadha",
                    "user_href": "/profile/Atashi-Chadha"
                },
                {
                    "user_id": "Arfin",
                    "user_href": "/profile/Arfin-2"
                },
                {
                    "user_id": "Sonal Tiwari",
                    "user_href": "/profile/Sonal-Tiwari-28"
                },
                {
                    "user_id": "Sameer Khan",
                    "user_href": "/profile/Sameer-Khan-2181"
                },
                {
                    "user_id": "Harsh Rawlani",
                    "user_href": "/profile/Harsh-Rawlani"
                },
                {
                    "user_id": "Nishat Naaz",
                    "user_href": "/profile/Nishat-Naaz-1"
                },
                {
                    "user_id": "Indrani Adhikari",
                    "user_href": "/profile/Indrani-Adhikari-5"
                },
                {
                    "user_id": "Chinmay Tandon",
                    "user_href": "/profile/Chinmay-Tandon"
                },
                {
                    "user_id": "Laraib Fatima",
                    "user_href": "/profile/Laraib-Fatima-16"
                },
                {
                    "user_id": "Anshu Mesh",
                    "user_href": "/profile/Anshu-Mesh"
                },
                {
                    "user_id": "Shashank Mallipeddi (శశాంక్ మల్లిపెడి)",
                    "user_href": "/profile/Shashank-Mallipeddi-శశాంక్-మల్లిపెడి"
                },
                {
                    "user_id": "Lokesh Kadam",
                    "user_href": "/profile/Lokesh-Kadam-12"
                },
                {
                    "user_id": "Aishika Midder",
                    "user_href": "/profile/Aishika-Midder"
                },
                {
                    "user_id": "Diksha Sharma",
                    "user_href": "/profile/Diksha-Sharma-675"
                },
                {
                    "user_id": "Pooja Priya",
                    "user_href": "/profile/Pooja-Priya-33"
                },
                {
                    "user_id": "Tamanna Maan",
                    "user_href": "/profile/Tamanna-Maan"
                },
                {
                    "user_id": "Manmeet Kaur",
                    "user_href": "/profile/Manmeet-Kaur-193"
                },
                {
                    "user_id": "Saba Khatoon",
                    "user_href": "/profile/Saba-Khatoon"
                },
                {
                    "user_id": "Sushil Verma",
                    "user_href": "/profile/Sushil-Verma-98"
                },
                {
                    "user_id": "Vaishnavi Patil",
                    "user_href": "/profile/Vaishnavi-Patil-47"
                },
                {
                    "user_id": "Adarsh Rathore",
                    "user_href": "/profile/Adarsh-Rathore-26"
                },
                {
                    "user_id": "Aditi Ahuja",
                    "user_href": "/profile/Aditi-Ahuja-9"
                },
                {
                    "user_id": "Harsh Sharma",
                    "user_href": "/profile/Harsh-Sharma-385"
                },
                {
                    "user_id": "Prabhu Ethiraj",
                    "user_href": "/profile/Prabhu-Ethiraj"
                },
                {
                    "user_id": "Sai Soundarya",
                    "user_href": "/profile/Sai-Soundarya-4"
                },
                {
                    "user_id": "Tahera Mahvash",
                    "user_href": "/profile/Tahera-Mahvash-1"
                },
                {
                    "user_id": "Alisha Khan",
                    "user_href": "/profile/Alisha-Khan-101"
                },
                {
                    "user_id": "Swapnil Kushwaha",
                    "user_href": "/profile/Swapnil-Kushwaha-10"
                },
                {
                    "user_id": "Nikhil Anand",
                    "user_href": "/profile/Nikhil-Anand-149"
                },
                {
                    "user_id": "Avishek Jaiswal",
                    "user_href": "/profile/Avishek-Jaiswal-22"
                },
                {
                    "user_id": "Debashis Hira",
                    "user_href": "/profile/Debashis-Hira"
                },
                {
                    "user_id": "Sam Taylor",
                    "user_href": "/profile/Sam-Taylor-176"
                },
                {
                    "user_id": "Shivam Khurana",
                    "user_href": "/profile/Shivam-Khurana-3"
                },
                {
                    "user_id": "Nuha Khan",
                    "user_href": "/profile/Nuha-Khan-15"
                },
                {
                    "user_id": "Aleeza Maryam",
                    "user_href": "/profile/Aleeza-Maryam-1"
                },
                {
                    "user_id": "Nidhi Sharma",
                    "user_href": "/profile/Nidhi-Sharma-1217"
                },
                {
                    "user_id": "S Mohanty",
                    "user_href": "/profile/S-Mohanty-19"
                },
                {
                    "user_id": "Vani Verma",
                    "user_href": "/profile/Vani-Verma-9"
                },
                {
                    "user_id": "Shaikh Sundus",
                    "user_href": "/profile/Shaikh-Sundus"
                },
                {
                    "user_id": "Anisha Singhania",
                    "user_href": "/profile/अनिशा-सिंहानिया-Anisha-Singhania"
                },
                {
                    "user_id": "Abdul Rahique",
                    "user_href": "/profile/Abdul-Rahique"
                },
                {
                    "user_id": "Kumkum Prajapati",
                    "user_href": "/profile/Kumkum-Prajapati-1"
                },
                {
                    "user_id": "Vidushi Tandon",
                    "user_href": "/profile/Vidushi-Tandon-11"
                },
                {
                    "user_id": "Shaurya S",
                    "user_href": "/profile/Shaurya-S-1"
                },
                {
                    "user_id": "Lavanya Shankar",
                    "user_href": "/profile/Lavanya-Shankar-23"
                },
                {
                    "user_id": "Arindam Bhadra",
                    "user_href": "/profile/Arindam-Bhadra-4"
                },
                {
                    "user_id": "Manisha",
                    "user_href": "/profile/Manisha-771"
                },
                {
                    "user_id": "S M Santosh",
                    "user_href": "/profile/S-M-Santosh"
                },
                {
                    "user_id": "Addison Payne",
                    "user_href": "/profile/Addison-Payne-6"
                },
                {
                    "user_id": "Shabana Sheikh",
                    "user_href": "/profile/Shabana-Sheikh-25"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Nandini-singla-14"
                },
                {
                    "user_id": "Swenya Soares",
                    "user_href": "/profile/Swenya-Soares"
                },
                {
                    "user_id": "Shreya Chivilkar",
                    "user_href": "/profile/Shreya-Chivilkar"
                },
                {
                    "user_id": "MKM Kaur",
                    "user_href": "/profile/MKM-Kaur"
                },
                {
                    "user_id": "Pooja Jais",
                    "user_href": "/profile/Pooja-Jais-6"
                },
                {
                    "user_id": "Tahrim Nisar (তহরীম ণিসার)",
                    "user_href": "/profile/Tahrim-Nisar-তহরীম-ণিসার"
                },
                {
                    "user_id": "Arka Bhattacharjee",
                    "user_href": "/profile/Arka-Bhattacharjee-18"
                },
                {
                    "user_id": "Nandan Nishad",
                    "user_href": "/profile/Nandan-Nishad"
                },
                {
                    "user_id": "Payal Bhatia",
                    "user_href": "/profile/Payal-Bhatia-2"
                },
                {
                    "user_id": "Devansh",
                    "user_href": "/profile/Devansh-26"
                },
                {
                    "user_id": "Anurag Anant",
                    "user_href": "/profile/Anurag-Anant-3"
                },
                {
                    "user_id": "Safiya Sitwat",
                    "user_href": "/profile/Safiya-Sitwat"
                },
                {
                    "user_id": "Frances Alyssa Briñas",
                    "user_href": "/profile/Frances-Alyssa-Briñas"
                },
                {
                    "user_id": "Rittul Arya",
                    "user_href": "/profile/Rittul-Arya"
                },
                {
                    "user_id": "Even Sinclair",
                    "user_href": "/profile/Even-Sinclair"
                },
                {
                    "user_id": "Pankaj Kumar",
                    "user_href": "/profile/Pankaj-Kumar-3022"
                },
                {
                    "user_id": "Pallavi Roy",
                    "user_href": "/profile/Pallavi-Roy-57"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Unknown-2979"
                },
                {
                    "user_id": "Avni Sally",
                    "user_href": "/profile/Avni-Sally"
                },
                {
                    "user_id": "Hansika Singh",
                    "user_href": "/profile/Hansika-Singh-13"
                },
                {
                    "user_id": "Manvi Sharma",
                    "user_href": "/profile/Manvi-Sharma-138"
                },
                {
                    "user_id": "Akanksha Mishra",
                    "user_href": "/profile/Akanksha-Mishra-229"
                },
                {
                    "user_id": "Jawad Ameen",
                    "user_href": "/profile/Jawad-Ameen"
                },
                {
                    "user_id": "Anjali Sharma",
                    "user_href": "/profile/Anjali-Sharma-761"
                },
                {
                    "user_id": "Sree Subhiksha",
                    "user_href": "/profile/Sree-Subhiksha"
                },
                {
                    "user_id": "Sankalp Chauhan (संकल्प चौहान)",
                    "user_href": "/profile/Sankalp-Chauhan-संकल्प-चौहान"
                },
                {
                    "user_id": "Riya Verma",
                    "user_href": "/profile/Riya-Verma-273"
                },
                {
                    "user_id": "Sanskruti Singh Jadon",
                    "user_href": "/profile/Sanskruti-Singh-Jadon"
                },
                {
                    "user_id": "Manik Saluja",
                    "user_href": "/profile/Manik-Saluja"
                },
                {
                    "user_id": "Umang Baranwal",
                    "user_href": "/profile/Umang-Baranwal-1"
                },
                {
                    "user_id": "Nisha Qureshi",
                    "user_href": "/profile/Nisha-Qureshi-2"
                },
                {
                    "user_id": "Ross Akram",
                    "user_href": "/profile/Ross-Akram"
                },
                {
                    "user_id": "Satyam Vikramaditya Shubham",
                    "user_href": "/profile/Satyam-Vikramaditya-Shubham"
                },
                {
                    "user_id": "Pratiksha",
                    "user_href": "/profile/Pratiksha-96"
                },
                {
                    "user_id": "Pramila",
                    "user_href": "/profile/Pramila-26"
                },
                {
                    "user_id": "Sonal Parmar",
                    "user_href": "/profile/Sonal-Parmar-13"
                },
                {
                    "user_id": "Pranshu Mishra",
                    "user_href": "/profile/Pranshu-Mishra-11"
                },
                {
                    "user_id": "Sh",
                    "user_href": "/profile/Sh-565"
                },
                {
                    "user_id": "Neha Bhardwaj",
                    "user_href": "/profile/Neha-Bhardwaj-238"
                },
                {
                    "user_id": "Sukriti Shah",
                    "user_href": "/profile/Sukriti-Shah"
                },
                {
                    "user_id": "Nikita Dubey",
                    "user_href": "/profile/Nikita-Dubey-32"
                },
                {
                    "user_id": "Ziya",
                    "user_href": "/profile/Ziya-72"
                },
                {
                    "user_id": "Sweta",
                    "user_href": "/profile/Sweta-182"
                },
                {
                    "user_id": "Sanskriti Gupta",
                    "user_href": "/profile/Sanskriti-Gupta-44"
                },
                {
                    "user_id": "Kavya Sree",
                    "user_href": "/profile/Kavya-Sree-167"
                },
                {
                    "user_id": "Aayushi Bhatnagar",
                    "user_href": "/profile/Aayushi-Bhatnagar-3"
                },
                {
                    "user_id": "Georgia",
                    "user_href": "/profile/Georgia-515"
                },
                {
                    "user_id": "Meenakshi Bhatt",
                    "user_href": "/profile/Meenakshi-Bhatt-11"
                },
                {
                    "user_id": "Shubham Sharma",
                    "user_href": "/profile/Shubham-Sharma-4431"
                },
                {
                    "user_id": "Nidhi Narvekar",
                    "user_href": "/profile/Nidhi-Narvekar-3"
                },
                {
                    "user_id": "Aastha Khandelwal",
                    "user_href": "/profile/Aastha-Khandelwal-9"
                },
                {
                    "user_id": "Mohammad Aaquib",
                    "user_href": "/profile/Mohammad-Aaquib-13"
                },
                {
                    "user_id": "Krishnaditya Biswas",
                    "user_href": "/profile/Krishnaditya-Biswas"
                },
                {
                    "user_id": "Smriti Sharma",
                    "user_href": "/profile/Smriti-Sharma-177"
                },
                {
                    "user_id": "Astha Dwivedi",
                    "user_href": "/profile/Astha-Dwivedi-14"
                },
                {
                    "user_id": "Deepsikha Chatterjee",
                    "user_href": "/profile/Deepsikha-Chatterjee-3"
                },
                {
                    "user_id": "Aryan Khandal",
                    "user_href": "/profile/Aryan-Khandal-1"
                },
                {
                    "user_id": "Parul Katiyar",
                    "user_href": "/profile/Parul-Katiyar-10"
                },
                {
                    "user_id": "Sangee Svms",
                    "user_href": "/profile/Sangee-Svms"
                },
                {
                    "user_id": "Ibrahim Shaikh",
                    "user_href": "/profile/Ibrahim-Shaikh-48"
                },
                {
                    "user_id": "R K Priyadarshini",
                    "user_href": "/profile/R-K-Priyadarshini"
                },
                {
                    "user_id": "Khushboo Chaturvedi",
                    "user_href": "/profile/Khushboo-Chaturvedi-5"
                },
                {
                    "user_id": "Shubham",
                    "user_href": "/profile/Shubham-1412"
                },
                {
                    "user_id": "Kafeel Hasan",
                    "user_href": "/profile/Kafeel-Hasan"
                },
                {
                    "user_id": "Supriya",
                    "user_href": "/profile/Supriya-257"
                },
                {
                    "user_id": "Prateek Kumar",
                    "user_href": "/profile/Prateek-Kumar-160"
                },
                {
                    "user_id": "Swati Murmu",
                    "user_href": "/profile/Swati-Murmu-9"
                },
                {
                    "user_id": "Titir Chakravorti",
                    "user_href": "/profile/Titir-Chakravorti-2"
                },
                {
                    "user_id": "Prisa Routray",
                    "user_href": "/profile/Prisa-Routray"
                },
                {
                    "user_id": "Divya Pathak",
                    "user_href": "/profile/Divya-Pathak-63"
                },
                {
                    "user_id": "Pavan S",
                    "user_href": "/profile/Pavan-S-62"
                },
                {
                    "user_id": "Nazia Naseem",
                    "user_href": "/profile/Nazia-Naseem-2"
                },
                {
                    "user_id": "Prakrati",
                    "user_href": "/profile/Prakrati"
                },
                {
                    "user_id": "Prajjwal Sinha",
                    "user_href": "/profile/Prajjwal-Sinha"
                },
                {
                    "user_id": "Tejal Singh",
                    "user_href": "/profile/Tejal-Singh-12"
                },
                {
                    "user_id": "Anusha Singh",
                    "user_href": "/profile/Anusha-Singh-73"
                },
                {
                    "user_id": "Harsh Ghawari",
                    "user_href": "/profile/Harsh-Ghawari-1"
                },
                {
                    "user_id": "Dimpi Mili",
                    "user_href": "/profile/Dimpi-Mili"
                },
                {
                    "user_id": "Soumya Subha Behera",
                    "user_href": "/profile/Soumya-Subha-Behera"
                },
                {
                    "user_id": "Pooja H R",
                    "user_href": "/profile/Pooja-H-R"
                },
                {
                    "user_id": "Allan Logun",
                    "user_href": "/profile/Allan-Logun-2"
                },
                {
                    "user_id": "Pooja Surendra",
                    "user_href": "/profile/Pooja-Surendra"
                },
                {
                    "user_id": "Bhumika Vijay",
                    "user_href": "/profile/Bhumika-Vijay-1"
                },
                {
                    "user_id": "Dharma Sushanth Reddy",
                    "user_href": "/profile/Dharma-Sushanth-Reddy"
                },
                {
                    "user_id": "Megha Patel",
                    "user_href": "/profile/Megha-Patel-162"
                },
                {
                    "user_id": "Akanksha Jha",
                    "user_href": "/profile/Akanksha-Jha-13"
                },
                {
                    "user_id": "Apurva",
                    "user_href": "/profile/Apurva-127"
                },
                {
                    "user_id": "Uzma Khan",
                    "user_href": "/profile/Uzma-Khan-81"
                },
                {
                    "user_id": "Shefali Jain",
                    "user_href": "/profile/Shefali-Jain-134"
                },
                {
                    "user_id": "Anshika gupta",
                    "user_href": "/profile/Anshika-gupta-502"
                },
                {
                    "user_id": "Arisha Arif Beg",
                    "user_href": "/profile/Arisha-Arif-Beg"
                },
                {
                    "user_id": "Ananya Singh",
                    "user_href": "/profile/Ananya-Singh-363"
                },
                {
                    "user_id": "Nikhil",
                    "user_href": "/profile/Nikhil-1056"
                },
                {
                    "user_id": "Prudhviraj M",
                    "user_href": "/profile/Prudhviraj-M"
                },
                {
                    "user_id": "Anjuri Shandilya",
                    "user_href": "/profile/Anjuri-Shandilya"
                },
                {
                    "user_id": "Rishi",
                    "user_href": "/profile/Rishi-308"
                },
                {
                    "user_id": "Nikhat Yk",
                    "user_href": "/profile/Nikhat-Yk"
                },
                {
                    "user_id": "Kavitha",
                    "user_href": "/profile/Kavitha-263"
                },
                {
                    "user_id": "Shakti Kumar",
                    "user_href": "/profile/Shakti-Kumar-505"
                },
                {
                    "user_id": "Saifi Rafiq",
                    "user_href": "/profile/Saifi-Rafiq-1"
                },
                {
                    "user_id": "Abhishek Sonarkar",
                    "user_href": "/profile/Abhishek-Sonarkar"
                },
                {
                    "user_id": "Shiveha Verma",
                    "user_href": "/profile/Shiveha-Verma-2"
                },
                {
                    "user_id": "Archana S",
                    "user_href": "/profile/Archana-S-385"
                },
                {
                    "user_id": "Namrata Singh",
                    "user_href": "/profile/Namrata-Singh-311"
                },
                {
                    "user_id": "Ansari",
                    "user_href": "/profile/Ansari-40"
                },
                {
                    "user_id": "Amiteshwar Singh",
                    "user_href": "/profile/Amiteshwar-Singh-14"
                },
                {
                    "user_id": "Satyam Dharia",
                    "user_href": "/profile/Satyam-Dharia-1"
                },
                {
                    "user_id": "Azam Baseer",
                    "user_href": "/profile/Azam-Baseer"
                },
                {
                    "user_id": "Prem Prakash Pandey",
                    "user_href": "/profile/Prem-Prakash-Pandey-7"
                },
                {
                    "user_id": "Rohit P",
                    "user_href": "/profile/Rohit-P-70"
                },
                {
                    "user_id": "Vikas Rai",
                    "user_href": "/profile/Vikas-Rai-217"
                },
                {
                    "user_id": "Sadique Khan",
                    "user_href": "/profile/Sadique-Khan-1"
                },
                {
                    "user_id": "Pragati Khemani",
                    "user_href": "/profile/Pragati-Khemani-1"
                },
                {
                    "user_id": "Heena Advani",
                    "user_href": "/profile/Heena-Advani-4"
                },
                {
                    "user_id": "Sajida Shaik",
                    "user_href": "/profile/Sajida-Shaik-6"
                },
                {
                    "user_id": "Khazi Owais",
                    "user_href": "/profile/Khazi-Owais"
                },
                {
                    "user_id": "Adnan Abdullah",
                    "user_href": "/profile/Adnan-Abdullah-3"
                },
                {
                    "user_id": "Ishita Khurana",
                    "user_href": "/profile/Ishita-Khurana-12"
                },
                {
                    "user_id": "Janvi Sadhwani",
                    "user_href": "/profile/Janvi-Sadhwani-1"
                },
                {
                    "user_id": "Sazia Shaukat",
                    "user_href": "/profile/Sazia-Shaukat"
                },
                {
                    "user_id": "Kumar Siddhant",
                    "user_href": "/profile/Kumar-Siddhant"
                },
                {
                    "user_id": "Khushboo Kumari",
                    "user_href": "/profile/Khushboo-Kumari-87"
                },
                {
                    "user_id": "Praveena Gaddam",
                    "user_href": "/profile/Praveena-Gaddam-3"
                },
                {
                    "user_id": "Susmita Roy",
                    "user_href": "/profile/Susmita-Roy-88"
                },
                {
                    "user_id": "Kumar Abhishek",
                    "user_href": "/profile/Kumar-Abhishek-530"
                },
                {
                    "user_id": "Abhishek Tanwar",
                    "user_href": "/profile/Abhishek-Tanwar-37"
                },
                {
                    "user_id": "Sudeshna Roy",
                    "user_href": "/profile/Sudeshna-Roy-21"
                },
                {
                    "user_id": "Hamza",
                    "user_href": "/profile/Hamza-620"
                },
                {
                    "user_id": "Kaifi Khan",
                    "user_href": "/profile/Kaifi-Khan-11"
                },
                {
                    "user_id": "Shruti",
                    "user_href": "/profile/Shruti-317"
                },
                {
                    "user_id": "Shivangi Sahai",
                    "user_href": "/profile/शिवांगी-सहाय-Shivangi-Sahai"
                },
                {
                    "user_id": "Mayank",
                    "user_href": "/profile/Mayank-666"
                },
                {
                    "user_id": "Niharika",
                    "user_href": "/profile/Niharika-159"
                },
                {
                    "user_id": "Danish Wadood Khan Alig (RAAS)",
                    "user_href": "/profile/Danish-Wadood-Khan-Alig-RAAS"
                },
                {
                    "user_id": "Amir Javed",
                    "user_href": "/profile/Amir-Javed-21"
                },
                {
                    "user_id": "Vaishnavi Agarwal",
                    "user_href": "/profile/Vaishnavi-Agarwal-31"
                },
                {
                    "user_id": "Vishal Gaware",
                    "user_href": "/profile/Vishal-Gaware-3"
                },
                {
                    "user_id": "Asfia Khan",
                    "user_href": "/profile/Asfia-Khan-16"
                },
                {
                    "user_id": "Sarvam Bansal",
                    "user_href": "/profile/Sarvam-Bansal-1"
                },
                {
                    "user_id": "Sneha",
                    "user_href": "/profile/Sneha-568"
                },
                {
                    "user_id": "Anish Jamwal",
                    "user_href": "/profile/Anish-Jamwal-1"
                },
                {
                    "user_id": "Sumbul Ansari",
                    "user_href": "/profile/Sumbul-Ansari-2"
                },
                {
                    "user_id": "Anish Cherian",
                    "user_href": "/profile/Anish-Cherian-7"
                },
                {
                    "user_id": "Sushil Karad",
                    "user_href": "/profile/Sushil-Karad"
                },
                {
                    "user_id": "Sameera K",
                    "user_href": "/profile/Sameera-K-20"
                },
                {
                    "user_id": "Taha Amreen",
                    "user_href": "/profile/Taha-Amreen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sarah Wahid Khan",
                "href": "/profile/Sarah-Wahid-Khan"
            },
            "answer_text": "We both took drop for the preparation of NEET in the same year. She is my friend and is really a good student. We used to study together but in our NEET exam she couldn’t manage to score well instead I scored enough to get a seat in KGMU. She was broken and depressed, and in spite of my success I couldn’t celebrate it. I consoled her and somehow convinced her to drop again. She dropped again but she failed again. She broke contact with everyone including me. I tried hard to contact her but she didn’t want to talk to me. After one year one day she called me. She told nothing for few minutes except for crying and crying. “I failed again Sarah. I tried but I couldn’t do it. Medical is not for me. Even my parents are not with me now. They have lost their hope in me and me too. My life is worthless. I don’t want to live anymore” she was baffling and burst into tears again. She told me that she took admission in BSc because of her parents but continued her preparation side by side. And after one more failure her parents asked her to leave the hope for medicine. I talked her for one hour and consoled her. I talked to her parents and convinced them to give her one more chance. And they agreed (May be I was influencial to them because of my credential) “Listen, don’t have an alternative for medicine in your mind. Set a single goal and focus on that. Just keep it in your mind that this is the thing which you can’t live without. Stop crying and wasting your time in regret at the moments when you failed instead move ahead with a new hope. And please never lose your faith in yourself” I told her when she told me that she is going to drop again. She gave NEET once again this year and now, she is having fun in GSVM Kanpur. She confessed that the biggest mistake which she did in those years was to take admission in BSc which give her an alternative for medicine. Subconsciously, but she gave her time thinking about things other than medicine.  Embrace your failure (I know it sounds philosophical but it actually works). Mistakes and hurdles are inevitable while walking on the road of self mastery and success but ultimately it will give you opportunity to learn, Pivot and go after your goals with new perspective. Don’t cry and regret at your past. It has already shaped you in good or bad. You can’t afford wasting your time and efforts in correcting something which is irreversible. Take a deep breath and focus on the current running seconds which you have to make productive. Don’t let others decide what is better for you. No one can know about your longing and decide what your heart craves for. Just think that this is all you want and you can’t live without this. Set a single goal. Have a clear priority for each single day which starts before you sit down at your desk to work. Climbing a mountain often gets easier once you have picked the Mountain you have to climb. So, Just pick your mountain right now! Thank you for A2A ",
            "date": "Answered October 5, 2018",
            "views": "126",
            "upvotes": " View 307 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alexander Ganchuk",
                    "user_href": "/profile/Alexander-Ganchuk"
                },
                {
                    "user_id": "Leonardo Eletto",
                    "user_href": "/profile/Leonardo-Eletto"
                },
                {
                    "user_id": "Emmanuel Ori",
                    "user_href": "/profile/Emmanuel-Ori"
                },
                {
                    "user_id": "Suzanne Shimanuki",
                    "user_href": "/profile/Suzanne-Shimanuki"
                },
                {
                    "user_id": "Islam Benfifi",
                    "user_href": "/profile/Islam-Benfifi"
                },
                {
                    "user_id": "Shahzad Khan",
                    "user_href": "/profile/Shahzad-Khan-2"
                },
                {
                    "user_id": "Sachin Kumar Sahu",
                    "user_href": "/profile/Sachin-Kumar-Sahu-2"
                },
                {
                    "user_id": "Hari K Prasad",
                    "user_href": "/profile/Hari-K-Prasad-1"
                },
                {
                    "user_id": "Bryce Goade",
                    "user_href": "/profile/Bryce-Goade-1"
                },
                {
                    "user_id": "Raja Yasmin Baizura Raja Ahmad",
                    "user_href": "/profile/Raja-Yasmin-Baizura-Raja-Ahmad"
                },
                {
                    "user_id": "Jason Ma",
                    "user_href": "/profile/Jason-Ma-117"
                },
                {
                    "user_id": "Chau Nguyen",
                    "user_href": "/profile/Chau-Nguyen-245"
                },
                {
                    "user_id": "Asif Bhatti",
                    "user_href": "/profile/Asif-Bhatti-33"
                },
                {
                    "user_id": "Vikas Kumar Singh",
                    "user_href": "/profile/Vikas-Kumar-Singh-31"
                },
                {
                    "user_id": "Jeswanth Pendyala",
                    "user_href": "/profile/Jeswanth-Pendyala"
                },
                {
                    "user_id": "Sathish Raghuraman",
                    "user_href": "/profile/Sathish-Raghuraman"
                },
                {
                    "user_id": "Mohamed Ramadane",
                    "user_href": "/profile/Mohamed-Ramadane"
                },
                {
                    "user_id": "Sanmit Mallapur",
                    "user_href": "/profile/Sanmit-Mallapur"
                },
                {
                    "user_id": "Deva Phanindra Kumar",
                    "user_href": "/profile/Deva-Phanindra-Kumar"
                },
                {
                    "user_id": "Mohammed Salauddin",
                    "user_href": "/profile/Mohammed-Salauddin-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Poola Bala",
                "href": "/profile/Poola-Bala"
            },
            "answer_text": "Prove yourself different and secure a good career. Whatever the job you have chosen you have to make a difference. When the competition gets, tough with hundreds of job applicants with similar qualification and experience for a few vacancies, the need to distinguish yourself increases. Once upon English used to fulfill this need. English was considered essential for getting any decent job In India. Now-a-days English can help no more to distinguish yourself from others as the candidates speaking English are very common. Imagine a situation, where among thousands of job applicants to an MNC, you get selected, because your CV underscores your French or German. Now in a more globalized scenario, a foreign language has become more important than English. It is true. There is a growing demand for candidates with foreign language in multinational companies. Proficiency in a foreign language seems to have become a norm now, as it guarantees a high paid job with quite a number of perks and foreign trips. Of course the number of Students learning Foreign languages has increased. But this is not the only reason for students to learn a foreign language. Job is not the only reason and only ultimate advantage of learning a foreign language. When you learn a new language, a completely new perspective opens up for you. The way you look at the world and your life changes. You learn not just the pronunciation and sentence construction but you see the history of the part of the world from which the language comes. The people who you interact change and ultimately your world changes. What are the most popular foreign languages in India? Which is the best and the most popular language in India? French followed by Spanish, German are some of the most popular languages. There are sufficient reasons for Indian students to opt for these languages. In Germany there is no tuition fees, the quality of higher education is excellent. The standard of living is high but the cost of living is low. These are the factors driving Indian students to Germany. In October 2015, Ms Merkel visited India. After her talk with Mr Modi there is a sharp rise in Indian students heading to German universities. With France setting a target of Ten thousand students by 2020 the number of Indian students going to study in France is also on the rise. In the first six months of 2017, the students who went to France increased by 40 per cent. There is no gainsaying that more people are moving from India to Europe than before. However, studying in Europe is not the only cynosure but business, tourism and migration are the other opportunities inviting Europe stretching arms of safety, prosperity and above all longevity. Europe is considered better than America as the life expectancy is higher in Europe than in America besides low crime rate, road fatalities and rapes. People going to Europe have different choices such as studies, job or migration but they have no choice when it comes to language. People hardly respond to English and they prefer to speak in local language, such as French, or German. Learning another language has personal, academic and social benefits. Foreign language is valuable asset and a credible career choice. Unfortunately, in India, especially in South India, where students target technical courses for MNC careers language skills have taken back seat. Schools and colleges actually deem language skills less important and don’t pay attention to teaching or practice. They are committed to show marks both to survive the competition and to satisfy the parents. Even in engineering colleges the teaching goes in vernacular languages leave alone general communication. Most engineering colleges usually hire professionals to teach language communication skills just a few days before Campus Recruitment Programs. The commercial mottos in education are depriving students of a very valuable opportunity of acquiring language skills that are essential to raise curtain personality development and cognitive, social and economic benefits. COGNITIVE BENEFITS for children and adults Brain science has discovered that functional plasticity of the human brain is driven by language, knowing a foreign language can actually change the brain's anatomy says research at the Institute for Cognitive Neuroscience at University College London. Children in foreign language programs have tended to demonstrate greater cognitive development, creativity, and divergent thinking than monolingual children. Adults show better performance on standardized tests such as the Scholastic Aptitude Test (SAT).\"Foreign Language Study not only helps improve SAT-Verbal Scores but academic performance. Most of these academic improvements lie in the range of verbal accomplishment. Studies have shown that such students are strong in mathematics as well. Research has shown that having studied a foreign language one can understand one’s own language better. Foreign language study can also raise one’s abilities to function in other spheres of life. Adaptability increases as an outcome of foreign language study. A student is exposed to unfamiliar ideas while learning a new language thus adaptability and diversity are easy for him. By learning a new language, one can expand his horizons of thinking that reinforces one’s own identity and self-confidence. Social Advantages of Foreign Language Education In a world where innovations like the Internet have brought the farthest ends of the earth into close contact learning a Foreign Language proves to be a solid help that goes beyond cognitive and academic benefits. Learning another language is often more advantageous as it unfolds another culture and can offer everyday social advantages. In a world where IT Companies have spread across the earth people are moving across the globe due to myriad reasons and speaking a foreign language is useful in situations other than just travel. Increasing number of jobs other than foreign trade, involve Foreign Language which allows people to interact with more people and adapt to clients with different cultural backgrounds. That is why IT professionals with foreign language are on greater demand than IT professionals with just English. In fact some companies are willing to train people on technical skills if the candidate is good at a foreign a language. Foreign languages are not an option but a need for tomorrow’s professionals. Now-a-days in Hyderabad many schools are offering French as a second language. In recent days French language has spread into small towns and cities like Warangal, Vijayawada, Visakhapatnam and Mahaboobnagar. Small and Medium schools also provide French language for their students. - Venkat Poolabala ( writer.poolabala@gmail.com) mobile: 9700877409 ",
            "date": "Answered March 16, 2018",
            "views": "386",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mohamed Semeunacte",
                "href": "/profile/Mohamed-Semeunacte"
            },
            "answer_text": " How did he become the boss’s assistant in a bit more than 3 months? That’s probably what everyone asked themselves at the time. In less than 10 years, he co-founded Creative Artists Agency and took 70 percent of the business. He even was President of Walt Disney company in the nineties. Sure, it was a few decades ago but the teachings will still be valid for years to come. How would you go about INTENTIONALLY become the “PUT HERE FAVORITE POSITION” in 6 months or less? I mean, everyone knows what to do in a job, right? You show up early, you do your best, you go home late… and you do that consistently. Wrong! I remember this episode of the 70 Show where the dad “Red” had lost his job and was trying to get another one. He was repeating what everyone in the room was repeating: “all I have to offer is that I’m hard-working and loyal”. Nowadays it’s not an advantage anymore. Back to Michael Ovitz. He started by making friends with the secretary at the front desk. He would bring her coffee and donuts frequently. She knew he was sucking up, but nobody sucks up to a clerk. She liked it. He knew it. After a few weeks, he asked her for the keys of the storage room. It contained thousands upon thousands of documents about past, present and most certainly future deals. He went deeeeep. But he knew one thing most employees don’t: One day, I’ll have my shot. I’ll be ready. Of course, that day soon arrived. Staying late, Michael noticed that almost every night, the boss and a friend of his were going out for diner and then coming back at the office to get some work more done. He had an office but it was in a corner. He decided to sit at the receptionist desk and for 3 nights they would come back from diner, find him sitting there, greet him and go to their office. The fourth night, his boss goes out of his office with a pile of paper. “Would you please make me photocopies?” “of course” he replied. When he brought the stack of paper he added: “Is there anything more I can do?” Sure enough, he had more work for him. Guess what happened the day the boss told him that he wouldn’t be able to help with some specific files? Michael already knew what files the boss was talking about. Hell, he even had a copy of the keys of the storage room they were locked in. He could go and grab the files right on the spot. Guess what happened when the boss’s assistant fell sick? Of course the boss asked for this young man to help out. Guess what happened a bit more than 3 months after Michael joined? Yep, he became the personal assistant of the boss himself. Now… This story has a few years, sure. But the lessons are timeless. It’s not about showing up early and going home late. Not anymore. It’s about being intentional in what you want. You want to develop your career? Be intentional about it! Don’t get a “career by default”.  Click here for the whole interview. ",
            "date": "Answered October 4, 2018",
            "views": "21",
            "upvotes": " View 20 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Natalie Hunter",
                    "user_href": "/profile/Natalie-Hunter-43"
                },
                {
                    "user_id": "Diane Kim",
                    "user_href": "/profile/Diane-Kim-80"
                },
                {
                    "user_id": "Kevin Palmer",
                    "user_href": "/profile/Kevin-Palmer-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Shuey",
                "href": "/profile/John-Shuey-8"
            },
            "answer_text": "Retired, I am more successful than most of my generation. And I started in bona fide poverty. I will outline the takeaways: As a teen I decided how I wanted to be. Not what I wanted to be. So I set off on my career with principles I both admired and bought into. It usually made it easy to do the right thing and, more generally, it actually made life itself just plain easier.I had just enough support from my childhood family that me and mine did not starve or freeze in those early years.I only worked for privately-held companies.I read a lot (especially the WSJ) and I taught myself to program.I married somebody smarter than me.I made friends with the widest variety of people.I negotiated more and more scheduled time off and traveled the country.I took a job early in my career that had rigorous processes. Thereafter, I thought about efficiency all the time.I never let employers or lawyers or businesses or the police or CEO’s or landlords or bankers or anyone abuse me.I never went along to get along.I was very discerning about debt and mostly avoided it. And I never bought stuff mindlessly or to impress others.I was always wary about conventional wisdom.",
            "date": "Answered June 15, 2020",
            "views": "84",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alex Chai",
                    "user_href": "/profile/Alex-Chai-25"
                },
                {
                    "user_id": "Surya",
                    "user_href": "/profile/Surya-316"
                }
            ]
        },
        {
            "author_info": {
                "name": "Satish Kumar",
                "href": "/profile/Satish-Kumar-12379"
            },
            "answer_text": "5 Tips for Career Growth and Development Set goals and create a plan to achieve them. Could your career development and management use help to gain momentum? People who are the most successful and satisfied in their careers have proactively determined what they want from work.Develop a timeline, including milestones. Bringing your boss and his or her sponsorship and mentoring into the picture will ensure that you have an internal mentor who will help you manage your career.Utilize company programs. Some companies have formal programs to help employees develop their careers. In others, you will need to informally pursue your career development. Companies with programs generally focus energy on helping employees develop and follow a career path.Own your career path. A career path can be discussed at several bi-annual meetings with your boss. Some companies demonstrate a deep commitment to their employees by assisting where possible with resources of time and dollars. However, remember that it is your career path.Write it down. Career paths are recommended for the same reason that goals are recommended. They are the written plan that can help each employee take charge of what is most important to his or her fulfillment and success. Without a plan, you can feel rudderless and you have no benchmark against which you can measure your progress.Post your resume now and get your first dream job on jobsclan.com ",
            "date": "Answered October 31, 2019",
            "views": "60",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Chaz Purlet",
                    "user_href": "/profile/Chaz-Purlet"
                }
            ]
        },
        {
            "author_info": {
                "name": "Etika Katabi",
                "href": "/profile/Etika-Katabi"
            },
            "answer_text": "Tired of chasing your tail? Follow these 7 Steps to Career Management and pave the road to your corner office. But before you begin, a word of caution: do not just “think through” these steps. For maximum effectiveness, write out your answers. Here’s a handy planning sheet you can download. this is my career advancement solutions Step 1 Decide on your “dream job”. Be as specific as possible: job title, name or type of organization, your salary, etc. The more detailed you are, the more commitment you’ll develop.  Step 2 Figure what you are ready to sacrifice for your dream: weekend sports? Occasional family dinners? After work drinks with co-workers? Remember that achieving your dream requires some sacrifice.  Step 3 Figure what you are ready to sacrifice for your dream: weekend sports? Occasional family dinners? After work drinks with co-workers? Remember that achieving your dream requires some sacrifice. a specific date for achieving your dream job - don’t allow for any slacking off. Step 4 Identify all of the jobs you’ll need to have before reaching your dream job. Determine the specific dates that you’ll be holding these jobs. Step 5 Determine the date when you should begin your next job. Step 6 This is the fun part. Imagine yourself in your dream job. What are you doing? How do you feel? How does it affect you? Write it all down. Step 7 Read out loud what you’ve written in Step 6 twice a day: once in the morning and once in the evening. Visualize yourself in your dream job. Working through each step ensures that you take an active part in achieving your dream job. Don’t stay behind with the pack by just wishing that you would be promoted. Make it happen.  One more very important thing: studies show that the effort expended on achieving a goal is equal to that of dealing with disappointment. For more on this, see my post . What to do when your boss doesn’t think you’re ready for promotion The choice is up to you. And always remember: Great managers are made. Not born. and look for career advancement solutions http://www.etika.co/ ",
            "date": "Answered May 11, 2016",
            "views": "1",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Delwyn Pinto",
                    "user_href": "/profile/Delwyn-Pinto"
                },
                {
                    "user_id": "Omar Zakarya",
                    "user_href": "/profile/Omar-Zakarya"
                },
                {
                    "user_id": "Jason Ma",
                    "user_href": "/profile/Jason-Ma-117"
                },
                {
                    "user_id": "Adam Voyton",
                    "user_href": "/profile/Adam-Voyton"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prajakta Dumbre",
                "href": "/profile/Prajakta-Dumbre-2"
            },
            "answer_text": "1.Set goals and create a plan to achieve them. Could your career development and management use help to gain momentum? People who are the most successful and satisfied in their careers have proactively determined what they want from work. 2.Develop a timeline, including milestones. Bringing your boss and his or her sponsorship and mentoring into the picture will ensure that you have an internal mentor who will help you manage your career. 3.Utilize company programs. Some companies have formal programs to help employees develop their careers. In others, you will need to informally pursue your career development. Companies with programs generally focus energy on helping employees develop and follow a career path. 4.Own your career path. A career path can be discussed at several bi-annual meetings with your boss. Some companies demonstrate a deep commitment to their employees by assisting where possible with resources of time and dollars. However, remember that it is your career path. 5.Write it down. Career paths are recommended for the same reason that goals are recommended. They are the written plan that can help each employee take charge of what is most important to his or her fulfillment and success. Without a plan, you can feel rudderless and you have no benchmark against which you can measure your progress. ",
            "date": "Answered May 21, 2019",
            "views": "456",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Owen Lai",
                "href": "/profile/Owen-Lai-9"
            },
            "answer_text": "these are 10 things can improve your career 10 Things You Can Do To Improve Your Career TODAY 1. Set small goals regularly When it comes to annual reviews, there is so much focus on goals for the year. A year is a long time; too long in fact to set tangible, achievable goals. Therefore, it is far more wise to set smaller goals throughout the year. Think about your day-to-day work. What could you be doing to elevate that work? Are there skills you could learn to help you advance? Think about this for a bit and then make a list of goals that relate to these items. And then, once you’ve set the goals, give yourself a deadline to have learned these things. When you’ve hit the deadline… give yourself a grade. Seriously. It works. Did you do it? Did you do it well? Then ask someone else how they would score or grade you on these new skills. Then rinse and repeat. 2. Stretch yourself The smartest of us say that success is just outside our comfort zone. So, it goes without saying that you must stretch beyond your area of expertise. Do something that scares you. Don't like public speaking, start signing up for presentations at work or networking events. Does it terrify you to put your industry thoughts out there? Ask someone for the opportunity to guest post. Whatever gives you the collywobbles; sign up for it, today. ",
            "date": "Answered July 30, 2019",
            "views": "157",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gian Carlos Brea",
                    "user_href": "/profile/Gian-Carlos-Brea"
                }
            ]
        },
        {
            "author_info": {
                "name": "Selina Yankson",
                "href": "/profile/Selina-Yankson"
            },
            "answer_text": "Be present. This may sound like an odd piece of advice but the truth is that if you are not present or aware in your career you will drift off course, fail to create or recognise the opportunities that come your way and find yourself far from the place you set out to be. You are a work in progress. You are a work in progress and therefore so is your career. As you change and grow as an individual so do the things you want from your career. Take time to understand your own needs and wants and make a plan to integrate these into your career plan. Understand and welcome change. Many people fear change in their jobs and career. Instead of approaching change with a fearful attitude try to welcome the opportunities it can bring. Yes, things may appear unclear or the change feel unwelcome at first but it’s better for you if you can work with it. Change is a constant especially now we are experiencing the true effects of technology and the digital age which is leading to totally new career opportunities and reshaping the jobs we do. If you are not present or aware of what is happening around you, in your industry and your organisation you will not be prepared to deal with your current situation or any future opportunities that flow from that because you won’t have acquired the necessary skills to move forward. Keep learning. One of the key reasons people move on from their jobs is because they have ceased learning. They perform their job on auto pilot and oftentimes they are bored. Boredom leads us to focus on the wrong things and divert us from our purpose. People who are constantly learning are rarely bored because they are learning new things. When you are learning you become aware of new ideas and opportunities. We expand our critical thinking and develop more of an openness to possibly. And, when you are open to possibilities you are more able to take calculated risks in your career that can move you forward. Take responsibility for your own career management Your career is YOUR responsibility. Your career development is not the responsibility of your employer. A good employer can facilitate your learning but they can’t define it for you. They can outline a pathway for what they need their employees to do for the good of the organisation. If that fits with your career plan - great. But in reality, it is up to you to define your career direction and make a plan that will take you there. ",
            "date": "Answered July 3, 2018",
            "views": "795",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rikesh Kumar",
                    "user_href": "/profile/Rikesh-Kumar-15"
                },
                {
                    "user_id": "Sanaya Reddy",
                    "user_href": "/profile/Sanaya-Reddy-2"
                },
                {
                    "user_id": "Sana Chaudhary",
                    "user_href": "/profile/Sana-Chaudhary-35"
                },
                {
                    "user_id": "Neha Garg",
                    "user_href": "/profile/Neha-Garg-764"
                },
                {
                    "user_id": "Surbhi Sharma",
                    "user_href": "/profile/Surbhi-Sharma-973"
                },
                {
                    "user_id": "Shruti Verma",
                    "user_href": "/profile/Shruti-Verma-423"
                },
                {
                    "user_id": "Tanisha Singh",
                    "user_href": "/profile/Tanisha-Singh-274"
                },
                {
                    "user_id": "Angel Kohli",
                    "user_href": "/profile/Angel-Kohli-1"
                },
                {
                    "user_id": "Yashwant Kushwaha",
                    "user_href": "/profile/Yashwant-Kushwaha-21"
                },
                {
                    "user_id": "Khushi Kaur",
                    "user_href": "/profile/Khushi-Kaur-109"
                },
                {
                    "user_id": "Jatin Gupta",
                    "user_href": "/profile/Jatin-Gupta-630"
                },
                {
                    "user_id": "Sheetal Mishra",
                    "user_href": "/profile/Sheetal-Mishra-95"
                },
                {
                    "user_id": "Himanshi Singh",
                    "user_href": "/profile/Himanshi-Singh-310"
                },
                {
                    "user_id": "Muskaan Verma",
                    "user_href": "/profile/Muskaan-Verma-62"
                },
                {
                    "user_id": "Lakshit Kotaria",
                    "user_href": "/profile/Lakshit-Kotaria"
                },
                {
                    "user_id": "Harshit Kotaria",
                    "user_href": "/profile/Harshit-Kotaria"
                },
                {
                    "user_id": "Rasit Ali",
                    "user_href": "/profile/Rasit-Ali"
                },
                {
                    "user_id": "Suraj Pancholi",
                    "user_href": "/profile/Suraj-Pancholi-8"
                },
                {
                    "user_id": "Tanuj Tejania",
                    "user_href": "/profile/Tanuj-Tejania"
                },
                {
                    "user_id": "Nanu Kanojia",
                    "user_href": "/profile/Nanu-Kanojia"
                },
                {
                    "user_id": "Naveen Thakur",
                    "user_href": "/profile/Naveen-Thakur-104"
                },
                {
                    "user_id": "Sangy Malhotra",
                    "user_href": "/profile/Sangy-Malhotra"
                },
                {
                    "user_id": "Sandeep Alora",
                    "user_href": "/profile/Sandeep-Alora"
                },
                {
                    "user_id": "Tarun Khajur",
                    "user_href": "/profile/Tarun-Khajur"
                },
                {
                    "user_id": "Sameer Readdy",
                    "user_href": "/profile/Sameer-Readdy"
                },
                {
                    "user_id": "Sameer Khan",
                    "user_href": "/profile/Sameer-Khan-2006"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neeraj Bhagwatula",
                "href": "/profile/Neeraj-Bhagwatula"
            },
            "answer_text": "I’m not the best person to be answering this question as I’m not in a set career yet, but I’m learning from my mistakes and hoping that this answer would help others not make the same mistakes to save precious time and resources. Always choose work experience over anything else in your career. Why do I say this? Because today either you want to be employed or start your own enterprise, the people you would be dealing with in either of those options are looking for someone who knows their stuff alright. I’m not undermining the importance of a university degree (well I myself am a masters pursuant at the moment) but signifying the underlying truth about today’s scenario. Scenario: Currently I’m a masters student in Renewable Energy Engineering and am a chemical engineer by bachelor training. Right after my bachelors degree I succeeded in achieving a technical job as a junior engineer in a cement company, which is pretty decent for someone with that qualification in India. I did have plans for masters degree abroad to start with, but was in a dilemma to choose between the two options right in front of me at the time. I chose to seek advice from my professors, seniors, parents and fellow mates. If not all, most of them advised me to follow through higher education in continuation of my bachelors reasoning that it’s really difficult to get back to university life when one gets into a job. The job offer was a 5 years’ contract and the pay well, wasn’t really up to my expectation. As evident, I chose to side with the advice and pursued higher education. Result: I’m at a very reputed university and am pretty satisfied by my learning and doing fairly well with academics as well, but I’m 23, graduating with 2 degrees and have absolutely nil work experience. When I look for technical jobs even in the new field I stepped into, my profile suits the educational qualifications they require but when it comes to the experience part, I become ineligible. Most of the jobs today, particularly in engineering field l, need recruits to be previously exposed to the engineering, operations and maintenance, design aspects to some extent if not a lot. Inference: I may be great at the theoretical knowledge university is laying off on me, but in a practical sense I am still wet behind the ears. As a result I have to stick to jobs even as part time one, like retail, services, sales, marketing (etc the list is long) but nothing technical, that I actually want to pursue. It’s not that I am not trying, (trust me I send out about 7 different cover letter every day) but inexperience hits me almost everywhere. I understand graduate programs offered by companies are meant for people like me, but a straight up, to the point advice I’d give is always gain work experience, the field you want to end up in, by whatever means you can . It actually helps you go a long way ahead. Hope it helps. Cheers! ",
            "date": "Answered October 4, 2018",
            "views": "500",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Valerie Alarcon",
                    "user_href": "/profile/Valerie-Alarcon-3"
                },
                {
                    "user_id": "Carre Armstrong Gardner",
                    "user_href": "/profile/Carre-Armstrong-Gardner"
                },
                {
                    "user_id": "Jin Wang",
                    "user_href": "/profile/Jin-Wang-176"
                },
                {
                    "user_id": "Ng Ching Hui",
                    "user_href": "/profile/Ng-Ching-Hui"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rinkesh Jha",
                "href": "/profile/Rinkesh-Jha-4"
            },
            "answer_text": "Everyone has a dream, first to have a job in a good company, and once he has got a job then they work hard day/night for their growth and promotion. but due to some problems with the company and some major problems lack of skill, he hasn't promoted.  Well, here we have talked about skill, it means that either he is living his life with old knowledge, he doesn’t try to upgrade skill, and not have knowledge about whats will go on in the future? but some students and employers be serious about his career. He always tries to do something new. For example(Student):- A student who is studying from b.com and he always wants that he should have knowledge of science and also know history as well. Next example for Employer:- Like that an employer who’s doing the job in MNCs, and also he does work hard for what? for a good salary and quick promotion, he always wants and tries to learn something new(new technology ideas, new course ideas, own business ideas. etc) from senior.  This is the exact thing for students or employers to boost, upgrade and upgrade their skills. 5 Tips for best ways to get ahead in your career Dr. Tracey Wilen-Daugenti, vice president and managing director of Apollo Research Institute and visiting scholar at Stanford University's Media X program, recommends five additional career management strategies. Set goals and create a plan to achieve them:-Could your career development and management use help to gain momentum? People who are the most successful and satisfied in their careers have proactively determined what they want from work. Develop a timeline, including milestones:-Bringing your boss and their sponsorship and mentoring into the picture will ensure that you have an internal mentor who will help you manage your career. Utilize company programs:-Some companies have formal programs to help employees develop their careers. In others, you will need to informally pursue your career development. Companies with programs generally focus energy on helping employees develop and follow a career path. Own your career path:-A career path can be discussed at several bi-annual meetings with your boss. Some companies demonstrate a deep commitment to their employees by assisting where possible with resources of time and dollars. However, remember that it is your career path. Write it down:-Career paths are recommended for the same reason that goals are recommended. They are the written plan that can help each employee take charge of what is most important to his or her fulfillment and success. Without a plan, you can feel rudderless and you have no benchmark against which you can measure your progress.  Here are the top 5 points(which related to me) for career growth. Think positiveCan’t stop learningAlways big thinkLearn future technologyLearn about different jobFor example in Learn future technology, I’ll suggest you learn Blockchain Technology for students and learn blockchain technology for the employer. What is Blockchain technology? Blockchain technology is the revolutionary technology that was first invented by Satoshi Nakamoto, which is a pseudonym. Initially, it was the technology behind the digital currency, Bitcoin, which is nothing but a form of digital (Cryptocurrency) which can be used in place of Fiat money for trading but it has opened up other avenues of its use across the World. Don Tapscott definition provides a nice concise description: The blockchain is an incorruptible digital ledger of economic transactions that programmed to record not just financial transactions but virtually everything of value. You can read more about blockchain and how it works CLICK HERE And If you want to learn about the history of blockchain then CLICK HERE I never told you its blog to help you in a growth career but its the most important part of getting a better solution for go best ways. Tips- Share your goals with your boss and gain a partner who can help you broaden your experience. Thanx for reading this, please upvote for my ans. ",
            "date": "Answered December 12, 2019",
            "views": "655",
            "upvotes": " View 26 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Firman Masudi",
                    "user_href": "/profile/Firman-Masudi"
                },
                {
                    "user_id": "Patrick Kielly",
                    "user_href": "/profile/Patrick-Kielly"
                },
                {
                    "user_id": "Valerie Alarcon",
                    "user_href": "/profile/Valerie-Alarcon-3"
                },
                {
                    "user_id": "Dee",
                    "user_href": "/profile/Dee-497"
                },
                {
                    "user_id": "Shakir Ahmed",
                    "user_href": "/profile/Shakir-Ahmed-10"
                },
                {
                    "user_id": "Sriram Raghavan",
                    "user_href": "/profile/Sriram-Raghavan-1"
                },
                {
                    "user_id": "Fergus Brown",
                    "user_href": "/profile/Fergus-Brown-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edwin Trench",
                "href": "/profile/Edwin-Trench"
            },
            "answer_text": "Generically: Success is not necessarily the result of hard work, but very few people that are successful are not hard working. Elon Musk, Steve Jobs and others come to mind. In fact it’s funny how those that work the hardest seem to be so lucky and successful, and those who don’t…aren’t. So work hard! No matter how smart or how clever you may be (the turtle and the hare comes to mind) if you don't make an effort and work hard, all is for naught. For you have created but not carried out! Work smarter if you don’t want to work harder (PD: More on this at the end), in other words make your brain work instead of your brawn. Even so there are times, and you have to know when that happens, that you just have to wrap up your sleeves, pick up the shovel and start digging, for no matter how much thinking and planning you made, there comes a time for action and you have to do it with equal, if not more, enthusiasm. On work itself: Revise your work very thoroughly before you deliver it, making certain there are no errors, minor mistakes or even details in its presentation. Do this until you consistently are delivering quality work that gets no comments (serious comments, you will always get some due to differences in style!)Always react politely and with a smile to suggestions and criticismIf you commit a mistake, make certain you never, ever commit it again!Make an effort to deliver all your work on time, and if possible ahead of scheduleYou may have to work longer and harder for a period, but the effort should eventually pay offIf possible offer your help to othersIf in doubt...ask! It's better to ask than to commit a mistake!Never give, up, be persistent, you will eventually get thereOn work ethics: - Treat \"everybody\" with respect - Always say Please and Thank You - When on the phone, or in a conversation or discussion, avoid raising your voice, there are people working nearby - Never (ever) get angry - Don't talk about politics or religion, you will never reach an agreement, and don't talk about women, you never know when you may be talking about somebody's relative - Never be late - Don't chatter in the hallways, people are working nearby - Leave the coffee room clean In general be a gentleman or a lady and act accordingly! PD: I have always been kind of lazy although very responsible, and hate doing things twice, the hard way or with excessive effort. I usually find ways and systems to do what has to be done, as soon as possible and with a minimum effort, so I can get on with what I really want to do. When I studied in the Naval Academy far from my home I lived at a friend’s home during weekends. I loved and still do love, reading, and spent as many hours as I could during those weekends...reading. My classmate’s mother would get exasperated with me because she considered that spending so much time sitting down doing nothing except reading, meant that I was lazy (maybe she wasn't wrong!). One day she asked both her son and me to paint the boards to set up a picket fence for the garden. Each of us got about 60 boards to paint. My classmate started immediately, he picked up the first board, painted one side then the other and finally both rims, set it aside to dry, picked up the next one and so on. I looked at him and saw this was going to take like “forever”, so I thought it over a bit and came up with a better idea. I set up all 60 boards against a wall side by side and painted the first side all at one time. Then I rotated them till the first rim was visible and painted all sixty of them again. When I had rotated and painted the boards all the way around, I set them out to dry. I then turned back to my friend and he obviously still had a long way to go, so I picked up my book and started reading again. The lesson here is you have to do what you have to do - you just don’t have to do it the hard way. Cutting corners is beneficial as long as you get the job done, well and on time. Before you start any task I suggest you spend a spell thinking it over before you start. It is amazing the time you can save just by analyzing a situation without moving one finger. It is time well spent and well earned. Don’t feel guilty about sitting and thinking. Generally the time you spend thinking is returned tenfold. In other words make your brain, and not your brawn, work for you. Having said the former, there are times when the only alternative is to wrap up your sleeves and slog your way until the work is finished, no matter how long it takes or how tired you are. A smart guy is capable of knowing when he has to do which. The really smart guy plans, prepares, simplifies, systemizes and looks for the fastest way to do the job. Yet once all is said and done and the only alternative is to sweat it out, you do it, then, there, and with your best disposition. ",
            "date": "Answered July 19, 2018",
            "views": "120",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kriya Doshi",
                "href": "/profile/Kriya-Doshi-2"
            },
            "answer_text": "Keep on experimenting with new careers and NEVER opt for career counseling or DMIT. There no such thing as perfect career choice. At some of the other point in life you will get bored from your career choice. That is a time when you might contemplate on “I wish I would have tried that earlier” My experience till I am 23 looks like this: At the age of 12, I wanted to be a cardiologist. The reason being my mom's heart problem. I was very sure of being a cardiologist and curing that problem for others. Life gave me a reality check when I was studying biology. I realised it is a very long journey of giving NEEt to MBBS to Master's which will take atleast 7 years after my 12th. Belonging to a family from Tier II city in Gujarat, I did not have enough colleges for medical. I had to move out of the state which was not at all possible due to family restrictions. I took commerce, planning to do BBA and manage my family business. I am a character who will prefer out if the box thing, be it career or any other option. So I got trapped into CFA which was an upcoming field at that point of time. Although my family had never restricted me nor pressurised me in choosing a particular stream. I cleared CFA Level I and was totally frustrated by my choice. Till then I realized that my interest lies in Education field as I see a lot of students not realising what to do with their careers. That is when I wanted to work towards uninformed career decision. I was researching on the same while doing a job in marketing in an education company. After my Bachelors, I quit my job, went for a trek and took an admission in ISME for Masters in Entrepreneurship in Mumbai. It was again a trending and upcoming field. Till then I knew I want to work on solving uninformed career decision as a problem through my company/start-up. During my Master's I found Think Young in May 2018. It is an Entrepreneurship and Leadership Academy for students aged 11 and beyond wherein we allow a child to experience being an Entrepreneur and develop 21st century skills. I am also currently learning Digital Marketing. So to summarize, one must keep on learning and exploring new career options throughout the life. Exploring them while in school is recommended. Take upon internships, read about various careers, meet people from different careers and ask them about the same, try developing diverse skills but NEVER opt for career counselling or DMIT. ",
            "date": "Answered December 7, 2019",
            "views": "209",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Scott Rowsick",
                "href": "/profile/Scott-Rowsick"
            },
            "answer_text": "The typical answers a question like this probably sounds a bit like this: Come to work with a great attitudeNetwork within the companyDo great workCommunicate your desire to progressThose are fantastic tactics. It doesn’t hurt to occasionally stay a little late or come in a little early either. But one tactic that I think is overlooked is leaving the company. Many times people who are great at their job get pigeon-holed into their position. The company will give you decent, more-than-cost-of-living increases in salary, but it’s really just enough to keep you where you are. However, if you apply for a position “a level up” at a competitor, you may get more attention. I don’t remember the source, but an article I read did research on salary and tenure. Employees who stay at one company for longer than two years are generally underpaid. You can thwart that just the same with this tactic. It’s not for everyone, because many people don’t enjoy change. After all, there’s a large cost to change. But its benefits could significantly outweigh its costs. ",
            "date": "Answered May 2, 2018",
            "views": "165",
            "upvotes": " Answer requested by Abdul Mansuri",
            "upvoters": [
                {
                    "user_id": "Shreyash Mishra",
                    "user_href": "/profile/Shreyash-Mishra-48"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fergus Brown",
                "href": "/profile/Fergus-Brown-4"
            },
            "answer_text": "Following on from Bill Boland's sound advice, there are three things which I have found useful:Acquire, develop and polish your transferable skills; these are the basis of your value to any employer, along with the experience, contacts and specialist knowledge you have.Learn how to work with people; as Bill said, but I would add that the 'thirty second rule' is useful. Assume in any given situation where you have a message to communicate that you have thirty seconds of the other person's full attention. During that time they will take in a lot of information about you from your appearance, manner and delivery which they will use, along with the words and gestures you use, to determine how interesting your idea or proposal could be. At this point, the detail doesn't matter, what you have to get across is that for the other person, dealing with you is useful and worth their (later) time. Get implicit agreement in principle and the rest is just application.Learn to work with yourself; an unpleasant truth in my eyes is that in service-based jobs people generally work very inefficiently. If you look at the productivity demands placed on production line or factory staff, who are often low-paid, and compare this with the output of office staff, it can look like very little gets done in the time available. This is what advisers mean by focus; define tasks clearly, allocate time (resources) to each, complete each task, evaluate your work and present it. By concentrating on producing output over time (with the right quality) you will shine in comparison with fellow workers on the same pay grade.Finally, a word about office politics. It's real, its wasteful and its a pain. If you find yourself in a place where office politics dominates progress, get out and find somewhere new. ",
            "date": "Answered April 10, 2015",
            "views": "475",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Patrick Kielly",
                    "user_href": "/profile/Patrick-Kielly"
                },
                {
                    "user_id": "Valerie Alarcon",
                    "user_href": "/profile/Valerie-Alarcon-3"
                },
                {
                    "user_id": "Chiquitta Bruce",
                    "user_href": "/profile/Chiquitta-Bruce"
                },
                {
                    "user_id": "Marleen Maglana",
                    "user_href": "/profile/Marleen-Maglana"
                },
                {
                    "user_id": "Spencer Buja",
                    "user_href": "/profile/Spencer-Buja-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Boland",
                "href": "/profile/Bill-Boland-2"
            },
            "answer_text": "The best advice to a person to enhance their career. First, you need great presentation skills. This came up in an earlier question/conversation on Quora. To stand out from your peers, you must have superior debating and public speaking skills. This variable may have a disproportionate impact on your career as measured by value of investment. Put simply, you have to be a confident speaker, capable of engaging individuals, and groups under all circumstances. This applies equally to the technologies of presenting your work such as power point. Second, this is related to the first. Your writing skills matter. You will be responsible for generating well-structured and well-written reports and proposals, make sure you stand out from your peers with world-class writing. Third, be disciplined and organized. Develop procedures for anything that matters. Keep a journal of ideas, and a journal of daily activities and contacts. When things go wrong, and they always do, being organized is an advantage as you can systematically look backwards from more than method. To sum up: the best public speakers and communicators get noticed first and most, this is the single best piece of advice I could give a young person. Your writing skills matter, and being organized makes life much easier. ",
            "date": "Answered April 10, 2015",
            "views": "528",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Riya Patel",
                    "user_href": "/profile/Riya-Patel-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roy Goh",
                "href": "/profile/Roy-Goh"
            },
            "answer_text": "1- Start with the end in mind- Decide in general terms what you would like to be doing.  Note that this is about \"doing\", not being someone or some position. 2- Specialize and commit to skills upgrades- Many careers require specialization or some require add-ons.  Ensure that you are always keeping your skills up to date.  For example, if you are a Project Manager (PMI) or a Service Manager (ITIL), ensure you keep your certifications current until you've reached a high enough level.  Or if you are going towards cyber-security, you have to build up to it through experience and credential.  Sometimes this isn't necessary, it depends on your environment. 3- Be curious- See Daryl Capuano's post regarding exploratory work.  It is good to pursue interests and passions if only for self-enrichment.  You might discover a path you would have never considered.  Alternatively, the passion may enhance your main career. ",
            "date": "Answered May 5, 2015",
            "views": "195",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Wicida Sarme",
                "href": "/profile/Wicida-Sarme"
            },
            "answer_text": "I believe that is a process of learning a particular kind of work a person would be wanting to do and enjoy doing as his job for the rest of his life as a source of his livelihood.. The process may start from the acquisition of the needed knowledge that is important in order to do and implement the requirements of the job. Followed with the conversion of the lean d knowledge into effective hands on application abilities… An important aspect which I believe should be the pre requisite of this career development is the utilization and participation of the personal interests and inclinations of the person itself.. Which will be helpful in seeing the fruition of a successful career. Once the academics gets translated into an effective application skillset, The only thing needed to complete the career development process is its actual execution… The person needs to practice and hone the learned skills to develop some expertise in the chosen career.. I believe this what career development is all about, to learn how to do a particular kind of work called job.. ",
            "date": "Answered April 13, 2019",
            "views": "87",
            "upvotes": " Answer requested by Yashpal Sihag",
            "upvoters": [
                {
                    "user_id": "Touhid Kamal",
                    "user_href": "/profile/Touhid-Kamal"
                },
                {
                    "user_id": "Azkaranaufath Al-Qirafa",
                    "user_href": "/profile/Azkaranaufath-Al-Qirafa"
                },
                {
                    "user_id": "Victoria Kolotov",
                    "user_href": "/profile/Victoria-Kolotov"
                },
                {
                    "user_id": "Han Wahjudi",
                    "user_href": "/profile/Han-Wahjudi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Riya Sharma",
                "href": "/profile/Riya-Sharma-2810"
            },
            "answer_text": "You can choose a career for a long time through long term career planning and deciding your career path and the way you are going to proceed with each stage of your career. The best you can do in this situation is take the help of a career counselor as they hold years of experience and expertise in reading and understanding the trends so they will guide you very effectively with assured results and a good career ahead. You can interact with CareerPotli for the same, one of the best career counselors and among the top 5 ed-tech companies of the country. They have counseled 65,000 students and professionals across the country and have helped them in shaping their career towards the right directions. You should visit them once and the counselors will do a complete assessment of your personality to identify your core strengths, interests, skills, capabilities and suggest you a career path accordingly. You can even discuss about your plans, queries or ask any question related to your career directly from the experts and get expert guidance and advice to decide on the best career path ahead. ",
            "date": "Answered August 28, 2020",
            "views": "39",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bingcheng Hu",
                    "user_href": "/profile/Bingcheng-Hu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Jorgensen",
                "href": "/profile/Eric-Jorgensen-3"
            },
            "answer_text": "Stay long enough in each position to make a difference. Personally, I find it takes a least a year to get comfortable in a role and two years to begin functioning like a pro, and another year or two after that to finish a few interesting projects. As you finish projects, you build your resume and you will discover that you will start attracting interest from others who admire your work. Lots of people move too soon and for the wrong reasons. If you move before you’ve finished a significant project, you are probably moving too soon. If you move because the job is not “fulfilling” or because you don't like your boss, or because “they just aren’t recognizing my talents”, you are most likely moving for the wrong reason. Every job is going to have rough patches as you settle in and it’s going to take a while to build the clout you need to accomplish significant work. The best time to move is when you’ve finished something you are proud of, you want to try something new, and you are approached with new, more challenging work. ",
            "date": "Answered November 21, 2017",
            "views": "848",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Edward Conway",
                    "user_href": "/profile/Edward-Conway"
                },
                {
                    "user_id": "Chaz Purlet",
                    "user_href": "/profile/Chaz-Purlet"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bhavin Patel",
                "href": "/profile/Bhavin-Patel-194"
            },
            "answer_text": "You can improve it through some easy steps: Know Your Interest: First of all, what you all need to do is know your real interest. Don’t start your career for just earning money. Your interest is like fuel to your mind which keeps you motivated.Know Your Skills: Start your career based on your true skills which makes your career an easy journey. You will be playing a game of surity where you will be pretty much assured about desired outcome as you know things well because you are skilled person.Know Your Audience: When you start your career, understand whom you are going to serve. You will be serving your boss, colleague, customer and yourself. Serve them well, serve them what they want. They will be happy so you too.Know Yourself: You need to prepare yourself for everything. You know that you must need some skills to pursue your career so work hard to get them as they are essentials. You don’t have choice rather than this. You can’t denied. Do anything to improve your skills or it will kill your career.You will be the only builder of your great career considering a fact that you are the true judge of your skills and interest. Do what you love and love you what you do is what everyone knows but they don’t. “Don’t make your career just money earning platform, make it a great purpose of your life where you will enjoy each day at your work.“ ",
            "date": "Answered July 18, 2019",
            "views": "281",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Garima Ghoshal",
                    "user_href": "/profile/Garima-Ghoshal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barbara Robson",
                "href": "/profile/Barbara-Robson-1"
            },
            "answer_text": "At the junior levels, success in a career as a scientist is all about technical skills and discipline: you need to be smart and focused, work hard, get a good PhD, develop a high level of expertise in a narrowly defined area, and get papers written, submitted and published. You also need some luck. The more senior you get (unless you are a once-in-a-generation genius in your field), the more success comes down to communication and relationship-building. You need to be able to communicate why your ideas are important and how they will fulfill the goals of funding agencies. You need to be a good listener so that you really understand those priorities. You need to be able to explain why your findings matter and and what should change as a result. You need to build collaborations that people enjoy working in and that achieve their over-arching goals. You need to know how to bring the best out of your collaborators, staff and/or students through difficult times, and to help them to achieve their own goals. You need to build networks so that your expertise will be sought out. You still need your technical expertise, but you will find yourself spending less and less time at the lab-bench, in the field, or at the code-face and more time working with people. ",
            "date": "Answered May 1, 2018",
            "views": "661",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vlad Kim",
                    "user_href": "/profile/Vlad-Kim-2"
                },
                {
                    "user_id": "Irshad Ahmed",
                    "user_href": "/profile/Irshad-Ahmed-768"
                },
                {
                    "user_id": "Amruta Soman",
                    "user_href": "/profile/Amruta-Soman-2"
                },
                {
                    "user_id": "Mahinth Christensen",
                    "user_href": "/profile/Mahinth-Christensen-1"
                },
                {
                    "user_id": "Mike Lawrence",
                    "user_href": "/profile/Mike-Lawrence-52"
                },
                {
                    "user_id": "Gaurav Kumar Jha",
                    "user_href": "/profile/Gaurav-Kumar-Jha-12"
                },
                {
                    "user_id": "Kunal Jain",
                    "user_href": "/profile/Kunal-Jain-119"
                },
                {
                    "user_id": "Ankita Hareshkumar Shah",
                    "user_href": "/profile/Ankita-Hareshkumar-Shah"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pete Horeyseck",
                "href": "/profile/Pete-Horeyseck"
            },
            "answer_text": "I'm surprised that no on has mentioned reading some books about personal development.  One classic, The Seven Habits of Highly Successful People, is one of my personal favorites.  I found it very helpful.  I even took some courses in Seven Habits training. In my own experience, developing people skills seemed to be one of the best ways to advance ones career.  Being able to work with many types of people and getting results through the coordinated efforts of any team you are on is critical to success.  You can have all kinds of other skills and fall short if you are not good with people, in most career paths.   Certainly, there are those subject matter experts who no one gets along with who contribute in their specialized area.  However, those types of jobs are rare and self limiting. ",
            "date": "Answered April 10, 2015",
            "views": "203",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Victoria Kolotov",
                    "user_href": "/profile/Victoria-Kolotov"
                },
                {
                    "user_id": "Nishant Tyagi",
                    "user_href": "/profile/Nishant-Tyagi-129"
                },
                {
                    "user_id": "Vibhor Kashyap",
                    "user_href": "/profile/Vibhor-Kashyap-2"
                },
                {
                    "user_id": "Jeanine Joy",
                    "user_href": "/profile/Jeanine-Joy"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Bud-Peonia"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rick Grant",
                "href": "/profile/Rick-Grant"
            },
            "answer_text": "Here are some things to think about: Know what you want. Put your sites on you next job and figure out what knowledge and skills you will need to do the job.Find a mentor, someone who has had the job you want and advanced beyond it.Be incredibly good at the job you have now. And look like you’re enjoying it. No one wants to promote a grumpy person into a position of power.Let your supervisors know that you are seeking a career track that will allow you to advance and stay in the company.Start networking within your industry so you’ll have plenty of contacts if your present employer isn’t clever enough to give you the runway you need to advance.Good luck to you. ",
            "date": "Answered April 13, 2019",
            "views": "61",
            "upvotes": " Answer requested by Yashpal Sihag",
            "upvoters": [
                {
                    "user_id": "Zobia Zuberi",
                    "user_href": "/profile/Zobia-Zuberi"
                },
                {
                    "user_id": "Hannah Long",
                    "user_href": "/profile/Hannah-Long"
                },
                {
                    "user_id": "Shashank R",
                    "user_href": "/profile/Shashank-R-47"
                },
                {
                    "user_id": "Lena Keri",
                    "user_href": "/profile/Lena-Keri"
                },
                {
                    "user_id": "David Bowman",
                    "user_href": "/profile/David-Bowman"
                },
                {
                    "user_id": "Mostafa Tawfik",
                    "user_href": "/profile/Mostafa-Tawfik-7"
                },
                {
                    "user_id": "Chotaliya Hardik",
                    "user_href": "/profile/Chotaliya-Hardik"
                },
                {
                    "user_id": "Zachary M Stimler",
                    "user_href": "/profile/Zachary-M-Stimler"
                },
                {
                    "user_id": "Lavish By Makas",
                    "user_href": "/profile/Lavish-By-Makas"
                },
                {
                    "user_id": "Adrienne Gomer",
                    "user_href": "/profile/Adrienne-Gomer"
                },
                {
                    "user_id": "Pete Imeokparia",
                    "user_href": "/profile/Pete-Imeokparia"
                },
                {
                    "user_id": "David Berman",
                    "user_href": "/profile/David-Berman-12"
                },
                {
                    "user_id": "Abhilash PB",
                    "user_href": "/profile/Abhilash-PB"
                }
            ]
        },
        {
            "author_info": {
                "name": "Patrick Ow",
                "href": "/profile/Patrick-Ow"
            },
            "answer_text": "An individual with a “career” orientation is more likely to focus on elements related to success or prestige. This individual will be interested in the ability to move upward in his or her career, to receive raises and new titles, and to achieve the social standing which comes from the career. Careers which have a clear upward “ladder’ are appealing to those with a career orientation. To achieve career progression, you really need to constantly upgrade and upskill yourself with new knowledge, skills and experience so that you can create value for your employers. In essence, you need to demonstrate your value contribution to the organization. ",
            "date": "Answered January 7, 2019",
            "views": "122",
            "upvotes": " Answer requested by S Patel",
            "upvoters": [
                {
                    "user_id": "David Long",
                    "user_href": "/profile/David-Long-54"
                },
                {
                    "user_id": "John Richardson",
                    "user_href": "/profile/John-Richardson-500"
                }
            ]
        },
        {
            "author_info": {
                "name": "Susan Samuel",
                "href": "/profile/Susan-Samuel"
            },
            "answer_text": "I discovered this one very late and it was the one that made the difference for me. Follow your leaders. Support your leaders. If you're really, really great at what you do, or even at what they do, the tendency is to be a non-follower. It's not competing necessarily, it's simply not following. And there's lots of good reasons why. The boss is a flake. He communicates poorly. He doesn't recognize who is carrying the load and who has lots of time to spend garnering credit. Whatever his flaws, the job will suddenly work if you pull with him instead of against him. Find ways to help him succeed. And he doesn't have to change and he doesn't have to succeed for it to transform your career. It has to do with where you had to move to support a leader, the space you had to create. Standing in the shoes of the leader, comprehending the sense and the dread of responsibility that comes with the role, changes you, prepares you to be a leader. It happened for me almost effortlessly and almost instantaneously after a lot of years of non-following. ",
            "date": "Updated March 15, 2020",
            "views": "68",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ed Han",
                "href": "/profile/Ed-Han-1"
            },
            "answer_text": "What is one thing that I can learn to improve my career? The one thing that I think any professional would benefit from learning is how to work with people with whom you otherwise don’t get along. In your career, you won’t like everyone with whom you must work and achieve goals, and neither will everyone like you. But since just about every job requires working as part of a team, learning how to be as good a teammate as you can will help you stand out from the rest. ",
            "date": "Answered July 30, 2019",
            "views": "103",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Joanne Sosa",
                    "user_href": "/profile/Joanne-Sosa"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Gillon",
                "href": "/profile/Peter-Gillon-4"
            },
            "answer_text": "Phew - get ahead? - not sure i know. Those who get to be really big cheeses , work very hard, are talented , blessed with good health, lucky, and a earn a good amount of cash. The rest of us do the best we can with the balance of skills we are blessed with The key thing is to find something that you are good at, enjoy, that gives you a good living , that brings satisfaction, and some level of happiness , and that you continually re-assess to make sure that the balance of interest , hours and cash is right for you at that point in your life. Work hard enough , don’t think cash is everything , and leave some space for other things in your life whether that’s friends, family, children , pleasure, music, art or other less business orientated pastimes ",
            "date": "Answered October 6, 2019",
            "views": "175",
            "upvotes": " Answer requested by Jerry Tan",
            "upvoters": [
                {
                    "user_id": "Kushal Srivastava",
                    "user_href": "/profile/Kushal-Srivastava-3"
                },
                {
                    "user_id": "Prince Knight",
                    "user_href": "/profile/Prince-Knight-17"
                },
                {
                    "user_id": "Neha Agarwal",
                    "user_href": "/profile/Neha-Agarwal-584"
                },
                {
                    "user_id": "Utkarsh Sharma",
                    "user_href": "/profile/Utkarsh-Sharma-220"
                },
                {
                    "user_id": "Shrey Patel",
                    "user_href": "/profile/Shrey-Patel-39"
                },
                {
                    "user_id": "Janvi Gupta",
                    "user_href": "/profile/Janvi-Gupta-11"
                },
                {
                    "user_id": "Satyam Dharia",
                    "user_href": "/profile/Satyam-Dharia-1"
                },
                {
                    "user_id": "Aaditya Tiwari",
                    "user_href": "/profile/Aaditya-Tiwari-22"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeanine Joy",
                "href": "/profile/Jeanine-Joy"
            },
            "answer_text": "Even when I’ve learned widely different things life seems to have a way of weaving itself together to make the skills you’ve acquired fit perfectly with future opportunities. I believe learning should be fun and even exciting. I would learn the things that you enjoy learning and trust the Universe to bring you an opportunity to use them in the best possible way. I’ve seen a DJ who was part-time with a day job go from believing he would never be able to make a career out of it to five years later having a team of 12 DJ’s working for him and being a full-time DJ and all of it came from one guest at my wedding who hired him to monthly events where he met others. When learning is fun you’re engaged. ",
            "date": "Answered September 6, 2016",
            "views": "163",
            "upvotes": " Answer requested by Sergey R",
            "upvoters": [
                {
                    "user_id": "James Hendry",
                    "user_href": "/profile/James-Hendry-1"
                },
                {
                    "user_id": "James Taylor",
                    "user_href": "/profile/James-Taylor-472"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mohammed Uzair",
                "href": "/profile/Mohammed-Uzair-40"
            },
            "answer_text": "If you are still a student and have not chosen a field of study yet,then the best thing to have a bright career will be to do it as soon as possible.If you stick to your area of preference,then you will be able to relate everything you study with the chosen stream even before you enter a professional degree college.And do remember that its not just you,but each and every single person asking this question to http://himself.So basically your competition is with these many people and only few get a chance to move forward,as there is just one post for a ceo,few posts for managers and senior executives in a company. To be that lucky charm of your company you need to have some major qualities: >>you should think differently. >>you should have knowledge in the respective field in quite excess. >> hardwork is something that can always be your tool to reach great heights in future…. I hope this answers your question with a general point of view. ",
            "date": "Answered December 19, 2017",
            "views": "197",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alexis Jane Gan",
                    "user_href": "/profile/Alexis-Jane-Gan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Salil Jha",
                "href": "/profile/Salil-Jha-1"
            },
            "answer_text": "To become best at anything (any profession be it sports, arts, music, academics, career or business) you need three ingredients. The Will to be The BestThe How-toThe Execution (and patience)Let’s talk about these in detail. The Will to be The Best Without wanting something badly you won’t have it. The world is very competitive. We are living in a flat world and interconnected economy. Technology is advancing everyday at an increasingly higher pace. In the future, you are not only competition people from other countries but you are going to compete with Computers, Super-Computers and heck yeah, even A.I (Artificial Intelligence). How do you win in such a game? Well, by first wanting to win. This means “not giving up”. This means working hard. This means thinking smartly and building a strategy so you can win this game. Best! ",
            "date": "Answered November 23, 2016",
            "views": "18",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Carre Armstrong Gardner",
                    "user_href": "/profile/Carre-Armstrong-Gardner"
                }
            ]
        },
        {
            "author_info": {
                "name": "Craig Anderson",
                "href": "/profile/Craig-Anderson-45"
            },
            "answer_text": "You should look to the future.  Envision what you want out of your career. Picture in your mind, if everything was to go perfectly, where you’d want to end up - and what you’d want to end up doing. Take that as your final goal, and work back from it. Outline what you could achieve in the next 5 years to get yourself closer to that goal. Would you need certain qualifications that you can start working towards? Would you need experience in other areas that you can start looking for? Or would you want a complete career change? Is there anything you can start doing now to prepare for your transition into the career you really want?  If you want to improve something, you need a motivation. In order to create reliable motivation, you need a concrete plan of how you’re going to achieve your goals. Setting and achieving goals is how improvement is done.  For an easy to follow method of planning and achieving your goals, see this answer. ",
            "date": "Answered September 6, 2016",
            "views": "630",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elizabeth Hedges",
                    "user_href": "/profile/Elizabeth-Hedges-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Benjamin May",
                "href": "/profile/Benjamin-May-26"
            },
            "answer_text": "Become a ‘scholar’ of your profession. If you are in sales or business development for example, study every aspect of selling and marketing. I mean the basics. Then advanced. Then go practice what you read or learned in the real world. Keep finding new ways to practice your craft. Make your approach unique, ‘branded’ to you. See where your next steps could be. Never stop learning about how your strengths can be used in new ways. Then take a risk and study another part of your company that makes you more valuable. Finally, if your position can be a source of direct income to the company, you’re ‘a leg up’ on people in staff positions. They are overhead. Just my experience. Good Luck! Ben ",
            "date": "Answered April 17, 2019",
            "views": "68",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Matthew Mann",
                "href": "/profile/Matthew-Mann-35"
            },
            "answer_text": "If you’re thinking about going to college, you can get ahead by enrolling in a technical school instead of the traditional 4-year degree. Because trade school traditionally takes about two years to complete, vocational trainees can get into the workforce earlier — in about half the time as someone who attends a traditional four-year college. This allows workers to get an additional two years of income over a four-year college graduate. What’s even better is that blue-collar workers have the potential to earn the same salary as a white-collar worker, and maybe even out earn their white-collar peers down the line! ",
            "date": "Answered May 6, 2017",
            "views": "225",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Berman",
                "href": "/profile/David-Berman-65"
            },
            "answer_text": "The first thing is to do the best you can at your current job. Go above and beyond to exceed your goals. The second is that you need to be the go-to person for your team when your manager is unavailable. The third is helping other groups outside your own. This way you’re building your profile as a leader within and outside of your team. If you do these three things, you are basically doing the role of the next level up in your career, and you will be a shoo-in for the position when it comes up. Also, advocate for yourself. Let multiple levels of your leadership know that you’re here to prove yourself and that you want to grow your career. I am continually impressed when top performers approach me early on to discuss their ambitions and then follow through. ",
            "date": "Answered August 10, 2018",
            "views": "12",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Eddy Gregg Soewito",
                    "user_href": "/profile/Eddy-Gregg-Soewito"
                }
            ]
        },
        {
            "author_info": {
                "name": "Selim Jamil",
                "href": "/profile/Selim-Jamil"
            },
            "answer_text": "Original question: what are you doing to advance in your profession Reading to expand my scientific knowledge. I have more than enough knowledge to teach my high school biology classes as it stands. I could just review my notes before class, reread my textbooks to refresh my memory and teach the class. But I would not be the best possible teacher I could be if I didn’t keep on expanding my scientific content knowledge. So last year I read On the Origin of Species. I have taught evolutionary biology for a decade but I never read the entirety of Darwin’s seminal work. I didn’t “need” to read it all (and I breezed through some of the slower chapters) - I know enough to teach what is a relatively surface level of evolutionary biology. But to understand just how much effort Darwin put in to developing evidence gave me significant insight into just how amazing his theory was and continues to be. It informs my teaching and expands my enthusiasm for continued teaching. It allows me to continue to be excited for teaching the same topic every year; knowing that I “know” my topic better and have greater command of the facts and that my expertise and ability to convey the material is stronger makes this the best job I could imagine. ",
            "date": "Updated July 24, 2019",
            "views": "382",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Isaiah Garcia",
                    "user_href": "/profile/Isaiah-Garcia-88"
                }
            ]
        },
        {
            "author_info": {
                "name": "Seyfullah Semen",
                "href": "/profile/Seyfullah-Semen"
            },
            "answer_text": "The best way to do better in your career, is by listening to feedback and asking what you can do better. If you are already working somewhere show them that you are willing to learn more and that you are ready to handle more responsibility. If you don’t have work yet and you just want to boost your career, you need to market yourself better. Show companies your great skills and don’t be afraid. The thing that companies really like is ‘why’ you want to work and what your goal is in life. They also want to know where you want to be in the next couple of years. Really start learning more about who you are. ",
            "date": "Answered May 4, 2018",
            "views": "112",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Daryl Capuano",
                    "user_href": "/profile/Daryl-Capuano"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chanchal Toshniwal",
                "href": "/profile/Chanchal-Toshniwal-1"
            },
            "answer_text": "Always have an answer to \"What if\"? What if you don't land up into that particular course/college/company/job or anything that is your plan for enhancing your career prospectus! No, i don't mean that always have a plan B', and not work with whatever you got to execute the plan A, but my point is if by any chance, any thing in the universe works against your plan and do not necessarily conspire for your career in the real world. Then, have an answer to what if, and continue with a happy life! ",
            "date": "Answered October 5, 2018",
            "views": "963",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Preeti Mandal",
                    "user_href": "/profile/Preeti-Mandal-7"
                },
                {
                    "user_id": "Ricardo Colon",
                    "user_href": "/profile/Ricardo-Colon-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ed Johnson",
                "href": "/profile/Ed-Johnson-157"
            },
            "answer_text": "That’s a great question! There are lots of different ways in which you can and I’ve actually recently written an article about this right here - How Can I Improve My Professional Career Progress? The main things I would recommend are hard work and open mindedness. Always have a hunger to learn and show that you are keen. Network with as many people as you can - there are some great opportunities that can present themselves when you start connecting with more people. A mentor is also well worth having - they can guide you in your career, industry and roles and help you to climb the ladder. Good luck! ",
            "date": "Answered July 20, 2018",
            "views": "225",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Richardson",
                    "user_href": "/profile/John-Richardson-500"
                }
            ]
        },
        {
            "author_info": {
                "name": "Travis Mccoy",
                "href": "/profile/Travis-Mccoy-19"
            },
            "answer_text": "I would say if you want to be excellent, you need to practice a lot. You will need feedback so, go to speaking events, write, expose yourself to get many feedbacks. You need to read a lot, be aware of what everybody else is doing in your profession. Never stagnate. If you want to be the best, you also need to move where the best are. You can have a great impact in a country by bringing a new profession but you would never be the best of the profession. Think of a cardiologist that move to a country without cardiology, he can change the life of millions but, would not have the lab necessary to make a breakthrough discovery and earn a Nobel Prize in Medicine. ",
            "date": "Answered November 23, 2016",
            "views": "248",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Allan Brooks",
                "href": "/profile/Allan-Brooks-3"
            },
            "answer_text": "It all boils down to what do you want out of your career as well as developing your skills to where you can position yourself to be successful. For example when i transition from being a lab assistant to being a data science I had to evaluate my strengths going into data science as well as things I need to work on. Now that im in the field I have a road map that im currently working on that has a list of things I would like to accomplish within a certain time frame ",
            "date": "Answered April 13, 2019",
            "views": "54",
            "upvotes": " Answer requested by Yashpal Sihag",
            "upvoters": [
                {
                    "user_id": "Vibhor Kashyap",
                    "user_href": "/profile/Vibhor-Kashyap-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Krishna Reddy",
                "href": "/profile/Krishna-Reddy-173"
            },
            "answer_text": "First of all take away the word profession. Now you see basically the question How can i grow. Which is perfectly right and 100% supportable. Without even considering in what professional you are. So the following : 1. Choose to work on what keeps always awake on and give you \"that \" energy to do until you accept there cannot be done anything more yourself. 2. Once chosen dont try to set your goal of reching it tommorrow. 3. Observe the things around you.4. Know your strengths and weak points. 5. Now break down your definition.of growth into small packets of achievement.6. Start with the first packet and do a swot analysis of urself to attain that goal of small packet.7. Once you achieved your first packet dont feel over confident .8. Be able and keep moving with one armdistaance from doing and actual results : verify are you doing right things first time and dre you doing first the right things.9. Reapeat this loop until your all packets are over.10. Once thats over , you will not be found here asking questions but helping others reach their speific growths .. Leverage ur strengths and focus ur working point ( professsion). Success is only that distant from you , that distance is how fast you can complete the points 1 to 10 with accuracy. Otherwise you might not 100% of your goal but also say not in proper time ... you dont want to drive F1 race whhen there is no competition ",
            "date": "Answered June 15, 2017",
            "views": "127",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Clinton Post",
                "href": "/profile/Clinton-Post"
            },
            "answer_text": " Marketing is my career. More specifically, I’m in the medical field. What I’ve done is found a mentor and learned everything I could to move up. In the process I’ve taken on multiple new, advanced roles, acquired additional skills, completed a masters in social tech and accepted a much higher position and pay at another business. Right now I’m on track to being a CMO within a few years and have a plan laid out, including additional skill sets that I need to master in the process. I’ll never settle for good enough and always push myself to be more, learn more and effect positive change in the lives and organizations I get to influence. ",
            "date": "Updated August 29, 2018",
            "views": "36",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "AP",
                    "user_href": "/profile/AP-673"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roosevelt Wallace",
                "href": "/profile/Roosevelt-Wallace"
            },
            "answer_text": "Make sure it is what you truly want to do in your life. If you love what you are doing you will never work a day in your life. Start as early as you can to take classes toward your career. Don't worry if you are not noticed in the beginning. You will be. Just do the best job you can. Don't perform only when observed. Perform all the time, because you never know when you will be observed. Make yourself indispensable by learning the jobs of others and being the best at your job. If you get called on your day off to come in, that means you have achieved that. Remember, knowledge is power. Share it wisely. Lest the person you teach may replace you. Impart the knowledge to someone worthy when you are ready to retire. ",
            "date": "Updated October 4, 2018",
            "views": "234",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sanjeev Kro",
                    "user_href": "/profile/Sanjeev-Kro"
                },
                {
                    "user_id": "Rohan Chordiya",
                    "user_href": "/profile/Rohan-Chordiya-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amey Barve",
                "href": "/profile/Amey-Barve-7"
            },
            "answer_text": "There can be a number of things that you will have to learn in order to enhance your career. Nobody can define the set of rules or things that you need to have for giving your career a new height. More or less, it is a combination of various factors and things that you put together. I feel that you should learn to be focused towards finding solutions rather than sticking to problems. Problems are going to be there every time and there will be many who will highlight the problem, but only a few manage to come up with solutions. This is something that you should aim at. ",
            "date": "Answered August 4, 2019",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tim Halloran",
                "href": "/profile/Tim-Halloran-9"
            },
            "answer_text": "Find something you are good at and enjoy doing. Stick to your guns no matter what people tell you. Life can be tough, but it’s much tougher if you give up on your own dreams and become a sheep! You may have to do some crappy jobs if you’re following your dreams. But it’s better to have a long term plan and keep your eye on a bigger prize which most people don’t see. If you’ve got your eye on a large goal, there’s nothing you can’t do in the interim to get though. If you feel like you’ve settled, your goal isn’t big enough! There will be times when everyone seems to see things differently than you do. Learn to trust your own path under difficult circumstances and keep going no matter what. Following the herd seldom is a successful strategy for happiness, peace and satisfaction. ",
            "date": "Answered August 1, 2019",
            "views": "308",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Victoria Kolotov",
                    "user_href": "/profile/Victoria-Kolotov"
                },
                {
                    "user_id": "Shailesh Patel",
                    "user_href": "/profile/Shailesh-Patel-349"
                },
                {
                    "user_id": "Vibhor Kashyap",
                    "user_href": "/profile/Vibhor-Kashyap-2"
                },
                {
                    "user_id": "Haresh Chaudhary",
                    "user_href": "/profile/Haresh-Chaudhary-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher Aune",
                "href": "/profile/Christopher-Aune"
            },
            "answer_text": "80% - Focus on mastering tasks, and build relationships with anybody who has any part in the product/service you provide. 20% - As you get the 80% in hand (3–9 months), be on the lookout for a major project that will cut costs or increase revenue. Then, persistently work on it and make it happen. Don’t ask permission, and don’t be obvious about what you are doing. And don’t let anybody discourage you from your project. Companies are about making money, and they advance people who make them money. ",
            "date": "Answered September 19, 2019",
            "views": "140",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Vivek K",
                    "user_href": "/profile/Vivek-K-70"
                },
                {
                    "user_id": "Harinita Krishna",
                    "user_href": "/profile/Harinita-Krishna"
                },
                {
                    "user_id": "Sean Smith",
                    "user_href": "/profile/Sean-Smith-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dolores Connolly",
                "href": "/profile/Dolores-Connolly"
            },
            "answer_text": "I am assuming you chose work you are interested in and your choice wasn't solely based on potential earnings. I'm also assuming you know your area of expertise well. Keep it nicely polished. Keep your ears open and mouth reasonably zipped, especially when you start a new job. Think before you act. Sleep on the issue for a night.  People skills are extremely under-rated. Show you are genuinely interested in your colleagues as people rather than cogs. You may not become a CEO because they tend to have the killer instinct but it will get you far. If you look after a team, figure out what each person's motivation is. It varies widely. Look after your people and they will look after you. It's a delicate balance. If you are too 'nice' it will not work. If you get it right, success is guaranteed. Good luck with it. ",
            "date": "Answered March 26, 2015",
            "views": "154",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Victoria Kolotov",
                    "user_href": "/profile/Victoria-Kolotov"
                },
                {
                    "user_id": "Nga Nguyen",
                    "user_href": "/profile/Nga-Nguyen-24"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Rothacker",
                "href": "/profile/Dave-Rothacker"
            },
            "answer_text": "I love Daryl's #1 answer - Commit to Exploratory Work!  The percentage of young adults who actually explore is so low, that when you do so and demonstrate passionate curiosity, respect and appreciation towards Guides, you'll stand out. Guides are loose tie connections who really want to help Explorers. The Explorer simply asks for some of the Guide's time. She's not looking for the end all Mentor, she's just looking for knowledge, information and wisdom. Following that initial conversation she asks the Guide if it'd be all right to touch base in the future and if they'd be interested in her progress.  Btw, the second most important thing an Explorer does following a visit with a Guide is to send a hand written thank you note. The first? Well it's a combination. Heart-fully thank the Guide in person and ask if they know of anyone else who would be willing to spend a twenty minutes in a similar conversation. ",
            "date": "Answered May 2, 2015",
            "views": "378",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Deepika",
                    "user_href": "/profile/Deepika-405"
                },
                {
                    "user_id": "Sergey R",
                    "user_href": "/profile/Sergey-R-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Rogue",
                "href": "/profile/John-Rogue-3"
            },
            "answer_text": "I’ll share a secret( don’t tell anyone). Your mentor probably can’t help you “climb the corporate ladder”. Everyone seems to have mentors thinking that’s the solution. It’s not! A mentor can offer advice, but incase you’re wondering how those suckers at your job ascend to higher heights and nothing you do seems to work there is a whole new term for that: A sponsor! Someone at a level high enough to pull strings for you and make things happen. A mentor helps you get a job. A sponsor creates the job. Never confuse a mentor with a sponsor! Which one do you have? Rogue Uber Driver Real lessons from the roads of Silicon Valley www.RogueUberDriver.Com ",
            "date": "Answered October 10, 2018",
            "views": "212",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Victoria Kolotov",
                    "user_href": "/profile/Victoria-Kolotov"
                },
                {
                    "user_id": "Isaiah Garcia",
                    "user_href": "/profile/Isaiah-Garcia-88"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daryl Capuano",
                "href": "/profile/Daryl-Capuano"
            },
            "answer_text": "1. Commit to Exploratory Work This is the time, energy, effort required to figure out your path.  Most people spend very little time thinking about big picture issues. A. Develop Intrapersonal Wisdom - understand yourself in relation to what would make you happy in your career.  This is your happiness vision. B. Develop Entrepreneurial Wisdom - understand the world of work in order to chart a course for success.  This is your success vision. C. Determine where your happiness and success intertwine.  2. Develop marketable skills 3. Be willing to pay your dues towards mastering your craft Good luck! ",
            "date": "Answered May 1, 2015",
            "views": "119",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Y.Paramesaran Menon",
                "href": "/profile/Y-Paramesaran-Menon"
            },
            "answer_text": "Your question demands a detailed answer. Quora is not a forum or outlet to answer it due to its limitation. i hope you are serious. In that case I suggest a book for you to read. No; i don’t have any special axe to grind when i suggest it. Personally I don’t know either the author or the publishers. Recently I came across this book; found it very useful and informative, especially for those who are just beginning their career. The Book is titled catalyst authored by Chandramouli Venkatesan. the book is published by Penguin Random House India. Available in all book stores and in online also. I can assure you that you will benefit if you sincerely follow his tips. ",
            "date": "Answered January 28, 2019",
            "views": "117",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Manish Raj Sharma",
                "href": "/profile/Manish-Raj-Sharma-The-Edupreneur"
            },
            "answer_text": "Voice Of Master - A start is what stops people Dear friend! I believe in typing less and meaning more. I am sharing with you one of the most candid lessons i learnt in life. I also learnt that implementing such lessons in life could be “game changing” for anyone. These tips have helped many building a good career because these hacks give you ways to get ahead in your career                      Keep shining Keep smiling 9717879813 https://www.linkedin.com/in/manish-raj-sharma-the-edupreneur-185595b4/ ",
            "date": "Answered May 20, 2020",
            "views": "93",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rafferty Pendery",
                "href": "/profile/Rafferty-Pendery"
            },
            "answer_text": "Always start with making it very clear what you mean by improving your career. If you very clearly name what it is that you want to accomplish and how you want things to be, then you will know what is an improvement or not. For some people that really want to be doing a certain type of work, so they are going to transition from one kind of work to another, they may take a pay hit. It may not be clear that that could be progress if it will get you to where you want to go. So step back and really look at the whole picture and when you name that, you will be able to see how you are doing so much better. ",
            "date": "Answered July 25, 2018",
            "views": "41",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Harrison Kim",
                "href": "/profile/Harrison-Kim-28"
            },
            "answer_text": "There is a lot of great answers here. I’ll add/emphasize just a few things: Make your intentions clear. Tell your leaders where you want to go in your career and solicit feedback on what you can do to improve. Listen carefully and keep this dialogue open. Many employees do not do this, and it’s one of the most effective ways of letting them know that you want to learn and grow.Find a sponsor/mentor. Someone who will look out for you - build a genuine relationship with that person. Organizations are political - helps when you have someone on your side rooting for you.Leverage your strengths. Nobody is perfect. Find your strength and ways to contribute to the organizarion most effectively with your strengths.",
            "date": "Answered August 4, 2019",
            "views": "131",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Chang Liu",
                    "user_href": "/profile/Chang-Liu-362"
                },
                {
                    "user_id": "Huu Tuan",
                    "user_href": "/profile/Huu-Tuan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amber Gribbins",
                "href": "/profile/Amber-Gribbins"
            },
            "answer_text": "By setting a goal, finding out what you like to do and then doing everything possible to absolutely work towards doing what you love to do.  Note, this does not mean abandoning your current job or a lucrative job to find your \"life work\".  Too many people don't understand that you can have two jobs in your life..the one  you work, and the one you work to be able to work. (ie. Lawyer to bread maker);  Or in my case, business financier, accountant, then teacher.  ",
            "date": "Answered April 16, 2016",
            "views": "156",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Akshay Takkar",
                "href": "/profile/Akshay-Takkar-1"
            },
            "answer_text": "The simple 5 step formula: 1. Make a plan2. Generate resources for the plan3. Make efforts to achieve the goal4. Execute the plan.5. Cherish and respect what you get. Backup: This is the most important part of planning. Always have a plan B.There are times when you may not achieve what you aspire or worse case, you may loose what you get. Or even worse, you may have a self realisation that what you got. Was not exactly what you wanted. And that is when your plan B comes to the rescue. The next thing to remember is, even if you do not get anything (which is rare,but there) do not loose hope. Hope is the biggest virtue. Till the day you have hope, you can never loose. Work hard. Have fun. P.S- The secret-  always have a Plan C for your Plan B. Cheers..!/ ",
            "date": "Answered April 10, 2015",
            "views": "259",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Keith McAndrew",
                "href": "/profile/Keith-McAndrew-1"
            },
            "answer_text": "Take more training! Become the best at the job you are tasked with doing. It might not always work out the way you hoped, but it is still one of the best ways to get ahead. Also be a person of integrity and high moral character. Someone who is honest and trustworthy. Because in the end if that doesn’t help your career, you will still be a person of integrity and high moral character. Someone who is honest and trustworthy, and that will just make you a better person anyway! ",
            "date": "Answered October 6, 2019",
            "views": "93",
            "upvotes": " Answer requested by Jerry Tan",
            "upvoters": [
                {
                    "user_id": "Abdelrahman El Badawi",
                    "user_href": "/profile/Abdelrahman-El-Badawi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Faulks",
                "href": "/profile/Robert-Faulks-2"
            },
            "answer_text": "Get a job in your area of interest even before going to school. In some career's you don't even need a degree or certification if you work long enough in the field. And read all the publications dedicated to your career when in high school. Tap into everyone who has connections in your field and see if they can get you a favor which might get you a job in your field. ",
            "date": "Answered October 17, 2018",
            "views": "32",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sameul Jackson",
                "href": "/profile/Sameul-Jackson"
            },
            "answer_text": "Well it depends on which stage of your career you are. Assuming that it the start of your career. Lets start by sharing with you this answer about things you need to know when starting your career. Someone anonymous's answer to What career advice do you have for recent graduates? Secondly, there are so many things when questions you need to ask yourself like. What career path do I need to select? (Million dollar question) as it determines everything else that follows up.Will my career give me happiness, money and work life balance. Plus would I be able to attach a purpose to my existence and love working in my chosen career happily for the rest of my life?OK, assuming I have selected the right career, am I where I am supposed to be right now in my career? If not what things I need to do get myself there?Revise you career plans every 5 years and see where you will be in the next 5 years. Make sure you are determined to get where you want to be and make the effort required.Hope it helps answer the question. ",
            "date": "Answered September 6, 2016",
            "views": "319",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Vinod Gopinath",
                    "user_href": "/profile/Vinod-Gopinath-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhimanyu Sharma",
                "href": "/profile/Abhimanyu-Sharma-138"
            },
            "answer_text": "My best piece of advice for career development is, don't waste time and start as early as possible. Ususally young people are very confused with what they want to do in life and keep wasting time in searching for their passion or in discovering their calling. The best way to know your passion is to do what you get in a best possible way. With time, you will discover your calling. The best advantage of this thing is that, the early you start, more the time you have to discover your passion. This is the best way for a good career development. ",
            "date": "Answered October 5, 2018",
            "views": "135",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sue Chehrenegar",
                "href": "/profile/Sue-Chehrenegar"
            },
            "answer_text": "Look for opportunities. Take advantage of any chance to gain some added knowledge. Maybe you can take a special program during the summer months. Perhaps your college offers a January term, when you can take a course in a subject that interests you. You may be able to use that experience later. I got into a PhD program by presenting a lecture on studies I had learned about when taking a summer program at Los Alamos. ",
            "date": "Answered March 15, 2019",
            "views": "51",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rhonda Best",
                "href": "/profile/Rhonda-Best"
            },
            "answer_text": "Have an end goal. Do you remember being asked 'what do you want to be when you grow up?'  What did you say?  Is that answer still true today?  If not, do you know why?  To create a fulfilling career that's the first step, understanding your career goal. After that, you just begin to move towards it.  Getting the experience, qualifications and contacts that will help you to achieve your goal. I know, I've made it sound simple and it's not.  But that's where you start - by being clear about your goal. ------------------------------------------- Thanks for the A2A.  If you've found the answer useful please remember to upvote.  Also, why not follow my blog Fulfilling Careers there's a post there with your name on it.  Best wishes. ",
            "date": "Answered January 3, 2016",
            "views": "226",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Regal Unlimited",
                    "user_href": "/profile/Regal-Unlimited"
                },
                {
                    "user_id": "Thirupathi",
                    "user_href": "/profile/Thirupathi-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Bonnell",
                "href": "/profile/Steve-Bonnell-3"
            },
            "answer_text": "Demonstrate proficiency in your current role.Make connections to build your network.Seek advice from your network.Perform an honest self-evaluation of your motivations, skills and weaknesses.Learn as much as you can about your goal.Obtain the training necessary to meet that goal.Make a well-reasoned decision to move forward without burning bridges.",
            "date": "Answered June 10, 2017",
            "views": "104",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mejo Kuriachan",
                "href": "/profile/Mejo-Kuriachan-1"
            },
            "answer_text": "In my career or your career? In my career it will take continuous learning about a lot of things which I already know plus learning new things. Also connecting with people who hold more knowledge than me is going to help a lot. If the question is about your career, the information you have given is not enough to give you a perspective. ",
            "date": "Answered June 7, 2017",
            "views": "122",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alfred Burovadeliya",
                    "user_href": "/profile/Alfred-Burovadeliya"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian McDermott",
                "href": "/profile/Brian-McDermott-22"
            },
            "answer_text": "Well, each career is different in terms of what skills are essential. And it’s not realistic to present all of the skills required for success in any career. For that list, which contains thousands of skills, you must invest YOUR time to find out. Not ask someone else to invest their time to do so for you. That’s called initiative and responsibility, and both are among the skills and abilities essential for success in any career. ",
            "date": "Answered February 15, 2018",
            "views": "72",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bill Rice",
                "href": "/profile/Bill-Rice-23"
            },
            "answer_text": "Work hard, never be late of leave early and keep an eye on your industry. Learn what you can from where you are and be willing to move if necessary to move your career. If you feel it is necessary look outside for advancement. The same company doesn’t move people up as much as moving outside of your current company but balance security with advancement. Take care! ",
            "date": "Answered September 24, 2018",
            "views": "53",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Abhishek Purwar",
                "href": "/profile/Abhishek-Purwar"
            },
            "answer_text": "This is not specific to career but in general: Be passionate about what you doBe open to learnBe adaptableChallenge yourself by diving into new areasBe positiveShare your knowledge and learn from othersLearn from your experiencesThese things help in growing professionally and personally. ",
            "date": "Answered May 3, 2018",
            "views": "23",
            "upvotes": " Answer requested by Payal Parmar",
            "upvoters": [
                {
                    "user_id": "Sanchita Padhi",
                    "user_href": "/profile/Sanchita-Padhi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Isaac Dexter",
                "href": "/profile/Isaac-Dexter"
            },
            "answer_text": "You must have the courage and the daring to well and truly suck at something before you become great at it. All too often, our society and educations have groomed us to expect perfect results right off the bat and when we don’t get it, we end up feeling useless and discouraged. Have the bravery to suck and success will come. Give this a read to get a better idea of what I’m talking about. ",
            "date": "Answered July 29, 2019",
            "views": "37",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shruti Patil",
                "href": "/profile/Shruti-Patil-166"
            },
            "answer_text": "Most people want to become successful as quickly as possible. The problem is, many don't know how to go about doing it. Because the world has become so competitive, you will have to do your best to secure your share of success. The following webinar helps you to get ahead in your career. Ways To Get Boastful Career | NIBT - Content Hub ",
            "date": "Answered June 6, 2017",
            "views": "173",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Supriya Sharma",
                "href": "/profile/Supriya-Sharma-532"
            },
            "answer_text": "The best way to get ahead in your career is by understanding yourself better and your career better. I took the PRISM Inventory and understood what my work preferences were and what exactly was impacting my performance. You can also take the PRISM inventory today by going to www.prismbrainmap.com. ",
            "date": "Answered March 9, 2020",
            "views": "7",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aravind Chaudhari",
                "href": "/profile/Aravind-Chaudhari"
            },
            "answer_text": "Do nothing…… 1.Only First Set Your Goal  2. Focus On Your Goal  3. Think Every day About Your Future  4. Learn Lots of Skill Related your Goal  5. Improve Your Knowledge .  6. Meet successful people learn them  I hope you satisfied my answers. Thanks For reading. ",
            "date": "Answered January 23, 2018",
            "views": "95",
            "upvotes": " View 4 Upvoters"
        },
        {
            "author_info": {
                "name": "Nigel Ohrum",
                "href": "/profile/Nigel-Ohrum"
            },
            "answer_text": "Network... network... network. There is no such thing as too much networking. Go to industry related events. Teach a class. Join a meetup. Go to happy hours with coworkers.  You'll never regret the relationships and friendships you make. These individuals are the ones which will refer / talk about you to others. ",
            "date": "Answered October 6, 2012",
            "views": "405",
            "upvotes": " View 3 Upvoters"
        },
        {
            "author_info": {
                "name": "Michael Brown",
                "href": "/profile/Michael-Brown-257"
            },
            "answer_text": "Choose a career centred around something you love doing - you will naturally strive to do better! Also, keep learning new things, even if they don't always seem directly related to your chosen career path. By constantly learning and improving yourself, you will become better at your job. ",
            "date": "Answered March 26, 2015",
            "views": "197",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Harry Joseph",
                "href": "/profile/Harry-Joseph-59"
            },
            "answer_text": "Don't be afraid of turning away from a linear path. ... Don't find a mentor — find a leadership board. ... Just don't ask what you deserve— show it. ... Work with a goal. ... Take the risk calculation. ... Please wait for your turn. ... Look for your role models. ",
            "date": "Answered December 11, 2019",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tim Roth",
                "href": "/profile/Tim-Roth-3"
            },
            "answer_text": "1. Understand what you want, and why you want it.   2. Understand what is is holding you back from achieving step 1.  3. Learn how to overcome what is holding you back.  4. Make step 3 a priority until complete 5. Systematically repeat until step 1 is achieved.  ",
            "date": "Answered January 13, 2016",
            "views": "146",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Debra King",
                "href": "/profile/Debra-King-4"
            },
            "answer_text": "Work hard. Stay out of the office gossip and politics. Be known as a person who can be counted on and who doesn’t make trouble for the boss all the time. Just go there and do well at the job you’re being paid to do. When asked for your opinions, have creative suggestions. ",
            "date": "Answered February 1, 2018",
            "views": "34",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shubham Mittal",
                "href": "/profile/Shubham-Mittal-77"
            },
            "answer_text": "Work extremely hard.Hard work and perseverance can take u to the skies and above.Just be clear with the fact that the world is full of hard working people.And our competition is with the best of best.Just humble yourself up and toughen up a little bit.That is the key. ",
            "date": "Answered December 29, 2015",
            "views": "94",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Hadley",
                "href": "/profile/Robert-Hadley-11"
            },
            "answer_text": "Become the expert in your field (when you have downtime study). Work hard, take time for yourself. Do the side jobs nobody wants to do. Don’t complain at work. When you screw up be the first to admit it, take the full blame, learn from it and move forward. ",
            "date": "Answered April 10, 2018",
            "views": "45",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Milan Choudhury",
                "href": "/profile/Milan-Choudhury-10"
            },
            "answer_text": "Don’t be afraid of taking an unconventional route to succeed.Find yourself a mentor.Instead of asking for what you deserve show that you’re worth it through your actions.Take calculated risks and try new experiences.",
            "date": "Answered May 2, 2020",
            "views": "28",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steven Ussery",
                "href": "/profile/Steven-Ussery"
            },
            "answer_text": "By putting my family as a higher priority than my job. That way I make progress in the only thing that ultimately counts, my personal happiness. Work is an means to that, not an end in and of itself. ",
            "date": "Answered March 19, 2018",
            "views": "115",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Ryan Hintze",
                "href": "/profile/Ryan-Hintze-4"
            },
            "answer_text": "Go all in. Eat, Sleep and Breathe your position and once people start to notice your work ethic and hunger to be great you will be propelled in your environment. Do everything you can to be the best you can be and always ask questions. ",
            "date": "Answered July 20, 2018",
            "views": "32",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Corey Ellis",
                "href": "/profile/Corey-Ellis-20"
            },
            "answer_text": "Hello, Work HardBe liked and respected by your colleaguesDo something to stand out when other people are coming up dryBe calm in a crisisDon’t sexually harass anyone",
            "date": "Answered January 31, 2020",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nafisa Mohamedali",
                "href": "/profile/Nafisa-Mohamedali"
            },
            "answer_text": "Hello.Qalbi. Sheer hardwork and dedication in life is impprtant to improve our career or any step of our life. Set a goal of what your aim is and work hard. Self decipline and self motivation play key roles in our achievements. Set timings anď dedicate sincerely your attention to gain what you want. Thank God Almighty for all his mercies and climb the ladder of your success. Do not let anyone stop you in your walk towards your suçcess and achievements. ",
            "date": "Answered July 19, 2018",
            "views": "46",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ron Mckernan",
                "href": "/profile/Ron-Mckernan-2"
            },
            "answer_text": "Try repeating / chanting the words: Nam-Myoho-Renge-Kyo The Buddha’s very highest teaching! When you align your life with the true entity that manifests itself in ALL phenomena, tremendous wisdom, compassion and fortitude will well forth from within your life! This is called “The Buddha Nature” or the “World of Buddhahood” Give it a try! ",
            "date": "Answered November 18, 2016",
            "views": "47",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anil Anthony",
                "href": "/profile/Anil-Anthony-1"
            },
            "answer_text": "EVery1 is Excellent at everything, but you should have interest in what you do though. Career(Job) is only a way to survive to enjoy life, but keep in mind Creer(Job) is itself not life. You got only 1 life do what you want and try to fulfill even your wildest dreams. ",
            "date": "Answered March 23, 2015",
            "views": "84",
            "upvotes": " Answer requested by Nick Su"
        },
        {
            "author_info": {
                "name": "Paul Lee",
                "href": "/profile/Paul-Lee-551"
            },
            "answer_text": "I definitely can recommend you to read some advice from Careerdemands blog. Really useful resource for everybody. In short, just be a strong person or don’t even try to improve your career next several months. ",
            "date": "Answered January 8, 2018",
            "views": "181",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Say Keng Lee",
                "href": "/profile/Say-Keng-Lee"
            },
            "answer_text": "Constantly upskill/Relentlessly reskill/Continuously cross-skill/Periodically expert-skill, so as to stay relevant in a VUCA world. These initiatives will definitely ensure one's robust future employability and career tracking. ",
            "date": "Answered June 9, 2019",
            "views": "93",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gwen Hitchcock",
                "href": "/profile/Gwen-Hitchcock"
            },
            "answer_text": "Work your butt off.Have a high standard of ethics.Have a sense of humor.Care about your craft.Go the extra mile.And most importantly communication andCollaboration is the key. ",
            "date": "Answered March 23, 2015",
            "views": "60",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sanchita Padhi",
                "href": "/profile/Sanchita-Padhi"
            },
            "answer_text": "Programming is endless. Learn new coding languages or try to make an app in the language you know.You can also try going abroad because your talent costs more there and plus you can do some extra curricula which pays you better!!!! ",
            "date": "Answered November 26, 2015",
            "views": "139",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Clyde Rigsby",
                "href": "/profile/Clyde-Rigsby"
            },
            "answer_text": "If you have a desire for self flagellation then no. Go ahead and perform poorly in your career and you will be left in the waste pile. You will not have any money and probably live in a cardboard box. Why would you even ask such an obviously foolish question? Why would anyone choose a career in order to fail at it? ",
            "date": "Answered May 1, 2018",
            "views": "14",
            "upvotes": " Answer requested by Alexis Jane Gan"
        },
        {
            "author_info": {
                "name": "Jagadeesan Muthurathinam",
                "href": "/profile/Jagadeesan-Muthurathinam"
            },
            "answer_text": "Putting effort to know, The procedures, The way of giving timely output,quality output. The need of the customers at large. The feedback. ",
            "date": "Answered November 23, 2016",
            "views": "118",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Decourcy Williams",
                "href": "/profile/Decourcy-Williams"
            },
            "answer_text": "That is a loaded question. It comes down to…are you chasing money, or happiness? If you can combine the 2 then you've won! Most of us do not have the luxury, so lots of times, we have to pick one over the other. I think most people choose money. That is until they get to a place where the money no longer excites them. ",
            "date": "Answered July 30, 2019",
            "views": "10",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Taylor",
                "href": "/profile/Michael-Taylor-563"
            },
            "answer_text": "Develop ? To add to,increase,improve,delve into. Well of Course,I mean take a Course,CONSTANT STUDY Works wonders for any Career. Never be fooled, it just about means,To learn is to go forward. Work . ",
            "date": "Answered February 21, 2018",
            "views": "61",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Eric Krausz",
                "href": "/profile/Eric-Krausz-2"
            },
            "answer_text": "You should be learning the skills most needed by your employer in the most important projects. Success in your career is strongly related to matching your skill to what the employer needs. ",
            "date": "Answered September 26, 2019",
            "views": "36",
            "upvotes": " Answer requested by David A. Lee"
        },
        {
            "author_info": {
                "name": "Michael Barnard",
                "href": "/profile/Michael-Barnard-14"
            },
            "answer_text": "By down-playing the career bit and focussing on the adding value to clients bit. Careers come with success; success comes from clients.  ",
            "date": "Answered January 6, 2013",
            "views": "620",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Vincent Vicky Victor",
                "href": "/profile/Vincent-Vicky-Victor"
            },
            "answer_text": "Grabbing the ways to work efficiently for the progress of prospects can help when that comes to career. None are perfect, but learning can yield much balanced result. Life - has many abbreviations (one such)  ",
            "date": "Answered May 3, 2018",
            "views": "22",
            "upvotes": " Answer requested by Payal Parmar"
        },
        {
            "author_info": {
                "name": "Subash Cv",
                "href": "/profile/Subash-Cv"
            },
            "answer_text": "Be a passionate learner Work hard & smart Hire a career coach Network ",
            "date": "Answered January 31, 2018",
            "views": "28",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Michael Merrill",
                "href": "/profile/Michael-Merrill-16"
            },
            "answer_text": "Here is another post on the topic that I just responded to that should help you Michael Merrill's answer to How can I increase my chances of getting a promotion at my job? ",
            "date": "Answered June 26, 2016",
            "views": "133",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Samir Ganguli",
                "href": "/profile/Samir-Ganguli-1"
            },
            "answer_text": "By Being passionate about your work.Soaking in all available information, as information is strength in this world.Being honest to yourself.By being compassionate to your colleagues.Lastly, by practicing being a good human being.",
            "date": "Answered May 3, 2018",
            "views": "41",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Preeto Preeto",
                "href": "/profile/Preeto-Preeto-2"
            },
            "answer_text": "Learn about working at Career Accelerate. See who you know at Career Accelerate, leverage your professional network... https://sona451.blogspot.com/2019/02/career-accelerator.html ",
            "date": "Answered February 19, 2019",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Xena Lee",
                "href": "/profile/Xena-Lee"
            },
            "answer_text": "Good specialized skills, excellent work ethic, high reliability, great interpersonal skills. ",
            "date": "Answered May 19, 2018",
            "views": "51",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Derek Sathre",
                "href": "/profile/Derek-Sathre"
            },
            "answer_text": "I overheard my girlfriend’s interpersonal communication class that EQ is really important. More important that IQ even. Build relationships at work. ",
            "date": "Answered November 5, 2019",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chuck Cobb",
                "href": "/profile/Chuck-Cobb-3"
            },
            "answer_text": "There is no universal, standard answer to that question. It depends on what career you are in and what your current strengths and weaknesses are. ",
            "date": "Answered July 30, 2019",
            "views": "7",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Subramaniam Vishwaa",
                "href": "/profile/Subramaniam-Vishwaa"
            },
            "answer_text": "on my view1.love your job2.make your every move simple3.encourage and appreciate everyones efficiency and talent.Page on 4.be honest, ",
            "date": "Answered April 10, 2015",
            "views": "136",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dev Jayakumar",
                "href": "/profile/Dev-Jayakumar-1"
            },
            "answer_text": "Follow your heart… invest your time and upgrade yourself into some profession which will reflect the same enjoyment of your favourite hobby… ",
            "date": "Answered October 4, 2018",
            "views": "128",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nitish Saha",
                "href": "/profile/Nitish-Saha-1"
            },
            "answer_text": "Lots of options.1) Gain experience. Get promoted.2) Switch companies. Earn more.3) MBA4) M.Tech / M.S. ",
            "date": "Answered April 15, 2015",
            "views": "141",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Awadh Nandan Pandey",
                "href": "/profile/Awadh-Nandan-Pandey"
            },
            "answer_text": "Honesty,Sincerity and punctuality will definitely take you to your mission. You will be rewarded by promotion. Thank you ! A.N.Pandey ",
            "date": "Answered January 29, 2019",
            "views": "28",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sana khan",
                "href": "/profile/Sana-khan-1895"
            },
            "answer_text": "First if all clear ur way knw wht i ur destination make a list of prioritites nd pray to your creator for success and work hard ",
            "date": "Answered July 20, 2018",
            "views": "56",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bill Husted",
                "href": "/profile/Bill-Husted-1"
            },
            "answer_text": "The best way to get ahead is to out-perform the expectations of your boss. ",
            "date": "Answered May 19, 2018",
            "views": "37",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Deepak Kumar",
                "href": "/profile/Deepak-Kumar-2620"
            },
            "answer_text": "by systematic planning you need to climb the ladders slowly and steadilly! ",
            "date": "Answered March 18, 2018",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Foster",
                "href": "/profile/John-Foster-2"
            },
            "answer_text": "saying NO. the project damager comes by asking for some changes due on Monday. he has a list of requirements. all of which need to be made from zero or modified from the existing. doing this will take the weekend. instead of saying, “yeah sure…” to be a team player, push back, find out what is really being asked and why. it may be that no changes are actually required. it may be that the changes really have to get done and the PD is all in with you. but you would not know that unless you took a stand for NO. now, repeat after me… just say NO. ",
            "date": "Answered July 30, 2019",
            "views": "28",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Prema P",
                "href": "/profile/Prema-P-1"
            },
            "answer_text": "I have already answered similar questions. Please read them. ",
            "date": "Answered December 10, 2019",
            "views": "39",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dale N Bickenbach",
                "href": "/profile/Dale-N-Bickenbach"
            },
            "answer_text": "Get along with people ",
            "date": "Answered October 6, 2019",
            "views": "8",
            "upvotes": " Answer requested by Jerry Tan"
        },
        {
            "author_info": {
                "name": "Mustafa Hussain",
                "href": "/profile/Mustafa-Hussain-11"
            },
            "answer_text": "Just do it ",
            "date": "Answered November 23, 2016",
            "views": "56",
            "upvotes": "0"
        }
    ]
}