{
    "title": "What are the similarities and differences between Japan and Scandinavia? - Quora",
    "tags": [
        "Similarities and Differences",
        "Culture of Japan"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Röschter",
                "href": "/profile/Michael-Röschter"
            },
            "answer_text": "There is a general similarity in the path taken from rural to modern civilization in the Germanic societies and the Japanese society: Both were cultural late starters which didn't urbanize before 600-1000 ADBoth societies have strong \"village culture\" roots, as compared to \"urban cultures\" like China, Rome, Greece Both Scandinavia and Japan retained much of the village culture as they were never conquered.There was never a conquering elite ruling over a native peasantry.Both partially assimilated a high culture (Roman/Christian versus Chinese/Buddhist) but retained polytheist religious concepts (if you never wondered where the reverence for the saints, virgin mary, the easter bunny, thanks giving, carnival etc came  from, here is your starting point).Their political systems are strongly rooted in consensus building. In both cases this can be traced back directly to the way villages organized in pre-urban times.  ",
            "date": "Answered March 11, 2016",
            "views": "15",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sourabh Mahajan",
                    "user_href": "/profile/Sourabh-Mahajan-3"
                },
                {
                    "user_id": "Umbriel Kalawakan",
                    "user_href": "/profile/Umbriel-Kalawakan"
                },
                {
                    "user_id": "Oyvind Fossheim",
                    "user_href": "/profile/Oyvind-Fossheim"
                },
                {
                    "user_id": "Rizki H",
                    "user_href": "/profile/Rizki-H-1"
                },
                {
                    "user_id": "Patrik Andersson",
                    "user_href": "/profile/Patrik-Andersson-16"
                },
                {
                    "user_id": "Amarsanaa Narmandakh",
                    "user_href": "/profile/Amarsanaa-Narmandakh-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yuji Kishimoto",
                "href": "/profile/Yuji-Kishimoto-1"
            },
            "answer_text": "Japan and Scandinavia countries seem to like each other very much culturally. Scandinavian culture and history seem to display variety of creativity and craftsmanship towards artistic and industrial products both conceptually and technically(technologically). Japanese culture shows Japanese are so confident in technological and in craftsmanship historically, but not necessarily conceptually. Alvaa Aalto(architect), Jean Sibelius(composer), Edward Greak(composer), and Edward Munch(painter) in Scandinavia are all creative and unique internationally. Japanese woodblock painting (ukiuyoe), tea ceremony, flower arrangement, Judo, Kabuki, bunraku puppet show, etc. are all unique and creative, but the concepts of them are not quite original. Both cultures are very keen on “wood furniture and wooden architecture.” ",
            "date": "Answered April 3, 2020",
            "views": "108",
            "upvotes": " Answer requested by Reno Hyde"
        }
    ]
}