{
    "title": "What is a 'target molecule'? - Quora",
    "tags": [
        "Scientific Terminology and Jargon",
        "Molecules",
        "Organic Chemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Mombourquette",
                "href": "/profile/Michael-Mombourquette"
            },
            "answer_text": "That depends on what you’re doing. If you’re a systhesis chemist, then the target is the molecule you are trying to create and you’re trying to use different reactions to get to your target. If you’re doing Mass spec then the molecules are being targeted by the ionization source. If you’re doing biochemistry (developing drug therapies , for example) then certain molecules in the cell identify the cell as bad (sick or cancerous) and companies try to create drugs that react preferentially with that molecule and by association, with that cell. That molecule is the ‘target’ molecule. It’s the target the drug uses to know which cells to react with. ",
            "date": "Answered April 18, 2018",
            "views": "18",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Asia Arain",
                    "user_href": "/profile/Asia-Arain"
                },
                {
                    "user_id": "Adaluz Canseco",
                    "user_href": "/profile/Adaluz-Canseco"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anupam Prakash",
                "href": "/profile/Anupam-Prakash-14"
            },
            "answer_text": "The target molecule is the molecule under investigation. For example in this case, it would mean the molecule you are looking for to help you make a diagnosis. The reporter molecules would bind to the the target molecules (if present) and would help you detect its presence. It's like fishing for the target molecule where the reporter is like the bait and the target molecule is like fish. ",
            "date": "Answered December 24, 2015",
            "views": "35",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shardul Lingwal",
                    "user_href": "/profile/Shardul-Lingwal"
                },
                {
                    "user_id": "Christopher VanLang",
                    "user_href": "/profile/Christopher-VanLang"
                },
                {
                    "user_id": "Yuli Zhang",
                    "user_href": "/profile/Yuli-Zhang-2"
                },
                {
                    "user_id": "Adriana Heguy",
                    "user_href": "/profile/Adriana-Heguy"
                }
            ]
        }
    ]
}