{
    "title": "What is the difference between bulk density and apparent density and when to use those densities? - Quora",
    "tags": [
        "Apparent Density",
        "Bulk Density"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Wilmshurst",
                "href": "/profile/David-Wilmshurst"
            },
            "answer_text": "Density is the mass per unit volume of a substance. That could be, for instance, the mass in kg of a cubic metre of the material. Or gram per litre. Or Troy ounces per cubic cubit, or whatever your preferred units are. Three densities are often considered in my work. Particle density - the mass per unit volume of the particles in a granular material. Like crushed rock, for instance. Usually obtained by cold water immersion, and then weighing above and in cold water. And then use of Archimedes principle. Apparent density - the mass per unit volume of the particles in a granular material, excluding the voids in the material. Like crushed rock, for instance. Usually obtained by boiling water immersion for some hours, and then weighing above and in cold water. And then use of Archimedes principle. Bulk density - the mass per unit volume of a bulk of a material, including the air voids between the particles, and inside the particles. Like the mass of a cubic of crushed rock. Usually obtained by weighing a container of known volume full of the material after a set compaction regime. Note that the last parameter is often determined in the as-received, saturated surface dry (SSD), and oven dry conditions. Those values can be used in concrete mix design, for instance. ",
            "date": "Answered December 28, 2017",
            "views": "126",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ritul Bhasin",
                    "user_href": "/profile/Ritul-Bhasin"
                },
                {
                    "user_id": "Dhiman Jyoti Thakuria",
                    "user_href": "/profile/Dhiman-Jyoti-Thakuria"
                },
                {
                    "user_id": "Sudharshan Vk",
                    "user_href": "/profile/Sudharshan-Vk"
                },
                {
                    "user_id": "Mgcini mg Wata",
                    "user_href": "/profile/Mgcini-mg-Wata"
                },
                {
                    "user_id": "Shewen Eeoh",
                    "user_href": "/profile/Shewen-Eeoh"
                },
                {
                    "user_id": "Mansi Patil",
                    "user_href": "/profile/Mansi-Patil-51"
                },
                {
                    "user_id": "Andrea Di Vita",
                    "user_href": "/profile/Andrea-Di-Vita"
                },
                {
                    "user_id": "Elijah Njuguna",
                    "user_href": "/profile/Elijah-Njuguna-2"
                },
                {
                    "user_id": "Purva Aggarwal",
                    "user_href": "/profile/Purva-Aggarwal-3"
                },
                {
                    "user_id": "Rehaan Rehaan",
                    "user_href": "/profile/Rehaan-Rehaan-10"
                }
            ]
        }
    ]
}