{
    "title": "What is the Big Bang theory, and how does it benefit us? - Quora",
    "tags": [
        "The Big Bang",
        "Big Bang Cosmology",
        "The Universe"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jon Therkildsen",
                "href": "/profile/Jon-Therkildsen"
            },
            "answer_text": "Q: ”… how does it benefit us?” The Big Bang model (it is not a theory) is not really important in terms of immediate benefits. However, the bunch of scientific theories that have led us to this model, and this insight is. They are tremendously important and beneficial. Those theories pretty much define all of our technological progress. Your world would be fundamentally and essentially more primitive than what it is now. You'd have no hope for humanity to ever evolve towards any technological or utopian wonder without them (or equivalent). The primary theories that lead us to this model of modern cosmology are “The General Theory of Relativity,” “Quantum Field Theory” (via “The Standard Model of Particle Physics”), “Friedmann Equations,” the “Hubble–Lemaître law,” and “The Laws of Thermodynamics.” It is somewhat a disservice to mention just these champions, as it is truly a collection of countless theories, theorems, and models. Remove them from our toolbox of prosperity, and we have very little to work with. Btw, the Big Bang model's actual scientific title today is “the cosmological inflation model ” or just “the cosmological model” and is in more recent papers sometimes called the Λ-CDM Model (Lambda Cold Dark Matter Model).  Q: ”…what is the Big Bang…” The conditions behind what is popularly known as the Big Bang, in simplistic terms, comes from extrapolating the current expansion of the cosmos backward in time. Just as we can foresee how the universe will look billions of years from now, or tomorrow, so can we extrapolate back in time, and see how it looked yesterday and the day before that, etc. Compute the numbers, measure the observations, and it shows our observable universe was highly concentrated about 13,8 billion years ago; into an extremely hot and dense space. The model tells us that the observable universe came to be via an unimaginable burst of extreme expansion, otherwise known as the inflation of the universe. Space (and time) expanded rapidly at least doubling its size many times over; from the size of a subatomic particle (in its beginning) to the size of a meatball - almost instantly (faster than the speed of light). However, even if the change was immense, it was not “big” in absolute terms; the size of a meatball is, after all, just the size of a meatball. This expansion or inflation continues to this day, although at a much slower rate. Today the universe is big, but then it was not. For the first 380 000 years after the initial inflation, the universe was too hot and dense for light to shine; it consisted of plasma - an opaque sea of protons, neutron, and electrons. Sort of like a fog of energy and matter, if this can be imagined? Another 400 million years would pass before our universe began to form to what we can recognize today, but it still took another 9 billion years before our Solar system saw its first light. And then another 4.5 billion years before we saw our first light. The age is estimated to be about 13.8 billion years. However, since this beginning expansion of the observable universe, the spread-out size is calculated to have reached about 47 billion light-years in every direction we look today. The most straightforward explanation as to why it is not half of 13.8, for example, is that the expansion keeps expanding - and at tremendous speeds. When we observe light 10 billion years away, it has moved at least 10 billion years further, since it was emitted towards us. Observed light tells us where it was, not where it is - however, we can calculate where it is/where it would be. Compute the numbers, run the models, and the observable (the calculatable) universe is presently estimated to be around 94 billion light-years across today. All of which began its travel 13.8 billion years ago. The Big Bang was not a big bang. It was a rapid inflation or an incredible expansion - from a single point to the size of a meatball to everything we see today. A more befitting label would have been “The Quick Inflation”; not quite as catchy though. ",
            "date": "Answered September 20, 2020",
            "views": "96",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kathryn Breault",
                    "user_href": "/profile/Kathryn-Breault-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jacob Aiken",
                "href": "/profile/Jacob-Aiken-1"
            },
            "answer_text": "The big bang theory is a widely accepted explaination for what our universe was like at its earliest moments. Unlike what is commonly thought is isn't about and does not explain where the universe came from, only what it was like shortly after it came to exist. It states that in tje first moment there was a rapid expansion of energy which came to be the universe. The energy was initially too hot and dance to be anything but hyper compressed energy, or possible a kind of quark super fluid. Eventually it spread and cooled enough for hydrogen atoms to form, which then became the first stars. It benefits us only by giving us knowledge of our origin. It answers questions some people have, and gives us leads on new questions to ask. There isn't any direct benefit from the theory, but research into the theory has led to other discoveries which have had benefits. Although many of those are confined to scientific fields, and aren't necessarily applicable to everyday people. ",
            "date": "Answered September 29, 2018",
            "views": "388",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mark Gallaway",
                    "user_href": "/profile/Mark-Gallaway"
                },
                {
                    "user_id": "Peter Semugenyi",
                    "user_href": "/profile/Peter-Semugenyi"
                }
            ]
        }
    ]
}