{
    "title": "What immoral science experiment came back to haunt a scientist? - Quora",
    "tags": [
        "Immoral",
        "Science Experiments",
        "Experiments",
        "Scientists"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ernesto Gasulla",
                "href": "/profile/Ernesto-Gasulla"
            },
            "answer_text": "After going through all the other answers, I have concluded that nobody has a convincing case of an immoral scientist haunted by his experiments. Let’s make it clear, immoral scientists come a dime a dozen. It’s the haunting part that always fails to materialize. And I’m not surprised. I don’t claim to be a scientist, but I’m an engineer (sort of a “dumb cousin” to scientists) and as such, I’m familiar with the technical view of morality. Which, in a nutshell, is a no-view: most scientists and engineers are blind to morality. Take any technical problem known to mankind. Top engineers and scientists versed in that field would rush to solve it. But only the specific problem posted. Side effects and secondary results are for lower personnel to investigate… if any does. Say it’s the 1930s and you are worried about the future of coal and oil as energy sources: ok, your problem is to find alternative sources, of which nuclear is one, so your task is to create a continuous, controlled nuclear reaction to release enough energy to power large cities. (Since I don’t want to be heavy on the morality of using the atom bomb, I would assume that nuclear energy was investigated only with peaceful purposes in mind… a big lie, I know). The problem was solved, and now we have nuclear energy plants all over the world. Now, the issue of what to do with the continuously forming used (yet still radioactive) nuclear combustible was not paramount to the base question, and as such, was pretty much ignored. A cold, objective analysis of the benefits of nuclear energy vs. the danger of storing huge amounts of radioactive debris could have shown that the idea was not that great after all. But being secondary to the problem to be solved, the nuclear combustible disposal question was not addressed… and realistically, has not been addressed yet (assuming such a thing is possible!) But don’t take my word for it: ask Kurt Vonnegut, America’s prime satirist. In “Cat’s Cradle”, he describes a brilliant scientist, Felix Hoenikker, who was part of the team which created the atom bomb (Vonnegut made this up, but the paralelism with real history is clear), and also invented a substance called ice-nine which can turn unlimited amounts of liquid water into solid ice, by simple contact. Hoenikker, as well as the other scientists described in the book, is amoral. Not as in “against conventional morals”, but as in “unconcerned by any morals”. Eventually, ice-nine accidentally comes in contact with the sea, freezing it instantly and killing (or threatening to kill) all forms of life. BTW, the name of the novel is derived from the “fact” that, as the atom bomb was being dropped in Japan, Hoenikker was playing cat’s cradle (the game played with strings), as in “what atom bomb?” ",
            "date": "Answered August 8, 2019",
            "views": "1",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gia Davis",
                    "user_href": "/profile/Gia-Davis-19"
                },
                {
                    "user_id": "Daniel Braatz",
                    "user_href": "/profile/Daniel-Grant-Braatz"
                },
                {
                    "user_id": "Stephen Mann",
                    "user_href": "/profile/Stephen-Mann-G"
                },
                {
                    "user_id": "Faisal L Kadri",
                    "user_href": "/profile/Faisal-L-Kadri"
                },
                {
                    "user_id": "Riski Rahmani",
                    "user_href": "/profile/Riski-Rahmani"
                },
                {
                    "user_id": "Fikile Lungah",
                    "user_href": "/profile/Fikile-Lungah"
                },
                {
                    "user_id": "Jeremy Shrum",
                    "user_href": "/profile/Jeremy-Shrum"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robin Shannon",
                "href": "/profile/Robin-Shannon-7"
            },
            "answer_text": "QB V11! Queens Bench Courtroom number 7 was a book by Jewish author Leon Uris, which he says the contents and outcome are based on actual events in his family. Unfortunately Uris died in June 2003 and never verified the true identity of the participants. The only clue we have comes from the publisher who says……Mr. Uris, we are told, “has based his story on actual events … a libel suit brought against him by a concentration‐camp doctor in an English court.” It may be fiction but a search of English libel cases, does yield a precedent, and it may be that Uris was detailing his own experience! The book describes the case of famous author ‘Abraham Cady’ who publishes a book entitled ‘The Holocaust’ in which he detailed eminent British surgeon Sir Adam Kelno as having cooperated with the Nazi’s in the concentration camp Jadwiga (Ravensbrúck) during World War 2. Adam Kelno was described by surviving inmates as one of the most sadistic and brutal inmate/doctors. Nobody disputed that Adam Kelno was pressured into doing what he did, the issue was that he became infatuated with what he did and drew strength from the perverse experiments he performed in his attempts to sterilise other prisoners. At the conclusion of World War 2 Kelno (who was a Polish doctor) was granted sanctuary by the Americans in Italy, he was taken to London and tried for cooperating with the Nazi’s and was completely exonerated. He went on the earn for himself a knighthood working in Sarawak and the underprivileged communities along the Thames back in England. Abraham Cady the author some years after Kelno’s knighthood writes a book, ‘The Holocaust’ which becomes a best seller. An extremely outraged Sir Adan Kelno takes a libel action against Cady and over the course of proceedings survivors from the very experiments that Cady detailed were brought forward to give their testimony. As proceedings unfolded Kelno became the villain of the proceedings but still managed to get judgement awarded in his favour. The courts ruling was, he be awarded one half penny…….the lowest value coin in the realm! There is to this day strong speculation that these events were autobiographical on Uris’s part! Cheers……Rob ",
            "date": "Answered November 12, 2019",
            "views": "449",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daniel Braatz",
                    "user_href": "/profile/Daniel-Grant-Braatz"
                },
                {
                    "user_id": "Stephen Mann",
                    "user_href": "/profile/Stephen-Mann-G"
                },
                {
                    "user_id": "Kelsey Chowaniec",
                    "user_href": "/profile/Kelsey-Chowaniec"
                },
                {
                    "user_id": "JT Allen",
                    "user_href": "/profile/JT-Allen-1"
                }
            ]
        }
    ]
}