{
    "title": "What is life-cycle assessment? - Quora",
    "tags": [
        "Life Cycle Assessment",
        "Product Lifecycle Management",
        "Sustainability"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Oroborust",
                "href": "/profile/Paul-Oroborust"
            },
            "answer_text": "Life-cycle assessments A life-cycle assesment or LCA analyses the impact of a manufactured product. The main stages analysed as part of a life-cycle assessment are: making materials for the product from the raw materials neededmanufacturing the producttransport of the product (and raw materials)using the productdisposing of the product at the end of its useful lifeThe life-cycle assessment is a complex process and judgements are not exact. For example, people do not always follow the disposal advice from the manufacturer. Disposal methods may have both drawbacks and benefits. For example, incineration may emit harmful gases into the environment, but the energy released can be used to generate electricity. At each stage a life-cycle assessment considers: use of raw materials (including water)use of energyrelease of waste substances into the envioroment1. Raw materials All the raw materials we need come from the Earth's crust, atmosphere or oceans, or are due to living organisms. Obtaining these materials has an impact on the environment, including: using up limited resources, such as ores and crude oildamaging habitats through quarriying, mining or felling trees2. Manufacture The manufacture of products has an impact on the environment, including: using up land for factoriesproduction of polluting waste (emitted into rivers or the atmosphere)3. Transport The transport of both the final product, and the raw materials used to make it, requires energy. The amount of pollutants released into the atmosphere varies according to the type of transport use and the length of the journeys that have to be made. 4. Use The impact of a product on the environment during its use depends on the type product. For example, a wooden chair has very little impact unless it needs cleaning or repair. On the other hand, a car will have a significant impact. 5. Disposal Most of the rubbish we throw away ends up in landfill sites but there are other methods of disposal. Incinerators can burn polymer waste and use the energy to generate electricity that can then power people's homes. Some materials can be recycled. During recycling, products are broken down into the materials used to make them. These materials can then be used to make something else. Many items can be reused meaning they do not need to be disposed of at all (for example, glass milk bottles). This uses less energy than recycling them. The method of disposal of old products has an impact on the environment, including: using up land for landfill sitesrelease of waste gases during incinerationuse of energy and production of waste substances if the product is recycledreduction in impact if the product is reused Recycling When evaluating whether it is viable to recycle materials it is necessary to consider: balancing the use of the raw materials, such as finite/shortage resources like crude oil or metal ores, with the need to conserve their supplyavailability of the material to be recycledeconomical and practical issues with collecting the materialremoval of impuritiesenergy use for transport and processingenvironmental impact of the processeslevel of demand for the recycled materialRecycling metals Recycling a metal involves collecting used metal items and producing new metal from them. The steps usually needed are: collecting used items and transporting the used items to a recycling centrebreaking up the items and sorting the different metalsmelting the metal and removing impurities from the molten metalsolidifying the metal in ingots (slabs of metal)The ingots can then be used to manufacture new metal items. Advantages of recycling The advantages of recycling compared to producing metals from metal ore include: fewer quarries and mines are neededless noise, dust and heavy traffic are producedsmaller areas of natural habitats are damagedmetal ores are conserved so will last longerIn addition, less energy is usually needed to produce a metal by recycling than is needed to produce it from an ore.  ",
            "date": "Answered September 10, 2020",
            "views": "95",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Self Love",
                    "user_href": "/profile/Self-Love-56"
                },
                {
                    "user_id": "Fafvc Adfe",
                    "user_href": "/profile/Fafvc-Adfe"
                }
            ]
        },
        {
            "author_info": {
                "name": "Han Zhou",
                "href": "/profile/Han-Zhou-23"
            },
            "answer_text": "United Nations Environment Programs (UNEP) defined LCA as following: Life Cycle Assessment (LCA) is a tool for the systematic evaluation of the environmental aspects of a product or service system through all stages of its life cycle. LCA provides an adequate instrument for environmental decision support.” (UNEP, n.d.)  Four Phases of LCA  Goal and Scope Definition - the product(s) or service(s) to be assessed are defined, a functional basis for comparison is chosen and the required level of detail is defined;Inventory Analysis of extractions and emissions - the energy and raw materials used, and emissions to the atmosphere, water and land, are quantified for each process, then combined in the process flow chart and related to the functional basis;Impact Assessment - the effects of the resource use and emissions generated are grouped and quantified into a limited number of impact categories which may then be weighted for importance;Interpretation - the results are reported in the most informative way possible and the need and opportunities to reduce the impact of the product(s) or service(s) on the environment are systematically evaluated.(UNEP, n.d.) Cradle-to-grave Assessment It is the full Life Cycle Assessment from resource extraction ('cradle') to use phase and disposal phase (‘grave') (Dimian, Bildea, & Kiss, 2014). Cradle-to-cradle It is a specific kind of cradle-to-grave assessment, where the end-of-life disposal step for the product is a recycling process. It is a method used to minimize the environmental impact of products by employing sustainable production, operation, and disposal practices and aims to incorporate social responsibility into product development (ECO Mii, 2008). Cradle-to-Cradle Certification The Cradle to Cradle Certified™ Product Standard guides designers and manufacturers through a continual improvement process that looks at a product through five quality categories — material health, material reutilization, renewable energy and carbon management, water stewardship, and social fairness (C2C Certification, 2014). Aeron chair by herman miller is often used as an example of a C2C product.  Why we need LCA? It can be used to: reduce environmental impact and waste,reduce costs,focus product development,support marketing claims,improve product/corporate image and/or identify appropriate performance indicators.creates common metrics that can be compared and shared across company, or with suppliers and partnersSustainability developmentReference: UNEP. Life cycle assessment. Retrieved November 17, 2016, from United Nations Environment Programme, http://www.unep.org/resourceefficiency/Consumption/StandardsandLabels/MeasuringSustainability/LifeCycleAssessment/tabid/101348/Default.asp Dimian, A. C., Bildea, C. S., & Kiss, A. A. (2014). Integrated design and simulation of chemical processes (2 Edition ed.). Edinburgh, United Kingdom: Elsevier Science. ECO Mii. (2008). Cradle-to-cradle definition - an encyclopedia of environmental terms and topics from ecomii ecopedia. Retrieved November 17, 2016, from ECO Mii, http://www.ecomii.com/ecopedia/cradle-to-cradle C2C Certification. (2014). C2C product certification overview - get certified - cradle to cradle products innovation institute. Retrieved November 17, 2016, from C2C Certification, http://www.c2ccertified.org/get-certified/product-certification ",
            "date": "Answered November 17, 2016",
            "views": "23",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Self Love",
                    "user_href": "/profile/Self-Love-56"
                },
                {
                    "user_id": "Dhirender Bisht",
                    "user_href": "/profile/Dhirender-Bisht-1"
                },
                {
                    "user_id": "Mikela Pryor",
                    "user_href": "/profile/Mikela-Pryor"
                },
                {
                    "user_id": "Dirk Patze",
                    "user_href": "/profile/Dirk-Patze"
                },
                {
                    "user_id": "Rodrigo Castro",
                    "user_href": "/profile/Rodrigo-Castro-35"
                },
                {
                    "user_id": "Umamageswari T",
                    "user_href": "/profile/Umamageswari-T"
                },
                {
                    "user_id": "Corey Davis",
                    "user_href": "/profile/Corey-Davis-75"
                },
                {
                    "user_id": "Utamiria Dwi Kartika",
                    "user_href": "/profile/Utamiria-Dwi-Kartika"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Sullivan",
                "href": "/profile/Tom-Sullivan-25"
            },
            "answer_text": "LIfe cycle assessment is analyzing the production, destruction, and disposal of a product, 'from cradle to grave.' It is a way of analyzing a product as if it lived a life. You can look at this assessment in a series of steps. Step 1- Extraction (Sperm Meets Egg): You start by breaking apart the product into its component parts and analyze where they came from. Every product on Earth is created by the Earth in some way, and extracted from mining or grown by agriculture.  Step 2- Processing into useful parts (Fetus growing in the womb): Once these base components, such as aluminum or wood are extracted, they are taken somewhere, usually a factory, to be processed into useful parts.Lumber is cut into 2x4's, aluminum is melted down and fitted into pipes...etc.  Step 3- Product Formation (Birth): From the place of processing, these base materials that are now in useful shapes and sized are brought to another place to be assembled into an actual product. This could be simply pieces of wood made into a desk, or it could be hundreds of tiny pieces of metals and plastics formed into a computer. Step 4- Product Life (Adult life): Now the final product is packaged and delivered somewhere, either a store to be bought or directly to a customer or business. Here it lives out its useful life, which could be 6 months or could be 50 years, depending on the product. Step 5- Product Disposal (Death)- The product has reached the end of its useful life, and must be disposed of somehow. There are many ways to do this depending on the product. It could be donated to charity to be stripped for parts, it could go to a landfill to rot, it could be recycled into raw materials for a new product. It all depends on what it is. This assessment can be used for many different aspects of product analysis such as the environmental impacts, carbon footprints, costs of production, and best practices for disposal.  Life cycle assessments are most often considered when analyzing a product for sustainability. ",
            "date": "Answered April 2, 2014",
            "views": "894",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Self Love",
                    "user_href": "/profile/Self-Love-56"
                },
                {
                    "user_id": "Paul Oroborust",
                    "user_href": "/profile/Paul-Oroborust"
                },
                {
                    "user_id": "Dhirender Bisht",
                    "user_href": "/profile/Dhirender-Bisht-1"
                },
                {
                    "user_id": "Suryateja D",
                    "user_href": "/profile/Suryateja-D"
                },
                {
                    "user_id": "Bhagirath Singh",
                    "user_href": "/profile/Bhagirath-Singh-17"
                },
                {
                    "user_id": "Tushar Kulkarni",
                    "user_href": "/profile/Tushar-Kulkarni-10"
                },
                {
                    "user_id": "Ivica Podnar",
                    "user_href": "/profile/Ivica-Podnar"
                },
                {
                    "user_id": "Ajay Ranjith V",
                    "user_href": "/profile/Ajay-Ranjith-V"
                }
            ]
        }
    ]
}