{
    "title": "What are some photos that prove physics in real life? - Quora",
    "tags": [
        "Physics (college minor)",
        "Physics of Everyday Life",
        "Photographs",
        "Photography",
        "Science",
        "Physics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nav Gyan",
                "href": "/profile/Nav-Gyan-3"
            },
            "answer_text": "Physics.” In fact, Physics governs our everyday lives in one way or the other. Let’s have ten examples of Physics in everyday life:  The buzzing sound of an alarm clock helps you wake up in the morning as per your schedule. The sound is something that you can’t see, but hear or experience. Physics studies the origin, propagation, and properties of sound. It works on the concept of Quantum Mechanics. 2. Steam Iron  Right after you wake up in the morning and start preparing for your school/office, you need an ironed cloth, and that’s where Physics comes into play. The steam iron is such a machine that uses a lot of Physics to make it go. The foremost principle of Physics used in the steam iron is “Heat.” Heat, in Thermodynamics, is a type of energy transfer from a warmer substance to a colder one. Ironing works by having a heated metal base- the soleplate. 3. Walking   Now, when you get ready for your office/school, whatever medium of commutation is, you certainly have to walk up to a certain distance. You can easily walk is just because of Physics. While you have a walk in a park or on a tar road, you have a good grip without slipping because of a sort of roughness or resistance between the soles of your shoes and the surface of the road. This resistance, which is responsible for the grip, is called “Friction” or “Traction.” However, when a banana peel comes under your foot, you suddenly fall. Now, what makes you fall? Well, it’s due to the reduced friction between your shoes and the surface of the road because of the slippery banana peel. 4. Ball Point Pen   Whether you are at your workplace or in your school, a Ball Point Pen is your weapon. Had Physics not been there, you would not have able to write with a Ball Point Pen on a paper. In this case, the concept of gravity comes into play. As your pen moves across the paper, the ball turns and gravity forces the ink down onto the top of the ball where it is transferred onto the paper. 5. Headphones/Earphones   When you get tired of work or studies, listening to music comes handy. Have you ever thought how does your headphone/earphone work? Well, it’s again because of Physics. The concept of magnetism and sound waves are involved in the science of your headphone/earphone. When you plug your headphone/earphone into an electrical source, the magnet in your headphone/earphone creates an electromagnetic field, which ultimately results in sound waves. 6. Car Seat-Belts   Have you ever noticed that on which principle does your car seat-belt work? Well, it’s again Physics. When you tighten your car seat-belt, it works on the concept of “Inertia.” Inertia is unwillingness or laziness of a body to change its state of rest or motion. In case of a car collision, your seat-belt helps prevent your body from moving in a forward direction; as your body resists being stopped because of inertia of motion. 7. Camera Lens 8.cell phone 9.Battries Via:-StudiousGuy - Your Study Buddy   ",
            "date": "Answered June 30, 2020",
            "views": "567",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dhruv Yadav",
                    "user_href": "/profile/Dhruv-Yadav-232"
                },
                {
                    "user_id": "Pallavi Ray",
                    "user_href": "/profile/Pallavi-Ray-6"
                },
                {
                    "user_id": "Nicky Mathur",
                    "user_href": "/profile/Nicky-Mathur"
                },
                {
                    "user_id": "Sam",
                    "user_href": "/profile/Sam-9656"
                },
                {
                    "user_id": "Manthan Chheda",
                    "user_href": "/profile/Manthan-Chheda-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeevan Reddy Gajjala",
                "href": "/profile/Jeevan-Reddy-Gajjala"
            },
            "answer_text": " ",
            "date": "Answered June 30, 2020",
            "views": "76",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Nicky Mathur",
                    "user_href": "/profile/Nicky-Mathur"
                }
            ]
        }
    ]
}