{
    "title": "What black hole hypothesis or theory do you believe is correct? - Quora",
    "tags": [
        "Hypotheses",
        "Black Holes",
        "Theory and Theories",
        "Cosmology",
        "Astrophysics",
        "Astronomy",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Ferraro",
                "href": "/profile/Robert-Ferraro-14"
            },
            "answer_text": "That black holes do not exist. There is no pulling force in the universe. It defies the laws of physics since there is no power source. Yes, from 30 million light years away it can look like everything is being sucked in. That’s not sufficient evidence. Our universe is alive and animated by a tiny exponential expansion inherent in all atoms. We cannot see and detect because we are made of the same expanding matter. This expansion causes celestial bodies such as our earth to expand at the surface at a rate, in earth’s case, of 9.8 m/s/s. Everything we see and feel as gravity is merely instantaneous relative geometry. An illusion of sorts. With all this expansion, at the center of a galaxy is where a lot of colliding of massive stars is occurring due to this expansion. The center is not a negative energy region (black hole) but instead a zero energy region. Not too dissimilar to the eye of a hurricane. The immense destruction causes radiation to spew out at 90 degrees hence the radiation jets shooting out from the center of galaxies. The existence of these jets would contradict the theory that nothing can escape black holes. Most importantly the event horizon is not a science fiction portal to another dimension or universe. It’s the edge of that no energy zone right at the center, just like the edge of the eye of a hurricane. The energy profile of a spiral galaxy is very similar to a hurricane. ",
            "date": "Answered September 4, 2019",
            "views": "367",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ruud Loeffen",
                    "user_href": "/profile/Ruud-Loeffen"
                },
                {
                    "user_id": "Alexander Lind",
                    "user_href": "/profile/Alexander-Lind-12"
                },
                {
                    "user_id": "Sebastian Orellana",
                    "user_href": "/profile/Sebastian-Orellana-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alan McDougall",
                "href": "/profile/Alan-McDougall-3"
            },
            "answer_text": "Theories good theories are based on good observable facts but until proved remain just that a Theory? The science surrounding the Big Bang scenario is huge and cannot be condensed or consolidated into a few paragraphs! Here is just one example of that? The no-hair conjecture postulates that once Black Hole achieves a stable condition, after formation, it has only three independent physical properties: mass, charge, and angular momentum? A Black Hole is otherwise featureless. If the conjecture is true, any two black holes that share the same values for these properties, or parameters, are indistinguishable from one another. The degree to which the conjecture is true for real black holes under the laws of modern physics is currently an unsolved problem. For more information click on the link below? Black hole - Wikipedia ",
            "date": "Answered September 5, 2019",
            "views": "34",
            "upvotes": " Answer requested by Sebastian Orellana"
        }
    ]
}