{
    "title": "What happens when ethanol is mixed with water? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Martin Carr",
                "href": "/profile/Martin-Carr-15"
            },
            "answer_text": "There is no chemical reaction between ethanol and water. However there is an interaction. Alcohol and water are both excellent solvents using hydrogen bonds to dissolve the solute. If you add water to alcohol, the mixture would be a solution of water in alcohol. Conversely if you add alcohol to water, you have a solution of alcohol in water. It is a moot point as to which is the solute and which is the solvent, but typically the chemical in greatest quantity is considered the solvent and the least quantity is the solute. The reason we know that this is a mixture (solution) is because, while mixed, the mixture has the chemical properties of both substances. Also the two can easily be separated by physical processes. Because of the strength of the hydrogen bonds, distillation alone is not sufficient to completely separate the mixture as a constant boiling (azeotropic) mixture forms which has a constant percentage of about 4.4% water by mass. The remaining water is removed by adding a desiccant such as anhydrous calcium sulfate which absorbs the remaining water and leaves the alcohol dry. If pure, dry, ethanol is required for storage then the desiccant would be stored with the alcohol since each time the bottle is opened, water from the atmosphere is absorbed. Storage like this would be unusual since if water would result in a side reaction, such as with thionyl chloride for example, the alcohol can always be dried just before use. Calcium sulfate may be sparingly soluble in water, but it is totally insoluble in alcohol and the water is trapped firmly in the crystal lattice of the calcium sulfate. ",
            "date": "Answered April 10, 2019",
            "views": "214",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Carl Perfecto",
                    "user_href": "/profile/Carl-Perfecto"
                },
                {
                    "user_id": "David Jonsson",
                    "user_href": "/profile/David-Jonsson-4"
                },
                {
                    "user_id": "Ferdos Alam",
                    "user_href": "/profile/Ferdos-Alam-1"
                },
                {
                    "user_id": "Debangshu Chakrabarti",
                    "user_href": "/profile/Debangshu-Chakrabarti-1"
                },
                {
                    "user_id": "Christopher Scotts",
                    "user_href": "/profile/Christopher-Scotts"
                },
                {
                    "user_id": "Erik Pearson",
                    "user_href": "/profile/Erik-Pearson-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Hoffman",
                "href": "/profile/William-Hoffman-60"
            },
            "answer_text": "If you get back what you put in, it’s often concluded you did no reaction, but I disagree and it’s not just some recherche view. It may surprise some, but you can’t just get the water back, or the ethanol, as might happen with salt and water, whereby distilling the water, leaves behind the salt. 200 proof alcohol (100% EtOH) burns, not just in combustion, but on consumption, so something must have happened. Chemistry is about changes. Solid precipitate, color changes, heat released or taken, are all symptoms of such changes. Adriano dePiero noted such. Whiskey, vodka, gin, are about 40% EtOH/H2O (80 proof, where “proof” is a measure of combustibility in combination with gunpowder). If you distill water, it goes through phase changes, but the H2O is recognizable at all phases, vapor or condensate. If you distill aqueous ethanol, the mixture will distill at some lower temperature, lower than either ethanol (78C) or water (100C), and it means there is an affinity for ethanol and water (azeotrope). Is it a permanent change? No. But all changes can be reversed by input of energy, afaik, and some of the ideas suggest there’s something special, non-chemical, about these kinds of changes. Melting is likely a better example of a pure physical change, but if you melt silver and mix it with melted gold, the alloy is a new thing, and not “merely” a solid solution. ",
            "date": "Answered March 12, 2019",
            "views": "95",
            "upvotes": "0"
        }
    ]
}