{
    "title": "What is metaphysical certitude as a concept? - Quora",
    "tags": [
        "Metaphysics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nathan Coppedge",
                "href": "/profile/Nathan-Coppedge"
            },
            "answer_text": "I think I have used the term in place of metaphysical 'certainty-tude’ to mean confidence in one's sense of existence. In the high sense of the term it does not imply spiritual weakness at all, but more like degrees of metaphysical realistic-ness. In the low sense of the term it is a humorous way of suggesting that one may have a spiritual weakness, but one has probably mastered it. That was what I was thinking anyway one of the only times I used it. It is an awkward term to use, but understanding that it is only used when necessary makes it easier to understand. It goes under 'deeply philosophical words that sound bad but are actually quite useful’ which is a category that has a long pedigree. Therefore, the intuition is that it is a very boring term used as a last resort, or when one doesn't have a really good idea. This is my attempt to be comprehensive about what it means. I'm even convinced the religious meaning is similar when reduced to secular meaning or put in an analytic context. In many cases the analytic meaning reduces merely to degrees of realistic-ness and an ability to ignore or un-ignore it. Then more fanciful terms explain what the author is actually saying. Keep in mind, I have a very pared-down and disillusioned view of academic writing. I don't think writers entertain unless they're writing aphorisms. Aphorisms are at least capable of making points (if you're good). The disillusioned 'good and evil’ of academics is just realizing if the author is making a point or not. It seems like 90% of philosophy books which should be good (like Ricoeur, for instance, or Popper) simply reduce to skepticism, badly attempted brilliance, wind-baggedness, or a complete failure at the aphorism which can be even worse than the previous three. ",
            "date": "Answered August 8, 2017",
            "views": "846",
            "upvotes": " Answer requested by Michael Pevey",
            "upvoters": [
                {
                    "user_id": "Adhiraj Chattopadhyay",
                    "user_href": "/profile/Adhiraj-Chattopadhyay"
                },
                {
                    "user_id": "Michael Pevey",
                    "user_href": "/profile/Michael-Pevey"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Bailey",
                "href": "/profile/John-Bailey-43"
            },
            "answer_text": "Descartes’ “Cogito ergo sum.”expressed his certitude on metaphysical grounds that he existed. Today, his conclusion can be easily disassembled but it compares favorably with certitudes expressed by Spinoza. Spinoza offers proof of the existence of God with a metaphysical argument. Surveying modern grounds for certitude, three grounds are used: experimental demonstrationmathematical proofreligious faithIf metaphysics is a fourth ground, my two favorite philosophical encyclopedias failed to reveal it. Experimental demonstration offers absolute certainty only when the experiment proves conclusively that a hypothesis cannot be true. Otherwise, Bayesian statistics offers the freedom to achieve successively higher certainty if positive results support an hypothesis. Mathematical proof provides assurance of the truth of statements but only within the limitations of the axioms on which they are based. Goedel’s theorems warn that ultimately inconsistencies will arise. Religious faith may claim absolute certainty based, nonetheless on subjective or spiritual experience. ",
            "date": "Updated August 10, 2017",
            "views": "22",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Moore",
                    "user_href": "/profile/David-Moore-408"
                },
                {
                    "user_id": "Susan Hadlow",
                    "user_href": "/profile/Susan-Hadlow"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ingrid Harris",
                "href": "/profile/Ingrid-Harris-3"
            },
            "answer_text": "Catholic Dictionary Term METAPHYSICAL CERTITUDE Definition Infallible assent of the mind to a proposition. It is recognized as necessarily true because the affirmation is based on the unchangeable principles of being, e.g., the principle of contradiction. ",
            "date": "Answered August 7, 2017",
            "views": "634",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Rosa Lichtenstein",
                "href": "/profile/Rosa-Lichtenstein"
            },
            "answer_text": "The Short answer: self-delusion. The long answer: Why_all_philosophical_theories_are_non-sensical ",
            "date": "Updated January 24, 2019",
            "views": "225",
            "upvotes": " Answer requested by Michael Pevey"
        }
    ]
}