{
    "title": "What's the science behind magic eye pictures? - Quora",
    "tags": [
        "Scientific Explanations",
        "Magic (illusion)",
        "Eyesight",
        "Science of Everyday Life",
        "Eyes",
        "Photographs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Adrian Mudd",
                "href": "/profile/Adrian-Mudd-2"
            },
            "answer_text": "As most people are beginning to understand, an eye is not a camera. It is part of a computer called a brain. You may have read or heard of the work in AI (artificial intelligence) trying to teach computers to recognise objects in a scene and build up an internal 'model’ of that scene, something that self driving cars will have to do in order to navigate - is it a pedestrian or a bollard or an oncoming motorbike? This is massively complex computing and is something our brains are really good at. Analysing the shapes and colours our eyes pick up and assigning them as objects with size and position. Whatever we look at, however strange and unfamiliar, our eyes try to interpret as known objects. So those pictures simply contain clues which it is possible for our subconciouse to interpret as known objects. These clues are disguised from our concious 'intelligence' by loads of meaningless distracting patterns, but if we let our primal subconscious loose, it sometimes picks up those clues despite our intelligent efforts, and we 'see' the elephant. Except we don't, we just get the information passed by the subconscious that the Ely is there. But just try to pin it down, try to draw it's outline, oh dear. ",
            "date": "Answered January 4, 2020",
            "views": "148",
            "upvotes": " Answer requested by Octavio Moreno"
        },
        {
            "author_info": {
                "name": "Michael Bross",
                "href": "/profile/Michael-Bross-3"
            },
            "answer_text": "Answered here: Why does crossing your eyes help you see 3D images?Michael Bross, ",
            "date": "Answered January 3, 2020",
            "views": "121",
            "upvotes": " Answer requested by Octavio Moreno"
        }
    ]
}