{
    "title": "What are checkpoints? Why are they important in the cell cycle? - Quora",
    "tags": [
        "CheckPoints",
        "Cell Cycle",
        "Cells (biology)",
        "Cell Biology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ivan Tod",
                "href": "/profile/Ivan-Tod-1"
            },
            "answer_text": "Checkpoints are stages in the eukaryotic cell (cells with clearly defined nuclei) cycle at which point the cell examines internal and external cues and \"decides\" whether or not to move forward with division. Checkpoints are very important in that they provide the cell with information such as whether or not the DNA has been compromised, proper nutrition levels for energy needs etc., that pertains to the process of cell division. Each checkpoint contains the “next level” of information that helps the cell determine if it should continue on the road to dividing. For a more extensive answer: Khan Academy ",
            "date": "Answered November 10, 2017",
            "views": "11",
            "upvotes": " Answer requested by Rehema Alex",
            "upvoters": [
                {
                    "user_id": "Ronnie Angeles",
                    "user_href": "/profile/Ronnie-Angeles-3"
                },
                {
                    "user_id": "Khaing Kyaw Lin",
                    "user_href": "/profile/Khaing-Kyaw-Lin"
                },
                {
                    "user_id": "ANITA GHOSH",
                    "user_href": "/profile/ANITA-GHOSH-36"
                },
                {
                    "user_id": "Bhargab Roy",
                    "user_href": "/profile/Bhargab-Roy-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Danna Soler",
                "href": "/profile/Danna-Soler"
            },
            "answer_text": "Checkpoints are when the cell checks to see if there any mistakes throughout the cell cycle. They occur at the ends of the G1 and G2 phases, and before cytokinesis. If the cell does not go through a checkpoint, or does not detect a change, it is possible that the cells it will divide into will inherit a harmful mutation such as the one which causes unrestricted cell division, or cancer. ",
            "date": "Answered November 11, 2017",
            "views": "15",
            "upvotes": " View 4 Upvoters "
        }
    ]
}