{
    "title": "What are some cool science DIY projects that a high schooler could do? - Quora",
    "tags": [
        "Do It Yourself (DIY)",
        "The High School Experience",
        "List Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ed Nash",
                "href": "/profile/Ed-Nash-9"
            },
            "answer_text": "Depends on your interests. You can do many science experiments. Chemistry:Electrolysis. You can actually do this at home. Take 2 pencils, strip a bit of the wood at both ends to expose the graphite lead. Wind wire around one end of both pencils to act as leads. Insert the pencils with non wired end in a glass beaker with solution. Connect the wires to a 9V battery cell. You can use different color pencils for anode and cathode and simple salt solution. You'll see bubbles rising in the water due to electrolysis.Flame tests are always fun. Different chemicals burn with different colors. You could coat matchstick heads in your lab with these chemicals and light them to get colored match flames.BiologyYou could grow a plant unfer different conditions and note the speed.You could grow a plant and try your hand at grafting, budding etcPhysicsYou can combine geography and physics. You could build a replica of a damn or river. Connect a powerful pump to push water out with force. Take the motor out of a toy RC car or buy a 5V DC motor. Connect the DC motor to an LED bulb with wires such that bulb is away from water. Make turbine blades to spin the motor with the water(small spoons attached well enough to withstand force), and see the bulb glow. Alternately make a wind turbine instead if wasting water and electricity and blow air from your mouth.Will be happy to provide schematics if needed for any. ",
            "date": "Answered May 26, 2016",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cassy Phillips",
                    "user_href": "/profile/Cassy-Phillips"
                },
                {
                    "user_id": "Frieda Vizel",
                    "user_href": "/profile/Frieda-Vizel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Meenal Gupta",
                "href": "/profile/Meenal-Gupta-138"
            },
            "answer_text": "With the usage of technology in the Education sector, a new type of STEM-based learning is drawing the attention of many who believes in the notion of learning by doing. Many EdTech startups are using cool science DIY projects that can help to improve the learning ability of the children. What are Science DIY projects? These educational toys are much more superior than normal toys. They teach students the various concepts related to STEM learning and make your child an innovator of tomorrow. These Educational toys target the kid's age 8-16 since it is the age where the child can nurture many useful skills. These cool science DIY science projects are easy and interactive. Although there are many wonderful types of cool science DIY projects I am sharing with you only 7 most basic ones so you can get the basic idea of how these are like. The Cool Science Projects which are based on Chemistry are: 1. Decoding the mystery of colors Many kids are fascinated with colors. Using this kit you need to decode the mystery related to colors. The kit is user friendly and helps you in getting ready in the art of learning-by-doing. 2. Balloon Burst Mystery Using this cool science DIY kit your child will be able to learn about the concept of hydrophobic & Hydrophilic. All the equipment is inside the kit. 3. Verifying whether solid or liquid With the help of this kit, your child will learn about the different states of matter. Also, your child will learn how starch molecules will work and act as semi-solid within the liquids. 4. Color Changing CO2 Experimenting with this kit your child will get an idea about the acidic and basic behaviors. This is a very fun learning experience and your child will learn a lot of cool concepts of chemistry with this kit. The Cool Science Projects Based on Physics Are: 5. Density Column This kit will teach children about the concept of insolubility by mixing oil with that of water. This real-life experiment will create a strong foundation in a child's mind about the physics concept. 6. Iron Floating Problem This cool DIY kit will help you in teaching the concept of surface tension and the properties of water in a simple and easy manner. 7. Photon Food This cool DIY science kit will help your kids understand the concept of photosynthesis quite well to your kids. Thank you for reading! I hope I am able to give answer your question! Stay Healthy! ",
            "date": "Answered April 1, 2020",
            "views": "145",
            "upvotes": "0"
        }
    ]
}