{
    "title": "What does an enzyme catalyzed reaction mean? - Quora",
    "tags": [
        "Catalyzed Reaction"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mykia Washington",
                "href": "/profile/Mykia-Washington"
            },
            "answer_text": "Chemical reactions can be sped up in a number of ways. One of them is by using a catalyst. The catalyst aids the reaction but it does not show up as a reaction or product. It is a separate entity that make the reaction move much faster than it would normally. Enzymes are the name for biological catalysts. They are proteins that bind to a specific molecule because they are shaped uniquely for that molecule. An enzyme can break down because of heat (called denatured). The heat causes the molecules of the enzyme to move around more ao the intermolecular forces that create the shape of the enzyme no longer do their job. ",
            "date": "Answered February 23, 2016",
            "views": "14",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Frank Carr",
                    "user_href": "/profile/Frank-Carr-12"
                },
                {
                    "user_id": "Cuylar Conly",
                    "user_href": "/profile/Cuylar-Conly"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vivek Rai",
                "href": "/profile/Vivek-Rai-5"
            },
            "answer_text": "In simple terms, it means that the enzyme helped carry out the reaction in some way. If a reaction occurs at a speed X without any help of other species, enzyme catalysis can make it several folds faster - anywhere between 100X to 10000X. Of course, Wikipedia (Enzyme) and other (How Enzymes Work) resources are always there for further information! ",
            "date": "Answered February 22, 2016",
            "views": "12",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cuylar Conly",
                    "user_href": "/profile/Cuylar-Conly"
                },
                {
                    "user_id": "Cristian Montes de Oca",
                    "user_href": "/profile/Cristian-Montes-de-Oca-1"
                },
                {
                    "user_id": "Khaled Mahmoud",
                    "user_href": "/profile/Khaled-Mahmoud-40"
                }
            ]
        }
    ]
}