{
    "title": "What causes rivers to bend? - Quora",
    "tags": [
        "Rivers",
        "Geology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Maley",
                "href": "/profile/Steve-Maley-1"
            },
            "answer_text": "I beg to differ with Evan’s answer. Have you ever noticed how water runs from the roof of your car, down the windshield as you exit a car wash? Does it run in a straight line, which would be the path of least resistance? No, it naturally runs a curvy path, even across a featureless, smooth, steeply sloping surface. Fluid flow is complex. Past a certain velocity, it transitions from laminar to turbulent flow. Older readers may remember how smoke flows straight up from a burning cigarette, then abruptly changes to a curvy plume of smoke. A river running downhill on a plane will not flow in a straight line. It will find a curvilinear path characteristic of rivers: e.g. the lower Mississippi. On the outer part of a bend, the river’s velocity is faster == more erosion. On the inner part of the bend, the river is slower. Heavier particles eroded from the previous bend are deposited, often as a sand bar. This causes the course of the river to bend even more. Eventually, the cut bank will find a short cut and leave an oxbow lake. More here: Meander - Wikipedia ",
            "date": "Answered February 9, 2017",
            "views": "262",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jeff Hawkins",
                    "user_href": "/profile/Jeff-Hawkins-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jitan Dahal",
                "href": "/profile/Jitan-Dahal"
            },
            "answer_text": "When the river flows in relatively low flat lands, it will have not much energy left to move rapidly as it does in the highlnds due to the combined morphology and slope factor. The river has three stages initially it scraps anything on its way. It has scouring effect. Secondly, it deposits. And third one is braided nature, characterized by the formation of root like structures of the water streams on the sand base. With the course of time and velocity river deposits the carried materials from uplands. In second stage is it has very few energy left in itself that it starts depositing the carried materials on its bank. This leds the change in velocity in the opposite bank itself. The lower velocity side will have deposition than other bank where cutting is prone. This process continues for very long time before the pattern of flow is fixed. ",
            "date": "Answered March 2, 2017",
            "views": "196",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Prakash Gautam",
                    "user_href": "/profile/Prakash-Gautam-38"
                },
                {
                    "user_id": "Bhabishya Luitel",
                    "user_href": "/profile/Bhabishya-Luitel"
                },
                {
                    "user_id": "Miguel Henriques",
                    "user_href": "/profile/Miguel-Henriques-2"
                }
            ]
        }
    ]
}