{
    "title": "What are the best talent show ideas? - Quora",
    "tags": [
        "Talent Shows"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ramey Zamora",
                "href": "/profile/Ramey-Zamora"
            },
            "answer_text": "Know what I'd love to do?  Get an audience to join in by singing a refrain in a song. The song I was thinking of is \"Willow Tit Willow\" from Gilbert and Sullivan's \"Mikado.\"  The lyrics include several repetitions of the phrase \"Willow, tit willow, tit willow\" and the song itself is a \"humorous\" one from the 19th century about a little bird who is so unhappy at being rejected by his lover that he jumps into the water and drowns his little self.  I'd give the audience a background as to why KoKo is singing it and to whom in case the subject matter bothers anybody,  Google it to learn the story and to hear this song performed.   Of course there are many other songs (perhaps a bit less poignant) that you can do this with. The other fun thing to do with an audience is teach them to sing a round.  A round is where you divide the audience into sections (usually three?) and each section sings the exact same melody and words but they each start at different times which you indicate.  \"Row, row, row your boat\" is one of them but there are many others.  In \"Row\" each section starts when the previous section has finished the first phrase and you just keep on doing it until you signal each section to stop after the last phrase (\"Merrily, merrily, merrily, merrily.  Life is but a dream\").  Stop the sections in the same order you started them in.  People really love doing this. Have fun and good luck in your talent show! ",
            "date": "Answered February 6, 2016",
            "views": "168",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Justin Dol",
                    "user_href": "/profile/Justin-Dol"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jill Carroll",
                "href": "/profile/Jill-Carroll-4"
            },
            "answer_text": "Here’s one idea. Get a group of your friends, a total of about 8, to join you in a faux synchronized swimming skit. It isn’t difficult, doesn’t require much in the way of costumes, scenery, or props, and is very entertaining. I think it would be a lot of fun to perform. You can view a group of 5h grade boys doing so for their school’s talent show:  It’s a riot and I’m sure you and your friends can think of ways to make it even better. The music they used (Blue Danube) is not only very fitting, but because it was composed so long ago, the copyright has long since expired so you can use it for free. Good luck! ",
            "date": "Answered June 3, 2016",
            "views": "193",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vus D",
                    "user_href": "/profile/Vus-D"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sankara Saranam",
                "href": "/profile/Sankara-Saranam"
            },
            "answer_text": "It’s an election year. Why not dress and do a skit, where you are accepting the nomination for presidency of a major political party? “I humbly accept your nomination as the next President of the United States.” You just need two things. A couple of friends with “Applause” signs to the far right and left of you. And a flag of the US and a flag of your state behind you. Then, be yourself as you lay out what you will do as president. Me, I’d do something politicians don’t do: talk about climate change and only climate change.  Please Subscribe! https://www.youtube.com/c/Permanentwavestv?sub_confirmation=1 You can ask questions on my YouTube channel, PermanentWavesTV, or #AskDrunkJesus. Multi-award winning author: Permanent Waves, Vol I: Indriya, an Epic Mystical Sci-Fi Series: http://amzn.to/2abjNpJ God Without Religion: Questioning Centuries of Accepted Truths http://amzn.to/29l9eUY ",
            "date": "Answered July 31, 2016",
            "views": "18",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Letta Gaming",
                    "user_href": "/profile/Letta-Gaming"
                },
                {
                    "user_id": "Andrew Laughton",
                    "user_href": "/profile/Andrew-Laughton"
                },
                {
                    "user_id": "Leo Aj",
                    "user_href": "/profile/Leo-Aj-3"
                },
                {
                    "user_id": "R Prasanth Kumar",
                    "user_href": "/profile/R-Prasanth-Kumar-1"
                },
                {
                    "user_id": "Ashwin S Selvarajan",
                    "user_href": "/profile/Ashwin-S-Selvarajan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Clarence Sherrick",
                "href": "/profile/Clarence-Sherrick"
            },
            "answer_text": "The “coolest” thing anyone can do for any talent show, is to be so good, so unusual or so exceptional that the judges are blown away. Mediocrity is an absolute no-no. For nothing bores a judge more. Something that does have an exceptional affect is for you to appear so average, inept, old or bumbling, when the judges first view you; that they are totally unprepared for what you actually are capable of. To the point that they are completely shocked (in a good way) by your performance. A magnificent voice, flawless or unusual presentation, and a never before seen capability go a long way. Costuming may help but it is talent that ultimately impresses. ",
            "date": "Answered July 15, 2016",
            "views": "145",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kiarash Yadollahi",
                    "user_href": "/profile/Kiarash-Yadollahi"
                },
                {
                    "user_id": "Diana Folsom",
                    "user_href": "/profile/Diana-Folsom-1"
                },
                {
                    "user_id": "Nick Kasper",
                    "user_href": "/profile/Nick-Kasper-4"
                },
                {
                    "user_id": "Sven Clanzett",
                    "user_href": "/profile/Sven-Clanzett"
                },
                {
                    "user_id": "Saumya Sharma",
                    "user_href": "/profile/Saumya-Sharma-46"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wendy",
                "href": "/profile/Wendy-987"
            },
            "answer_text": "You could Dress like your favorite comedian and do one of their acts, Pretend to be one of your favorite teachers that has a sense of humor, If you are good doing impressions,  group of friends do a part from a movie, or you do a part from a movie. Sing. Dance. Twerk. lol. or Try Lip singing.  ",
            "date": "Updated May 6, 2018",
            "views": "112",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Oliver Presta",
                "href": "/profile/Oliver-Presta"
            },
            "answer_text": "I know lip syncing is a thing... ",
            "date": "Answered January 18, 2016",
            "views": "42",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mohammed Khalissi",
                    "user_href": "/profile/Mohammed-Khalissi"
                }
            ]
        }
    ]
}