{
    "title": "What is a Math PhD from a French school worth? - Quora",
    "tags": [
        "Colleges and Universities in France",
        "PhD in Mathematics",
        "Doctor of Philosophy Admissions",
        "Graduate School Admissions",
        "Doctor of Philosophy Degrees"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cyrille Serdon",
                "href": "/profile/Cyrille-Serdon"
            },
            "answer_text": "While there are some fair points in the previous answer that I will try to address honestly, I feel like it is mixing several issues and provides an overall misleading picture of the situation. To me, the question should be separated into two parts : What is a PhD (from any country and topic) worth in France out of academia ? Here, the answer is unfortunately not that much (at least in the short term). The traditional elite French higher education system is the “Grandes Ecoles”, not universities. This led to a culture in which the elite degree is a master of engineering or business, not a PhD. As a consequence, you just can’t expect to be met in France with the kind of recognition that a PhD would bring you in the US, not to mention countries like Germany or Switzerland. Hence, it is true that pursuing a PhD is not a typical choice for French top students (I’d say somewhere around 5–10% in my school for instance). With that said, as French companies internationalize and the French education system is under a lot of pressure to comply with international evaluation standards, things are changing pretty fast. Indeed, institutions like Ecole Polytechnique (France’s #1 engineering school) are trying to push more of their students to go for a PhD. Conversely PhDs are starting to get better recognition from the industry (I am myself pursing my PhD in partnership with a big French company). What is a French Math PhD intrinsically worth ? As always, there is variability depending on the institution, team, PhD advisor, etc… and you should be cautious when deciding where you want to apply. Nevertheless, and despite all the flaws of its higher education system, France has had for a very long time and still retains a strong tradition of excellency in mathematics. Indeed, the Paris area is probably one of the largest hub of top-level mathematics research institutions worldwide. A non-exhaustive list includes : Ecole Normale Supérieure of Ulm and CachanParis-Sud University, Paris VIEcole Polytechnique, Mines ParisTech, Ecole des Ponts, ENSTA, SupelecParis-Dauphine UniversityINRIAThese are all top-level institutions that can provide world-class research opportunities for a PhD student as far as academic standards are concerned. While I am less familiar with them, I can think of other very reputable institutions at least in Lyon, Grenoble, Toulon and Toulouse. If you pursue a PhD in a good team at any of these places, you will definitely be recognized by people familiar with your field, even out of France. But, what is probably true on the other hand is that, in France, graduating from certain schools at the PhD level won’t give you the same general alumni recognition as if you had entered them at the undergrad level (because you will not have gone through the very tough competitive admission process). Also, internationally and out of your field of expertise, I guess that a PhD from a famous Anglo-Saxon institution would probably be more “shiny” and would attract more interest than one from a very good but relatively small and not-so-well-branded French institution. A few practical points : in my experience (PhD in France along with time spent as a visiting student in the US), you may receive a closer mentoring in France. I am myself very fortunate in that regard (I can talk with my advisor daily if that’s what I want) and it may not be true everywhere but I am under the impression that French professors tend to have fewer PhD students and financial responsibilities than their American peers, thus leading to more time available for direct interaction with their studentswhile I do think that France is a very nice and interesting place to have lived in (I am French though), campus life is going to be nothing like what you would find in the US or Oxbridge. As far as infrastructures and the general community atmosphere are concerned, these are simply not comparable (this might change somewhat with projects like PSL or Paris-Saclay but we are not there yet)",
            "date": "Updated February 28, 2017",
            "views": "37",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bruno Schut",
                    "user_href": "/profile/Bruno-Schut"
                },
                {
                    "user_id": "Gerald Ingram",
                    "user_href": "/profile/Gerald-Ingram"
                },
                {
                    "user_id": "MVR",
                    "user_href": "/profile/MVR-3"
                },
                {
                    "user_id": "SengBeng Goh",
                    "user_href": "/profile/SengBeng-Goh"
                },
                {
                    "user_id": "Petra Blackstone",
                    "user_href": "/profile/Petra-Blackstone-1"
                }
            ]
        }
    ]
}