{
    "title": "What is the difference between junior high school and senior high school? - Quora",
    "tags": [
        "High School Education",
        "The High School Experience",
        "Schools"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shawn Judd",
                "href": "/profile/Shawn-Judd-7"
            },
            "answer_text": "Hello, junior high usually refers to the period right before formal high school (typically ninth grade - twelfth grade, although some schools mark the start of high school as the tenth grade). Junior high typically consists of seventh and eighth grade, although the exact specifics vary slightly from region to region. Some areas don’t refer to the grades I previously mentioned as “junior high school,” but instead as just “middle school.” Senior high school (in the United States) is generally the final stage of a normal K-12 education, excluding all forms of higher education (college, university, etc.). ",
            "date": "Answered February 13, 2020",
            "views": "24",
            "upvotes": " Answer requested by Brandon C. Njichop"
        },
        {
            "author_info": {
                "name": "Beheruz N Sethna",
                "href": "/profile/Beheruz-N-Sethna"
            },
            "answer_text": "The original question was: What's the difference between junior year and senior year in high school? The answer I had planned to give was that in your junior year, you have about a year and a half left to create WOWs in your resume to make your best case for college versus in your senior year, you have a couple of months left to make your best case. But, when I clicked on the question, it changed to What is the difference between junior high school and senior high school? Someone “collapsed” or changed this question. But, they are not the same thing! ",
            "date": "Answered August 20, 2019",
            "views": "14",
            "upvotes": " Answer requested by Uzochukwu Mbamalu"
        }
    ]
}