{
    "title": "What are the disadvantages of technology and science? - Quora",
    "tags": [
        "Disadvantage",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jorge Garcia",
                "href": "/profile/Jorge-Garcia-76"
            },
            "answer_text": "I would break down the negative (i.e. harmful) side effects of science and technology into two types: 1) due to misusing, 2) due to misunderstanding. Due to misusing can be further broken down into two groups: a) intentional; b) unintentional. So now some examples: 1.a (intentional misuse) - I would place all mass killing weapons in this category. (I personally consider individual killing weapons (firearms and edge weapons) to be ok, as they can be justified for self defense and food procurement). 1.2 (unintentional misuse) - this category covers your run-off-the-mill harmful “side effects” like pollution, encroachment on natural habitats (i.e. effects harmful not directly to us humans but to other inhabitants of the planet) physical and mental atrophy from over reliance on our tools (things like weaker bodies thanks to vehicles, weaker memories thanks to Google, and so forth…) 2. (Misunderstanding). This one is trickier. I have always struggled with the fact that I intuitively know Untruth to be bad, but do not intuitively know why. Nevertheless, this is my answer. Science and technology are harmful insofar as we incorrectly believe them to be something they are not. And what they are not is: cure-alls (specifically, evil cannot be engineered out of the world); or alternatives philosophy/religion (specifically, science canot explain existence nor provide us with purpose) ",
            "date": "Answered August 5, 2018",
            "views": "55",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Emmanuella Kitcher",
                    "user_href": "/profile/Emmanuella-Kitcher"
                },
                {
                    "user_id": "M. Vincent Holguin",
                    "user_href": "/profile/M-Vincent-Holguin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pranav Prabhu",
                "href": "/profile/Pranav-Prabhu-15"
            },
            "answer_text": " The war equipment that was produced by military scientists had several negative effects on the society. Many soldiers lost their lives during this war. In addition, some of them sustained serious injuries after being attacked by tanks. Statistics from World War I reveal that around 117, 465 casualties were reported (Ross 107). Some soldiers who returned from this war developed a posttraumatic stress disorder. Some of them started having nightmares and sleepless nights after remembering how their fellow soldiers died during battle. Science and technology have brought harmful effects to society since it was used to manufacture war equipments during the World War II. Nazi scientist invented RocketV-1, buzz bomb, during the World War II. This aircraft was categorized as a guided missile and the Nazi mainly used it in 1944-1945 (Ross 81). The science and technology that was used in World War II had several negative effects to society. The economy of Japan deteriorated. This is because the atomic bomb destroyed its infrastructure. World War II also affected the Soviet Union. About 40 million people lost their lives due this war (Bishop 71). Germany used its advance weapons to kill civilians in the Soviet Union. Scientists also use advancements in science and technology to conduct human experimentation. Such experiments are harmful to human beings since they may have negative effects to the growth and development of people under study. One of the famous human experimentations was known as the monster study (McCuen 64). Negative Effects of Science and Technology ",
            "date": "Updated August 28, 2018",
            "views": "67",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nicholas Hamner",
                    "user_href": "/profile/Nicholas-Hamner-1"
                },
                {
                    "user_id": "Shubhankar Rai",
                    "user_href": "/profile/Shubhankar-Rai-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sunny Tripathi",
                "href": "/profile/Sunny-Tripathi-20"
            },
            "answer_text": "Science and technology has made an remarkable developed nowdays ,but utilisation of science is not done in a way that is beneficial to all .But for getting bany information we use the technology of science i.e. social media and internet or Google .It is good till several limits but going through it all the te is very harmful nowdays children's uses social media for studying alone that they move on to do further activities .Which are not good .They keep on playing on social media, chatting etc . The whole day and they lost their precious time only on smart phones . Instead of playing outdoors games . They stuck into social media . Outdoors games makes them physically as well as mentally fit . But children are only finding Interest on smart phones According to me the government should practice such law that everyone can only use mobile only 2–3 hours per day and more than it the government should cutt off the network . So that the children's are forced to do all the activities and work and they will only do that work only that they really want . Social media has many impacts as well as effects . But we should be concern about that is it harmful or beneficial for us . Doing something by thinking a lot is beneficial . Children should use its benefits such as participation in quizes , puzzles reasoning ,doubt solving instead of sticking in licking someone's photograph . So children must be aware about that ",
            "date": "Answered May 11, 2020",
            "views": "36",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dr Abhishek Kalantri",
                    "user_href": "/profile/डॉ-अभिषेक-कलंत्री-Dr-Abhishek-Kalantri"
                },
                {
                    "user_id": "Rasmiyah Sanguan",
                    "user_href": "/profile/Rasmiyah-Sanguan"
                },
                {
                    "user_id": "Wanuja Perera",
                    "user_href": "/profile/Wanuja-Perera"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aparajith Sridharan",
                "href": "/profile/Aparajith-Sridharan"
            },
            "answer_text": "Disadvantages of science not much but technology, yes. Technology has in our lives helped in creating comfort, increasing productivity and connecting more of us with each other. While it has some advantages like I can effortlessly travel between two far away places, do more stuff in a day and talk to my mom and dad over the internet where we are miles away from each other, it has its pitfalls. First, it has made us move less than we used to. We don't walk much as our ancestors did. We don't lift things to clean, slog and move our muscles to do household chores. This makes one of the greatest problems of the western world - obesity. Secondly, increased productivity and better refrigeration means increased production of processed foods. Junk foods with high concentrations of sugar and fat. Again a problem that is faced globally and in more in the western world like diabetes, high cholesterol, coronary heart disease. Etc. Thirdly, connecting more of us with each other. This is a boon and a bane. When you are Connected it's not just you who gets access to the internet but also that the internet has access to you. This can have adverse consequences if not used cautiously like cyber data crimes - e.g. The recent Facebook-Cambridge analytica issue which led to personally identifiable information to be sold without consent to a third party by Facebook. Finally, it's not just the technology to be really blamed here. It's the abuse of technology like misusing or total reliance on technology for basic tasks that make it a disadvantage. ",
            "date": "Answered April 18, 2018",
            "views": "13",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joshua Quisado",
                    "user_href": "/profile/Joshua-Quisado"
                },
                {
                    "user_id": "Heera R Prabhu",
                    "user_href": "/profile/Heera-R-Prabhu"
                },
                {
                    "user_id": "THOR RAGNAROK",
                    "user_href": "/profile/THOR-RAGNAROK-33"
                },
                {
                    "user_id": "Dhanraj Tamang",
                    "user_href": "/profile/Dhanraj-Tamang-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Henry A Spivey",
                "href": "/profile/Henry-A-Spivey"
            },
            "answer_text": "Science and technology has disadvantages because of our own. Dependence on new technology. Man no longer needs to think. Even if the calculator is a good invention, man no longer makes mental calculation and no longer works his memory. Increased dependency on modern tools like calculators and spell checkers has reduced our creativity and intelligence. The negative impact of the influence of technology on children should not be underestimated as well. Science has been responsible for pollution and has given us the nuclear bomb which threatens our very existence. But in this also fault lies not with science, but rather with mans intention to misuse the discoveries of science. Science is not inherently good or evil. It is a way to acquire knowledge systematically. It depend on us how we use it. ",
            "date": "Answered July 17, 2019",
            "views": "33",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Vance",
                "href": "/profile/John-Vance-14"
            },
            "answer_text": "Negative uses for science are the backing of political agendas, which is being done now! The false claim by the International Panel for Climate Change 97 percent consensus claim, of those agreeing that climate change is man made is false on many grounds mainly physics! EG less than four percent on Carbon dioxide is man made. How is removing fossil fuels going to revert our climate if its not caused by this?  Technological solutions being implemented for alternative energy are intermittent and do nothing either as they on fill in parts of a system which then becomes unstable thru the very technology meant to “save our planet”. Environmentalsits have said “ Its not what is real, its what people believe is happening” Do not get it wrong! ",
            "date": "Answered October 16, 2019",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tyler Darley",
                "href": "/profile/Tyler-Darley"
            },
            "answer_text": "There are many negative effects of science to technology, some of them will directly affect the humans. It affects the health of humans , as most of them spend their time in front of computers and smartphones it increases the stress and cause many health problems. pollution may increase by not properly disposing the E-waste. The advancement of technology may lead to lack of privacy. Violence may increase by using the technology in wrong way. Energy consumption will definitely increase as more people start using smartphones and Internet. ",
            "date": "Answered June 13, 2018",
            "views": "227",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Olivia Nantongo",
                    "user_href": "/profile/Olivia-Nantongo"
                },
                {
                    "user_id": "Lalitha Kolangarath",
                    "user_href": "/profile/Lalitha-Kolangarath"
                },
                {
                    "user_id": "Sarma Chakrala",
                    "user_href": "/profile/Sarma-Chakrala"
                },
                {
                    "user_id": "Arti Bisht",
                    "user_href": "/profile/Arti-Bisht-36"
                },
                {
                    "user_id": "Karidja Traore",
                    "user_href": "/profile/Karidja-Traore"
                },
                {
                    "user_id": "Rume Babs-Gabriel",
                    "user_href": "/profile/Rume-Babs-Gabriel"
                },
                {
                    "user_id": "Danica Cabagua",
                    "user_href": "/profile/Danica-Cabagua"
                },
                {
                    "user_id": "Rahul Rajpoot",
                    "user_href": "/profile/Rahul-Rajpoot-106"
                }
            ]
        },
        {
            "author_info": {
                "name": "Howard Aitchison",
                "href": "/profile/Howard-Aitchison"
            },
            "answer_text": "What is the disadvantage of science and technology? I am not quite sure I understand your question. Science is an unrivaled process for understanding information about the world around us. I see no disadvantages to it. Technology can make us lazy. Particularly when it comes to thinking. I am very old fashioned, for no particular reason. I like to write with a fountain pen. I shave with a safety razor not one of the modern many bladed atrocities. I like books made of paper. However, these are all technologies, just not new technologies. ",
            "date": "Answered November 18, 2019",
            "views": "23",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Happy Bicierro",
                    "user_href": "/profile/Happy-Bicierro"
                },
                {
                    "user_id": "Lexie Chou",
                    "user_href": "/profile/Lexie-Chou"
                },
                {
                    "user_id": "Aidan Anthony",
                    "user_href": "/profile/Aidan-Anthony-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Think Innovation",
                "href": "/profile/Think-Innovation-2"
            },
            "answer_text": "Science and technology can bring fast devastation if not utilized ethically.Science and technology can wipe out civilization in minutes due to deadly weapons invented.Science and technology making humans lazy and we are more prone to loosing physical strength than our ancestors.Nagasaki and Hiroshima are example of devastation done by Science & Technology.Today’s war are fought on technology and it can wipe out civilizations in seconds.Unethical utilization of science and technology can bring question mark to humanity.",
            "date": "Updated September 15, 2019",
            "views": "37",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Felix Opare",
                    "user_href": "/profile/Felix-Opare"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prema P",
                "href": "/profile/Prema-P-1"
            },
            "answer_text": "Science and technology enslave men through our dependance on them. There are many unanserables, beyond human reasoning capacity and perplexing events , to understand which we have to depend on intuition only . Dr. Radhakrishnan stated it is the seventh sense of humans. There is no end to research in science and technology and arriving at facts is very challenging. Negation of realise theories and principles is common and anchoring our decisions is difficult. Nothing is conclusive in science; but as far technology improves quality of life, it is okay. But negations are their beauty also. Blind technology is dangerous to life on earth. Hence reason with and faith supported by reason can balance the limitations of science and technology. ",
            "date": "Answered May 29, 2018",
            "views": "68",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "THOR RAGNAROK",
                    "user_href": "/profile/THOR-RAGNAROK-33"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thomas Burns",
                "href": "/profile/Thomas-Burns-131"
            },
            "answer_text": "They are constantly and rapidly advancing which leaves systems, devices etc obsolete in months not even years. This causes waste in a physical sense and also waste in the form of money, time and effort as users dump outdated equipment, buy new and take time learning how to use the new tech. Look at Apple iPhones ever extension of new phones with very or little improvements as an example of waste in all categories ",
            "date": "Answered November 19, 2019",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Karl Iwendy",
                "href": "/profile/Karl-Iwendy"
            },
            "answer_text": "For the people who died in the accident in the high-tech transportation tool, science and technology was a disaster for them. And also wars become more cruel as weapons get more Lethal. So Our mission is to make sure that people’s heart and moral sense are right or the disadvantage is can not be avoided. ",
            "date": "Answered January 23, 2017",
            "views": "28",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shrikant Shet",
                "href": "/profile/Shrikant-Shet"
            },
            "answer_text": "Let us frame it this way: All the things - research, production, work,....everything you do was started with a view to decrease human efforts. The advantage expected was reduced efforts and more free time. And we are on the way (I guess so). Disadvantage:We have forgotten the above said target and we're in a rat race. Working more and more for a less peaceful life! Further, preaching ''No pain, no gain.'' ",
            "date": "Answered December 11, 2015",
            "views": "47",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Dengz Chakma",
                    "user_href": "/profile/Dengz-Chakma"
                }
            ]
        },
        {
            "author_info": {
                "name": "Moses Ware",
                "href": "/profile/Moses-Ware"
            },
            "answer_text": "The way I see it, “NONE”! To be clear, if utilized appropriately, these advances enhance our lives. We do more, more efficiently, quicker, with greater accuracy. However, if used for dubious gains, things go awry, having unintended consequences. Think about the positive contributions of radiation to man-kind. Medicine, utilities, various instruments, food preservation, on and on. However, as most things, radiation can also be used to kill and destroy on a tremendous scale. It is not the device or the science behind it, it what we decide to do with it! ",
            "date": "Answered May 29, 2018",
            "views": "39",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shivam Sourav Jha",
                "href": "/profile/Shivam-Sourav-Jha"
            },
            "answer_text": "Weapons and phones are the disadvantages whereas new measures like voice editing, hacking and etc are also there. ",
            "date": "Answered May 30, 2018",
            "views": "62",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anil Bhatt",
                    "user_href": "/profile/Anil-Bhatt-92"
                },
                {
                    "user_id": "THOR RAGNAROK",
                    "user_href": "/profile/THOR-RAGNAROK-33"
                },
                {
                    "user_id": "BAL KRISHNA",
                    "user_href": "/profile/BAL-KRISHNA-54"
                },
                {
                    "user_id": "Vibs Jain",
                    "user_href": "/profile/Vibs-Jain-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brigitte Mathiak",
                "href": "/profile/Brigitte-Mathiak"
            },
            "answer_text": "Stuff like global warming, nuclear bombs and plastics everywhere comes to mind. Mass extinction. Possibly including that of humanity. ",
            "date": "Answered August 3, 2019",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Frank David Popa",
                    "user_href": "/profile/Frank-David-Popa"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Michael Owens",
                "href": "/profile/James-Michael-Owens"
            },
            "answer_text": "One possible negative effect science can have on technology is that technology development usually involves investment of time and money. If science advances fast enough, then investors may be reluctant to fund technology development for fear that new advances will render their investment irrelevant. ",
            "date": "Answered June 10, 2018",
            "views": "2",
            "upvotes": "0"
        }
    ]
}