{
    "title": "What are some critiques within the philosophy of science of Popper's principle of falsifiability? - Quora",
    "tags": [
        "Karl Popper",
        "Falsifiability in Physics",
        "Critiques",
        "Philosophy of Science",
        "Values and Principles",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Mainwood",
                "href": "/profile/Paul-Mainwood"
            },
            "answer_text": "The major critiques can be sorted into three broad camps: 1) The principle doesn't do the job it claims to.  (E.g., it doesn't actually demarcate, due to the theory-ladenness of observation or Duhem-Quine) 2) The principle doesn't do the job we hoped it would.  (E.g., it doesn't account for some things about science we think it should) 3) The principle doesn't cohere well with actual scientific practice.  (E.g., scientists, as a matter of fact, don't spend much of their time trying to falsify fundamental theories, but instead trying to use those theories to make further inferences, as Kuhn would call \"problem-solving\") Tom McFarlane has explained 1 well, and 3 is not, to my mind, what Popper was trying to do.  He was trying to uncover the logic behind scientific reasoning, not to do a sociological treatment of how real scientists spent their time.   So will mention an objection in camp 2.   One big issue in my mind is that the very best you can say about a successful theory is that it has not (yet) been falsified, and that its rivals have been. Now subject it to a lot of stretching tests, and watch it pass them all.  It feels like you should trust the theory more than you did before.  But Popper's approach gives no reason to do this. Example: General Relativity (this was a theory that first led Popper to his approach).  Before the Eddington experiment, GR was the only theory that had no falsified cases (Newton was out because it couldn't explain the precession of the perihelion of Mercury).  GR made a new bold prediction: light would be bent by massive objects by a certain amount.  (Popper is happy -- it's a scientific theory). Eddington observed the deflection to the required (forget the historical controversy of how big his experimental errors were) and Einstein became an overnight celebrity.  But in Popper's scheme, all that has happened is that GR has not been falsified.  Still.  There is no reason to trust GR more than there was before Eddington's test.  It is still the only theory standing, but it was before the test too.  And we repeat this through the tests of gravitational lensing, black holes, observations of gravitational time dilation and so on.  It \"feels\" as though after each test we should be much more confident in GR that we were before, but Popper gives us no reason to increase our confidence in the theory.  It is still in the same class: unfalsified theory without unfalsified rivals. Even Popper was unhappy with this.  In his early work, he talked vaguely about theories being tested in the \"crucible\" of experiment and coming out \"stronger\" in some vague sense.  But he never filled this out.   Later on, he came up with a notion called \"degrees of verisimilitude\" that (cutting a long story short) collapses back into the problem of induction.  My reading is that he is casting around for something like Bayesian updating, but didn't have the framework to make it coherent.  Verisimilitude doesn't work, and Popper would have been better not to appeal to it. ",
            "date": "Answered November 3, 2015",
            "views": "42",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gilbert Duy Doan",
                    "user_href": "/profile/Gilbert-Duy-Doan"
                },
                {
                    "user_id": "Mike Richmond",
                    "user_href": "/profile/Mike-Richmond-1"
                },
                {
                    "user_id": "M Martinů",
                    "user_href": "/profile/M-Martinů"
                },
                {
                    "user_id": "Aseel Issam",
                    "user_href": "/profile/Aseel-Issam-1"
                },
                {
                    "user_id": "Bob Simcoke",
                    "user_href": "/profile/Bob-Simcoke"
                },
                {
                    "user_id": "Melanie Vandoorn",
                    "user_href": "/profile/Melanie-Vandoorn"
                },
                {
                    "user_id": "Damien Holsters",
                    "user_href": "/profile/Damien-Holsters"
                },
                {
                    "user_id": "Simon Kinahan",
                    "user_href": "/profile/Simon-Kinahan"
                },
                {
                    "user_id": "Phil Jones (He / Him)",
                    "user_href": "/profile/Phil-Jones-He-Him"
                },
                {
                    "user_id": "Peadar Keegan",
                    "user_href": "/profile/Peadar-Keegan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom McFarlane",
                "href": "/profile/Tom-McFarlane"
            },
            "answer_text": "As a way by which to define what 'scientific' hypotheses vs 'non-scientific' hypotheses are, the criterion of falsifiability states that scientific hypothesis are exactly those that are falsifiable, i.e., they make some predictions that can, in principle, be falsified by experiment. This was set forth by Popper as a way to solve the demarcation problem between science and non-science. One critique is that falsifying a theory is not as simple as is may first appear. The Duhem–Quine thesis points out that just because an experimental result contradicts a prediction of a theory, it does not necessarily follow that the error resides in the theory. (The Faster-than-light neutrino anomaly, for example, contradicted Einstein's theory of relativity, but it did not ultimately falsify it because it turned out that there was an experimental error. Also, the irregularities in the orbit of Uranus did not falsify Newton's theory of gravity because the existence of Neptune was not yet known.)  One can not logically conclude from a mismatch between theory and experiment that the theory is necessarily false. The error may be due to any number of other causes, known or unknown. For example, the mismatch may be due to experimental error, mistakes in calculating the predictions from the hypothesis, or auxiliary assumptions that have been made. In addition, as pointed out by Norwood Russell Hanson, experimental facts themselves are theory-laden. So, we can never test a theory against \"pure\" experimental facts, independent of a theory (e.g., a theory used to understand how the experimental apparatus operates). These assumptions and conditions of testing a theory can be so numerous that falsifying a theory, in a strictly logical sense, is often practically impossible. Scientists try to tease out the root cause of any mismatch between theory and experiment by performing independent experiments repeatedly in various different ways by different teams. If their results agree with each other but not with the predictions of a theory, then it becomes more likely that it is the theory itself that is at fault rather than some other assumption. This is still short of logical certainty, however. Thus, in practice, a theory can not be falsified by an experiment the way a mathematical proposition can be falsified by a single counter-example. Now, because falsifying theories in practice is problematic and not clear-cut, this creates a problem for using falsifiability as the criterion for distinguishing science from non-science. One can imagine, for example, a hypothesis that is in principle falsifiable but that can not in practice be falsified by experiment (e.g., the hypothesis that somewhere in the universe there is a teapot orbiting a planet). For all practical purposes, this hypothesis is no different than an unfalsifiable metaphysical speculation, yet it is nonetheless classified as a 'scientific' hypothesis because it is falsifiable in principle. In short, falsifiability seems not sufficiently restrictive, admitting as 'scientific' some hypotheses that do not seem to warrant such classification. On the other hand, there are instances where falsifiability seems too restrictive. For example, the hypothesis that the proton decays, strictly speaking, can not be falsified because no matter how long one has failed to observe decay, it remains possible that it could still happen. One can only set statistical bounds on it. In this case, falsifiability helps to refine the hypothesis into one that is falsifiable. Nonetheless, the unrestricted hypothesis of proton decay is still valuable to consider, as it would have consequences for other theories. This suggests that one should not hastily dismiss any unfalsifiable hypothesis. See Tom McFarlane's answer to Does a claim have to be falsifiable to be considered a scientific claim? and Tom McFarlane's answer to Are unfalsifiable questions of any use or interest to scientific inquiry? ",
            "date": "Updated November 15, 2015",
            "views": "23",
            "upvotes": " View 20 Upvoters ",
            "upvoters": [
                {
                    "user_id": "M Martinů",
                    "user_href": "/profile/M-Martinů"
                },
                {
                    "user_id": "James Smith",
                    "user_href": "/profile/James-Smith-3709"
                },
                {
                    "user_id": "João Gama",
                    "user_href": "/profile/João-Gama-6"
                },
                {
                    "user_id": "Jack Kamp",
                    "user_href": "/profile/Jack-Kamp"
                },
                {
                    "user_id": "Vera Sorensson",
                    "user_href": "/profile/Vera-Sorensson"
                },
                {
                    "user_id": "Phyllis Steiner",
                    "user_href": "/profile/Phyllis-Steiner"
                },
                {
                    "user_id": "Kevin Duigou",
                    "user_href": "/profile/Kevin-Duigou"
                },
                {
                    "user_id": "Adiba Ejaz",
                    "user_href": "/profile/Adiba-Ejaz"
                },
                {
                    "user_id": "Simon Kinahan",
                    "user_href": "/profile/Simon-Kinahan"
                },
                {
                    "user_id": "Justin Stephens",
                    "user_href": "/profile/Justin-Stephens-1"
                }
            ]
        }
    ]
}