{
    "title": "What is COVID-19? I just heard about it today. - Quora",
    "tags": [
        "Biology",
        "COVID-19 (2019-2020)",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Wyatt Thompson",
                "href": "/profile/Wyatt-Thompson-41"
            },
            "answer_text": "It is a virus which originated in China in 2019. It took place in Wuhan because of a fish. A person ate it and got sick. On New Years Eve, scientists have discovered this virus. On March 11, 2020, the World Health Organization in Geneva, Switzerland had declared a pandemic. The government then started the lock down. They keep extending it and schools had to start online learning. The government also introduced face masks and social distancing. They are trying to make a vaccine for the COVID-19. At my school, there has had a COVID-19 case and we had to quarantine for 2 weeks and do online learning. ",
            "date": "Answered October 28, 2020",
            "views": "8",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sharon Jones Smith",
                "href": "/profile/Sharon-Jones-Smith-1"
            },
            "answer_text": "The pandemic started about 7 months ago. It killing people before then. You need to watch news programs or read a newspaper. The Chinese communist government said it started in a market in Wuhan, China 🇨🇳. It arrived in the USA 🇺🇸 by or before February. It’s one type of a corona virus. It started in 2019. Start watching at least news programs. It’s killed well over a 1,000,000 people in the world 🌍. In the USA the amount of deaths is over 221,000 people. The virus can leave you with damaged organs including heart, lungs,& kidneys. Read a newspaper occasionally. ",
            "date": "Answered October 29, 2020",
            "views": "15",
            "upvotes": " Answer requested by Shyla Hidy"
        }
    ]
}