{
    "title": "What is the observer effect in quantum physics? - Quora",
    "tags": [
        "Observer Effect",
        "Observations (quantum mechanics)",
        "Observers",
        "Observation",
        "Quantum Computing",
        "Quantum Mechanics",
        "Physics of Everyday Life",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kip Ingram",
                "href": "/profile/Kip-Ingram"
            },
            "answer_text": "Quantum systems are characterized by a state. You can think of that state as a vector in a (usually high dimensional) vector space. We are unable to directly observe the state. So, it exists, and it evolves deterministically in time as governed by the Schrödinger equation. But we can’t measure / assess the state itself. For any given quantum system there are generally some quantities that we can measure. We call those “observables.” However, any particular observable will not “have a value” for all of the possible states in the vector space. Only a subset of the possible state vectors can be thought of as “possessing” a value for the observable. Once in a while when you measure some observable, say O, the system is in one of those states for which it can give you a value for O. That’s the easy case - you just get that value, the system is unaffected by the measurement, and everyone moves on. More commonly, the system state is not one of those particular states. What happens then is that the act of measurement forces the system into one of the “value possessing states” corresponding to O, you get the value associated with that state vector, and now the system has changed - by measuring it you forced it into a new state. So, when you measure observable O1, you force the system into one of a family of states associated with O1. If you measure O2, you force it into a state associated with that observable. Your choice of what to measure has an influence on the quantum system. It might not even have a value for an observable prior to you measuring it, but it will after you measure it - your action ensures that. That is the observer effect. ",
            "date": "Answered February 28, 2020",
            "views": "46",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mike Evans",
                    "user_href": "/profile/Mike-Evans-172"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bert Willke",
                "href": "/profile/Bert-Willke"
            },
            "answer_text": "In classical physics if your measuring apparatus is interfering with the system you’re trying to study, you make more delicate measuring apparatus to bring the interference down to an acceptable level. In quantum mechanical experiments you can’t do that. Your measuring apparatus is another quantum mechanical system, and there’s a minimum amount of interaction below which you get nothing. Observer effect is a poor choice of words for this limitation. Some people though it meant you could alter an experiment just by looking at it! ",
            "date": "Answered March 14, 2020",
            "views": "38",
            "upvotes": " Answer requested by Evan Nally"
        }
    ]
}