{
    "title": "What are the horizontal rows in the periodic table called? - Quora",
    "tags": [
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Edgar Arbaje",
                "href": "/profile/Edgar-Arbaje"
            },
            "answer_text": "Periods. As in, Period 1, Period 2, etc. The period of an element can tell you a lot of about a number of properties: abundance in the universe. Period 1 elements are far more abundant than everything else, then Period 2 elements (with the exception of lithium, beryllium, and boron), and so onelectronegativity. The ones in Period 2 are the most electronegative, and they decrease down the periods. Notable exceptions are found in the transition metal groups, where this trend is reversed.Ability to form ring, chain, and cage structures. Again, period 2 is the winner, followed by much reduced capability in period 3, and then becomes more difficult down the periods.Catalytic potential. Generally increases as you go down the periodsDensity. Generally increases down the periods.And so on ",
            "date": "Answered April 6, 2019",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Daksha Chouhan",
                "href": "/profile/Daksha-Chouhan-1"
            },
            "answer_text": "Horizontal rows in periodic table are called periods , they are seven in numbers elements in same period may not have similar quality. while vertical rows in periodic table are called columns or family. ",
            "date": "Answered September 20, 2018",
            "views": "1",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stella Khumalo",
                    "user_href": "/profile/Stella-Khumalo-2"
                },
                {
                    "user_id": "Bob Collins, MD",
                    "user_href": "/profile/Bob-Collins-MD"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maina",
                "href": "/profile/Maina-26"
            },
            "answer_text": "They are called periods and are 7 in number. Those elements lying in the same period are differing in their properties and behaviours. ",
            "date": "Answered June 23, 2020",
            "views": "516",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Haraprasad Mohapatra",
                    "user_href": "/profile/Haraprasad-Mohapatra-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stuart Herring",
                "href": "/profile/Stuart-Herring-2"
            },
            "answer_text": "On the periodic table of the elements, what are the horizontal rows called? They are called periods. (The columns are called groups.) ",
            "date": "Answered April 6, 2019",
            "views": "36",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Brett Bergan",
                    "user_href": "/profile/Brett-Bergan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adrian Holmberg",
                "href": "/profile/Adrian-Holmberg-1"
            },
            "answer_text": "The rows (side to side) are called periods, in which there are 7. Likewise, the vertical columns (up and down) are called groups. There are 18 groups. ",
            "date": "Answered February 12, 2020",
            "views": "681",
            "upvotes": "0"
        }
    ]
}