{
    "title": "What is the difference between social sciences and applied sciences? - Quora",
    "tags": [
        "Similarities Between Natural Sciences and Social Sciences",
        "Applied Sciences",
        "Social Sciences"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Henoch",
                "href": "/profile/James-Henoch"
            },
            "answer_text": "Hello there. I may not the expert of science. But I have learned about applied science since 2010. I think, actually those two terms are in different corridor of science. APPLIED SCIENCE Applied science is a discipline that used to apply existing scientific knowledge based on scientific researches and also to developing a practical application of science - such as technology, methodology, inventions. So basically, the main concern of applied science is about scientific knowledge and how to practice it into the real world. This can be a scientific and practical contribution to people. Applied science's neccessity is triggered by research question which become the problem to be solved. It usually produces practical steps, practical decisions, as tools to answer the existing problem. It helps stakeholders to develop the systems to be better. Applied science related to economical aspects. A common question in applied science is what's the short-term and long-tern impact if the existing problem is not be solved? What is the practical solutions for the problem so the negative impacts won't be happened in future? The question like these would be answered in applied science. SOCIAL SCIENCE And this I know about the other one. Social science is a study of human behavior, relationship with other human in terms of emotions, psychologic, the impact of belief to environment based on scientific research. Social science usually uses many tools to get information, to measure, to evaluate, even to control human behavior. Have you ever heard about \"social experiment\"? It is one of many tools that can be used in social science in order to get information about people's reaction to some conditions which are the hypothesis of the study. In my opinion, social science research is triggered by curiosity about the current event of social life. It may be not something wrong or a problem. But it may helps us to understand about human behavior, how to treat people, how to live socially healthy. I've tried to conclude my thought into this. The similiarities between Applied Science and Social Science: Based on scientific researchHave contribution to civilizationsNeccessary to human lifeRoot of scienceBeen done with a scientific methodologyThe differences between Applied Science and Social Science: PurposeApplied science: solving problemSocial science: theory provenTriggerApplied science: problem to be solved or needs to be developedSocial science: curiosityObjectApplied science: systemSocial science: peopleMethodologyApplied science: both quantitative and qualitativeSocial science: qualitativeOutputApplied science: technology, inventionSocial science: qualified hypothesis or behavioral theoryI think this is answer that I can provide based on my knowledge. I hope it's helpful. Thank you! ",
            "date": "Answered June 6, 2018",
            "views": "1169",
            "upvotes": " View 139 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Veda Lee",
                    "user_href": "/profile/Veda-Lee-4"
                },
                {
                    "user_id": "Melbourne Bermillo",
                    "user_href": "/profile/Melbourne-Bermillo"
                },
                {
                    "user_id": "Vivien Antonio",
                    "user_href": "/profile/Vivien-Antonio"
                },
                {
                    "user_id": "Eros Dela Costa",
                    "user_href": "/profile/Eros-Dela-Costa"
                },
                {
                    "user_id": "Leni Grace Basagan",
                    "user_href": "/profile/Leni-Grace-Basagan"
                },
                {
                    "user_id": "Roxanne Puyod",
                    "user_href": "/profile/Roxanne-Puyod"
                },
                {
                    "user_id": "LynnLynn Fajanilbo",
                    "user_href": "/profile/LynnLynn-Fajanilbo"
                },
                {
                    "user_id": "Sweetie Cortes",
                    "user_href": "/profile/Sweetie-Cortes"
                },
                {
                    "user_id": "Christian Despabiladeras",
                    "user_href": "/profile/Christian-Despabiladeras"
                },
                {
                    "user_id": "Maejoy Montemayor Dionio",
                    "user_href": "/profile/Maejoy-Montemayor-Dionio"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard P. Morrall",
                "href": "/profile/Richard-P-Morrall"
            },
            "answer_text": "A very large difference. Physics is a natural/pure science; engineering is an applied science; neither is a social science. Biology is a natural science; medicine is an applied science; neither is a social science. Mathematics is a pure science; statistics and economics are social sciences. Geology is a pure science; cement work is an applied science; cement contracting is a social science. Of course there are many educated persons — including myself -- who refuse to use the term social science. We prefer the older social studies. Libraries continue to place books in the 300s — social studies rather than relocate them to the 600s — applied science (which follow those in the 500s — pure science.) History has its own division, the 900s. Indeed there are different teaching credentials: history and social studies. Many of us with history credentials are somewhat suspicious of anyone with the newer social studies credential. (I admit that I use the word suspicious as a euphemism .) A social science is the study of information based on human beings in a group. Sociology is the main one. A pure science is the study of information based on the natural world. An applied science is the study of information based on the use of the information of a pure science. You can readily see that the invention of the term social science adds unnecessay confusion to the issue, but with the push to science based education during the space race, it was adopted by educators. A poor decision, and one I refuse to use. Here are lists of the various fields to use as examples: Natural sciences: mathematics, astronomy, physics, chemistry, geology, biology, botany, zoology. Applied sciences: medicine, engineering, agriculture, management, building and construction, chemical engineering, manufacturing Social studies: sociolgy, anthropology, statistics, political science, economics, law, military science, public administration, social services, education, commerace, comminications, and transportation. Hope this helps. If you stick to natural and applied science, you will be on safe grounds. You may use either social studies or social sciences for the people-in-society arts depending on the group you are in, With me, use social studies. You don't want an eighty-year-old muttering to himself and growling at you. ",
            "date": "Answered June 11, 2018",
            "views": "334",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Astrid Abejó",
                    "user_href": "/profile/Astrid-Abejó"
                },
                {
                    "user_id": "Nawal Mohamad",
                    "user_href": "/profile/Nawal-Mohamad-2"
                },
                {
                    "user_id": "Vanessa Canceran",
                    "user_href": "/profile/Vanessa-Canceran-1"
                },
                {
                    "user_id": "Joshua Mantiza",
                    "user_href": "/profile/Joshua-Mantiza-2"
                },
                {
                    "user_id": "Anders Jørgensen",
                    "user_href": "/profile/Anders-Jørgensen-27"
                },
                {
                    "user_id": "Erica Laddran",
                    "user_href": "/profile/Erica-Laddran"
                },
                {
                    "user_id": "Yasaswi Dhungel",
                    "user_href": "/profile/Yasaswi-Dhungel"
                }
            ]
        }
    ]
}