{
    "title": "What is the future of video games? How will we go beyond virtual reality? - Quora",
    "tags": [
        "Augmented Reality",
        "The Future",
        "Virtual Reality (VR)",
        "Technology Trends",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anton Kalyuzhniy",
                "href": "/profile/Anton-Kalyuzhniy"
            },
            "answer_text": "The future of gaming is the same as it was ten years ago. Graphics will be better, new game designs and styles will ge developed, and more efficent platforms will be sold. I think people misunderstand how VR will affect the gaming industry. VR will not replace the primary modes of gameplay, such as mouse and keyboard. This is because it is a strictly first person technology. You really dont need VR for an RTS or a platformer. Furthermore, the developement of full body recognition is probably going to stall. Video games are a form of media similar to books and movies. They want to tell you a story, or present you a challenge, but it is entirely for your mind. The idea that people will start swinging their hands around while wearing body suits and a headset just doesnt appeal to a mass market. A lot of people would prefer video games to be relaxing, and laid back. Sit down, the witcher for an hour, get off. VR is designed to excite and surprise, by putting a player into the game. Not calm down and unwind. Now maybe things will change in the future, I don't know, no one does. For now, it seems that gaming will do what gaming does, get better at presenting the experience in different way, whether it be computer screen, or VR headset. ",
            "date": "Answered April 11, 2016",
            "views": "430",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Beinan Li",
                    "user_href": "/profile/Beinan-Li"
                },
                {
                    "user_id": "Dre Pamash",
                    "user_href": "/profile/Dre-Pamash"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charles Edward",
                "href": "/profile/Charles-Edward-41"
            },
            "answer_text": "VR gaming will continue to develop, with saturation and functionality increasing leaps and bounds along with the immersive experiences becoming extremely high definition. We'll end up mixing VR and AR, and furthermore, will seek to extend human capabilities and human lives through novel technologies like these. ((PDF) Virtual, Augmented, and Mixed Realities: Concepts, Games, Applications, and Long-Term Immersion Effects for the Virternity Project) Truly essential building blocks for our future world. ",
            "date": "Answered November 20, 2018",
            "views": "72",
            "upvotes": "0"
        }
    ]
}