{
    "title": "What is the difference between cultural evolution and biological evolution? - Quora",
    "tags": [
        "Cultural Evolution",
        "Evolution (process)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sudo Nim",
                "href": "/profile/Sudo-Nim-18"
            },
            "answer_text": "There are multiple theories of cultural evolution, unlike biological evolution, which has only the Modern Synthetic Theory of Evolution, or the Neo-Darwinian Theory, as it is also called. This includes the mechanisms of natural selection, mutation, gene flow, and genetic drift. Now, we know that epigenetic modification (which is not a type of mutation, as the genetic code itself does not change; only the expression does) can also play a role in biological evolution, assuming the epigenetic modification is heritable. Sociobiology is a theory/biological subfield proposed by E. O. Wilson, claiming that culture and behavior are explainable as extensions of biology. Culture is, in fact, no different than biology, according to this theory. Thus, one would expect that cultural evolution would be possible to explain via the exact same mechanisms as biological evolution (as they are the same thing). Anything in culture is reducible to biological principles and the biological needs of society. The Dual Inheritance Theory suggests that culture is highly analogous to biology, but it is not the “same thing.” Both genetic and cultural information is passed on and mutated in similar ways, although culture changes much more quickly due to a lack of physical form (biological organisms must first mature before passing on information). It is ultimately ideas that become the “genetic material” for culture, rather than genes, and they change over time like a game of telephone through the years/decades. Genes affect culture and ideas affect biology in a continuous feedback loop as well. They work together in that sense. It is somewhat similar to the concept of Richard Dawkin’s memetics, in that ideas function like genes. Unidirectional Evolution is the theory that all culture follows the same basic structure of increasing complexity. This is not so commonly defended anymore. Originally, it argued that culture goes through the stages of savagery, barbarism, and finally, civilization (usually by the standards of Europe). Obviously, this would be dramatically different from biological evolution, which really has nothing to do with a tendency towards greater complexity (bacteria are still around in massive numbers, even after 3.5 billion years—no more or less complex than they were so long ago). It is associated with the idea of Social Darwinism, or the belief that society naturally gets rid of the unfit (the poor and disadvantaged). It has a definite racist/classist flavor to it. Universal Darwinism is the theory that evolution is actually more like a law of nature. Culture follows the exact same mechanisms as biology, economics, chemistry, physics, computer science, etc. We just need to find the general patterns to put forth a universal theory explaining all change over time. This is, for me, the most intuitive of all of them. It just seems obvious to me. However, no one has put forth a concise universal theory uniting the disciplines as of yet. It has been hypothesized that the three Darwinian postulates of variation, heritability, and selection are universal, but exactly how those three things fit in with everything else is still a mystery. It certainly has not been proven. ",
            "date": "Answered September 12, 2018",
            "views": "14",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Clement van Pelt",
                    "user_href": "/profile/James-Clement-van-Pelt"
                },
                {
                    "user_id": "Helgi Briem",
                    "user_href": "/profile/Helgi-Briem"
                },
                {
                    "user_id": "Jamnia Quelle Mendez",
                    "user_href": "/profile/Jamnia-Quelle-Mendez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Lloyd",
                "href": "/profile/Jim-Lloyd"
            },
            "answer_text": "They are the two best examples of what is known as Universal Darwinism. Biological evolution was identified first, primarily by Darwin. But as the process of biological evolution became understood as an algorithm operating through the ability of RNA & DNA to replicate, people began to realize that the algorithm might also be able to run with other kinds of “replicators”. In The Selfish Gene, Richard Dawkins discussed cultural evolution and coined the term meme for the unit of replication analogous to genes. Dawkins didn’t pursue this idea in any real sense, but other researchers have, some calling it memetics. The field has kind of sputtered, and many deride it, but there are some brilliant minds who take it quite seriously. I’m thoroughly convinced that it is true, but this has a lot to do with the fact that I am a software engineer with a lot of experience in algorithmic thinking, along with some experience in linguistics, and I have been interested in consciousness and intelligence (both natural and artificial) my whole life. The philosopher Daniel Dennett has written a lot about evolution, both biological and cultural. His recent book From Bacteria to Bach and Back is well worth reading. I think the most interesting take on the evolution of culture that I have seen is that made by the theoretical physicist David Deutsch in his book The Beginning of Infinity, in the chapter titled The Evolution of Culture. There he makes what I think is a very compelling argument that the Enlightenment was due to a kind of phase transition that took place in cultural evolution when critical thinking took hold. Highly recommended reading for anyone curious about cultural evolution. The biggest difference between biological and cultural evolution comes from the fact that genes and memes are very different kinds of replicators. A gene must have a very specific physical manifestation (sequence of codons) and the replication of genes only happens when organisms reproduce. Memes are much more fluid. A meme can be transferred from one mind to another in a few moments of conversation, but when this happens the meme is typically changed in subtle and even profound ways. Culture therefore evolves radically faster than biology. ",
            "date": "Updated January 8, 2019",
            "views": "18",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Clement van Pelt",
                    "user_href": "/profile/James-Clement-van-Pelt"
                },
                {
                    "user_id": "Helgi Briem",
                    "user_href": "/profile/Helgi-Briem"
                },
                {
                    "user_id": "Joe Velikovsky",
                    "user_href": "/profile/Joe-Velikovsky"
                }
            ]
        }
    ]
}