{
    "title": "What does death smell like? - Quora",
    "tags": [
        "Smell and Smells"
    ],
    "response": [
        {
            "author_info": {
                "name": "Antonello Frau",
                "href": "/profile/Antonello-Frau"
            },
            "answer_text": "Death, as in “end of all the biological activity in an organism that supports homeostasis”, has a complex smell that depends upon a handful of factors: if we stick to human beings, age at the moment of the decease;health condition;cause(s) of death.Depending on these and their mutual interplay, distinctive flavours can arise, mix and mingle. Generally speaking, found stages of death can be identified, each of which with their related smell: the autolysis period[1]. It starts few minutes after the death and is due to the “lack of control” cells now have on their own enzymes, which therefore begin to destroy themselves. Tough to infer a typical smell here;microorganisms start to take over. Their action on tissues causes breakdown of protein-based material, fermentation and therefore production of gases. This also forces biologic fluids out of the orifices and, all in all, bloating and strong odours begin to make their way;active decomposition or decay. This is the stage when the action of bacteria and microorganisms is at its top. Deep liquefaction and disintegration goes on, along with persistent odours. This is the stage when most of the body mass is lost;fossilisation or advanced decay. Here, the decomposition slows down because of the mass decrease and so does the persistency of strong smell. Inorganic remains (bones, teeth) are what is left over.The compounds that make up the smell of death come from a whole bunch of physico-chemical processes: this means, such an odour is actually a mix of many, volatile reaction products. A compound is regarded as volatile[2] when it can evaporate easily because of several factors (small molar mass[3], pressure) and the main ones that can be found in the “death smell” are ammonia (NH₃);skatole (or 3-methylindole, C₉H₉N);hydrogen sulfide (H₂S);indole (C₈H₇N);methanethiol (CH₃SH);dimethyl sulfide (CH₃-S-CH₃);dimethyl disulfide (CH₃-S-S-CH₃);putrescine (1,4-diaminobutane, NH₂-(CH₂)₄-NH₂);cadaverine (1,5-diaminopentane, NH₂-(CH₂)₅-NH₂).It is worth noting that studies carried out at body farms[4] (yes, they are a thing) highlighted the presence of more than 300 volatile substances the “death smell” may be composed of. The above ones can be taken as the most representative ones, because they are the main ingredients of rotten eggs (mainly hydrogen sulfide), feces (several possible combinations of skatole and indole, concentration-wise), rotten cabbages (the organic sulfides, mostly), and the undefinable, sickly scent that arises from the presence of amines. Footnotes[1] Autolysis (biology) - Wikipedia[2] Volatility (chemistry) - Wikipedia[3] Molar mass - Wikipedia[4] Body farm - Wikipedia",
            "date": "Answered September 3, 2020",
            "views": "342",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jenifer Silverman",
                "href": "/profile/Jenifer-Silverman"
            },
            "answer_text": "I did a 4 week rotation in the medical examiner's office during my training. I was on the team that went to all the locations where the deceased were. For the most part, the bodies were found relatively recent, so the smell did not set in yet. But there were instances where some of the bodies hadn't been found right away and they had started decomposing. Those were awful. The smell hit your nostrils before you even walked in the door. It is as the previous people wrote, a sickly sweet smell. And you instantly know it's death.  ",
            "date": "Answered January 16, 2016",
            "views": "23",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Emma Hitchen",
                    "user_href": "/profile/Emma-Hitchen"
                }
            ]
        }
    ]
}