{
    "title": "What does linear mean in science? - Quora",
    "tags": [
        "Scientific Terminology and Jargon"
    ],
    "response": [
        {
            "author_info": {
                "name": "Emily Czinege",
                "href": "/profile/Emily-Czinege"
            },
            "answer_text": "It means one of three things. In addition, the word linear has a heavy connotation to scientists: easy. Linear equations, systems and functions tend to be much easier to work with than their non-linear counterparts. More accurately, linear doesn’t so much mean easy, as non-linear means nightmarish. 1. For shapes: it looks or behaves like a line. Opposites: circular, cylindrical, etc. 2. For equations / relationships: A relationship between two quantities of the form [math]y=ax+b[/math]. This family of equations defines all graphs that are shaped like a line, hence the name linear. Example: Searching something in an unsorted list has linear complexity: because we might have to search through the whole list every time, the worst-case number of computations needed to solve it relates to the length of the list as [math]\\text{computations} = a * (\\text{length of list}) + b[/math] for some [math]a[/math] and [math]b[/math]. Opposites: exponential, sinusoidal, logarithmic, polynomial, etc.. 3. For functions: A function [math]f[/math] is linear iff [math]f(a x + b y) = a f(x) + b f(y)[/math]. Note that the equation above does not define a linear function [math]y(x)[/math] in this sense, except when [math]b=0[/math]. This is an abstract interpretation of the word linear, native to the field of linear algebra. It applies to many things that aren’t like lines at all. Example: Differentiation, when viewed as a function that maps functions to functions, is “linear”, because [math]\\frac{d}{dx}(a f(x) + b g(x)) = a\\frac{d}{dx}f(x) + b\\frac{d}{dx}g(x)[/math]. Opposites: Non-linear, affine, etc. ",
            "date": "Answered October 8, 2017",
            "views": "22",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Wafaa Ziane",
                    "user_href": "/profile/Wafaa-Ziane"
                },
                {
                    "user_id": "Israel Ramirez",
                    "user_href": "/profile/Israel-Ramirez"
                },
                {
                    "user_id": "Gregory Allen",
                    "user_href": "/profile/Gregory-Allen-37"
                },
                {
                    "user_id": "David Moore",
                    "user_href": "/profile/David-Moore-408"
                },
                {
                    "user_id": "Mads Munch Hansen",
                    "user_href": "/profile/Mads-Munch-Hansen"
                },
                {
                    "user_id": "Hassaan",
                    "user_href": "/profile/Hassaan-11"
                },
                {
                    "user_id": "Steve Stevens",
                    "user_href": "/profile/Steve-Stevens-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Roberts",
                "href": "/profile/Steve-Roberts-83"
            },
            "answer_text": "It describes the relationship between two values. In the case of time and distance travelled by a car, the relationship is linear if the car moves at a constant speed. However, the relationship is not linear of the car speeds up or slows down. Or if you are comparing the number of video games rented and the total cost of games rented, the relationship is linear if the cost of each game rental stays the same. (In this case, the cost is $2 per night plus a membership fee of $20, which explains why 0 games rented costs $20.)  Linear Relationships: A Review Types of Relationships ",
            "date": "Answered October 8, 2017",
            "views": "310",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hassaan",
                    "user_href": "/profile/Hassaan-11"
                }
            ]
        }
    ]
}