{
    "title": "What is insurance underwriting? - Quora",
    "tags": [
        "Insurance Underwriting",
        "Underwriting",
        "Insurance Companies"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marty Agather",
                "href": "/profile/Marty-Agather"
            },
            "answer_text": "Insurance underwriting (u/w) refers to the process of determining the acceptability of a prospective insured. After determining that the insured fits the underwriting guidelines of the specific insurance company, then the underwriter determines the price and terms at which the insurance company will offer a policy. A simple example will help explain. In this example, a life insurance company’s underwriting guidelines say that any individual with a diagnosis of cancer, or a previous diagnosis of cancer , whether or not that cancer is treatable, cured or in remission. If I apply for a policy, and I had a diagnosis of cancer 15 years ago, but have been completely cancer free for the past 15 years, no underwriter at this company will provide me with a policy (at least if they are following the underwriting guidelines. In the same manner, if an auto insurer’s u/w guidelines say that a new policy holder may only have one ticket in the past 3 years and still be eligible; we have 3 new customers, each with a single ticket in the past three years: Customer A has a speeding ticket at 0–9 miles over the limit. The underwriter offers a policy with a 10% surchargeCustomer B has a speeding ticket at 10 - 15 miles over the limit. The underwriter offers a policy with a 25% surcharge.Customer C has a speeding ticket 25+ miles over the limit. The underwriter declines to offer a policy. Even tho there is only a single violation, the judgement shown by being 25+ over the limit indicates that this customer is a poor risk and no amount of money offsets the risk.While these examples are simple, the process of underwriting a complex risk (say a construction company that builds 50+ story office buildings) is time consuming and requires substantial experience. ",
            "date": "Answered August 7, 2017",
            "views": "858",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Agency Height",
                    "user_href": "/profile/Agency-Height"
                },
                {
                    "user_id": "Vijay Kumar",
                    "user_href": "/profile/Vijay-Kumar-27119"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emenike Emmanuel",
                "href": "/profile/Emenike-Emmanuel-2"
            },
            "answer_text": "An insurance underwriter is a professional who assesses and evaluates the risks of offering insurance policies and covers. It is the duty of an insurance underwriter to determine how much an insurance policy will cost and whether the insurance policy provider should give an insurance offer to a person or business. One of the jobs of an insurance underwriter is to establish pricing for every insurance coverage by looking at the risks involved. It is becoming increasingly difficult to thrive as an insurance underwriter when you look at the evolving insurtech tools insurers are now using and the high level of competition in the underwriting industry. There are over 89,000 insurance underwriters in the United States and the number isn’t decreasing any time soon. ",
            "date": "Answered August 27, 2020",
            "views": "31",
            "upvotes": " Answer requested by Akshay Gourkhede"
        }
    ]
}