{
    "title": "What are the exact sciences? - Quora",
    "tags": [
        "Exact",
        "Word Definitions, Terminology, and Jargon"
    ],
    "response": [
        {
            "author_info": {
                "name": "Adam Helps",
                "href": "/profile/Adam-Helps"
            },
            "answer_text": "Broadly speaking, the exact sciences (also \"hard sciences\") are those that don't require you to figure out human psychology. They include mathematics, physics, chemistry, and geology. Biology is a particularly difficult science, and it is more difficult to achieve rigorous results due to the enormous complexity involved, but it gets at least an honorable mention as an exact science. Human beings, and the things we do, say, and think, are much more resistant to logical explanations, and studies on humans tend to have much larger margins of error. The study of humans is usually termed the \"social sciences\" or the \"soft sciences,\" and covers psychology, political science, anthropology, archaeology, economics, linguistics, pedagogy, and sociology. There are other ways of splitting these up, and there are some \"allied\" crafts and disciplines. Computer science and engineering, for example, draw on the hard sciences, while software engineering and project management draw on the soft sciences. ",
            "date": "Answered November 1, 2015",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Andrew Williams",
                "href": "/profile/Andrew-Williams-92"
            },
            "answer_text": "Mathematics, without question. None of the other sciences could even hope to function without it. Sure, your physicists and your chemists take some seriously accurate measurements. NASA can (usually) calculate a trajectory for a space probe to pass every major planet in the solar system in one shot, and that’s a hell of a difficult job, but it would be nigh impossible without mathematics. ",
            "date": "Answered July 3, 2019",
            "views": "399",
            "upvotes": "0"
        }
    ]
}