{
    "title": "What is the number of protons in an atom called? - Quora",
    "tags": [
        "Protons",
        "Atoms"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lucy White",
                "href": "/profile/Lucy-White-190"
            },
            "answer_text": "TLDR: Atomic number The number of protons is called the atomic number. Due to the fact that the number of protons and electrons in an atom are equal in order for it to be neutral, the atomic number can also denote the number of electrons. When given the mass number, the atomic number can also be used to calculate the number of neutrons; the mass number is protons + neutrons, and so neutrons can be figured out from taking the atomic number (smallest) from the mass number (biggest). (Mass-atomic). Sorry about the extra unnecessary information. Hope this helped! ",
            "date": "Answered January 3, 2018",
            "views": "59",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Muharrem Kara",
                    "user_href": "/profile/Muharrem-Kara-1"
                },
                {
                    "user_id": "Paula Templer",
                    "user_href": "/profile/Paula-Templer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mudasar Ahmad Tanoli",
                "href": "/profile/Mudasar-Ahmad-Tanoli"
            },
            "answer_text": "The number of protons in the nucleus of an atom is called as Atomic number and it is represented by Z. same term (atomic number) is also used for the number of electron present in a neutral atom…….because a neutral atom consist of same umber of electron and protons. ",
            "date": "Answered January 1, 2018",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ian Friskus",
                "href": "/profile/Ian-Friskus"
            },
            "answer_text": "That is the atomic number, which can be used to determine the electron count and the nuclear charge. The former is equal to the atomic number minus the net charge of the atom, while the latter is one positive charge times the atomic number. Meanwhile, the atomic mass number is determined by the number of nucleons. A nucleon is a proton or neutron, which means that the mass number will always be equal to or greater than the atomic number. ",
            "date": "Answered June 23, 2018",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Zohaib Amjad",
                "href": "/profile/Zohaib-Amjad-9"
            },
            "answer_text": "Comparing the charge and mass of electrons, protons and neutrons. The atomic number (also called the proton number) is the number of protons in an atom. The mass number (also called the nucleon number) is the total number of protons and neutrons in an atom. ",
            "date": "Answered January 5, 2018",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Kahana",
                "href": "/profile/David-Kahana"
            },
            "answer_text": "It's often called the atomic number or the proton number and denoted . There is also the mass number  and the neutron number . ",
            "date": "Answered July 22, 2015",
            "views": "2",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richard Wise",
                    "user_href": "/profile/Richard-Wise-11"
                },
                {
                    "user_id": "André David",
                    "user_href": "/profile/André-David"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pranav Prabhu",
                "href": "/profile/Pranav-Prabhu-15"
            },
            "answer_text": "It is called as the atomic number. ",
            "date": "Answered June 22, 2018",
            "views": "262",
            "upvotes": "0"
        }
    ]
}