{
    "title": "What is the meaning of “Science isn't a faith, but rather a method that takes time to unfold. It is therefore wrong to uncritically embrace everything you read”? - Quora",
    "tags": [
        "Faith"
    ],
    "response": [
        {
            "author_info": {
                "name": "Scott Youngren",
                "href": "/profile/Scott-Youngren-1"
            },
            "answer_text": " It would be a terrible, terrible mistake to uncritically embrace everything you read. And it is completely inaccurate to characterize science as a gradual unfolding of truth, when viewed in the context of the history of science. The science of one age tends to become the pseudoscience or superstition of the next age. Therefore, we have every reason to assume that the science of today will become the pseudoscience of tomorrow. This also makes it difficult to characterize science as dealing with “cold, hard fact.” As example of this trend, consider the example of phrenology: As Wikipedia states, “Phrenology is a pseudoscience which involves the measurement of bumps on the skull to predict mental traits.” Today, we regard phrenology as pseudoscience, but it was regarded as science during Victorian times. If you had been interviewing for a job during this era, you would most likely have had to have a phrenology test. This test would be administered by having someone trained in phrenology feel the bumps in your skull with their hands, to allegedly check your personality traits. See article below: Centuries before Myers-Briggs, workplace personalities were assessed using skull measurements (“Hmmm, Steve seemed like a great candidate for this position, but his skull features indicate a tendency towards dishonesty and theft. We’d better not hire him.”) As another example, bloodletting is now perceived to be pseudo-science, but it had scientific consensus behind it for over 2,000 years. As Wikipedia notes, “Bloodletting, whether by a physician or by leeches, was based on an ancient system of medicine in which blood and other bodily fluids were regarded as ‘humours’ that had to remain in proper balance to maintain health. It is claimed to have been the most common medical practice performed by surgeons from antiquity until the late 19th century, a span of over 2,000 years. In Europe the practice continued to be relatively common until the end of the 18th century. The practice has now been abandoned by modern-style medicine for all except a few very specific medical conditions.” Please note that, despite being based on the now discredited notion that it worked by balancing “bodily humours,” bloodletting actually did provide benefit for certain conditions. For example, as Wikipedia further notes, “The practice has now been abandoned by modern-style medicine for all except a few very specific medical conditions. It is conceivable that historically, in the absence of other treatments for hypertension, bloodletting sometimes had a beneficial effect in temporarily reducing blood pressure by reducing blood volume.” So bloodletting did have usefulness, but the belief that it worked based upon “balancing bodily humors” did not contain truth. All scientific paradigms (such as bloodletting) are part of an unending exploration of mysteries, and do not deal in “cold, hard facts.” ***The usefulness of scientific theories should not be confused with their truth.*** But science has provided us with air travel, amazing medicines, computers, and a whole list of other advances! Considering such facts, shouldn’t we just listen to what science has to tell us? Freeman Dyson, who holds the professorship in physics at Princeton University formerly held by Albert Einstein, comments in his 2011 essay How We Know, that the usefulness of scientific theories should not be confused with their truth: “Among my friends and acquaintances, everybody distrusts Wikipedia and everybody uses it. Distrust and productive use are not incompatible. Wikipedia is the ultimate open source repository of information. Everyone is free to read it and everyone is free to write it. It contains articles in 262 languages written by several million authors. The information that it contains is totally unreliable and surprisingly accurate. It is often unreliable because many of the authors are ignorant or careless. It is often accurate because the articles are edited and corrected by readers who are better informed than the authors.” “…The public has a distorted view of science, because children are taught in school that science is a collection of firmly established truths. In fact, science is not a collection of truths. It is a continuing exploration of mysteries.” “…Science is the sum total of a great multitude of mysteries. It is an unending argument between a great multitude of voices. It resembles Wikipedia much more than it resembles the Encyclopedia Britannica.” Dominant scientific theories have a long history of eventually being outright rejected. William Dembski notes in Uncommon Dissent: “Despite all the propaganda to the contrary, science is not a juggernaut that relentlessly pushes back the frontiers of knowledge. Rather, science is an interconnected web of theoretical and factual claims about the world that are constantly being revised. Changes in one portion of the web can induce radical changes in another. In particular, science regularly confronts the problem of having to retract claims that it once boldly asserted.” “Consider the following example from geology: In the nineteenth century the geosynclinal theory was proposed to account for the origination of mountain ranges. This theory hypothesized that large trough-like depressions, known as geosynclines, filled with sediment, gradually became unstable, and then, when crushed and heated by the earth, elevated to form mountain ranges. To the question ‘How did mountain ranges originate?’ geologists as late as 1960 confidently asserted that the geosynclinal theory provided the answer. In the 1960 edition of Clark and Stearn’s Geological Evolution of North America, the status of the geosynclinal theory was even favorably compared with Darwin’s theory of natural selection.” “Whatever became of the geosynclinal theory? An alternative theory, that of plate tectonics, was developed. It explained mountain formation through continental drift and sea-floor spreading. Within a few years, it had decisively replaced the geosynclinal theory. The history of science is filled with such turnabouts in which confident claims to knowledge suddenly vanish from the scientific literature. The geosynclinal theory was completely wrong. Thus, when the theory of plate tectonics came along, the geosynclinal theory was overthrown.” ***The science of one age becomes the myth or pseudo-science of the next*** Biologist Lynn Margulis, winner of the U.S. Presidential Medal for Science, put it best in her book What Is Life?: “…Science is asymptotic. [“asymptote” is derived from a Greek word meaning “not falling together.”] It never arrives at but only approaches the tantalizing goal of final knowledge. Astrology gives way to astronomy; alchemy evolves into chemistry. The science of one age becomes the mythology of the next.” Those with a short-sighted view of the history of science are prone to overlook the fact that alchemy (which believed that metals such as lead could be turned into gold) and astrology were once considered scientifically respectable. In fact, as Margulis alludes to above, the scientific consensus of one age usually becomes the myth or superstition of the next age. Elite physicists Paul Davies and John Gribbin cite examples of this trend among scientific theories in their book The Matter Myth: “A classic example concerns the ‘luminiferous ether.’ When James Clerk Maxwell showed that light is an electromagnetic wave, it seemed obvious that this wave had to have a medium of some sort through which to propagate. After all, other known waves travel through something. Sound waves, for example, travel through the air; water waves travel across the surface of lakes and oceans. Because light, which Maxwell discovered is a form of electromagnetic wave, can reach us from the Sun and stars, across seemingly empty space, it was proposed that space is actually filled with an intangible substance, the ether, in which these waves could travel.” “So sure were physicists of the existence of the ether that ambitious experiments were mounted to measure the speed with which the Earth moves through it. Alas, the experiments showed conclusively that the ether does not exist…for nineteenth-century physicists, however, the ether was still very real.” In his famous work on the history, philosophy, and sociology of science titled The Structure of Scientific Revolutions, physicist Thomas Kuhn describes how the history of science makes it difficult to justify the characterization of science as “an ever growing stockpile [of] knowledge,” or a “process of accretion”. In part, this is because most scientific theories (or models) which were accepted by the scientific communities of the past are now perceived as pseudo-science or myth. Kuhn cites the examples of Aristotelian dynamics (which was superseded by Newtonian physics), phlogistic chemistry (which said that a fire-like element called phlogiston is contained within combustible bodies and released during combustion), and caloric thermodynamics (which said that heat is really a self-repellent fluid called caloric that flows from hotter bodies to colder bodies). (Click here for several dozen more examples). If these theories were regarded as “science” in their day, but as error and superstition today, then why should we not assume that the scientific theories of today will become the error and superstition of tomorrow? Kuhn writes: “Historians confront growing difficulties in distinguishing the ‘scientific’ component of past observation and belief from what their predecessors had readily labeled ‘error’ and ‘superstition.’ The more carefully they study, say, Aristotelian dynamics, phlogistic chemistry, or caloric thermodynamics, the more certain they feel that those once current views of nature were, as a whole, neither less scientific nor more the product of human idiosyncrasy than those current today. If these out-of-date beliefs are to be called myths, then myths can be produced by the same sorts of methods and held for the same sorts of reasons that now lead to scientific knowledge. If, on the other hand, they are to be called science, then science has included bodies of belief quite incompatible with the ones we hold today. Given these alternatives, the historian must choose the latter. Out-of-date theories are not in principle unscientific because they have been discarded. That choice, however, makes it difficult to see scientific development as a process of accretion.” The history of science has very bad news for the theory of evolution. ",
            "date": "Updated October 20, 2020",
            "views": "821",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Brett Passmore",
                    "user_href": "/profile/Brett-Passmore"
                },
                {
                    "user_id": "Stephen Sibbald",
                    "user_href": "/profile/Stephen-Sibbald-1"
                },
                {
                    "user_id": "Randy Fennell",
                    "user_href": "/profile/Randy-Fennell-3"
                },
                {
                    "user_id": "Riccardo Zanardi",
                    "user_href": "/profile/Riccardo-Zanardi-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Krister Sundelin",
                "href": "/profile/Krister-Sundelin"
            },
            "answer_text": "Q: What is the meaning of “Science isn't a faith, but rather a method that takes time to unfold. It is therefore wrong to uncritically embrace everything you read”? A: Exactly what it says: Science isn't a faith: Science is not a religion. It is a method to gather knowledge, and the body of knowledge gathered. There’s no dogma. At most there is consensus, and it is challenged all the time. However, it is a lot to study. Science is not built on faith, but on trust – trust that all those that came before you did their job correctly, and that the method worked and everyone did their job at testing their progress correctly. but rather a method: Although science is built on trust, it is only trust to a degree: scientists are only human. So in order to maintain that trust, results are tested and tested again, by the scientist as well as independent scientists. This verification is perhaps the most important part of the method: you don’t only test things yourself against controls and repeatedly, but you have other people test it as well. that takes time to unfold: As a result, you don’t get results at once. Testing takes time. On top of that, we don’t get to know everything at once, and science is not set in stone. Every article, every paper, every PhD, expands the knowledge base of science a little bit. But science is also not immutable. It changes over time. It expands into the unknown. It self-corrects. It gets better with time. It is therefore wrong to uncritically embrace everything you read: This is the heart of the scientific method, to question everything, including (and perhaps most importantly) your own results. You can’t even trust what you know. Instead, you have to follow the evidence wherever it leads, even if it goes against everything you thought you knew. There’s a special warning about pop science as well. Pop sci journalists are not always up to date, sometimes not even scientifically literate, and they are writing for an audience who is not always scientifically literate. So when they write something, you should take it with a grain of salt. ",
            "date": "Answered October 18, 2020",
            "views": "587",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Erika Oduor",
                    "user_href": "/profile/Erika-Oduor"
                },
                {
                    "user_id": "Erik Sieurin",
                    "user_href": "/profile/Erik-Sieurin"
                },
                {
                    "user_id": "Gary Braithwaite",
                    "user_href": "/profile/Gary-Braithwaite"
                },
                {
                    "user_id": "Ahmet Caliskan",
                    "user_href": "/profile/Ahmet-Caliskan-4"
                },
                {
                    "user_id": "Stephen Sibbald",
                    "user_href": "/profile/Stephen-Sibbald-1"
                },
                {
                    "user_id": "Mario Perez",
                    "user_href": "/profile/Mario-Perez-329"
                },
                {
                    "user_id": "Rhys Neyle",
                    "user_href": "/profile/Rhys-Neyle"
                },
                {
                    "user_id": "Daniel Braga da Silva",
                    "user_href": "/profile/Daniel-Braga-da-Silva"
                }
            ]
        }
    ]
}