{
    "title": "What is a good average GPA in high school? - Quora",
    "tags": [
        "High School Grade Point Averages",
        "Advice on Grade Point Averages",
        "Grade Point Averages",
        "High School Education",
        "Academic and Educational Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Adam Cronce",
                "href": "/profile/Adam-Cronce"
            },
            "answer_text": "That depends on where your standards lie, and what your future goals are.   When I was in high school, my cumulative C/C+ average (GPA~2.0-2.3) was perfectly sufficient. I wasn't going to be attending college afterwards, I was going to go off and play music in a band. I didn't really care about school; it was something I just had to get through so I could have more free time to do the things I truly wanted to do. The last ever picture taken of me on my high school grounds was me giving the building the middle finger. Such a rebel.  During that time after high school (6 years), I experienced what the world had to offer someone who didn't have a valuable college education; and it wasn't good (although I had a blast playing in the band). I still had to work a normal job, and I ended up working really crappy jobs for extremely long hours and absolutely no thanks. The best job I could get with my qualifications was about $15/hr, which I recognize is more than many, but it was an ultimate dead end, plain and simple.  I started planning to return to university. I quickly found that my perfectly sufficient C average was no longer perfectly sufficient. I wanted to go into engineering, and most decent schools generally require an upper B average (or better) for admittance, along with some extracurriculars that demonstrate that you are more than just an anti-social bookworm.  I went to Community College to reset my GPA and start again. I got a 3.94. Only one B the entire time, and I'm still bitter about it ;). The cliche was correct: I just had to apply myself. It helped that I had the motivation of knowing firsthand what my other option was.  Only at this point did my high school GPA not matter, because I had proven that I was capable of getting good grades in more difficult courses. Long story short, I was admitted to the University I really wanted to attend, and my motivation still carries me through the vastly more difficult work that I presently have to do. And I'm doing it with a surely not-perfect but very healthy GPA.  To answer your question directly - I'm assuming you want to know in the context of future college admission. Keep it at 3.0 (B) or above if you can. Any less than that, and you should have some decent extracurriculars to make up for the difference.  ",
            "date": "Answered February 29, 2016",
            "views": "47",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lily Ngo",
                    "user_href": "/profile/Lily-Ngo-22"
                },
                {
                    "user_id": "Jane Doe",
                    "user_href": "/profile/Jane-Doe-4241"
                },
                {
                    "user_id": "Emma Martin",
                    "user_href": "/profile/Emma-Martin-44"
                },
                {
                    "user_id": "Preston Becker",
                    "user_href": "/profile/Preston-Becker"
                },
                {
                    "user_id": "Joe Klunder",
                    "user_href": "/profile/Joe-Klunder"
                }
            ]
        }
    ]
}