{
    "title": "What is the importance of math in biochemistry? - Quora",
    "tags": [
        "Biochemistry (college major)",
        "Learning About Biochemistry",
        "Biochemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Genís Calderer",
                "href": "/profile/Genís-Calderer"
            },
            "answer_text": "Biochemistry’s need for math depends on what are you focused on. If your focus is more centered in the bio part of biochemistry, you won’t need very high mathematics to understand it. Metabolical pathways, molecular genetics, cell biology are more conceptual than mathematical. A decent grasp of differential calculus I think would be enough. However, if you are focused on the chemistry part, thermodynamics may require a higher knowledge of calculus. Besides the calculus part and the different requirements of topic, biochemistry, as any other field, requires a decent comprehension of statistics. Empirical sciences using the scientific method require statistics to claim facts. Therefore anyone studying whichever field of biology or chemistry, needs to understand statistical inference in order to be able to do quality research. In addition to that, I, as a student of both mathematics and biochemistry, think that the more math you know, the better you will get at any other scientific discipline. Math helps you structure the way you look at problems, and it can really make a difference when it comes to study chemistry or biology or whatever. Biochemistry is not very demanding (up to a point) but it certainly gets better and easier if you are proficient at math. ",
            "date": "Answered September 28, 2017",
            "views": "42",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ioan Gotcan",
                    "user_href": "/profile/Ioan-Gotcan"
                },
                {
                    "user_id": "Thaddeus Eze",
                    "user_href": "/profile/Thaddeus-Eze"
                },
                {
                    "user_id": "Wesley Queiroz",
                    "user_href": "/profile/Wesley-Queiroz-1"
                },
                {
                    "user_id": "Sabrina Rocha",
                    "user_href": "/profile/Sabrina-Rocha-21"
                },
                {
                    "user_id": "Bennett Tomlin",
                    "user_href": "/profile/Bennett-Tomlin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bennett Tomlin",
                "href": "/profile/Bennett-Tomlin"
            },
            "answer_text": "The short answer is that it depends. If your work for example is focused on membranes and their structure you will likely need to understand math through at least differential equations in order to understand the thermodynamics at play. Also no matter what you will need a solid grasp on statistical analysis in order to understand and present results. ",
            "date": "Answered January 30, 2018",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Isaac Bromberg",
                    "user_href": "/profile/Isaac-Bromberg"
                },
                {
                    "user_id": "Bree Ford",
                    "user_href": "/profile/Bree-Ford-9"
                }
            ]
        }
    ]
}