{
    "title": "What is the best pre-med course? - Quora",
    "tags": [
        "Pre-Medical",
        "Best of X",
        "Educational Courses",
        "Medical School"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Keyes",
                "href": "/profile/Michael-Keyes-14"
            },
            "answer_text": "In the United States the pre-requisites for medical school are clearly spelled out by the schools. Basically they include specific courses heavily weighted in the sciences. In order to get into a US medical school you have to do particularly well in those courses and very well in the rest of your studies. This means that you can major in anything you want. Not that a degree in Fashion Design will help all that much, most applicants are science majors, but by demonstrating that you are an outstanding student you satisfy the concerns of the medical schools who are looking for specific mental skills, namely intelligence, good working memories, perseverance and motivation. In addition you are competing against a group of similarly endowed applicants so the better the grades, the more you stand out. After that, it is a matter of doing well on the MCAT, having out outstanding recommendations, interesting and pertinent extra-curricular skills, and impressing during the interview. It helps to come from a school that is academically elite but many state schools will not look at that as much as your state of origin. It is a long, sometimes boring, always tense road that requires dedication and focus. (And that is the good part, as Hunter Thompson says.) Major in something you are interested in, it is easier. The world of ideas is out there for you to revel in it, even if you have to take Organic Chemistry and get an A. If you find it tedious, then medical school may not be for you because pre-med is only a preliminary to the hard work found in medical school. ",
            "date": "Answered January 15, 2018",
            "views": "13",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alphā Embido",
                    "user_href": "/profile/Alphā-Embido"
                },
                {
                    "user_id": "Jenny Hall",
                    "user_href": "/profile/Jenny-Hall-3"
                },
                {
                    "user_id": "John Collins",
                    "user_href": "/profile/John-Collins-211"
                },
                {
                    "user_id": "Therese Omictin",
                    "user_href": "/profile/Therese-Omictin"
                },
                {
                    "user_id": "Tuan Nguyen",
                    "user_href": "/profile/Tuan-Nguyen-355"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sumya Hasan",
                "href": "/profile/Sumya-Hasan"
            },
            "answer_text": "Well if you mean what to take as someone who is “pre med” you don’t get too many opportunities to pick which courses you want. There is a standard set of classes you need to take and pass. 2 semesters of biology 2 semesters of general chemistry 2 semesters of organic chemistry 2 semesters of physics I believe a semester of calculus but don’t quote me on that, and biochemistry is either highly recommended or a requirement. But the 8 semesters of the other sciences I mentioned are standard. Students typically end up finishing these requirements before senior year. For example you can take your bio and gen chem in freshmen year and have those 4 classes done by the time you’re a sophomore Whatever else you want to major in or take that is entirely up to you. Pre med is not a major that you declare in most universities. You declare a separate major on top of being pre med ",
            "date": "Answered February 28, 2018",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joshua Brown",
                    "user_href": "/profile/Joshua-Brown-84"
                },
                {
                    "user_id": "Liang-Hai Sie",
                    "user_href": "/profile/Liang-Hai-Sie"
                }
            ]
        }
    ]
}