{
    "title": "What is the meaning of scientific evidence? - Quora",
    "tags": [
        "Scientific Method",
        "Evidence",
        "Word Definitions, Terminology, and Jargon",
        "Scientific Research",
        "Science of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Ferguson",
                "href": "/profile/John-Ferguson-33"
            },
            "answer_text": "The evidence should be derived from a repeatable experiment in which you can accurately predict a measured outcome given an initial set of conditions. The repeatable part should apply to different people performing the same experiment in different times and locations but who still produce the same measurements (given the same starting conditions). Scientific experimentators should also be conscious of independent variables which may influence the results. For example, does air pressure or temperature have an impact on the result? To rule this out, the variable needs to either be removed (i.e. perform the experiment in a vacuum) or controlled (i.e. perform the same experiment in different conditions and compare the results). Repeatability is the essence of peer review. If I observe something unexpected, someone else should be able to follow my steps and observe the same thing. A famous example of this in action is the EmDrive. Developed by British inventor Roger Shawyer in 2001, the EmDrive is a hypothetical propellant-free thruster; something which violates known laws of Physics. Despite incredulity at his idea within the scientific community as a theoretical level, there have been numerous independent experiments, which have yielded puzzling results.[1] While very few in the scientific community believe the EmDrive really works, there’s a not-insignificant amount of real science being done to show it doesn’t. Footnotes[1] A Mythical Form of Space Propulsion Finally Gets a Real Test",
            "date": "Answered July 15, 2019",
            "views": "168",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Liam Perras",
                    "user_href": "/profile/Liam-Perras"
                },
                {
                    "user_id": "David Moore",
                    "user_href": "/profile/David-Moore-408"
                },
                {
                    "user_id": "Ercan Cem",
                    "user_href": "/profile/Ercan-Cem"
                },
                {
                    "user_id": "Rob Thomas",
                    "user_href": "/profile/Rob-Thomas-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frits van Zanten",
                "href": "/profile/Frits-van-Zanten"
            },
            "answer_text": "Generally it means you follow some rules and procedures, to make sure that what you found is free from thinking and measuring errors (a.o. “Did you measure what you claimed you measured? ”), and that it’s is not caused by coincidence (a (un)lucky shot). This coincidence needn’t be real coincidence, it might be other causes disguised as coincidence. Following these rules should makes sure that repeated measuring gives the same results. Sadly, these rules and procedures do not solidly prevent scientists from finding their preferred outcome (preferred by their own ambition or the ambition of their sponsor). An aspect of importance is that is matters whether you study living people, with their own will and objectives, or lifeless matter like chemicals, stones or springs. In between are birds, foxes and other animals. Living creatures are more complex, and that makes it harder to prove things. Finally, scientific evidence is something else as ‘truth’. ",
            "date": "Answered July 15, 2019",
            "views": "195",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ercan Cem",
                    "user_href": "/profile/Ercan-Cem"
                }
            ]
        }
    ]
}