{
    "title": "What are some of the most interesting organometallic compounds? - Quora",
    "tags": [
        "Organometallic Chemistry",
        "Chemistry of Everyday Life",
        "List Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Goodman",
                "href": "/profile/Robert-Goodman-15"
            },
            "answer_text": "As a biochemist, I was going to go along with Malcolm Sargeant's answer, and bring up the fact that many enzymes & similarly-functioning proteins also include metals, and then I stopped & thought, what are the limits of what's considered \"organometallic\"?  I looked here:http://www.ilpi.com/organomet/organometallics.htmland saw a remarkably restrictive definition.  The journal by that name starts out saying:\"For the purposes of this journal, an \"organometallic\" compound will be defined as one in which there is a bonding interaction (ionic or covalent, localized or delocalized) between one or more carbon atoms of an organic group or molecule and a main group, transition, lanthanide, or actinide metal atom (or atoms).\"Gah!  That eliminates from the club heme, chlorophyll, & similar compounds where the metal's linked only via N or O or S of a protein or prosthetic group.  But then they immediately start to hedge:\"Following longstanding tradition, organic derivatives of the metalloids (boron, silicon, germanium, arsenic, and tellurium) will be included in this definition.\"Still no help to the biologics I was thinking of.  But then:\"Furthermore, manuscripts dealing with metal-containing compounds which do not contain metal-carbon bonds will be considered as well if there is a close relationship between the subject matter and the principles and practice of organometallic chemistry. Such compounds may include, inter alia, representatives from the following classes: molecular metal hydrides; metal alkoxides, thiolates, amides, and phosphides; metal complexes containing organo-group 15 and 16 ligands; metal nitrosyls....\"Without pursuing the link to the entire policy, I'll just assume the edges are fuzzy enough to include those biomolecules.  But how far can we take it?  I've answered a lot of questions here about soaps, most of which are metal carboxylate salts.  Does stuff count as organometallic when the metal has only an ionic connection?  Or do you need at least 1 covalent bond between the metal and the rest for it to count?  A lot of enzymes require for their activity Mg+2-phosphate bonds that are strictly ionic, but tight enough to be pretty stable in water, so you could say the metal ion makes them \"interesting\". ",
            "date": "Answered April 22, 2016",
            "views": "480",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Christopher Wells",
                "href": "/profile/Christopher-Wells-10"
            },
            "answer_text": "There are several organometallic complexes that have unusual structures.  In my photo album collection of organometallics, I have these compounds:   A double-decker sandwich complex of titanium and three cyclooctatetraene molecules.   A trimeric amide complex of gold, that can develop luminescence properties.  One of my former Siena College professors, Dr. Jess Vickery, studied these complexes, and the trimer is kept together by the gold-gold interactions in the triangular ring.   A sandwich complex featuring nickel atoms and fulvalene molecules.   A hydrido complex of iron, with cyclopentadienyl anions and bridging hydrogen ligands joining the two iron atoms.   A tetraborane-cobalt complex with a cyclopentadienyl ligand.  The tetraborane is kept together by three-center two-electron bonds among the boron and hydrogen atoms.   A vanadium complex with pentalene as one of the ligands.  Pentalene is anti-aromatic because it carries eight pi electrons, but it can behave as a diallyl ligand to the vanadium atom, bending its shape and removing the anti-aromaticity in the process.   The tetrameric form of methyllithium.  As the monomer is electron-deficient, the lithium atoms coordinate with the methyl groups to stabilize the monomers.   A facial osmium carbonyl complex with the benzene ring bridging all three osmium atoms at once.   A ruthenium carbonyl complex with an interstitial carbon atom inside the octahedron of ruthenium atoms.   And the last example is a benzyne complex of zirconium, with a trimethylphosphine and two cyclopentadienyl ligands. ",
            "date": "Answered July 27, 2014",
            "views": "13",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Malcolm Sargeant",
                    "user_href": "/profile/Malcolm-Sargeant"
                },
                {
                    "user_id": "Arjun Narayanan",
                    "user_href": "/profile/Arjun-Narayanan-13"
                },
                {
                    "user_id": "Stuart Ferrie",
                    "user_href": "/profile/Stuart-Ferrie"
                },
                {
                    "user_id": "Chiru Polo",
                    "user_href": "/profile/Chiru-Polo"
                },
                {
                    "user_id": "Bobby Wan",
                    "user_href": "/profile/Bobby-Wan-3"
                },
                {
                    "user_id": "Michael Flynn",
                    "user_href": "/profile/Michael-Flynn-2"
                },
                {
                    "user_id": "Jeff Paik",
                    "user_href": "/profile/Jeff-Paik-1"
                },
                {
                    "user_id": "Alex K. Chen",
                    "user_href": "/profile/Alex-K-Chen"
                },
                {
                    "user_id": "Sameer Saxena",
                    "user_href": "/profile/Sameer-Saxena-1"
                }
            ]
        }
    ]
}