{
    "title": "What are some of the craziest theories about black holes? - Quora",
    "tags": [
        "Holes",
        "Black Holes",
        "Cosmology",
        "Astrophysics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Parteek Mandhan",
                "href": "/profile/Parteek-Mandhan-1"
            },
            "answer_text": "A new theory, proposed by researchers at KU Leuven University in Belgium, says that black holes are actually wormholes that serve as passages to other universes. One of the chief reasons for this new theory is the persistent problem presented by the nature of black holes: After passing a black hole's event horizon, matter falls in and is apparently annihilated. This absolute destruction of matter (and the \"information\" it represents) conflicts with the principles of quantum theory, which says that information can never be created or destroyed. To reconcile this knowledge with the huge, extremely powerful gravitational phenomenon we call 'black holes,' the team from KU Leuven proposed that black holes are actually \"exotic compact objects\" (ECOs), which behave similarly but are actually wormholes. For example, the observation of gravitational waves from two 'black holes' merging could also be explained by two rotating wormholes colliding. According to Pablo Bueno, a researcher associated with the project: \"Wormholes do not have an event horizon, but act as a space-time shortcut that can be traversed, a kind of very long throat that takes us to another universe, and the fact that they also have rotation changes the gravitational waves they produce.\" If black holes really are misunderstood wormholes, then scientists should be able to pick up 'echoes' of their gravitational waves after the initial wave fades away. Scientists have already picked up gravitational waves on the Laser Interferometer Gravitational-Wave Observatory (LIGO) and the Virgo interferometer, so the next step to test this wormhole theory is to watch for the hypothetical 'echoes' from that event. According to Bueno: \"The confirmation of echoes in the LIGO or Virgo signals would be a practically irrefutable proof that astrophysical black holes don't exist. Time will tell if these echoes exist or not. If the result were positive, it would be one of the greatest discoveries in the history of physics.\" ",
            "date": "Answered April 17, 2019",
            "views": "315",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brooke Comisky",
                    "user_href": "/profile/Brooke-Comisky"
                },
                {
                    "user_id": "Daniel Magnusson",
                    "user_href": "/profile/Daniel-Magnusson"
                },
                {
                    "user_id": "Benji Gromwald",
                    "user_href": "/profile/Benji-Bearr"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christian Gingras",
                "href": "/profile/Christian-Gingras-1"
            },
            "answer_text": "Black holes are black because they are dead. Yes, your eyes didn't hallucinates. Black holes don't contain hydrogen, they can't emit electromagnetic radiation because they are cold as ice… cold as the majority of deep space. When a star fall prey of that hungry vampire, it is seen emitting extreme radiation, one of the brightest light in the vast universe. It is like the last orgasm of a dying man. The inert helium from the star add to the mass of the black hole and contribute to cooling any atom that could feel excited. ",
            "date": "Answered June 2, 2019",
            "views": "54",
            "upvotes": "0"
        }
    ]
}