{
    "title": "What is COVID-19, and what has it done so far? - Quora",
    "tags": [
        "Viruses (biology)",
        "Medical Conditions and Diseases",
        "COVID-19 (2019-2020)",
        "Health"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marie Godfrey",
                "href": "/profile/Marie-Godfrey-2"
            },
            "answer_text": "What is the corona virus disease, and what has it done so far? According to the jhudashboard global report, as of 5–30–2020 9:30 pm Pacific Time, more than 6 million people have been confirmed to have been infected with SARS-CoV2, the virus that causes the disease COVID-19. The actual number may be twice that, or more. Nearly 360,000 have died of COVID-19. Again, numbers are certainly higher. The numbers only relfect reported and tracked cases. Those who did not die, might not have even known they were infected. They were however, able to pass the virus to uninfected people. Jn many countries, people were unable to get the care they needed and some died because of a lack of supplies and equipment. At the same time, the economy of the 188 affected countries was seriously damaged. Millions of people have lost their jobs, others have no food and need to stay in lines for hours to get one box for their family. People are unable to pay their bills and some have been thrown out of their homes. In countries that required people to “shelter at home”, families were separated, no one could travel outside, and yet “essential” people had to continue working even in dangerous situations. The virus is a submicroscopic entity that is comprised of only an envelope and some RNA, a chemical that includes directions for making more virus. The virus growing in a human cell tends to shut off all normal cellular activity thus causing considerable side effects including lung difficulties, heart damage, kidney failure, and other serious problems. These are only some of the things that have resulted from transmission and infection of humans—of all ages—with the coronavirus known as SARS-CoV-2. ",
            "date": "Answered May 31, 2020",
            "views": "99",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Devin Shoulders",
                "href": "/profile/Devin-Shoulders"
            },
            "answer_text": "It’s shutdown the entire world (well partially anyway at this point most places doing better than others) the US is up to 105K cases and it didn’t even have to happen but to avoid getting political I’ll just say we could’ve handled it much better. It spreads very easily and severity ranges from food Smelling and tasting funny for a couple weeks, to death alone in a hospital without even as much as a funeral. I know that sounds blunt, but it doesn’t happen because that’s how the virus spreads regardless of wheter or not the person died from that disease. Covid Vaccine? Likely, but probably not until around this time next year. Maybe a little earlier if things go really well. ",
            "date": "Answered May 30, 2020",
            "views": "62",
            "upvotes": "0"
        }
    ]
}