{
    "title": "What are the unknown facts about ants? - Quora",
    "tags": [
        "Mind-Blowing Facts",
        "Ants (insect)",
        "Facts and Trivia",
        "Entomology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rishit Jain",
                "href": "/profile/Rishit-Jain-11"
            },
            "answer_text": "1. Ants are capable of carrying objects 50 times their own body weight with their mandibles. Ants use their diminutive size to their advantage. Continue Reading Below Relative to their size, their muscles are thicker than those of larger animals or even humans. This ratio enables them to produce more force and carry larger objects. If we had muscles in the proportions of ants, we'd be able to heave a Hyundai over our heads! 2. Soldier ants use their heads to plug the entrances to their nests and keep intruders from gaining access. In certain ant species, the soldier ants have modified heads, shaped to match the nest entrance. They block access to the nest by sitting just inside the entrance, with their heads facing out like a cork in a bottle. When a worker ant returns to the nest, it will touch the soldier ant's head to let the guard know it belongs to the colony. 3. Certain ant species defend plants in exchange for food and shelter. Ant plants, or myrmecophytes, are plants with naturally occurring hollows where ants can take shelter or feed. These cavities may be hollow thorns, stems, or even leaf petioles. The ants live in the hollows, feeding on sugary plant secretions or the excretions of sap-sucking insects. What do the plants get for providing such luxurious accommodations? Continue Reading Below The ants defend the plant from herbivorous mammals and insects, and may even prune away parasitic plants that attempt to grow on the host plant. 4. The total biomass of all the ants on Earth is roughly equal to the total biomass of all the people on Earth. How can this be?! Ants are so tiny, and we are so big! But scientists estimate there are at least 1.5 million ants on the planet for every human being. Over 12,000 species of ants are known to exist, on every continent except Antarctica. Most live in tropical regions. A single acre of Amazon rainforest may house 3.5 million ants. 5. Ants sometimes herd or tend to insects of other species, like aphids or leafhoppers. Ants will do just about anything to get the sugary secretions of sap-sucking insects, called honeydew. To keep the sweet stuff in close supply, some ants will herd aphids, carrying the soft-bodied pests from plant to plant. Leafhoppers sometimes take advantage of this nurturing tendency in ants, and leave their young to be raised by the ants. This allows the leafhoppers to go raise another brood. 6. Ants will enslave other ants, keeping them captive and making them do work for the colony. Quite a few ant species will take captives from other ant species, forcing them to do chores for their own colony. Some honeypot ants will even enslave ants of the same species, taking individuals from foreign colonies to do their bidding. Polyergus queens, also known as Amazon ants, raid the colonies of unsuspectingFormica ants. The Amazon queen will find and kill the Formica queen, then enslave the Formicaworkers. The slave workers help her rear her own brood. When her Polyergus offspring reach adulthood, their sole purpose is to raid otherFormica colonies and bring back their pupae, ensuring a steady supply of slave workers. 7. Ants lived alongside the dinosaurs. Ants evolved some 130 million years ago during the early Cretaceous period. Most fossil evidence of insects is found in lumps of ancient amber, or fossilized plant resin. The oldest known ant fossil, a primitive and now extinct ant species named Sphercomyrma freyi, was found in Cliffwood Beach, NJ. Though that fossil only dates back 92 million years, another fossil ant that proved nearly as old has a clear lineage to ants of present day. This suggests a much longer evolutionary line than previously thought, leading scientists to estimate the appearance of ants on Earth as somewhere around 130 million years ago. 8. Ants started farming long before humans. Fungus farming ants began their agricultural ventures about 50 million years before humans thought to raise their own crops. The earliest evidence suggests ants began farming as early as 70 million years ago, in the early Tertiaryperiod. Even more amazing, these ants used sophisticated horticultural techniques to enhance their crop yields. They secreted chemicals with antibiotic properties to inhibit mold growth, and devised fertilization protocols using manure. 9. Some ants form \"supercolonies,\" massive communities of ants that can stretch for thousands of miles. Argentine ants, native to South America, now inhabit every continent except Antarctica due to accidental introductions. Each ant colony has a distinctive chemical profile that enables members of the group to recognize each other, and alerts the colony to the presence of strangers. Scientists recently discovered that massive supercolonies in Europe, North America, and Japan all share the same chemical profile, meaning they are, in essence, a global supercolony of ants. 10. Ants follow scent trails laid by scout ants to gather food. By following pheromone trails created by other ants from the colony, foraging ants can gather and store food efficiently. A scout ant first leaves the nest in search of food, and wanders somewhat randomly until it discovers something edible. It will then consume some of the food and return to the nest in a straight, direct line. It seems these scout ants can observe and recall visual cues that enable them to navigate quickly back to the nest. Along the return route, the scout ant leaves a trail of pheromones, special scents that will guide her nestmates to the food. The foraging ants then follow her path, each one adding more scent to the trail to reinforce it for others. The workers will continue walking back and forth along the line until the food source is depleted. Source: insects.about.com ",
            "date": "Answered September 14, 2016",
            "views": "14",
            "upvotes": " View 37 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gina Lucas",
                    "user_href": "/profile/Gina-Lucas-19"
                },
                {
                    "user_id": "Evan Smith",
                    "user_href": "/profile/Evan-Smith-537"
                },
                {
                    "user_id": "Matti Ritvanen",
                    "user_href": "/profile/Matti-Ritvanen"
                },
                {
                    "user_id": "Shreenivas Chikati",
                    "user_href": "/profile/Shreenivas-Chikati-1"
                },
                {
                    "user_id": "Nicholas Liverpool",
                    "user_href": "/profile/Nicholas-Liverpool"
                },
                {
                    "user_id": "Anubis Jay Trout",
                    "user_href": "/profile/Anubis-Jay-Trout"
                },
                {
                    "user_id": "Ajay Ashwath",
                    "user_href": "/profile/Ajay-Ashwath"
                },
                {
                    "user_id": "Jose Velasquez",
                    "user_href": "/profile/Jose-Velasquez-28"
                },
                {
                    "user_id": "Jake Davis",
                    "user_href": "/profile/Jake-Davis-126"
                },
                {
                    "user_id": "Priyanka Dhengle",
                    "user_href": "/profile/Priyanka-Dhengle"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kushal Yadav",
                "href": "/profile/Kushal-Yadav-43"
            },
            "answer_text": " See this heap of soil on the ground. This is not mud. It is living. These are fire ants. Selenopsis invicta. The reason they are dangerous is because of its insane ability to survive in any condition. Researchers at the Georgia Institute of Technology filled a bucket with water and put these ants inside it. They survived. The ants have a special ability to link among themselves to form a chain of bodies. They form a gel like structure in water which helps them survive. Their insane ability can be tracked back to their evolutionary history. Native to the floodplains of South America , due to heavy rains their underground home would usually get flooded with water during the rainy season. So eventually they got really good at holding hands and staying together The ants of the colony stick together with the queen for reproduction and stay in the same way until a better habitat is found. Researchers have now concluded that the ants form a viscoelastic material and sometimes act as a highly viscous fluid under stress. When pressure is applied on the colony , they break and reform link in the way a slow fluid does. The bonds between them are like Hydrogen bonds. When they are forcefully drowned they form air bubbles around the colony which helps them get air. These ants are now causing a great problem due to waterlogged Houston roads, these ants keep floating until they reach any hard surface (log or house) Fire ant - Wikipedia What's Up With Those Floating Fire Ant Colonies in Texas? The bizarre physics of fire ants ",
            "date": "Answered September 3, 2017",
            "views": "22",
            "upvotes": " View 32 Upvoters",
            "upvoters": [
                {
                    "user_id": "Matti Ritvanen",
                    "user_href": "/profile/Matti-Ritvanen"
                },
                {
                    "user_id": "Chetan Nandanwar",
                    "user_href": "/profile/Chetan-Nandanwar"
                },
                {
                    "user_id": "Dripta Bhattacharjee",
                    "user_href": "/profile/Dripta-Bhattacharjee"
                },
                {
                    "user_id": "Shaurya Tiwari",
                    "user_href": "/profile/Shaurya-Tiwari-5"
                },
                {
                    "user_id": "Raman Singh",
                    "user_href": "/profile/Raman-Singh-536"
                },
                {
                    "user_id": "Rabindra Sahu",
                    "user_href": "/profile/Rabindra-Sahu-19"
                },
                {
                    "user_id": "Mukul J S",
                    "user_href": "/profile/Mukul-J-S"
                },
                {
                    "user_id": "Aman Chuniyana",
                    "user_href": "/profile/Aman-Chuniyana"
                },
                {
                    "user_id": "Reuben M Ralte",
                    "user_href": "/profile/Reuben-M-Ralte"
                },
                {
                    "user_id": "Krishna Pradeep",
                    "user_href": "/profile/Krishna-Pradeep-9"
                }
            ]
        }
    ]
}