{
    "title": "What are all diseases based on? - Quora",
    "tags": [
        "Medical Conditions and Diseases",
        "Health"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christopher Maloney",
                "href": "/profile/Christopher-Maloney"
            },
            "answer_text": "Short answer: All diseases, all human suffering, are the result of being alive. Being alive and poor tends to make things worse. Longer answer: Throughout written history, the definition and treatment of diseases have varied widely by culture and period. If we define disease in its broadest sense, “a particular quality, habit, or disposition regarded as adversely affecting a person or group of people”[1] then we suffer from a plentitude of diseases for which the cure cannot be found at our local pharmacies. I would argue that any more narrow definition leaves out addiction, mental illness, and environmental degradation leading to malnutrition and a host of other ills. What we see within medicine is a narrowing of focus toward those diseases that seem most traumatic and which may be most easily improved by radical, individual intervention. More recently, we also have started seeing a focus on diseases that may be treated by new pharmaceuticals or devices. You may never have known that you lacked something until an advertisement tells you that life could be better. At the same time, for illnesses that elude a quick fix we rarely hear much discussion. I would love to see a pill for poverty because it is the root cause of much suffering. And I would seriously consider StressX, an imaginary pill that would lower my overall stress levels (without side effects, of course). If we acknowledge that 75–90% of medical office visits are stress-related,[2] then why aren’t we trying to treat the underlying disease rather than its corollaries (blood pressure, metabolic syndrome, etc.)? The simple answer is that when we lack treatment, we tend to ignore the disease. But in its broadest form, human suffering is not treated in the doctors’ office. It is treated in our communities and staterooms. When we look at the global basis for diseases, poverty is the cause of much direct and indirect suffering.  (Image from Sippakorn via Pixabay) Footnotes[1] Disease | Definition of Disease by Oxford Dictionary on Lexico.com also meaning of Disease[2] The Effects of Stress on Your Body",
            "date": "Answered October 18, 2020",
            "views": "819",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Archie",
                    "user_href": "/profile/Archie-703"
                }
            ]
        },
        {
            "author_info": {
                "name": "Patricia Yeargin",
                "href": "/profile/Patricia-Yeargin-1"
            },
            "answer_text": "All diseases are based on dysfunction or abnormality somewhere in the body, sufficient to cause some detectable disruption — pain, swelling, abnormal growth, immune response to perceived invaders, cellular death, metabolic changes, etc. They can be caused by any number of things, internal or external, physical or emotional. The list is endless. In other words, pathophysiology. ",
            "date": "Answered August 9, 2020",
            "views": "801",
            "upvotes": " Answer requested by Jim King"
        }
    ]
}