{
    "title": "What is the best example of law of attraction? - Quora",
    "tags": [
        "Law of Attraction",
        "Attraction (interpersonal)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sora Go",
                "href": "/profile/Sora-Go"
            },
            "answer_text": "Take a very good look at your relationship with your mother and father. See the people in your close vicinity (people you both love and hate) share those similarities in their personalities. Look at the people you are attracted to and see how similar they are to the opposite gendered parent. If you are homosexual, explore if you are embody more “feminine” or “masculine” energy and discern from there. We attract who we are. Who we are is a response to our mother and father. Either we are similar to them or contradicting to them. We unconsciously attract situations and scenarios that replay similar feelings of our childhood past. And for as long as you know how to psychoanalyze your limited core beliefs and do inner child work, you can start having some real control in your reality which is essentially a reflection of you. That’s the real simple answer to how the law of attraction works. To me, it’s essentially Freudian & Jungian psychology. The metaphysical aspect, for me, is that I think it’s amazing how detailed and on-time the universe can be when it comes to playing out our psyches. ",
            "date": "Answered November 22, 2017",
            "views": "15",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vamshi",
                    "user_href": "/profile/Vamshi-165"
                },
                {
                    "user_id": "Anjola Fashawe",
                    "user_href": "/profile/Anjola-Fashawe"
                },
                {
                    "user_id": "Rajani Neopaney",
                    "user_href": "/profile/Rajani-Neopaney"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pam Luna",
                "href": "/profile/Pam-Luna-3"
            },
            "answer_text": "For example, people who are in debt and continually tell themselves, “I need more money,” don't find more money, they continue to attract “need more money” because that is the reality that they create. The 3 Laws of Attraction are: Like Attracts Like. Nature Abhors a Vacuum. The Present is Always Perfect. Go to my Profile and you can find all about Law of Attraction material there... ",
            "date": "Answered August 29, 2020",
            "views": "210",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lynette Goodwin",
                    "user_href": "/profile/Lynette-Goodwin-3"
                },
                {
                    "user_id": "Michelle Erickson",
                    "user_href": "/profile/Michelle-Erickson-99"
                },
                {
                    "user_id": "Sandy Armstrong",
                    "user_href": "/profile/Sandy-Armstrong-28"
                },
                {
                    "user_id": "Martha Wallace",
                    "user_href": "/profile/Martha-Wallace-16"
                },
                {
                    "user_id": "Joan Spencer",
                    "user_href": "/profile/Joan-Spencer-15"
                },
                {
                    "user_id": "Delores Robertson",
                    "user_href": "/profile/Delores-Robertson-8"
                },
                {
                    "user_id": "Myra Thompson",
                    "user_href": "/profile/Myra-Thompson-20"
                },
                {
                    "user_id": "Sabrina Miller",
                    "user_href": "/profile/Sabrina-Miller-207"
                }
            ]
        }
    ]
}