{
    "title": "What's the most rigorous or hardest undergraduate computer science course taught at universities? - Quora",
    "tags": [
        "Computer Science Education and Career Advice",
        "Computer Science Education Career Advice",
        "Career Advice and Computer Science Education",
        "Computer Science Education Advice",
        "Career Advice in Computer Science",
        "College Advice for Careers",
        "Computer Science Education",
        "College Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christopher Pow",
                "href": "/profile/Christopher-Pow"
            },
            "answer_text": "This was my experience, but as Girish Sarda says, in essence, YMMV... Hardest for depth and breadth of content covered in a single semester: CompilersOperating systemsComputer architectureEach of these knocked me on my ass in a big way but I still feel like I learned an incredible amount from all. Compilers -- build your own. Operating systems -- build your own. Computer architecture -- build your own, many many different ways. Hardest for abstract content and/or rote memorization requirements: StatisticsDiscrete mathematicsAnalog circuitsEach of these knocked the wind out of me not for lack of being the earliest fucking classes [8am WTF?!]. I always considered myself strong in math, having excelled all the way up through the calculi and differential equations in high school and \"13th grade\" [junior college]. But something about statistics and discrete mathematics was just plain...[b/sn]oring! And hearing the [Iranian, if I recall] prof yell \"TAUTOLOGY!\" at 8am wasn't a welcome wake-up call. The first time I took analog circuits it was a blur of thisformulathatformulathiscurvethatcurve. I didn't make it. Well, technically I passed but I wasn't satisfied so I [like a dumbass] went for it again. The second time it was a bit less of a blur but still OMGithurts! To this day I shudder at the sight of an inductor on a schematic. But I know a little bit more than nothing about them. Hardest for \"you idiot, why are you doing this to yourself?!\": Data structures and algorithms in C++Not by itself a terribly challenging course. [I can hear the algorithm trolls after me now!!!] But not the place I'd recommend trying to learn C++. You'll be rounding the first curve of the racetrack as your classmates [who separately and smartly took \"Intro to C++\" last semester] are finishing their second lap. Not fun! ",
            "date": "Answered June 23, 2015",
            "views": "54",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jessica Su",
                    "user_href": "/profile/Jessica-Su"
                },
                {
                    "user_id": "Mahesh",
                    "user_href": "/profile/Mahesh-1431"
                },
                {
                    "user_id": "Carine Ammons",
                    "user_href": "/profile/Carine-Ammons"
                },
                {
                    "user_id": "Krishnendu Chakraborty",
                    "user_href": "/profile/Krishnendu-Chakraborty-6"
                },
                {
                    "user_id": "Gabriel Souza Ribeiro",
                    "user_href": "/profile/Gabriel-Souza-Ribeiro"
                },
                {
                    "user_id": "Abhinav Unnam",
                    "user_href": "/profile/Abhinav-Unnam"
                },
                {
                    "user_id": "Jay Patel",
                    "user_href": "/profile/Jay-Patel-359"
                },
                {
                    "user_id": "Krishna Sai",
                    "user_href": "/profile/Krishna-Sai-49"
                },
                {
                    "user_id": "Yohanes Yuen",
                    "user_href": "/profile/Yohanes-Yuen"
                },
                {
                    "user_id": "Steve Stevens",
                    "user_href": "/profile/Steve-Stevens-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Greg Kemnitz",
                "href": "/profile/Greg-Kemnitz"
            },
            "answer_text": "When I was an undergrad (which was a long time ago), the toughest class at Berkeley by sheer volume of work was CS 184, Computer Graphics.  You basically were given a sheet of Tektronix 4125 terminal opcodes and told to use these opcodes to do your assignments, up to and including 3-d rendering.  Graphics libraries?  You had putchar() :) You knew fully well that you had what it took to be a high-level programmer after that class, as you had to write _everything_ yourself, from the opcode library (the first thing anyone with any sense wrote) to a description language, to the Gouraud shading and Phong shading algorithms.  If you got multiple point light sources to work, you got extra credit. The actual programming involved everything from terminal control to scientific programming (round-off error caused ugly artifacts - and loss of points - so you learned to handle it in your code) to writing language interpreters and simple execution engines (to handle the graphics language) - as well as the graphics algs themselves, which both involved heavy CS and nontrivial physics (to get the light sources and shadow stuff to work). Oh, and you had a single VAX-11/780 to run your assignments on, along with everyone else in the class.  Running your Phong rendering could take a day.  I ended up writing nearly 10,000 lines of C for that class (and only got a B+ as I horked the final :( ) Other classes had more theoretical material (the CS 170-172-174 series was pretty tough with CS theory, and actual CS majors often did worse than math majors in these as they involved lots of proofs), but this class forced more late drops than any other. ",
            "date": "Answered August 7, 2015",
            "views": "291",
            "upvotes": " View 81 Upvoters",
            "upvoters": [
                {
                    "user_id": "Glendon Tan",
                    "user_href": "/profile/Glendon-Tan"
                },
                {
                    "user_id": "Chandrabhatta Sriram",
                    "user_href": "/profile/Chandrabhatta-Sriram"
                },
                {
                    "user_id": "Al Simmons",
                    "user_href": "/profile/Al-Simmons-27"
                },
                {
                    "user_id": "Elizabeth Archer",
                    "user_href": "/profile/Elizabeth-Archer-12"
                },
                {
                    "user_id": "Cole Easton",
                    "user_href": "/profile/Cole-Easton"
                },
                {
                    "user_id": "Cédric Segers",
                    "user_href": "/profile/Cédric-Segers"
                },
                {
                    "user_id": "Chuyen Hang Ngay",
                    "user_href": "/profile/Chuyen-Hang-Ngay"
                },
                {
                    "user_id": "Kshitij Sachan",
                    "user_href": "/profile/Kshitij-Sachan-1"
                },
                {
                    "user_id": "Motoko Kusanagi",
                    "user_href": "/profile/Motoko-Kusanagi-6"
                },
                {
                    "user_id": "Vineet Kumar",
                    "user_href": "/profile/विनीत-कुमार-Vineet-Kumar"
                }
            ]
        }
    ]
}