{
    "title": "What would happen if we found (intelligent) life, and would it even matter? - Quora",
    "tags": [
        "Extraterrestrial Life",
        "Intelligence",
        "Hypothetical Scenarios",
        "Philosophy of Everyday Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pablo Novi",
                "href": "/profile/Pablo-Novi-1"
            },
            "answer_text": "Are you asking if we found (intelligent) life on Earth? (Please excuse the humor, lol) A bit more seriously ... If we found life (of any level of development) elsewhere in the universe; it would REVOLUTIONIZE human-kind's thinking. Why? 1) We wouldn't be alone - this would both make us feel a lot less lonely; but also a lot less unique and/or special - helping to put our attitude towards life on Earth in a much better perspective. 2) It would tremendously challenge Earth-based religious belief - how could some god(s) create Earth-life, especially in regards us humans) in \"his\" own image - if he/she/they/it had created life in other places too? 3) It would be a HUGE spur to scientific investigation - I do not believe that huans have ever gone into space far enough to make it thru the Van Allen Radiation Belts (we haven't been using all-lead covered ships, yet!) But we'd sure aim telescopes at them; and much sooner than is planned now; send space probes their way. AND IF THE EXTRA-TERRESTIAL LIFE WAS INTELLIGENT? Then ALL three of the above would come even more into play. P.S. I don't believe that alien intelligent life would ever be war-like towards us. Why? Because to travel to here from there, they'd have to be light-years ahead of us technologically. In such a case, anything they might think that they needed to take from us; they could find on other planets; planets without intelligent life. They'd be advanced enough to not want to harm other intelligences; especially because there is always the risk that the intelligences could put a hurt on them. Meanwhile, there'd be a universe, or at least our galaxy full of planets just waiting for them to make use of. ",
            "date": "Answered March 7, 2017",
            "views": "370",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ishu Madan",
                    "user_href": "/profile/Ishu-Madan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tadgh Smith",
                "href": "/profile/Tadgh-Smith"
            },
            "answer_text": "A lot would depend on the circumstance of the encounter. Particularly on their proximity to the earth i.e are they in some distant star system communicating with us via radio waves or laser flashes, or have they just landed on the white house lawn, climbed out of their space craft and requested an audience with the president? If the latter was the case then the world would be on high alert and the question of which of our two species had the upper hand militarily (probably them) would be the most pressing one. If they had technology that was clearly far in advance of ours as would likely be the case then I think the human race would view that state of affairs with great anxiety. After all how have we humans acted almost every time we encounter another tribe of humans that is less technologically advanced? Usually not well. The less advanced tribe generally comes off a lot worse from the interaction. Regardless of the aliens intentions we would probably react towards them with suspicion, suspecting them of wishing to enslave, exploit or damage us in some way simply because that is how he would probably behave towards them if the roles were reversed. ",
            "date": "Answered September 3, 2018",
            "views": "96",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Yogi Gohel",
                    "user_href": "/profile/Yogi-Gohel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Clara Anderson",
                "href": "/profile/Clara-Anderson-9"
            },
            "answer_text": "Well, scientists would conduct tests, experiments regarding the life (how it communicated, it’s level of sophistication, etcetera). World leaders would most likely have a massive debate about how to deal with it. Cults would probably be formed. Current religious groups would have heart attacks. Information exchange. Or, one of us decide that all of that isn’t necessary due to the lack of mutual benefits and declares war. Most likely us (we’re not really good at trusting). ",
            "date": "Answered March 11, 2017",
            "views": "105",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Andrew Reyes",
                    "user_href": "/profile/Andrew-Reyes-49"
                }
            ]
        },
        {
            "author_info": {
                "name": "Connor McDermid",
                "href": "/profile/Connor-McDermid"
            },
            "answer_text": "I’m not sure if it would. It would answer the age-old question of whether or not we’re alone, but I’m not sure if we’d be able to efficiently communicate with them, much less travel there, unless they’re in our own solar system. If they’re at the nearest star, the communications will be 2-year round trip, and remember, they can’t understand our language. The universe isn’t that old in the grand scheme of things, and any intelligent lifeforms we may meet may not have interstellar travel capabilities. ",
            "date": "Answered March 11, 2017",
            "views": "86",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gary Heaton",
                "href": "/profile/Gary-Heaton-1"
            },
            "answer_text": "On what planet? This one, or a new one? I admit it would be a nice change if it was on this one! but if it's on another planet, then it really wouldn't matter much to me. We can't even get along with each other, we sure wouldn't get along with aliens! Especially if it was US that found THEM! Then WE would be the smarter of the two. That alone answers that question! We actually ran the Donald and Hillery for president!! Imagine how stupid that group would have to be? We would either exploit them or destroy them. Either way, it wouldn't work out well for them..And they didn't even vote!! ",
            "date": "Answered March 8, 2017",
            "views": "50",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "George Bane",
                "href": "/profile/George-Bane"
            },
            "answer_text": "The notion of us ‘finding’ intelligent life is as ridiculous as Columbus ‘discovering’ America. What would happen? Judging from our history, we would either try to learn there technology or conquer their planet depending on how advanced we are relative to them. I don’t agree with it but thats what I think would happen. ",
            "date": "Answered March 23, 2017",
            "views": "40",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Corrie Yee",
                "href": "/profile/Corrie-Yee"
            },
            "answer_text": "It would make the bible wrong and the concept of our ‘god' would crumble. In the bible it stated, 2 humans descended to earth and no mention of other extraterrestrial life forming. The bible said he made earth ‘living' but other world have life. Also it would mean we weren't alone and that life on earth was just a mere coincidence rather than on purpose and also they may hold knowledge we don't have e.g. time travel, harness gravity, technology… Etc ",
            "date": "Answered March 11, 2017",
            "views": "34",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Maurice Levie",
                "href": "/profile/Maurice-Levie"
            },
            "answer_text": "We’d sit down for a century and compare notes about how hard it is to date in this day and age? Seriously, do you think anyone is interested in the technology? Booze, drugs, and shopping will be the only things the other side will care about. In deep space 9, the new arrivals from the gamma quadrant just wanted to go to the bar and gamble… assume we get their tv show reruns on basic cable within a week, and entertainment tonight would feature their kardashians as they would want ours… ",
            "date": "Answered March 8, 2017",
            "views": "48",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ty Cox",
                "href": "/profile/Ty-Cox"
            },
            "answer_text": "Your answer can be found in the history of civilizations. When one society encounters another, it decides what benefit it can extract from the other. If the other society is more primitive, we will try to rule it. If the other society is more advanced, we will try to undermine it. We are not a species that is trusting or believes live and let live. ",
            "date": "Answered March 10, 2017",
            "views": "227",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Johan Daniel Alvarez Sanchez",
                    "user_href": "/profile/Johan-Daniel-Alvarez-Sanchez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tony Donovan",
                "href": "/profile/Tony-Donovan"
            },
            "answer_text": "It would matter, but we expect this will happen at some time. Religion will take a bit of a hit, but modern society more and more find religion a little bit silly. ",
            "date": "Answered March 11, 2017",
            "views": "36",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Andrew Reyes",
                    "user_href": "/profile/Andrew-Reyes-49"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Targowski",
                "href": "/profile/Andrew-Targowski"
            },
            "answer_text": "One day we may found intelligent life elsewhere or it perhaps may find us as well. Not yet. Another millenium of R & D and it will be possible. Only if we will last till 2050 with 11 billion people on Earth which can carry only 8. ",
            "date": "Answered March 31, 2017",
            "views": "3",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rodrigo Alejandro Weston-Ortega",
                "href": "/profile/Rodrigo-Alejandro-Weston-Ortega"
            },
            "answer_text": "it probs would matter because it would be a VERY BIG DEAL and if Donald Trump is still in charge, he would probably wage war on them ",
            "date": "Answered March 10, 2017",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tom Broun",
                "href": "/profile/Tom-Broun"
            },
            "answer_text": "We have already (in a commonly unrecognized form) and it matters very much. ",
            "date": "Answered March 9, 2017",
            "views": "3",
            "upvotes": "0"
        }
    ]
}