{
    "title": "What's the most sustainable alternative to aluminium foil? - Quora",
    "tags": [
        "Sustainable Living",
        "Sustainable Design",
        "Tin Foil",
        "Aluminum Foil",
        "Packaging and Containers",
        "Aluminium"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bill Thacker",
                "href": "/profile/Bill-Thacker"
            },
            "answer_text": "As Frank Adams says, aluminum foil is pretty sustainable. Aluminum is the third most abundant element in the Earth’s crust (8%, following oxygen and silicon) and is recyclable (although I expect most aluminum foil goes into landfills instead of being recycled). Still, even throwing away all that foil, we have an essentially endless supply of aluminum ore. We aren’t going to run out. The drawback of aluminum is that producing it requires lots of electricity and some involves some fairly nasty chemicals. Because so much electricity is needed, aluminum is usually smelted in areas where cheap power from hydroelectric dams or nuclear plants is generated, lowering its carbon footprint. Still, CO2 and CO are generated by the smelting process, along with some hydrogen fluoride and fluorocarbon gases; unless captured, HF is toxic, and the fluorocarbons are greenhouse gases. But all in all, I’d say it’s a relatively green, sustainable metal to smelt, when compared with iron or copper. The other drawback of aluminum is that it’s fairly expensive to produce because of the energy needed. That’s why it has such a high recycling value. But a little bit of aluminum goes a long way when you roll it into foil, and aluminum foil remains inexpensive enough to be popular for disposable use in the kitchen, so to me, this is sustainable. Finally, aluminum foil eventually decompose in a landfill or other outside location. Not as fast as wood or fiber, but much faster than plastic. So it’s a reasonably sustainable waste product… we’re not going to end up with huge piles of aluminum foil in landfills or aluminum “reefs” forming in the oceans. Next, let’s consider the alternatives. According to Wikipedia, “Approximately 75% of aluminium foil is used for packaging of foods, cosmetics, and chemical products, and 25% is used for industrial applications (e.g., thermal insulation, cables, and electronics). “ As packaging, its desirable properties are: it preserves freshness by being airtight, waterproof, and blocking UV radiationit can be formed to match any necessary shapeit is strong and durableAs insulation, it’s useful because it’s reflective, can be wrapped around complex shapes, and is conductive so it can be grounded, helps remove excess heat, and blocks radio frequency waves which could otherwise interfere with electronics. For food packaging, one alternative is plastic or plastic wrap. This is produced from methane and ethylene, both derived from natural gas or oil, but in principle those could be produced sustainably from biofuels. Better yet is cellophane, which is produced from cellulose and thus very sustainable, and cellophane is widely used already because it’s less expensive than aluminum foil. Score one for sustainability! Paper, especially waxed paper, can do some of this, but it’s probably more expensive than plastic or cellophane, and not as strong or reliable. For the industrial uses, other metal foils could be substituted. Gold foil would be great, but it’s too expensive. Tin foil (which is what grandma used to use in the kitchen until smelting of aluminum became cheap, about 100 years ago) is also more expensive, and tin can be a problem around electronic devices because of its corrosion product. Iron foil would corrode, and stainless steel foil would be much harder than aluminum; it wouldn’t be as easy to shape, and you’d cut yourself on the edges. It would also be more expensive than aluminum foil. In summary, aluminum foil is very sustainable, and where more sustainable alternatives are available, they’re already in use. That usage would increase if the price of aluminum were to rise, say, due to carbon taxes, but probably not much. ",
            "date": "Answered September 6, 2019",
            "views": "768",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Falconer",
                    "user_href": "/profile/John-Falconer-4"
                },
                {
                    "user_id": "Vicki Ring",
                    "user_href": "/profile/Vicki-Ring-1"
                },
                {
                    "user_id": "Craig Polhamus",
                    "user_href": "/profile/Craig-Polhamus"
                },
                {
                    "user_id": "Read Carlton",
                    "user_href": "/profile/Read-Carlton"
                },
                {
                    "user_id": "Tom Chandler",
                    "user_href": "/profile/Tom-Chandler-16"
                },
                {
                    "user_id": "Jeff Gerckens",
                    "user_href": "/profile/Jeff-Gerckens"
                },
                {
                    "user_id": "Geoffrey Thomas",
                    "user_href": "/profile/Geoffrey-Thomas-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michelle Moore",
                "href": "/profile/Michelle-Moore-14"
            },
            "answer_text": "Why are you looking for an alternative? Aluminum foil is sustainable. It’s aluminum. Just like aluminum cans that get recycled, foil can be recycled too. To dispose of it, just wad it up into balls that are at least 3 inches in diameter and toss them into your recycling. ",
            "date": "Answered September 8, 2019",
            "views": "81",
            "upvotes": "0"
        }
    ]
}