{
    "title": "What is the function of gills in the body of fish? - Quora",
    "tags": [
        "Marine Biology",
        "Fish"
    ],
    "response": [
        {
            "author_info": {
                "name": "Morten Bo Søndergaard Svendsen",
                "href": "/profile/Morten-Bo-Søndergaard-Svendsen"
            },
            "answer_text": "All the previous answers are correct, however the gills has more function that gas transport (the describe O2 uptake, and CO2 excrestion). It is a multifunctional organ, also serving functions of acid-base regulation (maintaining the correct pH within the fish) and nitrogen excretion. For the more interested I recommend reading Evans et al 2005: The multifunctional fish gill: dominant site of gas exchange, osmoregulation, acid-base regulation, and excretion of nitrogenous waste. https://people.clas.ufl.edu/devans/files/PRVGill.pdf This multifunctionality of the gill, and its direct contact to the external environment, makes it a very vulnerable organ. Fx Harmful Algal Blooms most likely affect fish via their gills. Here is an recent open access paper demonstrating that (disclosure, I am the author): Effects of Harmful Algal Blooms on Fish: Insights from Prymnesium parvum ",
            "date": "Answered February 16, 2018",
            "views": "33",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Taylor Swift",
                    "user_href": "/profile/Taylor-Swift-104"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lilian Hayball-Clarke",
                "href": "/profile/Lilian-Hayball-Clarke"
            },
            "answer_text": "The function of gills in the body of a fish is to allow the fish to get oxygen as it swims. Fish gills have an enlarged surface area over which oxygen dissolved in the water moves across to the blood capillaries of the fish, and then to the cells. Waste carbon dioxide from cell activity, moves the other way, out over the gills as the fish swims. [Most fish do not have lungs, but those that do must come to the surface to breathe air as we mammals do.] ",
            "date": "Answered December 23, 2017",
            "views": "31",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arnab Mukherjee",
                    "user_href": "/profile/Arnab-Mukherjee-380"
                },
                {
                    "user_id": "Dablu Bhanu",
                    "user_href": "/profile/Dablu-Bhanu"
                }
            ]
        }
    ]
}