{
    "title": "What is the explanation of death from a scientific point of view? - Quora",
    "tags": [
        "Philosophy of Science",
        "Word Definitions, Terminology, and Jargon",
        "Science of Everyday Life",
        "Death and Dying",
        "Science",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pujam M Bora",
                "href": "/profile/Pujam-M-Bora-1"
            },
            "answer_text": "Death is defined as the cessation of all vital functions of the body including the heartbeat, brain activity (including the brain stem), and breathing. death. The words ‘ vital functions ’ are key words because there are things a dead body can do which a living body does. Here they are - 1. Dead bodies can APPEAR to have hair and finger/toe nail growth. The hair and nails don’t actually grow, but when the body begins to shrivel away (after decomposition), the skin shrinks back, exposing more hair and more finger/toe nails. 2. Defecation Your muscles relax and anything that you may or may not have been holding in will come out. 3. Post-mortem caloricity. Normally, dead bodies experience algor mortis (cooling of temperature) immediately following death. In some cases, the body temperature will actually rise for about two hours after death before it begins to cool. This phenomena is called, “post-mortem caloricity.” 4. Self cannibalization. While there are exogenous facts that cause decomposition (perhaps worms, flies, cats), much of the body’s decomposition occurs endogenously … the bacteria, acids, etc. within our own body live on and have a glorious feast on their deceased host. 5. Postmortem priapism Also called “angel lust” or “death erection”, some dead bodies can actually have an erection. Although rare and usually cause by swift and violent manners of death, priapisms do occur. 6. Livor mortis When you die, your body will turn all sorts of pretty colors. Soon after death, gravity will pool the red blood cells to the part of your body that’s closest to the ground. If you die face down, your face will get all reddish. If you die on your back, your back will turn all pretty shades of crimson. Eventually (unless the deceased is embalmed), those colors will stain skin they’re touching (embalmers call this “postmortem stain”). 7. Coffin Birth If a women dies while still pregnant, the eventual gases from decomposition in some cases push the deceased fetus out in what’s called a “coffin birth”. 8. Muscle Movement This is extremely rare. And usually only occurs in the smaller muscles. Out of the thousands of bodies my family has seen, only one still had muscle movement after death. The deceased’s fingers were twitching “like he was playing the piano”. 9. Vocalization When a deceased person is moved and there’s air in his or her lungs, they can moan and groan. If the deceased says, “I’m not dead yet” well, they’re probably not dead (Monty Python reference). 10. Dead bodies fart. Some dead bodies fart a bunch. 10 Things Bodies Can Do After Death Thank you. ",
            "date": "Updated February 16, 2018",
            "views": "456",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rocky Lawler",
                    "user_href": "/profile/Rocky-Lawler"
                },
                {
                    "user_id": "Imran",
                    "user_href": "/profile/Imran-102"
                },
                {
                    "user_id": "Aditya Roy",
                    "user_href": "/profile/Aditya-Roy-183"
                },
                {
                    "user_id": "Amaan ur Rehman",
                    "user_href": "/profile/Amaan-ur-Rehman"
                },
                {
                    "user_id": "Yash Anand",
                    "user_href": "/profile/Yash-Anand-21"
                }
            ]
        },
        {
            "author_info": {
                "name": "Praveenkumar Goudar",
                "href": "/profile/Praveenkumar-Goudar"
            },
            "answer_text": "In this age of commercialism and materialism, very few people think about death. They are rather afraid of it. They do not care to think what will happen after death. They would rather live in this world, enjoy all the pleasures of life, make the best use of everything, make a will, and insure their life, or save a little money to pay the funeral expenses and go on living. Out of the two thousand millions of people who inhabit this little planet earth, forty millions of the human bodies are disposed of every year, and a million tons of the human flesh, bones, and blood are allowed to return to their elementary states. During the last war in Asia and Europe and, many millions of people were killed and were destroyed. Some of them were blown into atoms. But we do not think of that horrible scene. We have almost forgotten it. So we do not think for a moment that we shall die. We are not living and doing the same things as we did before. Our interest is not in solving the problem of death, although it is the greatest mystery in the world. It is as mysterious as the coming of life on this plane. But still we do not think much about it. Even the Christian churches do not take such a lively interest in this problem of death today, as they did in the last century. They would rather busy themselves with questions of social, educational and especially political problems of the day. The medicine men of this age do not solve the problem of death, although hundreds are dying in their hands every year. They gather all the things that they can and their ideal is to enjoy the pleasures of life, and also to make the best of their opportunity. In the Mahabharata, the most ancient epic of the Hindus, we read a prize question that was asked to different great men of ancient times. ‘What is the most wonderful thing in the world?’ Various answers were given, but they were not satisfactory. The answer which Yudhishthira gave was accepted and his answer was this: ‘Every day, and day after day, animals and human beings are passing out of life, but we do not think of death; we think that we shall never die. What can be more wonderful than this? This answer was given nearly thirty-five centuries ago, and the same truth prevails today. We do not think of death, although we see every day the dead bodies carried to the grave right under our eyes.’ The mystery of death is not solved by mythological beliefs of the ancient peoples, which have been handed down to us through generations. The scriptures of the Jews, the Christians, the Parsees and the Mohammedans do not explain what death is. But in some of these scriptures, we find that God commanded the first man to do certain things and not to eat the fruit of the tree of knowledge, but when the first man did eat the fruit of the tree of knowledge of good and evil, the Lord cursed him, and His curse brought death in this world. We read in the Genesis, the Lord commanded: “Of every tree of the garden thou mayest freely eat: But of the tree of the knowledge of good and evil, thou shall not eat of it: for in the day that thou eatest thereof thou shalt surely die.” Of course, Adam did not die in the day he was tempted and he ate the fruit thereof; but he reaped the consequences afterwards and died later. This passage shows that at first God did not intend that man should die, but the death came to the world through the evil influence of Satan, the devil. It was Satan who brought death into this world. In fact, the curse was the cause, but the curse was brought about by the evil influence of the devil. Those who believe in this, that death was caused or brought about by Satan, do not care to think further about it. They leave this question as settled, and naturally they do other things and do not try to solve the problem. They think that if it be the curse of God, it is an inevitable end of life and let us be satisfied with it. Scientific researches towards tracing the causes of death have brought out many truths and laws which were unknown to the writers of the Genesis and other scriptures of different nations. Orthodox science or materialistic science, as it is known to us, which denies the existence of the soul as an entity and also denies the existence of mind or life or intelligence as distinct from the results of matter, governed by physical forces and chemical actions, says that death is nothing but the cessation of life and it is an inevitable end which all beings come to. The scientists do not explain it elaborately because they do not know much about it. Still they try to explain that when the vital parts of the body wear out in this machine, then naturally the whole of the machine must stop. The vital parts are regarded as the heart, the lungs and the brain. When any of these vital centres is worn out or injured by disease or accident, then naturally the whole machinery of the body stops. But here a question may arise: ‘Does the death of the conscious life imply the death of the life of the organs?’ Or in other words, when a person is dead, does it mean that the organs are dead also? That is a very difficult question to answer. On the contrary, science tells us that the organs do not die immediately after the death of the body or the conscious life. For instance, if a chicken’s head be cut off and its heart taken out and watched, it will continue to live for a long time after the death of the chicken. In the Rockfeller Institute, there is a heart of a chicken that has been kept for eight years, and it is still going on and doing normal action. That shows that the organs have their independent life which may continue to live even after the conscious life of the individual is dead. In the same manner, it can be shown that the cells and the tissues have their own life. They do not die, but they live for a long time after the death of the conscious life. Modem science tells us that there are two kinds of death: one is the death of the conscious life and the other is the death of the organic and cellular life which is called the ‘somatic life’. But one does not depend upon the other. In fact, the life continues to exist, depending upon the natural process of the vital force which is known as the life-force. But this materialistic science does not explain how it is that the organs, the cells, and the tissues continue to live, because it denies the existence of a vital energy, or a vital force, as distinct from all other known forces of nature. On the other hand, it considers that this vital force is a result of the chemical actions of the atoms and molecules of the organism and therefore, it cannot explain any further. Professor Charles Minot of the Harvard Medical School writes in his book, Old Age, Growth and Death: “Differentiation leads, as its inevitable conclusion, to death. Death is the price we are compelled to pay for our organization, and also for the differentiation which exists in us. Death of the whole comes, as we now know, whenever some essential part of the body gives way. Sometimes one, sometimes another, perhaps the brain, perhaps the heart, perhaps one of the other internal organs may be the first, in which the change of cytomorphosis goes so far that it can no longer perform its share of work, and failing, brings about the failure of the whole.” This is the scientific view of death. It leaves death with its mystery and all its sacredness. We are not in the least able at the present time to say what life is, and still less, perhaps, what death is. Thus by studying materialistic science, we do not gain a very clear idea of what death really means. But science goes on trying to trace the causes of death, and describes the signs of death. Science tells us that the actual signs of death are very difficult to find. The so-called popular signs of death like the stoppage of the heart-beat and pulse or respiration are not the actual signs of death, because there have been hundreds of cases where the heart-beat is stopped and the respiration is stopped and yet after sometime they are revived. The heartbeat might stop for many hours, even for days, and then it can be revived. The respiration might stop for a long time, but it can be restored. Science has recorded many cases of suspended animation where the respiration or the heart-beat is stopped for forty-eight hours in the least. But there have been other cases where men have been buried alive in a hermetically sealed box for forty days and afterwards they were taken out and revived. They lived, married, and enjoyed all the blessings of life afterwards. It is very difficult to say which would be the proper or final sign of death. Science tells us that the decomposition and putrefaction are the only final signs of death and nothing else and that shows that people might be buried prematurely. There have been many cases of premature burial recorded in the medical journals of the world every year. And for that reason, some of the countries in Europe have passed a law that no one should be buried immediately after death until decomposition sets in. Because it is a very serious thing to bury the living beings. There have been cases of many prematurely killed by being put into the coffin and getting buried under the ground before their actual death. As premature burial is objectionable, so premature embalming too is objectionable. The embalmers have killed many before they really died. They might have been revived and might have lived for a long time. Because it is a proved fact today that when the person is considered as dead, he might be in a trance, or in a state of catalepsy, or in a state of ecstasy. Trance, catalepsy and ecstasy are the conditions which resemble death. The outward signs are similar. But what happens to the soul after trance or ecstasy? Science does not know, because it denies the existence of a soul other than the mind. A person might go into a state of trance and remain in that state for hours. There are persons who can stop the heartbeat by their will. I know a Hindu Yogi, went through all the medical tests to prove that he could stop his heart-beat at his will. The medical practitioners were all dumbfounded and questioned how he could do it. It is possible, because it obeys the will of the individual, and the individual will commands and directs the organic functions. But materialistic science cannot explain how it is possible through the known laws that are accepted by these scientific thinkers. The old Babylonian method of embalming the body and burying the dead, which has been handed down to us from pre Christian era and which is practised today in all the civilized countries, is based upon the superstitious belief that the body will eventually rise and go to heaven. But after the decomposition sets in and the body is gone, what will rise? Science shows that it is an absolute impossibility for the body to rise, or to go to heaven. Still some people cling to that old belief and think that their friends and relatives will eventually rise from the graves and go to heavens with their physical bodies. But the best method of disposing of the dead body is the method of cremation, because it is sanitary. It is the best method from the standpoint of health as well as from the standpoint of safety for the living beings. Why should we have so many dead bodies going through the process of decomposition around us? It is better to get rid of them and let them go to their elementary conditions. This cremation has been practised in India from very ancient times. In the Vedas, we find that cremation was regarded as the best method. But among other nations, burial or mummification was regarded as the best method. As I have already said, their idea was to keep the body intact for a long time, because, the soul will eventually come back to the body. The Egyptians also had that kind of belief. They believed that if the physical body were kept intact and not mutilated, then the soul would eventually come back to dwell in that body, whereas if any part of the physical body was mutilated, that part of the ‘double’ (soul) would also be mutilated. They believed in a ‘double’,—a double exactly of the same shape and same form as the physical body. In India, we find that the Hindus have a belief in the existence of a double, but it was not dependent upon the gross physical body. They have a philosophy altogether different from that of the Egyptians and other nations of ancient times. They believe that this double might have the body and continue to live even when this gross physical body is destroyed through the process of cremation which they even now regard as the most sanitary method of disposing of the dead body. There is another class of scientific thinkers who are a little more advanced than the orthodox scientists. They hold that the mind is a factor in cases of disease and death. They do not deny the existence of the mind, or the intelligence, or the consciousness, nor do they believe that the mind, intelligence and consciousness are the results of the chemical actions of the atoms and the molecules of the organism. On the contrary, they hold the belief that the source of consciousness and mind are indestructible. So is life. Life is also indestructible. They regard that the life-force (prana) is not the result of the chemical actions. It is not the same as electricity or any other force that is known to orthodox science, but it is distinct and separate. They give the cases where mind can bring death through extreme emotions. Some of the functions of the mind which we call passions will create disease and death. Dr. John Hunter, a noted psychologist, was a genius of extraordinary nature. He was a scientist, but he believed in the power of the mind and yet he had very little control over his passions. He could not control anger. Once he had extreme anger as the result of a slight provocation, and through the extreme anger, he instantly fell dead. There is a historical record that anger kills the person instantly. The French physician, Tourtelle, witnessed two women who died of extreme anger. Extreme anger will produce stoppage of the heart-action, and poison the whole system. As extreme anger will kill persons, a slight expression of anger, or anger of a milder form, will also bring disease of the worst kind. In fact, when a mother nurses the baby while she is in that state of anger, she feeds the baby with poison, and that poison works and creates all kinds of trouble in the baby’s system. It is a scientific fact today. As anger is dangerous and is a destructive force that creates havoc in the system, so is fear. Now, the ordinary expression that we are frightened to death has some meaning. Extreme fear will bring death, will stop the heart-action and will stop the lungs and simultaneously other organs too. Then there are passions, hatred and grief. Grief will produce havoc in the system. These are all the recorded facts. When there have been cases of disease and death through extreme hatred and grief, how can we deny the power of the mind? If the mind and the mental states can produce such effects upon the physical body and bring premature death, how can we deny the existence of mind as the most powerful thing that we possess? Therefore, the scientists who are advanced thinkers and not bigoted like the orthodox materialists, regard mind as the most wonderful force that is working through this physical body. There are cases of counterfeits of death, even in the lower animals. There are some of the insects which would feign death. The fox, when he is pursued by an enemy and does not know how to escape, lies flat on the ground, feigns death and remains in that state for some time. There are other animals which would even become stiff and the rigor mortis of death will be perceptible in the physical body of the animal. It can be produced by the mind. This counterfeit of death may be caused by different things, such as intoxication, apoplexy, hearttrouble and so on. Thus it shows that mind can produce these things under those conditions like the sign of death, and therefore, those advanced thinkers and scientists consider that death can be brought about by the power of the mind. They regard that this ordinary state which we call death, is caused by that self-conscious living force which is working through the organs, and when that self-conscious living force is detached, it produces death. In fact, the self-conscious living soul has vital energy or life-force (prana) or mind with it. The mind is inseparable from the life-force or vital energy. But mind cannot work unless it has an instrument. Therefore it manufactures the instrument of the physical body. It draws from the surrounding environments like atoms, molecules or particles of matter, and charges them with the life-force, or the vibrations of the prana, and when the vibrations of life-force are weak and are not up to the standard of the conditions of life, then the living soul or the selfconscious mind tries to raise those vibrations of the cellular life up to the standard by making all efforts, and if it fails to raise the standard of the vibration of the cells and the tissues, then there is the death of the whole. Then the whole machinery dies. Thus we see that there are two principal factors in the body: the one is the mind and the other is the vibration of the prana, or the vibratory state of the cells and tissues of the body. But the vibratory state of the cells and the tissues is governed by the mind. In fact, the mind is the creator, the manipulator and the organizer. It is the director of all the organic functions. The organs might go on vibrating in their own way, but that would not be the standard of life. There must be co-ordination. The heart-action must correspond in a certain way with the action of the lungs, and all the intricate mechanism must be adjusted in such a way that one helps the other. Otherwise, there would be no life. If one screw is loose anywhere, the screw must be tightened, otherwise the machine would not work. Now, who tightens this screw? It is the individual self-conscious life-force which is called, in ordinary terms, the living soul. The living soul means the self-conscious individualized life-force with the sense of “I”, and that sense of “I” holds them together. This sense of “I” holds all together, unifies them, and makes the separate parts vibrate and produce a perfect harmony. That harmony is life. As in an orchestra, there might be a hundred instruments, and if each instrument goes on playing in its own way without following the direction of its conductor, it will produce no harmony; similarly, if the organs of the body go on beating in their own way, without producing any harmony, without having any co-ordination, without being directed by their conductor, then it is useless. Who is the conductor of the organs? Who is the director? The orthodox science does not see that director, but advanced science tells us that there is a director and this director has the absolute control over the whole organism. He is the living soul. At the time of death, he disconnects himself from the organs and leaves the body. In case of trance, catalepsy and ecstasy, this living soul leaves the body, but the connection is not entirely cut off. There still remains some kind of connection. It is like the umbilical cord of a newborn babe which holds its entity as connected with the physical body. Therefore the physical, body can be revived. But when the connection is entirely cut off, the body cannot be revived. Then it is called death. That is the difference. This difference very few people understand. But this living soul which goes out of the body at the time of death can be photographed. The most delicate and sensitive instruments have been used to weigh the body just before death and immediately after death, and making all allowances for the gases that escape, it has been found, that the substance which passes out of the body at the time of death, has a definite weight of about half an ounce or three-quarters of an ounce. This fine substance that emanates from the body at the time of death has luminosity. This luminous substance can be photographed and seen by the psychic as passing out of the body. The whole body becomes enshrouded with a kind of luminous mist. I remember the case of a girl, whose brother died in Los Angeles some years ago. I heard it from her mother. At the death-bed of her brother, the young girl said: “Mamma, mamma, see, there is a mist around his body; what is it?” But the mother could not see it. She said that it came out of the body. The scientists have taken up that subject in Europe and are experimenting on this emanation. They call it the ectoplasm. It is a vapour-like substance and it has no particular form. It is like a cloud and it can take a shape or a form and can be photographed. What substance it is, they do not know, but they cannot deny its existence. Our human bodies are emanating that substance all the time. It can be seen especially at the time when there is a medium in a trancelike condition. The materializing mediums emanate that very strongly. I have seen it in private seances, when there was no professional medium at all. I have handled it and touched it. There is no particular feeling when we feel ectoplasm. It cannot be described. But when it takes a definite shape, it becomes almost like solid and like our own body. It can take any form. At the time of death, all these vital forces that are governing the different organs, become concentrated and centralized into one point before it leaves the body, and we find the dying person’s sight becomes dim, the sensations of the body become faint and gradually the whole body goes through a transformation. And, in this transformation, there are cases, where the psychic power of the individual manifests. Some of the dying persons develop clairvoyance and clairaudience. They can appear at the time of death, either just before or immediately after, to distant friends in the form of an apparition, and they can give their messages. Such cases have been recorded by the scientists. The French Astronomer, Camille Flammarion had written a book, The Unknown, on that subject by gathering all the authentic reports made under the test conditions in different families, which describe the experience of different people at the time of death, or immediately after death. Fifteen hundred such records were gathered, and afterwards Flammarion selected quite a few out of them, which were absolutely authentic and published them in his book. Now these records show that there is something which is not the result of the physical body. This ectoplasm is a substance which contains finer matter in vibration, and this finer matter forms the under-garment of the soul, the gross physical body and the finer or ethereal body existing in each one of us. We may not feel it at present, because our sight and senses are looking for the gross, material and tangible objects. But it does not become tangible until it is brought down to the planes of our senses. The plane of our senses depends upon a certain degree of vibration. We can see light when the vibration of light is within the range of our vision. From red to violet our eyes can see, but if there be less vibration than the red, we do not see it. In order to become visible, it must vibrate in a certain way so that our organs might catch it, just as sound. Thus there are sounds which we do not hear at all because our organ of hearing is imperfect. Similarly the ethereal body cannot be seen, until it is brought within the range of our vision, by a process known as materialization. It is a process which brings the finer matter that is vibrating at a high rate into a lower rate of vibration so that we can catch it or get a glimpse of it. The Vedanta philosophy is in perfect harmony with the conclusions of this latter kind of advanced scientists who hold that mind and the living soul are distinct factors in creating disease, also in bringing on death and in manufacturing the physical body. These ideas we find in the Vedanta philosophy which is the oldest system of philosophy in the world. The truth never grows old. The truth that was discovered five thousand years ago is the same truth today, even if it be rediscovered by the modern scientists. So we must remember that the Vedantic truth is unique and one. There is only one condition which can be absolutely true. The others are imitations of truth. That absolute truth might have been discovered ages before, but because of the lapse of time, the truth does not change. It is the eternal truth. Therefore, we find that this finer body which I have just described is called in Vedanta the subtle body (sukshma-sharira) which is the under-garment of the soul, and the gross physical is the outer garment. When the soul has performed certain functions and enjoyed certain pleasures and fulfilled certain desires, it finds that this gross physical body is no longer of any use and it does not work right. Then the living soul leaves the gross body and manufactures another. Just as you have run a motor-machine for two years and after two years, you find that the parts are worn-out and that it has done its service, then you leave it and get another. That is exactly what the living soul does. You cannot blame the soul for doing that. Because the body is the instrument, through which the soul must manifest its powers, gain experiences, learn lessons, and gather knowledge. In this way, the living soul is progressing in the process of evolution, rising from a lower to a higher state and fulfilling its mission at every step of manifestation. This idea of life will explain the mystery of death. Death is no longer mysterious when we know that there is an entity which has manufactured this instrument, which is dwelling in it and which leaves it when the time comes. So death does not mean the annihilation of anything, or destruction, or reduction into nothingness of anything, but it means disintegration. It means that the instrument which has served its purpose must be thrown away and another instrument must be rebuilt out of the same material. Who can tell that the atoms and molecules which made up the body of Cleopatra thousands of years ago, are not used in the bodies of the living beings today? The same atoms and molecules that are buried with the dead bodies, have been dissolved and taken up by the vegetable life and have reappeared in the forms of plants cereals and we might be eating them and taking them in again. And they are forming parts of our own body. So it is a revolution. Nothing in this universe is destroyed. The atoms and the molecules go into one body, get out and enter into another body. In this continuous process of life, its manifestations of evolution and involution are going on and the living soul is the master of it. That living soul has no death. Science tells us that which has existed once will continue to exist for ever. But the physical form of the body will be destroyed. It has no permanent existence and it is constantly changing. The form that you had when you were a little baby is gone. The form that you had yesterday, you have not got today. The form that you have this minute, you will not have it next minute. It is a continuous influx and reflux of matter. It is just like a whirlpool. The particles of matter are revolving and keeping up the shape according to the type that you have manufactured so that there would be an identity. Now, in this vortex of the particles of matter, which are constantly in motion, there is something that is constant and unchangeable within us. That is our consciousness. If you ever see your own hand or any part of the body through the X-ray, you will find like a revelation that your body consists of the finer particles of the mist-like matter which are hanging over the outline of the bones. The gross physical body which appears as solid is not at all solid. It is just like a cloud, and we think it is solid only under certain conditions. At the time of death, the soul leaves this material plane and enters into another plane of consciousness which may be called another dimension. We are now living in three dimensions. There is another dimension where the sense-objects do not exist at all. It is beyond the limitations of our physical body. Even the motion of the earth and the planetary system do not exist there. We cannot imagine such a state, unless we get a glimpse of that other dimension. It is called the fourth dimension. Where does the human soul go? It does not go anywhere after death, but it remains in the fourth dimension and cuts off all connections with the physical world of three dimensions. The third and the fourth dimensions are related to each other just like a wheel within a wheel. We know through the study of science that the cells of the body are constantly moving. But do we feel that motion? When we sit still, we are enjoying the quiet. But there is a constant motion going on within our system which we are not conscious of. So the departed soul is not conscious of the changes and the conditions of the gross physical body. Our bodies are nothing but the instruments, or the garments of the soul. Vedanta tells us that when a person dies, he is not really dead, but he changes his old garment of the physical body and takes a new one. Vedanta says that death means a change i.e. a change from one state of consciousness to another state of consciousness, and the soul throws away the physical body at the time of death just as we throw away our old worn-out garments. This idea is beautifully expressed in the Bhagavad Gita: “As we throw away our old worn-out garments and put on new ones, so the living soul, after using the body which is the gross physical garment, throws it away when it is worn-out, and manufactures a new one.” ",
            "date": "Answered September 1, 2017",
            "views": "29",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rithvik A",
                    "user_href": "/profile/Rithvik-A-3"
                },
                {
                    "user_id": "Tomáš Hromník",
                    "user_href": "/profile/Tomáš-Hromník"
                },
                {
                    "user_id": "CAM Kunal Air",
                    "user_href": "/profile/CAM-Kunal-Air"
                },
                {
                    "user_id": "Praveenkumar Goudar",
                    "user_href": "/profile/Praveenkumar-Goudar-1"
                },
                {
                    "user_id": "Manoj Peter",
                    "user_href": "/profile/Manoj-Peter-3"
                },
                {
                    "user_id": "Amit Kumar",
                    "user_href": "/profile/Amit-Kumar-13265"
                },
                {
                    "user_id": "Junaid Ahmed",
                    "user_href": "/profile/Junaid-Ahmed-69"
                }
            ]
        }
    ]
}