{
    "title": "What's the best way to support scientific research as a non scientist? - Quora",
    "tags": [
        "Scientists",
        "Scientific Research",
        "Research"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christian Santangelo",
                "href": "/profile/Christian-Santangelo"
            },
            "answer_text": "Thank you! There are many ways you can support scientific research, depending on your level of interest and your resources. Be a lifelong learner of science and instill that in your friends and family. This is the most important thing you can do because it advertises the scientific worldview and helps grow scientific support. If you love science, shout it to the world! Live your life according to scientific principles. Practice skepticism but learn to modify your worldview with evidence. Try to prove yourself wrong in order to know if you are right. And, importantly, let people see you do this. Good scientific practice has to become a cultural value. Write letters to the editor to newspapers and magazines about science. Vote for candidates who are pro-science. I’m not going to tell you who those candidates are, but I can tell you who they are not. Anyone that lies, spreads misinformation purposefully (or by failing to try to verify it), or that insults certain scientific projects as public boondoggles because they sound silly is trying to manipulate you in a dishonest way and should not be supported. Frankly, you couldn’t trust them anyway. If you are religious and love science, wear that on your sleeve too. This might be controversial, but if you have successfully melded science and religion, you can be a model for how others might do that. Right now there are people who believe that their religion precludes them from believing science, and that is dangerous and wrong. Give money or time. Give money to your local university (if you have money to spare for charity). You can fund summer research for good undergraduates at $5000, fund the travel for a graduate student to a conference to present their research, or even just buy the cookies for a seminar series. You can fund an award for a young scientist. At higher amounts of money, you can do a lot more, of course. If you are going to give money to a university, spread it around to your state institutions (note: conflict of interest) instead of the most famous university your know about. Give science books to your local library (or your local elementary school library). Fund or judge a science fair. Hell, do anything that facilitates someone learning about or practicing science. Science is happening all around you and those people need your help to achieve your goals. Join the PTA or school board and make sure local kids are getting the science education they deserve. Start a summer program for kids and bring them to your local university. Many scientists would be delighted to help you with this. Call your local university science department and ask them what they need. ",
            "date": "Answered May 25, 2017",
            "views": "262",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alyssa Beth Luna",
                    "user_href": "/profile/Alyssa-Beth-Luna-1"
                },
                {
                    "user_id": "Shashwata Samanta",
                    "user_href": "/profile/Shashwata-Samanta-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Cogswell",
                "href": "/profile/Chris-Cogswell-3"
            },
            "answer_text": "First off as a scientist, I am very grateful for people like you who want to support science!! In general you can educate yourself and those around you on scientific issues! And education doesn’t have to mean reading or whatever, you can watch TV shows, documentaries, listen to podcasts, read popular science books, whatever you enjoy. So long as you are educating yourself then there is a better chance you can engage with others when they get something wrong about science, or think of it as stupid or silly, or even when awkward comments are made at the Thanksgiving table about fuel efficiency being a secret plot by the communists. At the same time, you can support science literacy in schools by supporting field trips to scientific related places at your kids schools, you can go out and support local scientists or science outreach events by volunteering or donating, or you can even get involved politically and fight for science based policy decisions. There are a lot of ways the scientific community can use people who are willing to learn and help but may not feel like they are a “scientist” themselves. And frankly, you can get involved in science as a non-scientist if you want too! Join an amateur astronomy club, go bird watching or nature hiking, build a backyard trebuchet, or make slime in your kitchen! ",
            "date": "Answered May 17, 2017",
            "views": "336",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bhinish Shah",
                    "user_href": "/profile/Bhinish-Shah-1"
                }
            ]
        }
    ]
}