{
    "title": "What happens if you mix sodium chlorite and citric acid together? - Quora",
    "tags": [
        "Sodium Chlorite",
        "Miracle Mineral Supplement",
        "Quackery",
        "Citric Acid",
        "Chlorine",
        "Bleach (chemical)",
        "Chemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "HRH George J Rickle IV",
                "href": "/profile/HRH-George-J-Rickle-IV"
            },
            "answer_text": "Sodium chlorite is a bleaching agent. It is chemically stable and widely used as an industrial bleach. It is highly toxic. When used as household cleaner it is typically only 5% pure. Industrial strength applications are sold 20–50% pure. Citric acid is relatively mild for an acid. It was first isolated from lemons, thus the name. In small amounts, it is safe to add to food which is the primary use. It gives the sour kick to sour candies. In large amounts it chelates metal which made it into a lot of health quackery. Large amounts of citric acid wreak havoc on the body as an oxidizer. Your kidneys and liver remove any toxic metals from your body just fine with a normal diet. Don't ingest large amounts of citric acid, whether it's diluted in liquid or pure concentrate in a pill. When mixed together you get an acidic and unstable form of sodium chlorite. It is a massively powerful chemical oxidizer. It is unstable so it rips apart organic molecules. The acidified sodium chlorite can be used as a disinfectant around food such as cutting surfaces and knives (but not in food) because it degrades so fast. When used as a disinfectant it must be well ventilated. Some of the by product reactions create chlorine gasses. It's not good for you. Acidified sodium chlorite degrades quickly to more stable chlorine dioxide. Chlorine dioxide is a liquid in a cold room and a gas in a warm one so it is tricky to avoid if you accidentally mix household cleaners. At high concentrations it is explosive just mixing it with the oxygen in air. It is a potent bleaching agent, disinfectant, and would have been used in warfare if it was only slightly more toxic. Kept cold as a pressurized liquid then sprayed on incoming troops whose body heat turns it into an explosive gas which is breathed in. Aren't we glad chemical weapons are outlawed? Chlorine dioxide is so toxic that it must be created onsite for any industrial use. In the United States it is illegal to transport it in any amount. Chlorine dioxide is a deadly poison both as a liquid and potentially explosive gas. So now what? In the last decade, we've met a prophet and guru named Jim Humble who claims to be one billion years old and traveled here from the Andromeda galaxy (sorry dude, but I think your mom and your passport remember you as a baby on Earth). Jim Humble sell kits he called “Multiple Mineral Solution” consisting of a small vial of sodium chlorite and another of citric acid. Both are higher concentrations than most industrial uses. Combine the two and drink up! Of course, these vials are sold with 10,000% markup. He first got attention in first world countries marketing it as a general cure-all. If asked about any disease, his solution was the answer, buy now! He didn't tell you what was in the vials either. Drinking MMS as mixed is the acidified sodium chlorite phase. As an oxidizer it is attacking every cell it contacts, and is particularly effective against red blood cells. In most people this should trigger a nausea reaction and vomiting. The massive oxidation causes the human body to lose blood pressure rapidly. This can cause unconsciousness. After the oxidation reactions (you know, inside your body!) the sodium chlorite becomes chlorine dioxide now traveling through the blood stream and what remains of the digestive system. Renal failure and liver scarring are possible as the body attempts to eliminate this stuff. What's left comes out in urine and sweat. You thought asparagus pee smelled bad? As if that's not bad enough (adults who buy quack medicine are stupid but did it to themselves), he markets it as an infant cure as well. By enema. When it comes back out as a bloody mess he shows off the parasites it kills. No dude, that's not parasites, that's the infant's stomach lining. They can never properly get nutrients from food again. Most people simply vomit this concoction. Some end up in the ER from low blood pressure, renal failure, or chlorine poisoning. It's also known that this stuff has caused many deaths. He's been kicked out, fined and threatened with jail by the US, Canada, UK, and Australia. He now moves around various African countries where he markets as a cure for HIV and malaria where those diseases are rampant. Profiting from selling hope to the desperate and poor and often from charity money. Australia and Washington state have been fining people they still find marketing this stuff but you can probably find some snake oil charlatan at health food expos and county fairs. It's amazing what otherwise smart first world people with too much money will buy if you tell them it is a dietary “detox”. Canada just recently (January 2018) kicked it up a notch and is sending people to jail. While I don't support the death penalty or posse justice… if the original charlatan, Jim Humble, was found victim of mob revenge in Africa I'd probably applaud. ",
            "date": "Updated November 16, 2018",
            "views": "135",
            "upvotes": " View 34 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mike Kaiser",
                    "user_href": "/profile/Mike-Kaiser-15"
                },
                {
                    "user_id": "Christopher VanLang",
                    "user_href": "/profile/Christopher-VanLang"
                },
                {
                    "user_id": "Ryan Zhou",
                    "user_href": "/profile/Ryan-Zhou-43"
                },
                {
                    "user_id": "Rob McGuire",
                    "user_href": "/profile/Rob-McGuire-1"
                },
                {
                    "user_id": "Rahil Deshmukh",
                    "user_href": "/profile/Rahil-Deshmukh"
                },
                {
                    "user_id": "Jarrad Harries",
                    "user_href": "/profile/Jarrad-Harries"
                },
                {
                    "user_id": "Eniola Orunto",
                    "user_href": "/profile/Eniola-Orunto"
                },
                {
                    "user_id": "Phil Culmer",
                    "user_href": "/profile/Phil-Culmer-1"
                },
                {
                    "user_id": "Chitresh Paul",
                    "user_href": "/profile/Chitresh-Paul"
                },
                {
                    "user_id": "Punnamaraju Vinayaka Tejas",
                    "user_href": "/profile/Punnamaraju-Vinayaka-Tejas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ben Burch",
                "href": "/profile/Ben-Burch"
            },
            "answer_text": "This is reasonably easy to google. Answer exists on Wikipedia (Sodium chlorite - Wikipedia): “Mixing sodium chlorite solution with a weak food-grade acid solution (commonly citric acid), both stable, produces short-lived acidified sodium chlorite (ASC) which has potent decontaminating properties. Upon mixing the main active ingredient, chlorous acid is produced in equilibrium with chlorite anion. The proportion varies with pH, temperature, and other factors, ranging from approximately 5–35% chlorous acid with 65–95% chlorite; more acidic solutions result in a higher proportion of chlorous acid. Chlorous acid breaks down to chlorine dioxide which in turn breaks down to chlorite anion and ultimately chloride anion. ASC is used for sanitation of the hard surfaces which come in contact with food and as a wash or rinse for a variety of foods including red meat, poultry, seafood, fruits and vegetables. Because the oxo-chlorine compounds are unstable when properly prepared, there should be no measurable residue on food if treated appropriately. ASC also is used as a teat dip for control of mastitis in dairy cattle.” ",
            "date": "Answered May 14, 2018",
            "views": "41",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ryan Zhou",
                    "user_href": "/profile/Ryan-Zhou-43"
                },
                {
                    "user_id": "Javara Nova",
                    "user_href": "/profile/Javara-Nova"
                },
                {
                    "user_id": "Muriel Hykes",
                    "user_href": "/profile/Muriel-Hykes"
                },
                {
                    "user_id": "Tae Lim Kook",
                    "user_href": "/profile/Tae-Lim-Kook"
                },
                {
                    "user_id": "James Panayis",
                    "user_href": "/profile/James-Panayis"
                }
            ]
        }
    ]
}