{
    "title": "What are the best food hacks? - Quora",
    "tags": [
        "Tips and Hacks for Everyday Life",
        "Tips and Hacks"
    ],
    "response": [
        {
            "author_info": {
                "name": "Logan Larson",
                "href": "/profile/Logan-Larson-5"
            },
            "answer_text": "ou thought you had it all figured out. You’ve cooked a few roasts and baked a few loaves in your time, so you know your way around a Dutch oven and a Silpat (if you have to ask, then you definitely need this list). Your bookshelf has a dedicated cookbook section, plus several of your favorite recipe websites are bookmarked and apps downloaded. Well, we’ve got the Holy Grail. *Cue angelic singing, parting clouds, and beams of light.* OK, maybe these kitchen hacks won’t change your life in an “I won the lottery” or “I just found out I’m pregnant” kind of way. And maybe you’ve seen a few of these before. But we’ve mixed it up a bit and covered a lot of territory here — from pimping out your refrigerator to the easiest four-ingredient ice cream you’ll ever make (no cooking or fancy gizmos required). 1. Make Eggs in the Microwave Are you sick of eating a mediocre AM meal of bland yogurt at work every morning? Meet your new office best friend: the microwave. Find out how to make a breakfast-of-champions in just a few simple steps, plus the help of minimal equipment (a microwaveable plate or bowl). In under 5 minutes you can make scrambled eggs, or even fried eggs (hello desk-side huevos rancheros!), in the time that it would take you to order that overpriced cup of oatmeal. Your work day is about to get a whole lot better. 2. Section ground meat before freezing  100waystopreparehamburger.blogspot.com You can break off as much as you need without defrosting the whole package. 3. Reuse pickle brine  The Kitchn Drop chip-size slices of fresh cucumber into leftover pickle brine in the jar and store in the refrigerator for a few days to make crunchy quick pickles. (You can also drop in other vegetables like green beans, garlic, carrots or radishes. For best results, par-boil these veggies before pickling to speed up the process.) 4. Wet your fingers to remove eggshell Lifehack - Help, Tips and Guidance to improve all aspects of your life Stray shell bits in your cracked egg? Dab your finger in water before you go after it. Water acts like a magnet and the shell will stick to your finger without having to chase it around the bowl. 5. Make limp celery crisp again  feedyourskull.com Trim the top and bottom of the celery (cut it off of the root if it is still attached) and drop the stalks upright into a pitcher or jar of ice-cold water to re-crisp. You can also store celery like this. The ice water trick also works on tired broccoli, cauliflower, asparagus, lettuce, and spinach. 6. Makin’ crispy bacon without the mess America's Test Kitchen Forget about the cast iron skill. Line a baking sheet with heavy-duty aluminum foil (or two layers of foil) that has been crimped at 1-inch intervals to create a disposable bacon rack. Elevating the bacon keeps it out of the grease and allows hot air to circulate around the bacon, so it cooks and crisps evenly. 7. Use an egg slicer to slice mushrooms (or strawberries)  cookthink.com 8. Use your Microplane grater on burnt bits self.com If the bottom of your cookies got a wee bit scorched, brush the grater over the burnt side to buff away the evidence. 9. “Dot” your butter … better  barefeetinthekitchen.com When a recipe calls for “dotting” with butter, such as a fruit crisp or a breadcrumb-covered casserole (it adds richness and helps browning), grate chilled butter on the large holes of a flat grater to create uniform pieces that are easier to distribute. Just some cool food hacks I found, definitely try them out! ",
            "date": "Answered September 27, 2018",
            "views": "77",
            "upvotes": " View 24 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rod Emblau",
                    "user_href": "/profile/Rod-Emblau"
                },
                {
                    "user_id": "Denise Breard",
                    "user_href": "/profile/Denise-Breard"
                },
                {
                    "user_id": "Jane Delaney",
                    "user_href": "/profile/Jane-Delaney-9"
                },
                {
                    "user_id": "Ann Goldenberg",
                    "user_href": "/profile/Ann-Goldenberg"
                },
                {
                    "user_id": "Dervla Murphy",
                    "user_href": "/profile/Dervla-Murphy-8"
                },
                {
                    "user_id": "Sugat Borthakur",
                    "user_href": "/profile/Sugat-Borthakur-2"
                },
                {
                    "user_id": "Abhishek Sharma",
                    "user_href": "/profile/Abhishek-Sharma-2983"
                },
                {
                    "user_id": "Ravi Mittal",
                    "user_href": "/profile/Ravi-Mittal-72"
                },
                {
                    "user_id": "Marie McHale",
                    "user_href": "/profile/Marie-McHale"
                },
                {
                    "user_id": "Maria Gonzalez",
                    "user_href": "/profile/Maria-Gonzalez-403"
                },
                {
                    "user_id": "Amir Setia",
                    "user_href": "/profile/Amir-Setia"
                },
                {
                    "user_id": "Rebecca Frey",
                    "user_href": "/profile/Rebecca-Frey-4"
                },
                {
                    "user_id": "Anoopa John",
                    "user_href": "/profile/Anoopa-John-1"
                },
                {
                    "user_id": "Henokh Sihotang",
                    "user_href": "/profile/Henokh-Sihotang"
                },
                {
                    "user_id": "Heidy Baratto",
                    "user_href": "/profile/Heidy-Baratto"
                },
                {
                    "user_id": "Andreea Sp",
                    "user_href": "/profile/Andreea-Sp"
                },
                {
                    "user_id": "Marco Sampaio",
                    "user_href": "/profile/Marco-Sampaio-1"
                },
                {
                    "user_id": "Milka Valentino",
                    "user_href": "/profile/Milka-Valentino"
                },
                {
                    "user_id": "German Ignacio",
                    "user_href": "/profile/German-Ignacio-1"
                },
                {
                    "user_id": "Drew Jones",
                    "user_href": "/profile/Drew-Jones-78"
                },
                {
                    "user_id": "Trí Quang Lê",
                    "user_href": "/profile/Trí-Quang-Lê"
                },
                {
                    "user_id": "Carlos Deleon",
                    "user_href": "/profile/Carlos-Deleon-7"
                },
                {
                    "user_id": "Katrin Nelis",
                    "user_href": "/profile/Katrin-Nelis"
                },
                {
                    "user_id": "Adam Walsh",
                    "user_href": "/profile/Adam-Walsh-20"
                }
            ]
        },
        {
            "author_info": {
                "name": "Simon Gooder",
                "href": "/profile/Simon-Gooder"
            },
            "answer_text": "These are a little more cooking and prep related food hacks, but they are tried-and-true! Bacon - Cut your bacon strips in half before cooking them. It fits way better in the pan.Ginger Root - If you cook with ginger, try peeling it with a spoon. Use the concave edge of the spoon to scrape the skin off the flesh - it will save a lot of the ginger goodness as opposed to using a knife.Garlic - Peel garlic cloves by laying your knife sideways on top of one, and lightly pounding it with a side-fist. This will crack the peel right down to the good part, making it simple to peel off in one piece.Hard-Boiled Eggs - Bring your water to a boil, gently drop in the eggs, set your timer for 12 minutes. After 12 minutes, moved your eggs into a bowl of cold water and let sit for 2 minutes. They will be perfectly cooked, and easily peelable.Boiling Water - A dash of salt will bring your water to a boil quicker.Spices - When cooking with dry, powdered spices, heat will bring out the flavours. Try adding them to a hot, oiled pan before you add the rest of your ingredients for much richer flavours.Coconut Oil - Coconut oil has so many uses, it’s a true kitchen staple. Use in place of butter (1:1) in baking, cook with it, eat it on toast with sugar and cinnamon.",
            "date": "Answered November 26, 2016",
            "views": "27",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dan Irish",
                    "user_href": "/profile/Dan-Irish"
                },
                {
                    "user_id": "Natalie Sapantay",
                    "user_href": "/profile/Natalie-Sapantay"
                },
                {
                    "user_id": "Nicole Sadiee",
                    "user_href": "/profile/Nicole-Sadiee"
                },
                {
                    "user_id": "Marcus Chan",
                    "user_href": "/profile/Marcus-Chan-81"
                },
                {
                    "user_id": "Tom Rollinson",
                    "user_href": "/profile/Tom-Rollinson"
                },
                {
                    "user_id": "James Hale",
                    "user_href": "/profile/James-Hale-24"
                }
            ]
        },
        {
            "author_info": {
                "name": "Iona Buchanan",
                "href": "/profile/Iona-Buchanan-1"
            },
            "answer_text": "Store freshly washed lettuce (or other leafy greens) with some paper towel. The paper towel will absorb excess water and prevent the leaves from wilting and going soggy.Chop green onions or bacon with kitchen scissors directly into the bowl. (It's faster and less messy)Homemade iced coffee:Make coffee.Let it cool and pour into ice cube tray.Freeze the coffee.Blend the coffee cubes and milk (add sugar if you want it sweet).",
            "date": "Answered November 27, 2016",
            "views": "106",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Samuele Molle",
                    "user_href": "/profile/Samuele-Molle"
                },
                {
                    "user_id": "Ricky Kwok",
                    "user_href": "/profile/Ricky-Kwok"
                },
                {
                    "user_id": "Sahil Sen",
                    "user_href": "/profile/Sahil-Sen-3"
                },
                {
                    "user_id": "Manu Patil",
                    "user_href": "/profile/Manu-Patil-14"
                },
                {
                    "user_id": "Brad Dobson",
                    "user_href": "/profile/Brad-Dobson-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nicholas Mark Davies",
                "href": "/profile/Nicholas-Mark-Davies"
            },
            "answer_text": "Make Butter Spreadable Sometimes you want to spread some butter but when you take it out of the fridge the butter is super hard and really hard to spread. This is super annoying, so what do you do? Usually you just pop it in the microwave but the issue with this is it always seems to over melt the butter and make it into a big soupy mess just like this. That can be very annoying so there must be a better way. Well there is, take a cheese grater and then you just grate your butter stick. Yes that’s right, grate your butter stick. Now that has two added benefits, one it delivers energy to the butter by the grating motion which makes it a bit softer, and also the higher surface area makes it softer quicker also. Lastly it’s in this funny interesting spaghetti like consistency which now is super spreadable so you can just spread it on whatever you want and you have nice soft butter. Success!See more of my favorite food hacks here:More Of My Favorite Food Hacks ",
            "date": "Answered September 1, 2020",
            "views": "87",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Cindy Wright",
                "href": "/profile/Cindy-Wright-141"
            },
            "answer_text": "On days when you have the time, you can cook a large amount of good healthy food to refrigerate and freeze to eat later. You can make your own healthy, low sodium, chemicals-free frozen dinners.Frozen fruits and veggies are your friend.Don’t bring crap foods (prepackaged sweets, chips, etc.) into your home. Just leave ’em at the store.",
            "date": "Answered August 27, 2020",
            "views": "54",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shawree",
                "href": "/profile/Shawree"
            },
            "answer_text": "I would say one is knowing what produce you should always buy organic and which ones you don’t have to. Here’s an article about it. https://parentingwithadashofauthenticity.com/is-that-produce-safe-produce-you-should-always-buy-organic/ ",
            "date": "Answered February 27, 2019",
            "views": "58",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kendall Black",
                    "user_href": "/profile/Kendall-Black-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Esposito",
                "href": "/profile/Robert-Esposito-7"
            },
            "answer_text": "Eat simply, as close to the ground as you can. If you don’t eat fat, you won’t get fat. Why complicate things? ",
            "date": "Answered August 27, 2020",
            "views": "18",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Virginia Hanlon",
                    "user_href": "/profile/Virginia-Hanlon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martyn Benson",
                "href": "/profile/Martyn-Benson"
            },
            "answer_text": "What the hell is a ‘life hack’ in connection with food? Presumably you mean a life TIP ……but that would still not be a correct phrase to use in connection with food. The only possible life TIP in connection with food would be to wash it first before preparing or eating, or to cut it into small pieces before chewing and swallowing. Instead of TIP you could also use TRICK as a good English word, but hacking is usually associated with illegal computer break-ins or wioth chopping wood or similar. ",
            "date": "Answered April 27, 2019",
            "views": "87",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Frank Boni",
                "href": "/profile/Frank-Boni-2"
            },
            "answer_text": "I buy fresh flat leaf parsley and cilantro in bundles. After a quick soaking and drying, I remove the leaves, and wrap them in paper towels, and place them in the refrigerator, to be used as needed. The whole process takes me about 30 to 45 minutes. They last about a week. ",
            "date": "Answered August 18, 2019",
            "views": "49",
            "upvotes": " Answer requested by Abhishek Sharma",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Jones",
                "href": "/profile/John-Jones-1554"
            },
            "answer_text": "I don't know what this means life hack for food I don't understand mina Mina sinard? Cuz I like that name Mina I wonder why there's not more? And I noticed mina disappears at night ",
            "date": "Answered April 26, 2019",
            "views": "18",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Christian Gehman",
                "href": "/profile/Christian-Gehman"
            },
            "answer_text": "Making roux ahead of time in a busy kitchen can be very useful. What kind of food hacks are you thinking of? ",
            "date": "Answered May 17, 2019",
            "views": "16",
            "upvotes": " Answer requested by Jenny Tran"
        },
        {
            "author_info": {
                "name": "Zisis Kontogounis",
                "href": "/profile/Zisis-Kontogounis"
            },
            "answer_text": "Using the $14 VERTICAL jet bidet, instead of t. paper, for comfort, dignity, 100% cleaning, even on hemorrhoid presence, ecology, economy and hygiene ( it reduces: fecal dust and so UTI, HA Infection rates, food contamination, antibiotic resistant microbes, as MRSA). ",
            "date": "Answered May 19, 2019",
            "views": "49",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nikhil Zilpelwar",
                "href": "/profile/Nikhil-Zilpelwar"
            },
            "answer_text": "Best meal life hack? Ummm… always keep a bunch of dry fruits in your bagconsume the non carb food 1steat slowly and chew properly(you will be amazed how early you get full)keep a track of your micros and macrosindroduce new protein sources in your meals.",
            "date": "Answered May 3, 2019",
            "views": "89",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shawn Peterson",
                "href": "/profile/Shawn-Peterson-12"
            },
            "answer_text": "Marinate meat for best flavor, salt water when cooking pasta, salt vegetables after cooking. ",
            "date": "Answered August 18, 2019",
            "views": "29",
            "upvotes": " Answer requested by Abhishek Sharma"
        }
    ]
}