{
    "title": "What does the Bible say about creation and evolution? - Quora",
    "tags": [
        "Religion and Evolution",
        "Book of Genesis",
        "Creationism",
        "Creation (creativity)",
        "God and the Christian Bible",
        "Evolution (process)",
        "Human Evolution",
        "The Bible",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sam Adams",
                "href": "/profile/Sam-Adams-128"
            },
            "answer_text": "The bible says nothing about evolution. And if you’d read it you’d know that. It does say a lot about creation tho. In fact the very first line of Genesis begins with In the beginning gods [Elohim] created … The plural is not a typo. The original Hebrew text uses the word “Elohim” which is plural for “gods”. The use of the singular is a mistranslation. Genesis alone contains two distinct and contradictory creation stories. 2 Biblical Stories of Creation Most people are probably aware of those but in addition to those two,there is one referenced in the Books of Isaiah, Psalms and Job. In this version, the world is created in the aftermath of a great battle between God and what theologians say is a dragon in the waters called Rahab. (That story is only hinted at in Genesis.) But it doesn’t stop with those three. There are a number of other creation stories scattered throughout the bible. Seventeen more to be exact which brings the total to a grand total of twenty. And none of them agree. ",
            "date": "Answered May 10, 2019",
            "views": "76",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Patrick Earley",
                    "user_href": "/profile/Patrick-Earley-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven J. Thompson",
                "href": "/profile/Steven-J-Thompson"
            },
            "answer_text": "Strictly speaking, of course, it says nothing about evolution, or atoms, or the existence of planets around other stars, or about the germ theory of disease. Creationism in the modern sense did not exist before evolutionary theory, since it is a reaction to that theory. The Bible says a fair amount about creation: not just that God created the sky and Earth and all their inhabitants, or that He apparently created the sun a couple of days after creating daylight, but that God apparently creates individual people (there are several passages crediting God with shaping the author in his mother’s womb — it was apparently a routine Israelite theological trope). Noah’s Flood can be viewed as a partial, temporary reversal of creation: God undoes the separation of land from water, and the separation of the waters above the sky from the waters below it, before (apparently) restoring these separations in the last weeks of the Flood. ",
            "date": "Answered May 17, 2019",
            "views": "62",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Holly Root-Gutteridge",
                    "user_href": "/profile/Holly-Root-Gutteridge"
                },
                {
                    "user_id": "Patrick Earley",
                    "user_href": "/profile/Patrick-Earley-15"
                }
            ]
        }
    ]
}