{
    "title": "What is Planck's quantum theory equation? - Quora",
    "tags": [
        "Planck's Quantum Theory",
        "Quantum Field Theory",
        "Quantum Mechanics"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Anzaldua",
                "href": "/profile/David-Anzaldua-2"
            },
            "answer_text": "The combined work of Max Planck and Albert Einstein form the core of quantum physics. It was Planck, however, who started it off by introducing his “quantum of action, the Planck constant (h). Einstein would later use h to calculate the energy of a photon as E(pho)=hf, wherein the energy of a photon E(pho) equals Planck’s constant (h) times the photon’s frequency (f). Before Einstein used Planck’s constant to calculate the energy of a photon, however, Planck did something else extraordinary with it that the questioner is probably referring to. By lining up three universal constant: his Planck constant (h), the Cavendish gravitational constant (G) and the speed of light (c), Planck derived the so-called Planck units. Planck did this by “dimensional analysis,” a fancy way of saying that he arranged these constants and algebraically “crossed out” their units until he had left over only a unit of Planck length mass and time. Anyone can look up these constants and their units and with a little patience and algebra re-derived the Planck units. (There are other Planck units but this will do). These units are highly valued (even revered) by theoretical physicists because they are said to be free of “arbitrariness,” which means the Planck units are derived from “pure” constants that are natural relationships in the universe, more like pi having to do with the geometry of circles than a measured “constant,” like the diameter of the Earth, for example. The Planck units started off a frenzy of calculations for all kinds of things that is not dying down among theoretical physicists (certainly this one). Just for a little housekeeping, the Planck constant (or “Planck’s constant”) is called “an action” by physicists. It has the units of: h = an action = mass x length^2/time. Physicist instantly recognize the usefulness of “an action” because the action (h) that occurs within a unit of time give the units of energy: Energy = mass x length^2/time^2 And we all know how important energy is in Physics! There will be more to come regarding the Planck units in the future!!! ",
            "date": "Answered March 14, 2018",
            "views": "19",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harish Kumar",
                    "user_href": "/profile/Harish-Kumar-5656"
                },
                {
                    "user_id": "Emily Toront",
                    "user_href": "/profile/Emily-Toront"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tejasvi Soi",
                "href": "/profile/Tejasvi-Soi"
            },
            "answer_text": "Planck's law describes the spectral density of electromagnetic radiation emitted by a black body in thermal equilibrium at a given temperature T. The law is named after Max Planck, who proposed it in 1900. It is a pioneering result of modern physics and quantum theory. ",
            "date": "Answered March 22, 2018",
            "views": "456",
            "upvotes": "0"
        }
    ]
}