{
    "title": "What do physicists think of Albert Einstein? - Quora",
    "tags": [
        "Albert Einstein (physicist)",
        "Physicists"
    ],
    "response": [
        {
            "author_info": {
                "name": "Albert Heisenberg",
                "href": "/profile/Albert-Heisenberg-1"
            },
            "answer_text": "In a 1999 BBC News Survey of the top physicists in the world, Einstein came out as the Number 1 physicist of all time, topping the great Sir Isaac Newton. Such is the elevated perch Einstein holds in the pantheon of science. He is the architect of two of the revolutionary pillars of modern physics: Relativity and Quantum Theory. Source: BBC News | SCI/TECH | Einstein the greatest His annus mirabilis is regarded as the most explosive outpouring of genius in a single calendar year. Head of Applied Physics at Yale University Professor A. Douglas Stone argues, convincingly, that Einstein should have won at least 7 or 8 (eight) Nobel Prizes. Fantasy Physics: Should Einstein Have Won 7 Nobel Prizes? At the 1927 Solvay Conference, the top minds in Europe gathered to discuss the cutting edge problems of the day. In the traditional portrait picture, they insisted that Einstein sit in the middle because they regarded him as the crown jewel of the conference. Werner Heisenberg, the innovating mind behind matrix mechanics and the uncertainty principle underlying modern quantum mechanics, cites Einstein in his biographical notes as his inspiration for his Uncertainty Principle. In 1924, Einstein proposed wave-particle duality (a restatement of work he had done earlier in 1911), and proposed that deBroglie waves are described by the Hamilton Jacobi equation, and in so doing, laid the foundation for wave mechanics, as Schrodinger always acknowledged. Einstein’s work on probability waves led directly to the Born rule, as Max Born, another architect of quantum mechanics, always acknowledged. Born once said “even if Einstein had never written a single word about relativity, he would still be regarded as one of the top theoretical physicist of all times.” (Max Born, Private Letters 1932). Dirac regarded Einstein as an “artist,” the last of the “natural philosophers” he opined. Max Planck called him the second coming of Galileo and the new Copernicus. Walther Nernst called him the second coming of Newton. For an entire decade, 1903 until 1913, Einstein was the only European scientist who truly believed light was both a particle and a wave - he was even ridiculed by Bohr who quipped, “I will disprove Einstein’s particulate theory by sending him a telegram.” (The joke being that the telegram relies on wave principles). Everything from black holes to LASERS (it was Einstein who came up with the idea for the LASER in his seminal paper on spontaneous and stimulated emission), bears his fingerprints. Even his less notable work like his EPR paper pushed the field decades into the future. His more esoteric work, such as a paper he wrote in 1919 on quantizing chaos (showing how any semi-classical adaptation of classical chaos theory cannot be generalized - i.e. quantized - using the old Bohr-Sommerfeld rule). This paper is critical to contemporary problems in my field - steady state photonics. Einstein was the first human being to predict the boson, 80 years before it was discovered. He predicted gravitational waves almost 100 years before they were discovered. Source: What Is a Boson? Einstein Was the First to Know To quote Richard Feynam, “Einstein was a giant…His head was always in the clouds, and yet his feet were always on the ground. Those of us who are not so tall must choose.” Feynman went on to explain that it was Einstein who introduced gauge symmetry into modern theoretical physics. Quantum Field Theory adapts methods pioneered by Einstein, who cast general relativity as an expansive field theory. The greatest form of flattery is imitation, and every great physicist since Einstein has, in some way, borrowed something from his unparalleled scientific career. His name is synonymous with genius for good reason. ",
            "date": "Updated April 6, 2020",
            "views": "188",
            "upvotes": " View 199 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dan Blanks",
                    "user_href": "/profile/Dan-Blanks"
                },
                {
                    "user_id": "Celso Gonçalves",
                    "user_href": "/profile/Celso-Gonçalves-1"
                },
                {
                    "user_id": "Alex Moshte",
                    "user_href": "/profile/Alex-Moshte"
                },
                {
                    "user_id": "Archana Yadav",
                    "user_href": "/profile/Archana-Yadav-285"
                },
                {
                    "user_id": "Simon Burstin",
                    "user_href": "/profile/Simon-Burstin"
                },
                {
                    "user_id": "William Sonnerklev",
                    "user_href": "/profile/William-Sonnerklev"
                },
                {
                    "user_id": "Jose Ignacio Blanco Garcia-Valdecasas",
                    "user_href": "/profile/Jose-Ignacio-Blanco-Garcia-Valdecasas"
                },
                {
                    "user_id": "Anthony Serfaty",
                    "user_href": "/profile/Anthony-Serfaty"
                },
                {
                    "user_id": "Ryan Baron",
                    "user_href": "/profile/Ryan-Baron-1"
                },
                {
                    "user_id": "Pete Doyle",
                    "user_href": "/profile/Pete-Doyle-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pentcho Valev",
                "href": "/profile/Pentcho-Valev"
            },
            "answer_text": "Physicists usually sing “Divine Einstein” and “Yes we all believe in relativity, relativity, relativity” but sometimes get honest and say this: https://www.highbeam.com/doc/1G1-185331159.html  \"That lecture, by the German mathematician Hermann Minkowski, established a new arena for the presentation of physics, a new vision of the nature of reality redefining the mathematics of existence. The lecture was titled Space and Time, and it introduced to the world the marriage of the two, now known as spacetime. It was a good marriage, but lately physicists passion for spacetime has begun to diminish. And some are starting to whisper about possible grounds for divorce.\" http://www.newscientist.com/article/mg20026831.500-what-makes-the-universe-tick.html  \"...says John Norton, a philosopher based at the University of Pittsburgh, Pennsylvania. Norton is hesitant to express it, but his instinct - and the consensus in physics - seems to be that space and time exist on their own. The trouble with this idea, though, is that it doesn't sit well with relativity, which describes space-time as a malleable fabric whose geometry can be changed by the gravity of stars, planets and matter.\" http://www.amazon.com/Faster-Than-Speed-Light-Speculation/dp/0738205257  Joao Magueijo, Faster Than the Speed of Light, p. 250: \"Lee [Smolin] and I discussed these paradoxes at great length for many months, starting in January 2001. We would meet in cafés in South Kensington or Holland Park to mull over the problem. THE ROOT OF ALL THE EVIL WAS CLEARLY SPECIAL RELATIVITY. All these paradoxes resulted from well known effects such as length contraction, time dilation, or E=mc^2, all basic predictions of special relativity. And all denied the possibility of establishing a well-defined border, common to all observers, capable of containing new quantum gravitational effects.\" https://www.edge.org/response-detail/26563  Nobel Laureate David Gross observed, \"Everyone in string theory is convinced...that spacetime is doomed. But we don't know what it's replaced by.\" https://www.youtube.com/watch?v=U47kyV4TMnE  Nima Arkani-Hamed (06:09): \"Almost all of us believe that space-time doesn't really exist, space-time is doomed and has to be replaced by some more primitive building blocks.\" https://edge.org/response-detail/25477  What scientific idea is ready for retirement? Steve Giddings: \"Spacetime. Physics has always been regarded as playing out on an underlying stage of space and time. Special relativity joined these into spacetime... [...] The apparent need to retire classical spacetime as a fundamental concept is profound...\" http://www.newscientist.com/article/mg20727721.200-rethinking-einstein-the-end-of-spacetime.html  \"Rethinking Einstein: The end of space-time [...] The stumbling block lies with their conflicting views of space and time. As seen by quantum theory, space and time are a static backdrop against which particles move. In Einstein's theories, by contrast, not only are space and time inextricably linked, but the resulting space-time is moulded by the bodies within it. [...] Something has to give in this tussle between general relativity and quantum mechanics, and the smart money says that it's relativity that will be the loser.\" https://www.newscientist.com/article/mg22730370-600-why-do-we-move-forwards-in-time/  \"[George] Ellis is up against one of the most successful theories in physics: special relativity. It revealed that there's no such thing as objective simultaneity. Although you might have seen three things happen in a particular order – \u2028A, then B, then C – someone moving \u2028at a different velocity could have seen \u2028it a different way – C, then B, then A. \u2028In other words, without simultaneity there is no way of specifying what things happened \"now\". And if not \"now\", what is moving through time? Rescuing an objective \"now\" is a daunting task.\" http://www.newscientist.com/article/mg22029410.900  New Scientist: \"Saving time: Physics killed it. Do we need it back? [...] Einstein landed the fatal blow at the turn of the 20th century.\" http://www.guardian.co.uk/books/2013/jun/10/time-reborn-farewell-reality-review  \"And by making the clock's tick relative - what happens simultaneously for one observer might seem sequential to another - Einstein's theory of special relativity not only destroyed any notion of absolute time but made time equivalent to a dimension in space: the future is already out there waiting for us; we just can't see it until we get there. This view is a logical and metaphysical dead end, says Smolin.\" http://www.bookdepository.com/Time-Reborn-Professor-Physics-Lee-Smolin/9780547511726  \"Was Einstein wrong? At least in his understanding of time, Smolin argues, the great theorist of relativity was dead wrong. What is worse, by firmly enshrining his error in scientific orthodoxy, Einstein trapped his successors in insoluble dilemmas...\" https://www.perimeterinstitute.ca/research/conferences/convergence/roundtable-discussion-questions/what-are-lessons-quantum  Perimeter Institute: \"Quantum mechanics has one thing, time, which is absolute. But general relativity tells us that space and time are both dynamical so there is a big contradiction there. So the question is, can quantum gravity be formulated in a context where quantum mechanics still has absolute time?\" https://www.quantamagazine.org/20161201-quantum-gravitys-time-problem/  \"The effort to unify quantum mechanics and general relativity means reconciling totally different notions of time. In quantum mechanics, time is universal and absolute; its steady ticks dictate the evolving entanglements between particles. But in general relativity (Albert Einstein's theory of gravity), time is relative and dynamical, a dimension that's inextricably interwoven with directions X, Y and Z into a four-dimensional \"space-time\" fabric.\" http://science.sciencemag.org/content/early/2015/08/05/science.aac6498  \"In Einstein's general theory of relativity, time depends locally on gravity; in standard quantum theory, time is global - all clocks \"tick\" uniformly.\" http://arxiv.org/pdf/gr-qc/0610057.pdf  \"One one hand, time in quantum mechanics is a Newtonian time, i.e., an absolute time. In fact, the two main methods of quantization, namely, canonical quantization method due to Dirac and Feynman's path integral method are based on classical constraints which become operators annihilating the physical states, and on the sum over all possible classical trajectories, respectively. Therefore, both quantization methods rely on the Newton global and absolute time. (...) The transition to (special) relativistic quantum field theories can be realized by replacing the unique absolute Newtonian time by a set of timelike parameters associated to the naturally distinguished family of relativistic inertial frames.\" http://www.hindawi.com/journals/isrn/2013/509316/  \"In quantum mechanics, time is absolute. The parameter occurring in the Schrödinger equation has been directly inherited from Newtonian mechanics and is not turned into an operator. In quantum field theory, time by itself is no longer absolute, but the four-dimensional spacetime is; it constitutes the fixed background structure on which the dynamical fields act. GR is of a very different nature. According to the Einstein equations (2), spacetime is dynamical, acting in a complicated manner with energy momentum of matter and with itself. The concepts of time (spacetime) in quantum theory and GR are thus drastically different and cannot both be fundamentally true.\" Pentcho Valev ",
            "date": "Answered December 6, 2016",
            "views": "14",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vladimir Dubonjic",
                    "user_href": "/profile/Vladimir-Dubonjic"
                },
                {
                    "user_id": "John Purcell",
                    "user_href": "/profile/John-Purcell-4"
                },
                {
                    "user_id": "Richard Gold",
                    "user_href": "/profile/Richard-Gold-8"
                }
            ]
        }
    ]
}