{
    "title": "What would had happened to the universe if gravity wouldnt had dominated? - Quora",
    "tags": [
        "Gravity",
        "The Universe"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christian Santangelo",
                "href": "/profile/Christian-Santangelo"
            },
            "answer_text": "But gravity did not dominate. Gravity is the weakest of all four forces already. So how come it seems to “win”? Consider, for a moment, the chair upon which I assume you are sitting. That chair is made out of protons and electrons, both charged particles, that interact very strongly. How strongly? Well, strongly enough for this:  The repulsion between clumps of hair is so strong that it overcomes the gravitational attraction between those hair clumps AND their attraction to the Earth. So why don’t we feel those incredible forces in everyday life? Simply put, there are roughly as many electrons and protons in every object. To put it another way, the attraction between protons and electrons is so strong that they, essentially, neutralize themselves over sufficiently large volumes. A similar thing happens with the strong force, which holds those protons together. In fact, the strong force is so strong, that its “charge” (called color) is completely eliminated on scales that are the size of a proton. We call this effect screening. That means that on the largest scales, there is nothing left except for gravity. But there is yet another important feature of gravity that is relevant. In the case of charge, there are two kinds of charge that are mutually attractive but self repulsive. In the strong force, there are three kinds. For gravity, there is only one kind of charge, mass, and mass always attracts other mass. In a situation like that, there isn’t really anyway for gravity to screen itself on any scale. When two particles come together, rather than reducing their combined effect, they increase it. None of this answers your question, exactly, but it gives context. What would it have taken for gravity not to dominate at long scales? The only way to do that that makes sense from a physics standpoint, as I understand it, would be to have no gravity at all. But having no gravitational force does not change any of the discussion above. So you would still have a strong force and an electrostatic force, and those forces would still be screened on large length scales. Therefore, without gravity - assuming there still was a universe - the universe would be a structureless gas of molecules slowly cooling down. ",
            "date": "Answered February 14, 2017",
            "views": "310",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Srivatsa Samji",
                    "user_href": "/profile/Srivatsa-Samji-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Uttam Kumar",
                "href": "/profile/Uttam-Kumar-1047"
            },
            "answer_text": "The answer is given below even though i have done my post graduation studies in physics, but i am using my common sense here to say that except in mathematics and in other man made disciplines of studies, i realized TIME IS AN INDEPENDENT ENTITY AND DOES NOT INTERACT AT ALL WITH ANYTHING ELSE. NO AGENT CAN BRING CHANGE IN TIME TOO. GRAVITY IS A PROPERTY OF OF MASS THAT OCCUPIES SPACE. GRAVITY HAS NOTHING TO DO WITH TIME. universe as it has mass and occupies space cannot be depleted of gravity and the universe being a true reality, such a question bearing hypothetical reality makes little sense me. ",
            "date": "Answered May 23, 2019",
            "views": "60",
            "upvotes": "0"
        }
    ]
}