{
    "title": "What if one day scientists discover something is about to hit Earth from space? What would we do? - Quora",
    "tags": [
        "Discoveries",
        "Indian Space Research Organisation (ISRO)",
        "Scientists",
        "NASA",
        "Space Exploration",
        "Outer Space",
        "Earth (planet)",
        "Planetary Science",
        "Astronomy",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bradley Taylor",
                "href": "/profile/Bradley-Taylor"
            },
            "answer_text": "We don’t have any defense currently. There are lots of ideas on possible ways to defend ourselves, like trying to deflect it with a bomb, but currently nothing is in operation. Since we have no defense, what we would do is try and predict where it would hit and warn the people there to evacuate. If it hits the ocean, which is most likely since most of the Earth is ocean, then it could create a tsunami which would mean a very large evacuation on the coasts. more information here: Planetary Defense Frequently Asked Questions ",
            "date": "Answered August 12, 2019",
            "views": "44",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ace Pace",
                    "user_href": "/profile/Ace-Pace-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Salvatore Barrera",
                "href": "/profile/Salvatore-Barrera"
            },
            "answer_text": "I really would not know if we yet have the defensive systems/offensive systems to prevent and destroy an asteroidal attack to Earth. As we all know, they/we had plans to destroy the asteroid with powerful weapons such as a nuclear bomb, but we all must be aware of the downfall of the debris and the eventual detrimental consequences, The other idea was/is to send a vehicle toward the asteroid equipped with retro-rockets and push the asteroid away from Earth’s orbit. ",
            "date": "Answered August 12, 2019",
            "views": "24",
            "upvotes": " Answer requested by Ace Pace"
        }
    ]
}