{
    "title": "What happens when your blood is contaminated? - Quora",
    "tags": [
        "Contamination",
        "Toxicology",
        "Blood"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Wright",
                "href": "/profile/David-Wright-906"
            },
            "answer_text": "It depends what it has become contaminated with. Your blood is a transport system for both nutrients and waste products, so it has a built in system for cleaning out toxic and unwanted chemicals. In general, this usually involves these toxins being modified in the liver into a form that can be easily excreted, and then… well, excreting them, either by depositing them into the intestines to be excreted as solid waste or having them filtered by the kidneys and passed as urine. Notice that even for toxins that will be excreted by the kidneys, they often need to be processed by the liver first, so the liver is probably the most important organ for detoxifying the body. This kind of process is happening all the time to get rid of waste products, but it’s also how the body gets rid of anything that gets into the blood from outside, including things like medications and alcohol. If the blood becomes contaminated with something that the liver and kidneys can’t excrete, or it’s coming into the body quicker than the liver and kidneys can get rid of it, then it can cause problems. Again, it depends on exactly what the contamination is, but examples might be things like heavy metal poisoning. Again, since the bloodstream is the transport system for the body, this can mean that the contaminant can get spread to all the organs and tissues of body, and may cause damage there. What kind of damage is caused will obviously depend on what the contaminant is. The other way blood might be contaminated is if it becomes infected by some kind of micro-organism. What exactly happens in this case will also largely depend on the micro-organism in question, how fast it is spreading, and how good it is at evading the immune system. When a rapidly-spreading infection gets into the bloodstream, this is a serious problem and usually causes a medical emergency. We sometimes say that this infection has “become systemic”, because through the bloodstream in may have access to all of the organ systems of the body. If it is a bacterial infection, we sometimes refer to this blood infection as “sepsis”. This can be lifethreatening - obviously if the micro-organism infects all of your tissues that can be deadly, but the immune system can sometimes overreact and damage tissues even more than the infection did. However, there are a range of more insidious infectious organisms which can quietly and slowly contaminate the blood. These are often organisms which have evolved to use blood as a pathway to infect other people (either via blood-to-blood contact, or by moving into some other fluid or body organ). These can include viruses like Hepatitis or HIV, which can spread either through saliva or sexual contact but also directly through blood contact, as well as larger parasites such as those that cause malaria or sleeping sickness, which are often spread by insect bites. There are probably as many ways that kind of blood contamination can go as there are micro-organisms - I could talk about tetanus, or gangrene, or rabies, for example, which all involve some kind of contamination of the bloodstream, but are all very different. ",
            "date": "Answered July 20, 2020",
            "views": "28",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Faruque Hossain Piyada",
                    "user_href": "/profile/Faruque-Hossain-Piyada"
                }
            ]
        }
    ]
}