{
    "title": "What is Huxley's warning in Brave New World? - Quora",
    "tags": [
        "Aldous Huxley (author)",
        "Brave New World (1932 book)",
        "Dystopian Fiction (genre)",
        "Warnings and Cautions",
        "British Literature",
        "Literary Analysis and Criticism",
        "Novels",
        "Literature"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Hudson",
                "href": "/profile/John-Hudson-158"
            },
            "answer_text": "Question: What is Huxley’s warning in Brave New World? Answer: Brave New World contains a lot of wisdom. It explores some important issues such as what is the meaning of society. What role should it play? In some ways it’s very much a book of questions rather than answers. Some of the best Greek philosophers used this approach to lead one to ‘their’, or ‘your own’ answers and conclusions. And in some ways The Book of Job does the same thing. Lots of questions. And at the end - when one is expecting the author (or God) to provide some answers, one just gets left with - more questions. Good questions. Which means that Brave New World, like The Book of Job, is multi-layered, and highly interpretable. And not necessarily a particularly satisfying read either. On the other hand it may be a book one keeps coming back to for further exploration. So - these are just a few of my thoughts, bearing in mind that with inflation, a penny remains a fair price for most people’s thoughts. Huxley is suggesting: that any design for a Utopia will have problems. Some examples are:It won’t suit everybody.It will be a compromise between such things as individuality and conformity.It will exchange dynamics and progress for security and comfort.that any process, pathway, or method for moving towards Utopia will, if pursued too far (far less than all the way) lead to a dystopia. In short - it’s unbalanced between competing aims / objectives (see below), and becomes lopsided, and possibly dysfunctional.that there are alternative aims and goals for a society, and any attempt to pursue some at the expense of others has real costs, for some people, and the society as a whole. Some alternative aims include:happinesspleasuresecurity and safetycomfortconformitystability and predictabilitylongevityhealth (rather different to tacking on centuries of old age to middle age - which is one form of longevity).the greatest ‘good’ of the greatest numbersfreedom and libertydiversityprogress (such as increasing knowledge, science, and technology, but also standard of living, military power … whatever).achievement (eg artistic, knowledge gaining, whatever)artistryexcellencemeritocracypower and strength (military, technological, economic - whatever)peacevirtueserenitywisdomromantic loveand this list can go on a lot longer. (Huxley would not have considered environmental issues, the happiness of livestock, immortality, or expansion to the stars, because they were not on the horizon in 1930. Now we would need to include these together with Vegan views, etc.).that society will always have some forms of coercive powers over individuals in order to ‘encourage’ conformity with the aims of this society. Such powers may be as mild as ostracism and exclusion, or as hideous as torture and death, but they will be pretty rugged for the individuals who confront them.That one’s interpretation of the important aims for a ‘good’ society will be heavily dependent upon one’s experiences and world view. A central consideration will be how one views the role of mankind, as an individual, and as a collective, viz. the Universe, and society. Mankind as God’s special creature, or as God’s inventor, play an important role in this.That the idea of ‘Justice’ for the individual will always depend upon the predominant worldview held by that society. If stability is considered an important aim of society, then individualism will not get much support in the judicial system. On the other hand, if ‘progress’ is the important aim, then genius and enterprise will get judicial backing against the forces of mediocrity, bureaucracy and conformity that seek to shackle it.Huxley is a novelist, and as such undergoes the artistic struggles of the creative community. He understands that it is individuals suffering in adversity that produce progress and creativity. But it may also be true that they will do so regardless of the structure of society, because they are individuals who will not conform. A common historical approach of societies is to oppose them during life, and venerate them after death. This could go on a lot longer, but I think that’s sufficient to understand that Brave New World (like The Book of Job) asks a lot of questions, and implicitly, contains a lot of messages. Quite remarkably so for what is not a particularly long book. One of the curious features, and arguable strengths, of BNW is that Huxley does not include any protagonists who are good at arguing or expressing the competing ideas. Huxley’s characters are caught up in the world, and several of them experience dissatisfaction with the BNW society and its goals, but they aren’t able to articulate it well. They feel something is wrong, dissatisfying, stultifying, and empty about this world of easy pleasure and Soma induced happiness, but they aren’t able to coherently express or argue what’s troubling them. That is left entirely to the reader to work out for themselves. The principle social aim of the BNW society was ‘happiness’, largely interpreted as sensual pleasure - hence plenty of sex and soma. The greatest happiness of the greatest number equals well-being. Or does it? Huxley questions this too. What about creativity? What about striving? What about the satisfaction of achievement? What about endeavour, survival against the odds, individuality and non-conformity? What about the spirit and courage of the explorers? What about saints and martyrs and good old fashioned asceticism and even perversity? Is consumerism virtue? Is God dead? And what about other ways of defining ‘happiness’ apart from sensual pleasure, security, etc.? Well that’s at least two-pennies’ worth. Thanks for the A2A Hope this helps. ",
            "date": "Answered March 11, 2020",
            "views": "86",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Calista Ebenezer",
                    "user_href": "/profile/Calista-Ebenezer-2"
                }
            ]
        }
    ]
}