{
    "title": "What is the difference between arts, humanities and social sciences? - Quora",
    "tags": [
        "Humanities",
        "Social Sciences",
        "Comparisons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kollipara Yogeshwara Prabhu",
                "href": "/profile/Kollipara-Yogeshwara-Prabhu"
            },
            "answer_text": "Arts and Humanities are subjects such as: Literature, languages, art history, music, theater, law, history (also a social science), philosophy, religion (also a social science), visual arts (painting, sculpture, etc...) which deal with our need to have order and beauty in our world and to understand (or at least seek) our purpose here. Humanities includes the fields of Fine Arts and Performing Arts. Social Sciences are subjects such as: Anthropology, Communication (also professional), Economics, Education (also professional), Geography, History (also a humanity), Law (also a humanity), Political Science, Psychology, Religion (also a humanity), Social Work (also professional), Sociology, and the like which deal with the human condition and how we interact with each other.  Natural Sciences are subjects such as: Astronomy, Biology, Chemistry, Geology, Physics, and the interdisciplinary fields like Earth Science or Marine Science and the like. They deal with the natural world around us and how it is composed.  Mathematics: Pretty well self-explanatory. Includes Algebra, Calculus, Geometry, Trigonometry, and Statistics (among others) dealing with numeric logic and order in our world.  Engineering (professional): The fields of practical applied science that seek to understand how things (usually man made, physical things) work and why.  Professional: Those fields that are specific to an occupation or vocation such as business, nursing, or education. Intended to provide the \"how to\" of an occupation or occupational group.  You'll notice significant overlap in some of these. That's because most fields can be studied from various perspectives. The liberal arts tend toward \"why is\" whereas the professional and applied fields tend toward the \"how to\".  There's also a difference between the way these fields use qualitative versus quantitative study. The sciences and professions tend much more to the quantitative (\"we counted it and this is what we have...\") where the arts and humanities tend toward the qualitative (\"based on some observations, it would appear that...\")  Which meets your needs depends entirely on what you plan to do with the education ",
            "date": "Answered December 9, 2015",
            "views": "22",
            "upvotes": " View 24 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Meiji Marts",
                    "user_href": "/profile/Meiji-Marts"
                },
                {
                    "user_id": "Chaitanya Bhaskar",
                    "user_href": "/profile/Chaitanya-Bhaskar-6"
                },
                {
                    "user_id": "Ginger Lee",
                    "user_href": "/profile/Ginger-Lee-27"
                },
                {
                    "user_id": "Ranjith Balachandran",
                    "user_href": "/profile/Ranjith-Balachandran-3"
                },
                {
                    "user_id": "Harsa",
                    "user_href": "/profile/Harsa"
                },
                {
                    "user_id": "Anupam Chatterjee",
                    "user_href": "/profile/Anupam-Chatterjee-18"
                },
                {
                    "user_id": "Ragini Sharma",
                    "user_href": "/profile/Ragini-Sharma-226"
                },
                {
                    "user_id": "Kelliehan Alexander",
                    "user_href": "/profile/Kelliehan-Alexander"
                },
                {
                    "user_id": "Shaziee Ramjaun",
                    "user_href": "/profile/Shaziee-Ramjaun"
                },
                {
                    "user_id": "Prasath Selva",
                    "user_href": "/profile/Prasath-Selva-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Plummer",
                "href": "/profile/Joseph-Plummer-1"
            },
            "answer_text": "\"Humanities\" is NOT a catchall term for everything that isn't sciences. The NEH defines the humanities as follows: \"What are the humanities?'The term 'humanities' includes, but is not limited to, the study and interpretation of the following: language, both modern and classical; linguistics; literature; history; jurisprudence; philosophy; archaeology; comparative religion; ethics; the history, criticism and theory of the arts; those aspects of social sciences which have humanistic content and employ humanistic methods; and the study and application of the humanities to the human environment with particular attention to reflecting our diverse heritage, traditions, and history and to the relevance of the humanities to the current conditions of national life.'--National Foundation on the Arts and the Humanities Act, 1965, as amended\" So the Humanities are distinct from the Arts and Quantitative Social Sciences. Humanities includes art history and criticism, but if you are painting a picture or dancing, you are in the realm of arts, not humanities. If you are doing a survey to be put into a statistical database, it might be a Science-Humanities hybrid exercise, but once you start crunching the numbers, you are doing Social Science. These are man-made distinctions to help us categorize and organize, but we shouldn't be afraid of when things overlap. There is always gray area. The best example is literature. What if someone writes a novel that involves sociological history, theory, and analysis? Literature is a humanity, but people often think of authors as \"artists.\" The easiest way to think about it is if it has \"science\" as part of the name, there's a bunch of math and scientific method, therefore not humanities or arts. If there's a bunch of non-verbal communication, and maybe a performance element, it's arts, and you know what the arts are, right? If it sounds like a school subject with a lot of reading and papers, but not a lot of math, it's probably a humanity. ",
            "date": "Updated April 17, 2018",
            "views": "449",
            "upvotes": " View 61 Upvoters",
            "upvoters": [
                {
                    "user_id": "Neellohit Roy",
                    "user_href": "/profile/Neellohit-Roy"
                },
                {
                    "user_id": "Harsa",
                    "user_href": "/profile/Harsa"
                },
                {
                    "user_id": "Pancho Ibasco",
                    "user_href": "/profile/Pancho-Ibasco"
                },
                {
                    "user_id": "Ameer Hamza",
                    "user_href": "/profile/Ameer-Hamza-531"
                },
                {
                    "user_id": "Deepak Sharma",
                    "user_href": "/profile/Deepak-Sharma-564"
                },
                {
                    "user_id": "Wai Shan",
                    "user_href": "/profile/Wai-Shan-3"
                },
                {
                    "user_id": "Dennis N",
                    "user_href": "/profile/Dennis-N-17"
                },
                {
                    "user_id": "Tanishq Wadhwani",
                    "user_href": "/profile/Tanishq-Wadhwani"
                },
                {
                    "user_id": "Venkat Nagendra",
                    "user_href": "/profile/Venkat-Nagendra-5"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/JWS-7"
                }
            ]
        }
    ]
}