{
    "title": "What would you say to someone who doesn't believe in science? - Quora",
    "tags": [
        "Belief and Beliefs",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jack Noel",
                "href": "/profile/Jack-Noel-8"
            },
            "answer_text": "Like Rik Hewitt, I think anything we say must depend on our assessment of the person we’re talking with and on the circumstances. We don’t “pipe up” and tell an non believer in a church that they’re just flat out wrong because many if not all of those present agree in this particular non-belief and you know those people aren’t constrained by reason in their reactions to such statements. Pragmatically and in view of everyone’s right to speak their mind or their position on things including Science, we can reasonably restrict ourselves to rebuttals only when the person expressing non belief in Science is trying to cause a general reaction against Science and scientists. When someone does this: it’s an action which may effect everyone negatively and we are part of “everyone” in the United States. ",
            "date": "Answered April 11, 2017",
            "views": "565",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ricardo Harris",
                "href": "/profile/Ricardo-Harris-8"
            },
            "answer_text": "I know I should ask this as another question, and I will, but this one has attracted enough followers and is tangential enough to beg asking here. What if it's someone you care about? What do you say to a science denier who is also your father? Your mother? Your best friend from college? Your roommate? What do you say when your dad thinks your girlfriend's gay brother is unnatural? When your roommate dumps used car oil in a drain, saying everything is fine from an idea that climate change and pollution are somehow myths? What do you say to someone who doesn't believe in science, that you still want to respect and love? ",
            "date": "Answered October 17, 2017",
            "views": "360",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kaulie Flower",
                    "user_href": "/profile/Kaulie-Flower"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathan Miskimen",
                "href": "/profile/Nathan-Miskimen"
            },
            "answer_text": "I’m not entirely sure as to what this person actually believes, but I’m going to assume he doesn’t believe anything he can’t see himself. There is a story by the great Issac Asimov, about a robot who was built to have good “reasoning” abilities, to enable the robot to replace humans on a special station. http://addsdonna.com/old-website/ADDS_DONNA/Science_Fiction_files/2_Asimov_Reason.pdf Show him the story, and I would suggest challenging him as to what he actually does believe, and figure out what he believes, and find out why he believes that. I suspect you’ll find a lot of things in a very short period of time that he believes, but he would be incapable of testing them for himself. ",
            "date": "Answered April 12, 2017",
            "views": "377",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Louis Cohen",
                "href": "/profile/Louis-Cohen-1"
            },
            "answer_text": "Science is an argument from experience. That’s why it’s different from philosophy or religion. You can’t reason with science-deniers, because science is reason validated by experience. About all you can do is point out that the science denier could not listen to Rush Limbaugh or read Breitbart if not for science. While you walk away consider that the science denier might pull his/her genes out of the gene pool by not vaccinating their kids. ",
            "date": "Answered June 26, 2017",
            "views": "600",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sandy Perlmutter",
                    "user_href": "/profile/Sandy-Perlmutter"
                },
                {
                    "user_id": "Andreea Elena Iordăchiță",
                    "user_href": "/profile/Andreea-Elena-Iordăchiță"
                },
                {
                    "user_id": "Adnan Yanık",
                    "user_href": "/profile/Adnan-Yanık"
                },
                {
                    "user_id": "John Knight",
                    "user_href": "/profile/John-Knight-19"
                },
                {
                    "user_id": "Mike Tisdale",
                    "user_href": "/profile/Mike-Tisdale"
                }
            ]
        },
        {
            "author_info": {
                "name": "Al Klein",
                "href": "/profile/Al-Klein"
            },
            "answer_text": "Not a thing. I never try to teach anything to a person who’s proved to be unteachable. (One doesn’t “believe in” science, one accepts the conclusion of a scientist, or one rejects it - for a valid reason. [And “the Bible says otherwise” isn’t a valid reason.]) ",
            "date": "Answered April 11, 2017",
            "views": "416",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Zeya Ahmed",
                    "user_href": "/profile/Zeya-Ahmed-1"
                },
                {
                    "user_id": "Victor Volkov",
                    "user_href": "/profile/Victor-Volkov-3"
                },
                {
                    "user_id": "Doug Delveau",
                    "user_href": "/profile/Doug-Delveau"
                },
                {
                    "user_id": "James Barton",
                    "user_href": "/profile/James-Barton-129"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Geare",
                "href": "/profile/John-Geare"
            },
            "answer_text": "I would say that I agree with him or her. I don’t believe in science, either. Nor do I believe in pickle forks or cuckoo clocks. These things, like science, simply exist. The pickle fork forks pickles; the cuckoo clock marks time with a cute birdie, and science gathers, tests, and organizes data in accordance with precise methods. For any of them, no belief required. Bravo! ",
            "date": "Answered April 11, 2017",
            "views": "436",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Laura Adkins",
                    "user_href": "/profile/Laura-Adkins-4"
                },
                {
                    "user_id": "Arny Diablo",
                    "user_href": "/profile/Arny-Diablo-1"
                },
                {
                    "user_id": "Alexander Wong",
                    "user_href": "/profile/Alexander-Wong-24"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mimi Mendoza",
                "href": "/profile/Mimi-Mendoza-3"
            },
            "answer_text": "Science is about ‘knowing’ it’s not in the business of ‘believing’. But that is besides the point. When a person doesn’t believe in something, accept it. Embrace them, as they are. Whatever a person believes or doesn’t believe, one thing is for sure, they will also believe they are right. There’s nothing to do about it. ",
            "date": "Answered April 11, 2017",
            "views": "123",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rany Saba",
                "href": "/profile/Rany-Saba"
            },
            "answer_text": "I would tell them that earth is flat and we actually live under a dome. Then I’d show them all the supporting evidence on YouTube using a computer which has the webcam and mic taped up. Then I’d convince them not to conceive any children and bring them into this fake world. Then I’d sleep happy and content, knowing I may have lent Darwin a hand. ",
            "date": "Answered April 11, 2017",
            "views": "388",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Fábio Martins",
                    "user_href": "/profile/Fábio-Martins-26"
                },
                {
                    "user_id": "Stuart Vealey",
                    "user_href": "/profile/Stuart-Vealey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Reuben Wilder",
                "href": "/profile/Reuben-Wilder"
            },
            "answer_text": "If they don't believe in science, then they could go live in a wattle and daub hut and not utilize any of the benefits of society that science has afforded the rest of us. No cellular phone No medicine No doctors No airplanes. No tv No nothing. They can live alone with their no-science-having-ass. ",
            "date": "Answered April 11, 2017",
            "views": "171",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Toni Bellamo",
                "href": "/profile/Toni-Bellamo"
            },
            "answer_text": "Please define what “belief in science” means. If they mean belief in “science as a religion” then they are quite right: it was not meant to be a religion, yet it is often used as such. If they say “science as a method is not working” then, depending on the context, they may or may not be right. Science has a broad, but limited, domain, inside of which it is king, outside of which it is irrelevant. ",
            "date": "Answered April 11, 2017",
            "views": "217",
            "upvotes": "0"
        }
    ]
}