{
    "title": "What is a scientific paper? - Quora",
    "tags": [
        "Scientific Papers",
        "Word Definitions, Terminology, and Jargon"
    ],
    "response": [
        {
            "author_info": {
                "name": "F. Hakan Koklu",
                "href": "/profile/F-Hakan-Koklu"
            },
            "answer_text": "First of all IEEE is not a journal, it is the society of electrical engineers. There is  no single IEEE journal. IEEE has numerous magazines and scientific journals (transactions, proceedings, etc.) spanning a wide variety of subjects. A scientific paper is generally a manuscript that presents an original work of research. It does not need to be ground-breaking. It could be an addition to the ongoing research in a field. It could be a comparative study between different approaches. It could be a presentation of a certain laboratory/fabrication technique. The papers can be original in different ways in different areas of research. Most of the time the scientific paper presents the research someone or a group of people have performed. However, there are review papers routinely published by the expert researchers in a certain area. These review papers summarize the developments in that area in recent years. The review papers are good to have around for new researchers and researchers usually find it easy to cite the review papers when they are writing a paper on that area. An idea is seldom sufficient for a paper. However, a rigorous theoretical analysis is valuable and routinely published in scientific journals. Having experimental data is always valuable for applied sciences. Obviously, this may not be the case for papers in theoretical physics, mathematics, etc. Classifying a paper to be worthy of publishing in a certain journal is not a trivial job. That is why we have editors and independent reviewers. Most IEEE journals are leading journals in their area and they require well conducted, original work for publication. One should follow the papers published in a certain journal and then it is not that hard to predict if a paper can be published in that journal. ",
            "date": "Answered July 29, 2011",
            "views": "21",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aditi Agarwal",
                    "user_href": "/profile/अदिति-अग्रवाल-Aditi-Agarwal"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Raw-Ki"
                },
                {
                    "user_id": "Yanchuan Sim",
                    "user_href": "/profile/Yanchuan-Sim"
                },
                {
                    "user_id": "Kaicheng Liang",
                    "user_href": "/profile/Kaicheng-Liang"
                },
                {
                    "user_id": "Megha Meda",
                    "user_href": "/profile/Megha-Meda"
                },
                {
                    "user_id": "Rohit Pujar",
                    "user_href": "/profile/Rohit-Pujar"
                },
                {
                    "user_id": "Laxmikanth Dorai",
                    "user_href": "/profile/Laxmikanth-Dorai"
                }
            ]
        }
    ]
}