{
    "title": "What will help to repair America's growing debt problem after 2020? - Quora",
    "tags": [
        "U.S. Public Debt",
        "Government Debt",
        "Debt",
        "The Economy of the United States of America",
        "2020 (year)",
        "Economics of Everyday Life",
        "Problem Solving",
        "Economics",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marc Hodak",
                "href": "/profile/Marc-Hodak"
            },
            "answer_text": "Nothing. Nothing can stop the growing debt problem faced by the U.S. or, for that matter, that of almost every other country in the world. Most people blame the debt problem on temporal issues like the COVID pandemic and the trillions that our politicians have shoveled out to help stem its economic effects. While that has perhaps worked, and will likely ebb post-pandemic (whenever that comes), our towering deficits will remain. Those deficits are built into our modern political system. They are a function of promises needed to propel progressive campaigns in our democracies, including promises of consumption support made decades ago, primarily for Social Security and Medicare. These two programs alone cost about three quarters of a trillion dollars per year, outspending everything else we think of as the federal government. So, tax the “rich,” right? I see a lot of that, including in the list of responses below. But even if our “rich” were forced to liquidate their holdings and hand it over to Congress, it wouldn’t be enough to pay for even several months of those programs, let alone for all the others envisioned by the far left in their unicorn plans. But those plans, and the need for their political opponents to at least somewhat keep up with those irresponsible promises, will prevent anything resembling the fiscal sanity needed to bring our deficits under control. Even they start to do so, it’s probably too late. The liabilities for our existing programs are greater than the total net worth of the United States, including every share of stock owned by every billionaire. For those of you not financially savvy enoughbto understand what that means, I will quote one of my favorite movie villains: “It means you’re broke. You just haven’t run out of cash.” And for the MMT loons who believe that the U.S. can simply print as much as it wants (or even better, just add zeroes to electronic accounts created out of thin air!), I have no answer except to say that magical thinking will not save us. The governments of our most liberal states, like California, New York, and Illinois, are all facing down the threat of bankruptcy. They are counting on the Federal government to bail them out. That’s why Nancy Pelosi is holding up massive additional aid against the effects of COVID. She wants to bail out her state. CNN and the NYT unsurprisingly seem to overlook any mention of that particular sticking point, but that’s all of the reason for the hold up. But to the extent the Democrats succeed in saving their states, and pushing for the same policies at the federal level that have gotten their states into so much trouble, they are simply hastening the day that the U.S. hits the same wall. Except no one can bail out the U.S., even if we were willing to sell our sovereignty to do so, which is what overly indebted nations have had to do in the past. And I don’t want to imply that Republicans can save us. Republicans in power have proven to be just as fiscally irresponsible, just with regards to other priorities, and at not as much of a breakneck pace (aside from the temporal problems they had to face, and with full support of the Democrats). The only consolation may be that it’s not just us. Every major country in the world has fallen into the debt trap. They have had to in order to compete. No one will be spared. Not the EU. Not Japan. Not China. “Europe makes universal health care work!” Europe is even more f*cked than our Democratic states. Your family may have that crazy uncle who spends profligately on himself and his family and friends, mindlessly blowing his credit card limits, then cashing in on his home equity to desperately make the payments. We all see the crash coming like a slow motion train wreck, and warn him of the impending doom if he doesn’t reform his spendthrift ways. And at some point, when he realizes it’s too far gone, he says, “what difference does it make at this point. Might as well enjoy myself while I can.” The day of reckoning always comes. I’m watching it now with my Uncle Sam. ",
            "date": "Answered October 21, 2020",
            "views": "98",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "John William Tisue",
                    "user_href": "/profile/John-William-Tisue"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Redman",
                "href": "/profile/Jeff-Redman"
            },
            "answer_text": "The Democrats will do it. AGAIN.I think the first time it happened was after the Panic of 1887 Clinton’s policies were on track to clean up the debt problem created by Reagan and Bush I, until Bush II returned what he called “a surplus” in what amounted to a bribe of taxpayers, cut taxes for “The 1%” (again) and started two elective wars “off-budget,” run the economy into the ground, destroyed tens of millions of US jobs, and ballooned the National Debt. Then Obama was elected and got the economy going and creating jobs again. That began reducing year on year deficits. The situation Obama inherited was so bad that he only able to reduce the rate at which the National Debt was increasing, but had the next President not cut taxes for “The 1%” AGAIN, chances are that the National Debt would have started to decline. Instead yet another Republican President has made another huge mess of the US Economy and has yet again ballooned the National Debt. As the Republicans continue to run up the National Debt by cutting the taxes of their political patrons, increasing military spending (for the further benefit of their political patrons), and making the majority of Americans poorer, each recovery is harder than the last. Perhaps the next Democratic administration will be able to stop the economic bleeding, but the American public is going to have to learn and accept that tax cuts have literally NEVER paid for themselves. That “The 1%” are not the “job creators.” And that keeping 50% of the US population too poor to pay taxes DESTROYS the US Economy and the American Dream.  PLEASE NOTE: I was asked to answer this question and I have answered it.I decline to debate my answer. If you disagree with my answer, be brave and post an answer of your own. Comments on this answer that are, in my opinion, counter-factual or disrespectful of anyone will be deleted without comment. Tally of comments so far deleted for being counter-factual or disrespectful - 0 ",
            "date": "Answered October 30, 2020",
            "views": "34",
            "upvotes": " Answer requested by Anthony Andranik Moumjian",
            "upvoters": [
                {
                    "user_id": "Sarah Stubblefield",
                    "user_href": "/profile/Sarah-Stubblefield-10"
                },
                {
                    "user_id": "Ralph Baker",
                    "user_href": "/profile/Ralph-Baker-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Richardson",
                "href": "/profile/John-Richardson-500"
            },
            "answer_text": " President Trump: Tariffs on foreign steel saves American Jobs. One thing remains consistent in this current economic environment: “America continues to spend more than it receives in revenues,” and this has been the case since 2016. [1] Add the Federal Government’s borrowing of more money to pay its bills to the equation, and we arrive at a situation where less capital is available for the private sector. [2] I’m no economist but if government does not collect more than it spends, it will be next to impossible to reduce the annual deficit. The Federal government never spends less than it collects. [3] Thus, cutting the purse strings of the Federal government would be another viable solution to decreasing the deficit. In 2015 the Federal government collected $3.5 trillion in taxes, 60% of which from income taxes, yet spent $3.69 trillion, creating a $439 billion deficit adding to the federal debt. [4] President Donald J Trump, though disliked by many, is a business man who is in tune with the economic atmosphere in America. His strategies thus far, has involved the renegotiation of several trade agreements that has the potential to reduce the U.S. deficit. In short, thanks to Democrat government, the U.S. deficit is a growing behemoth that can only be resolved by smart conservative government. In my opinion, Donald Trump has the solutions to resolve America’s growing debt problem beyond 2020. If only, people could look beyond the deceptive Democrat anti-American narrative that now seeks to weaponize the CCP virus as a political tool and support President Trump’s America First Agenda; voters would join forces at the ballot to combat the growing deficit by voting for 4 more years of President Donald J. Trump! Footnotes[1] The Budget and Economic Outlook: 2016 to 2026[2] Budget Deficits and Interest Rates: What Is the Link?[3] Historical Tables | The White House[4] How to Fix the United States' Debt Problems & Reduce Federal Deficits",
            "date": "Answered October 11, 2020",
            "views": "146",
            "upvotes": " Answer requested by Anthony Andranik Moumjian",
            "upvoters": [
                {
                    "user_id": "Jim Jaqua",
                    "user_href": "/profile/Jim-Jaqua-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Alexander",
                "href": "/profile/Bill-Alexander-31"
            },
            "answer_text": "What will help to repair America's growing debt problem after 2020? Bankruptcy comes to mind. Starting a few new wars around the world, especially the ones we owe money too. Elect a Democrat President, Senate and House of Representatives and pack the Supreme Court with 13 liberal Leftist Marxist Justices. Make Washington DC and Puerto Rico a State and add 4 new Senators all being Democrats. Do away with Electoral College so three or four states determine who the President should be. Adopt the Green New Deal add everyone to Medicare. Eliminate 170 million people from their employer based healthcare that unions worked years to get included in their bargaining contracts. Double Digit inflation like under Jimmy Carter also paid down national debt with devalued currency that wasn’t worth much more than funny money would do it. Turn on the Printing Presses and call it Quantitative Easing and print so much money that green stamps would have more value like Obama did. Don’t forget to have the Senate do away with Filibuster and making 60 Senators pass anything and reduce that to 51 after you add 2 new states and 4 Democrat Senators. If you can’t beat them at the polls, stuff the ballet boxes. The Simple answer is to elect all Democrats, do away with the two party system and turn America into a Third World Country and not pay any of the Debt back. In other words, destroy America, pay back trillions upon trillions in reparations to those we have wronged in the past and put everyone on Medicare, Food Stamps and UN-employment. That should do it. Let’s not forget to knock down a few statues of our founding fathers, burn down a few cities like Portland and Seattle. Don’t forget to defund the police so no one is safe in America, only the looters and rioters will have rights. Have the crime rate go into the stratosphere in predominately ran Democrat Cities like Detroit, Chicago, St. Louis and throw a few other cities in there for good measure. Don’t forget to take a knee every time you see the flag or a Military Hero in Uniform (might want to be careful with that one, they may send you into the Twilight Zone) and make sure you disrespect those who gave their life defending our Constitution, the American way of life and law abiding citizens. Make sure you take away free speech from our colleges and universities where only the left can say their point of view. Be sure only Marxist and Communist manifestos are taught in our universities. We wouldn’t want college graduates to graduate with free thinking ideas. Censorship should be the norm on all your cable networks like NBC, ABC, CBS, MSNBC, CNN and the press like the New York Times and the Washington Post. Don’t believe anything you read in the New York Post even though it was started by Alexander Hamilton. That about does it. Don’t forget to vote Democrat on all the down tickets so we can be sure to have this list in our everyday lives. Vote. Your country depends on it. ",
            "date": "Answered October 23, 2020",
            "views": "56",
            "upvotes": " Answer requested by Anthony Andranik Moumjian",
            "upvoters": [
                {
                    "user_id": "Joel Dykstra",
                    "user_href": "/profile/Joel-Dykstra-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Don Emerson",
                "href": "/profile/Don-Emerson-1"
            },
            "answer_text": "In order to repair America’s growing debt problem, it is first necessary to understand where that debt problem comes from. Basically, our government borrows these enormous amounts of money that make up our multi-trillion dollar national debt, to hide from the public, the liability of economic policies designed to benefit our small, wealthy class, at the expense of our Working Class. So for example, when we enact tax cuts for the rich in the idiotic expectation that doing so will cause economic expansion and job creation, the deficit those tax cuts create is borrowed. If the government didn’t borrow the money necessary to cover the deficit created by the tax cuts, the public would eventually understand that tax cuts for the rich not only don’t produce the promised economic expansion and job creation, they actually hurt the vast majority of our Working Class citizens who realize absolutely no benefit from the cuts. The same is true regarding the funding for our perpetual state of warfare. Unlike previous generations where, if the US was involved in a war, taxes were increased and the public was compelled to pay as we go for them, our current policy is to simply put the cost of our wars on the National credit card, and pay for them from the future earnings of our Working Class. The reason we do this is because if our citizens were taxed directly to pay for our wars, eventually the citizens would demand an end to them. So to repair America’s growing debt problem, we have to address the economic policies that are the cause of that enormous debt. Instead of borrowing to cover the deficits caused by tax cuts for the rich, we need to be honest with our citizens, by increasing taxes on those Working Class folks who do not benefit from the tax cuts. If the public understood that tax cuts in the present for the rich will be paid for in the future by the Working Class, we would put a stop to that policy right away. Same for our constant state of warfare. If our citizens were taxed directly to pay for the continued military involvement all over the world and especially in the Mideastern oil countries, we would put a stop to these conflicts. Almost all of our National Debt derives from tax cuts for the rich and expensive wars for control over the oil reserves in someone else’s country. Once we understand this, we would immediately stop financing tax cuts and wars by borrowing. And when we do that, we would realize that since the rich were the only beneficiaries of the tax cuts and the oil wars, they should pay for those obligations themselves, which would lead to significant increases in taxation of their accumulated wealth. That would solve the problem altogether. ",
            "date": "Answered October 15, 2020",
            "views": "106",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Leo McDevitt",
                    "user_href": "/profile/Leo-McDevitt"
                },
                {
                    "user_id": "Billy Nor",
                    "user_href": "/profile/Billy-Nor-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Johnson",
                "href": "/profile/Dave-Johnson-1132"
            },
            "answer_text": "Bringing back made in America, overcoming the tax and spend more excess liberals raising capital gains tax that has been hijacked since 1988. Fixing greedy health care, greedy administration of public schools, the admin not teachers fixing pension pigs issues. Deficit spend on what makes long term profit like the Eisenhower Freeway Systen did , California Aqua ducts did. I believe in cryo desalination of seawater on a MASSIVE scale. I WANT FORESTs watered, the Colorado river watershed filled , I want water where we have taken it from. I want reforestation and deserts to green , to sequester our Co2 and Methane. To make the planet more survivable . I want to turn back the Sahara desert. As stupid as all this may sound it was this big stuff we dared to do that made the nation greater. Things are so rigged now that unless we the people get off the petty differences distraction it's been over for middle class which sounds passe now. But without them there is only poor and only rich. So who will you be? Tax codes, bad laws and bad justice system , a declining public education system where geography isn't and an adult world where talent is only by purchased education. A meritocracy was part of fall of Greek power, Roman power and others. Were like that now . No second chance and growing prisoner population, growing dependant population. It won't work like it is in recent 50 years gotta get out of box. Radical good not violent , but perhaps the violent passion is needed to firmly lead ",
            "date": "Answered October 13, 2020",
            "views": "24",
            "upvotes": " Answer requested by Anthony Andranik Moumjian",
            "upvoters": [
                {
                    "user_id": "Ahamed Shafi Rupok",
                    "user_href": "/profile/Ahamed-Shafi-Rupok"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Balesteri",
                "href": "/profile/Chris-Balesteri"
            },
            "answer_text": "Stop the flipping spending! Okay, now breathe and act rationally. Hardcore choices have to be made if you clean it up in, say, 10 years. Cut spending across the board by 10% per year for the next 5 years. Yes, that means “free” programs like medicare, food stamps, military, federal employees, the works. Employ the population in the sectors that increase economic growth the most. Manufacturing and building (America’s strong suit!)… bridges, roads, ground/sea/air transportation, public buildings, and so on. Basic education on essential skills also falls in this category. Less of Lesbian Dance Theory, more of Electrical Engineering. Raise federal taxes. Ouch. Yes, sorry, it means all across the board. Be fair about it. I promise you the elected officials most likely will get voted out of office for even doing four years of this. But if the next officials stand their ground and continue on their predecessors efforts, it gets done. Just so you know, the US creditors are still confident that America will pay off its debt. As long as that confidence continues, so does the spending and ignoring the facts. ",
            "date": "Answered October 10, 2020",
            "views": "44",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Robin Hitchcock",
                    "user_href": "/profile/Robin-Hitchcock"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roger Burton",
                "href": "/profile/Roger-Burton-12"
            },
            "answer_text": "Firstly raise revenues. The first step to this is remove all of the tax loopholes that exist. Tax all net income no matter how earned at the same rates. Secondly cut spending. This means yes cut spending on defence. Part of the military is still organized as if the cold war is still going on. One has to seriously review the actual threats and reduce the number of bases. It also means stop with the ridiculously stupid idea that medicare and medicaid cant negotiate fixed prices with pharmaceutical companies. How merge medicare and medicaid and the va into 1 program. The government can also stop with subsidies to various industries like agriculture. They could also stop locking people up for non violent offenses. White collar criminals should be paying fines based on ability rather than be locked up. To degree role back the war on drugs, nobody should be prison for marijuana offenses. That's what they could do to reduce the deficit. What will they do however, is probably more aligned with a little cosmetics around the edges. ",
            "date": "Answered October 15, 2020",
            "views": "22",
            "upvotes": " Answer requested by Anthony Andranik Moumjian",
            "upvoters": [
                {
                    "user_id": "Gene Hennig",
                    "user_href": "/profile/Gene-Hennig-1"
                },
                {
                    "user_id": "David Bender",
                    "user_href": "/profile/David-Bender-72"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Keusgen",
                "href": "/profile/Peter-Keusgen"
            },
            "answer_text": "Print money and make massive cuts to Medicare, Medicaid, and Social Security. Whoever is president can’t make a difference. On one side you have tax and social spending democrats, and on the other you have cut tax and military spending republicans. Let’s just assume that nothing they do with tax will make much difference, given that it hasn’t in the past.  So the problem may be spending. In fact, for the government to balance the budget, it has to reduce spending by half and get down to the levels (as % of GDP) of the 1950s. But it can’t, because most of the government budget is mandatory spending (required by law) and are projected to grow to 17% of GDP by 2040.  So the only way will be to print money and make very unpopular cuts. Or, just do what they always do, and borrow more. That’s what I’m betting on. ",
            "date": "Answered October 16, 2020",
            "views": "86",
            "upvotes": " Answer requested by Anthony Andranik Moumjian",
            "upvoters": [
                {
                    "user_id": "John Campbell",
                    "user_href": "/profile/John-Campbell-1170"
                },
                {
                    "user_id": "Len Lampert",
                    "user_href": "/profile/Len-Lampert"
                }
            ]
        },
        {
            "author_info": {
                "name": "Willie Zhang",
                "href": "/profile/Willie-Zhang-6"
            },
            "answer_text": "The US needs universal healthcare to solve it’s debt problem. The US spends 18% of its GDP on healthcare. In 2019, that is approximately 3.8 trillion. Countries with universal healthcare spends approximately 10% of it’s GDP on healthcare. With that said, a lot of the 1 trillion in federal deficit is healthcare related via Medicare, Medicaid, VA and etc. Currently, Medicare is forbidden to negotiate down drug prices. With single payer, Medicare becomes the only buyer. With an economy of scale, the US can get the best deal for drugs and medical equipments. Also, single payer would reduce hundreds of billions of wasteful spending on administrative cost. In the short run, the US can save 700 billion on healthcare cost, that would tremendously reduce deficit spending. States would also be in much better fiscal conditions because Medicaid takes up a lot of states budget. ",
            "date": "Answered October 9, 2020",
            "views": "54",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Joe Black Sr.",
                "href": "/profile/Joe-Black-Sr"
            },
            "answer_text": "Cut spending! We have never had an income problem, we have a wasteful spending problem, and we should start with the federal government first. It’s three times as big as it needs to be. It’s involved in may areas it doesn’t belong, like Education, Healthcare and charity. Some spout the need to raise taxes to raise income, but historically, it’s never worked that way. Those same people have already got plans to SPEND twice what they raise, and always grow the Debt. History is where we should be looking, not at think tanks, actuarial models and hyperbole! They are always wrong, because people don’t respond like the models show. Remember what the Models said about Obama Care? Then the Prices skyrocketed. Make whatever excuse makes you feel good, but the facts are the price went up, the coverage went down, the care got worse and the only people that got help and liked it, were the ones that got it for free ",
            "date": "Answered October 30, 2020",
            "views": "20",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Tom McKenzie",
                "href": "/profile/Tom-McKenzie-26"
            },
            "answer_text": "Step 1 in my plan would be to cut the budget for the Department of Defense by 50%, across the board. We spent more than the next (depending on the source of the citation) 8–17 nations on Earth combined, all but one of which are our Allies. I think we could hack it in half and not have any significant degredation of our national defense or security postures. Step 2 would be to rewrite the tax code - taxing the ever-loving shit out of businesses that fail to invest in research, development and their employees (i.e., highly taxing capital gains and dividends, and encouraging economic growth through tax breaks geared toward increased employment and wage hikes), and reversing all the tax breaks we’ve given the rich dating back the past four decades. If we taxed in 2020 the way we did in 1955, we wouldn’t have an annual deficit approaching $3,800,000,000,000 - we’d have a surplus. And as the economy wasn’t exactly in a depression back then, it’s really hard to argue that returning to those tax rates would cripple our economy today… especially when thanks to a combination of COVID and Trump, it’s already on it’s ass. ",
            "date": "Answered October 10, 2020",
            "views": "47",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Jack Smith",
                "href": "/profile/Jack-Smith-1282"
            },
            "answer_text": "Typically when an American president is reelected the mood changes and spending decreases. Trump will no longer have to concern himself with another election and he may set his mind to a balanced budget. If this is the case, and if the economy allows it, spending cuts will become the theme for the next four years. While this may not be good for mid term elections Trump has little allegiance to the Republican party and absolutely none to the Democrats. It could be painful and it will be up to private industry to take up the slack of a smaller government. If Joe Biden becomes our next president the spending will continue in earnest and our credit rating will either be damaged beyond repair or taxes will be raised exponentially. Biden has already promised to raise taxes “on day one\" which might help the deficit unless his spending is more than his tax increases. But regardless of who becomes the next president it's likely the national debt will have to be addressed in the next four years. If not inflation and interest rates will quickly go into hyper mode. ",
            "date": "Answered October 9, 2020",
            "views": "44",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Sherri Hawn",
                "href": "/profile/Sherri-Hawn"
            },
            "answer_text": "First; follow all the recommendations of the first-ever Audit of the Pentagon—totally ignored—to save $1.5 Billion/year Second, cancel the tank orders. Third, outside audit the Dept of Defense contractors and audit the sprawling, hidden Department of Homeland Security. Stop giving Israel $3.8 Billion per year to purchase US made military equipment. stop or cancel half the military hardware development projects designed to fight two wars ago. Notice a pattern in that list? There’s lots of billions in the Black Hole of defense. Then: Follow the recommendations of Simpson-Bowles on eliminating the over $2 Billion/year in tax give-always and loopholes. Stop corporate subsidies, especially to extraction industries, and end special tax breaks for property developers. Return to the pre-2017 progressive income tax levels, and raise the corporate tax from 20% to 27%, eliminating pass-through and carried capital gain low rates. It’s a good start ",
            "date": "Answered October 29, 2020",
            "views": "95",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Garrett D. Van Horn",
                "href": "/profile/Garrett-D-Van-Horn"
            },
            "answer_text": "There will be a continued and more substantial Debt Problem under a Biden/Harris administration. Biden has offered NO answers as to how he is going to pay for his socialist agenda. The spending requirement of Socialism will make our existing Debt service look like a drop in a bucket. There is absolutely NO fiscal responsibility in the Democrat platform. The platform is so loaded in debt that they are too embarrassed to talk about It much less Present an idea on how to deal with it. It appears that the Dems are willing to drive us into bankruptcy to meet their goals. They have said that they will tax the rich and raise sales and property taxes. With all that.. we will still not be able to afford their Socialist programs. Their latest promise is that taxes will not be raised on people that make less than $400k Per year. We all know, and so do the Democrats, that This claim is a blatant lie. The Democrats will want to raise taxes across the Country. I don’t understand their strategy or maybe I should say lack of strategy. Without a plan, They are relying on the hate for Trump to get Biden elected. ",
            "date": "Answered October 15, 2020",
            "views": "16",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Ronald Kovacs",
                "href": "/profile/Ronald-Kovacs-1"
            },
            "answer_text": "Absolutely nothing. The USA like many other countries spends more money each year than it collects in taxes. Period. None of these countries has the legislative backbone to seriously look at spending and determine what should be cut or eliminated. Too many politicians gain power by spending and promising benefits to the masses. These benefits become entitlements, and many could not survive without them. People will continue to vote for those who continue provide more and more entitlements. It is a vicious circle. anybody who attempts to reduce this spending is automatically demonized in the popular press as starving babies, making people die in the streets, or kicking pensioners out of their homes, or cutting education, daycare or whatever.\\ It will never happen, nor will taxes be increased to cover the spending. ",
            "date": "Answered October 31, 2020",
            "views": "7",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Roger Lignugaris",
                "href": "/profile/Roger-Lignugaris"
            },
            "answer_text": "That ship has sailed, and won’t ever be turned around. All we can do is grow the real GDP enough so that the existing and future debt is a lower percentage of that new, larger, GDP. The US has to abandon old, low impact industries like manufacturing, and invest in new sources of energy, high tech, and innovation yet undreamed of. Just as we moved from agriculture to manufacturing, now it’s time to take the next step, from manufacturing to energy independent of fossil sources altogether. To a data and information driven society. It’s not 1950 anymore. Thankfully. I was there, and it was a grind. we need to stop looking backward, trying to ‘bring back jobs’ that no longer are relevant to the economy we need to embrace. Those jobs are where they need to be, now. We don’t want to go backward, not now, not ever. That’s not the future. Debt isn’t a problem. Too low real GDP is the problem. And we don’t solve that problem by returning to agriculture, ala 1850, or production, as in 1950. Data and high tech, high productivity clean energy will define 2050. ",
            "date": "Answered October 14, 2020",
            "views": "20",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bob MacKenzie",
                "href": "/profile/Bob-MacKenzie-4"
            },
            "answer_text": "There is a possibility, as I see it at least, that the US has set itself up to reset their economy with one simple maneuver. When the government needs money they borrow it in federal reserve notes from the federal reserve bank. The federal reserve bank sells that debt to domestic and international investors. All of that accumulated debt in federal reserves notes is now held by a multitude of investors. If the federal reserve bank goes bankrupt the debt disappears, the investors lose their money and the US government can start over with a new currency. Anyone holding federal reserve notes can exchange them for the new US notes at a determined rate of exchange. ",
            "date": "Answered October 27, 2020",
            "views": "25",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "David Grider",
                "href": "/profile/David-Grider-19"
            },
            "answer_text": "They need to eliminate the federal income tax and replace it with import tariffs and state funding. The Federal budget needs to be paid by the states based on their electoral count. The federal government will continue to grow until the purse strings are unter the control of state legislatures. This was the same debate that occured when they created the federal income tax. What has occured was exactly what was warned about many decade ago when the created the income tax. America would be a very different place today had they not made that monumental mistake. ",
            "date": "Answered October 16, 2020",
            "views": "18",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Martin Michaels",
                "href": "/profile/Martin-Michaels"
            },
            "answer_text": "Two things: Eliminate the Federal Reserve System (The worst scam ever perpetrated on the world - AFTER Barrack Obama, of course.) This can easily be done by negating the “lease” on the right to print money by the FRS in favor of doing it ourselves, that is the Federal Government. This would eliminate the “vig” the Federal Government (that is, WE) pay, or rather OWE, the FRS for printing OUR money. That “vig” (interest) IS LITERALLY the main cause of the National Debt.Return to the Gold Standard.",
            "date": "Answered October 30, 2020",
            "views": "12",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Robert Russell",
                "href": "/profile/Robert-Russell-116"
            },
            "answer_text": "It would be a combination of tapering back spending in some areas, and also raising taxes. Top marginal personal income tax rates need to go to at least 70% (where they were prior to trickle-down economics). Many tax loopholes also need to be closed to keep America from bleeding much-needed cash to tax avoidance and tax evasion. It’s estimated that the IRS loses $100 billion per year in tax evasion alone. A lot more is lost to fully legal tax avoidance methods (which legislators conveniently turn a blind eye to). ",
            "date": "Answered October 29, 2020",
            "views": "46",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "James VanDenBerg",
                "href": "/profile/James-VanDenBerg-6"
            },
            "answer_text": "Nominal GDP growth is the only way (other than default). This can happen via higher real growth from increases in population, work hours, and productivity. It can also happen from inflation. A combination of high real GDP growth and high inflation would skyrocket nominal GDP and quickly make the debt manageable. The overall amount of debt doesn't matter at all. We collect more in taxes each year now than the entire national debt was 20 years ago. What matters is the debt compared to the economy. ",
            "date": "Answered October 17, 2020",
            "views": "27",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Joseph Taylor",
                "href": "/profile/Joseph-Taylor-292"
            },
            "answer_text": "Nothing. IMHO debt will continue to grow until the interest expense starts to impact federal spending. At that point the disciples of Modern Monetary Theory will convince the Fed. Govt. to force the Federal Reserve to redeem the debt using fiat money. Or, perhaps they’ll use some other mechanism that I can’t imagine. To actually repair the growing debt problem would require either reduced spending or additional taxes. Neither of which will happen. ",
            "date": "Answered October 11, 2020",
            "views": "26",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Charles Henry",
                "href": "/profile/Charles-Henry-98"
            },
            "answer_text": "More money will be created and the debt will be paid off with cheaper dollars. Every government has done this throughout history. Debts are incurred, often to fight wars, and as the debt comes due the govenment makes new dollars, francs, marks or whatever to pay off the old debt. The bond holders think that they are collecting interest, and they are in nominal terms, but the value of the bonds and the accululated interest will have less buying power than the cash they lent (By buying the gov. bonds) in the beginning. The wise investor stays clear of government bonds when debt is rising. ",
            "date": "Answered October 20, 2020",
            "views": "20",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Daren Kegley",
                "href": "/profile/Daren-Kegley-1"
            },
            "answer_text": "This would probably be an unpopular answer, but I’m going to say raising interest rates. Like really raising them. Noticeably. Super low interest rates encourages people to spend. It actually incentivizes getting into debt, and discourages saving. High interest rates would encourage people to save rather than to spend more money than they have. At least they would be able to actually see real interest accruing on their savings. ",
            "date": "Answered October 19, 2020",
            "views": "18",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Clark Wilkins",
                "href": "/profile/Clark-Wilkins-3"
            },
            "answer_text": "Increasing corporate tax rates to between 25–27% and eliminating the permanent tax cuts for the rich. This won’t balance the budget but help. Basically, the Republican tax cut was a disaster as the CBO reported day one. That bill becomes the starting point to create Trump’s deficit and it becomes the starting point now to fix the deficit. ",
            "date": "Answered October 12, 2020",
            "views": "67",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Martin Brilliant",
                "href": "/profile/John-Smith-46456"
            },
            "answer_text": "Taxes. Obviously. Inflation. It reduces the real value of the debt. Diplomacy. “War is the continuation of diplomacy by other means,” but it’s the most expensive means. Rebuild America’s manufacturing capability. It will create more wealth, and wealth is the source of taxes. What will help to repair America's growing debt problem after 2020? ",
            "date": "Answered October 29, 2020",
            "views": "40",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "John Heagerty",
                "href": "/profile/John-Heagerty-1"
            },
            "answer_text": "Major reduction in military expenditures. The US currently spends 40% of all military-related funds in the world; 3.8 times the second-largest spending country, China. With an arsenal able to kill everyone on the planet, the reductions must begin ASAP after Nov. 3rd when there will be a new president, administration, and leadership in both houses of Congress. ",
            "date": "Answered October 14, 2020",
            "views": "19",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Bradly Miner",
                "href": "/profile/Bradly-Miner"
            },
            "answer_text": "Oh I don’t know…….maybe treat this bullshit “crisis” pandemic like what it is, and get this country opened up, and back to setting records for employment in EVERY sector! That’s just one thing (there are plenty more) and they were all in play before this latest attempt (by the socialists) to ruin America. Trump 2020!!! ",
            "date": "Answered October 21, 2020",
            "views": "24",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "William Reinhart",
                "href": "/profile/William-Reinhart-2"
            },
            "answer_text": "Quit spending money and start saving.Reduce or eliminate relying on social programs to provide income and services.Gradually increase the rate of Fed lending money at 0.01 % interest.Restrict credit card ownership and credit limit.Have a serious talk about money management in our educational systems and prohibit large limit cards for those under 28.Eliminate college loads that the colleges have NO RESPONSIBILITY in paying back - these loans BS when it comes top truth in lending! ",
            "date": "Answered October 10, 2020",
            "views": "18",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "John Doyle",
                "href": "/profile/John-Doyle-124"
            },
            "answer_text": "Of all the countries in the world, the USA is the only one with no problems about debt -not including personal and corporate debts, just government debt. Debts in US dollars are assets for the nation. Any dollar sums can be monetised by writing a check for it. The USA cannot run out of dollars, unlike every one else. They take in imports etc and give them numbers in accounts. They can do that basically forever. Who gains most would you say? ",
            "date": "Answered October 10, 2020",
            "views": "23",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Marvin Johnson",
                "href": "/profile/Marvin-Johnson-257"
            },
            "answer_text": "According to some trade specialists, they suggest that the deficit problem can be resolved as the economy improves because revenues through taxes naturally increase as incomes rise through stronger growth. Also, a change in the taxation system could be of great use as U.S. citizens living outside the country can exclude $200,000 from taxation, even if they pay no taxes to the country in which they live. ",
            "date": "Answered October 22, 2020",
            "views": "10",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jack Garbuz",
                "href": "/profile/Jack-Garbuz"
            },
            "answer_text": "Well, if Trump is reelected, jobs, jobs, jobs; work, work, work. However if Biden is elected, he’ll probably get loans from his Chinese buddies and tell us all what great guys they are, helping out like that. After they sent out the virus that destroyed 20% of the world economy. No shame. ",
            "date": "Answered October 29, 2020",
            "views": "19",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Deneece Butler",
                "href": "/profile/Deneece-Butler"
            },
            "answer_text": "Three things: Higher employment and the taxes derived therefrom.Reduction of the shameful waste, fraud and abuse in the bureaus.Negotiating lesser principal payments to China.",
            "date": "Answered October 12, 2020",
            "views": "8",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Alan Tufft",
                "href": "/profile/Alan-Tufft"
            },
            "answer_text": "USA doesn’t really have a debt problem that Federal Reserve can’t manage. However, a reversal of Trump tax breaks for those earning more than $500k per year income would certainly help. These wealthy people don’t really need big tax breaks. ",
            "date": "Answered October 11, 2020",
            "views": "18",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "James Bonander",
                "href": "/profile/James-Bonander"
            },
            "answer_text": "controls on spending, A war on Waste, and some seriously impressive leadership to make changes. A few Economists at NYU estimate that Racism and Discrimination cost the USA 16 Trillion USD a year in lost opportunity. If that is true, We could make the country roar back just by creating a fair and equitable society. ",
            "date": "Answered October 26, 2020",
            "views": "32",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Syed Hasan",
                "href": "/profile/Syed-Hasan-157"
            },
            "answer_text": "Tax and spend. Introduce a progressive tax system and tax more to those with the broadest shoulders and earn millions of Dollars($) a year. Spend on large capital projects which will achieve full employment and which it will increase economic growth.  ",
            "date": "Answered October 30, 2020",
            "views": "18",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Lynne Noll",
                "href": "/profile/Lynne-Noll"
            },
            "answer_text": "Having the country go back to work. That will increase government revenue, and, once the recession ends, the government can safely raise taxes. Obviously, the virus needs to be controlled to enable that. Meanwhile, the government should pull back somewhat militarily, and concentrate on other kinds of threats. ",
            "date": "Answered October 9, 2020",
            "views": "33",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Mike Nolan",
                "href": "/profile/Mike-Nolan-82"
            },
            "answer_text": "Elect a Democratic president. Republicans become very concerned about the national debt when a Democrat is president. Democratic presidents have been more successful at reducing deficits than Republican presidents. ",
            "date": "Answered October 20, 2020",
            "views": "10",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Carl Wimmer",
                "href": "/profile/Carl-Wimmer-1"
            },
            "answer_text": "Stop borrowing more money. That stops the problem. Then .. cut spending and repay the debt. That fixes the problem. Of course, no one will do this, so we are looking at some repudiation, liquidation, debt jubilee. That is the only real solution that there is. ",
            "date": "Answered October 30, 2020",
            "views": "15",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Richard Rothwell",
                "href": "/profile/Richard-Rothwell-2"
            },
            "answer_text": "Your question assumes that an imbalance of money payments between nations can be termed debts. Certainly your Government uses the term Debt, but is it really a debt or is it an imbalance? Will it be paid back? Does it affect a countries credit standing and if it does, does it matter. Based on past experiences, the question is non sequitur. ",
            "date": "Answered October 22, 2020",
            "views": "20",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "David Green",
                "href": "/profile/David-Green-327"
            },
            "answer_text": "Simply put there are two ways out of thjis huge debt. We can increase taxes and possibly cut services. Or we can inflate our way out of it. The latter course of action would be monumentally stupid, but we are Americans, so we love stupid. ",
            "date": "Answered October 20, 2020",
            "views": "12",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Kevin Burke",
                "href": "/profile/Kevin-Burke-93"
            },
            "answer_text": "Closing loopholes in the tax code and repealing the tax cuts of the Trump tax cut bill for the corporations and the individuals making over 400K as Biden plans. The bills need to be paid, that is the reality. ",
            "date": "Answered October 18, 2020",
            "views": "14",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Richard Naumann",
                "href": "/profile/Richard-Naumann"
            },
            "answer_text": "Hopefully with more debt, but this time targeted to make investments in infrastructure, research and business development to grow the economy rather than the last bump used for stock buy back programs and tax cuts for high income reporters. ",
            "date": "Answered October 23, 2020",
            "views": "13",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Ty Albright",
                "href": "/profile/Ty-Albright-3"
            },
            "answer_text": "By keeping interest rates artificially low and printing money you can create inflation and repay old debt with less valuable new money. Good solution for people in debt, bad for responsible people who save money. ",
            "date": "Answered October 30, 2020",
            "views": "13",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Richard Black",
                "href": "/profile/Richard-Black-83"
            },
            "answer_text": "History holds few success stories for nations where national debt exceeds 100% of GDP. Those with unfortunate outcomes usually ether are crippled by outrageous tax increases (triggering unemployment), or hyperinflation, or both. Venezuela is a current example. ",
            "date": "Answered October 10, 2020",
            "views": "9",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Justin Hoskins",
                "href": "/profile/Justin-Hoskins-2"
            },
            "answer_text": "Gut welfare programs reduce the federal side of spending, fbi, cia nsa and so on. reduce how many troops are in the active force and give them better training and fear. this is only the beginning. ",
            "date": "Answered October 24, 2020",
            "views": "35",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Mike Carter",
                "href": "/profile/Mike-Carter-157"
            },
            "answer_text": "A balanced budget amendment. ",
            "date": "Answered October 9, 2020",
            "views": "22",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Norman Simenson",
                "href": "/profile/Norman-Simenson-1"
            },
            "answer_text": "Repealing those obscene tax breaks for those billionaires! See U.S. billionaires got $845 billion richer since the start of the pandemic ",
            "date": "Answered October 9, 2020",
            "views": "33",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Jeff Kramer",
                "href": "/profile/Jeff-Kramer-59"
            },
            "answer_text": "Biden being elected because suddenly the Republicans will make it an issue that the Democrats will have to fix after ignoring it for four years under Trump. ",
            "date": "Answered October 27, 2020",
            "views": "15",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Emm Butler",
                "href": "/profile/Emm-Butler"
            },
            "answer_text": "Democrats, as always. Republicans run it up and then dems clean it up and pay the price. It will take decades, decades to clean up trumps mess. ",
            "date": "Answered October 13, 2020",
            "views": "8",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Stan Simkins",
                "href": "/profile/Stan-Simkins"
            },
            "answer_text": "A simple answer might be to get more people back to work paying into the system and reduce entitlements where people are receiving goods and services provided by the government at no charge. ",
            "date": "Answered October 29, 2020",
            "views": "14",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Michele Nicholas",
                "href": "/profile/Michele-Nicholas-4"
            },
            "answer_text": "I expect it will be the usual pattern: The Democrats will have to raise taxes to reduce the enormous debt the Republicans have amassed. ",
            "date": "Answered October 24, 2020",
            "views": "10",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Robert Carr",
                "href": "/profile/Robert-Carr-63"
            },
            "answer_text": "Growth, reformed tax policy (more rate cuts to increase revenues) get a handle on this massive spending spree!!! It's ‘ALWAYS' a spending problem not a tax problem! ",
            "date": "Answered October 29, 2020",
            "views": "6",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Shea Cooney",
                "href": "/profile/Shea-Cooney-1"
            },
            "answer_text": "Putting people back to work, reducing government red tape,bring back manufacturing and sound fiscal policy of eliminating debt and making the dollar strong again. ",
            "date": "Answered October 21, 2020",
            "views": "13",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Christie Fox",
                "href": "/profile/Christie-Fox-2"
            },
            "answer_text": "after President Trump’s re-election we can begin to get things back to where they were before the pandemic. ",
            "date": "Answered October 10, 2020",
            "views": "18",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "David Martinez",
                "href": "/profile/David-Martinez-1762"
            },
            "answer_text": "Continued growth and/ or fiscal austerity, hopefully not on a scale like Greece, but you get the picture. Or, alternatively, a world war and/ or a new order and new system of economics. Time will tell. ",
            "date": "Answered October 16, 2020",
            "views": "12",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "David Blades",
                "href": "/profile/David-Blades-5"
            },
            "answer_text": "Repair it really. It’s a catastrophe. I don’t see any way out of it. I believe we will see it like “The fall of Rome” ",
            "date": "Answered October 10, 2020",
            "views": "8",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "Bogi Indriðason",
                "href": "/profile/Bogi-Indriðason"
            },
            "answer_text": "Nothing! You will have to pay it back and you can. Just do not squander so much on the military ",
            "date": "Answered October 15, 2020",
            "views": "8",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        },
        {
            "author_info": {
                "name": "David Brower",
                "href": "/profile/David-Brower"
            },
            "answer_text": "Economic growth, less easy tax avoidance, and some higher tax rates, in that order. No more “carried interest” ",
            "date": "Answered October 18, 2020",
            "views": "19",
            "upvotes": " Answer requested by Anthony Andranik Moumjian"
        }
    ]
}