{
    "title": "What would the world be like if all fossil fuels disappeared immediately? - Quora",
    "tags": [
        "Fossil Fuels",
        "Fossils",
        "Fuels"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jason Owen",
                "href": "/profile/Jason-Owen-38"
            },
            "answer_text": "Everything would grind to a halt. The obvious things which would go like cars, trucks, planes, trains, etc. However, also which would go would be our electricity. In the United States alone Gas (which is mostly a fossil fuel) accounts for 34% of the total electrical grid and Oil accounts for 0.5%. Coal (which is a fossil fuel as well) accounts for 30%. Therefor if fossil fuels were to somehow just suddenly vanish over 60% of the United States electrical output would also just stop. The electrical grid would collapse as the other sources would not be able to compensate. So mass blackouts and no transportation means industry and business shuts down. Mega farms cannot harvest, plant, or treat crop. Grocery stores have about a five day supply of food which would be picked over in a hurry. Just look at stores before a hurricane and you can see how quickly people can empty entire stores. People would be stranded. Imagine if you are a doctor at home when this occurs. However, your hospital, is over 30 miles away. How many people would be walking to work? Not many. Same with the military. As society decays security forces are not able to mobilize fast enough to deal with the situation. Even nuclear powered ships still rely on oil to lubricate joints and other equipment so those too would quickly become inoperable. Petroleum and the various byproducts are critical in plastics, heavy industry, clothing and even pharmaceuticals. All of which would stop. Even if some plant somewhere ran on wind power… how would they transport their goods? How would workers even get to the factory? How would they feed their workers? Their families? How would they get raw materials to feed their plant? They wouldn’t; it would shut down. This shows that even the small pockets which have wind, solar and hydro power would not be immune. Without transportation and access to raw materials made by heavy industry that depends on fossil fuels they too would shut down. We would be instantly cast back to a pre-industrial state. However the change would be so sudden many would die of illness, injury, starvation, lack of shelter, etc. How many people own a horse and saddle; never mind even know how to saddle a horse. How many people know how to garden to the degree they can support a family solely on their garden? How many even have access to enough seeds to plant various crops? How would you water your mega garden without running water? Those who were “lucky” enough to have solar power would quickly be overwhelmed by hoards of people. I imagine groups of jealous people may even seek to destroy the few solar and wind equipment which exists. Even if these few people somehow manage to escape the jealous hoards, without supplies being replenished even those people would quickly run out of food and drinkable water. If they get seriously sick or injured which requires expert medical treatment where would they go? How would they even get there? and if they got to a hospital would any one even be there? Sources: Mapping how the United States generates its electricity https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3154246 ",
            "date": "Answered February 7, 2018",
            "views": "871",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jazzy Love",
                    "user_href": "/profile/Jazzy-Love-25"
                },
                {
                    "user_id": "John Goetz",
                    "user_href": "/profile/John-Goetz-15"
                },
                {
                    "user_id": "Cathy Garrett",
                    "user_href": "/profile/Cathy-Garrett-7"
                },
                {
                    "user_id": "Seiji Miyoshi",
                    "user_href": "/profile/Seiji-Miyoshi"
                },
                {
                    "user_id": "Jonathon Askins",
                    "user_href": "/profile/Jonathon-Askins"
                },
                {
                    "user_id": "Israel Ramirez",
                    "user_href": "/profile/Israel-Ramirez"
                },
                {
                    "user_id": "Linda Cat Brown",
                    "user_href": "/profile/Linda-Cat-Brown"
                },
                {
                    "user_id": "Yatharth Singh",
                    "user_href": "/profile/Yatharth-Singh-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Goffin",
                "href": "/profile/Paul-Goffin"
            },
            "answer_text": "Everybody Dies. Global economics and living standards are predicated on the availibility of fossil fuels. If we instantly lost access to them, millions would die within weeks due to loss of food, water and sanitation and everyone else would be killed in the wars that would be fought to secure access to forrests. Now, if instead, we had 20 years notice fuels would become unavailable, we could switch to 100% renewables. Or, we could elect denialists like Trump. ",
            "date": "Answered February 7, 2018",
            "views": "202",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Justin Christopher Pursley",
                    "user_href": "/profile/Justin-Christopher-Pursley"
                }
            ]
        }
    ]
}