{
    "title": "What is the greatest invention to never be made? - Quora",
    "tags": [
        "Innovation",
        "Invention and Inventions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Peracchio",
                "href": "/profile/Tom-Peracchio"
            },
            "answer_text": "There are people on Quora who hate people like me who often quote the question at the beginning of the answer. This question is a good example where I think it is often necessary state the question first, as merges and changes to the question can alter the context of the answer. I am answering, \"What is the greatest invention to never be made?\" When I first looked at the question, I thought, if it was never made, it wasn't an invention, it was simply an unproven theory. Many of the answers here, especially by the Tesla fans, talk about ideas that never produced a working prototype. But then I see others here have answered \"What are some amazing inventions that never made it to production?\" Ah, that is a different question, (and why I hate the merge and un-merge wars here on Quora.) That perspective would suggest that there was a fully functional working prototype that was never mass produced. Defining an invention is a rhetorical question. Does the first person to theorize the concept on paper get credit for the invention? Is it the first person to build a working prototype really the person who invented it? Is it the person who got credit for the concept at the US Patent office really the owner of the invention? Is it the person who first commercially marketed the product really the one who gets credit for the invention? There are visionaries who have an idea and see what is possible, often before the technology exists to make it real. There are inventors who take visions and made them real by proving the concepts in laboratory or creating the prototype. There are innovators who take a good invention and make it great. There are the industrialists who take an invention and develop it into an industry. Thoughts here based on my ongoing battle to define inventions: Explore who invented the internet and origins of all things geek ",
            "date": "Answered August 9, 2019",
            "views": "977",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alessio Speranzini",
                    "user_href": "/profile/Alessio-Speranzini"
                },
                {
                    "user_id": "James Barton",
                    "user_href": "/profile/James-Barton-129"
                },
                {
                    "user_id": "James Burton",
                    "user_href": "/profile/James-Burton-35"
                },
                {
                    "user_id": "Destin Scott",
                    "user_href": "/profile/Destin-Scott"
                },
                {
                    "user_id": "Orlando Barrios",
                    "user_href": "/profile/Orlando-Barrios"
                },
                {
                    "user_id": "Clayton Jay Hardy",
                    "user_href": "/profile/Clayton-Jay-Hardy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fauzan Fahad",
                "href": "/profile/Fauzan-Fahad"
            },
            "answer_text": "Nikola Tesla is one of history’s great inventors and his work has captured the imaginations of the generations who’ve come after him, living in the world he helped build. As the Holderof more than 270 patents in 27 countries—including 112 in the US alone—Tesla rightfully earned his place in history, but not every invention of Tesla made it to production. With that in mind, we combed through the records and found 7 of Tesla’s most substantial inventions that never got built. Wireless Energy Transmission  As someone almost completely associated with electricity, it shouldn’t be surprising that many of Tesla’s patents are in the field of electrical generation and transmission. We have Tesla to thank after all for Alternating Current (AC), which has been used to wire much of the world with electrical power. What a lot of people don’t know is that Tesla also tried to build a tower that would transmit electricity through the air and even got American Financier J.P. Morgan to finance the building of Wardenclyffe Tower on the North Shore of Long Island, which Tesla hoped to adapt to transmit electricity to New York City. Morgan balked at the electricity transmission scheme and refused to fund the rest of the project, which Tesla had to abandon in 1906, tearing down Wardenclyffe Tower a decade later in 1917. Supersonic Airships Powered by Ground-Based, Wireless Electrical Towers  When wireless charging of your phone or tablet was introduced several years ago, we all thought it was revolutionary. Nikola Tesla, meanwhile, would chide us all for thinking so small. SPONSORED VIDEO In 1919, Tesla described his idea for a supersonic airship powered entirely by wireless electrical transmission from ground-based towers that could fly 40,000 feet off the ground and fly 1,000 mph, making the trip from New York to London in under 4 hours. Remote Controlled Navies  While Tesla is best known for his work with electricity, this isn’t the only area Tesla worked in. Another major area of work for Tesla was military technology. Like Alfred Noble, Tesla believed that the best way to prevent war was to make it either utterly pointless or so catastrophic for the participants that no one would be mad enough to go to war again. With this in mind, Tesla invented a small boat that he could start, stop, and steer with radio signals. He hoped that the by removing humans from the equation that “battle ships [sic] will cease to be built and the most tremendous artillery afloat will be of no more use than so much scrap iron.” The Thought Camera  One of Tesla’s most outlandish ideas was that it would be possible to photograph one's thoughts. In 1933, he told reporters at the Kansas City Journal-Post, “In 1893, while engaged in certain investigations, I became convinced that a definite image formed in thought, must by reflex action, produce a corresponding image on the retina, which might be read by a suitable apparatus. “Now if it be true that a thought reflects an image on the retina, it is a mere question of illuminating the same property and taking photographs, and then using the ordinary methods which are available to project the image on a screen. “If this can be done successfully, then the objects imagined by a person would be clearly reflected on the screen as they are formed, and in this way, every thought of the individual could be read. Our minds would then, indeed, be like open books.” Obviously, this is not how thought processes work, but there is so much we don’t know about the biological mechanism of human thought and consciousness that we cannot say for certain that Tesla wasn’t on to something. While the mechanisms employed are different, who's to say what technology will be able to produce in the next 50 years? The Earthquake Machine  In 1893, Tesla was granted a patent for his steam-powered mechanical oscillator whose vibration could be utilized to generate electricity. As he would later tell reporters, while calibrating this machine for an experiment, it began to shake his New York City laboratory so violently that it almost brought the building down. “Suddenly all the heavy machinery in the place was flying around. I grabbed a hammer and broke the machine,” he said. “The building would have been down about our ears in another few minutes.” “Outside in the street there was pandemonium. The police and ambulances arrived. I told my assistants to say nothing. We told the police it must have been an earthquake. That's all they ever knew about it.” This gave Tesla the inspiration for his telegeodynamic ocillator—an earthquake machine—which could be used by scientists to discover the geological properties of the Earth and for engineers and prospectors to locate mineral and metal ore deposits underground. He never got to build his earthquake machine, but scientists and engineers use the same principle to do exactly as Tesla imagined. Artificial Tidal Waves Over the course of his life, Tesla conceived of weapons of such destructive magnitude that they would rival the atom bomb in their devastating power—had they worked. One such weapon was the Artificial tidal wave, which he believed would be the ultimate defense against enemy navies. Tesla’s hope was to make the largest battleship any nation could produce useless, so countries would not bother to build navies. To do this, Tesla envisioned “telautomatons” that would pilot several tons of high-explosive material near an enemy navy and detonate it. The collapsing gas bubble produced by the explosion, Tesla calculated, should produce tidal waves that even a mile away from the initial blast would be nearly 100 feet high, enough to sweep away the largest dreadnoughts of the era. Tidal waves don’t quite work that way however, as the United States and Soviet Union learned when they performed underwater nuclear bomb testing in the 1940s and 1950s. The Death Ray  Or the Peace Ray, as Tesla called it. Tesla beleived that by accelerating mercury isotopes to 48 times the speed of sound, the resulting beam would produce enough energy to destroy entire armies at a distance limited only by the curvature of the Earth. Tesla apparently tried to shop this idea around to several governments in the years before his death, including the United States, but the Soviet Union was the only one to experiment with it at all, and it never produced the kind of results Tesla hoped. Hope you liked it !!Thanks for Scrolling and reading. “Have a nice day. CREDIT-FAUZAN FAHAD ",
            "date": "Answered August 2, 2019",
            "views": "15",
            "upvotes": " View 18 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nikhil Wankhede",
                    "user_href": "/profile/Nikhil-Wankhede-27"
                },
                {
                    "user_id": "Alia Radzi",
                    "user_href": "/profile/Alia-Radzi"
                },
                {
                    "user_id": "John Bankson",
                    "user_href": "/profile/John-Bankson-2"
                },
                {
                    "user_id": "Saurav Saha",
                    "user_href": "/profile/Saurav-Saha-58"
                },
                {
                    "user_id": "Alessio Speranzini",
                    "user_href": "/profile/Alessio-Speranzini"
                },
                {
                    "user_id": "Wendall Freeman",
                    "user_href": "/profile/Wendall-Freeman"
                },
                {
                    "user_id": "Joshua John",
                    "user_href": "/profile/Joshua-John-238"
                },
                {
                    "user_id": "Bob Larkin",
                    "user_href": "/profile/Bob-Larkin-7"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/The-Dronacharya-1"
                },
                {
                    "user_id": "Junior Shiv Nadar",
                    "user_href": "/profile/Junior-Shiv-Nadar"
                }
            ]
        }
    ]
}