{
    "title": "What is technological revolution? - Quora",
    "tags": [
        "Technological Revolutions",
        "Revolution",
        "Technology Trends"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nick Deakin",
                "href": "/profile/Nick-Deakin-4"
            },
            "answer_text": "The grinding wheel with flywheel ! Very little is known about it, but it must have existing as this artefact is evidence of it. The tools are not that difficult to make, a pointed stick with a grinding wheel attached to the top, in a table with a hole, but look what you can do with it. It was probably used to make Obsidian (volcanic glass) mirrors, not much has changed, ladies want to look their best. But look at this wonder…  Tolerances are micron scale (0.1mm or better) for the profile! 7,500BCE. This is the start of technology as we know it today, you can’t do that much without tools. Whatever made this is tooling well ahead of the curve (a basic machine!), there is a lot of interesting things going on in the area at this time, which would lead in the fullness of time to civilisation. This is the height of the stone age and shows true mastery of the material of the age. I’m not sure which is more remarkable the bracelet, the craftperson who made it or the machine used. In my opinion geniuses like Leonardo come once an astronomical age (about every 2000 years), they seem to be good of the art of science: technology. In the Age of Cancer 8,000 to 6,000 BCE, metal smelting was discovered, but this gets the top spot for me (a machine).  9,500-Year-Old Obsidian Bracelet — Nanoscale Surface Quality Worthy of Modern Telescope Lenses (thanks to Colleen Anne Coyle for flagging it up). This is what really leads to the potter's wheel and the solid wheel (platforms) and machines. I think it now more likely that the grinding wheel, lead to the potter's wheel which leads to the Wheel! The technology revolution is slow and generally incremental, the above is a massive thing as significant as humans on the moon in more recent times. A machine that can do precision hard work more easily. Its easy to make with the tools and techniques they had at the time. Hint: I hope Emma makes one! ",
            "date": "Updated July 20, 2019",
            "views": "19",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jared Olson",
                    "user_href": "/profile/Jared-Olson"
                },
                {
                    "user_id": "Ross Hall",
                    "user_href": "/profile/Ross-Hall-5"
                },
                {
                    "user_id": "Pericles Bacchus",
                    "user_href": "/profile/Pericles-Bacchus"
                },
                {
                    "user_id": "Krupa Rajasekar",
                    "user_href": "/profile/Krupa-Rajasekar"
                },
                {
                    "user_id": "Josh McNallyayres",
                    "user_href": "/profile/Josh-McNallyayres"
                },
                {
                    "user_id": "Parth",
                    "user_href": "/profile/Parth-400"
                },
                {
                    "user_id": "Srikaanth Sridhar",
                    "user_href": "/profile/Srikaanth-Sridhar"
                },
                {
                    "user_id": "Mathew Damarus",
                    "user_href": "/profile/Mathew-Damarus"
                },
                {
                    "user_id": "David Wollner",
                    "user_href": "/profile/David-Wollner-2"
                },
                {
                    "user_id": "Emma Skinner",
                    "user_href": "/profile/Emma-Skinner-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Svet Sedov",
                "href": "/profile/Svet-Sedov"
            },
            "answer_text": " Technological revolution is the misconception. According to one of the most popular concepts, promulgated by mass medias, there have been five technological revolutions in the human history. First is the agricultural revolution of 17th-century, when we learned such things as large scale farming. Second is the Industrial Revolution of the 18th century, when people started to apply water and heat power to mechanize their work-shops and small factories. Third is the Second Industrial Revolution of the start of the 20th century, which brought to us mass production, internal combustion engines, electricity and nuclear energy. Fourth is the, so-called, Scientific Revolution of 1970th, which opened our eyes on commercial opportunities of scientific discoveries. We are now living in the era of fifth, Information Revolution, which has linked almost every members of our society into one global network. The same revolution has provided us with enough data to cause the complete dismantling of the \"technological revolution\" concept. It's absolutely frustrating that this \"theory\" is taking into account only the Western world, and disregards great Middle-Eastern, Asian, Africa and pre-Colombian American civilizations. Additionally, there is no clear definition of what \"the technological revolution\" really means. At the same time there are enough facts to argued that so-called \"tech-revolutions\" are random periods of time, when ever-going, gradual technological changes manifest itself most visibly in various \"tech-toys\" thanks to some ground-shifting historical events like wars, large-scale migrations, economic calamities or political entities disintegration. It's more likely that, those \"revolutions\" are primary created by periodic global waves of mass-media hysterias urged by profit-seeking motives. One obvious argument to support this allegation is that the count of \"t-revolutions\" began in 17th century, right at the time of first public news-papers appearance. Having said that, we are not stating that there is no accelerating technological progress, or that technologies are always secondary to politics or economics. We are simply insisting that we can't easily separate science and connected to it automation, machinery and computing from all other aspects of human lives. ",
            "date": "Answered May 31, 2017",
            "views": "35",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nathan Coppedge",
                    "user_href": "/profile/Nathan-Coppedge"
                },
                {
                    "user_id": "Pickos Ivoss",
                    "user_href": "/profile/Pickos-Ivoss"
                }
            ]
        }
    ]
}