{
    "title": "What is the current understanding of borderline personality disorder etiology? - Quora",
    "tags": [
        "Etiology",
        "Medical Diagnoses",
        "Borderline Personality Disorder",
        "Understanding and Comprehension",
        "Abnormal Psychology",
        "Personality Disorders",
        "Mental Illness",
        "Psychology",
        "Mental Health"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sandy Lang",
                "href": "/profile/Sandy-Lang-11"
            },
            "answer_text": "According to the experts it starts in childhood having emotionally unavailable parent's. It is coming to light that a not all with BPD ,come from abusive homes,I was however sexually abused by a friend's father from ages 5 to 7. I would run home,ditch my underwear if there were blood and carry on my life fe until the next time.That was in the late 60’s early 70’s…Mom just found out a year ago. I lost a younger brother when I was 14,which annihilated my world,threw my beliefs in the gutter and trust out the window. I am also a survivor of an 18 years of Narcissistic abuse. Bottom line,BPD is the result of years of abuse that result in physical changes in the brain, increasing the size of the amygdala,the seat of anger,sadness fear and aggression .It is also believed to have a permanent effect on seratonin level,the feel good chemical,so you can imagine the existence of someone with BPD. Borderline Personality Disorder is actually and emotion dysregulatory disorder and not a Cluster B disorder.Basically our emotions are like a sore the scab had been ripped off again and again. Very Painful and the site never heals. It typically is not diagnosed on it's own,and hides in BiPolar Disorder as well as PTSD and CPTSD. Left untreated it can wreak absolute havoc and destruction in any form of relationship,leaving the sufferer kicking themselves and lowering their already dismal self- worth. ",
            "date": "Answered March 7, 2020",
            "views": "108",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pedro Cardoso",
                    "user_href": "/profile/Pedro-Cardoso-3"
                },
                {
                    "user_id": "Patricia Santana",
                    "user_href": "/profile/Patricia-Santana-26"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lucas Jerzy Portela",
                "href": "/profile/Lucas-Jerzy-Portela"
            },
            "answer_text": "Borderline is not a proper diagnose in Psychoanalysis, but as Lacan points out we have a precedent: the famous Wolfman, former Freud’s patient and probably the best documented clinical case in all history of psychopathology (as Freud attended him in two diferent epochs with years of interval, than Ruth Mack Brunswick who also published his clinical case, than Muriel Gardner, than Sergei the patient himself published an article about his experience of being treated in psychoanalysis and later yet he gave a famous book long interview to Karyn Obholzer) - the Wolfman, as I was saying can be taken as a “borderline”. Why? Because he was a neurotic with many psychotic traces (in the end of his second analysis with Freud he even produced a recurring halucination that his nose fell off of his face, which lead him to the treatment with Ruth), and whose unconscious content were not as much repressed as they were forcluded, and this because he had had a very early insertion in the sexual reality of his parents from a passive position which lead to a very peculiar fixation on the oral drive. This would be my ethiologic hypothesis to neurotic patients who seem to have something of psychotic or melancholic or peverse: search for pre-edipical over-genitalized sexual scene in which the patient unwillingly participated. ",
            "date": "Answered March 11, 2020",
            "views": "142",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Joe Jacobs",
                    "user_href": "/profile/Joe-Jacobs-15"
                }
            ]
        }
    ]
}