{
    "title": "What does the Bible say about husbands? - Quora",
    "tags": [
        "Marriage in the Bible",
        "Religion and Marriage",
        "Husbands",
        "The Bible",
        "Christianity",
        "Marriage"
    ],
    "response": [
        {
            "author_info": {
                "name": "Crowly Mathew Arackal",
                "href": "/profile/Crowly-Mathew-Arackal"
            },
            "answer_text": "(1 Eph. 5: 25-32) [Husbands, love your wives, as Christ loved the church and gave himself up for her, that he might sanctify her, having cleansed her by the washing of water with the word, so that he might present the church to himself in splendor, without spot or wrinkle or any such thing, that she might be holy and without blemish. In the same way husbands should love their wives as their own bodies. He who loves his wife loves himself. For no one ever hated his own flesh, but nourishes and cherishes it, just as Christ does the church, because we are members of his body.  “Therefore a man shall leave his father and mother and hold fast to his wife, and the two shall become one flesh.”  This mystery is profound, and I am saying that it refers to Christ and the church.  However, let each one of you love his wife as himself, and let the wife see that she respects her husband.] (1 Cor. 7: 3-4) [The husband should give to his wife her conjugal rights, and likewise the wife to her husband. For the wife does not have authority over her own body, but the husband does. Likewise the husband does not have authority over his own body, but the wife does.]  (1 Cor. 7: 13-14) [If any woman has a husband who is an unbeliever, and he consents to live with her, she should not divorce him.  For the unbelieving husband is made holy because of his wife, and the unbelieving wife is made holy because of her husband. Otherwise your children would be unclean, but as it is, they are holy.] ",
            "date": "Answered November 3, 2015",
            "views": "179",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elizabeth Penrose",
                    "user_href": "/profile/Elizabeth-Penrose-1"
                },
                {
                    "user_id": "Liz Marsh",
                    "user_href": "/profile/Liz-Marsh-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Pixley",
                "href": "/profile/Mark-Pixley-1"
            },
            "answer_text": "Depends on who you ask, apparently some people only pick and choose the aspects that support their own view...the Bible is a collection of many \"books\", letters and documents that have been canonized by institutional Christianity and on some levels Judaism...so when you ask this there are a lot of answers you can get...sure if you go to the ancient Masoretic text there are passages that seem to imply you can rape a girl, give her dad 50 shekels and she becomes your wife, but there are no scriptures that say you can beat her, rape her or murder her, as a matter of fact the early text of the Israelites was implemented to stop this kind of behavior and was relatively successful...remember these text appear in a Patristic society where almost all of the surrounding cultures made women property much like cattle (many Middle-eastern cultures remain trapped in this metric)...as far as husbands are concerned scripture seems to point to an egalitarian model between husband and wife that is very easy to ignore if you take things out of context. When you get over tot he New testament Jesus had some very strong words limiting the power of husbands to divorce and eliminating the need to stone a woman caught in adultery, so Jesus on some level \"limits\" the husbands power. Paul will demonstrate that the true nature of a husbands responsibility is to love his wife as himself, to lay down his own dreams and desires and elevate her just as Jesus laid down his desires and died for the \"church\" which corresponds to the bride/woman. Ultimately the bible will call men to support, empower and care tenderly for women as the highest calling they can have, to provide, protect and cherish the wife...Paul will say \"nourish\" and cherish the idea behind \"nourishing\" is the husband is to find what it is that really makes his wife come alive, what does she require to flourish, and then provide that. ",
            "date": "Answered October 7, 2014",
            "views": "11",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kezy MJ",
                    "user_href": "/profile/Kezy-MJ"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Alisha-909"
                },
                {
                    "user_id": "Katherine Moss",
                    "user_href": "/profile/Katherine-Moss-20"
                },
                {
                    "user_id": "Eugene Kumarapperuma",
                    "user_href": "/profile/Eugene-Kumarapperuma"
                }
            ]
        }
    ]
}