{
    "title": "What can I add in my worm vermicomposting bins if they're starting to smell? - Quora",
    "tags": [
        "Vermicomposting",
        "Earthworms",
        "Compost and Composting",
        "Worms (animal)",
        "Smell and Smells",
        "Gardening",
        "Science of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gaby Biordi",
                "href": "/profile/Gaby-Biordi"
            },
            "answer_text": "“What can I add in my worm vermicomposting bins if they're starting to smell?” In general, there are three reasons why your vermicompost bin may be smelly: The bin is too wet. This is the most common reason for smelly bins. Wet, compacted material promotes the growth of anaerobic bacteria, which smell bad. Material in the bin should be moist but not soggy, and you should be able to easily turn the material without seeing any matting. Open the lid to allow airflow and add shredded cardboard, paper (not the shiny kind), leaves, straw, or other dry organic matter. This will soak up some of the moisture and reduce the smell over time.You have added a food that is already a little smelly. Things like broccoli, cabbage, brussels sprouts, and potatoes get smelly pretty quickly as they start to break down. In this case, just wait for the worms to finish it off, and only add it in small amounts in the future, or cover it with several inches of bedding material.You have added a large amount of uncomposted food. The worms will not eat food until it has already started to rot, so if you add food directly from your kitchen, it will take time to break down, and might smell during that time. Cover this food with several inches of bedding material, and only feed as much as the worms can eat in a week.",
            "date": "Answered October 22, 2020",
            "views": "28",
            "upvotes": " View Sharers ",
            "upvoters": [
                {
                    "user_id": "Raydonna Sims",
                    "user_href": "/profile/Raydonna-Sims"
                },
                {
                    "user_id": "Scott Hilzinger",
                    "user_href": "/profile/Scott-Hilzinger"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kelly Liddington",
                "href": "/profile/Kelly-Liddington"
            },
            "answer_text": "Raising the pH is a fast answer to the issue at hand. I am not thinking that the gypsum will hurt the process, but we use gypsum when you need Calcium and don’t want to raise the pH. I really think you need to go back to the written instructions, moisture may be too high, and adding some dry or lower moisture content and get some more air into the bins. But if this is your first attempt at this process, gaining the experience is an invaluable experience, you may want to try several options and keep track of things going in, environmental conditions, etc. It may be that your expectations need to be altered, it is a decomposing process and the truth may be that you admit that a certain level of odor is necessary and inevitable, I not saying that a lot of odor is to be expected, you really are off base if that happens. ",
            "date": "Answered October 14, 2020",
            "views": "35",
            "upvotes": " View 2 Upvoters "
        }
    ]
}