{
    "title": "What is refractive index? What do you understand by “refractive index of glass is 1.55”? - Quora",
    "tags": [
        "Refractive Index",
        "Refraction",
        "Optics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mahesh Prakash",
                "href": "/profile/Mahesh-Prakash-5"
            },
            "answer_text": "refractive index in a sense, it is incomplete refractive index of a medium is a ‘relative’ quantity - defined with respect to another we do use this word loosely if the speed of light in vacuum is c and that in a material medium is v, then the quotient n = c/v is called the refractive index of this medium …………….. take another situation: a slab of glass immersed in water if vg and vw are the speeds of light in glass and water, respectively then a ray of light travelling initially in water and entering the glass slab, then the subsequent conduct of the light ray will be determined by the refractive index of glass with respect to water, wng = speed of light in water/speed of light in glass = refractive index of glass/refractive index of water ",
            "date": "Answered June 27, 2020",
            "views": "103",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harold Clements",
                    "user_href": "/profile/Harold-Clements-1"
                },
                {
                    "user_id": "Meena Kumari",
                    "user_href": "/profile/Meena-Kumari-205"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tony Heyes",
                "href": "/profile/Tony-Heyes"
            },
            "answer_text": "The refractive index of a material, say glass, is a measure of the extent to which a ray of light entering the glass from air is bent. More fundamentally the refractive index is equal to the velocity of light c of a given wavelength in empty space divided by its velocity v in a substance, or n = c/v. ",
            "date": "Answered June 26, 2020",
            "views": "14",
            "upvotes": "0"
        }
    ]
}