{
    "title": "What if the universe stopped expanding for 2 seconds? - Quora",
    "tags": [
        "The Universe",
        "Cosmology",
        "Astrophysics",
        "Astronomy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ibrahim Khatib",
                "href": "/profile/Ibrahim-Khatib-1"
            },
            "answer_text": "I think the question could be fun, but you would need to determine the criteria. Stopping expansion in what way? Has all of time stopped for two seconds? Or has some unimaginably large impact counterforce applied at every single position opposed its expansion for two seconds? And then maybe another contradictory force restarted it? in the time situation I don't feel great damage occurred, unless the thing that caused the stopping of time had any other side effects. If were just talking about say, God stop in time for two seconds then I imagine he'd do it with seamless Precision. In the case of the counterforces, now you have a followup question of how evenly distributed those forces were upon all objects in the universe at those instants of time. If very evenly then I don't know maybe damage might be OK? But if it is like giant hands grabbing each planet and star for 2 seconds, and then flinging it again, well that would likely render everything on it to rubble. Measured against the CBR, the Milky Way is estimated to be moving at around 2 million KPH. So it would be like being in a car crash at 2 million KPH so if that helps you know. One final thought is maybe the hands are even bigger, and they just grab entire galaxies themselves. So that would only directly destroy the areas where the hand came into contact with matter, but that disturbance would surely ripple through the entire galaxy and totally disrupt the orderly spiral. I imagine the devastation would be universal, but that it may not affect us directly. As in it could be millions of years before we start to feel the effects. ",
            "date": "Answered February 19, 2017",
            "views": "261",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Adarsh Jha",
                "href": "/profile/Adarsh-Jha-43"
            },
            "answer_text": "According to Big Crunch theorey the universe will ultimately stop expanding and everything in space will start coming closer to each other . If you are considering the 2 seconds that will take place after start of Big Crunch then the universe will slowly start collapsing inside itself and we will not experience any huge change for few time as the speed will not suddenly stop it will take a long period to take place. But if you are considering the present next 2 seconds which are a way before Big Crunch then we will face a huge destruction as the space is expanding at a huge speed . So,it is possible that we will face the same condition we will face when we are sitting on a roller coaster and at the time when it take a steep turn at its full speed and suddenly it stops in less then a second and we haven't weared any safety belt then we will face the first law of Newton and land on the ground nearby us. Same in case with universe when Universe suddenly stop everything in space should follow first law of Newton that is law of inertia . So according to it everything will follow this law and a huge collision of everything with everything in space takes place which will ultimately result in total distruction. ",
            "date": "Answered February 5, 2017",
            "views": "450",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pooja Jha",
                    "user_href": "/profile/Pooja-Jha-125"
                },
                {
                    "user_id": "Rohit Arora",
                    "user_href": "/profile/Rohit-Arora-129"
                }
            ]
        }
    ]
}