{
    "title": "What is exactly dark matter and dark energy? - Quora",
    "tags": [
        "Dark Energy",
        "Dark Matter",
        "The Universe",
        "Cosmology",
        "Science of Everyday Life",
        "Physics of Everyday Life",
        "Astrophysics",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeffrey Werbock",
                "href": "/profile/Jeffrey-Werbock"
            },
            "answer_text": "Dark matter and dark energy are nicknames referring to conceptual placeholders to account for two very different cosmic conditions which cannot be accounted for by the four fundamental forces of nature identified by physics as gravitation, electromagnetism, strong and weak nuclear. DM was first proposed nearly a century ago when rotating galaxies were observed to be rotating at such high speeds that the amount of matter (mass) didn’t seem to be nearly enough to prevent the stars in the outer regions from flying off into intergalactic space by the centrifugal force of that rotation. So it was presumed that there must be invisible mass (dark matter) that prevented the rotating galaxy from flying apart owing to its rotation. What is strange is that rotating galaxies come in a wide range of sizes, densities and rotational speeds, yet no rotating galaxies are observed to either expand in diameter nor contract. That means each and every rotating galaxy would need to have an exact amount of invisible mass (DM) calibrated for its size, density and rotation speed. That seems most unlikely, yet the search for DM goes on. Bear in mind that rotating galaxies rotate like a wheel, as if it was a solid object being spun around on some axis. Galaxies are collections of stars, planets, moons, space rocks, dust and hydrogen clouds. It is mostly empty space devoid of matter except where it is concentrated in lumps. That a galaxy hangs together like they do is due to the force of gravity and that is why DM seems so reasonable when it may not even exist at all. DE was proposed 22 years ago when observations / calculations based on supernovae indicated the rate of cosmic expansion (gravitationally bound galactic groups appear to be receding from each other) was accelerating rather than decelerating as might be expected from the effects of gravity. It was not known (still not known) what drives this accelerating rate, so in a nod to the elusive DM, this unknown “force” was dubbed dark energy. My guess is that both conditions, quite different but both involving gravitation, will be resolved by a more complete theory of gravitation, possibly owing to greater curvature than is currently assumed to be the condition of the spacetime metric far from mass aggregates. ",
            "date": "Answered July 21, 2020",
            "views": "94",
            "upvotes": " Answer requested by Tara Arizona",
            "upvoters": [
                {
                    "user_id": "Victor Sciortino",
                    "user_href": "/profile/Victor-Sciortino"
                },
                {
                    "user_id": "Angesi Halai",
                    "user_href": "/profile/Angesi-Halai"
                },
                {
                    "user_id": "Pritam Gautam",
                    "user_href": "/profile/Pritam-Gautam-3"
                },
                {
                    "user_id": "Rachelle Roberthon Favaloro",
                    "user_href": "/profile/Rachelle-Roberthon-Favaloro"
                },
                {
                    "user_id": "Tom Martin",
                    "user_href": "/profile/Tom-Martin-261"
                },
                {
                    "user_id": "Ajith",
                    "user_href": "/profile/Ajith-118"
                },
                {
                    "user_id": "Arvind Balamurugan",
                    "user_href": "/profile/Arvind-Balamurugan"
                },
                {
                    "user_id": "Jishu Das (ଯୀଶୁ ଦାସ)",
                    "user_href": "/profile/Jishu-Das-ଯୀଶୁ-ଦାସ"
                },
                {
                    "user_id": "Aadithya Athrey C",
                    "user_href": "/profile/Aadithya-Athrey-C"
                },
                {
                    "user_id": "Dhruv Chouhan",
                    "user_href": "/profile/Dhruv-Chouhan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Palash Aggrawal",
                "href": "/profile/Palash-Aggrawal"
            },
            "answer_text": "[I have written in such a way that everyone understands, but if you want to skip the physics part and the discovery story part and need just the crux, then read only the last paragraphs of the headings, but if you want a better understanding, read it full, its astrophysics after all!]Dark matter and Dark energy basically are mysterious energy and matter in the universe, about which we know nothing accept that it has had weird effects and approximately how much of it lies in the universe.  DARK ENERGY: - See, if you make the model of the universe according to only newton's laws of gravity, you will get three models. 1) After big bang, Universe first expands, is slowed down by the gravity, stops and finally starts to contract, leading to the big crunch.2) After big bang, Universe expands with just the right speed to overcome its gravity (escape velocity) and thus just keeps slowing forever but never stops, or we can say stops at infinity3) after big bang, Universe expands with a speed greater than its escape velocity and thus expands forever slowing down but never stoppingThese ideas were in the Friedman models of the universe.But, surprise came in 1998.In 1998, Brian Schmidt and his team observed distant supernovae - Type 1a supernovae. There were very far away and very bright so they were easier to study. Since they were very distant, they were actually the past of the universe, as you know the further we o, the more time it takes for the light to reach us.  So that means that the more far an object is, the more before light left it.  Using type 1a supernovae, they found out the  acceleration factor (rate with which the universe was expanding) and compared it to the same for the nearby objects i.e. the current rate of expansion of the universe. This fits none of the above models derived using only gravitational force, according to which universe should slow down. So the scientists proposed that there is a force stronger than gravity which counteracts gravity and thus the universe is expanding. This mysterious force was named as Dark energy. It is believed that universe has 70 % of dark energy. DARK MATTER:-Using the newton's laws of gravity (which are pretty accurate but have slight variation) and the formula for centripetal acceleration, we derive the following formula for the velocity of an object in orbit around another one:\"v = √[(G x M)/R]\", where G is gravitational constant, R is distance between these objects, M is the mass of the object around which it orbits.As you can see above as we will increase R the velocity should decrease i.e. if in a galaxy a star is farther away from its center, its velocity is lesser as compared to those closer in.  But observations of velocities of stars in other galaxies showed that this was not the case, the velocity was pretty much similar for all of them, which, again does not fit the model of gravity, as seen above. It was seen that if we consider only the mass of the stars, we cannot get the above observations. That means we need a much larger mass to account for this strange observation. This is called dark matter. it turns out that dark matter constitutes 95 % of the matter, 5% being rest of the ordinary matter I guess. It turns out that galaxies are surrounded by an ocean of dark matter, and the part we see is like an island in the ocean (use google images to visualise)Comment if any further questions on this, post! ",
            "date": "Updated October 8, 2014",
            "views": "15",
            "upvotes": " View 19 Upvoters"
        }
    ]
}