{
    "title": "What is gravitational pull? - Quora",
    "tags": [
        "Gravity",
        "Astrophysics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Vicary",
                "href": "/profile/Peter-Vicary"
            },
            "answer_text": "Gravitational pull is the energy expended (energy tension) that separates two bodies of mass. An apple does not fall UP, but the energy of its tree separates it from the gravitational pull of the stronger mass-density of Earth and stops it from falling down. As soon as the energy provided by the tree is severed, so too is the apple severed from its river of energy, and the apple then falls into gravitational pull. When you strike a golf ball, the ball “desires” to fly off into orbit away from gravitational pull, but because your intrinsic energy in it is insufficient, the greater mass-density of Earth pulls it back; so the separation into pull between the two bodies of mass is created by the energy expended in the separation. When there is no separation by energy there is no pull, because when the golf ball is at rest, devoid of its own energy, and on the ground, it is falling into space at the same speed as Earth. ",
            "date": "Answered November 30, 2017",
            "views": "720",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Thilak Concepts",
                    "user_href": "/profile/Thilak-Concepts"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gaurav Gupta",
                "href": "/profile/Gaurav-Gupta-1787"
            },
            "answer_text": "Gravity, or gravitation, is a natural phenomenon by which all things with mass are brought toward one another, including objects ranging from atoms and photons, to planets and stars.  Fling a ball hard enough, and it never returns. You don't see that happen in real life because the ball must travel at least 11.3 kilometers (7 miles) per second to escape Earth's gravitational pull. Every object, whether it's a lightweight feather or a gargantuan star, exerts a force that attracts everything around it. Gravity keeps you anchored to this planet, the moon orbiting Earth, the Earth circling the sun, the sun revolving around the galaxy's center and massive galactic clusters hurtling through the universe as one.  Gravity and three other fundamental forces hold the universe together. The strong nuclear force keeps particles in an atom's nucleus from flying apart. The weak nuclear force causes radiation in some nuclei, and the electromagnetic force performs critical tasks such as holding a molecule's atoms together. Although the sun's gravity grips planets billions of miles away, gravity is the weakest fundamental force. ",
            "date": "Answered November 30, 2017",
            "views": "16",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mohit Shree",
                    "user_href": "/profile/Mohit-Shree"
                },
                {
                    "user_id": "Shailesh Garg",
                    "user_href": "/profile/Shailesh-Garg-14"
                }
            ]
        }
    ]
}