{
    "title": "What would happen if a mega star entered our solar system? - Quora",
    "tags": [
        "The Solar System",
        "Astrophysics",
        "Planetary Science",
        "Astronomy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thomas Gazis",
                "href": "/profile/Thomas-Gazis"
            },
            "answer_text": "We would be dead long before the mega star actually enters our solar system! You see, a mega-star on a collision course with our own solar system will initially come in contact with the so called “OORT CLOUD”, which like a humongous bubble surrounds our entire solar system! There, in the Oort cloud lie dormant trillions of comets and asteroids. These large and ultra-dangerous to us objects will be affected by the gravitational pull of the incoming mega-star, they will be dislodged from their orbits and will be sent toward the inner solar system and the earth! That will be the end for any form of life on our planet! We will be dead even before the mega-star enters our inner solar system (and that’s another nightmarish scenario, as our own planets will be heavily dislodged from their billion old orbits, in that case)! ",
            "date": "Answered June 26, 2019",
            "views": "659",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Zyga",
                    "user_href": "/profile/Zyga-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vaclav Krpec",
                "href": "/profile/Vaclav-Krpec"
            },
            "answer_text": "When it would approach, our Solar system would be affected by its gravity. Planets would be ripped out of their orbits. Some of them could be thrown into the interstellar space and freeze there. Some could find new orbits, depending on how would the two stars interact. Some could be destroyed completely. Two-star systems are relatively commonly observed, so unless the trajectories of our Sun and that new star would be pretty unlikely, or the relative speed too high, they would end up rotating around their common centre of mass (the big star would be much closer to it—our Sun is a commonly sized 2nd generation star). Heavier, outer planets might orbit them. ",
            "date": "Answered June 26, 2019",
            "views": "89",
            "upvotes": "0"
        }
    ]
}