{
    "title": "What is the difference between shell, subshell and orbitals? - Quora",
    "tags": [
        "Subshells",
        "Molecular Orbitals",
        "Quantum Mechanics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Charles Lafcharis",
                "href": "/profile/Charles-Lafcharis"
            },
            "answer_text": "Truth be said; there is alot of uncertainty associated with the present interpretation of atomic structure. Nobody understands what determines the order of priority; let alone understand why energy subshell differ by adding two extra orbitals in each series of sequential subshells. There is a totally new SLA Atomic Structure that was recently published in the International Journal of Science and Research; that totally changes the perception of atomic structure in such a way which clarifies all the uncertainties. I will make it as simple as possible and not bother you with the intricate details because it likely to confusing for someone in the early development stage of understanding atomic structure. An orbital is the actual pathway of an orbiting electron. A subshell represents the numbers of orbitals required to attain a symmetrically balanced even distribution of charge across the breadth of a shell; before the order of priority moves to a new shell. A shell incorporates all orbitals within a single layer or tier of an orbital structure. I stipulate that this interpretation is part of a totally new SLA Atomic Structure. The present model incorporates a set of four quantum numbers without understanding their purposes, and how they coexist within a physical model. The SLA Atomic Structure accurately explains every aspect of atomic structure; however it requires an advanced level of understanding. Hopefully my simple explanation helps in a small way. ",
            "date": "Answered September 19, 2020",
            "views": "104",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Diksha Malik",
                "href": "/profile/Diksha-Malik-4"
            },
            "answer_text": "I will answer this question in a vague manner so that you understand… Shell is K,L,M,N…… Sub shell is s,p,d,f….. and each sub shell has orbitals. S has 1 orbital P has 3 orbitals D has 5 orbitals and so on and each orbital carry two electron with opposite spin. ",
            "date": "Answered July 19, 2018",
            "views": "902",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Neha Bisht",
                    "user_href": "/profile/Neha-Bisht-73"
                },
                {
                    "user_id": "Komal Deval",
                    "user_href": "/profile/Komal-Deval-1"
                }
            ]
        }
    ]
}