{
    "title": "What if Charles Babbage had finished his analytical engine? - Quora",
    "tags": [
        "Babbage's",
        "Charles Babbage",
        "Computers",
        "Hypothetical Scenarios",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Miller",
                "href": "/profile/Mark-Miller-89"
            },
            "answer_text": "You might be interested in a book called, “The Difference Engine,” by William Gibson and Bruce Sterling. It’s a science fiction novel that speculates on what could have been had Babbage built what he designed, and what a flourishing computer industry in Victorian England would have been like. My understanding of the background into which Babbage was attempting to promote his designs into projects is that getting acceptance for the utility of having computers around would have been a tough sell for almost everything except government projects. The British government was interested in having mechanical computers for creating computed astronomical tables that were critical for sea navigation. This was why Babbage got the idea for computing machines. He had tried to use human computers for creating these tables, and often ran into errors. The Royal Astronomical Society, which he was a part, understood this problem as well. Even though he did not succeed in building any of his designs, Per Georg Scheutz, inspired by Babbage’s designs, successfully built several difference engines, starting in 1855, one of which was sold to the government. Martin Wiberg also successfully built a difference engine, based on Scheutz’s design, but he only used his to compute logarithmic tables. (Difference engine - Wikipedia) That seems to be as far as the idea for computing machines went at the time. Doron Swade explained that the most that anyone else in British society could understand was that steam engines were a substitute for physical labor. The idea that a machine could do the work of the mind was not one that most people in society could understand, so the likely outcome was that Babbage’s computers would have been used by the government, and not much else. Would their potential for producing music and graphics have been realized? Not likely in Babbage’s lifetime. Even Babbage didn’t understand what Ada Lovelace was talking about when she recognized this potential of the Analytical Engine. To him, all it was good for was computing mathematical results. ",
            "date": "Answered March 23, 2017",
            "views": "1",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "George Grennan",
                    "user_href": "/profile/George-Grennan"
                },
                {
                    "user_id": "Christian Unger",
                    "user_href": "/profile/Christian-Unger-1"
                },
                {
                    "user_id": "Mike Buksas",
                    "user_href": "/profile/Mike-Buksas"
                },
                {
                    "user_id": "Jithin Babu",
                    "user_href": "/profile/Jithin-Babu-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Randall Neff",
                "href": "/profile/Randall-Neff"
            },
            "answer_text": "William Gibson and Bruce Sterling wrote an alternate history steampunk novel, “The Difference Engine” in 1991. The key difference was the successful construction of the Analytical Engine by Charles Babbage. Sydney Padua wrote a graphic novel, “Thrilling Adventures of Lovelace and Babbage in 2015. It depends on the Analytical Engine for the plots. The second implementation of Babbage’s Difference Engine, design 2, was visiting at the Computer History Museum. This Engine, far smaller and less complicated, used parallel arithmetic to speed up the computation of seventh order polynomials. In the first 4 seconds of a cycle, four 31 digit adds occured. In the rest of the cycle, another 4 seconds, three 31 digit adds, a print operation and a typesetting operation occurred. So one add took four seconds, but the through put was 7 adds in eight seconds. Building Charles Babbage's Analytical Engine has been working away for years, but still has far to go. The Difference Engine design was an almost complete set of drawings completed in 1847–1849. The Analytical Engine was designed over decades with lots of difference designs of various sections that do not fit together. ",
            "date": "Answered March 21, 2017",
            "views": "546",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vadim Zagorodnyuk",
                    "user_href": "/profile/Vadim-Zagorodnyuk"
                },
                {
                    "user_id": "Charles Stone",
                    "user_href": "/profile/Charles-Stone-6"
                }
            ]
        }
    ]
}