{
    "title": "What are the causes of gravitational pull? - Quora",
    "tags": [
        "Force (physics)",
        "Gravity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sanoy Samuel",
                "href": "/profile/Sanoy-Samuel"
            },
            "answer_text": "According to my theory, Gravitation is form of space-mass-energy interaction. Also According to my theory, space, energy, mass and other states of reality are made of varying concentrations/interactions of Quanta/Atoms of reality. According to my theory, Quanta/Atoms of reality are roots/incarnations of Singularity that under went Big Bang. And Singularity that under went Big Bang are one of the roots/incarnations of Entity(S). Entity(S) is absolute origin. ***Entity(S) being absolute origin, should be absolutely unbiased to all its options.*** So, Entity(S) is super-imposition of Past-Present-Future, all possibilities and impossibilities, whole omni-verse and infinitesimal …etc…etc…list goes on and on. Atoms/Quanta of reality are dynamic entities. Time represents their dynamics. Space is like lower concentration of Atoms/Quanta of reality, so when concentrations vary, they produce virtual particles that poops in and out of existence. According to my theory, before Big Bang of mass, there was big bang of space. The linear kinetic reactions of the big bang of space were converted into component inherent potentials of state of reality inside the singularity, there by destabilizing singularity to create big bang of mass.****Energy is like Transitional state between Space Entity and Mass Entity, it also represents these components of inherent potentials. State of Energy is being constantly distilled out by space-mass interaction, and these processes we physically interpret as fusion and fission reactions. My theory can also give much better explanation to many physical phenomenons like double slit experiment, gravitation, quantum behavior …etc…. Gravitation according to present theory is caused by space-time geometry, my theory explains gravitation as interaction between atoms/quanta of reality that constitute the space-energy-mass.if gravitation was formed by mass-energy curving space, then gravitational acceleration should had been uniformly varying from center of mass/gravitation to infinite.which is not that we see in reality.according my theory, gravitation is produced by interaction of atoms/quanta of reality that constitutes Space-Energy-Mass. Space-mass-energy interaction are maximum at free surfaces, this explains higher gravitation at surface of the planet and lower gravitation at its center and infinity. So, points of maximum interactions tends to move towards each other. For Brief descriptions on my theories, please visit following link: Chronomechanics ",
            "date": "Answered August 30, 2018",
            "views": "221",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jeremy Garrett",
                "href": "/profile/Jeremy-Garrett-7"
            },
            "answer_text": "…time travel plus moving through space is not gravity…. As I’m sure the reader is already aware, gravity is generated by all objects that have “rest mass,” meaning that any object that requires a force to accelerate it (make it move faster OR slower). Einstein treated this as a curve in 4-dimensional space and said that it was similar to setting weights on a trampoline’s surface. In both cases, the more massive the object the more curvature and the more curvature the more acceleration experienced by nearby objects. Information about the gravity and/or the gravity itself appears to move at the speed of light. For this and other reasons, gravity appears to be linked to electricity and magnetism in a way that is not yet understood. Why all objects create gravity is also not yet understood. Perhaps you, dear reader, will pickup the challenge, get a degree in physics, and continue the research in this field? ",
            "date": "Answered November 26, 2016",
            "views": "650",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Heather Donahue",
                "href": "/profile/Heather-Donahue-3"
            },
            "answer_text": "Gravitational pull is the hidden force that causes massive objects to pull other objects towards them. For instance, when a person jumps up in the air, it is the earth’s gravitational pull that causes him to return to the ground. All massive objects have gravity, and the bigger they are, the more gravitational pull they produce.When a mass is present in the above space time it distorts it so that whilst it remains true that traveling through space causes you to travel through time, traveling through time now causes you to move (accelerate) through space. In other words just by existing, you are compelled to move through space - this is gravity. ",
            "date": "Answered November 17, 2016",
            "views": "380",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Frank Reichenbacher",
                "href": "/profile/Frank-Reichenbacher"
            },
            "answer_text": "Scott is correct. We experience gravity as an attractive force. The earth, for example, is pulling meteorites in to be vaporized in the atmosphere or crash onto the surface. But Einstein showed us that it is not a force, as such. Instead, objects warp space and time. Think of a circular or funnel-shaped dip in a surface; like potholes in a road. It may seem like the pothole is pulling your wheel toward it, but in reality, the wheel is just following the curvature of the surface it’s rolling over. ",
            "date": "Answered August 30, 2018",
            "views": "79",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hritwik NE",
                "href": "/profile/Hritwik-NE-2"
            },
            "answer_text": "Well the best answer was provided by Einstein. In a nutshell, gravitational pull is caused by curvature in space-time. According to Einstein’s General Relativity, matter curves space (and time too) around it. And hence objects which are nearby would fall in because of the downward slope created by the planet. Newtonian mechanics has a simpler interpretation but general relativity is more correct and reliable . ",
            "date": "Answered October 2, 2017",
            "views": "232",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Raghunath Mandal",
                    "user_href": "/profile/Raghunath-Mandal-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Navkar Mehta",
                "href": "/profile/Navkar-Mehta-2"
            },
            "answer_text": "According to Newtonian mechanics gravitational pull is because of mass of the objects and distance between them. But cause of gravitational force given by Albert Einstein says that this force comes into action because of depression created in the fabric of space by the mass of the body. ",
            "date": "Answered October 2, 2017",
            "views": "163",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ahsan Abbas",
                    "user_href": "/profile/Ahsan-Abbas-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jayaraman Ganesh",
                "href": "/profile/Jayaraman-Ganesh-1"
            },
            "answer_text": "The Law of Gravitation. The Universal Law of Gravitation states ‘every body is attracted by every other body by a force proportional to the product of masses and inversely proportional by the the square of the distance. ",
            "date": "Answered October 2, 2017",
            "views": "91",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Scott Hanson",
                "href": "/profile/Scott-Hanson-5"
            },
            "answer_text": "The Curvature of space-time. cause by the presence of the Mass. One of the best layman’s descriptions of this that I have found is a Vsauce video…  ",
            "date": "Answered August 30, 2018",
            "views": "44",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sarita Devi",
                "href": "/profile/Sarita-Devi-37"
            },
            "answer_text": "if a body is very large in size then the gravitional pull of the body is more ",
            "date": "Answered October 2, 2017",
            "views": "39",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "DIBYENDU Naskar",
                "href": "/profile/DIBYENDU-Naskar-1"
            },
            "answer_text": "Cose of gravity ",
            "date": "Answered October 2, 2017",
            "views": "9",
            "upvotes": "0"
        }
    ]
}