{
    "title": "What is the main use of forceps in a laboratory? - Quora",
    "tags": [
        "Forceps",
        "Laboratories"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cheryl Johnson",
                "href": "/profile/Cheryl-Johnson-103"
            },
            "answer_text": "The main use of forceps is to pick things up and hold them. Some forceps are modified to be able to lock them on whatever you are picking up. some are made to fit pretty exactly some particular thing. Sometimes you want to keep from coming too close to the thing you are picking up, either because it is physically hot or because it is radioactive. A mixture that is unsafe to touch in the test tube can be fairly safe if held with a forceps because the radiation is halved every time you double the distance. There is a type of forceps that used to be used to assist in difficult births. I think it is less common today because difficult births are more often cesarean and there is considerable risk involved with forceps. Still, even there the forceps was used to get a better grip on the baby. ",
            "date": "Answered December 27, 2017",
            "views": "43",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dana Thea Ganiban",
                    "user_href": "/profile/Dana-Thea-Ganiban"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Phillips",
                "href": "/profile/David-Phillips-255"
            },
            "answer_text": "It entirely depends on the main focus of the lab. Where I work I use forceps daily to remove tested samples from the hot tray of our infrared moisture balance. A lab at a hospital might use forceps for biopsy slide preparation. An anatomy lab at a university might use forceps for dissection. Forceps have many different uses - far too many to list here. ",
            "date": "Answered February 28, 2017",
            "views": "18",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Michael L. Jirka",
                    "user_href": "/profile/Michael-L-Jirka"
                }
            ]
        }
    ]
}