{
    "title": "What are some similar books if I enjoyed The Lost World by Michael Crichton? - Quora",
    "tags": [
        "The Lost World",
        "Michael Crichton (author)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jonathan Brill",
                "href": "/profile/Jonathan-Brill"
            },
            "answer_text": "Most of Crichton's other books, including some of the others made into movies: Jurassic Park, Runaway, Timeline, Congo, Sphere, etcJohn Saul's Creature and Homing are more scifi thrillers in the spirit of Jurassic Park than his usual horror writingStephen King's Firestarter (mili/techno)Justin Cronin's The Passage (this is definitely a dystopia vampire novel but it's all rooted in mili/techno/science so you may dig it. Excellent book in any case.Carl Sagan's Contact. Among lots of other things, this is a scifi book about getting an alien blueprint for a spaceship, building the spaceship, and then actually flying around space. For a layperson, the technical details about the technology used and conjecture on why they worked were pretty entertaining. For a physicist I'm sure it read like Dora the Explorer in Space.It's interesting you listed The Lost World book because the one thing I remember about it is how totally different it was from the movie. ",
            "date": "Answered October 12, 2011",
            "views": "13",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sam Smith",
                    "user_href": "/profile/Sam-Smith-820"
                },
                {
                    "user_id": "Jim Eddinger",
                    "user_href": "/profile/Jim-Eddinger"
                },
                {
                    "user_id": "Ben Adityan",
                    "user_href": "/profile/Ben-Adityan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martha Kirtley",
                "href": "/profile/Martha-Kirtley-1"
            },
            "answer_text": "What are some similar books if I enjoyed The Lost World by Michael Crichton? Most of Michael Crichton’s books have similar techno thriller themes.. I enjoyed these: Lost Horizons by James Hilton — not as techno heavy, but thrilling. Shangr-La by Eleanor Cooney —. Return to the world of Lost Horizons And two sci-fi books by Anne McCaffrey — great techno thrillers especially her Crystal Singers books, but also these: Dinosaur Planet— fighting off both dinosaurs and ancient and current technology and raiders. Dinosaur Planet Survivors — still fighting the current tech and schemers. ",
            "date": "Answered March 23, 2019",
            "views": "150",
            "upvotes": "0"
        }
    ]
}