{
    "title": "What factors affect electronegativity? - Quora",
    "tags": [
        "Electronegativity",
        "Commodities Markets",
        "Physical Chemistry",
        "Chemistry of Everyday Life",
        "Organic Chemistry",
        "Science",
        "Economics",
        "Chemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jiya Khurana",
                "href": "/profile/Jiya-Khurana-5"
            },
            "answer_text": "Charge Environment Atoms vary in electronegativity, and bonds vary according to atom electronegativity. The electronegativity of an atom depends upon its charge environment. That environment depends primarily on three things: The distance between charges, the total charge, and the shielding effects. Distance Effect and Attraction Positive and negative charges exert attractive force on each other that varies as the square of the distance between them. If an electron and a proton are doubled in distance from each other, the attraction decreases by a factor of four. If they are quadrupled in distance from each other, the attraction diminishes to one-sixteenth what it was. Elements: Total Charge Elements differ in the number of protons in their nuclei. Hydrogen has 1, helium 2, lithium 3, oxygen 8, bromine 35 and gold 79. It might seem that this should be the primary determinant of electronegativity, but it’s not. To illustrate: Fluorine has a mere 9 protons, while sodium has 11. Yet sodium has a very low electronegativity, while fluorine has the highest electronegativity of all the elements. The greater the number of its protons, the larger the nucleus is and the larger the atom is. Increasing atomic size gradually decreases electronegativity. Shielding Effect An increase in electrons in an atom forces some of the electrons to occupy different orbital types; the larger the atom, the more complex the orbitals become. Helium has only s-orbital electrons, with simple spherical symmetry. Carbon has s- and p-orbital electrons. P-orbitals are more complex, shaped something like dumbbells. Strontium has s-, p- and d-orbitals. The reader will note just how complex the shape of a 5d orbital is from the image above. Radon has s-, p-, d- and f-orbitals. Complex Orbitals and Electron Density Complex orbital types alter the geometrical distribution of electron density or electron richness surrounding the nucleus. Inner electrons shield outer electrons, and increased shielding decreases electronegativity.This is because the outermost electrons do not feel the force of the positive charges of the nucleus as strongly. Those electrons thus reside a greater distance from the nucleus and are held less strongly. There is also little tendency for the atom to draw in additional electrons. If shielding is decreased, the opposite occurs. Outer electrons are drawn in more closely and the atom is more capable of accepting additional electron density. Then, the atom has greater electronegativity Thank you ",
            "date": "Answered February 4, 2020",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Medha Nand",
                "href": "/profile/Medha-Nand"
            },
            "answer_text": "Electronegativity is a relative term used to describe the effect of an atom (or even molecules) on the shared electrons. Though, this needs to be calculated experimentally….. One can guess the relative degree by considering nuclear charge density (ratio of nuclear charge to size)… Nuclear charge density depends on nuclear charge and size. As it increases, electronegative degree decreases… Left to right, across a period, nuclear charge increases so does its effect on the electrons. Top to bottom, along a group, nuclear charge increases but nuclear charge density decreases. Left to right, across a group, size decreases but nuclear charge density increases. Top to bottom, along a group, size increases so does its influence on electrons. ",
            "date": "Answered February 8, 2020",
            "views": "482",
            "upvotes": " Answer requested by Vishvendra Singh"
        },
        {
            "author_info": {
                "name": "G Nagendrappa",
                "href": "/profile/G-Nagendrappa"
            },
            "answer_text": "The electronegativity is the power of an atom to attract an electron towards itself. It depends on the charge on the nucleus and the atomic radius. Higher nuclear charge and shorter atomic radius (in a period of periodic table) gives larger electronagetivity. ",
            "date": "Answered February 4, 2020",
            "views": "274",
            "upvotes": " Answer requested by Vishvendra Singh"
        }
    ]
}