{
    "title": "What is the importance of soil as a resource? - Quora",
    "tags": [
        "Soil Science (pedology)",
        "Soil",
        "Farming"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Starnes",
                "href": "/profile/David-Starnes"
            },
            "answer_text": "Soil is magical, even mystical…maybe bc…being realistic…we all return to it… in a sense we are all part soul and soil. Soil is truly ancient too. Besides…Pedology, soil science… fascinates me…especially, the more I dig into it:) Soil…good or great soil…just doesn't appear overnight. In places…that rich topsoil is the product of thousands (more on that in a bit) of years of rock formation, rock breaking down, heat and freezing and thawing cycles, volcanic activity, glacier deposits… rain, sediments, organic matter grown and organic matter returned to the ground and soil…even deposited animal dung…large and small creature's remains… This Indiana ground I'm walking on and working…just a few feet under me…used to be… an ocean floor. Midwest Southern Indiana was a warm water ocean… What's formed on top of that former ocean floor took 150+ million years of sediments to form…those fossils I dug up a few feet down…date to the Carboniferous period. Really…below that just a few more feet…could be dated 200 million years plus. What's 50 million years between fellow Quorans? Let that sink in. So soil…takes “a few\" years to form…and if we are careless…in just a few years…it can be washed away…via erosion and bad land management practices. It is a resource that we should both appreciate and care for…besides…in all seriousness… I like eating. ",
            "date": "Answered July 2, 2018",
            "views": "28",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kristina Clarke",
                    "user_href": "/profile/Kristina-Clarke"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Vdl",
                "href": "/profile/Steve-Vdl"
            },
            "answer_text": "What did you have for lunch? It came from the soil. Maybe some plants had to go through some animals and get turned into meat first, but it originated from the soil. How about breakfast? It came from the soil. Same like lunch. Same like dinner last night. Etc. Etc. How about the oxygen you breathe? It came from plants that live in the soil. Plants change carbon dioxide into carbon (which stays in the plant) and oxygen that goes into the air. Before there were plants, there wasn’t a lot of oxygen in the air. The above is an over-simplified version of what occurs but is nevertheless mostly accurate. If you are looking for a totally simple answer, just go with the first three paragraphs. ",
            "date": "Answered February 15, 2018",
            "views": "12",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Randall Smith",
                    "user_href": "/profile/Randall-Smith-45"
                },
                {
                    "user_id": "Bilguun Byambajav",
                    "user_href": "/profile/Bilguun-Byambajav-1"
                }
            ]
        }
    ]
}