{
    "title": "What innovative science project should I make for Science Exhibition? - Quora",
    "tags": [
        "Innovation",
        "Projects"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bandara John",
                "href": "/profile/Bandara-John"
            },
            "answer_text": "innovative science project ?when we say innovative in agriculture there are many sides you can dive in to as an example you can introduce a water management system which will carry water up in to fields when the reservoir is downfield or you can introduce new gardening techniques which will  increase cultivation and productivity moreover you can go to the disaster management side you can  go and research upon natural disasters and how to prevent them and come up with something newOnce in an exhibition i saw a kid demonstrating an effective way of growing Forrest's which will prevent wildfires from spreading  Research more and find out what you can come up with ",
            "date": "Answered October 18, 2015",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Pavithra Sam",
                    "user_href": "/profile/Pavithra-Sam"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher Edwin Johnson",
                "href": "/profile/Christopher-Edwin-Johnson"
            },
            "answer_text": "Thanks for asking. All of those examples you listed are ripe for the picking. If you're looking for out of the box innovation, the one single direction I would advise you to follow is decided based on you answering these two questions: 1) which path is the most intriguing to you and 2) how can you use an analytical data-based approach that can be communicated visually to support your approach.  Select the path based on your interests, and match it with an approach that visually expresses your data analytics. Google \"data analytics\" and \"data visualization.\" Consider using open source resources like D3.js that you can leverage to share your findings. Your space to explore \"out of the box\" is limited to your imagination. Challenge yourself to consider questions that aren't being asked, or that you suspect may be looking for in the wrong place. Don't be afraid to question seemingly obvious assumptions.  If you do this, you will impress yourself and your audience, and most likely offer benefitial perspectives to your chosen field of investigation. Good luck! Be sure to tell me how it goes. ",
            "date": "Answered October 18, 2015",
            "views": "22",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sakshi Dudhani",
                    "user_href": "/profile/Sakshi-Dudhani-1"
                },
                {
                    "user_id": "Pavithra Sam",
                    "user_href": "/profile/Pavithra-Sam"
                }
            ]
        }
    ]
}