{
    "title": "What's the difference between insecure traits and narcissist traits? - Quora",
    "tags": [
        "Insecurities",
        "Narcissistic Personality Disorder"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrei George",
                "href": "/profile/Andrei-George-8"
            },
            "answer_text": "They both, in most of the cases, has the same root: INSECURITY. But there are quite many differences: The insecure traits are possessed by the dude that feels a loser, worthless and conciously inferior to everybody around him, that consideres he is just useless.So, as a manifestation it might look quite sad. But definitely this is not case with a narcissist. He has insecurities, but he do not worship anyone unless that person has some enormous and admirable results. He consideres himself a god, perfect, the best, his insecurities are covered by some disdainful, haughty, arrogant & snobbish behaviour, holding contempt for almost everybody around them, to the rest being indifferent.He do not accept to be treated like a shit and will kill you if he can, while the other will kiss your ass because it is mentally collapsed, he will see everyone around him as being better, worthy, while he do not deserve even to exist (strange, I know).The Narcissist might afford some callous treatment only as means to an end, a method of manipulation, but not because he consideres you superior to him, or because is shy, or afraid.So, this is basically the difference between those 2. One is really devoid of any trace of self-esteem, while the other tried to fight a little, if it makes sense. Also in manifestation they look quite different. There is a difference between the shy guy that shits on him when he sees a girl, and the Narcissist that, well, he may shits himself too as the former, but at least he tries “to stay in positions”, and act overly-confident to compensate the insecurities while the first sadly is lost. ",
            "date": "Answered September 2, 2017",
            "views": "17",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Breonna J. Claytor",
                    "user_href": "/profile/Breonna-J-Claytor-1"
                },
                {
                    "user_id": "Zoe Starling",
                    "user_href": "/profile/Zoe-Starling"
                },
                {
                    "user_id": "Liz Garner",
                    "user_href": "/profile/Liz-Garner-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dana Leigh",
                "href": "/profile/Dana-Leigh-5"
            },
            "answer_text": "Insecure traits of a person are maladaptive mechanisms or learned behavior that is from the development of insecurities, fears, and irrational thinking based on self doubt and low self esteem in a person. Narcissistic traits is from one’s character and personality that are developed from similar dynamics of self doubt, but more from a heightened false belief that they are entitled while the external people and variables owe them what they demand as in immediate gratification or replacement through another. Narcissist often lack the capability to feel empathy with a consciousness of potential wronging another person to get what they need from them. ",
            "date": "Answered January 26, 2019",
            "views": "441",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tim Sutton",
                    "user_href": "/profile/Tim-Sutton-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter T Mayer",
                "href": "/profile/Peter-T-Mayer"
            },
            "answer_text": "Insecure person: “I might be the least good looking person in the room. I have an ugly face with a big nose. I might need to get a nose job.” Narcissist person: “I am the best looking person in the room. I have the prettiest face with the perfect nose. And all of you are just bad looking. And by the way most of you might need to get a nose job.” ",
            "date": "Answered August 25, 2017",
            "views": "35",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Breonna J. Claytor",
                    "user_href": "/profile/Breonna-J-Claytor-1"
                },
                {
                    "user_id": "Jailan Maarouf",
                    "user_href": "/profile/Jailan-Maarouf"
                },
                {
                    "user_id": "Zoe Starling",
                    "user_href": "/profile/Zoe-Starling"
                },
                {
                    "user_id": "Rachel Wan",
                    "user_href": "/profile/Rachel-Wan"
                },
                {
                    "user_id": "Eleanor Nikollaj",
                    "user_href": "/profile/Eleanor-Nikollaj"
                },
                {
                    "user_id": "Tgjhg Juhh",
                    "user_href": "/profile/Tgjhg-Juhh"
                },
                {
                    "user_id": "Victoria Caroline",
                    "user_href": "/profile/Victoria-Caroline"
                },
                {
                    "user_id": "Gudrun Weissensteiner",
                    "user_href": "/profile/Gudrun-Weissensteiner"
                },
                {
                    "user_id": "Poonam Dhruw",
                    "user_href": "/profile/Poonam-Dhruw"
                },
                {
                    "user_id": "Darlys Davis",
                    "user_href": "/profile/Darlys-Davis"
                },
                {
                    "user_id": "Robin Roy",
                    "user_href": "/profile/Robin-Roy-71"
                },
                {
                    "user_id": "Stephen Ahubelem",
                    "user_href": "/profile/Stephen-Ahubelem"
                },
                {
                    "user_id": "Robert Burton",
                    "user_href": "/profile/Robert-Burton-9"
                },
                {
                    "user_id": "Vivien Cole",
                    "user_href": "/profile/Vivien-Cole"
                },
                {
                    "user_id": "Hussein Taher",
                    "user_href": "/profile/Hussein-Taher-2"
                },
                {
                    "user_id": "Tina Hurring",
                    "user_href": "/profile/Tina-Hurring"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nic East",
                "href": "/profile/Nic-East"
            },
            "answer_text": "Narcissist traits have to do with self aggrandizement, looks and self approval. Insecurity has to do with fragility of your self image based upon ability to perform and not about how you appear to others. ",
            "date": "Answered August 25, 2017",
            "views": "346",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Dandoy",
                    "user_href": "/profile/James-Dandoy-1"
                },
                {
                    "user_id": "Digna Vera",
                    "user_href": "/profile/Digna-Vera"
                },
                {
                    "user_id": "Marcia East",
                    "user_href": "/profile/Marcia-East-2"
                }
            ]
        }
    ]
}