{
    "title": "What are some good cooking hacks for people that don't cook? - Quora",
    "tags": [
        "Tips and Hacks for Everyday Life",
        "Cooking"
    ],
    "response": [
        {
            "author_info": {
                "name": "Liv Faye",
                "href": "/profile/Liv-Faye"
            },
            "answer_text": "Hi! :) As someone who loves to eat fresh, healthy, homemade meals but wants to spend the least amount of time possible in the kitchen, here are some simple tricks I've come across and apply often:  * ALWAYS keep bell peppers, onions and some greens (cilantro or celery stalks) in the fridge clean and ready to be chopped (or pre-chopped). Also, restock them the moment you use them up. That way you have less excuses to cook next time. * Rinse and reuse pots, pans, and  utensils as much as possible while cooking. For example, if you need a  spoon to stir something, rinse one that is already dirty instead of  grabbing a new one. Saves a ton of time later! * Incorporate canned ingredients to your recipes whenever possible, such as beans, tuna, sauces,  and chicken or vegetable stock. Just make sure they have the least amount of ingredients, low sodium, and that the can has a BPA-free liner. * Chop fresh fruit and veggies and keep them in the freezer to have ready-to-go ingredients for smoothies. THE FREEZER IS YOUR FRIEND. * If you cook for one or two and have veggies you don't think you can eat on time, just cook and freeze them and mix them in smoothies later. I do this all the time if I have extra broccoli. * Bananas or apple slices dipped in peanut or almond butter make a fulfilling and quick snack. * Mix raw cacao powder with an equal amount of honey to make a tasty  chocolate syrup you can add to toast or use to make hot chocolate! * Soups are usually the easiest dish to make. Whenever I want an easy, healthy meal, I go for soup, particularly lentil soup. The most time-consuming thing is the chopping, so make sure to have some pre-chopped veggies. Also, the more veggies you add the more fulfilling it will be and the longer it will last! * The quickest meat to cook is fish! You can just grab one or two fillets and rub them with salt & pepper and cook them for some minutes in the pan along with tomato, onion, and bell pepper slices for a tasty fish with tomato. * Have dried herbs on hand at all times! I always have basil, oregano, and thyme. These are my main suggestions for now :) ",
            "date": "Answered November 15, 2015",
            "views": "36",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Magnolia Lia",
                    "user_href": "/profile/Magnolia-Lia"
                },
                {
                    "user_id": "SHirsch",
                    "user_href": "/profile/SHirsch"
                },
                {
                    "user_id": "Pravin Kumar",
                    "user_href": "/profile/Pravin-Kumar-443"
                },
                {
                    "user_id": "Jasmin Relorcasa",
                    "user_href": "/profile/Jasmin-Relorcasa"
                },
                {
                    "user_id": "Jamesha Chen",
                    "user_href": "/profile/Jamesha-Chen"
                },
                {
                    "user_id": "Deepika Mohanty",
                    "user_href": "/profile/Deepika-Mohanty-5"
                },
                {
                    "user_id": "Meghana Prasanna",
                    "user_href": "/profile/Meghana-Prasanna"
                },
                {
                    "user_id": "Michele Stewart",
                    "user_href": "/profile/Michele-Stewart-2"
                },
                {
                    "user_id": "Scott Widen",
                    "user_href": "/profile/Scott-Widen"
                },
                {
                    "user_id": "Felicia Martinez",
                    "user_href": "/profile/Felicia-Martinez-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Pellarin",
                "href": "/profile/Jeff-Pellarin-1"
            },
            "answer_text": "There are no hacks.  But there are simple things that ANYONE can do, and form the foundation of anything.   1.  If you can make a cup of tea, you can make stock.  Stock is just tea, but instead of leaves there are chicken pieces (or even just bones), a carrot, an onion, and a celery stalk.  Add a couple of herbs, a few peppercorns, and a few garlic cloves.  Cook low and slow for a long time, strain, and you're done. 2.  There are a few techniques--only a few:  baking, steaming, boiling, frying (also known as grilling or broiling--those are just variations on the theme), and simmering.   (When you simmer with meat, it's called stew.)  So, try this:  brown some meat bits at a fairly high heat.  Take them out of the plan.  Slice and fry an onion (medium to low heat); then put the meat, the stock, and a few vegetables (potato chunks, carrot, celery).  Season as you'd like (cumin, hot pepper, black pepper, anise, whatever).  Low and slow.  When the meat can be broken apart with a fork, you're done.    You could cook for a month based on what I said there.  For instance, cooking salmon is just grilling or broiling it (like you did with the meat chunks above, except, not breaking it into chunks first).  Soup is just stew, usually without meat, and with more stock so it's less thick.  3.  Roast a whole chicken.  Just put it in a roasting pan (or even a large frying pan), and put it in the oven.  Put some herbs on it or in it; and some lemon wedges on it or in it.  Season (salt and pepper).  That's it. Oh, and if you've been led to believe cooking is a difficult craft, well, you've been lied to.  In those two preparations above, you've done 90% of what any cook will ever do in a kitchen.  The rest is just, learning to adjust seasonings as you go, learning when to pull the thing out of the oven (when is it \"done\"), etc.  You'll go wrong on those for a while (hint:  you can't unsalt something, so less is better at first; and you can't uncool something, so take it out of the oven too soon, cut in, and if it looks raw, back it goes.)  But really, that's it. ",
            "date": "Answered November 15, 2015",
            "views": "470",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "SHirsch",
                    "user_href": "/profile/SHirsch"
                }
            ]
        }
    ]
}