{
    "title": "What are the greatest contributions Japan has made to the world? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Taro Yamada",
                "href": "/profile/Taro-Yamada-40"
            },
            "answer_text": "Master Okawa Ryuho is first of all the greatest contribution that Japan has made or will make to the world. Here I will make the same post as many other posts of Quora about Master Okawa Ryuho . Many people don’t know Master Okawa Ryuho but in spite of all effort that the Japanese left-wing mass-media has made to screen Master Okawa Ryuho from the public , almost of the Japanese know the name of Master Okawa Ryuho . Master Okawa Ryuho is the most prominent religious and right-wing leader in the Japan and says that he is a Savior、 a Creator or a Supreme God named El Cantare in the heaven who is presiding everything about earth . Master Okawa Ryuho has done his missionary very peacefully for 32 years in the Japan , published 2300 books ( about 1300 in the Japanese) quoted from Books by Ryuho Okawa » Okawa Books , and has done 2500 lectures quoted from OR . According to Master Okawa Ryuho , as result of his long -years missionary the Japanese government and Japanese news-media accepted him as sacred existence like Messiah, To Americans, Chinese, and Koreans , my post sometimes contradicts your view. If so, excuse me. Master Okawa Ryuho defines the Imperial Japan (1868–1945) as hero . and endorses below things as the greatest contributions which Japan has made to the world. Since the Meiji Restoration(1868), from the first, as the Japanese were bitterly considering the colonialism and the white dominance , the Japanese wanted to challenge the League of the White Supremacy which the Western nations formed. At that time the Japan’s Manifest of Destiny was to abolish the colonialism and the racial discrimination , and on the other hand the America’s Manifest of Destiny was to preserve the White Supremacy .The Imperial Japan won the war against Russia in 1905, It was a first victory against the white nations done by the non-white nation . and a glazing delight and hope among the non white-nations. But as America felt it as vicious to the White Supremacy , America made a war -plan named Orange Plan in 1908 in which America must whip the Japan in the same way as the American whipped the African American or the Native American.The Imperial Japan proposed that it was absolutely necessary to include the abolishment of the colonialism and the racial discrimination into the Treaty of Paris Peace Conference after World War 1 and the majority of nations endorsed the proposal made by Japan. But as American President Woodrow Wilson felt it as vicious to the White Supremacy, the proposal made by Japan was rejected mainly by Wilson.The Imperial Japan colonized the Taiwan after the victory of the Japan-Quin war (1994) , annexed Korea (1912), and put Manchuria under the tributar(1933). As all of 3 nations were not in the modernized stage, Japan gave 3 nations a swift advancement of modernization by offering general education , an advanced health system to local people and shaping such good infrastructures as road, port, dam, electric power system, telegraph, and railwayDuring 1905 - 1945 the Imperial Japan protected China and Korea from ferocious Soviet and done a peace-keeping activity very successfully in China and Manchuria which was under the confusion and didn’t gain the integrity. According to Master Okawa Ryuho , the mass -atrocity of the Chinese civilians by Imperial Japan army or the Nanking-Massacre never happened .Master Okawa Ryuho defines the Imperial Japan (1868–1945) as a democracy nation. What was a reason that America started a war with Japan ? America represented the White Supremacy and Japan represented the abolishment of the colonialism and the racial discrimination . Master Okawa Ryuho defines Franklin Roosevelt as equivalence to the Satan due to the reason that Roosevelt played a important role in spreading the Communism all over the world with Joseph Stalin , the Soviet ruler.What was the greatest contributions Japan has made to the world?As result that the Imperial Japan fighted a brave fight against America, the world has had the abolishment of the colonialism and the racial discrimination .Non-white people can speak a opinion in the same way as white people.",
            "date": "Answered June 10, 2018",
            "views": "739",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Latta",
                "href": "/profile/Robert-Latta-5"
            },
            "answer_text": "What are the greatest contributions Japan has made to the world? I have completed thirty-eight years here in the Kansai (Kyoto-Osaka-Kobe) area. Offhand, I would say that the country is making its greatest contribution right now, in its example of a relatively peaceful, prosperous, harmonious, egalitarian society essentially free of religion. I can imagine no greater gift to the world. This is a huge topic difficult to summarize in just a few words, but I will do my best. Needless to say, Japan today is far from being a perfect society. Women are not treated fairly, drug use is emerging as a concern, and so on. Immanuel Kant made a remark to the effect that nothing straight has ever been crafted from the crooked timber of human nature, and that is of course true. Nevertheless, in my opinion Japan has done well recently, however much remains to be achieved. Yes, there are traces of religion here. To judge by what I have seen, a great deal, I think it is fair to put it that way. But Japanese society today is, first and foremost, irrefutable proof that religion is not necessary to human life. Those countries that attempt to establish this or that religion as the basis of society are thoroughly mistaken, and their miserable lack of success is additional proof, if any were needed. It is also an argument for an assumption that struck me as odd when I first encountered it. In the United States, the idea appears to be that the elite, educational and financial, deserves special attention, since it has the power to save society in general. Here in Japan, the idea is that the bottom of society deserves special attention, since it must not be allowed to sink too low. Recently I have come to the conclusion that the former assumption is fantasy, and the latter sound. It is also an argument for group spirit, and for dedication to one’s work as opposed to maximum personal gain. An English girlfriend remarked to me decades ago, “Here [in Japan], everybody simply does his best.” There are remarkably few exceptions. It is an argument for relative income equality, too, which of course accords with group spirit. The United States is making a horrific mistake, unfortunately one of many, in allowing, indeed aggressively promoting, runaway inequality. And it is an argument for doing all it takes to care for the children, however burdensome a task that proves to be, and not merely giving lip service to the concept in the abstract. The children I see here are invariably happy, firmly guided, and well-protected. The tiger-mama who insists on the best education possible for her children is no myth. Much of the success of Japanese society today stems from its relatively pervasive, though far from complete, uniformity, and consequent unity of spirit. You might draw the conclusion that the world’s peoples ought to segregate themselves and trade across the fences, as it were, but that is obviously both impractical and wrong-headed. The right conclusion, I think, is this: The world’s peoples must look past superficial factors like coloration, language, and local culture and peculiarities in general, and learn to achieve unity of spirit in view of their deep-set common humanity. It won’t be easy. It will be worth it. ",
            "date": "Answered January 9, 2018",
            "views": "25",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Linda Zachri",
                    "user_href": "/profile/Linda-Zachri"
                },
                {
                    "user_id": "Biswarup Ghosh",
                    "user_href": "/profile/Biswarup-Ghosh-18"
                },
                {
                    "user_id": "John Corbin Qian",
                    "user_href": "/profile/John-Corbin-Qian"
                },
                {
                    "user_id": "Clyde Lindsay",
                    "user_href": "/profile/Clyde-Lindsay"
                },
                {
                    "user_id": "Valar Morghulis",
                    "user_href": "/profile/Valar-Morghulis-177"
                },
                {
                    "user_id": "George Sawyer",
                    "user_href": "/profile/George-Sawyer-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tuan Nguyen",
                "href": "/profile/Tuan-Nguyen-355"
            },
            "answer_text": "Q. What are the greatest contributions Japan has made to the world? A. 5 Japanese innovations that changed the world Few places have done more than Japan to define today’s technological landscape. The laptops we all work from? Toshiba was the first to produce them for a mass market. The emoji you used in your last email? Also a Japanese invention. In fact, according to a Forbes analysis, Japan is home to almost 10% of the world’s most innovative companies. And yet Japan’s creative prowess is all too often overlooked, with most people instead focusing on places like Silicon Valley or Tel Aviv. As these five innovations show, that’s a mistake – Japan has given the world far more than karaoke, Pokémon and instant ramen noodles. Bullet train (1964)  Before the Hikari No. 1 was launched in October 1964, travelling by train between Tokyo and Osaka – Japan’s two largest cities – would take the best part of a working day. But with a top speed of 210 kph, the world’s first bullet train reduced the journey to 4 hours. Today, thanks to further technological developments, the trip takes just over 2 hours, soon to be reduced to around an hour.  Pocket calculator (1970) You’re out for dinner with a group of friends and the bill arrives. What’s the first thing you do? Grab your smartphone and head for the calculator app. This handy little tool has its origins in a Japanese invention: the pocket calculator.  The Sharp QT-8B You’d have needed enormous pockets to actually carry one around with you – the first models were instead designed to keep on your desk – but it was probably easier than lugging an abacus to the restaurant. Walkman (1979) Think the iPod revolutionized the music industry? Wrong. When Apple’s product hit the market in 2001, the revolution was already well under way, thanks to a Japanese invention that came decades earlier: Sony’s Walkman. Before the Walkman, the only way to listen to music on the go was by using a portable radio. The idea that you could pick your own tunes and listen to them everywhere would transform the music industry. “Mobility – the concept that you could take music with you – was huge,” Americus Reed of Wharton told AdWeek.  A 1980s Sony Walkman advert Blue LED light (early 1990s) In the early 1990s, three Japanese scientists – Isamu Akasaki, Hiroshi Amano and Shuji Nakamura – set off a lighting revolution when they managed to produce blue LED light from their semi-conductors. The discovery paved the way for energy-efficient TV, mobile and computer screens, and power-saving lightbulbs. It has been described as having the potential to revolutionize the 21st century, and the three scientists were awarded the 2014 Nobel Prize in Physics.  Nobel physics laureates 2014 Professor Shuji Nakamura, Professor Isamu Akasaki and Professor Hiroshi Amano Image: REUTERS/Janerik Henriksson Android robots (2003) Once limited to the realm of science fiction, androids – robots that look, speak and act like humans – are now very much a reality, thanks to Japanese inventors. In 2003, researchers from The Intelligent Robotics Lab at Osaka University unveiled the DER 01, the first all-talking, blinking and breathing, human-like robot. These robots are already transforming the country. In the summer of 2015, a hotel with an almost entirely robot personnel opened in Nagasaki. Two years earlier, Kirobo became the world’s first robot astronaut to speak in space.  10 Japanese inventions that changed the world (according to Chinese media)  Michelle Lynn Dinh Nov 27, 2013Japan has invented some pretty cool things; Mario, the Nissan Skyline, and PlayStation to name a few. Sure, sexy cars and even sexier game systems are great, but what would you choose as the truly exceptional Japanese inventions that influenced the world? Chinese media site, Xinhua Net News, weighed in on this question, giving us their top 10 list of most influential inventions from Japan. 10) DVDs  Image: Wikipedia Growing up, my family actually had a laser disc player and a decent collection of nearly 12-inch wide discs. When the whole family gathered to watch a movie, it was a sure thing that it would be interrupted halfway through and my sisters and I would have to fight over who had to flip the disc to continue on with the film. DVDs changed everything, providing enough capacity to fit an entire movie and then some. Blu-Rays have now nudged their way into the market, but it was the invention of the DVD back in 1995 that changed the way we store information and view movies at home. 9) Video Camera  Image: Wikipedia Where would America’s Funniest Home Videos be without the invention of the video camera? Thanks for the hours of entertainment, Japan, and for making some of life’s most embarrassing moments live on forever. 8) Digital Camera  Image: Wikipedia Sony came out with the first digital camera in 1981, and from that moment on, any and all seemingly precious memories were required to be documented for future embarrassment of one’s child. 7) Walkman  Image: Wikipedia That’s right, 1979 was the year of the Walkman, Sony’s game changing mobile music listening device. It was the iPod of the 80s and turned music into a private listening experience. 6) CD  Image: Wikipedia (http://en.wikipedia.org/wiki/File:Compact_disc.svg) Mixtapes are so 1987, it was all about the mixCD once they became widely available in the 1990s. It was Sony that first invented the CD, forever changing the way we listened to music. And although the use of CDs is on a steady decline in the digital age, that mixCD from 2002 I found in my closet will always have a place in my heart. 5) Karaoke  Image: Wikipedia You have Japan to thank for obnoxious drunks screaming “Living on a Prayer” at the top of their lungs. Yep, Karaoke is a Japanese invention, incorporating the word kara, or “empty,” and oke, a shortened version of “orchestra.” 4) Video Tape Recorder (VTR)  Image: Wikipedia Ah, the days when you’d record your favorite shows on a VHS tape and store them with sticky white labels declaring the titles of your pirated merch. The introduction of Sony’s Betamax in 1975 made it all possible. Now we’re on to DVDs and even Blu-Rays, but VTRs were all the rage in the 80s and in use up until the early 2000s. 3) Electronic Calculators  Image: Wikipedia Invented by Casio in 1957, the electronic calculator made quick addition possible and made math class infinitely easier (and in some cases less necessary). Once out of school, you never had to do long division on a piece of paper if you didn’t want to and you certainly didn’t have to memorize your times tables (curse you, sevens!). 2) Instant Ramen  Image: Wikipedia Who hasn’t had instant ramen at least once in their life? The college staple is actually a Japanese native, invented in cup form by Nissin Foods in 1971. Instant ramen comes in at number two on the list, second only to… 1) Electric Rice Cooker  Image: Panasonic What’s easier than cooking rice? In modern times, probably nothing thanks to the invention of the electric rice cooker in 1940 by Mitsubishi Electric. But before this awesome Japanese invention was born, skilled cooks would have to steam the precious staple on a stove (or in many cases a fire), hoping the grains didn’t burn or stick to the pot. So thanks for the perfectly cooked rice, Japan. Our sushi, donburi and curry applaud you. Source: Xinhua ",
            "date": "Answered January 8, 2018",
            "views": "48",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aparajita Kabir",
                    "user_href": "/profile/Aparajita-Kabir"
                },
                {
                    "user_id": "Pinesthi Mukti Rizky Wibowo",
                    "user_href": "/profile/Eky-7"
                },
                {
                    "user_id": "Sarvesh Nanjee",
                    "user_href": "/profile/Sarvesh-Nanjee"
                },
                {
                    "user_id": "William Lee",
                    "user_href": "/profile/William-Lee-720"
                },
                {
                    "user_id": "Saba Shaikh",
                    "user_href": "/profile/Saba-Shaikh-97"
                },
                {
                    "user_id": "David Chalpin",
                    "user_href": "/profile/David-Chalpin"
                },
                {
                    "user_id": "James Macdonald",
                    "user_href": "/profile/James-Macdonald-31"
                },
                {
                    "user_id": "Fred Schlimm",
                    "user_href": "/profile/Fred-Schlimm"
                },
                {
                    "user_id": "Laiba Ashraf",
                    "user_href": "/profile/Laiba-Ashraf-3"
                },
                {
                    "user_id": "Jonathan Buttall",
                    "user_href": "/profile/Jonathan-Buttall"
                },
                {
                    "user_id": "Supriya Verma",
                    "user_href": "/profile/Supriya-Verma-1"
                },
                {
                    "user_id": "Shenandoah Duraideivamani",
                    "user_href": "/profile/Shenandoah-Duraideivamani"
                },
                {
                    "user_id": "Karen Marie Shelton",
                    "user_href": "/profile/Karen-Marie-Shelton"
                },
                {
                    "user_id": "Maryam Mout",
                    "user_href": "/profile/Maryam-Mout"
                },
                {
                    "user_id": "Elizabeth Hopkins",
                    "user_href": "/profile/Elizabeth-Hopkins-9"
                },
                {
                    "user_id": "Kazuki Shimazaki",
                    "user_href": "/profile/Kazuki-Shimazaki"
                },
                {
                    "user_id": "Predrag Maksimovich",
                    "user_href": "/profile/Predrag-Maksimovich"
                },
                {
                    "user_id": "Mizumoto Kovia (水本 こびあ)",
                    "user_href": "/profile/Mizumoto-Kovia-水本-こびあ"
                },
                {
                    "user_id": "Valar Morghulis",
                    "user_href": "/profile/Valar-Morghulis-177"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wang Yangsheng",
                "href": "/profile/Wang-Yangsheng"
            },
            "answer_text": "Japan's traditional strength is manufacturing. The manufacture of high-quality products has long been considered a Japanese feature. At the same time, after decades of accumulation and careful study in Japan, coupled with its spirit of hard work, Japan has mastered some of the most advanced technologies in the world, based on manufacturing and advanced technologies, in certain areas. To ensure that Japan will continue to maintain its leading position in the economic field in the coming decades. Coupled with Japan's overall social environment is a virtuous circle of state, but also for its sustainable development provided a guarantee. In general, Japan holds the leading technology in the following fields. Superconducting technology: `Japan began to study the superconductor Shinkansen, it is estimated that the speed will reach 500 kilometers per hour. Strength companies include: Hitachi, Toshiba, Japanese vehicles, Mitsubishi Heavy Industries. Materials Technology: NEC, Toshiba, Hitachi, Furukawa Electric, Kobe Steel, Sumitomo Electric, Tokyo Electric Power, and so on; Nano Technologies: NEC, Hitachi; Next Generation DVD Technology: SONY; Toshiba; Next Generation DVD Technology: Hitachi; Flat Screen Technology: Canon, SONY, Futaba Electronics; Silicon Technology: Tokyo Microelectronics, MEMS: Mitsubishi Electric, Sharp, Panasonic Universe: Ishikawajima Harima Heavy Industries; Kawasaki Heavy Industries, Mitsubishi Heavy Industries; Toshiba, NEC, Mitsubishi Electric; In the traditional industries, the status quo of the world is as follows: Steel: The first company is Luxembourg, the second Dutch company, the third is Nippon Steel; the fourth is JFE Steel (Japan); China Baosteel ranked sixth (with Japan joint venture); Chemistry: Mitsubishi Chemical ranked fifth. The top four are the United States and Germany divided; Asahi Kasei ninth. Car: GM temporarily in the first, it is estimated will be the second Toyota over; Nissan eighth; Honda ninth; Household appliances: Top 15 Japan swept: Panasonic, Hitachi, Toshiba, Sharp, Mitsubishi Electric is the top five; Semiconductor: Hitachi and Mitsubishi joint venture semiconductor company ranked fourth, Intel topped the list; Communications: NTT champion. Generally believed that the new technology from research to maturity is a stage, from maturity to application is the second stage. The second phase of the time 10-15 years. In other words, if you want to apply a new technology now, it must be mature 10 years ago, otherwise it can not be applied. Japan is planning to build a superconducting Shinkansen, that is, his research on superconductivity has matured a decade ago. The mighty rival Japan faces in some areas remains the United States. Occasionally some European veteran companies lead in sales. For the foreseeable future, it will not be possible for China to become Japan's opponent because China is not worth mentioning both in traditional areas and in new technologies. All the above industries, based on the previous 15, can only see the name of a Chinese company: Baosteel, or a joint venture using Japanese technology. Ordinary Japanese eat medicine 1. Revenue and purchasing power Japanese fixed-monthly wages can generally be simple calculation, about how many years old can earn tens of thousands of yen per month, for example, 30-year-old to take 300,000 yen, 50-year-old to take 500,000 yen, plus summer and year-end twice A total of 2-5 months bonus. So 30-year-old income is generally 4.5 million yen, 40-year-old received 600 million yen, the above is the after-tax income, below this number is mixed well, higher than this number is a successful business. Taxes and insurance generally account for 10-20%, all of which are deducted from wages by the company or bank directly to the relevant departments. This summer award and the end of the year awards are very important, temporary workers did not, only regular workers have to do in a company longer and higher, buy a car and other basic rely on it. Temporary wages are generally 700-1000 yen / hour, working eight hours a day 26 days 26600 yen / month. Yen / RMB exchange rate changes larger, but generally can press 10,000 yen for 700 yuan. There is a most rough calculation is 100 dollars = 1000 yuan = 10000 yen. Japan now has hundreds of shops everywhere, daily necessities thousands of what are 100 yen, that is, 7 yuan in China, selling more than 10 yuan in China things such as tape measure, tools and so there is 100 yen. Vegetables and fruits in the supermarket are also one or a hundred yen. 10 eggs 10 yen 10 pounds of rice a thousand yen exception, the purchasing power of 100 yen and 1-7 yuan purchasing power is basically equal, that is to say in China 1-7 yuan can buy things in Japan You can buy with 100 yen. Monthly purchasing power means China monthly wage / price = 1500 yuan / 7 yuan = 214 pieces, Japan's 30-year-old worker's monthly wage / price = 300000 yen / 100 yen = 3000 pieces, daily purchasing power of China 214 pieces / 30 days = 7 pieces / Day, Japan 3000/30 days = 100 pieces / day. Conversely, understanding price / wage ratio is a day's wages in China can buy 7, Japan's day wages can buy 100. In addition to shopping outside the fresh vegetables are the family drove to, fruit, beer, snacks, etc. are all a box, to hundred yuan store is a large basket only a few thousand yen. Things are too cheap. We have to throw away a few boxes when we move home. We often receive material donations from foreigners or Japanese friends. After graduation, we often give something to them, including the color-TV refrigerator air conditioner car computer and so on. Other countries are basically like this, just go to someone else to give you something, a few years later you give something. I love traveling and been to many countries. Whether it is Southeast Asia, India, Europe, the United States or Australia, objectively compare prices / wages, and China's price / wage ratio is the most expensive in the world. You just need to count how many things you can buy a month's salary is enough. Everyone's salary rose 10 times, half the price of life is the current life of advanced countries. 2. Education Take care of the child government began to pay nutrition fees, to your house every day to send milk. Born directly to the municipal government to receive 300,000 yen to pay the hospital fee to buy all the baby supplies left tens of thousands. Kindergarten can be sent a month away, the government's government-run kindergarten costs about 1-3 million yen / month, private kindergarten costs about twice the public. Kindergarten is a part of social welfare, less income can apply for less or no pay. Primary to junior high school tuition is zero, the cost is lunch every day at noon about 3000 yen / month, one year to school all the payment is about 30000 yen, equivalent to 3 days salary. Moving from one city to another at a time, because textbooks are not the same, and all the textbooks for that school year received another set. High school is not compulsory education at the beginning, tuition is about 100,000 yen, 200,000 a year to fight it is less than a month's wages. Private university tuition about 1 million yen / year, National University tuition about 500,000 yen / year, there are various scholarships for student loans and so on. Almost all from kindergarten to university can apply for fee reductions, 3. Housing Japan's housing is expensive, but cities other than Tokyo are particularly expensive, with less than one-half the price in Tokyo. Ordinary 3 family living in an old house 3-5 million yen / month, I live in a medium-sized two-story villa in front of the garden after a garden monthly rent 70,000 yen. Ordinary workers mortgage to buy a house monthly pay 3-5 million yen for many 20 years, that is, lived for decades the house is their own. Ordinary 30-year-old white-collar 300,000 / month or 4.5 million / year 10-year salary can buy suites, but because of the tax control of mortgage consumption in addition to the discount, most of the mortgage. In addition to tax control is all you buy a house, buy a car, see a doctor and so the cost of control are only the remaining income tax control. 4. Medical The most important feature of Japanese medicine is that everyone joins National Health Insurance. National Health Insurance is divided into three levels, namely, the boss level, general level and family level, their own company or a very high income is the boss level, the vast majority of people are ordinary level, not working family and children from the parent's salary Paid, since adulthood must be paid separately. About a few thousand a month - tens of thousands of yen mainly according to how much to pay the income, go straight from the salary I have never worried about the specific number may be about 5%. Medical treatment must have a National Health Insurance card, medical expenses personally pay 10-20%, 80-90% out of insurance, too high, such as more than several times the wage can also apply for relief. ",
            "date": "Answered January 8, 2018",
            "views": "13",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Biswarup Ghosh",
                    "user_href": "/profile/Biswarup-Ghosh-18"
                },
                {
                    "user_id": "Fernsby Richmond",
                    "user_href": "/profile/Fernsby-Richmond"
                },
                {
                    "user_id": "Likhith Manjunath",
                    "user_href": "/profile/Likhith-Manjunath"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Fuchs",
                "href": "/profile/Peter-Fuchs-1"
            },
            "answer_text": "Well, I could say Aibo, the Sony robotic puppy; anime robot girls; more Ignoble Prize winners than anyone else (“banana peels really ARE slippery”); natto; SMAP; improvised flying suicide weapons and so on. But I want to see if I can come up with some more lasting, scientific ones. You know like electricity, Morse Code, Teflon, and velcro. One I know of is amazing - quantum tunnel diodes, by Nobel laureate Leo Esaki, which gives us advanced modern LEDs and solar power cells. The blue laser diode which gives us - hey, Blue Ray discs (sort of dated in the Netflix era) but massive throughput in optical cables - by Shuji Nakamura. “Umami” - the great taste sensation that gave birth to Ajinomoto, one of Japan’s food industry global champions; discovery of the amazing ability by living cells to do housecleaning, aka autophagy, by another Nobel laureate, Yoshinori Ohsumi. Stem-cells. Oh, and let’s not forget, the Steven Jobs of Japan, namely the late and great Akio Morita, co-founder of SONY. He imagined and invented NOT ONLY the first portable earphone music player, the WalkMan, but also the first ever digital camera, the MAVICA. I hope in Heaven he and Steve kept up their courteous rivalry. In engineering, composite materials, miniature electronic devices, there are dozens if not hundreds more. The stuff of Shinkansen bullet trains. The Prius. But let’s not forget sushi, sumo (and chanko-nabe), aikido, bunraku puppetry, the gorgeous and sexy Awa-odori dance from Tokushima, the geisha culture, and the otaku culture. Capsule hotels and love hotels. Cube-shape furo-bathtubs. Cheers. ",
            "date": "Answered May 28, 2018",
            "views": "624",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Iqbal Muhammad",
                    "user_href": "/profile/Iqbal-Muhammad-8"
                },
                {
                    "user_id": "Hithesh Mu",
                    "user_href": "/profile/Hithesh-Mu"
                },
                {
                    "user_id": "Nicolas Murakami",
                    "user_href": "/profile/Nicolas-Murakami"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joe James",
                "href": "/profile/Joe-James-69"
            },
            "answer_text": "Japanese cuisine: sushi, tonkatsu, tempura, soba, udon, ramen, miso, etc.Sake (rice wine)Robots - six of the world’s top 10 industrial robotics makers at Japanese.Consumer electronics - giants like Sony and Panasonic invented and popularized many electronics products including color TVs, Walkman, boombox, VCR, hand-held camcorder.Quartz watches were invented by Seiko in Japan.The DVD was invented in Japan.Martial arts: Japanese invented Aikido, jujitsu, karate and ninjutsu.Video games - Sony, Atari and Nintendo.QR codes were invented by Denso in Japan.Japan is probably the world’s leading producer of motorcycles, snowmobiles and outboard boat motors (Yamaha, Honda, Kawasaki)Optics - Canon, Nikon3D printing was invented in Japan in 1981.Toshiba invented Flash memory.Japanese bullet trainsJapan is a leading exporter of cars, computers, printers, cameras, steel, rubber, plastics, and ships.",
            "date": "Answered January 16, 2018",
            "views": "38",
            "upvotes": " View 26 Upvoters",
            "upvoters": [
                {
                    "user_id": "Biswarup Ghosh",
                    "user_href": "/profile/Biswarup-Ghosh-18"
                },
                {
                    "user_id": "William Lee",
                    "user_href": "/profile/William-Lee-720"
                },
                {
                    "user_id": "Rishi Kumar",
                    "user_href": "/profile/Rishi-Kumar-1629"
                },
                {
                    "user_id": "Revi Soekatno",
                    "user_href": "/profile/Revi-Soekatno"
                },
                {
                    "user_id": "Ricardo Yagüe",
                    "user_href": "/profile/Ricardo-Yagüe-1"
                },
                {
                    "user_id": "Noreen Relloso",
                    "user_href": "/profile/Noreen-Relloso"
                },
                {
                    "user_id": "Oviasif Ovihasan",
                    "user_href": "/profile/Oviasif-Ovihasan"
                },
                {
                    "user_id": "Virendra Singh",
                    "user_href": "/profile/Virendra-Singh-442"
                },
                {
                    "user_id": "Izz Danish",
                    "user_href": "/profile/Izz-Danish"
                },
                {
                    "user_id": "Violeta Boydon",
                    "user_href": "/profile/Violeta-Boydon"
                },
                {
                    "user_id": "Aman Kumar Parkar",
                    "user_href": "/profile/Aman-Kumar-Parkar"
                },
                {
                    "user_id": "Ryan Sachio",
                    "user_href": "/profile/Ryan-Sachio"
                },
                {
                    "user_id": "A Shinozuka",
                    "user_href": "/profile/A-Shinozuka"
                },
                {
                    "user_id": "Brian Ahanonu",
                    "user_href": "/profile/Brian-Ahanonu"
                },
                {
                    "user_id": "Simone Takahashi",
                    "user_href": "/profile/Simone-Takahashi"
                },
                {
                    "user_id": "Camila Araujo",
                    "user_href": "/profile/Camila-Araujo-11"
                },
                {
                    "user_id": "Lucas Lopes",
                    "user_href": "/profile/Lucas-Lopes-10"
                },
                {
                    "user_id": "Diamante Smith",
                    "user_href": "/profile/Diamante-Smith"
                },
                {
                    "user_id": "Sarah McCarthy-Clegg",
                    "user_href": "/profile/Sarah-McCarthy-Clegg"
                },
                {
                    "user_id": "Shubhashish Saha",
                    "user_href": "/profile/Shubhashish-Saha-4"
                },
                {
                    "user_id": "Howard Cortex",
                    "user_href": "/profile/Howard-Cortex"
                },
                {
                    "user_id": "Anindya Permata Widhi",
                    "user_href": "/profile/Anindya-Permata-Widhi"
                },
                {
                    "user_id": "Mario Caiti",
                    "user_href": "/profile/Mario-Caiti"
                },
                {
                    "user_id": "Stephen Reed",
                    "user_href": "/profile/Stephen-Reed-29"
                },
                {
                    "user_id": "Aditya Chugh",
                    "user_href": "/profile/Aditya-Chugh-1"
                },
                {
                    "user_id": "Phi Nguyen",
                    "user_href": "/profile/Phi-Nguyen-32"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sed Chapman",
                "href": "/profile/Sed-Chapman"
            },
            "answer_text": "I believe the greatest contribution Japan has made is not any technological innovation or product. Their greatest contribution is showing the world that a society can be organized in such a way that things work reasonably well. The place is clean, safe, the trains and busses run on time, the people are reasonably polite, the infrastructure is constantly being updated, the medical system is widely and fairly cheaply available. I could go on, but you get the point. Yes, yes there are cultural, historical, and geographic factors that make the “Japanese way” peculiar and not easily transferable to other countries. Not perfect by any means, and no utopia, nevertheless, Japan does show the world alternative possibilities of living. ",
            "date": "Answered June 9, 2018",
            "views": "54",
            "upvotes": " View 77 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alia",
                    "user_href": "/profile/Alia-321"
                },
                {
                    "user_id": "Rohit Khatri",
                    "user_href": "/profile/Rohit-Khatri-6"
                },
                {
                    "user_id": "Biswarup Ghosh",
                    "user_href": "/profile/Biswarup-Ghosh-18"
                },
                {
                    "user_id": "Masutani Hirotaka",
                    "user_href": "/profile/Masutani-Hirotaka"
                },
                {
                    "user_id": "Raja Singh",
                    "user_href": "/profile/Raja-Singh-1354"
                },
                {
                    "user_id": "Sarvesh Nanjee",
                    "user_href": "/profile/Sarvesh-Nanjee"
                },
                {
                    "user_id": "Yong Hao Tan",
                    "user_href": "/profile/Yong-Hao-Tan-1"
                },
                {
                    "user_id": "Matthew Crabb",
                    "user_href": "/profile/Matthew-Crabb"
                },
                {
                    "user_id": "Mansoor Mughal",
                    "user_href": "/profile/Mansoor-Mughal"
                },
                {
                    "user_id": "Cory Pendergraft",
                    "user_href": "/profile/Cory-Pendergraft"
                },
                {
                    "user_id": "Omkar Patil",
                    "user_href": "/profile/Omkar-Patil-19"
                },
                {
                    "user_id": "N. Robinson",
                    "user_href": "/profile/N-Robinson-9"
                },
                {
                    "user_id": "Listra Y. Ginting",
                    "user_href": "/profile/Listra-Y-Ginting"
                },
                {
                    "user_id": "J.M. Adams",
                    "user_href": "/profile/J-M-Adams"
                },
                {
                    "user_id": "Sean Cancino",
                    "user_href": "/profile/Sean-Cancino"
                },
                {
                    "user_id": "Lalantha Ponnamperuma",
                    "user_href": "/profile/Lalantha-Ponnamperuma"
                },
                {
                    "user_id": "Sumitra Potdar",
                    "user_href": "/profile/Sumitra-Potdar"
                },
                {
                    "user_id": "Eric Di Benedetto",
                    "user_href": "/profile/Eric-Di-Benedetto"
                },
                {
                    "user_id": "Leonard Adam Hard",
                    "user_href": "/profile/Leonard-Adam-Hard"
                },
                {
                    "user_id": "Siddharth Yadav",
                    "user_href": "/profile/Siddharth-Yadav-31"
                },
                {
                    "user_id": "Sravan Bandaru",
                    "user_href": "/profile/Sravan-Bandaru-1"
                },
                {
                    "user_id": "Karla Martinez",
                    "user_href": "/profile/Karla-Martinez-61"
                },
                {
                    "user_id": "Greg Schuler",
                    "user_href": "/profile/Greg-Schuler"
                },
                {
                    "user_id": "David W. Rudlin",
                    "user_href": "/profile/David-W-Rudlin"
                },
                {
                    "user_id": "Septimiu Catona",
                    "user_href": "/profile/Septimiu-Catona"
                },
                {
                    "user_id": "Vinícius Oliveira",
                    "user_href": "/profile/Vinícius-Oliveira-10"
                },
                {
                    "user_id": "Faezah Latif",
                    "user_href": "/profile/Faezah-Latif"
                },
                {
                    "user_id": "Akiko Macdonald",
                    "user_href": "/profile/Akiko-Macdonald"
                },
                {
                    "user_id": "Anthony Smith",
                    "user_href": "/profile/Anthony-Smith-1040"
                },
                {
                    "user_id": "Laszlo B. Tamas",
                    "user_href": "/profile/Laszlo-B.-Tamas"
                },
                {
                    "user_id": "Richard Emmert",
                    "user_href": "/profile/Richard-Emmert"
                },
                {
                    "user_id": "Todd Kuhns",
                    "user_href": "/profile/Todd-Kuhns"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Stray-Toaster"
                },
                {
                    "user_id": "Jared Meyer",
                    "user_href": "/profile/Jared-Meyer-12"
                },
                {
                    "user_id": "Troy Guze",
                    "user_href": "/profile/Troy-Guze"
                },
                {
                    "user_id": "Gratis Burbuja",
                    "user_href": "/profile/Gratis-Burbuja"
                },
                {
                    "user_id": "Tong Liang",
                    "user_href": "/profile/Tong-Liang-17"
                },
                {
                    "user_id": "Ramon Tomas",
                    "user_href": "/profile/Ramon-Tomas-1"
                },
                {
                    "user_id": "Shaun van der Linde",
                    "user_href": "/profile/Shaun-van-der-Linde"
                },
                {
                    "user_id": "Edgar Cooke",
                    "user_href": "/profile/Edgar-Cooke"
                },
                {
                    "user_id": "Seiji Sakurai",
                    "user_href": "/profile/Seiji-Sakurai"
                },
                {
                    "user_id": "Vyasa Krishna",
                    "user_href": "/profile/Vyasa-Krishna"
                },
                {
                    "user_id": "Cliff Worthington",
                    "user_href": "/profile/Cliff-Worthington"
                },
                {
                    "user_id": "Steve Martin",
                    "user_href": "/profile/Steve-Martin-223"
                },
                {
                    "user_id": "Matthew Sutton",
                    "user_href": "/profile/Matthew-Sutton-3"
                },
                {
                    "user_id": "Alan Wu",
                    "user_href": "/profile/Alan-Wu-13"
                },
                {
                    "user_id": "Beto Vazq",
                    "user_href": "/profile/Beto-Vazq"
                },
                {
                    "user_id": "Gregor Kikelj",
                    "user_href": "/profile/Gregor-Kikelj"
                },
                {
                    "user_id": "Ilan Elron",
                    "user_href": "/profile/Ilan-Elron"
                },
                {
                    "user_id": "Jonathan Beck",
                    "user_href": "/profile/Jonathan-Beck-11"
                },
                {
                    "user_id": "Jaanis Kruumins",
                    "user_href": "/profile/Jaanis-Kruumins"
                },
                {
                    "user_id": "Kiseki Hirakawa",
                    "user_href": "/profile/平川-奇跡-Kiseki-Hirakawa"
                },
                {
                    "user_id": "Vedant Sinha",
                    "user_href": "/profile/Vedant-Sinha-3"
                },
                {
                    "user_id": "Barry Co",
                    "user_href": "/profile/Barry-Co-1"
                },
                {
                    "user_id": "Judith Cotelle",
                    "user_href": "/profile/コテル-ジュディー-Judith-Cotelle"
                },
                {
                    "user_id": "Joe Myall",
                    "user_href": "/profile/Joe-Myall"
                },
                {
                    "user_id": "Bhavesh Aggarwal",
                    "user_href": "/profile/Bhavesh-Aggarwal"
                },
                {
                    "user_id": "James McLean",
                    "user_href": "/profile/James-McLean-1"
                },
                {
                    "user_id": "Stuart J Walton",
                    "user_href": "/profile/Stuart-J-Walton"
                },
                {
                    "user_id": "Phil Stilwell",
                    "user_href": "/profile/Phil-Stilwell"
                },
                {
                    "user_id": "Seiichi Nohara",
                    "user_href": "/profile/Seiichi-Nohara"
                },
                {
                    "user_id": "Riaan Engelbrecht",
                    "user_href": "/profile/Riaan-Engelbrecht"
                },
                {
                    "user_id": "Jaideep Tanwar",
                    "user_href": "/profile/Jaideep-Tanwar-2"
                },
                {
                    "user_id": "Mark Grinstein-Camacho",
                    "user_href": "/profile/Mark-Grinstein-Camacho"
                },
                {
                    "user_id": "George Sawyer",
                    "user_href": "/profile/George-Sawyer-1"
                },
                {
                    "user_id": "Rohit Dwivedula",
                    "user_href": "/profile/Rohit-Dwivedula"
                },
                {
                    "user_id": "Shravan Kruthick",
                    "user_href": "/profile/Shravan-Kruthick"
                },
                {
                    "user_id": "Edward Elric",
                    "user_href": "/profile/Edward-Elric-225"
                },
                {
                    "user_id": "Anne W Zahra",
                    "user_href": "/profile/Anne-W-Zahra"
                },
                {
                    "user_id": "Alvin Hovasapian",
                    "user_href": "/profile/ホヴァサピアン-アルヴィン-Alvin-Hovasapian"
                },
                {
                    "user_id": "Angelita Ola",
                    "user_href": "/profile/Angelita-Ola"
                },
                {
                    "user_id": "Reena Chauhan",
                    "user_href": "/profile/Reena-Chauhan-13"
                },
                {
                    "user_id": "David Farnell",
                    "user_href": "/profile/David-Farnell-1"
                },
                {
                    "user_id": "Nicolas Murakami",
                    "user_href": "/profile/Nicolas-Murakami"
                },
                {
                    "user_id": "Frank Seward",
                    "user_href": "/profile/Frank-Seward"
                },
                {
                    "user_id": "Dale Thomas",
                    "user_href": "/profile/トーマス-デール-Dale-Thomas"
                },
                {
                    "user_id": "Jae Starr",
                    "user_href": "/profile/Jae-Starr"
                }
            ]
        },
        {
            "author_info": {
                "name": "Imo Emah",
                "href": "/profile/Imo-Emah"
            },
            "answer_text": "Japan has offered so much to our modern world that there's a Wikipedia page for it. But besides all those wonderful contributions, my pick would be this:  Puella Magi Madoka Magica. I know you're probably thinking “Seriously?” but there's a story behind I put this here. This was recommended to me by a senior resident in Emergency medicine when I was working/studying there as an exchange student. I took one look at it and thought “WTF is this?” but reserved my comments since I had a lot of respect for the man. Three years passed before I finally watched it. Three years later and I'm still reeling. No words can truly express how I feel about this work of art. Miyazaki is great and all but this… this took all my expectations, pulverised them and served them back to me as pressed juice. My attitude towards books, movies and any other form of storytelling hasn't been the same ever since. That's why, to me, this is the greatest thing that has come out of Japan. ",
            "date": "Updated January 23, 2018",
            "views": "617",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kisuke Urahara",
                    "user_href": "/profile/Kisuke-Urahara-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tim Chang",
                "href": "/profile/Tim-Chang-42"
            },
            "answer_text": "There are too many to choose from, but as a kid I would have answered:  It’s a childhood classic, everyone loves this movie. And of course:  Such a great game, and the theme song is so iconic. And lastly, I would go for:  Not just for the cars they make that get billions of people from A to B everyday, but because their philosophies have changed the way the modern manufacturing industry operates. Toyota pioneered the concept of Lean Manufacturing (aka the Toyota Production System) in the 1950’s, a concept that aims to minimise waste and maximise output. This not only allowed Toyota to catch up to Ford but overtake it in quality, cost and delivery. Today, nearly all manufacturing industries, not just automotive, adopt aspects of the Toyota Production System to make their products. Everything we use is made with some Lean Manufacturing practices in the production process. And this for me is Japan’s biggest contribution to the modern world. ",
            "date": "Answered January 8, 2018",
            "views": "532",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Clyde Lindsay",
                    "user_href": "/profile/Clyde-Lindsay"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tristen Lee",
                "href": "/profile/Tristen-Lee-9"
            },
            "answer_text": "I lived in Japan for 3 years. I also took karate for 3 years. For those of you who don’t know, Karate is a martial art from the Ryukyu Island Chain, where I lived. It is an art of discipline and peace, though it is not always used in such a way. I think sharing this art with the world has brought the world a great new experience. Today it is a major sport and can even be found in the Olympics. ",
            "date": "Answered May 28, 2018",
            "views": "97",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Piyush Chandan",
                    "user_href": "/profile/Piyush-Chandan-9"
                }
            ]
        }
    ]
}