{
    "title": "What are your hacks for eating healthy without trying? - Quora",
    "tags": [
        "Healthy Eating and Living",
        "Healthy Living",
        "Tips and Hacks for Everyday Life",
        "Eating",
        "Healthy Eating",
        "Nutrition",
        "Food",
        "Health"
    ],
    "response": [
        {
            "author_info": {
                "name": "Suzanne Ubick",
                "href": "/profile/Suzanne-Ubick"
            },
            "answer_text": "Thank you for the A2A, Rachel. My most important personal hack is that I simply don’t buy foods I don’t consider healthful. Dr. Rangan Chatterjee says that our external environment is a nutritional minefield, so it’s vitally important to keep our home environment safe. If I don’t buy them, these undesirable foods aren’t at hand and I can’t eat them! I find it very hard to resist crunchy starchy foods (potato crisps, veggie sticks, tortilla chips, cookies…). I’ll go for salty and crunchy over sweet and crunchy. I once ate a whole big bag of Flaming Hot Cheetos on the 4-block walk from the shop to my house. It’s as if I completely lose consciousness of what I’m doing, so I just do not buy them. I make tasty meals that are vegetable heavy. The website The Doctor’s Kitchen is a great source of recipes. As I can’t eat fish, shellfish, nuts, legumes, and bananas, I simply substitute meat for these ingredients. Because these meals are absolutely scrumptious, I have no desire to stray. Home | The Doctor's Kitchen Rangan Chatterjee suggests two hacks that I took to my heart: eat a rainbow every day and eat the alphabet every month, in vegetables and fruits. Limit fruits to two servings day and aim for five vegetables. Dr. Chatterjee publishes very interesting podcasts on YouTube. The first one I heard was How to make diseases disappear. His BBC programme, Doctor in the House, is also on YouTube and very well worth watching. I make it easy to prepare good foods at home. I shamelessly buy large bags of frozen vegetables; they don’t have the sensory appeal of fresh produce, but their availability and ready-to-cook state do away with any excuses. I also buy Safeways’s 1-lb containers of ready-washed organic spring mix. It’s good for quick dishes as well as salad. I can sauté a cupful in a flash and use them to fill a breakfast omelet. Very lightly braised, they make a good bed for a meal. My priority foods are whole: apples instead of apple pie, oranges instead of juice, plain pasta instead of frozen lasagna or a box of mac’n’cheese. I prepare multiple servings of dishes. I double a frittata recipe, so we have several breakfasts or packed lunches. A slowcooker-ful of curry is portioned and frozen. There’s always something healthy, delicious, and ready to eat. I read labels on prepared foods, like pasta sauce (very easy to make at home but sometimes convenience…). If there are more than five ingredients, or more than 5 grams of sugar per serving, I don’t buy it. If it looks like the contents of a chemistry lab, I don’t buy it. We buy only high-quality artisan bread - supermarket versions can be seriously scary! When I bake cookies and cakes, I cut the sugar in the recipe by half, and I make only a small quantity. We eat and enjoy the treat, and there’s nothing sitting around to tempt us. My husband loves burgers with fries. Once a month we go out for his treat. We split one order of fries. I get a burger patty with no goops, with the lettuce and tomato on the side. He gets the full-house version. He’s slim and healthy so it does him no harm to have the odd splurge. I hate soggy foods, and those gluey burger buns turn my stomach so I won’t eat them. We seldom eat out. We go out now and then for icecream - also once a month. One small scoop each, high quality gelato. We do not buy tubs of ice cream unless we’re having a party. If I really want a salty crispy junk food, we go out(it’s just my husband and me), buy one small bag, and split it. I drink water. I have a glassful when I first get up, and another before my morning coffee. I drink a glassful mid morning, mid afternoon, before lunch and when I get home from work. Good hydration keeps things ticking over very nicely. I like black tea, and have about three cups a day. I have it with milk, no sugar. I eat plain whole milk live culture yogurt and kefir daily - my gut microbiome loves them. If I’m cooking rice, pasta, or white potatoes, I put some fat in the cooking water (olive oil or butter) and let the food get cold after it’s cooked. I reheat it before we eat it. This makes the starch resistant, providing excellent prebiotic for gut bacteria. I have mental lists of good, okay, and bad foods - and I don’t care what the “experts” say about not labeling foods! Soda, sugary juices, cold cereals and sugary yogurts are beyond bad. Sweet potatoes are good, white potatoes are okay. Fresh meat is good, most weiners are bad (label-reading). My food choices might not suit everyone. My health hacks keep me slim, my blood pressure is low, my fasting glucose is good, my HDL is high, my triglycerides are low, and my cholesterol ratios are excellent. ",
            "date": "Answered May 24, 2019",
            "views": "822",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Di Vitale",
                    "user_href": "/profile/Di-Vitale"
                },
                {
                    "user_id": "Atharv Sowany",
                    "user_href": "/profile/Atharv-Sowany"
                },
                {
                    "user_id": "Jen Burns",
                    "user_href": "/profile/Jen-Burns-12"
                },
                {
                    "user_id": "Rachel Cheng",
                    "user_href": "/profile/Rachel-Cheng-41"
                },
                {
                    "user_id": "Jazz Francesca",
                    "user_href": "/profile/Jazz-Francesca"
                }
            ]
        },
        {
            "author_info": {
                "name": "Beth Hee",
                "href": "/profile/Beth-Hee"
            },
            "answer_text": "As a bodybuilder with a wheat allergy, my tips are to stay away from gluten, time your complex carb sources and avoid added sugar and follow the 80/20 rule. The first thing I do is think about my protein source. I eat a small, healthy portion with each meal and build the rest of my food choices around it. I usually eat this on prep:  This is a white fish, with some spinach and zucchini sautéed with a dash of hot sauce and Bragg’s Aminos added in for flavor. It is simple yet super nourishing and comforting. I love eating simple 3–4 ingredient meals like this. Rice cakes, brown rice, oats or another complex carb like potatoes are also eaten around training and breakfast time. My trainer/coach currently tells me what to eat but that is confidential so I won’t share it today.  We went out to celebrate a friend’s birthday so I ordered off the menu. It was a cheat meal that I get to indulge in weekly but I still stick to foods that will agree with me. I like a lot of variety of tastes and textures that’s why I ordered the house salad with dressing on the side.  This is a hangar steak and I ate half the portion. Notice I did not order a side of noodles. I didn’t drink alcohol so this was a nice and light meal for me.  If I want to snack, I find the equivalent, healthier version. These chips are delicious with only 140 calories, 18 grams of protein and 4 grams of carbs. You can buy them on Amazon. It’s all about portion control. Halo top, non dairy ice cream, is also amazing! Most major grocery store chains sell it. A lot of ice cream companies are also jumping on the bandwagon and are making healthier ice cream and putting the total calories right on the pint.  When you eat out, eggs are also an easy go to. Protein, fat and veggies made this very satisfying. But I also eat eggs and egg whites almost every morning. It fuels me for the whole day.  You can never go wrong with salmon either. It has so many healthy omega 3s, is nutrient dense and is so filling. A side of asparagus goes perfect with this entree. Eat clean most of the time but also enjoy a treat here and there. Eat healthier versions of your favorite comfort foods. Look for gluten free, protein added, no sugar added foods. Fruit for dessert is great. Don’t stress, life is short! ",
            "date": "Answered May 19, 2019",
            "views": "72",
            "upvotes": " View 23 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Reginald Lane",
                    "user_href": "/profile/Reginald-Lane-7"
                },
                {
                    "user_id": "Denise Dennison",
                    "user_href": "/profile/Denise-Dennison-3"
                },
                {
                    "user_id": "Joy Kilburn",
                    "user_href": "/profile/Joy-Kilburn-1"
                },
                {
                    "user_id": "Erii Mascar",
                    "user_href": "/profile/Erii-Mascar"
                },
                {
                    "user_id": "Despina Belle-Isle",
                    "user_href": "/profile/Despina-Belle-Isle"
                },
                {
                    "user_id": "Rahul Gupta",
                    "user_href": "/profile/Rahul-Gupta-721"
                },
                {
                    "user_id": "Anoopa John",
                    "user_href": "/profile/Anoopa-John-1"
                },
                {
                    "user_id": "Bassem Aljifri",
                    "user_href": "/profile/Bassem-Aljifri"
                },
                {
                    "user_id": "Rosa S Ramos",
                    "user_href": "/profile/Rosa-S-Ramos"
                },
                {
                    "user_id": "Jonathan Mamo",
                    "user_href": "/profile/Jonathan-Mamo"
                }
            ]
        }
    ]
}