{
    "title": "What happens when a condenser loses its vacuum? - Quora",
    "tags": [
        "Condenser",
        "Vacuum (space)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carl Willis",
                "href": "/profile/Carl-Willis-2"
            },
            "answer_text": "I presume the question relates to power plant engineering, where it is common to find condensing steam turbines that power electric generators. The condenser pressure situation is best explained while referring to a T-s diagram (see below). Assuming that the turbine is supplied with saturated steam, the turbine’s operation is represented by the nearly isentropic expansion curve from point 3 to 4, while the condenser’s function is the isotherm-isobar 4–1 (actual values are not important; I borrowed the image from the Wikimedia commons). Heat into the cycle is given by the integral (area under the curve) of path 2–3, representing heating and boiling of the working fluid, and waste heat out of the cycle is given by the integral of path 4–1, the condensation process. It is clear that the best thermal efficiency is achieved when the area under the condensation process is as small as possible, and that this occurs at low temperatures and corresponding pressures. This is the reason to use a vacuum condenser in a power plant. If you were to condense the turbine exhaust at the unmarked teal isobar rather than the 0.06-bar isobar in the drawing, the cost in efficiency is evident. The condenser temperature would rise substantially, and its ability to reject the increased heat load to the environmental heat sink would depend on its design and ratings. In all likelihood, the condenser would not be able to handle this heat load, and protective process monitors would trip the turbine. If such a safety system were to fail, or not be present, a loss-of-heatsink accident scenario would unfold.  ",
            "date": "Answered July 28, 2017",
            "views": "48",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Naveed Aslam",
                    "user_href": "/profile/Naveed-Aslam-52"
                },
                {
                    "user_id": "Sourav Bhattacharjee",
                    "user_href": "/profile/Sourav-Bhattacharjee-89"
                },
                {
                    "user_id": "Nikunj Patel",
                    "user_href": "/profile/Nikunj-Patel-56"
                },
                {
                    "user_id": "Mac Carlos",
                    "user_href": "/profile/Mac-Carlos-1"
                },
                {
                    "user_id": "Milind Ahirkar",
                    "user_href": "/profile/Milind-Ahirkar"
                },
                {
                    "user_id": "Fakhar Us-Salam",
                    "user_href": "/profile/Fakhar-Us-Salam"
                },
                {
                    "user_id": "Mikhail Gambarian",
                    "user_href": "/profile/Mikhail-Gambarian-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jacob Vadakkel",
                "href": "/profile/Jacob-Vadakkel"
            },
            "answer_text": "The turbine will slower its speed and chances are more that the FIXED BLADE and MOVING BLADE will collide…… and there will b a blast………. ",
            "date": "Answered May 7, 2017",
            "views": "771",
            "upvotes": "0"
        }
    ]
}