{
    "title": "What are the similarities between guidance and counselling? - Quora",
    "tags": [
        "Guidance"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rida Zahid",
                "href": "/profile/Rida-Zahid"
            },
            "answer_text": "Guidance is a non-directive way of advising someone for better. Its in general environment, like guidance could come from anyone i.e. parents, grandparents, peer, siblings. Its like a quick response of something you do or ask them, they quickly guide you through it. Counseling is a whole different procedure consisting of steps. Its like a counselor walks you through the difficulties that you face. He/she keeps up with you practically and give you step by step schedule to reach the goal of your therapy. Its like a therapy, can only be done by a degree holder and experienced person. and its not one time thing, its like extracting the negative stuff from you and throwing it our through a series of steps. ",
            "date": "Answered May 21, 2018",
            "views": "89",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brian Sanene",
                    "user_href": "/profile/Brian-Sanene"
                },
                {
                    "user_id": "Vikram Bajaj",
                    "user_href": "/profile/Vikram-Bajaj-14"
                },
                {
                    "user_id": "Nna Blessing",
                    "user_href": "/profile/Nna-Blessing-1"
                },
                {
                    "user_id": "Sir Rich",
                    "user_href": "/profile/Sir-Rich-2"
                },
                {
                    "user_id": "Benedicta Eghan",
                    "user_href": "/profile/Benedicta-Eghan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alain Delon",
                "href": "/profile/Alain-Delon-6"
            },
            "answer_text": "Guidance and counseling both allows the client to think through of his situation. They also both lead the client to seek and find their best possible options. However, the person who guides the person in “guidance” assist him through balancing the pros and cons of all the possible solutions with him and arrive at the best options. While in counseling, the person is assisted by allowing him to balance these options based on his perspective with advice-giving from the counselor. The guidance counselor is active in both but more in guidance as he “guides” the person. Counseling is more of advice-giving but allows the client to have more freedom to make his own decision. ",
            "date": "Answered January 30, 2020",
            "views": "55",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Brian Sanene",
                    "user_href": "/profile/Brian-Sanene"
                },
                {
                    "user_id": "Vikram Bajaj",
                    "user_href": "/profile/Vikram-Bajaj-14"
                },
                {
                    "user_id": "FRANCIS WISTON",
                    "user_href": "/profile/FRANCIS-WISTON"
                },
                {
                    "user_id": "Namonda Muhosho",
                    "user_href": "/profile/Namonda-Muhosho-2"
                },
                {
                    "user_id": "Deus Martine",
                    "user_href": "/profile/Deus-Martine"
                },
                {
                    "user_id": "Don Bee",
                    "user_href": "/profile/Don-Bee-16"
                },
                {
                    "user_id": "Palesa Mokheseng",
                    "user_href": "/profile/Palesa-Mokheseng-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Drema Dial",
                "href": "/profile/Drema-Dial"
            },
            "answer_text": "I see guidance as taking more of a mentoring role. Advising on steps to be taken, best practices, how to become more of a leader/learner, etc It’s having someone more experienced than you available to help you when you have questions or don’t know what to do. Counseling is more about learning about yourself with the help of a skilled therapist. It usually involves talking about your past so that you can better understand your behavior in the present. ",
            "date": "Answered March 3, 2018",
            "views": "38",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vikram Bajaj",
                    "user_href": "/profile/Vikram-Bajaj-14"
                },
                {
                    "user_id": "Catherine B Smith",
                    "user_href": "/profile/Catherine-B-Smith"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lindsey Wickman",
                "href": "/profile/Lindsey-Wickman-2"
            },
            "answer_text": "counseling you vent pretty much and a guidance counselor will give you ideas how to solve your problems you are venting about and help you find solutions to not have them as problems anymore. ",
            "date": "Answered December 26, 2018",
            "views": "544",
            "upvotes": "0"
        }
    ]
}