{
    "title": "What are some examples of genetic traits? - Quora",
    "tags": [
        "Traits and Attributes",
        "Genetic Engineering",
        "Personality Traits and Characteristics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Naomi Tickle",
                "href": "/profile/Naomi-Tickle"
            },
            "answer_text": "Most of our traits are genetic, however the environment can suppress or support them. At the time of birth you can see if someone is a writer, artist, detailed, perfectionist, tolerant, bottom line, analytical, creative, design, bored by repetition, love of history plus many more traits. Once the child has passed puberty, all the traits are fully formed. When I look at someone’s face I see the potential that is there. So many students leave school or college and are still lost. They’ve taken all the tests and nothing ignites their interest. Or they’ve received so many critical comments from family and friends that they loose faith in themselves. The structure of the face is a guide to our inner blue print. Not only does it reflect our innate strengths and challenges, it also indicates how we communicate. Knowing more about the people we interact with, helps us to better understand and communicate with each other. Once you have the knowledge, all it takes is a glance at the face. Yes, this applies across all cultures. There is no trait linked with any one culture. I work with clients from all over the world helping them find their path in life. This can be determined from photo’s or in person. To learn more watch the video on my website, which is my name. ",
            "date": "Answered June 20, 2017",
            "views": "525",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard Bussell",
                "href": "/profile/Richard-Bussell"
            },
            "answer_text": "For starters, just look at the people around you. Tall, really tall, medium height, short, blondes, brunettes, redheads, people with black hair. Then there’s blue eyes, black eyes, brown eyes. Round faces, more elongated faces, and so many more… ",
            "date": "Answered June 20, 2017",
            "views": "33",
            "upvotes": "0"
        }
    ]
}