{
    "title": "What is organic industrial waste? - Quora",
    "tags": [
        "Organic Food",
        "Waste Materials"
    ],
    "response": [
        {
            "author_info": {
                "name": "Craig Spelch",
                "href": "/profile/Craig-Spelch"
            },
            "answer_text": "Organic industrial waste includes a number of organic materials obtained from industrial and commercial operation.Organic industrial wastes, either liquid or solid, are a good substrate for biogas generation by making usage of anaerobic digestion process. Anaerobic digestion of organic industrial waste is fast gaining popularity worldwide. Many industries produce liquid and solid wastes that are suitable for anaerobic digestion, such as food processing, pharmaceuticals, organic chemicals, paper manufacturing and tannery industries. Making use of biogas technology for wastewater treatment is increasing rapidly for industrial wastewater treatment. There are numerous of vendor-supplied systems in operation or under construction throughout the world. Over 30 forms of industry have been identified as having wastewaters amenable to anaerobic digestion treatment, including processors of beverages, chemicals, food, meat, milk, pulp and paper, and pharmaceutics. Some of the wastes might be difficult to digest as a sole substrate, however they can be biochemically degraded in combination with manure or sewage sludge. The combined digestion of different wastes is called co-digestion. ",
            "date": "Answered July 20, 2016",
            "views": "650",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alex Cio",
                    "user_href": "/profile/Alex-Cio"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Kotsch",
                "href": "/profile/John-Kotsch"
            },
            "answer_text": "I have two examples from the same source of industrial organic waste (IOW) that after distribution becomes Municipal Organic Waste.  Newspaper print and the ink for the paper need to be disposed at your Newspaper Production plant and then picked up and recycled from your neighbor’s waste stream.  The beginning of the next days newspaper run will start with a few hundred or more wasted copies of the newspaper as the register is adjusted and the color plates are adjusted to perfect the onlay of the various color layers to produce full color ads. The paper is wood based  and is produced with the addition of recycled newspapers.  The recycled product printed with  soy  based ink allows for complete aerobic composting or recycling. OIW is any product added to the waste stream including that which is disposed of at food prep and processing plants, agriculture and  soft-scape waste, chipped wood from tree disposal and any plant waste from new development.  Much can be recycled, and all can be composted.  It does not include any organic compounds that are labeled hazardous. ",
            "date": "Answered July 25, 2016",
            "views": "537",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/RACHNA-MISHRA-40"
                }
            ]
        }
    ]
}