{
    "title": "What change in energy happens when water droplets condense on the outside of a cup that holds a cool drink? - Quora",
    "tags": [
        "Water Droplets",
        "Condensation",
        "Properties of Water",
        "Drinking Water"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Osaade",
                "href": "/profile/Peter-Osaade"
            },
            "answer_text": "In this case, only heat is transferred. Confused? Let me explain. The cool drink inside the cup is at a lower temperature than the surrounding air. Thus a thermal (heat) imbalance exists. Now, a thermal body (something that has heat or a lack of it) and its surroundings, which are not of the same temperature will continue to transfer heat between each other (from the hotter body to the colder one) until they are both at the same temperature (thermal equilibrium). Since we are talking about a cool drink here, it means the surroundings of the cup (air) is warmer. So at the interface of the cool and warm bodies i.e. the outside of the cup, there will be a transfer of heat from the warm air in surroundings of the cup to the cooler outer surface of the cup. On losing heat to the cooler surface of the cup, the air (along with the humidity it contains) cools down at the surface of the cup. This cooling down of the surrounding air and its humidity (water vapour) brings the molecules of the water vapour closer (substances, including gases, expand upon heating and contract upon cooling) to each other, allowing them to form the tiny droplets seen on the outside of the cool cup. Again, only heat is transferred. In addition, this process of heat transfer is responsible for the condensation seen on car windshields on cold days (the inside of the car is warmer and the outside is cooler). ",
            "date": "Answered February 7, 2018",
            "views": "673",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mike Hulse",
                "href": "/profile/Mike-Hulse-1"
            },
            "answer_text": "When water vapor condenses it adds heat to the wall of the cup. That same energy passes through the cup and into the drink. If there are ice cubes floating in the drink, the heat from the cup melts some of the ice. Once all the ice is melted, then continued heat from the cup wall raises the temperature of the drink. For water, the heat of vaporization is 540 calories per gram, and the heat of fusion is only 80 cal/gram. This means that one gram of condensate on the cup can melt nearly seven grams of ice. This is not the only heat transfer going on in the example. Warm air molecules also add heat to the cup, and if it’s sitting in the sunlight, the cup receives radiant heat from the sun. In addition, there are similar transactions going on between the liquid surface of the open cup and the air above it. The liquid surface is also condensing water from the air, but you don’t see it because the condensate mixes into the drink. If you could measure the temperatures of the various components with enough accuracy, they would fall in this order, with highest temperature listed first: ambient air temperature, condensate droplets, external wall of the cup, internal wall of the cup, liquid in the cup, ice in the liquid. ",
            "date": "Answered February 7, 2018",
            "views": "673",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jeff Hawkins",
                    "user_href": "/profile/Jeff-Hawkins-1"
                }
            ]
        }
    ]
}