{
    "title": "What is the most evil invention ever created by humanity? - Quora",
    "tags": [
        "Invention and Inventions",
        "Weapons",
        "The Human Race and Condition"
    ],
    "response": [
        {
            "author_info": {
                "name": "Miyaten Meiritsu",
                "href": "/profile/Miyaten-Meiritsu"
            },
            "answer_text": "A lot of them. In fact, most of them aren’t even tangible. I’ll put a nice list to express my view... in my own definition of “evil”. I didn’t intend to offend anyone, but really, evil pays better, and guess who’s the most evil guy in your room? Tribalism : Funnily enough, the most evil thing humans had ever invented was made back when humans haven’t even discovered fire yet, and already it is the very evil that kept our whole human race alive all along. But when civilizations started to meet each other, soon enough they think they’re the master race just because they can cross the sea before anyone else figured it out. You know the rest, as slavery and racial divide become rampant in the name of white men’s burden and other such nonsense. The sheer scale of the racial superiority humans can express makes Adolf Hitler looks like a saint in comparison to the whole world put together.Communism : A stupid and unrealizable dream, at least not realizable in our mortal realm, that’s what it is. Because someone must be at the top of the whole system, when they goes corrupt, as power does that to almost anyone, the nation that practices that goes nowhere but down. China is about the only nation that claimed to be Communist that is not evil… in the sense of actually care about their citizens’s wealth, but that’s not saying much, cuz we all know China and USA are “evil”. It’s kinda necessary if you wanna be big. Being evil, that is.Democracy : Democracy coincides with the interest of more people, but it is a double edged sword that Socrates quickly catch up on its consequences, but somehow Americans have decided that it’s the best thing ever despite its increasingly visible flaws in its implementation, if only in order to maintain a sensible-looking mask of pro-citizens government to avoid a French Revolution. I mean, we got more prosperous nation and more informed people, but that haven’t stopped people from trying to subvert it. We got miracles from democracy sometimes, but without evil, where would democracy go? A childish dream at the same yet different league with communism, that’s what. And where did America go with it? Plutocracy. Apparently the rich has more voice than millions of citizens combined and should stay rich forever like a modern feudal system. Oops.Copyright: Apparently entertainment is such a fickle thing that it needed patents all on its own. The gentleman in the last century are so concerned about their paycheck that they invited some dollar-eyed mafias to publish things for them. Come a century later and these same mafias says that downloading free media that they arbitrarily copyrighted are the same as downloading communism, but really, communism from the Internet is less evil than the media mafias limiting our experience.Gunpowder : Originally made by accident in pursuit for a potion of immortality. Then Mongols traded that away to bloodthirsty Europeans who live in a kill-or-be-killed game of thrones world, who proceeded to merrily built the boomstick they used to shoot anything they don’t like to extinction. They also accidentally bred the biological weapons that killed off most of the native Americans too, but nobody at that time knew about this.Fiat Currency : Sly way to make the world go round in your palms, it seems. We fixed US dollar to gold, but then took that pesky gold standard away and printed absurd amount of money to buy some damned pointless stuff. And a good portion of it was embezzled by immoral rich devils.And now for something totally physical: Project Pluto. That is all.Project Pluto - WikipediaTake a nuclear bomber and strap a nuclear ramjet on it and lo, behold, the child of Legion of The Death Star to behold, death offerings for the Rulers of the Underworld, built under the trust in the Lord (or Jewish Science?). I dunno what mad science of logic or mysteries that led the land of the free to concoct this death-ridden craft straight from the corpse of a death-ridden black hole that was once a blinding superstar, brighter than any stars we could ever produce in any sense of word. But one thing is certain: once it took flight, it would herald the Apocalypse as it flies as an unstoppable phoenix of death and destruction… But at least this thing never existed, unlike hundreds of peacekeeping ICBMs that will kill us all if anyone pressed it.",
            "date": "Answered September 7, 2018",
            "views": "691",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yike Zhao",
                    "user_href": "/profile/Yike-Zhao-2"
                },
                {
                    "user_id": "Fred N",
                    "user_href": "/profile/Fred-N-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bruce Kain Martin",
                "href": "/profile/Bruce-Kain-Martin"
            },
            "answer_text": "The hand gun. Humans are separated from other species in the animal kingdom, largely by our ability to make tools. Tools can be thought of as any device that provides utility for fulfilling a human desire or need. The invention of gun powder gave rise to the rifle: a tool of significant utility. Humans cannot compete in combat with other apex predators absent tools to gain advantage. Spears, clubs, knives, snares, traps; all have been useful for humans in their confrontations with large, dangerous animals. Rifles proved the ultimate tool for hunting large prey and protection from apex predators. Before the invention of the rifle, packs of wolves, sometimes in numbers greater than thirty individuals, ruled the night, whereever the habitat spawned them. In 18th century Russia it was highly hazardous to venture out at night because large packs of wolves routinely tore humans apart enroute. The rifle allowed for the culling of large wolf packs and therefore mitigating the threat such packs posed to our safety. Rifles also proved useful for hunting large animals suitable for eating. But hand guns serve no such purpose.. Their sole utility is to kill other human beings in close combat. They are much less accurate at the distances often required to hunt large prey. Hand guns are , as I call them, Human Being Killing Machines. They automate the dispensing of another human being, and thats about all they are good for. While it unfortunately, on occasion, becomes necessary to forge into battle, war is, more often than not a gross misuse of manpower and resources. Most wars end with the parties involved finally sitting down together to work out the terms under which they will coexist peacefully in the future. In other words: the warring nations eventually resolve to coexist peacefully, deciding upon terms agreeable to all parties, so, since diplomacy always provides the solution to the problems nations confront, why not cut to the chase and use diplomats to settle disputes in all cases? But I digress somewhat. My point is that it is rifles, not handguns, that play the dominant role in modern warfare. Side arms are carried into battle and are useful in policing nations too. But in every instance the hand guns utility is reduced to that of a Human Being Killling Machine. And in my opinion, killing other human beings is something mankind is better off not participating in. We need to rely upon our reasoning skills to resolve disputes that arise amongst our people's..We are after all, all one big family. At the end of the day we share in common the title: Earthlings. And it is my view that we should do all we can to avoid killing one another. It is an occasional necessary evil, But ultimately it remains an evil. ",
            "date": "Answered November 10, 2018",
            "views": "464",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Frank Shearin",
                    "user_href": "/profile/Frank-Shearin"
                },
                {
                    "user_id": "Staci Burnett",
                    "user_href": "/profile/Staci-Burnett-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rodney Smith",
                "href": "/profile/Rodney-Smith-47"
            },
            "answer_text": "Weapons of mass destruction, nuclear missiles. Chemical weapons, like sarin gas, a nerve agent. Guns, and automatic rifles, like the Ar-15 that can fire 400 rounds per minute. Cigarettes, the smoking of cigarettes kills more than 480, 000 people a year. Drugs, like heroin, cocaine, crackcocaine angel dust, acid, crystal meth. Human governments, that have failed all through human history, to bring an end to crime, violence, murder, war, racism, homelessness, starvation, poverty, and death. Human rule has contributed to, and is the root cause, of all the most demented inventions that humanity has created, as described above. Human governments are not based on love, but on power, greed, and war, and injustice. The bible book of Ecclesiastes, tells us of the results of human governments. Ecclesiastes 8:9 reads: “Man has dominated man to his own harm.” Do you know why human governments are failing? It is because who is backing human rule. Luke 4:5–7, identifies the one behind human governments. Luke 4:5- 7 reads: (5) “So he brought him up and showed him all the kingdoms of the inhabited earth in an instant of time.” (6) “Then the Devil said to him:” I will give you all this authority and their glory, because it has been handed over to me, and I give it to whomever I wish.” (7)“If you, therefore, do an act of worship to me, it will all be yours.” Who was Satan the devil, making this offer, to rule human governments to? It was Jesus, the son of God. Jesus replied to Satan at Luke 4:8, saying this: “In reply Jesus said to him: “ It is written, it is Jehovah your God you must worship and it is to him alone you must render sacred service.” So we learn two things from these verses. (1), That Satan is behind human rule, he tried to tempt Jesus with being ruler of human government. (2), Jesus response showed that we all should worship only Jehovah God alone. It also shows that Satan wants to be worshiped as a god, he tried to get Jesus to worship him. According to the bible, this all started in the Garden of Eden. Jehovah God told Adam and Eve they would die if they disobeyed and ate from the tree of the knowledge of good and bad. (Genesis 2:16,17) This was a law that Jehovah God gave to Adam and Eve, and if they obeyed, it meant that they respected Jehovah God as their lawgiver. And that Jehovah God has the right to determine or set the standards for his human creation, as to what is good, (approved by God), and what is bad,(condemned by God). To obey God, would thus have showed that they respected their Creator, and his position as Almighty God. But an angel turned wicked, and wanted Adam and Eve to worship him, instead of Jehovah God. Jehovah God called him Satan and devil after this. Satan told Eve by means of a serpent that she would not die if she ate from the tree of the knowledge of good and bad. Genesis 3:4, reads: “At this the serpent said to the woman: “You certainly will not die.” Satan used a serpent like a ventriloquist use a doll, and made it appear to speak. At Genesis 3:5 Satan tells Eve this lie: Genesis 3:5, reads: “For God knows that in the very day you eat from it, your eyes will be opened and you will be like God, knowing good and bad.” Eve was deceived into believing the lies, ate the fruit and gave it to Adam, and he went along with her and ate it also. (Genesis 3:6) That was the start of human rule, where humans decided what was good or bad independent of their Creator, Jehovah God. Satan lied to Eve, he said she certainly would not die. Eve is dead, and Adam is also dead, for disobeying Jehovah God. Satan has also been sentenced to die for what he did in the Garden of Eden, read the account at (Revelation 20:10) Jehovah God could have executed Satan right away. But he made a claim that humans could rule themselves, without Jehovah God and have peace and prosperity. Had Jehovah destroyed satan right away it could have been said that he did it to silence him, and maybe satan was right. So, Jehovah God, in his divine wisdom allowed the challenge to his sovereignty to prove that his way of ruling is in the best interest of his human creation. There were also many faithful angels that were watching to see how Jehovah God would handle this rebellion to his sovereignty. So, Jehovah God allowed humans to form governments, and rule themselves with Satan as their leader, to solve the issue once and for all. And what has been the results of human rule, promoted by Satan? A world full of crime, violence, murder, racism, rape, poverty, terrorism, war, hunger, injustice, domestic violence, child abuse, mass killings, nuclear weapons, chemical weapons, out of control gun violence. The F.B.I. Crime clock statistics say: A violent crime occurs every 24.6 seconds. A murder occurs every 30.5 minutes. A rape occurs every 3.9 minutes. A robbery occurs every 1.7 minutes. A motor vehicle theft every 40.9 seconds. A burglary every 22.6 seconds. So it is very clear that Satan lied, again. This world under human rule, by human governments, is out of control. In contrast, if every person earth wide, were to obey just (3) of Jehovah God's commandments, Not to steal, Not to kill, To love your neighbors as yourself, There would not be any murders, No crimes of violence, no rape, robberies, racism, no war, or weapons of mass destruction, no need for jails or prisons, no need for police. No food shortages, or greed, no need for guns. So we can clearly see, that to have the terrible problems we as humans face solved, we need to obey God as ruler, not man, or Satan. Isaiah 48:17,18 reads: “I Jehovah am your God, the one teaching you to benefit yourself, the one guiding you in the way you should walk.” “If only you would pay attention to my commandments! Then your peace would become just like a river, and your righteousness like the waves of the sea.” To choose Jehovah God as ruler, and follow his way, and to be declared righteous by him, will benefit you greatly. Psalms 37:29 reads: “The righteous will possess the earth, and they will live forever on it.” Psalms 37:34 reads: “Hope in Jehovah and follow his way, and he will exalt you to take possession of the earth, when the wicked are done away with, you will see it.” So according to the bible those that choose to follow Jehovah and his way will live forever on earth. Those who choose to follow Satan, and man as ruler, will be declared wicked by God, and done away with by God. So the most demented invention humanity has created, is human rule, independent of Jehovah God. It has caused all mankind's problems, and was started by Satan. It has now been over 6000 years of failed human governments. Jehovah God has allowed humans more than enough time to rule themselves independent of him, and that time is nearing its end. According to the bible God will put an end to human rule as a failure, and replace it with his own government. (Daniel 2:44) Jehovah God is also going to eliminate Satan, the instigator of this whole mess.(Revelation 20:10) To learn how to take God's side and live forever, visit http://jw.org Thank you ",
            "date": "Answered January 6, 2019",
            "views": "319",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bart Jeppesen",
                "href": "/profile/Bart-Jeppesen"
            },
            "answer_text": "ORO to use the dogs to hunt CRC GODs words to make happen actions which are not GODs words. An it worked! Granny would pound a pencil in your eye, with GODs words. All might also help. But who is your god, who is his god, who is their god, who the heck it this god? Where is GOD? ( Shiploads of gold and god on your side ) Both are opposing—-One hunts for and the other will do everything else. Meanwhile shouting and selling the golden tickets in the line and important to be in the right line. Pretty much GOD factor. No one knows GOD, but all claim to know GOD. ( ha, I am going down fast! The mob has gathered and the wolves have me in the tree.) —-Later all went home. Feeling much better at the pleasure in the punishment given was just! Nobody going to tell them about GOD! —issues erased that way and god wills it. But did they know GOD? Or perhaps something else going on and they are all always in focus on those whom are erased? Those two are the most effective way with the intentions and actions -producing a circle pattern which is feeds its self. ( Invention of using this combination to hunt for, find, and remove, and it survives by feeding on the very thing they all know so well.) Impressive! Impressive and with great respect this is said. hmm,,,was not meant to have everyone come give me my punishment for revealing this. But just how things like this are exactly why one can have great respect. If you underestimate a task it becomes alot more intense when suddenly find out- ( the afternoon swim in the lake was a bit further to the other side. Going down you are.) How many of us have done something like that? Little things- the last or first stair step, the swing rope as the path not going to the woohoo sparkler moment, pedal bike trip planned yet not same excitement when did not think about area you hop hopping along was 500 miles of wrong wrong and poor planning all yours to own. haha ",
            "date": "Answered November 1, 2019",
            "views": "310",
            "upvotes": " Answer requested by Staci Burnett",
            "upvoters": [
                {
                    "user_id": "Andreas Badi",
                    "user_href": "/profile/Andreas-Badi-1"
                },
                {
                    "user_id": "Brendan Townie",
                    "user_href": "/profile/Brendan-Townie"
                },
                {
                    "user_id": "Apulo Naga",
                    "user_href": "/profile/Apulo-Naga"
                },
                {
                    "user_id": "Mabozza Richie",
                    "user_href": "/profile/Mabozza-Richie"
                },
                {
                    "user_id": "Steven Haddock",
                    "user_href": "/profile/Steven-Haddock"
                }
            ]
        },
        {
            "author_info": {
                "name": "Louis Jones",
                "href": "/profile/Louis-Jones-39"
            },
            "answer_text": "Atomic Bomb  A nuclear weapon of the “Fat Man” type, the plutonium implosion type detonated over Nagasaki.60 inches in diameter and 128 inches long, the weapon weighed about 10,000 pounds and had a yieldapproximating 21,000 tons of high explosives (Copy from U.S. National Archives, RG 77-AEC). source Weapons whose explosive output is exclusively from fission reactions are commonly referred to as atomic bombs or atom bombs. These bombs are the deadliest invented so far. The “Little Boy” and the “Fat Man” (a gun-type weapon and an implosion-type weapon, used in the atomic bombings of Hiroshima and Nagasaki) have already shown the world the destruction that an atomic bomb can wreak upon the world. Developed as a part of the Manhattan Project (a research and development project that produced the first nuclear weapons) during the World War II by the United States. On August 6, 1945, at 8:16 a.m. Japanese time, an American B-29 bomber, the Enola Gay, drops the world’s first atom bomb, over the city of Hiroshima. Approximately 80,000 people are killed as a direct result of the blast, and another 35,000 are injured. At least another 60,000 would be dead by the end of the year from the effects of the fallout. It remains the deadliest invention and a constant threat to world peace.  A nuclear weapon of the “Little Boy” type, the uranium gun-type detonated over Hiroshima. It is 28 inches in diameter and 120 inches long. “Little Boy” weighed about 9,000 pounds and had a yield approximating 15,000 tons of high explosives. (Copy from U.S. National Archives, RG 77-AEC). source  A mushroom cloud rises from Hiroshima, Japan, on August 6, 1945, in the first use of an atomic bomb during World War II. A second bomb was dropped three days later on Nagasaki, and Japan surrendered August 14. source ",
            "date": "Answered October 30, 2019",
            "views": "12",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Prakash Mehta",
                    "user_href": "/profile/Prakash-Mehta-207"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jessica Storm",
                "href": "/profile/Jessica-Storm-2"
            },
            "answer_text": "For me, it has to be robots and artificial intelligence. I'm not sure if my fear of them is rational, or if it's more of a phobia. It just seems really dumb to make a machine, with their capacity to malfunction, and then give it a mind of its own. Some people will say that there are the famous 3 Laws of Robotics that are meant to protect people. But how is a malfunctioning machine going to adhere to any programming? Connect it to an oversight system? Well, then it could get hacked. Even if it weren't connected it could be hacked, or tampered with, or sabotaged. Also, how many ways could someone get around the rules? I'm sure someone has been thinking about this already and has figured out how to manipulate the rules for their own personal gain. Then again, what would stop someone bent on evil doings from creating their own AI with no rules? So essentially, a life sized human figure made of metal with the strength and ability to break down your door and squeeze the life out of you (if so inclined by design or accident) is a reality. They aren't yet able to pass as humans, looking and acting in a way that would make them indistinguishable from us, but they will be. I'd guess that within 20 years we will see really lifelike robots. I've already seen some fairly good ones, but still obviously machines. And there may be some perfectly harmless, even extremely beneficial, uses for a lifelike robot, but there are also some terrifying ones. ",
            "date": "Answered June 9, 2016",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Noelle Bridgman-Wile",
                    "user_href": "/profile/Noelle-Bridgman-Wile"
                },
                {
                    "user_id": "Andrew Gosset",
                    "user_href": "/profile/Andrew-Gosset"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Peracchio",
                "href": "/profile/Tom-Peracchio"
            },
            "answer_text": "I have studied science and technology all my life, and wrote term papers on nuclear weapons. I attended training as a Nuclear Biological Chemical Defense specialist in the military and learned the first hand effects of nuclear weapons. I have studied the modern day nuclear accidents such as Chernobyl, Ukraine and Fukushima, Japan and learned the first hand effects of nuclear power if not properly managed. I think of the famous line that always goes through my head from the Spider Man movies, \"With great power comes great responsibility.\" Nothing is a better example of that thought than nuclear power. It could be the blessing that saves the planet from the dangers of fossil fuels and the dependency on foreign oil. It could be the curse that destroys us as well if used as a weapon by terrorists. ",
            "date": "Answered June 9, 2016",
            "views": "959",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thanisha Kapur",
                    "user_href": "/profile/Thanisha-Kapur"
                },
                {
                    "user_id": "Alberto Holland",
                    "user_href": "/profile/Alberto-Holland"
                },
                {
                    "user_id": "Roger Oliveira",
                    "user_href": "/profile/Roger-Oliveira-17"
                },
                {
                    "user_id": "Sampath Angara",
                    "user_href": "/profile/Sampath-Angara"
                },
                {
                    "user_id": "Colin John Cook",
                    "user_href": "/profile/Colin-John-Cook"
                },
                {
                    "user_id": "Jay Ellis",
                    "user_href": "/profile/Jay-Ellis-2"
                },
                {
                    "user_id": "William Woods",
                    "user_href": "/profile/William-Woods-132"
                },
                {
                    "user_id": "John Smith",
                    "user_href": "/profile/John-Smith-6573"
                },
                {
                    "user_id": "David Seto",
                    "user_href": "/profile/David-Seto-3"
                },
                {
                    "user_id": "Wyatt Klein",
                    "user_href": "/profile/Wyatt-Klein-2"
                },
                {
                    "user_id": "David Peterson",
                    "user_href": "/profile/David-Peterson-343"
                },
                {
                    "user_id": "Erii Mascar",
                    "user_href": "/profile/Erii-Mascar"
                },
                {
                    "user_id": "Berislav Komac",
                    "user_href": "/profile/Berislav-Komac"
                },
                {
                    "user_id": "Bruce Ho",
                    "user_href": "/profile/Bruce-Ho-4"
                },
                {
                    "user_id": "Paul Vancraeynest",
                    "user_href": "/profile/Paul-Vancraeynest-1-1"
                },
                {
                    "user_id": "Henri Nykänen",
                    "user_href": "/profile/Henri-Nykänen-1"
                },
                {
                    "user_id": "Lan Phan",
                    "user_href": "/profile/Lan-Phan-16"
                },
                {
                    "user_id": "Rohit Zedek",
                    "user_href": "/profile/Rohit-Zedek"
                },
                {
                    "user_id": "Umesh Kumar",
                    "user_href": "/profile/Umesh-Kumar-202"
                },
                {
                    "user_id": "Prasad Sawant",
                    "user_href": "/profile/Prasad-Sawant-87"
                },
                {
                    "user_id": "Evan Slade",
                    "user_href": "/profile/Evan-Slade"
                },
                {
                    "user_id": "Tony Dedario",
                    "user_href": "/profile/Tony-Dedario"
                },
                {
                    "user_id": "Santhosh Kumar",
                    "user_href": "/profile/Santhosh-Kumar-950"
                },
                {
                    "user_id": "Sonam Duseja",
                    "user_href": "/profile/Sonam-Duseja-3"
                },
                {
                    "user_id": "Manab Boruah",
                    "user_href": "/profile/Manab-Boruah-1"
                },
                {
                    "user_id": "Sten Reiter",
                    "user_href": "/profile/Sten-Reiter"
                },
                {
                    "user_id": "Emre Güzel",
                    "user_href": "/profile/Emre-Güzel-4"
                },
                {
                    "user_id": "Jon Smith",
                    "user_href": "/profile/Jon-Smith-410"
                },
                {
                    "user_id": "Joelle Erickson",
                    "user_href": "/profile/Joelle-Erickson"
                },
                {
                    "user_id": "Abdullah Hossain",
                    "user_href": "/profile/Abdullah-Hossain-3"
                },
                {
                    "user_id": "Dustin Bales",
                    "user_href": "/profile/Dustin-Bales"
                },
                {
                    "user_id": "Zachary Tay",
                    "user_href": "/profile/Zachary-Tay-5"
                },
                {
                    "user_id": "Akshay Gowda",
                    "user_href": "/profile/Akshay-Gowda-26"
                },
                {
                    "user_id": "Nicola Carapellese",
                    "user_href": "/profile/Nicola-Carapellese"
                },
                {
                    "user_id": "Jakob Jungherr",
                    "user_href": "/profile/Jakob-Jungherr"
                },
                {
                    "user_id": "Keith Holmes",
                    "user_href": "/profile/Keith-Holmes-23"
                },
                {
                    "user_id": "Matthew Madsen",
                    "user_href": "/profile/Matthew-Madsen-12"
                },
                {
                    "user_id": "Alan Wake",
                    "user_href": "/profile/Alan-Wake-64"
                },
                {
                    "user_id": "Nguyen Duc Duong",
                    "user_href": "/profile/Nguyen-Duc-Duong"
                },
                {
                    "user_id": "Apulo Naga",
                    "user_href": "/profile/Apulo-Naga"
                },
                {
                    "user_id": "Anurag Kulshreshtha",
                    "user_href": "/profile/Anurag-Kulshreshtha"
                },
                {
                    "user_id": "Wei Dong",
                    "user_href": "/profile/Wei-Dong-53"
                },
                {
                    "user_id": "Ilya Remov",
                    "user_href": "/profile/Ilya-Remov"
                },
                {
                    "user_id": "Jeff Jochim",
                    "user_href": "/profile/Jeff-Jochim-1"
                },
                {
                    "user_id": "Tucker Pierce",
                    "user_href": "/profile/Tucker-Pierce-2"
                },
                {
                    "user_id": "Tae Hwan Park",
                    "user_href": "/profile/Tae-Hwan-Park"
                },
                {
                    "user_id": "Albin Redzepi",
                    "user_href": "/profile/Albin-Redzepi"
                },
                {
                    "user_id": "Brad Boratto",
                    "user_href": "/profile/Brad-Boratto"
                },
                {
                    "user_id": "Robert Gauthier",
                    "user_href": "/profile/Robert-Gauthier"
                },
                {
                    "user_id": "Tarek Tuma",
                    "user_href": "/profile/Tarek-Tuma"
                },
                {
                    "user_id": "Andrei Onetiu",
                    "user_href": "/profile/Andrei-Onetiu"
                },
                {
                    "user_id": "Lukáš Kubacki",
                    "user_href": "/profile/Lukáš-Kubacki"
                },
                {
                    "user_id": "John Knight",
                    "user_href": "/profile/John-Knight-19"
                },
                {
                    "user_id": "David A. Smith",
                    "user_href": "/profile/David-A-Smith-13"
                },
                {
                    "user_id": "Matt Johnson",
                    "user_href": "/profile/Matt-Johnson-8"
                },
                {
                    "user_id": "Drew Eckhardt",
                    "user_href": "/profile/Drew-Eckhardt"
                },
                {
                    "user_id": "Sıla Okur",
                    "user_href": "/profile/Sıla-Okur"
                },
                {
                    "user_id": "Hakan Khan",
                    "user_href": "/profile/Hakan-Khan-2"
                },
                {
                    "user_id": "Jamarian Cleveland",
                    "user_href": "/profile/Jamarian-Cleveland-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven Haddock",
                "href": "/profile/Steven-Haddock"
            },
            "answer_text": " The internal combustion engine Prior to this, engines had to be fairly heavy and attached to massive machines that were only useful for carrying large numbers of people or large amounts of goods. The ICE allowed engines to become smaller, separated them from the need to be attached to a power source all the time, and allowed the exploitation of ultra volatile fuels like gasoline, diesel and kerosene. So you could have one of your own. Or, unfortunately, several tens of millions of people could afford to have one all of their own. Instead of, you know, taking the train or something.  Now, for individuals, this was a positive boon. For society as a whole, not so much. Forget about climate change for a minute - places with a lot of these things became polluted - air pollution, soil pollution (from leaking gas tanks), space pollution (the need for wide roads and lots of parking spaces), etc. ",
            "date": "Answered October 30, 2019",
            "views": "52",
            "upvotes": " View 59 Upvoters",
            "upvoters": [
                {
                    "user_id": "Staci Burnett",
                    "user_href": "/profile/Staci-Burnett-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ryan Alder",
                "href": "/profile/Ryan-Alder-3"
            },
            "answer_text": "Guns. I don’t give a shit about your stance (not just asker, in general haha) on guns. These are the most destructive and pointless invention we’ve ever made. Other animals straight up fight. You got a problem with me? You want me dead? Come do it like a true mammal. Beat me, show them teeth, go for the throat. Don’t stand behind a little machine that does it for you, you wuss. On the other side, we only made them for death and destruction. Guns were made to kill, there’s literally no reason for that. We only “need” them in war because that’s yet another thing humanity created that makes absolutely no sense. Guns are good self defense, sure. But again, that’s still using a machine that’s meant to kill. ",
            "date": "Answered August 28, 2018",
            "views": "147",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dennis Drexler",
                "href": "/profile/Dennis-Drexler"
            },
            "answer_text": "The INTERNET! By FAR. I spend way too much time staring at my laptop screen looking at crap. Except for Quora of course, unless you count the questions like “how bad would it be to dump my used motor oil in the ocean instead of recycling it” and “what kind of oil goes in (insert car/truck/motorcycle name here). Hint: Look it UP, stupid! Or “how much damage would I do if I jumped out of a car at highway speeds” Or regurgitating something someone else said here. Get my drift? ",
            "date": "Answered December 15, 2018",
            "views": "144",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Hezel",
                    "user_href": "/profile/James-Hezel-1"
                },
                {
                    "user_id": "Rj James",
                    "user_href": "/profile/Rj-James"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Todd Elliot",
                "href": "/profile/Todd-Elliot-3"
            },
            "answer_text": "As usual… I’ll have to play devil’s advocate. If the earth wasn’t plagued by over population I wouldn’t have to name this. But because men can’t keep it in their pants, and women can’t keep their knees together, and both think they have the right to have as many kids as they possibly can until the world can’t support their consumption and the garbage that is a consequence… Antibiotics… If we had never discovered antibiotics population levels would have remained on a very slow increase and we would have perhaps a billion and a half people on the earth. Arguably, much better for all concerned. ",
            "date": "Answered December 15, 2018",
            "views": "205",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mihaela Staticescu",
                "href": "/profile/Mihaela-Staticescu"
            },
            "answer_text": "Humans never invented anything for evil, but for good. The enemies of mankind took all those inventions and turned them into instruments of evil. And that's why God decided that this enemy race needs to experience on themselves, forever, all that they turned into evil and against God and humankind. And I'll be bringing the popcorn to humanity, while they sit back and watch to see how the enemies of humankind like this when it's turned on them. Maybe these enemies actually enjoy excruciating pain. Who knows?! We'll just have to wait until this reality show begins. I know this enemy race REALLY likes reality shows, I'm just not sure how they'll feel about them being the ones that are watched, for a change. ",
            "date": "Answered October 7, 2019",
            "views": "151",
            "upvotes": " Answer requested by Staci Burnett",
            "upvoters": [
                {
                    "user_id": "Ariel Konrad",
                    "user_href": "/profile/Ariel-Konrad-1"
                },
                {
                    "user_id": "Steve Brown",
                    "user_href": "/profile/Steve-Brown-145"
                },
                {
                    "user_id": "Haris Kaitis",
                    "user_href": "/profile/Haris-Kaitis-1"
                },
                {
                    "user_id": "Neto Yo",
                    "user_href": "/profile/Neto-Yo"
                },
                {
                    "user_id": "John Smith",
                    "user_href": "/profile/John-Smith-50408"
                },
                {
                    "user_id": "Bryan Bush",
                    "user_href": "/profile/Bryan-Bush"
                },
                {
                    "user_id": "Akshay Tripathi",
                    "user_href": "/profile/Akshay-Tripathi-61"
                },
                {
                    "user_id": "David Lee",
                    "user_href": "/profile/David-Lee-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Barrabas",
                "href": "/profile/Michael-Barrabas"
            },
            "answer_text": "What most people suffer from, hence the most evil thing, would probably be the human invention of theistic religions which prevent people from personal and societal well-being as well as from developing and making progress, all in order to please (an) assumed arbitrary, ghostly being(s). ",
            "date": "Answered May 25, 2013",
            "views": "2",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thanisha Kapur",
                    "user_href": "/profile/Thanisha-Kapur"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Kaleb Theodoropoulos",
                "href": "/profile/Peter-Kaleb-Theodoropoulos"
            },
            "answer_text": "Government. Ok just kidding. For real, it’s the nuclear bomb. Other than that it’s policy defiant non proper testing of GMO based foods or technologies that get dangerously streamlined into markets. The latter in some respects is even more dangerous than Nuclear bombs since it can kill off whole ecologies through what are called “trans-viruses”. ",
            "date": "Answered March 21, 2017",
            "views": "134",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David A. Smith",
                "href": "/profile/David-A-Smith-13"
            },
            "answer_text": "The concept of “other”. As opposed to this question, I’d like to offer the “most harmful LACK of invention”: Proliferation of different standards, including language. Some languages are beautiful, some are utilitarian. But they stand between us and understanding, more than they aid in understanding. Education based on the Journeyman -> Master -> Apprentice system, when the teacher is NOT a Master, and has too many Apprentices. ",
            "date": "Answered October 30, 2019",
            "views": "107",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Max Farley",
                "href": "/profile/Max-Farley"
            },
            "answer_text": "A short list: Politics Nuclear weapons Biological Warfare Tribalism/racism Religion (It’s caused more wars than anything else). Antibiotics (That’s where our overpopulation problem comes from). ",
            "date": "Answered January 23, 2019",
            "views": "72",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lan Phan",
                    "user_href": "/profile/Lan-Phan-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Welch",
                "href": "/profile/James-Welch-26"
            },
            "answer_text": "The stirrup. This enabled the horseman to ride his horse AND kill people at the same time. Before that, the cavalry rode in, dismounted, and then fought. This was the key invention of the Mongol horsemen, later adopted by the Europeans. Just my $0.02. ",
            "date": "Answered October 30, 2019",
            "views": "85",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Apulo Naga",
                    "user_href": "/profile/Apulo-Naga"
                },
                {
                    "user_id": "Shejan Shuza",
                    "user_href": "/profile/Shejan-Shuza"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thomas Samson",
                "href": "/profile/Thomas-Samson-9"
            },
            "answer_text": "The stick, then a bigger stick, then a stick with string attached to both ends firing a stick. Then the arguments: “My stick is bigger than yours.” Thwack. then the stick was thrown launched swung and fired. Stick technology was the precursor to all bad things. ",
            "date": "Answered October 30, 2019",
            "views": "41",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tamara Wilhite",
                "href": "/profile/Tamara-Wilhite"
            },
            "answer_text": "The ability to imagine a utopian paradise and then use violence and oppression to try to force others to conform to an impossible vision. Dangers of Totalitarian Utopian Visions  ",
            "date": "Answered December 19, 2019",
            "views": "113",
            "upvotes": " Answer requested by Staci Burnett",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Cooper",
                "href": "/profile/David-Cooper-613"
            },
            "answer_text": "That’s a tough one. It’s either religion (which locks people into hate and conflict), school (not education, but just the unwarranted imprisonment aspect of it), or bridges. I really dislike bridges because they make every journey dull instead of it being an adventure - we can make long journeys but end up with absolutely no story to tell. ",
            "date": "Answered October 30, 2019",
            "views": "240",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tony Bruno",
                    "user_href": "/profile/Tony-Bruno-17"
                },
                {
                    "user_id": "Norman Simenson",
                    "user_href": "/profile/Norman-Simenson-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vincent Fincher",
                "href": "/profile/Vincent-Fincher"
            },
            "answer_text": "Politics. For all five thousand years of written history and many millennia before, nothing has so pervaded the principle of accountability quite like the system of government. From the start of its creation, it has provided an engine by thousands of groups to make their word the law and giving themselves a rallying cry, always under the purview of some greater good, against the will of others. ",
            "date": "Answered May 23, 2016",
            "views": "505",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rich Hochstim",
                "href": "/profile/Rich-Hochstim"
            },
            "answer_text": "In a book about the Spanish Inquisition I saw a hideous device in which a poor naked soul was hung from ropes tied to their wrists that were behind their back and above their head. Then they were lowered onto a sharp metallic device that gradually cut their anus and entered their rectum where it was slowly made to support increasing amounts of their body weight as the tension on their arms was released. ",
            "date": "Answered January 5, 2019",
            "views": "79",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mabozza Richie",
                    "user_href": "/profile/Mabozza-Richie"
                },
                {
                    "user_id": "Paul Nance",
                    "user_href": "/profile/Paul-Nance"
                },
                {
                    "user_id": "Demetres Karapanos",
                    "user_href": "/profile/Demetres-Karapanos"
                }
            ]
        },
        {
            "author_info": {
                "name": "Digby Willard",
                "href": "/profile/Digby-Willard-2"
            },
            "answer_text": "The atomic bomb is arguably the evilest invention known to humanity, and by extension, nuclear weapons in general. ",
            "date": "Answered December 15, 2018",
            "views": "77",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Henry Froelich",
                    "user_href": "/profile/Henry-Froelich-1"
                },
                {
                    "user_id": "Marliena Muriel Evans",
                    "user_href": "/profile/Marliena-Muriel-Evans"
                }
            ]
        },
        {
            "author_info": {
                "name": "Doug Hilton",
                "href": "/profile/Doug-Hilton"
            },
            "answer_text": "Human language. It’s allowed for greater discourse, greater division, the exchange and spread of ideas, including those for weapons. It’s directly responsible for lawyers, and the media. ",
            "date": "Answered October 30, 2019",
            "views": "170",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                }
            ]
        },
        {
            "author_info": {
                "name": "El Kay",
                "href": "/profile/El-Kay-19"
            },
            "answer_text": "I would have to say an AK 47, it's killed more humans than most bombs you can think of. ",
            "date": "Answered December 15, 2018",
            "views": "22",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jisoo Kim",
                    "user_href": "/profile/Jisoo-Kim-144"
                }
            ]
        },
        {
            "author_info": {
                "name": "Max Boettger",
                "href": "/profile/Max-Boettger-2"
            },
            "answer_text": "WARNING GRAPHIC IMAGES BELOW    Several disturbing torture devices. ",
            "date": "Answered March 8, 2017",
            "views": "319",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Ganapathy Ramadoss",
                "href": "/profile/Ganapathy-Ramadoss-1"
            },
            "answer_text": "The refrigerator with Freon. It made such a mess to the ozone layer. Million of people are using it. Everyday a huge amount of ozone is getting depleted. ",
            "date": "Answered June 9, 2016",
            "views": "100",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sanju Pahalagamage",
                "href": "/profile/Sanju-Pahalagamage"
            },
            "answer_text": "Money. Bombs, all warfare stuff . Politics Religions. ALL those wrong numbers in it. ;-) ",
            "date": "Answered January 12, 2018",
            "views": "85",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joel Brothers",
                "href": "/profile/Joel-Brothers"
            },
            "answer_text": "Powdered eggs ",
            "date": "Answered June 29, 2018",
            "views": "42",
            "upvotes": "0"
        }
    ]
}