{
    "title": "What is the difference between a bond dipole and a molecular dipole? - Quora",
    "tags": [
        "Dipole Moment",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Jones",
                "href": "/profile/Mike-Jones-2528"
            },
            "answer_text": "Just about all bonds are polar, as long as the electronegativity difference is not zero. The greater the electronegativity difference, the more polar the bond, and greater is the bond dipole moment. The polarity of a molecule depends on the geometry of the molecule. The net dipole moment of a molecule is the vector sum of all of the individual bond dipole moments. It is quite possible to have polar bonds, but a nonpolar molecule. The classic example is CO2 (O=C=O). The carbon-oxygen double bonds are polar, but the individual bond dipoles are vectors pointed in opposite directions and thus cancel out, leaving the net dipole moment for the molecule zero. CO2 is nonpolar. Water is a classic example of a polar molecule. Oxygen has four electron pairs surrounding it in a tetrahedral arrangement, but two pairs are lone pairs (nonbonding) and two pairs form bonds to hydrogen. The bond angle is about 105 degrees. Thus, the vector sum of the individual bond dipole moments is nonzero, resulting in a polar molecule with a net dipole moment of 1.85 Debye.  ",
            "date": "Answered November 29, 2019",
            "views": "21",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Pranav Turlapati",
                    "user_href": "/profile/Pranav-Turlapati-3"
                },
                {
                    "user_id": "Zoha",
                    "user_href": "/profile/Zoha-30"
                }
            ]
        },
        {
            "author_info": {
                "name": "Billy West",
                "href": "/profile/Billy-West-23"
            },
            "answer_text": "Bond dipoles occur within a molecule, for example take a haloalkane with the functional group Br—C Br is highly electronegative so will ‘pull’ the electrons in the bond towards it making it ‘slightly’ negative and carbon slightly positive ( written lowercase delta+) Dipole molecules however refer to the whole entitiy, and occurs usually by luck. As electrons are constantly in movement they randomly shift to one side of the molecular making that side more negative. ",
            "date": "Answered March 29, 2019",
            "views": "24",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Pranav Turlapati",
                    "user_href": "/profile/Pranav-Turlapati-3"
                },
                {
                    "user_id": "Frank Gasparro",
                    "user_href": "/profile/Frank-Gasparro-1"
                },
                {
                    "user_id": "Mahalakshmi",
                    "user_href": "/profile/Mahalakshmi-110"
                }
            ]
        }
    ]
}