{
    "title": "What are all carbohydrates made of? - Quora",
    "tags": [
        "Carbohydrates"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brian Bender",
                "href": "/profile/Brian-Bender-8"
            },
            "answer_text": "As mentioned before, carbohydrates are composted of carbon, hydrogen, and oxygen, in varying quantities and structures. Monosaccharides Simple sugars are glucose, fructose, and galactose. Each of these by themselves is a carbohydrate, and these are bonded together to form other types of carbohydrates.  Disaccharides If you string two of these together, you get a disacchardie (di=2). These are also carbohydrates. For example: Lactose = glucose + galactose (in milk)Maltose = glucose + glucose (digestion product from starch)Sucrose = glucose + fructose (i.e. table sugar)Polysaccharides These are longer strings of each sugar tied together. Examples are starch, cellulose, glycogen. They may be strung together linearly, or branched. There may be a few tied together, or quite a few. And different bonding structures may exist, too. ",
            "date": "Answered June 10, 2017",
            "views": "2",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bibek Ray",
                "href": "/profile/Bibek-Ray-1"
            },
            "answer_text": "Basically:all carbohydrates have : Carbon ( C), Hydrogen ( H) and Oxygen ( O), with H to O ratio in : 2: 1 ( like in water H2O; so they are like hydrated carbon. However, in a specific carbohydrate ( or saccharide), those atoms are arranged in specific configurations to form the basic units, like: monosaccharides, disaccharides , trisaccharides, and polysaccharides. A polysaccharide can be very large molecule containing thousands of monosaccharide units and forming a specific three dimensional structure that has a specific biological function (s). Carbohydrates are the most abundant organic molecules in the earth. ",
            "date": "Answered June 10, 2017",
            "views": "315",
            "upvotes": "0"
        }
    ]
}