{
    "title": "What are the products of photosynthesis? - Quora",
    "tags": [
        "Photosynthesis",
        "Products",
        "Science of Everyday Life",
        "Plants"
    ],
    "response": [
        {
            "author_info": {
                "name": "Les Ogilvie",
                "href": "/profile/Les-Ogilvie-1"
            },
            "answer_text": "Carbohydrates. Also, oxygen is produced as a waste product. Sounds pretty simple. However, it's a bit cooler than that. Most high school kids are taught that the plant produces carbohydrate in the form of glucose to provide the plant with energy. The glucose not used immediately for energy is stored as starch to provide energy in the future. All true. But you also should consider where the plant itself comes from. Consider a growing tree. It grows from a sapling of a few grams mass, if that, to a tree of many hundreds — even thousands — of kilograms. Where does that extra material come from? Well, the tree isn't just storing starch as energy. It uses it to build complicated carbohydrate structures such as lignin which become the substance of the tree. The tree gets the atoms (mostly carbon) for this biological construction project from carbon dioxide. The carbon dioxide comes from the air. The conclusion is that trees (and plants) do not really “grow out of the ground”. For the most part, trees emerge from the air! A little hydrogen, oxygen (for lignin etc) and some minerals and nitrate (for proteins and genetic material) come out of the ground, sure, but the main building blocks of the tree come out of the air. Trees grow mostly out of the air. Not the ground. ",
            "date": "Answered July 22, 2018",
            "views": "29",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Brian van der Spuy",
                    "user_href": "/profile/Brian-van-der-Spuy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Valerian Colaco",
                "href": "/profile/Valerian-Colaco-1"
            },
            "answer_text": "Photosynthesis may be summarised by the word equation: carbon dioxide + water\t(dissolved nutrients salts) with sunlight and chlorophyll\t generates glucose and oxygen. That is the basic I learned eons ago, if you ask a biochemist the answer will be more detailed which I am incapable to provide. ",
            "date": "Answered July 22, 2018",
            "views": "353",
            "upvotes": "0"
        }
    ]
}