{
    "title": "What is the advanced technology in Russia? - Quora",
    "tags": [
        "Technology Trends",
        "Russia"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mikhail Buleev",
                "href": "/profile/Mikhail-Buleev"
            },
            "answer_text": "I do not quite understand the meaning of this question, so I will answer as I understand it. So, in Russia there are many examples of advanced technologies. I will try to give some examples here. TEM (nuclear propulsion) - Wikipedia Orbital space tug with a nuclear power plant. This is the future of space technology. Currently, Russia is developing this technology. No one else has any real developments approaching this. The US is not yet trying to implement such technologies at this level. 2. Akademik Lomonosov - Wikipedia  A nuclear power plant that can produce 50,000 tons of fresh water per day and simultaneously supply electricity to a city of 100,000 people. She's mobile. That is, you can bring it to any suitable port - where it is needed. 3. Arktika (2016 icebreaker) - Wikipedia  This is a new icebreakers. They're bigger than anything before them. Nuclear reactors of a new type are also installed there. No one in the world has one. Only in Russia. 4. BN-800 reactor - Wikipedia  This is the latest reactor, which makes it possible to organize a waste-free cycle of nuclear fuel. Just imagine - nuclear power plants will no longer require storage for nuclear waste. Only Russia has brought the development of reactors of this type to the industrial design. Tried the USA, France, Japan - at them it didn't turn out. 5. The Russian gas turbine of big power GTD-110M will mass-produce  It is known that high-power gas turbines are technologies of the highest complexity, and here you see the Russian development of GTD-110m. Siemens is so concerned about the emergence of this technology in Russia that they offer to transfer their technologies for the production of high-power turbines to Russia, building a plant - to preserve the market for their products. 6. Spektr-RG - Wikipedia  This is a scientific project of the decade in the field of astrophysics. Immediately after Spektr-R (Radioastron). 7. Elbrus-8S - Wikipedia  Well, how many countries in the world have developed their own line of microprocessors? 8. Sukhoi Su-57 - Wikipedia and Sukhoi Okhotnik - Wikipedia   This next-generation platform attack, designed for network-centric wars, contains AI elements. 9. T-14 Armata - Wikipedia  And this is also the next generation combat platform. 10. Irkut MC-21 - Wikipedia and Aviadvigatel PD-14 - Wikipedia   Creating an aircraft and an aircraft engine that can compete with such as Boeing and Airbus - is a huge challenge, which can cope with less than a dozen countries in the world. There is also, Sukhoi Superjet 100 - Wikipedia. Of course, this aircraft has problems, but they relate to the after-sales service network, and not to the aircraft itself. The aircraft itself, however, remains a reliable competitor in the global aviation market of regional aircraft. 11. Rostselmash - Wikipedia  This company occupies 17% of the world market of agricultural machinery. Is high technology enough? Well, they are now preparing to massively robotize harvesters. 12. Main | AURUS  Cars of an exclusive class are also quite high technologies. 13. Hevel Solar  14. Kaspersky Antivirus Protection & Internet Security Software and OCR, PDF, Text Scanning Software & Automation Solutions - ABBYY and Yandex and more more another company. Someone here tried to declare that in Russia there are no large IT companies. I laughed. In fact, it exports of IT sector from Russia in 2018 exceeded $ 10 billion. For comparison , the export of weapons from Russia in 2018 amounted to about $ 15 billion, and the export of products of the agro sector amounted to $ 25 billion. 15. Crimean Bridge - Wikipedia  It is the longest bridge in Europe, and it is built in an unstable tectonic zone, which makes it extremely difficult in terms of technical implementation of the project.However, the bridge was built and is currently in operation, despite numerous statements in the Western press that this project is not feasible. So, I gave only some examples. Listing all would take many many pages. ",
            "date": "Answered August 5, 2019",
            "views": "27",
            "upvotes": " View 41 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ajay Rathore",
                    "user_href": "/profile/Ajay-Rathore-30"
                },
                {
                    "user_id": "Saurav Saha",
                    "user_href": "/profile/Saurav-Saha-58"
                },
                {
                    "user_id": "Maksim Drobyshev",
                    "user_href": "/profile/Maksim-Drobyshev-1"
                },
                {
                    "user_id": "Goutham",
                    "user_href": "/profile/Goutham-109"
                },
                {
                    "user_id": "Denis Esau",
                    "user_href": "/profile/Denis-Esau"
                },
                {
                    "user_id": "Igor Pazinich",
                    "user_href": "/profile/Igor-Pazinich"
                },
                {
                    "user_id": "Nathan Bautista",
                    "user_href": "/profile/Nathan-Bautista-12"
                },
                {
                    "user_id": "Elena Kovalenko",
                    "user_href": "/profile/Elena-Kovalenko-6"
                },
                {
                    "user_id": "Sergey Leonov",
                    "user_href": "/profile/Sergey-Leonov-2"
                },
                {
                    "user_id": "Justin Argones",
                    "user_href": "/profile/Justin-Argones-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Misha Firer",
                "href": "/profile/Misha-Firer"
            },
            "answer_text": "With the state TV’s blowing trumpets, Russia has embarked on a number of hyper-advanced cutting edge technological mega projects. Here’s a two-pic comparison to give you a better idea who owns this country and help you understand my answer.  The largest navy ship manufactured in Russia is frigate “Admiral Gorshkov.” Displacement: 5,400 tons, length: 135 meters.  Compare with oligarch Alisher Usmanov’s super-yacht “Dilbar” (neither designed nor manufactured in Russia), the world’s largest. Displacement: 15,917 tons, length: 156 meters.  Yo-mobil EV concept first unveiled at the 2011 Frankfurt Motor Show Yo-mobil electric vehicle Yo-mobil got everybody excited. Finally, we had a domestic Tesla, and in 2011 Putin drove a Yo-mobil for the rolling cameras. Everything looked very bright and promising, but nothing came to fruition. No factory was built. No mass production was launched. The grand total of three Yo-mobils were manufactured. Appropriately, the king court’s jester politician Zhirinovsky bought one and managed to drive 300 miles, at which point the car refused to charge. A Mercedes Benz E-class picked him up. 142 millions euro invested in the project had magically disappeared.  Looks too good to be true? True. Marussia Sports Car Founded in 2007 by Nikolai Fomenko and partners, Marussia Motors set an ambitious goal of producing the first Russian racing car. They beat Yo-mobil and managed to produce forty four prototypes of varying degrees of (in)completion. Hundreds of millions of dollars went down the pipe, and in 2014 the project was shut down at a loss. The same year, Nikolai Fomenko sailed on his super-yacht into Dubai marina for the yacht-show. His super yacht was neither designed nor manufactured in Russia.  Mr. Chubais, the head of Rosnano, a state venture fund, is giving Mr. Putin heads-up on how he’s blowing, sorry, spending budget money Plastic Logic 100 eBook Reader This e-book reader is based on the developments of the German company PlasticLogic. In 2011, it was on the verge of bankruptcy due to its failed product: the electronic book reader Que. But then Rusnano swooped in and the business of the PlasticLogic went uphill. Until it didn’t. Mr. Chubais paid off $50 million worth of PlasticLogic debts, and another $100 million was offered as a loan guarantee to build a plant in Zelenograd near Moscow. He sold the idea to the government that his eBook readers would be used instead of textbooks in all the schools of Russia. $700 million more were poured into the project. To cut the long story short, in 2012, the construction of the plant and the production of devices were abandoned altogether, citing economic inexpediency. Do you think Mr. Chubais got fired? It’s a rhetorical question.  Prime minister Dmitry Medvedev said about YotaPhone, new Russian smartphone: “When Steve Jobs heard about YotaPhone, he was worried.” At the end of 2013, CEO of Rostec, owner of Yota Devices Ltd, ex-KGB general and Mr. Putin’s old friend, Sergei Chemezov presented the highly innovative Russian smartphone YotaPhone with two displays to Prime Minister Dmitry Medvedev. Observe, they always present their prototypes to the supreme leaders and not to the public. In Russia, government is your investor, your marketer, your consumer, your law, your freedom, your bank, and your career. Public doesn't count for much. They only need to be fed buckwheat and macaroni and entertained with TV fluff and parades. For some unbeknownst reason, all the smartphone components were produced in wealthy Singapore, the E-ink display was from aforementioned PlasticLogic, which explains why sale price was so high. In 2013, YotaPhone was sold for 499 euros. Grand total of 40,000 devices were sold by mid-2014. Riding on the back of their success, in 2014, Yotaphone 2 was released, and 22,760 units were sold. In 2017, Yotaphone 3 was released at the price of $450 with even fewer units sold. Hundreds of consumers await the release of the KGB general’s YotaPhone 4.  Meet Boris, a man in Alyosha robot suit passing off as a robot In December 2018, the story of a Russian cutting-edge life size robot that was the answer to Boston Dynamics’ robot, went on all the federal TV channels. During the nationall forum “Projectors” held in Yaroslavl, the life size robot Boris was showing some cool dance moves to the clapping audience. Turned out it was a human pretending to be a robot by wearing Alyosha robot suit. Boris was Alyosha in disguise! Welcome to Russia 2020. It will take your breath away. With laughter.  Almost-a-Robot Alyosha ",
            "date": "Answered July 30, 2020",
            "views": "562",
            "upvotes": " View 977 Upvoters ",
            "upvoters": [
                {
                    "user_id": "A. Naunim",
                    "user_href": "/profile/A-Naunim"
                },
                {
                    "user_id": "Krunal Mule",
                    "user_href": "/profile/Krunal-Mule"
                },
                {
                    "user_id": "Bad Karma",
                    "user_href": "/profile/Bad-Karma-6"
                },
                {
                    "user_id": "Darya Yakovenko",
                    "user_href": "/profile/Darya-Yakovenko-1"
                },
                {
                    "user_id": "Mohammed Nor Abdul Rahman",
                    "user_href": "/profile/Mohammed-Nor-Abdul-Rahman"
                },
                {
                    "user_id": "Kevin Anderson",
                    "user_href": "/profile/Kevin-Anderson-98"
                },
                {
                    "user_id": "Farhan Israk",
                    "user_href": "/profile/ফারহান-ইশরাক-Farhan-Israk"
                },
                {
                    "user_id": "Christian Hansen",
                    "user_href": "/profile/Christian-Hansen-45"
                },
                {
                    "user_id": "Zixin Xia",
                    "user_href": "/profile/Zixin-Xia-1"
                },
                {
                    "user_id": "Elis Tare",
                    "user_href": "/profile/Elis-Tare"
                }
            ]
        }
    ]
}