{
    "title": "What is the most common phase of matter on Earth? - Quora",
    "tags": [
        "Matter (physics)",
        "Earth (planet)",
        "Planetary Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Harrington",
                "href": "/profile/Chris-Harrington-20"
            },
            "answer_text": "Well, I suppose “liquid” beats out the other three, just because so much of the planet is molten inside. There’s not much plasma here at all, so that’s clearly in last place. Gas comes in third, I think. I know the atmosphere extends far into space, but it just keeps getting thinner and thinner. The Earth gets denser as you go down, so gas is out of the running. The ground is solid rock, but only down a few miles or so. In fact, If we go by volume, gas would beat solid. But again, rock gets denser and air gets thinner, so I think solids are second. We could probably debate the order of gas and solid in the line up. That puts liquid in the lead. The surface is covered in water, the outer and inner mantles are molten rock, and they are the lion’s share of the mass and volume of Earth. Liquid wins. ",
            "date": "Answered June 28, 2020",
            "views": "128",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ian Marr",
                "href": "/profile/Ian-Marr-4"
            },
            "answer_text": "There are several ways to answer your question. The whole earth? The mantle makes up the bulk of the Earth, so liquid. From the ground up? By volume? That would be the atmosphere mostly, so gas. From the ground up? By mass? Either liquid (the oceans) or solid (solid matter) depending on how you define things. ",
            "date": "Answered June 25, 2020",
            "views": "89",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        }
    ]
}