{
    "title": "What is inside of a black hole? - Quora",
    "tags": [
        "Black Holes",
        "Gravity",
        "The Universe",
        "Cosmology",
        "Astronomy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mehran Moalem",
                "href": "/profile/Mehran-Moalem"
            },
            "answer_text": "Other answers given as well as many physics essays you might have read usually speculate that we do not know what is inside a black hole. I dare to speculate that not only we do know, we readily experience it all the time. I hope you and Quora moderators will not excommunicate me for thinking a black hole is exactly the universe we live in. If you take the mass of the universe and calculate the Schwarzschild radius for that mass, it comes to exactly 13.7 billion light years. Does this distance seem familiar to you? Yes that is exactly the radius of our visible universe. So we are inside a black hole and there is a whole real world outside the bounds of our universe wondering what is inside this super super massive black hole. If you are too disturbed by this notion bear with me and think of this as the plot of a new science fiction movie. So to answer your question what is black hole made of or better yet what is inside a black hole.  The notion that we do not know what is inside a black hole comes from the fact that no light or information can make it across the event horizon. But if you are already inside the black hole (i.e. closer than Schwarzschild radius to the singularity) then fundamentally nothing will stop you from knowing what is inside. You can actually communicate with your surroundings. Light and information does travel around inside the event horizon from point to point so this is consistent with our current existence. Now that you know we are inside a black hole, let me blow your mind by considering other non-trivial things. You always hear that black hole is this giant sucking vacuum swallowing everything. Even some answers here emphasize that inside a black hole everything is falling into the center of singularity. As long as no information comes out from inside a black hole any speculation can be right. Authors can claim inside of black hole is made up of flying pigs and one can not argue otherwise. But take a look around. We are inside this very large black hole called the universe. Do you see everything falling in toward a center? Better yet, where is that center? In our universe, any point let’s say this corner of my office desk is the exact center of the universe. I do not really feel everything is falling in though. Go an step further. The big bang theory and dark energy argument actually is that not only things are not falling in, but actually everything is running away from each other and the universe is in constant inflation. Isn’t that non-trivial for the inside of a black hole. Another interesting thought is what I like to think of as onion theory. We know there are black holes in our universe. Heck, there are supermassive ones at the center of most galaxies. We have no information about the inside of those black holes because light does not get out from inside them and by the same token entities within those black holes do not know about our universe.  Now expand your horizon. What do we know about outside of the boundary of our visible universe. We do not have any information. I guess there is a whole other super universe out there and there maybe these intelligent beings living out there on the next layer of this onion looking at our universe (which appears to them as a black hole) and wondering how is the physics inside there. Now any bets on how physics behaves out there. I am willing to bet that their speed of light maybe different than our speed of light? And yes over there maybe the electric field strength drops with the cube of distance not square. In other words the physics on the two sides of an event horizon can be very different and you will never know. Who would have though onion is good food. Food for thought. ",
            "date": "Answered January 27, 2017",
            "views": "43",
            "upvotes": " View 43 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harold Muniz",
                    "user_href": "/profile/Harold-Muniz-1"
                },
                {
                    "user_id": "Pedro Luis",
                    "user_href": "/profile/Pedro-Luis-36"
                },
                {
                    "user_id": "David Berger",
                    "user_href": "/profile/David-Berger-56"
                },
                {
                    "user_id": "Devendra Singh",
                    "user_href": "/profile/Devendra-Singh-1679"
                },
                {
                    "user_id": "Jessica Flowers",
                    "user_href": "/profile/Jessica-Flowers-25"
                },
                {
                    "user_id": "Vipul Patel",
                    "user_href": "/profile/Vipul-Patel-216"
                },
                {
                    "user_id": "Gurpreet Singh",
                    "user_href": "/profile/Gurpreet-Singh-12624"
                },
                {
                    "user_id": "Alisha Mirza",
                    "user_href": "/profile/Alisha-Mirza-14"
                },
                {
                    "user_id": "Naimul Sajid",
                    "user_href": "/profile/Naimul-Sajid"
                },
                {
                    "user_id": "Janko Walski",
                    "user_href": "/profile/Janko-Walski-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "S Jegannath",
                "href": "/profile/S-Jegannath-4"
            },
            "answer_text": "INTERESTING! Let’s Start by understanding what it is. Not going into really complicated physics, Simply speaking, Everybody gangsta until the mighty star explodes. (a really really big star explodes, leaving behind a black hole behind.  The black hole formed will have many of the star’s properties magnified, (like spin) so it’s safe to say that a black hole is seriously lethal. To understand on why we can’t really know what’s inside, We can look at how their existence was predicted. In 1700’s or sometime like that, john michell (i barely have a idea whether or not i wrote it rightly or not, feel free to correct me), used Newtonian mechanics and the concept of escape velocity( The velocity you must/an object must have to escape some object’s gravitational field). For earth it was found out to be 9.8m/s. So john asked something really simple. Can an object exist with an escape velocity equal to speed of light? Universality of speed of light was clearly established, but there were some who believed this to be true. Clearly john was one of them. He calculated and arrived at the famous formula Clearly such an object was black and since nothing could escape it, not even light, it was deemed as the ultimate object and was called Black hole. Anyways getting to our case of what’s inside, imagine that You fall into one. First of all, RIP. Secondly, Consider falling into a stellar mass black hole. Now imagine going towards this monster. You would at first, fell the gravitational force increase. You would feel some terrible force as you push yourself closer and closer.  But let’s say that you get a suit that can protect you from infinite gravity and provide you with endless food, water oxygen and has it’s inbuilt toilet system and all. So as you approach it you are going to get hit by a lot of radiation! Wait a minute……Wasn’t black hole supposed to suck everything in? It’s called Hawking radiation and it’s arising due to Quantum mechanics. This radiation will get powerful as you get closer. But your suit assures your safety. Then you look back and you are just surprised. You will see the universe move in time, really fast. Star’s will move in absurd patterns. Everything will be starting to get confined in a smaller and smaller circular portion. If you don’t get it, see the gif below.  To simplify what’s happening, you are viewing the universe in fast-forward! As you move inwards, you fell the force getting really powerful. But you are safe. As everything outside turns black, you look inside. It’s all black right? Not exactly. Whatever went inside the black hole previously might have went in long ago like millions of years ago but that’s from outside the black hole perspective. For the thing that went inside, it wasn’t really that long.(The interstellar’s miller planet way. For cooper it was 3.5 hours but for humanity it was 23 years). But anyways viewing it would not be practical as the photons that leave it would be sucked inside the black hole. But since it didn’t have the suit you have, It would be Spaghettified. Tidal forces would rip them apart and as you move inside, it’s velocity will go super high. Some particles would be boosted so high that you would view them turning into energy forming light as you pass them by. While on the other hands, many other particles would be launched to super high speed and thus, the inside of a black hole would seem like nothing more than a gigantic particle accelerator. Particles colliding and interesting stuff happening would mean that it would liberate some light and this would be the last light you would see.  Something like this but a lot less. Now physics says one more thing. Inside a black hole, the metric for both, space and time flip! So you are experiencing time in such a way that no one else can experience! Congratulations!!!!!!!! If that makes you feel any better. Then as the gravity becomes enormous, all the particles will collide leaving a really high temperature fire wall barrier. According to some, this comes way early in such a black hole, So let me tell you the time scale. Although time won’t go that way but you know how to count from 1 to 60 and so on. So imagine a time scale and count and you might get this wall of fire within sometime like 10–40 count. It might be earlier or even later. So now, everywhere around you, there is quark-gluon plasma and everything around you is either energy or elementary particles going crazy. Their effects are relativistic. At this point Quantum gravity physics might help. MIGHT…………. We don’t exactly know what happens to particles beyond this range, but now light can certainly not reach your eyes and things slowly go red and dark. Count for some more time. After your count reaches something like 80 or 100, Modern Physics is nearly gone. At this moment, some scientists predict the break down of Higgs field! Many heavier quarks are now accelerating so high that they want to decompose but the pressure on them makes them remain stable. At this point they turn into Strange quarks and now things are bizarre. But they last for a short while. After one point, all that’s left is energy. It’s temperature? What is the mean temperature of a black hole? I found an answer from Cosmology student Henry Norman who calculated it using various formulas and i suggest you to see his answers and read it fully. It would give a better understanding on black holes for our purposes and he gives the final mean black hole temperature of black hole. But at this point it’s just around 0. Because heat means the mean oscillation of atoms and there are none except you! Soon…….nothing new will happen. Very much much much much later, so later that the old writer was my father…………………….again nothing will happen. No you won’t fall into a tesseract or anything. There are speculations that you might end up in a wormhole to a parallel universe or in your own universe, but very very far away. Most likely, NO. Even if yes …………………………………….. it would take an infinitely large amount of time to go through that. It’s hopeless. You would die of aging or you would be bored to your last minute, so much that you would pretty much commit suicide and liberate yourself. That would be infinity but where is this infinity in space. I mean, that we can see all around the black hole. For example see this image.  The black hole is confined. So if we are travelling infinitely, where is this infinity in this picture? The answer is the beauty of General relativity. Remember that black holes cause a curved well infinitely deep in the space time graph? That’s where you are travelling in! 3Dimensional world to 4Dimensional world! That’s the power of black holes.  Or maybe not. It’s not infinitely deep. It’s finite but our experience makes it seem so. Now let’s get to the interesting part.Singularity. This is the real trouble maker. The head of your bully gang. It’s basically a space with zero volume and infinite density! At this point you should be dead but you are alive thanks to the suit. But your journey should end here. Singularity is the furthest point you can get to. After this, the singularity would attract you so much that if you reach there, you stop. But again there wont be too many factors with which you can really tell it that you are stopped or moving but considering that G-Force does something to your body despite being protected, you should be able to differ from motion and stop. That’s it. But the story doesn’t end here, if i were to give one more special power to you guys. The suit makes the wearer IMMORTAL. So now, you can wait there. Remember that the suit provides you everything. So you are safe. since I told you that it’s a stellar mass black hole, you must wait for it to evaporate! Yep. EVAPORATE. I wont tell you how this is true . It’s a part of your homework so go learn something new. Don’t expect everything to be handed down. Plus my hands hurt from typing. (It’s a joke guys). Anyways, you wait for around 10^70 years for a black hole with 2 or 3 times the mass of our sun. Then the black hole will explode and if in the future humans survive…then say hello to them and say to them that you were stuck in it for a really long time. But then why stop there?! We don’t only have a stellar black hole, but we also have a Supermassive black hole. I won’t say anything special about it, except that you can actually, without a special suit like the one you assumed you had, with the normal astronaut suit, you can last more longer, because there is a thumb rule in black hole physics The further away from the singularity you are, the safer you are. So potentially speaking, you will be safe, for much much longer. Then there are spinning black holes, again for which nothing big changes and your death time depends on it’s classification, but spinning black hole has an effect which i let you know for your knowledge. It’s called Frame dragging effect and it creates another layer around itself called Ergosphere, from where escape is still possible. But in spinning black holes(I almost forgot this) there are controversies about how singularity can’t really exist, because a single point can never spin or even if it does, it’s effects are barely noticeable and hence negligible. So scientists came up with this new idea that from point, we collect them to get a ring or -Ringularity  It’s not complicated at all. Just like the singularity, with all it’s properties, yet not the same in shape!. ",
            "date": "Answered February 28, 2020",
            "views": "11",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Henry Norman",
                    "user_href": "/profile/Henry-Norman-3"
                },
                {
                    "user_id": "Naimul Sajid",
                    "user_href": "/profile/Naimul-Sajid"
                },
                {
                    "user_id": "Aryan Gupta",
                    "user_href": "/profile/Aryan-Gupta-1425"
                },
                {
                    "user_id": "Babak Tahmasbi",
                    "user_href": "/profile/Babak-Tahmasbi"
                },
                {
                    "user_id": "Harika Vv",
                    "user_href": "/profile/Harika-Vv"
                },
                {
                    "user_id": "Neeraj Kumari",
                    "user_href": "/profile/Neeraj-Kumari-16"
                },
                {
                    "user_id": "Nandan Patel",
                    "user_href": "/profile/Nandan-Patel-17"
                },
                {
                    "user_id": "Morris Albert Figeredo",
                    "user_href": "/profile/Morris-Albert-Figeredo"
                },
                {
                    "user_id": "Mohammed Abdul Mateen",
                    "user_href": "/profile/Mohammed-Abdul-Mateen-36"
                },
                {
                    "user_id": "Rohit Kamle",
                    "user_href": "/profile/Rohit-Kamle-1"
                }
            ]
        }
    ]
}