{
    "title": "What does it mean for motion to be relative? - Quora",
    "tags": [
        "Motion (physics)",
        "Relativity (physics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gregory Scott",
                "href": "/profile/Gregory-Scott-5"
            },
            "answer_text": "If you are on a bus or in a car with the windows shut, and the car is travelling at a constant speed on a straight road, you might not even know you are moving. For example, if you blow up a toy balloon, and toss it straight up, it will come straight back down. If you lay a ball on a level floor, it will not roll. You and the other objects in the vehicle are travelling with the same speed and direction. The other objects are stationary in relationship with you. If you are travelling at 70mph, and a vehicle is coming in the opposite direction at 70mph, your relative motion is 140mph. At the same time, you are on a point on the planet’s surface that is rotating tens of thousands of miles per day, and on a planet that is orbiting the sun at high speed, and the solar system is orbiting the galaxy at high speed, and the galaxy is moving in relation to other galaxies. What is moving, and how fast, and in what direction depends a lot on where you are standing. Thus, the motion is relative. Nobody has any idea of any way to find something or someplace that is “absolutely” stationary. ",
            "date": "Answered August 4, 2016",
            "views": "38",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mosweu Katlego",
                    "user_href": "/profile/Mosweu-Katlego"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sammy Ngari",
                "href": "/profile/Sammy-Ngari"
            },
            "answer_text": "The whole idea of motion only applies from a certain perspective. Picture me on a moving bike, my friend on another moving bike beside me and you standing on the side of the road admiring the crap out of the both of us (that last part is absolutely useless but I’d rather picture you admiring me than me admiring you). Anyway, you look at us cruising by, probably drop a drink or anything that’s in your hands to be more dramatic, and you see us moving past you. From your perspective, its the two most awesome dudes you’ve ever seen that are moving. From my end, I look at you there, eyes big and drooling, and I see you move past us headed the opposite direction. I look at my fellow bundle of awesomeness beside me and I don’t see him moving. He is just sitting on his bike beside me. It is the rest of the world, you included, that is moving past us. So from your perspective, we are moving relative to your position and you are standing still. But from my perspective, you rushed past us and we are completely still. How can we ever prove who was moving and who was not? Its just your word against mine buddy. ",
            "date": "Answered August 4, 2016",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dawn Otu",
                    "user_href": "/profile/Dawn-Otu"
                }
            ]
        }
    ]
}