{
    "title": "What fills the 99.9% empty space in atoms? - Quora",
    "tags": [
        "Atoms"
    ],
    "response": [
        {
            "author_info": {
                "name": "JB Northwest",
                "href": "/profile/JB-Northwest"
            },
            "answer_text": "The questioner should be forgiven for asking this as almost every textbook or website displays space-filling models as neat little balls. Other models show pretty 3D petals and other more exotic shapes. They all look like they might be empty inside, and then there’s the word “shell”, never mind “orbital”. Maybe a good follow up question would be what does “empty space” really mean. I think there is still utility in viewing electrons as objects which have some localization in space. An electron can be here, and not over there. Sort of. An electron can be associated with an atom, or it can leave the atom. Once it leaves I think it’s meaningful to talk about the space around that atom as now empty of the electrons’s presence. However, that space is not empty. I suppose if the space was empty, then nothing would fill it by definition. But let me reiterate, space is not empty. It’s a weird universe. ",
            "date": "Answered November 26, 2018",
            "views": "379",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Elle Engelo",
                    "user_href": "/profile/Elle-Engelo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Csaba Daday",
                "href": "/profile/Csaba-Daday"
            },
            "answer_text": "This is a huge pet peeve of mine. There is NO empty space in atoms. Electrons have the highest spatial density right in the middle of the atom, and it gradually decays. This is true for the 3D densities of atoms and molecules as well. But simply because there is more space at larger radii, the radial density,  has a peak at higher r (where  is the 3D density, which only depends on the radius here as atoms are spherically symmetric). Atoms are not made of empty space, their entire volume is filled up by electrons, and molecules are also not made up of empty space, as the electron clouds of bonded atoms overlap. Scientists wanted to blow our mind with this 99.9% metaphor but ended up teaching us that is just mathematically wrong. ",
            "date": "Answered November 25, 2017",
            "views": "797",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alex Moreno",
                    "user_href": "/profile/Alex-Moreno-11"
                },
                {
                    "user_id": "Tom Chesters",
                    "user_href": "/profile/Tom-Chesters-1"
                },
                {
                    "user_id": "A. Ussher",
                    "user_href": "/profile/A-Ussher"
                },
                {
                    "user_id": "Joseph Kowhai",
                    "user_href": "/profile/Joseph-Kowhai"
                },
                {
                    "user_id": "Petra Blackstone",
                    "user_href": "/profile/Petra-Blackstone-1"
                },
                {
                    "user_id": "Valentin Simion",
                    "user_href": "/profile/Valentin-Simion-1"
                },
                {
                    "user_id": "Steven Spielman",
                    "user_href": "/profile/Steven-Spielman"
                }
            ]
        }
    ]
}