{
    "title": "What are the chemical compounds in SSD solution? - Quora",
    "tags": [
        "Chemical Compounds",
        "Organic Chemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pete Gannett",
                "href": "/profile/Pete-Gannett"
            },
            "answer_text": "As Barry Gehm wrote, this is a hoax. Check out part of the text for SSD solution (found at Buy SSD Solution Online, SSD Solution for sale, Buy SSD Online): International Chemical Industry, Plus official website. We are one of the fastest growing money cleaning company in the worldwide, and as our company is still growing, we do cater for individuals and small companies, please that some products need special licensing. We specialized in cleaning anti breeze bank notes and stained black money with SSD solution chemical, and our expert team consists of specialist scientists as well as laboratory technicians with well-trained knowledge in as specialized in the field. We now serve in the USA, UAE, UK, Europe, Middle East, North and South Asia just to mentioned a few with over 23 offices worldwide. Basically they say that SSD solution is used for money laundering. ",
            "date": "Answered January 15, 2019",
            "views": "27",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jamal Javan",
                    "user_href": "/profile/Jamal-Javan"
                },
                {
                    "user_id": "David Clive Ramsey",
                    "user_href": "/profile/David-Clive-Ramsey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barry Gehm",
                "href": "/profile/Barry-Gehm"
            },
            "answer_text": "SSD solution is just a hoax, part of an internet scam. What is SSD cleaning solution used for and is it illegal? ",
            "date": "Answered September 18, 2017",
            "views": "609",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Yehoshua Sivan",
                "href": "/profile/Yehoshua-Sivan"
            },
            "answer_text": "Read this answer: What is an SSD solution chemical? What is its price? ",
            "date": "Answered July 7, 2018",
            "views": "790",
            "upvotes": "0"
        }
    ]
}