{
    "title": "What are some examples of relative motion? - Quora",
    "tags": [
        "Motion (physics)",
        "Relativity (physics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Victor Mazmanian",
                "href": "/profile/Victor-Mazmanian"
            },
            "answer_text": "Here are three examples: (1) In the movie “Speed” with Sandra Bullock and Keanu Reeves, we have a marvelous scene where relative motion is clearly exhibited. There is a bus (with passengers) that cannot be driven under 50 mph, otherwise it will explode because there is a bomb in the bus that will explode if the bus’ speed is under 50 mph. The EMT/Police team attempt to save the passengers, and at a certain time in the bus’ dangerous trip, the bus is on a horizontal stretch of road (at LAX!) The team take their vehicle and drive parallel to the bus, and they match the bus’ speed within 0.1 mph if not exactly. They then ask the passengers to hop onto their vehicle. But the passengers did not need to hop. They simply stretched their legs unto safety! The reason why this happened is because the VELOCITY of the bus RELATIVE to the velocity of the vehicle was ZERO. So the passengers simply were going off a “stopped” bus! (2) The Space Shuttle orbits the Earth at around 18,000 mph. The astronauts sometimes take a “space walk” such as when they repaired The Hubble Telescope. They get out of the Space Shuttle, and RELATIVE to Earth, they are traveling at 18,000 mph (that’s some “walk”!) But RELATIVE to the Shuttle, their speed is ZERO, or a very LOW speed just enough to make them reach the telescope. (3) I have actually performed this experiment decades ago: a bowling bowl is ejected from a moving car that has a “moonroof” (with the moonroof open) while the car is going at CONSTANT VELOCITY. The bowling bowl will exit the moonroof and without damaging anything, will fall right back. The way I did it was I put the car on cruise-control at 42 mph. As I entered a stretch in the road where it was fairly straight for about a mile, I ejected the bowling bowl. Just as expected, the bowling bowl cleared the sunroof about 15 cm, and fell right back on its ejection pad. The reason for this was that RELATIVE to the PAVEMENT, the ball was traveling at 42 mph. But relative to the CAR, the ball was at rest. Then it was simply a projectile in the vertical direction! This video from U-Tube illustrates the LAB version of the above:  ",
            "date": "Answered June 20, 2018",
            "views": "77",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nan Shu Kyi",
                    "user_href": "/profile/Nan-Shu-Kyi"
                },
                {
                    "user_id": "Snahendu Majumder",
                    "user_href": "/profile/Snahendu-Majumder"
                },
                {
                    "user_id": "Vimal Lenin",
                    "user_href": "/profile/Vimal-Lenin"
                },
                {
                    "user_id": "Sunny Sinha",
                    "user_href": "/profile/Sunny-Sinha-80"
                },
                {
                    "user_id": "Jennifer Cash",
                    "user_href": "/profile/Jennifer-Cash-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Chatham",
                "href": "/profile/Mark-Chatham-2"
            },
            "answer_text": "“Relative Motion” is a rather open term. For example 2 ships meet in the ocean and move apart each at 30 kph. From the point of origin (Where the ships met in the ocean…) both ships are moving at 30 kph in opposite directions. The perspective is different from either ship. From either ship the observer seems to be stationary and the other ship seems to be moving away at 60 kph. Now the above example is just about items moving relative to each other… I believe that your real question is in regards to Relativistic Motion where one or more are moving closer to the speed of light. As items move closer to the speed of light the relative positions or items and observers become much more important. The reason is that distances, velocities, accelerations, and time are all distorted via the Lorentz Equations. Due to these distortions it is critical to understand the relative behaviors between different moving items and relative position of any observer. Most modern physics defines this as the “observed” discipline of physics called Relativity. The reason I use the term “Observed” is the science is generated from observations but not derived from other physics laws. I have radical theories that explain Relativity from a derivation of fast moving particles and the effects of classical electrodynamics upon those particles. Only part of my theory on Relativity is published today as Lecture 4 and 29 on www.hphysics.com. Future Lectures will define the physics behind the different apparent behaviors due to Relativity and the next lecture under Relativity is “How to move faster than the speed of light” which is targeted for release by the end of this month. Others I hope to have released by end of year…. Depending how quickly I am able to introduce the mapping of the Quantum Tunneling effect and how to do first level Fusion. ",
            "date": "Answered June 6, 2018",
            "views": "45",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Manisha Jha",
                    "user_href": "/profile/Manisha-Jha-177"
                },
                {
                    "user_id": "Snahendu Majumder",
                    "user_href": "/profile/Snahendu-Majumder"
                },
                {
                    "user_id": "Yusuf Serry",
                    "user_href": "/profile/Yusuf-Serry"
                }
            ]
        }
    ]
}