{
    "title": "What would happen if gravity were the same on the Moon as on Earth? - Quora",
    "tags": [
        "The Moon (astronomy)",
        "Gravity",
        "Earth (planet)",
        "Planetary Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shreeram Murali",
                "href": "/profile/Shreeram-Murali"
            },
            "answer_text": "What exactly does one mean by “gravity”; is it the acceleration due to gravity, or the force of gravity itself?  Acceleration due to gravityThe acceleration due to gravity on a surface of a body is dependent on the mass and the radius of the body. If one wanted to have the same acceleration due to gravity on the surface of the Moon, then they’d have to accomplish one of the two things: Increase the mass of the Moon approximately by a factor of 6.Decrease the radius of the Moon by a factor of 2.45 (square root of 6) while keeping the mass constant.I have no idea how you’re planning to do that, but assuming it’s somehow accomplished: First case — If the mass of the Moon is increased, this could have devastating consequences. Moon’s gravitational force would increase six times, and would collide with Earth. Needless to say, life as we know it would perish. Image Source: ZME Science. Second case — The Moon would become significantly smaller in the night sky. That’s about it. There would be no immediate danger from this, but there might be some long term implications. Force of gravityThe force exerted by Moon on Earth is the same as the force exerted by Earth on Moon. Nothing would happen. ",
            "date": "Answered June 16, 2017",
            "views": "18",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Silje Bergmann",
                    "user_href": "/profile/Silje-Bergmann"
                },
                {
                    "user_id": "Ahita Blackening Storm (Whakaaniwaniwa)",
                    "user_href": "/profile/Ahita-Blackening-Storm-Whakaaniwaniwa"
                },
                {
                    "user_id": "Akhirzeb Sheikh",
                    "user_href": "/profile/Akhirzeb-Sheikh"
                },
                {
                    "user_id": "Tirumalai Kamala",
                    "user_href": "/profile/Tirumalai-Kamala"
                },
                {
                    "user_id": "Pete Laberge",
                    "user_href": "/profile/Pete-Laberge"
                },
                {
                    "user_id": "Planetary Wanderer",
                    "user_href": "/profile/Planetary-Wanderer"
                },
                {
                    "user_id": "Jonathan Brill",
                    "user_href": "/profile/Jonathan-Brill"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mihir Singh",
                "href": "/profile/Mihir-Singh-22"
            },
            "answer_text": "If moon was to suddenly gain enough mass that it would have a gravity equal to that of the Earth then, suddenly there would be much more inward force on the moon and the moon and Earth would collide with a massive BOOM. All living things would go extinct and Earth would take another billion years to settle down to its new double mass form. But by then the sun would become a red giant and unfortunately our Super Earth would have to be a patch of barren land with lava all around for thr rest of its days. ",
            "date": "Answered May 20, 2018",
            "views": "456",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Niyam Majithia",
                    "user_href": "/profile/Niyam-Majithia"
                },
                {
                    "user_id": "Edward Lee Coma",
                    "user_href": "/profile/Edward-Lee-Coma"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Black",
                "href": "/profile/Robert-Black-53"
            },
            "answer_text": "Short answer? There would be no life on the Earth. That would mean that the Moon would be the same size as the Earth. At the current distance, we would become a binary planetary system where the center of rotation would be half the distance between us. Figure that currently the Moon is about 1/6th the size of the Earth. Notice the tides? Now multiply the effect by 6!! Not to mention that at such a close distance (Though far outside the Roche limit), the tidal effects wouldn't be limited to water, the actual crust of the Earth would bulge towards the Moon as we orbit each other, causing constant earthquakes, volcanos etc. The Earth would not be a place to live at all! ",
            "date": "Answered June 16, 2017",
            "views": "761",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Masai Urbanus",
                    "user_href": "/profile/Masai-Urbanus"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Nash",
                "href": "/profile/James-Nash-20"
            },
            "answer_text": "The question can be interpreted two ways. If the force of gravity at the surface of the moon was the same as the earth and the mass of the moon remained the same, nothing would happen on earth, but we could walk around on the moon in the same way as we do on earth. If the mass of the moon were the same as the earth, the center of rotation in the earth-moon system would be in the center between the centers of earth and moon, and the effect of the moon on oceanic tides would be significantly greater. ",
            "date": "Answered June 16, 2017",
            "views": "409",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Mattison",
                "href": "/profile/Robert-Mattison-4"
            },
            "answer_text": "There are no such thing as stupid question on Quora now read this E-article How Mars lost its atmosphere, and why Earth didn’t you answer is enclose here. The video is an added bonus to your question. Now you know the rest of the story.  ",
            "date": "Answered January 17, 2018",
            "views": "141",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Yogishchandra Kamath",
                "href": "/profile/Yogishchandra-Kamath"
            },
            "answer_text": "You wouldn’t exist to ask this question. A useful rule of thumb is that a planet will retain a certain gas in its atmosphere only if the escape velocity at the surface of the planet is more than 6 times the RMS velocity of the gas at the temperature prevalent on the surface…. The moon fails the test (for oxygen) and so would earth if it had the same gravity. ",
            "date": "Answered November 21, 2017",
            "views": "447",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sunkoshi Manpower",
                    "user_href": "/profile/Sunkoshi-Manpower"
                },
                {
                    "user_id": "Kata Vidošušić",
                    "user_href": "/profile/Kata-Vidošušić"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shubham Jayant",
                "href": "/profile/Shubham-Jayant-3"
            },
            "answer_text": "Then Earth will be tidally locked with Moon Or moon will always try But it's sure that days would been more longer than usual. And earth and moon will dance like Pluto and Charon Because there centre of gravity lie somewhere between them Tides were more high and low than usual ",
            "date": "Answered December 6, 2017",
            "views": "242",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Akash Ayyagari",
                    "user_href": "/profile/Akash-Ayyagari-2"
                },
                {
                    "user_id": "Siddhant Maksare",
                    "user_href": "/profile/Siddhant-Maksare"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emmanuel Dhanaraj",
                "href": "/profile/Emmanuel-Dhanaraj"
            },
            "answer_text": "it cannot;since basically gravity is related to size.the bigger the body ,the stronger the gravity.moons gravity is about 1/6 of earth's. that means if you can jump 4 feet high on earth,you can possibly jump 6 times more on the moon.the reverse is also true .if you are in Jupiter ,the gravity would be so strong that you will be stuck to the ground fast .you possibly cannot even http://move.so great would be the gravity! ",
            "date": "Answered May 21, 2018",
            "views": "199",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Johan Van Woensel",
                "href": "/profile/Johan-Van-Woensel"
            },
            "answer_text": "The force exerted by the moon on the Earth is the same as the force exerted by the Earth on the moon. ",
            "date": "Answered October 30, 2014",
            "views": "463",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Naveen Sajjanar",
                    "user_href": "/profile/Naveen-Sajjanar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robin Hatter",
                "href": "/profile/Robin-Hatter"
            },
            "answer_text": "We were not here to use our devices or to live. ",
            "date": "Answered May 21, 2018",
            "views": "69",
            "upvotes": "0"
        }
    ]
}