{
    "title": "What are the impacts of technology on space exploration and life on Earth? - Quora",
    "tags": [
        "Impact",
        "Space Travel",
        "Space Exploration",
        "Outer Space",
        "Earth (planet)",
        "Astronomy",
        "Science",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Howard Woodward",
                "href": "/profile/Howard-Woodward-4"
            },
            "answer_text": "As Robert Hillenbrand cites in his answer to your question, the world entering the space age spurred accelerated interest and growth in the entire gamut of manufacturing and technology. Commencing with the creation of new materials, advanced computerization, and investigating concerns for humans living in weightlessness were put on the fast track. Further incentives were the powered by President Kennedy who ordered sending a man to the Moon and returning him safely to Earth, and the “space race” between Russia and the United States propelled both countries into high gear. NASA came out a winner, as did Russia and China who also made considerable contributions to the space programs. ",
            "date": "Answered October 25, 2020",
            "views": "112",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Parth Sharma",
                    "user_href": "/profile/Parth-Sharma-1210"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Hillenbrand",
                "href": "/profile/Robert-Hillenbrand"
            },
            "answer_text": "Simple answer: People are going to look back and realize that this is one of the greatest changes in history. You probaly won’t see it but I do because I grew up before any of this happened. I am kinda of tires out answering this qwuwrtiin - b ut the simple answer is that EVERYTHING has changed as result of the “Space Age”. Trust me - I’ve seen it ! : ) ",
            "date": "Answered October 24, 2020",
            "views": "9",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Howard Woodward",
                    "user_href": "/profile/Howard-Woodward-4"
                },
                {
                    "user_id": "Naba Alhameed",
                    "user_href": "/profile/Naba-Alhameed"
                }
            ]
        }
    ]
}