{
    "title": "What is nanotechnology? - Quora",
    "tags": [
        "Nanotechnology",
        "Word Definitions, Terminology, and Jargon",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Bruns",
                "href": "/profile/Mark-Bruns"
            },
            "answer_text": "It would appear that you have found the Wikipedia entry unhelpful, perhaps misleading, over-edited in a biased fashion by wikipedian nano-SS and nano-partisan guerrillas ...you are correct to never trust anything printed on electrons, but the Wikipedia entry is not completely bogus ... there are small mistakes, very small ones ... I'd still start there;  http://en.wikipedia.org/wiki/Nanotechnology  Unless of course, you asked this question to obtain alternative views of what nanotechnology is from the quorasphere ...in that case, nanotechnology is:   A new, very small religion based upon the nanotheological worship of infallibility of science [and the need for unlimited spending by government on bureacratically-administered scientific research] advocated by the high priest of this religion such as Richard Feynman, Ray Kurzweil, Steven Chu ... mantras of this new religion include:  \"There's plenty of room at the bottom!   \"The singularity is near!\"  \"Yes, we can!\"  It's tough to argue against the followers of this religion -- they've watched every Discovery program known to humankind!  Their faith is very real to them.  A research blackhole drawing seemingly infinite amounts of basic research funding and some applied R&D capital from large research organizations in different nations around the world ... corporations are not investing -- corporations don't invest in real R&D, they acquire [although they wont' be able to find nano companies for awhile]... all sides agree that the fruits of this research have been very small.  Russia has been one of the leaders in supporting nanotechnology research; certainly the leader in percentage of GDP ... which sort of tells you something.  It's important to remember that when it comes to copying what other people are doing, the Russians have developed undisputed first mover advantage.  Industrial espionage and copying are a core competency in the administration of Russian research.Something that you can make fun of endlessly ... it the same as making fun of short people -- it's too easy, like shooting fish in a barrel -- small, short fish.  You should make your jokes now, because there are some rumors circulating that jokes about nanotechnology will be outlawed by the Geneva Conventions on Crimes Against Humor ... of course, the response to that is: \"Small chance!\" Something you can't ignore and probably should follow [with a tiny amount of your free time] because, every now and then somebody pulls off something truly spectacular that makes me stop and think, \"Wow!  I dunno, but that might be really important!   Maybe not as big as the George Foreman grill, but maybe pretty important ...\"   For example http://www.rdmag.com/News/2010/09/Energy-Solar-Energy-Solar-Cells-Thinner-Than-Wavelengths-Of-Light-Hold-Huge-Energy-Potential/  Ever time I see things like that, I make another small investment in nanotechnology ... if you squint, you can almost see my acquired earnings right here.     ",
            "date": "Answered October 7, 2010",
            "views": "17",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vishal Targotra",
                    "user_href": "/profile/Vishal-Targotra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mayank Agarwal",
                "href": "/profile/Mayank-Agarwal-908"
            },
            "answer_text": "Nanotechnology: Where Imagination Meets Reality  “Nanotechnology is the idea that we can create devices and machines all the way down to the nanometer scale, which is a billionth of a meter, about half the width of a human DNA molecule” – Paul McEuen The ship of the science sailed through the imagination to reality. Science empowered every industry structure by improving their work efficiency, products, strength and by reducing cost expenses. The term of Nano-technology had been first coined by Norio Taniguchi in 1974, since then it is utilized to change the application of material. Every industry is now exploring the possibilities with this new technology. Industries like Healthcare, Sports, Automobiles, Electronics, and Environment are particularly witnessed fruitful benefits of nanotech. Reforming Future of Healthcare Various industries are considering different aspects of Nano tech and employing this technology to generate more and more benefits. Medicinal industries are deploying the modern Nano tech fueled machines to provide exceptional health profits, like curing cancer and slowing down the natural aging. With the help of Nano-tech, cell walls penetrate easily and help cancer treatment. Nano bots can localize the disease site and deliver the drug precisely in right part of the body and releases the drug according to the schedule. The conventional treatments for cancer involve radiotherapy or chemotherapy, both the processes are very painful, changing the procedure and employing Nano bots the process becomes less painful for the patient. “Nanotechnology in medicine is going to have a major impact on the survival of the human race”. Bernard Marcus Automotive: Not Just a Four Wheel Thing In automotive industries Nano-tech considered as the game changer. Automotive Industry as whole relies on the compatibility and modern technology which can benefit in low fuel consumption, safety, comfort, eco-friendly and budget oriented in material. With the wide scope of this technology Nano tech offers the light weight, reduction in friction and emissions by the engine, reduced corrosion resistance, UV resistance, and advanced electronics and sensors. Read more: Nanotechnology - Where Imagination Meets Reality | CIO Look ",
            "date": "Answered January 15, 2019",
            "views": "623",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "ZayD ZayaN siD",
                    "user_href": "/profile/ZayD-ZayaN-siD"
                },
                {
                    "user_id": "Insights Success",
                    "user_href": "/profile/Insights-Success-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sripadh Guptha",
                "href": "/profile/Sripadh-Guptha"
            },
            "answer_text": "In this fast-paced world, people are often tangled up with their own lives. This leads people to follow a common notion- ‘the faster, the better’, ‘the compact, the better’, ‘the durable, the better’. To achieve this feat, nanotechnology is an important tool required. Nanoscience- a fresh perspective: To explain nanoscience in common man’s perspective, imagine a toy building made from tiny building blocks, like LEGO. Now, the whole structure of the building can be changed by altering the orientation and alignment of the building blocks. Similarly, the products which we come across every day, like garments, bags, food etc. are analogous to the toy building which we imagined and the molecules making up the products to tiny LEGO blocks. Any alterations made to the basic structure of the material brings, about considerable change in the physical properties of the final product.  Image credit: Grow learning company Nanotechnology in daily life: When you say nanotechnology, many refer it to an idea from science fiction or futurism. It is something that is happening right now and transforming our way of living. What would you say if I tell you that, right now you are possessing a device, that is computationally million times faster than the onboard and off board systems of Apollo 11 space mission. This example gives us an insight on the potential of nanotechnology in effecting our lives and necessities. Future of nanotechnology: The development of nanotechnology is going on at a steady pace for past few decades. This is mainly attributed to the fact that, as we go deeper into the applications of nanotechnology, we reach a point where we require new tools to understand their behaviour. Nevertheless, if nanotechnology picks up some pace, then quantum computing will be the next big thing. In a nutshell, nanotechnology itself can be a great inspiration to us. Since ‘nanotechnology is an idea of making great things from small things’. So in life, for great things to happen, never give up on small things’. ",
            "date": "Answered January 2, 2019",
            "views": "3",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Karabo Hlanjwa",
                    "user_href": "/profile/Karabo-Hlanjwa"
                },
                {
                    "user_id": "Jannu Setti",
                    "user_href": "/profile/Jannu-Setti"
                },
                {
                    "user_id": "Keerthana Padmanabhan",
                    "user_href": "/profile/Keerthana-Padmanabhan-3"
                },
                {
                    "user_id": "Sean Kula",
                    "user_href": "/profile/Sean-Kula"
                },
                {
                    "user_id": "Soumya Raj Ghosh",
                    "user_href": "/profile/Soumya-Raj-Ghosh"
                },
                {
                    "user_id": "Aryan Dhuria",
                    "user_href": "/profile/Aryan-Dhuria-1"
                },
                {
                    "user_id": "Olebile Mogaga",
                    "user_href": "/profile/Olebile-Mogaga"
                },
                {
                    "user_id": "Anirban Chatterjee",
                    "user_href": "/profile/Anirban-Chatterjee-59"
                },
                {
                    "user_id": "Ujwal Kishor Zore",
                    "user_href": "/profile/Ujwal-Kishor-Zore"
                },
                {
                    "user_id": "Tsv Mahesh",
                    "user_href": "/profile/Tsv-Mahesh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Techno India Group",
                "href": "/profile/Techno-India-Group-1"
            },
            "answer_text": "Nanotechnology, as we know, is an umbrella term used to define technologies working on nanoscales for utilization in this transformed world. Nanoparticles (NPs), the basic parts of nanotechnology, are atomic or molecular aggregates with sizes varying from 1nm to 100nm. In Nanoscience, we manipulate matters at their atomic or molecular level and discover a whole new material with properties totally different from the mother matter or more powerful than it. The world is facing significant changes in day to day life, be it with the environment, medical sector, automobile sector or any other field and to cope with these, Nanoscience or Nanotechnology is the need of the hour. In today's world, thinking of any innovation sans Nanotechnology is impossible. Nanoparticles can be synthesized either chemically or biologically, naturally or artificially. In this particular technology, we repair control, construct and monitor at the molecular level of any systems. Nanoparticles are of different types according to the size, morphology, physical and chemical properties. Some of them are carbon-based nanoparticles, ceramic nanoparticles, metal nanoparticles, semiconductor nanoparticles, polymeric nanoparticles. Nanotechnology has its impact in every field like medicine and with devices based on new technology, it can cure diseases, enhance the military with updated weapons, preserve our environment with new techniques to purify water, soil, gases and energy. Thus Nanotechnology, along with nanoparticle, is the only science that can control and conquer the world with its positive impacts on every aspect ranging from medical, ethical, environmental domains, to fields such as biology, engineering, material science and so on. It remains an answer to every question. Dr. Tanya Das Academic Coordinator, Techno India University, WB. Ex Postdoc Fellow, National University Of Singapore ",
            "date": "Answered April 21, 2020",
            "views": "565",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Karabo Hlanjwa",
                    "user_href": "/profile/Karabo-Hlanjwa"
                },
                {
                    "user_id": "Keerthana Padmanabhan",
                    "user_href": "/profile/Keerthana-Padmanabhan-3"
                },
                {
                    "user_id": "Sameer Shrestha",
                    "user_href": "/profile/Sameer-Shrestha-15"
                },
                {
                    "user_id": "Ben 10",
                    "user_href": "/profile/Ben-10-169"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/SNIGDHA-PATRA-22"
                },
                {
                    "user_id": "TIGSaltlake",
                    "user_href": "/profile/TIGSaltlake"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maksud Sumon",
                "href": "/profile/Maksud-Sumon"
            },
            "answer_text": "Truly revolutionary nanotech products, materials and applications, such as nanorobotics, are years in the future (some say only a few years; some say many years). What qualifies as \"nanotechnology\" today is basic research and development that is happening in laboratories all over the world. \"Nanotech\" products that are on the market today are mostly gradually improved products (using evolutionary nanotechnology) where some form of nano-enabled material (such as carbon nanotubes, nanocomposite structures or nanoparticles of a particular substance) or nanotech process (e.g. nanopatterning or quantum dots for medical imaging) is used in the manufacturing process. In their ongoing quest to improve existing products by creating smaller components and better performance materials, all at a lower cost, the number of companies that will manufacture \"nanoproducts\" (by this definition) will grow very fast and soon make up the majority of all companies across many industries. Evolutionary nanotechnology should therefore be viewed as a process that gradually will affect most companies and industries. We have also compiled a Nanotechnology FAQ – Frequently Asked Questions list for you to explore. Definition of nan'o•tech•nol'o•gy So what exactly is nanotechnology? One of the problems facing this technology is the confusion about how to define nanotechnology. Most revolve around the study and control of phenomena and materials at length scales below 100 nm and quite often they make a comparison with a human hair, which is about 80,000 nm wide. Some definitions include a reference to molecular nanotechnology systems and devices and 'purists' argue that any definition needs to include a reference to \"functional systems\". The inaugural issue of Nature Nanotechnology asked 13 researchers from different areas what nanotechnology means to them and the responses, from enthusiastic to sceptical, reflect a variety of perspectives. ",
            "date": "Answered October 26, 2019",
            "views": "1",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sumon Khan",
                    "user_href": "/profile/Sumon-Khan-146"
                },
                {
                    "user_id": "MR Sumss",
                    "user_href": "/profile/MR-Sumss"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emad Noujeim",
                "href": "/profile/Emad-Noujeim"
            },
            "answer_text": "The word nano is “prefixed to the names of units to form the names of units [math]10^9[/math] times smaller, i.e. one thousand-millionth part of them” (from the OED) Nanotechnology (from nano- + technology) is “the branch of technology that deals with dimensions and tolerances of 0.1 to 100 nanometres, or (generally) with the manipulation of individual atoms and molecules. “(from the OED) Nanotechnology can be interpreted as being the manipulation and manufacture of materials and devices on the scale of atoms or small groups of atoms. The “nanoscale” is typically measured in nanometres, or billionths of a metre (nanos, the Greek word for “dwarf,” being the source of the prefix), and materials built at this scale often exhibit distinctive physical and chemical properties due to quantum mechanical effects. Although usable devices this small may be decades away , techniques for working at the nanoscale have become essential to electronic engineering, and nanoengineered materials have begun to appear in consumer products. For example, billions of microscopic “nanowhiskers,” each about 10 nanometres in length, have been molecularly hooked onto natural and synthetic fibres to impart stain resistance to clothing and other fabrics; zinc oxide nanocrystals have been used to create invisible sunscreens that block ultraviolet light; and silver nanocrystals have been embedded in bandages to kill bacteria and prevent infection. Possibilities for the future are numerous. Nanotechnology may make it possible to manufacture lighter, stronger, and programmable materials that require less energy to produce than conventional materials, that produce less waste than with conventional manufacturing, and that promise greater fuel efficiency in land transportation, ships, aircraft, and space vehicles. Nanocoatings for both opaque and translucent surfaces may render them resistant to corrosion, scratches, and radiation. Nanoscale electronic, magnetic, and mechanical devices and systems with unprecedented levels of information processing may be fabricated, as may chemical, photochemical, and biological sensors for protection, health care, manufacturing, and the environment; new photoelectric materials that will enable the manufacture of cost-efficient solar-energy panels; and molecular-semiconductor hybrid devices that may become engines for the next revolution in the information age. Source : nanotechnology Additionally : Nanotechnology involves the understanding, manipulation, and control of matter at dimensions of roughly 1 to 100 nanometers. Nanotechnology encompasses science, engineering and technology and involves imaging, measuring, modeling, and manipulating matter at the nanoscale. The development of unique nanoscale structures has the potential to revolutionize industry, including electronics, medicine, and consumer products. Examples of materials developed with nanotechnology include the following engineered nanomaterials: Carbon buckyballs or fullerenes;Carbon nanotubes;Metal oxide nanoparticles (e.g., titanium dioxide); andQuantum dots, which are nanoscale semiconductor materials (e.g., cadmium selenide).Although the development and application of nanotechnology is primarily still in the research phase, some engineered nanomaterials are produced and used in commercial applications today. Examples of products that are produced currently using nanotechnologies include: Sunscreens and cosmetics;Longer-lasting tennis balls and light-weight, stronger tennis racquets;Stain-free clothing and mattresses;Polymer films used in displays for laptops, cell phones, digital cameras;Coatings for easier cleaning glass;Bumpers and catalytic converters on cars; andProtective and glare-reducing coatings for eyeglasses and cars.Source : Occupational Safety and Health Administration Below is an instructive documentary tube about nanotechnology and some of its applications :  And here is an interview about what exactly is nanotechnology with K. Eric Drexler :  See also the following related links : Nanotechnology - Wikipedia What is Nanotechnology? What It Is and How It Works Nanotechnology Applications | Nanotechnology Uses How Nanotechnology Works ",
            "date": "Answered January 15, 2017",
            "views": "32",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rylan F",
                    "user_href": "/profile/Rylan-F"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/SNIGDHA-PATRA-22"
                },
                {
                    "user_id": "Anirban Chatterjee",
                    "user_href": "/profile/Anirban-Chatterjee-59"
                },
                {
                    "user_id": "Santhosh Pothuganti",
                    "user_href": "/profile/Santhosh-Pothuganti"
                },
                {
                    "user_id": "Karl Helm",
                    "user_href": "/profile/Karl-Helm-4"
                },
                {
                    "user_id": "Cosmos",
                    "user_href": "/profile/Cosmos-132"
                },
                {
                    "user_id": "Senaritra Sinha",
                    "user_href": "/profile/Senaritra-Sinha"
                },
                {
                    "user_id": "Sokheng Our",
                    "user_href": "/profile/Sokheng-Our"
                },
                {
                    "user_id": "Flora Angelina",
                    "user_href": "/profile/Flora-Angelina"
                },
                {
                    "user_id": "Abhishek",
                    "user_href": "/profile/Abhishek-1708"
                },
                {
                    "user_id": "Rajat Maheshwari",
                    "user_href": "/profile/Rajat-Maheshwari-34"
                },
                {
                    "user_id": "SIDDHARTH KRISHNAN 16110155",
                    "user_href": "/profile/SIDDHARTH-KRISHNAN-16110155"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nikita Butakov",
                "href": "/profile/Nikita-Butakov"
            },
            "answer_text": "Nanotechnology is the understanding and control of matter at dimensions between approximately 1 and 100 nanometers, where unique phenomena enable novel applications. Work within the intersecting disciplines at the core of nanotechnology innovation—including physical, life, and social sciences and engineering—has revealed the potential of engineered nanomaterials (ENMs) and nanoscale processes to collect and store energy, reinforce materials, sense contaminants, enable life- saving drugs, and shrink and accelerate computational devices in both incremental and paradigm- shifting ways.* Nanotechnology lets us directly interact with nanoscale systems such as individual molecules, DNA, and quantum mechanical devices. By being able to interact with such systems, nanotechnology enables to us to have greater control over our environment and our own biologies. It lets us design faster computers, more efficient energy sources, and develop new types of medicines. It's a rapidly growing field and still has lots of room left for exploration.   National Nanotechnology Initiative Strategic Plan - February 2014 - Executive Office of the President of the United States ",
            "date": "Answered September 18, 2015",
            "views": "4",
            "upvotes": " View 22 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jedediah Lazurov",
                    "user_href": "/profile/Jedediah-Lazurov"
                },
                {
                    "user_id": "Khalid Safar",
                    "user_href": "/profile/Khalid-Safar-2"
                },
                {
                    "user_id": "Sandesh Dangol",
                    "user_href": "/profile/Sandesh-Dangol-3"
                },
                {
                    "user_id": "Pritam Oram",
                    "user_href": "/profile/Pritam-Oram"
                },
                {
                    "user_id": "Shreenivas Badageri",
                    "user_href": "/profile/Shreenivas-Badageri"
                },
                {
                    "user_id": "Ramesh Prakash",
                    "user_href": "/profile/Ramesh-Prakash-11"
                },
                {
                    "user_id": "Krsna Das",
                    "user_href": "/profile/Krsna-Das-3"
                },
                {
                    "user_id": "Pratiksha Kavade",
                    "user_href": "/profile/Pratiksha-Kavade"
                },
                {
                    "user_id": "Rajat Maheshwari",
                    "user_href": "/profile/Rajat-Maheshwari-34"
                },
                {
                    "user_id": "Venkatesh Jala",
                    "user_href": "/profile/Venkatesh-Jala"
                },
                {
                    "user_id": "Apoorv Mathur",
                    "user_href": "/profile/Apoorv-Mathur-5"
                },
                {
                    "user_id": "Ming Cao",
                    "user_href": "/profile/Ming-Cao-6"
                },
                {
                    "user_id": "Emmanuel Antonio",
                    "user_href": "/profile/Emmanuel-Antonio-3"
                },
                {
                    "user_id": "Dylan Katz",
                    "user_href": "/profile/Dylan-Katz-1"
                },
                {
                    "user_id": "Mohamed Syed Masood Shah",
                    "user_href": "/profile/Mohamed-Syed-Masood-Shah"
                },
                {
                    "user_id": "Sruthy j L",
                    "user_href": "/profile/Sruthy-j-L"
                },
                {
                    "user_id": "Sam Yap",
                    "user_href": "/profile/Sam-Yap-24"
                },
                {
                    "user_id": "Vincent Zhang",
                    "user_href": "/profile/Vincent-Zhang-35"
                },
                {
                    "user_id": "Karan Mehta",
                    "user_href": "/profile/Karan-Mehta-8"
                },
                {
                    "user_id": "Steven Merz",
                    "user_href": "/profile/Steven-Merz"
                },
                {
                    "user_id": "Kristóf Péterffy",
                    "user_href": "/profile/Kristóf-Péterffy"
                },
                {
                    "user_id": "Sairam Jasti",
                    "user_href": "/profile/Sairam-Jasti"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tim Sabin",
                "href": "/profile/Tim-Sabin"
            },
            "answer_text": "A2A The nano- in nanotechnology indicates very small; often meaning on the order of nanometers, or billionths of a meter. Think of computers. First we had mainframes that often took up an entire room, or even an entire floor in a building. Then we had minicomputers, that could handle much more in a smaller space. Then we had microcomputers, the PC being the primary example. They did even more, and in less and less room. Now we have 128GB memory chips that we can insert into our cell phones or computers; this is an early example of nanotechnology. Here's what Wikipedia says on the subject: Nanotechnology is also being applied to or developed for application to a variety of industrial and purification processes. Purification and environmental cleanup applications include the desalination of water, water filtration, wastewater treatment, groundwater treatment, and other nanoremediation. Applications of nanotechnology - Wikipedia What I'm most excited about is the application of nanotechnology in medicine: Nanomedicine is the medical application of nanotechnology. Nanomedicine ranges from the medical applications of nanomaterials and biological devices, to nanoelectronic biosensors, and even possible future applications of molecular nanotechnology such as biological machines. Current problems for nanomedicine involve understanding the issues related to toxicity and environmental impact of nanoscale materials (materials whose structure is on the scale of nanometers, i.e. billionths of a meter). Nanomedicine - Wikipedia I know this is just Science Fiction right now, but I'd like to see nanobots that could be delivered via the blood system or lymphatic system, and could repair body cells. ",
            "date": "Answered October 23, 2019",
            "views": "559",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "RP Deshpande",
                "href": "/profile/RP-Deshpande"
            },
            "answer_text": "Nanotechnology deals with miniature dimensions of millionth of mm, where materials change properties, and we come across exciting possibilities of new materials, changed material behavior and things with immense imaginative designs / invention. Nature knows nanotechnology since times immemorial. Colours of butterflies, eyes of robber flies, spider webs and many more things in nature make you wonder about things in nature at nano scale. A place where a full stop in a sentence can be too big a dimension, we deal with nanotechnology materials, nano science with totally new concepts. Materials like graphene, nanotubes, aerogels, carbon fibres, active carbon, micro sized dielectrics- all are already in use and are subject of active research. World over lot of research is currently in progress on such materials. Along with these, materials and technologies that go with them also are getting a boost. You may consider atomic sized circuit connections and components, and think how small these things can be. A new component, memristor, is already making waves in science community and technology. This is a fourth passive component discovered recently. You may imagine nano machines and nano robots, which can enter you body through injections and travel in blood vessels to find and treat exact location for diseases. ",
            "date": "Answered April 3, 2018",
            "views": "315",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sowkhya Bovindala",
                    "user_href": "/profile/Sowkhya-Bovindala"
                },
                {
                    "user_id": "Shubham Verma",
                    "user_href": "/profile/Shubham-Verma-717"
                }
            ]
        },
        {
            "author_info": {
                "name": "Louise Hill",
                "href": "/profile/Louise-Hill-114"
            },
            "answer_text": "Here are some notes on it: (feel free to upvote! Thank you!)😁👍👍  https://www.nano.gov/nanotech-101/what/nano-size https://www.nanowerk.com/nanotechnology/introduction/introduction_to_nanotechnology_1.php What is Nanotechnology?  Physicist Richard Feynman, the father of nanotechnology Feynman described nanotechnology as a process in which scientists would be able to manipulate and control individual atoms and molecules Over a decade later, in his explorations of ultraprecision machining, Professor Norio Taniguchi coined the term nanotechnology. It wasn't until 1981, with the development of the scanning tunnelling microscope that they could \"see\" individual atoms, that modern nanotechnology began https://media.wiley.com/product_data/excerpt/53/07803108/0780310853.pdf Research (noted/summarised things found from this website): https://www.bio.org/what-biotechnology At its simplest, biotechnology is technology based on biology Biotechnology harnesses cellular and biomolecular processes to develop technologies and products that help improve our lives and the health of our planet We have used the biological processes of microorganisms for more than 6,000 years to make useful food products, such as bread and cheese, and to preserve dairy products HEAL THE WORLD: Reducing rates of infectious disease Changing the odds of serious, life-threatening conditions affecting millions around the world Tailoring treatments to individuals to minimize health risks and side effects Creating more precise tools for disease detection Combating serious illnesses and everyday threats confronting the developing world more than 250 biotechnology health care products and vaccines 13.3 million farmers around the world use agricultural biotechnology to increase yields, prevent damage from the environment ",
            "date": "Updated September 2, 2020",
            "views": "150",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Amit Aggarwal",
                "href": "/profile/Amit-Aggarwal-392"
            },
            "answer_text": "What is nanotechnology? Nanotechnology is the branch of science which deals with the study of particles those size between 1 nanometer to 100 nm.A nanometer is 1 billionth of a meter.  Nanotechnology helps humans Nanotechnology is the technology of the future because it has the potential of making human life easy. Nanotech. gives an increase in the material making facilities to companies. In the nano field many possibilities of less money and more profit in the future. As we know today's world is becoming more modern in the field of technology and infrastructure. The different things made with nanotechnology will give an amazing impact on our civilized world. Nanotechnology helps humans : Although we know that at the present time the cost of nanomaterials is high. There are lots of challenges of making nanomaterials from molecular manufacturing. Since as we know there will be significant challenges in transferring the knowledge of nanomaterials properties.But in the future, the effort will make nanotechnology materials available to all people and at less cost. The info. is based on the search result on the internet. Nanotechnology helps humans. For More Information. What is nanotechnology? its effect in future world >Howtrending.com Thanks… Please upvote if you like. ",
            "date": "Answered November 30, 2019",
            "views": "386",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Udbhav Tripathi",
                    "user_href": "/profile/Udbhav-Tripathi-1"
                },
                {
                    "user_id": "Meet",
                    "user_href": "/profile/Meet-123"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elden Ventura",
                "href": "/profile/Elden-Ventura"
            },
            "answer_text": "Nanotechnology (\"nanotech\") is manipulation of matter on an atomic, molecular, and supramolecular scale. The earliest, widespread description of nanotechnology referred to the particular technological goal of precisely manipulating atoms and molecules for fabrication of macroscale products, also now referred to as molecular nanotechnology. A more generalized description of nanotechnology was subsequently established by the National Nanotechnology Initiative, which defines nanotechnology as the manipulation of matter with at least one dimension sized from 1 to 100 nanometers. This definition reflects the fact that quantum mechanical effects are important at this quantum-realm scale, and so the definition shifted from a particular technological goal to a research category inclusive of all types of research and technologies that deal with the special properties of matter that occur below the given size threshold. It is therefore common to see the plural form \"nanotechnologies\" as well as \"nanoscale technologies\" to refer to the broad range of research and applications whose common trait is size. ",
            "date": "Answered April 21, 2016",
            "views": "872",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Scott Nelson",
                    "user_href": "/profile/Scott-Nelson-8"
                },
                {
                    "user_id": "Kavita Kumari",
                    "user_href": "/profile/Kavita-Kumari-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deepak Singh",
                "href": "/profile/Deepak-Singh-2624"
            },
            "answer_text": "Nanotechnology is a newest field of research and this promise to take humans to next level of technological advancements(in forms of flexible display, high speed computers than now available, cancer treatment, self driving vehicle etc). It concern with fabrication and manufacturing things from micro to nano level. As we know that Nano means Billionth part 10(–9) here the law of classical physics does not apply so things are driven by other than classical world. This technology is in fashion for 21 century people because it offers the great control over mateials at nano level and since these days we are equipped with highly sophisticated electron microscope, lithographic techniques( creating pattern on anything) which make possible to characterize and manipulate anything even at atomic level so scientists and researchers are looking for solution of problems by nanotechnology which are limited by conventional technology. For example synthesis of high strength material, atomic level sensing, targeted drug delivery. These are some of very common examples and list is uncontable. Hope this will answer your question. ",
            "date": "Answered November 5, 2017",
            "views": "909",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Roshin Johny",
                    "user_href": "/profile/Roshin-Johny"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sarfraj Fency",
                "href": "/profile/Sarfraj-Fency"
            },
            "answer_text": "In simple words, nanotechnology means the technology that makes things smaller than the naked eye can see. There are many applications of nanotechnology. Here is formal defination in technical terms. “Nano” means 1 billionth of a meter (0.000000001 meter). The human hair is 10 millionth of a meter (0.00001 meter). Human hair is the naked eye visibility limit, if anything is smaller than that, we cannot see it with naked eye. I think you got the feel of how small is a nanometer. Building the things on the scale of nanometer is referred as nanotechnology. Nanotechnology is the future technology. There are many fields where nanotechnology is put to use, may it be medical science or food industry, robotics or clothing, everywhere nanotechnology finds its application. The properties of material changes at nanoscale than that were on microscale like opaque material becomes transparent, insoluble substance becomes soluble. The color of the substance can also be changed. The best example is gold, the color of gold can be changed to violet, red and some more.  Follow my space MessyMindScience ",
            "date": "Answered September 10, 2020",
            "views": "163",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Aman",
                    "user_href": "/profile/Aman-1773"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suraj Yadav",
                "href": "/profile/Suraj-Yadav-1811"
            },
            "answer_text": "Nanotechnology is the manipulation of matter on an atomic, molecular, and supramolecular scale. The earliest, widespread description of nanotechnology referred to the particular technological goal of precisely manipulating atoms and molecules for fabrication of macroscale products, also now referred to as molecular nanotechnology. A more generalized description of nanotechnology was subsequently established by the National Nanotechnology Initiative, which defines nanotechnology as the manipulation of matter with at least one dimension sized from 1 to 100 nanometers. Learn more - https://www.techenvirohealth.com/2019/09/nanotechnology-introduction-definition-applications.html ",
            "date": "Answered September 22, 2019",
            "views": "180",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Saptarshi Majumder",
                "href": "/profile/Saptarshi-Majumder-3"
            },
            "answer_text": "Nano technology is the study of matters and material in the nano scale (10e-9 m). Particles and matter in the nano scale might have a totally different physics than in the macro scale. This is what makes it so much interesting. I will give you an example. If you have two silica particles (less than 20 nm in size) in a alkaline solution, the particles would repel each other due to a negative charge on their surface. Therefore, it will form a very stable suspension. Smaller particle size has a higher surface/mass ratio and the surface charges are sufficient to form a stable suspension. Now, increase the particle sizes to ~ 5 micron and the particles will form a precipitate since the same surface charge is not sufficient to keep these particles afloat. There is a whole world of possibilities in the nano world and the laws of physics are not the same as the macro scale. ",
            "date": "Answered November 12, 2018",
            "views": "976",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jaeson Monteiro",
                    "user_href": "/profile/Jaeson-Monteiro"
                },
                {
                    "user_id": "Prachi Agarwal",
                    "user_href": "/profile/Prachi-Agarwal-148"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Carey",
                "href": "/profile/John-Carey-186"
            },
            "answer_text": "Nanotechnology is the technology, science and engineering that is conducted, researched, investigated, and experimented at the nanoscale. The nanoscale is the scale of 1 to 100 nanometers. Physicist Richard Feynman is the father of nanotechnology. Living beings are made from cells where a cell is the smallest unit of an organism. Just like our bodies are made from organs, organs from tissues and tissues from cells; all non-living things are made from atoms. An atom is the smallest particle that can exist in any nonliving object. There’s no way we can see an atom with our naked eyes. Does it mean that we need a microscope to see atoms? Yes, not the ordinary one but the special microscope invented recently with the tendency to see atoms known as the scanning tunneling microscope (STM) through which scientists could view and study atoms. This helped them to come up with a new science called \"Nano-science\". ",
            "date": "Answered June 30, 2020",
            "views": "76",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Essam Radwan",
                "href": "/profile/Essam-Radwan"
            },
            "answer_text": "From my perspective, it is any technology that is based on the different behavioural of materials at the nanoscale. So, when the dimensions shrink, the properties of matter differs. Different disciplines perceive the word of Nanotechnology differently: Electrical Engineers: Nanoelectronics and Transistors, how to manipulate the motion of electrons on the Nanoscale. Mechanical Engineers: How to build actuators and sensors on the Microscale that can be integrated with this Silicon-based Nanoelectronics, these systems are always noted as MEMS/NEMS (Micro/Nano Electro-Mechanical Systems) Material Scientists: How to change the properties of materials through manipulating atomic structure. Biologists and Chemists: How preparing chemicals in small dimensions change their properties and reactivity. and So on .. It does not have a unique definition, it is more related to your field. ",
            "date": "Answered September 10, 2020",
            "views": "48",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Faruque Hossain Piyada",
                    "user_href": "/profile/Faruque-Hossain-Piyada"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rashid Ahmad",
                "href": "/profile/Rashid-Ahmad-12"
            },
            "answer_text": "Per Merriam Webster dictionary: Nanotechnology (n): the science of manipulating materials on an atomic or molecular scale especially to build microscopic devices (such as robots) to deliver enzymes in blood, operations on infants, etc. If you are still interested in more info, here is a link to start with: Nanotechnology Applications | Nanotechnology Uses I hope this helps. ",
            "date": "Answered April 2, 2018",
            "views": "269",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ritesh Rai",
                "href": "/profile/Ritesh-Rai-183"
            },
            "answer_text": " Nanotechnology is the part of Science that is used to manipulate matters at the atomic level to produce a low dimensional system that is components at a very small scale ( 1–100nm ) which is one-billionth of something. That results in the formation of low dimensional by materials that have better chemical, electric, magnetic, optical and catalytic properties. Now the above image is of Carbon Nanotubes which is one of the most researched nanomaterials which was discovered by Japenese Electron Microscopist Sumio Iijima. Now you must be wondering why to synthesis nanomaterials so it is to get better properties as compared to bulk materials. For example- For bulk matters- Gold - Melting Point is around 1064°CFor Nanomaterials - Gold particle (2nm) Melting Point is around 680°CIt also results in good electrical, magnetic and optical properties when we decrease surface to volume ratio to produce low dimensional materials. These all topics I learned in my first semester in the course Semiconductor Physics... I hope now you understood well about nanotechnology. ",
            "date": "Answered October 26, 2019",
            "views": "318",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Leslie Martindale",
                "href": "/profile/Leslie-Martindale"
            },
            "answer_text": "Nanotechnology is the engineering of functional systems at the molecular scale. This covers both current work and concepts that are more advanced. In its original sense, 'nanotechnology' refers to the projected ability to construct items from the bottom up, using techniques and tools being developed today to make complete, high performance products. ",
            "date": "Answered February 5, 2016",
            "views": "520",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mayank Yadav",
                "href": "/profile/Mayank-Yadav-202"
            },
            "answer_text": "Nanotechnology is science, engineering, and technology conducted at the nanoscale, which is about 1 to 100 nanometers. Physicist Richard Feynman, the father of nanotechnology. Nanoscience and nanotechnology are the study and application of extremely small things and can be used across all the other science fields, such as chemistry, biology, physics, materials science, and engineering. For more info contact TECH-A-MANIA (Tech a mania provides Internship, research paper publishing, Mentoring courses and many more) CONTACT:+917338707497 ",
            "date": "Answered October 25, 2017",
            "views": "303",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vikash Keshav",
                "href": "/profile/Vikash-Keshav-3"
            },
            "answer_text": "Basic of Nanotechnology is Material Science. Apart from that, Higher Mathematics, Statistical Mathematics, Quantum Mechanics, Polymer Science, Electrical, Electronics, few programmings, Mechanics, Physics, Chemistry, Environmental Science, Biology, Energy Systems, and many more (add as you please). See, nanotechnology is an interdisciplinary branch of science and engineering because of its wide range of applications and hence, it is you who decides what should be the basics for your ‘NANOTECHNOLOGY’. Here, EVERYONE HAS THEIR OWN STORY. ",
            "date": "Answered April 2, 2018",
            "views": "333",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sowkhya Bovindala",
                    "user_href": "/profile/Sowkhya-Bovindala"
                },
                {
                    "user_id": "Charu Karwa",
                    "user_href": "/profile/Charu-Karwa-1"
                },
                {
                    "user_id": "Shaik Suhail",
                    "user_href": "/profile/Shaik-Suhail-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prachi Yadav",
                "href": "/profile/Prachi-Yadav-6"
            },
            "answer_text": "Nanotechnology is fundamentally combination of Physics and Chemistry for all/any applications. As Materials Scientist, you can work on experiments, theory or computation of physical and chemical phenomena for biological, electronic, mechanical, environmental, agricultural, and host of other applications. Electronics engineers, biotechnologists, chemical engineers can also work independently on nanotechnology focusing on specialized applications. So, electronics or biology or chemistry would be their basics! In summary, nanotechnology is a very specialized application of all fundamental sciences. Hope this helps! :) ",
            "date": "Answered December 29, 2018",
            "views": "130",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lynn Sonya",
                "href": "/profile/Lynn-Sonya"
            },
            "answer_text": "Nanotechnology is the engineering of functional systems at the molecular scale. This covers both current work and concepts that are more advanced. In its original sense, 'nanotechnology' refers to the projected ability to construct items from the bottom up, using techniques and tools being developed today to make complete, high performance products. ",
            "date": "Answered February 3, 2016",
            "views": "445",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Naandesh Interiors",
                "href": "/profile/Naandesh-Interiors"
            },
            "answer_text": "nano technology is future of material and pharma industries. nano technology base on physics and chemistry but its not stand on this. nano technology is wide spectrum, if you choose this field you must learn how atoms works, if you see and feel the energy of atoms you will be a next nono technician. best of luck………… ",
            "date": "Answered March 18, 2019",
            "views": "38",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Rupp",
                "href": "/profile/David-Rupp"
            },
            "answer_text": "The science of producing useful technological structures at a 10e-9 metre scale. Applications include very small electronics using and manipulating quantum effects, materials with surprising properties when constructed on a smaller scale, catalysts, cancer treatment using nano-medicine, and of course the famous, but barely existent nanobots. ",
            "date": "Answered February 22, 2017",
            "views": "450",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lisa Rosenberg",
                    "user_href": "/profile/Lisa-Rosenberg-1"
                },
                {
                    "user_id": "Shoaib Gujjar",
                    "user_href": "/profile/Shoaib-Gujjar-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tim Harper",
                "href": "/profile/Tim-Harper-1"
            },
            "answer_text": "\"Controlling physical properties by defining matter with molecular precision\" was the definition Sir Mark Welland and I used in the early days. It's broad, but still accurate, and most impotently concise ",
            "date": "Answered March 18, 2014",
            "views": "19",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tint Kent",
                    "user_href": "/profile/Tint-Kent"
                },
                {
                    "user_id": "Mayuresh Gautam",
                    "user_href": "/profile/Mayuresh-Gautam"
                },
                {
                    "user_id": "Anushika Makhija",
                    "user_href": "/profile/Anushika-Makhija"
                },
                {
                    "user_id": "Marc Bodnick",
                    "user_href": "/profile/Marc-Bodnick"
                },
                {
                    "user_id": "Christopher VanLang",
                    "user_href": "/profile/Christopher-VanLang"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Burnham",
                "href": "/profile/Tom-Burnham"
            },
            "answer_text": "For the original meaning, see the works of Eric K. Drexler.   In much recent writing, \"nanotech\" refers to the creation and use of particles which are less than 100 micrometers across.  Some of these have considerable potential but none begins to compare with Drexler's speculations. ",
            "date": "Answered August 21, 2011",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "SK Wasim Haidar",
                    "user_href": "/profile/SK-Wasim-Haidar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jan Kokes",
                "href": "/profile/Jan-Kokes"
            },
            "answer_text": "Technology at very small scale. One nanometer is one billionth of a meter. For instance modern processors use transistors which are light printed in their matrix, light being the most precise tool we have, and the beam is 14 nm in width if I understand it correctly. Which makes processors nanotechnology. ",
            "date": "Answered October 26, 2019",
            "views": "559",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Divya Mallya",
                    "user_href": "/profile/Divya-Mallya-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Diane Leonard",
                "href": "/profile/Diane-Leonard-21"
            },
            "answer_text": "Nanotechnology is the study of controlling or manipulating of matter on an atomic and molecular scale. \"nano\" means small. 1 nano-meter (nm) is one billionth or 10−9meter. Nanotechnology includes synthesis, characterization, exploration, and utilization of nano structured material. In industry, nanotechnology has many applications that may include construction materials, military goods, and nano-machining of nano-wires, nano-rods, few layers of graphene , etc. Mainly 2 types of nanomaterial’s are available that are carbon based and metal based. ",
            "date": "Answered May 13, 2019",
            "views": "45",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rajesh Dhayal",
                    "user_href": "/profile/Rajesh-Dhayal-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nagarajan Saran",
                "href": "/profile/Nagarajan-Saran"
            },
            "answer_text": "Nanotechnology is the science and technology of small things â€“ in particular things that are less than 100nm in size. One nanometer is 10-9 meters or about 3 atoms long. For comparison, a human hair is about 60-80,000 nanometers wide. ",
            "date": "Answered July 20, 2017",
            "views": "73",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kushwaha Manisha",
                "href": "/profile/Kushwaha-Manisha"
            },
            "answer_text": "Nano is a prefix means one billionth of a meter Nanotechnology is too small to see with the nacked eye with a conventional light microscope. Nanotechnology involved creating and manipulating material at the nanometer scale either scaling up from single group of atom or reducing bulk material. ",
            "date": "Answered September 14, 2019",
            "views": "74",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aayushi Patni",
                "href": "/profile/Aayushi-Patni-2"
            },
            "answer_text": "Nanoscience and nanotechnology are the study and application of extremely small things and can be used across all the other science fields, such as chemistry, biology, physics, materials science, and engineering. ",
            "date": "Answered October 4, 2017",
            "views": "420",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Binayak G Shankar",
                    "user_href": "/profile/Binayak-G-Shankar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Miqdad Raza",
                "href": "/profile/Miqdad-Raza-2"
            },
            "answer_text": "Nanotechnology is the study of materials at the micro to nano scale. What this means in terms of length is the following: 1 meter = 10^6 micrometers (microns) = 10^9 nanometers. Nanotechnology is sometimes also synonymous to the study of semiconductor chips. ",
            "date": "Answered April 2, 2018",
            "views": "283",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mohib Raza",
                    "user_href": "/profile/Mohib-Raza"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter M. Slade",
                "href": "/profile/Peter-M-Slade"
            },
            "answer_text": "A technology of objects at a very small scale, with properties having few if any similarities to the macrosopic, which can only occurs at the nanometer scale. ",
            "date": "Answered February 15, 2020",
            "views": "61",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Karthika",
                "href": "/profile/Karthika-80"
            },
            "answer_text": "This Video explains NanoTechnology in simple way so that anyone can easily understand about Nanotechnology and potential applications of nanotechnology and the risks associated with nanotechnology.  ",
            "date": "Answered August 1, 2016",
            "views": "488",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jason Lin",
                    "user_href": "/profile/Jason-Lin-213"
                }
            ]
        },
        {
            "author_info": {
                "name": "Antwaan Harrison",
                "href": "/profile/Antwaan-Harrison"
            },
            "answer_text": "Java is the way to go for Android. Also check out Kotlin. It’s really new but looks promising Objective-C for iOS, but Swift is really popular. You could also learn C# and use Xamarin and built two native applications with one code-base There’s also React Native which is a JavaScript library written by Facebook. There are tradeoffs when using React Native so be sure to research, but I’ve found that the speed at which I’m able to develop an iOS and Android application with one code-base is blazingly fast. ",
            "date": "Answered August 15, 2017",
            "views": "487",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "DAniel WEllignthon",
                    "user_href": "/profile/DAniel-WEllignthon"
                },
                {
                    "user_id": "Chris Millar",
                    "user_href": "/profile/Chris-Millar-4"
                },
                {
                    "user_id": "Martino Christanto",
                    "user_href": "/profile/Martino-Christanto"
                }
            ]
        },
        {
            "author_info": {
                "name": "Therion Tiberius Ware",
                "href": "/profile/Therion-Tiberius-Ware"
            },
            "answer_text": "An entirely speculative technology that involves building things atom by atom using lots and lots really small robots working towards a single goal.  ",
            "date": "Answered February 22, 2017",
            "views": "242",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Prashant Bhatt",
                "href": "/profile/Prashant-Bhatt-56"
            },
            "answer_text": "Nanotechnology is science, engineering, and technology conducted at the nanoscale, which is about 1 to 100 nanometers. It is all about the scale size . ",
            "date": "Answered July 4, 2017",
            "views": "120",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sheetal Sharma",
                "href": "/profile/Sheetal-Sharma-421"
            },
            "answer_text": "You can a whole idea about nanotechnology it's uses related issues related to it just by clicking on this link :  ",
            "date": "Answered July 14, 2019",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rashid Alig",
                "href": "/profile/Rashid-Alig"
            },
            "answer_text": "Language and Tools you need to develop and android App Programming Languages- Java & Android.Database - A server side database preferably MySql or Sql Server and Sqlite database for store content on mobile device.Android Studio IDE - For developing your mobile app. Download from Download Android Studio and SDK ToolsFor process you need to refer some tutorial site- Official Android studio site - Getting Started | Android DevelopersTutorial Point - Android TutorialJavapoint - Android Tutorial - JavatpointUnderstanding android development will be easier for you if you already have knowledge of Java programming. Hope this will help you. Appy Coding :) ",
            "date": "Answered August 14, 2017",
            "views": "545",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kattapa Bahubali",
                    "user_href": "/profile/Kattapa-Bahubali"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ray Harrilla",
                "href": "/profile/Ray-Harrilla"
            },
            "answer_text": "Edward Lebogang Kadiaka; Nanotechnology - Simple English Wikipedia, the free encyclopedia What is Nanotechnology? Nanotechnology ",
            "date": "Answered October 24, 2019",
            "views": "207",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Yunus Shareef Mohammed Ismail",
                "href": "/profile/Yunus-Shareef-Mohammed-Ismail"
            },
            "answer_text": "Well… nanotechnology can be described as a branch of science, that deals with the study of particle less than 100 nanometer range. ",
            "date": "Answered July 14, 2017",
            "views": "69",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Akash Khansili",
                "href": "/profile/Akash-Khansili"
            },
            "answer_text": "where general mechanics does not work, we have to use quantum mechanics. the scale that we are talking about is 1000 times smaller than the microscopic scale that you know of, generally at this scale the laws of physics are different and due to this atomic scale if we are going to work on that we must how the physics work there. ",
            "date": "Answered July 29, 2017",
            "views": "123",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Raj Shetye",
                "href": "/profile/Raj-Shetye-7"
            },
            "answer_text": "NANOTECHNOLOGY PROMISES BETTER GAMING EXPERIENCE - JustScience ",
            "date": "Answered August 3, 2017",
            "views": "45",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Edward De Jong",
                "href": "/profile/Edward-De-Jong"
            },
            "answer_text": "To make an android or iPhone app there are many specialized languages that give you an easy way to make a simple app. There is flash builder from Adobe systems that lets you program in action script three which is a very easy language. Then there is corona. And embarcaderos product. There must be a dozen systems to choose from. The very foolish dive into Java and try to learn the very complicated task of doing an android app at the very lowest level using android studio from google. Do you want a system that lets you get going with 100 hours of training not thousands of hours which is what Java will take you to become very proficient. When writing high-performance low level software you have to go down to Java, but simple apps and games can be done in these protected simpler environments with much less training needed. There is always a point at which the simplest Systems start to become a limitation in a hindrance but the vast majority he of the apps you see in the store can be built with these types of tools ",
            "date": "Answered August 14, 2017",
            "views": "666",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Uni Dark",
                "href": "/profile/Uni-Dark"
            },
            "answer_text": "The official language for Android development is Java. Large parts of Android are written in Java and its APIs are designed to be called primarily from Java. That said, it is possible to develop C and C++ apps using the Android Native Development Kit (NDK), however it isn't something that Google promotes. ",
            "date": "Answered August 15, 2017",
            "views": "232",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sunil Mishra",
                "href": "/profile/Sunil-Mishra-444"
            },
            "answer_text": " ",
            "date": "Answered May 15, 2019",
            "views": "174",
            "upvotes": "0"
        }
    ]
}