{
    "title": "What's a good minor for a pre-med student majoring in health sciences? - Quora",
    "tags": [
        "Pre-Medical",
        "College and University Majors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Anthony",
                "href": "/profile/Michael-Anthony-162"
            },
            "answer_text": "Great question. Crititical thinking is essential if you want to be a successful physician. As you probably know, information is accumulating at an ever quickening pace, so it's therefore unlikely that several courses in a specific subject will be helpful. The least successful docs I've known have difficulty with separating out extraneous information from essential info. You will be amazed at the amount of medical information coming at you. Think about a minor in philosophy. I can't think of another field of study that places such a premium on the ability to think. As a doc, you'll be thinking all the time… Also, many (or most) physicians will operate in a managerial position in the future (you'll supervise nurses, P.A.s, N.P.s, and many others). A minor in management wouldn't hurt, either. ",
            "date": "Answered July 31, 2016",
            "views": "76",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John A. Jaksich",
                "href": "/profile/John-A-Jaksich"
            },
            "answer_text": "I would believe a good minor would entail ‘social work’ — both practical and ‘in theory.’ The path to a medical degree is fraught with intellectual challenges— primarily designed to get you to be intellectually flexible and sharp. After seemingly endless hours sharpening the mind, some individuals lack ‘good bedside manner.’ That is a fact that is slow to change— understanding the emotional state of your patients will go a long way to detering misunderstandings that eventually will occur. Most of us, from time to time, misinterpret our doctor’s orders and intentions. We believe that we are own best MD— however true, we will do need the input of professionals. Have you ever tried to treat your own maladies—eventually, mistakes are likely. ",
            "date": "Answered September 15, 2018",
            "views": "53",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Deborah Lerner",
                "href": "/profile/Deborah-Lerner"
            },
            "answer_text": "If you live in the United States and you want a career involving patient care, consider a minor in Spanish. This is especially so if you have an interest in primary care. Clinicians with Spanish language skills have the ability to communicate directly with a growing segment of the US population and thus have a distinct advantage in many job markets. ",
            "date": "Answered February 23, 2018",
            "views": "35",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John A. Jaksich",
                    "user_href": "/profile/John-A-Jaksich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Baerker",
                "href": "/profile/Bob-Baerker"
            },
            "answer_text": "You can choose any undergraduate major/minor that you like but it will make your graduate studies easier if you have taken any available undergrad courses in anatomy, pathology, histology, pharmacology, physiology, or microbiology. Having an easier time in those courses later will free up time for other areas that need more time. ",
            "date": "Answered October 12, 2016",
            "views": "48",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Farnham Blair",
                "href": "/profile/Farnham-Blair"
            },
            "answer_text": "Something in the arts, as medicine is an ever-shifting combination of science and art. Both our children’s physician and my wife’s and my personal physician minored in arts as undergraduates, and they use and enjoy this aspect of their backgrounds. ",
            "date": "Answered August 1, 2016",
            "views": "23",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John A. Jaksich",
                    "user_href": "/profile/John-A-Jaksich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wes Winn",
                "href": "/profile/Wes-Winn"
            },
            "answer_text": "Math, Biology, Physics, and Chemistry are all great candidates. Basically, crack open an MCAT prep book and see what subjects are covered. If you want a decent chance of med school, you have to know all of them very strongly. ",
            "date": "Answered April 16, 2018",
            "views": "47",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Andrea Martin",
                "href": "/profile/Andrea-Martin-27"
            },
            "answer_text": "Communication ",
            "date": "Answered February 15, 2018",
            "views": "417",
            "upvotes": "0"
        }
    ]
}