{
    "title": "What would happen if humans start hibernating in winter? - Quora",
    "tags": [
        "Hypothetical Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gwydion Madawc Williams",
                "href": "/profile/Gwydion-Madawc-Williams"
            },
            "answer_text": "Our species evolved in Africa, with no real winter.  Only humans clever enough to adapt their clothing and winter housing were able to settle in the far north, and this was too recent for biological changes. But you can imaging a human-like species that really did originate in a highly seasonal climate and kept its hibernation.  Such humanoids would probably exploit the hibernation period for warfare. Might use drugs to suppress the cycle.  Might have originated in a seasonal region but later settle equatorial lands, maybe crossing a fairly wide sea to do so.  (Humans crossed to the New World with primitive technology, and also settled the Pacific Islands in rafts and canoes.) As Kimberly Wills-Starin says, we'd probably use caves.  But humanoids would also probably have devised the Igloo very early on - we have no idea when they were actually invented, except that pre-humans appear never to have got far north and so probably lacked them.  And an alternative would be more regular houses with snow added for insulation: Although igloos are stereotypically associated with all Inuit,[2] they were traditionally associated with people of Canada's Central Arctic and Greenland's Thule area. Other Inuit people tended to use snow to insulate their houses, which were constructed from whalebone and hides. Snow is used because the air pockets trapped in it make it an insulator.  On the outside, temperatures may be as low as −45 °C (−49 °F), but on  the inside the temperature may range from −7 °C (19 °F) to 16 °C (61 °F)  when warmed by body heat alone.[3]  (Igloo) The issue is addressed for a very non-human intelligent species in an SF novel, A Deepness in the Sky.  There is an opening for a novel with beings much like a human and years much like ours.  I'm not likely to write it, so the topic is open for anyone interested. Note that a planet with a much bigger axial tilt might have seasons even at the equator.  And that a world that was cooler overall might have a temperate climate at its equator. ",
            "date": "Answered November 24, 2015",
            "views": "977",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jakob Coles",
                    "user_href": "/profile/Jakob-Coles"
                },
                {
                    "user_id": "Ross Taylor",
                    "user_href": "/profile/Ross-Taylor-8"
                },
                {
                    "user_id": "Kimberly Wills-Starin",
                    "user_href": "/profile/Kimberly-Wills-Starin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kimberly Wills-Starin",
                "href": "/profile/Kimberly-Wills-Starin"
            },
            "answer_text": "Hmm.. well, if we *Had to* in our current type of climate, I'm guessing that means humans would have to limit themselves to very cold regions, so most of the land masses along the equator would be vacant of humans.  There's no need to hibernate where its warmer and food grows all year round. Bears have to eat to build up fat stores for the winter, so we'd have to do the same, and find safe places to hide from non-hibernating animals. Bears are pretty good at defending themselves, so we'd have to either stay together in large groups while hibernating to be able to protect ourselves, or make very secure bunkers. Since we have opposable thumbs, either is equally likely, that we could find and secure a cave or other shelter well enough to have it not invaded by animals while we're hibernating.  Our groups of people would be more isolated, because we wouldn't want other groups of people to find our 'safe hibernating' spots and food storage. Hibernating uses around 2-3 months of food storage, so it'd likely change our reproductive cycle too, to be more like that of other hibernating animals.  There'd be no benefit to having an active cycle during hibernation, so it would probably change to human *only* being able to become pregnant 3-4 times a year instead of being fertile once a month. As a result, population would be a lot lower, and we'd probably still be in the cave-man era of development, or maybe a little past that.  Not having access to warmer climates where it would be much easier to grow food would keep the population from expanding much as well. ",
            "date": "Answered November 24, 2015",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mike Tee",
                    "user_href": "/profile/Mike-Tee-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Allen Gibson",
                "href": "/profile/Allen-Gibson-4"
            },
            "answer_text": "Squirrels don’t really hibernate the just move indoors. That's why they spend the summer stocking up their food supply. If we did the same thing we would have to have work that made enough money and food that we could save what’s needed for winter months. I don’t know about the rest of the people butI as one with that much time at home would end up having a lot more kids. Which would be OK because by the end of the first year for this all the poor people would be dead. from starvation thus much of the middle class would become the new poor by doing the needed work that they were doing. Plus their old job to keep food on the table all year. Oh by the way most kids today are already there, if they have a game boy or any other video game but they hibernate year round ",
            "date": "Answered December 3, 2018",
            "views": "119",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John O'Brien",
                "href": "/profile/John-OBrien-113"
            },
            "answer_text": "Seasonal fashion would change a bit. Heavy winter coats would be nonexistent in everyday life (outside mountaintop or arctic weather). Instead, people would focus on buying loose, comfortable pajamas and amazingly thick blankets, so they do not have to use a furnace. Also, there would be a fall gorging market. Think Thanksgiving or Christmas dinner, but every night over the course of four or five weeks. People would need the extra fat and energy so they would not have to wake up until spring. People wanting to lose weight could just eat as normal up until they hibernate; when they wake up, they should be nice and slim. ",
            "date": "Answered October 3, 2016",
            "views": "279",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Elizabeth Porco",
                "href": "/profile/Elizabeth-Porco-1"
            },
            "answer_text": "Anti-hibernation drugs would, at least the first time they were used, be an essential military tool. Hibernation drugs might have allowed a manned orbital mission to Mars. Machinery would have to be built to survive extended periods of running with no maintenance. If you didn't hibernate for some reason you might have trouble doing things like fueling a car. It is possible that not hibernating through the use of drugs would only be allowed if you were in law enforcement, firefighting, or the military. We couldn't care for non-hibernating pets except through automatic mechanisms. ",
            "date": "Answered September 25, 2016",
            "views": "378",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Paige Stone",
                    "user_href": "/profile/Paige-Stone-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vincent Anthony",
                "href": "/profile/Vincent-Anthony-21"
            },
            "answer_text": "The Machinery of civilization would grind to a halt, and as usual the very poor would suffer. Not the middle class nor the rich of course, just the very poor. But fuck them! No big deal. They know how to suffer. They've had plenty of practice. <sarcasm> ",
            "date": "Answered December 1, 2018",
            "views": "33",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Amyas Cavit",
                "href": "/profile/Amyas-Cavit"
            },
            "answer_text": "Squirrels don’t hibernate. That’s why you see them in the winter.  ",
            "date": "Answered December 3, 2018",
            "views": "46",
            "upvotes": "0"
        }
    ]
}