{
    "title": "What are the most unusual food hacks? - Quora",
    "tags": [
        "Tips and Hacks for Everyday Life",
        "Tips and Hacks"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ayush Rustagi",
                "href": "/profile/Ayush-Rustagi-3"
            },
            "answer_text": "1. Ramen with Cheese  Cheese and ramen? Who would have thought. 2. Peanut Butter and Burgers  The smoothness, creaminess and slight saltiness of peanut butter goes surprisingly well with meats, patties and bacon. 3. Fries and Ice Cream / Milkshake  Unusual as it might sound - salt coated, crispy, deep fried potatoes and ice cold, creamy vanilla ice cream/ milkshake, this is THE Bomb. 4. Coffee Pork Ribs  The coffee makes an appearance in this dish as a sweet, sticky sauce used to coat the pork ribs after they are deep fried. 5. Otah and Pizza  This slightly spicy, coconut-ty grilled fish cake would go so well with a Western favourite - pizza. 6. Durian and Chee Cheong Fun  Generous amounts of creamy durian puree is stuffed into rice rolls and served with a generous topping of peanut sugar. Yum, we say. 7. Fried Chicken and Waffles  Deep fried battered chicken is placed atop a fluffy, crispy waffle and further drizzled with maple syrup. 8. Chocolate and Pizza  Melted chocolate is spread on a pizza crust with a whole medley of other ingredients like peanut butter, marshmallows and even M&Ms. Perfection in a slice. 9. Guinness - Beer Gao  Guinness is not just a normal beer. Guinness has a creamy head, caused by mixture of nitrogen when it is poured. It is much darker and more robust, adding that extra oomph of flavour. 10. Batter and Mars Bars  Mars Bars are dipped in a floury batter before being deep fried to golden brown, crispy, caramel-ly, smooth perfection. 11. Waffles and Salted Egg Yolk Sauce  If you’re known to devour salted egg yolk dishes, then you’re in for a treat with Fat Cat’s Charcoal waffles with salted egg yolk sauce. 12. Luncheon Meat and Sushi  Luncheon meat (spam) + Sushi = Spam Musubi. That's the only equation you should be interested in. SOURCE : AUTHOR : AVERLYNN LIM LINK AND IMAGES : 12 Trending Food Hacks That Seem Strange But Are Actually Pure Genius ",
            "date": "Answered October 30, 2018",
            "views": "53",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Archana Singh",
                    "user_href": "/profile/Archana-Singh-1413"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carol Morgan",
                "href": "/profile/Carol-Morgan-66"
            },
            "answer_text": "Oh, you want my secret seasoning? OK. My secret seasoning is Fish Sauce. I hate anchovies, but that is something that doesn't taste like fish in sauce because it did, I would not be eating it.. But I will put in in tomato sauce, gravies, some soups, stir fries, and just a bit gives it a great umami flavor. Don’t over do it, just a few drops and you will tell the difference. ",
            "date": "Answered April 3, 2019",
            "views": "19",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aren Tank",
                    "user_href": "/profile/Aren-Tank"
                }
            ]
        }
    ]
}