{
    "title": "What are the scientific fields to research in? - Quora",
    "tags": [
        "Academic Research",
        "Scientific Research",
        "Research",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeanine Joy",
                "href": "/profile/Jeanine-Joy"
            },
            "answer_text": "I have a long list I could write for this answer but I’ll talk about my most recent discovery. We spend 1/3 of our lives in bed. Research shows that about 88% of our beds contain dust mites. There are some prevalent myths about this topic. One is that if you’re not allergic to dust mites you won’t have to worry about them in your bed or pillow. This advice is fairly common when you begin reading about this topic and it’s wrong. For one thing, (I’m looking at you CDC and Public Health officials) there is only a teensy amount of research on this topic. Given that the 1/3 of our lives we spend sleeping affects the quality of our other 2/3 of life in significant ways, this is an oversight that should embarrass those who are supposed to be safeguarding and educating the public. Yes, I’m wagging my finger at you. Why? One of the more recent studies by researchers at the University of Virginia stated, “It is now clear that dust mite allergy is a key contributor to asthma in many parts of the world, and that long-term avoidance can be effective for preventing sensitization and minimizing the development and severity of respiratory disease.” Now, asthma affects 25 million Americans, about 8.8% of children and almost 8% of adults. It is a life-threatening, expensive, chronic disease that diminishes the quality of life for a lot of people. We know that exposure to dust mites, specifically their feces and dead bodies, can sensitize exposed individuals to them. They are an allergen. Once sensitized, the likelihood that they will develop eczema, asthma, and other respiratory illnesses increases substantially. You would think there would be a body of research that tests various types of mattress materials (i.e. latex, memory foam, innersprings, foam, gel foams, bio-foams, wool, etc.) and provide guidance that helps consumers be aware of the risk and of ways to protect themselves and choose mattresses and pillows that reduce exposure. I searched several research databases including PubMed and journals with the word “allergy” in the title of the journal and only located a couple dozen studies over the past two decades. Several of them involved individuals who had already developed asthma. One talked about dust mites in foam mattresses but did not specify which type of foam. Note: memory foam manufacturers frequently claim their products are dust mite resistant while also stating they use open-cell foams to keep the mattress cool. The research indicated that these arachnids that are too small for us to see with the naked eye can’t burrow into the foam but the only published study I could find said that the dust mite populations were higher in foam than in innerspring mattresses. If you follow my writing, you know I am a huge proponent of Primary Prevention. Primary Prevention efforts prevent illnesses instead of waiting until someone gets sick and treating symptoms. Everyone (hopefully) routinely does some things that were implemented as primary prevention initiatives — such as washing their hands after they use the restroom and before they prepare food. Primary Prevention is generally cheaper than treating the illness and prevents suffering. This area has huge potential to reduce the risk of developing asthma. What types of things should the public know? Parents should know that when a baby is exposed to high levels of dust mite allergens at 2 – 3 months old, they have a 3-fold increase in the odds of developing asthma by age 7. Co-sleeping on a parent’s mattress anyone? Co-sleeping isn’t recommended by the American Academy of Pediatrics but many people do it — on old mattresses. Whose children get stuffed toys? Stuffed toys on the bed increased the odds of above threshold exposure to allergens by 49-fold. My efforts to identify research that would guide purchase decisions for mattresses and pillows didn’t identify much helpful information. Another myth is that a lot of people are allergic to feather pillows. Dust mite colonizations in pillows increased substantially after people abandoned feather pillows in favor of synthetic fibers. Why? Feather pillows had to have very small pore sizes to keep the down inside the pillows. Pore sizes are measured in microns. Pillows with pores less than 10 microns are too small for dust mites to penetrate the pillow. Pillows with pores less than 6 microns are too small for immature dust mites and cat dander to penetrate. In one study, they put new pillows in a room that was infested with dust mites and the mites didn’t transfer to the feather pillows. There was research on this topic — a few of the studies reported that feather pillows had substantially fewer dust mites than synthetic pillows. One looked at claims of being allergic to feather pillows and discovered that when the feathers weren’t cleaned before the pillows were made, they could contain dust mites but properly cleaned feathers did not trigger allergic reactions in the test subject (except for one person). Copper is antimicrobial and antibacterial. Some products have copper threads woven into them which may protect against dust mites. Charcoal dust in concentrations of 20% killed 100% of dust mites. Some bedding products bake activated charcoal into the product but that’s not the same as dust and I couldn’t find any research about the efficacy of charcoal baked into foams. I also didn’t see any research about potential hazards to humans from putting their face in a pillow containing charcoal dust. Latex is naturally antibacterial which seems like it would help. I had one mattress manufacturer tell me that latex was worse because dust mites could eat it but the research I saw indicated that they only eat skin cells and fungi. I’d like researchers to sort this out. Latex doesn’t contain Volatile Organic Compounds (VOCs) that foams contain which can contribute to people developing chemical sensitivities. Researchers should compare dust mite colonizations in several of the newer mattress and pillow materials. Public health officials should make an effort to communication this information through pediatricians, physicians, and by including them in health classes at school. Sheepskin had high concentrations. Would wool, often used as a fire retardant in mattresses, also have high concentrations? The term “dust mite resistant” should be defined and a standard established that makes companies who make the claim meet the standard. Similar to the way “organic” is defined. I read a ton of research from many disciplines, During the past year, I’ve focused a lot of time and effort reading sleep research. It is the most ignored area of research I’ve seen. According to the CDC, we have an epidemic of sleep deprivation (over 30% of the population). Sleep deprivation negatively affects: Immune functionDigestive FunctionMental healthCo-ordinationMoodRelationshipsCognitive functionAbility to focusAssimilation of memoryHow many children developed asthma because the information their parents needed to prevent exposure wasn’t provided? The list of areas and education that should be researched and communicated to the general population is lengthy. But sleep health can largely be improved through public education about the connection between behaviors and sleep. The largest percentage of insomnia is related to anxiety. Stress management skills can greatly improve this aspect of sleep health, leading to improvements in every other area of life. For example, dust mites can’t survive when the indoor humidity is below 50%. Dehumidifiers can greatly improve dust mites. Using a combination of strategies is the most effective way to reduce exposure. Washing bedding in water that is 130° F (60° C) weekly helps as well. Take a peek at the instructions for most sheets and they will tell you to wash them in cold water. Cold water washing does kill about 90% of the dust mites but those little buggers breed fast. I want to eliminate any that have made their way to my bed. I’m very lucky. Neither of my children had asthma and now I feel equipped to share what I know to protect grandchildren when they come along. I lost my mom to a respiratory disease and this has left me wondering if dust mites might have played a role in the progression of her illness. Another thing that they find in pillows is fungi, which is especially dangerous for immunocompromised individuals. In one study, they found up to 16 different types of fungi in one pillow. How old is your pillow? Can it be washed in hot water? I’ve been using full mattress encasements for a while but we’re tossing all our pillows this week and replacing them with feather pillows with small pore covers that are washable. Our current pillows are washable but I didn’t wash them that often. The new ones will be washed every week when the sheets are washed. I hope this helps you keep your family healthy and I hope the research in the area of sleep health increases and that a public education campaign begins to provide information for consumers that helps them make wise choices. ",
            "date": "Answered November 12, 2019",
            "views": "174",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Stan Williams",
                    "user_href": "/profile/Stan-Williams-7"
                },
                {
                    "user_id": "Janet Ybarra",
                    "user_href": "/profile/Janet-Ybarra"
                },
                {
                    "user_id": "Caz Lessels",
                    "user_href": "/profile/Caz-Lessels"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kile Baker",
                "href": "/profile/Kile-Baker-1"
            },
            "answer_text": "Science is, and always will be, a never ending story of research. Most of the research leads to better and more accurate predictions. Once in a while there will be something that requires a major rethinking of how things work. It’s almost impossible to predict ahead of time where these paradigm shifts will happen. Right now, I think the major unresolved questions involve cosmology and the nature of dark energy and dark matter — note: they are different things. Perhaps the resolution of this open question will bring about the unification of gravity with the other three forces (strong, weak and electromagnetic). Or perhaps the resolution will tell us that no such unification is possible. ",
            "date": "Answered November 12, 2019",
            "views": "36",
            "upvotes": " Answer requested by Janet Ybarra",
            "upvoters": [
                {
                    "user_id": "Janet Ybarra",
                    "user_href": "/profile/Janet-Ybarra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ali Abdulla",
                "href": "/profile/Ali-Abdulla-15"
            },
            "answer_text": "My opinion all are imoortants, but the priorety is in madical sciences specially in the field of curing cancer and the ezhimer .Also in technology that helps imoroving life , developing new renewable energy resources , understanding how to protect our earth from possible impacts of astriods, meteorods and comets. ",
            "date": "Answered November 12, 2019",
            "views": "26",
            "upvotes": " View 1 Upvoter "
        }
    ]
}