{
    "title": "What are interesting facts of exoplanets? - Quora",
    "tags": [
        "Exoplanets",
        "Planets",
        "Space Exploration",
        "Outer Space"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sohan Ridwan",
                "href": "/profile/Sohan-Ridwan-1"
            },
            "answer_text": "Exoplanets are literally filled with wonders that include the techniques to find them to their size, ingredients and even the number of orbiting stars. Our best weapon to hunt exoplanets is the Kepler Space Telescope. Launched on 2009 Kepler looks continuously in an area of our milky way galaxy .Its field contains portions of the constellations Cygnus, Lyra, and Draco. Kepler Finds Planets when they travel past their host star and slightly dimming the stars brightness for a while.  Some of the facts that i loved is listed bellow. you can also find more in https://kepler.nasa.gov/Mission/discoveries/ Some of them has more then one orbiting star (Kepler-16b) This exoplanet seen in artists imagination has two stars. 200 light years away from earth in Kepler’s vision. However this planet is cold and not in the typical habitable zone. Exoplanets with extreme temperature (55 Cancri e)Discovered by Spitzer space telescope this one is hellish rocky planet. it orbits 25 times closer than Mercury is to our sun. Also it is tidally locked where one side faces its star all the time. In this current study, the Spitzer data revealed that 55 Cancri e’s sun-facing side is blistering hot at 2,000 kelvins or 3,140 degrees Fahrenheit. source - First-of-Its-Kind Glimpse at a Super Earth.  Image credit: NASA/JPL-Caltech Some of them are very fast exoplanets (51 Pegasi b )51 Pegasi b was discovered way back in 1995 orbits its host star 51 Pegasi in about 4 earth days. slightly larger then Jupiter 51 pegasi b proved that gas giants could be found near a star.  Image credit: NASA/JPL-Caltech Giants ( Kepler 12b, TrES-4)Kepler 12 b is very popular star that is massive about 1.7 times the size of Jupiter. lighter then water this one is considered to be a planet slightly hotter than Jupiter. wiki- Kepler-12b - Wikipedia TrES-4 is a planet that is 1.6 times the size of Jupiter and has extremely low densiy. The planet is located about 1,400 light years away from Earth and zips around its parent star in only three and a half days. source- Largest Known Exoplanet Discovered  Dense cluster of planets ( Kepler-11 system)This was the first compact solar system discovered by Kepler, and it revealed that a system can be tightly packed, with at least five planets within the orbit of Mercury, and still be stable.  Image credit: NASA/JPL-Caltech Finally Possible life bearer- Legendary Kepler 22bThis one could be our next home, first exoplanet to be found orbiting a stars habitable zone this super earth is about 2.4 times bigger then our home planet. Possibly has enough mass to hold an atmosphere too.  source Kepler-22b - Wikipedia. All these are new worlds … i wish i could visit them all ",
            "date": "Answered December 22, 2016",
            "views": "11",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pun Anansakunwat",
                    "user_href": "/profile/Pun-Anansakunwat"
                },
                {
                    "user_id": "Gwydion Madawc Williams",
                    "user_href": "/profile/Gwydion-Madawc-Williams"
                },
                {
                    "user_id": "Lutfar Rahman Milu",
                    "user_href": "/profile/Lutfar-Rahman-Milu"
                },
                {
                    "user_id": "Ian Taylor",
                    "user_href": "/profile/Ian-Taylor-104"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karthika",
                "href": "/profile/Karthika-80"
            },
            "answer_text": "Exoplanets: planets that exist orbiting stars other than our own sun or extrasolar planets are the planets that orbit stars other than our own sun or that wander without the benefit of a star to shine on them Feb 23 2017 Google celebrate exoplanet discovery with doodle Astronomers estimate that there could be trillions of planets around other stars. The densest exoplanet discovered to date is the planet Janssen (55 Cancri e). This planet also has a year of just less than 18 hours. The known exoplanets fall along a range of sizes, masses, and orbital positions. Exoplanets are so much further away than Pluto, that astronomers really need additional help to see them. The United States is just one of many countries working to locate exoplanets. CoRoT found its first exoplanet in 2007. Most exoplanets can only be detected indirectly because bright light from the stars that they orbit drowns them out. The region around a star where liquid water could exist on the surface of a solid planet is called the habitable zone.  ",
            "date": "Answered February 23, 2017",
            "views": "303",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jagrit Vats",
                    "user_href": "/profile/Jagrit-Vats"
                }
            ]
        }
    ]
}