{
    "title": "What is something people should know before becoming unemployed? - Quora",
    "tags": [
        "Unemployment",
        "Knowledge",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anders Wahlberg",
                "href": "/profile/Anders-Wahlberg"
            },
            "answer_text": "I took voluntary redundancy when I was 45. (note: that is a BAD age to job seek). Things I learnt: That it is easier to get a job when you already have one , than when you don’t.Create a CV - don’t bullshit! , Make it REALLY easy to read quickly (no more than two pages but make sure that the first page tells you ALL they need to know.Don’t expect to get jobs from job adverts. (That’s a lottery)Don’t trust HR departments. It is their job to reduce the applicants, not recommend them.Research the companies in your commune range (however you set that)Find out the name of the CEO, or MD .Write asking him if he could give you twenty minutes to advise him about how you could get into his industry sector (i.e. don;t ask for a job - even if you are).Research the company. Know what they do, who runs them and what they might need.Network: Ask everyone you know if they could give you twenty minutes (in work time - NOT at the pub/club) to discuss who/how/where you might find a job - don’t EVER - ask a friend for a job - just ask them for their ideas, leads etc. (but if they offer - take it!)Being unemployed - doesn’t mean not working. your job is finding a job.Get up at normal time get washed dressed, fed, and start your job hunt at 9 give yourself a lunch hour then work until 6. then finish. Monday to Friday.You are NOT unemployed at the weekend. Relax. Enjoy.Exercise - go to the gym if you can afford it. Hike, cycle, swim as much as possible - you need to keep body and mind string.NOTE: It is NEVER easy. Being unemployed was the hardest work I ever did. ",
            "date": "Answered February 6, 2019",
            "views": "290",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mondli Sidu",
                    "user_href": "/profile/Mondli-Sidu"
                },
                {
                    "user_id": "Stephen Meeks",
                    "user_href": "/profile/Stephen-Meeks"
                },
                {
                    "user_id": "Kenneth Andre Brown Sr",
                    "user_href": "/profile/Kenneth-Andre-Brown-Sr-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Derek Sathre",
                "href": "/profile/Derek-Sathre"
            },
            "answer_text": "One thing to be sure of is how to explain your gap in employment history to employers. You are going to have A LOT of time on your hands, be productive in something to keep going. ",
            "date": "Answered February 6, 2019",
            "views": "10",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Darryl Morhardt",
                    "user_href": "/profile/Darryl-Morhardt"
                }
            ]
        }
    ]
}