{
    "title": "What is the biological evidence of race that doesn't support a racial hierarchy? - Quora",
    "tags": [
        "Racial and Ethnic Groups"
    ],
    "response": [
        {
            "author_info": {
                "name": "Igor Rouzine",
                "href": "/profile/Igor-Rouzine-1"
            },
            "answer_text": "EDITED. The evidence is the ancestral tree of the humankind, below. The length of each branch is the % nucleotide difference between DNA of peoples, the scale is shown in the middle. The question is not entirely trivial, because there are mixed people, some similar people are quite far, and some superficially different people can be similar. Hence genetics is the decisive method of answering this question. When in 1960s people did not know how to sequence long DNA segments, they measured genetic variation at single nucleotide positions (SNP), and found it large enough among individuals of the same race to be comparable to inter-race variation. Then, left liberals became very happy and concluded that race does not exist. For example, Richard Lewontin from Harvard. They still say it, even serious geneticists, mostly, because they are bullied into it by administration. But when you take long DNA segments or full genome, which we learned only 20 years ago , you obtain very clear genetic separation of large groups people living in different localities, as shown below. As you can see, people living in 5 different continents or regions form 5 large branches, colored in 5 colors. Hence, 5 distinct races are observable. Race is real. It is a genetic fact, whether you like it or not. Each of them also has subdivisions (smaller twigs within colored areas). “Racial hierarchy”, however, is another matter. In order to create a hierarchy, you need to choose a parameter in which to order the 5 races. Which parameter do you choose? The number of inventions/discoveries? Buildings, infrastructure, sophisticated art? Conquered area? Number of slaves bought or sold? Ferocity and mass murder? Physical strength and speed? Average IQ? Fertility? The length of penis? The ability to survive elements? The list of possibilities is infinite. Thus, the proposed order of races will depend on your choice of the order parameter, which will always be politically motivated and self-serving. Hence, racism, i.e., belief that races have a hierarchy, is a political opinion, which has no connection to science.  ",
            "date": "Updated September 24, 2020",
            "views": "365",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Donna Smallen",
                    "user_href": "/profile/Donna-Smallen"
                },
                {
                    "user_id": "Bran Fuller Snow",
                    "user_href": "/profile/Bran-Fuller-Snow"
                },
                {
                    "user_id": "Frank Twomen",
                    "user_href": "/profile/Frank-Twomen"
                },
                {
                    "user_id": "ZI Alt",
                    "user_href": "/profile/ZI-Alt"
                },
                {
                    "user_id": "Gerard Smorowski",
                    "user_href": "/profile/Gerard-Smorowski"
                },
                {
                    "user_id": "Miguel Malfabon",
                    "user_href": "/profile/Miguel-Malfabon"
                },
                {
                    "user_id": "Paul Alex Martinez",
                    "user_href": "/profile/Paul-Alex-Martinez-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nick Ford",
                "href": "/profile/Nick-Ford-97"
            },
            "answer_text": "There is no ‘biological evidence’ of race. The concept of race is the arbitrary classification of people into groups based upon skin color and facial characteristics. ‘Biological evidence’ would need to support this classification in the genetic record. Whilst the genetic record clearly identifies differences, it cannot identify groups. The ‘biological evidence’ demonstrates that human variation is infinitely graduated. We are ALL mostly the same, and where we vary we are ALL different. — There are no genetic markers that appear exclusively in particular races. Therefore you cannot group individuals by genetic markers. — No groups mean no races. — It is easy to establish hierarchies in humans. It's a basic sorting process. You would simply need to set the variables. For example you could have height, weight, oxygen capacity, top speed…. — However, you cannot create racial hierarchies, because there are no demarcated races. You could never specify who was in which race. — The attempt to classify people into groups by genetics is called scientific racism. It is a pseudoscience. It is pursued by racists. ",
            "date": "Answered September 7, 2020",
            "views": "21",
            "upvotes": "0"
        }
    ]
}