{
    "title": "What are the true effects of fracking? Is it as truly terrible as people say? - Quora",
    "tags": [
        "Stop Fracking",
        "Hydraulic Fracturing",
        "Environmental Health",
        "Water Pollution"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sabira Woolley",
                "href": "/profile/Sabira-Woolley"
            },
            "answer_text": "Here are excerpts from studies and articles about fracking, addressing the health problems due to fracking contaminating ground water and air. I hope you will visit the links and read them in their entirety. There is a whole lot of important information. This is from - 8 Dangerous Side Effects of Fracking That the Industry Doesn't Want You to Hear About During the fracking process, methane gas and toxic chemicals leach out from the well and contaminate nearby groundwater. The contaminated water is used for drinking water in local communities. There have been over 1,000 documented cases of water contamination near fracking areas as well as cases of sensory, respiratory and neurological damage due to ingested contaminated water. and - More than 90 percent of the water used in fracking well never returns to the surface. Since that water is permanently removed from the natural water cycle, this is bad news for drought-afflicted or water-stressed states, such as Arkansas, California, Kansas, New Mexico, Oklahoma, Utah, Texas and Wyoming. and - The waste fluid left over from the fracking process is left in open-air pits to evaporate, which releases dangerous volatile organic compounds (VOCs) into the atmosphere, creating contaminated air, acid rain and ground-level ozone. Exposure to diesel particulate matter, hydrogen sulfide and volatile hydrocarbons can lead to a host of health problems, including asthma, headaches, high blood pressure, anemia, heart attacks and cancer. It can also have a damaging effect on immune and reproductive systems, as well as fetal and child development. A 2014 study conducted by the Colorado Department of Environmental and Occupational Health found that mothers who live near fracking sites are 30 percent more likely to have babies with congenital heart defects. This is from - Hydraulic Fracturing for Oil and Gas: Impacts from the Hydraulic Fracturing Water Cycle on Drinking Water Resources in the United States (Final Report) | US EPA EPA found scientific evidence that hydraulic fracturing activities can impact drinking water resources under some circumstances. The report identifies certain conditions under which impacts from hydraulic fracturing activities can be more frequent or severe: Water withdrawals for hydraulic fracturing in times or areas of low water availability, particularly in areas with limited or declining groundwater resources; Spills during the handling of hydraulic fracturing fluids and chemicals or produced water that result in large volumes or high concentrations of chemicals reaching groundwater resources; Injection of hydraulic fracturing fluids into wells with inadequate mechanical integrity, allowing gases or liquids to move to groundwater resources; Injection of hydraulic fracturing fluids directly into groundwater resources; Discharge of inadequately treated hydraulic fracturing wastewater to surface water; and Disposal or storage of hydraulic fracturing wastewater in unlined pits resulting in contamination of groundwater resources. This is from - Fracking Is Dangerous To Your Health -- Here's Why This post looks in greater depth at the health problems linked to fracking. These are not hypothetical concerns—there are now more than 700 studies looking at risks—and more than 80% of the health studies document risks or actual harms. It’s also important to note that these risks are likely to be seriously underestimated, because the environmental agencies have been downplaying the risks to the public. A new in-depth exposé from investigative journalists at Public Herald looks in-depth at the Pennsylvania Department of Environmental Protection’s (DEP) misconduct and negligence, as the DEP studiously ignored citizens’ complaints, sometimes not even testing water samples. Earlier studies from ProPublica and others showed similar EPA failures in the western U.S. and - A variety of health problems are associated with fracking Respiratory problems: Cough, shortness of breath and wheezing are the most common complaints of residents living near fracked wells. Toxic gases like benzene are released from the rock by fracking. Similarly, a toxic waste brew of water and chemicals is often stored in open pits, releasing volatile organic compounds into the air. These noxious chemicals and particulates are also released by the diesel powered pumps used to inject the water. An epidemiological study of more than 400,000 patients of Pennsylvania’s Geisinger clinic, done with Johns Hopkins School of Public Health, found a significant association between fracking and increases in mild, moderate and severe cases of asthma (odds ratios 4.4 to 1.5). Hopkins’ Dr. Brian Schwartz cautions that residents should be aware of this hazard as “some ‘pristine’ rural areas are converted to heavily trafficked industrial areas.” and - Problems during pregnancy: Fracking chemicals are harmful to pregnant women and their developing babies. West Virginia researchers found endocrine-disrupting chemicals in surface waters near wastewater disposal sites; these types of chemicals can hurt the developing fetus even when present at very low concentrations. Another Hopkins/Geisinger study looked at records of almost 11,000 women with newborns who lived near fracking sites and found a 40% increased chance of having a premature baby and a 30% risk of having the pregnancy be classified as “high-risk,” though they controlled for socioeconomic status and other risk factors. Contributing factors likely include air and water pollution, stress from the noise and traffic (1,000 tankers/well on average). and - Noise, stress and sleep deprivation Other studies have found that the noise from the drilling itself, the gas compressors, other heavy equipment and the truck traffic is high enough to disturb sleep, cause stress and increase high blood pressure. Longer-term exposure to noise pollution contributes to endocrine abnormalities and diabetes, heart disease, stress and depression, and has been linked to learning difficulties in children. Sleep deprivation has pervasive public health consequences, from causing accidents to chronic diseases. Another epidemiologic study from University of Pennsylvania and Columbia University compared the hospitalization rates between a county with active fracking and a neighboring county without. This study found that fracking well density was significantly associated with higher inpatient hospitalization for cardiac or neurologic problems. There was also an association between skin conditions, cancer and urologic problems and the proximity of homes to active wells. Spills and accidents With disturbing frequency, new spills or accidents are reported at the same time as industry tries to reassure that fracking brings safe and clean energy. Tell that to the residents of Dimock, Pa., who have had their drinking water destroyed, or those in many other communities. A newly released study found 6,648 spills in just four states over the past 10 years. Once again, the EPA had reported a far lower number—457 in eight states over a six-year period. Why the huge difference? Because the EPA chose to only look at the actual fracturing stage, rather than the whole life cycle of the gas and oil production.” There are also studies showing associations between fracking and earthquakes. I expect other answers will include those. If they don’t, I will add them to this answer when I get a chance. More links for learning about fracking - What is fracking — and why is it so controversial? Hydraulic fracturing - Wikipedia Special report: How the U.S. government hid fracking’s risks to drinking water | NPR Facts About Fracking - Live Science I answered - “What are the true effects of fracking? Is it as truly terrible as people say?” ",
            "date": "Updated August 3, 2018",
            "views": "368",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Meadows Blackburn",
                    "user_href": "/profile/James-Meadows-Blackburn"
                },
                {
                    "user_id": "Ron Nathan",
                    "user_href": "/profile/Ron-Nathan-1"
                },
                {
                    "user_id": "Angele Roy",
                    "user_href": "/profile/Angele-Roy"
                },
                {
                    "user_id": "Mike King",
                    "user_href": "/profile/Mike-King-51"
                },
                {
                    "user_id": "Emily Fisher",
                    "user_href": "/profile/Emily-Fisher-32"
                },
                {
                    "user_id": "Karen Carmichael",
                    "user_href": "/profile/Karen-Carmichael-7"
                },
                {
                    "user_id": "Kevin Paulson",
                    "user_href": "/profile/Kevin-Paulson-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Schmidt",
                "href": "/profile/Bob-Schmidt-22"
            },
            "answer_text": "The true facts of fracking are that it increases the supply of petro products and lowers their cost. It frees the Western world from extortion of undemocratic countries. It makes everything from manufacturing to transportation to vacation time much cheaper and beneficial to the working poor. Fracking in western countries is far cleaner for the environment than an equivalent amount of energy produced in countries that have no interest in a clean environment. The downside…. Some stupid Democrats who are not fact based oppose it (not Obama) and use it to defeat Democrats on election day by making Democrats look so superstitious. ",
            "date": "Answered July 31, 2018",
            "views": "62",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Michael Baker",
                    "user_href": "/profile/Michael-Baker-457"
                }
            ]
        }
    ]
}