{
    "title": "What is the living philosophy of your life? - Quora",
    "tags": [
        "Important Life Lessons",
        "Understanding Human Behavior",
        "Experiences in Life",
        "Philosophy of Everyday Life",
        "Human Behavior",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bijaya Biswal",
                "href": "/profile/Bijaya-Biswal"
            },
            "answer_text": "Neil Gaiman writes this excerpt in his book \"American Gods\", which I think sums up the basic philosophy of my life pretty well. \"I can believe things that are true and things that aren't true and I can believe things where nobody knows if they're true or not. I can believe in Santa Claus and the Easter Bunny and the Beatles and Marilyn Monroe and Elvis and Mister Ed. Listen - I believe that people are perfectable, that knowledge is infinite, that the world is run by secret banking cartels and is visited by aliens on a regular basis, nice ones that look like wrinkled lemurs and bad ones who mutilate cattle and want our water and our women. I believe that the future sucks and I believe that the future rocks and I believe that one day White Buffalo Woman is going to come back and kick everyone's ass. I believe that all men are just overgrown boys with deep problems communicating and that the decline in good sex in America is coincident with the decline in drive-in movie theaters from state to state. I believe that all politicians are unprincipled crooks and I still believe that they are better than the alternative. I believe that California is going to sink into the sea when the big one comes, while Florida is going to dissolve into madness and alligators and toxic waste. I believe that antibacterial soap is destroying our resistance to dirt and disease so that one day we'll all be wiped out by the common cold like martians in War of the Worlds. I believe that the greatest poets of the last century were Edith Sitwell and Don Marquis, that jade is dried dragon sperm, and that thousands of years ago in a former life I was a one-armed Siberian shaman. I believe that mankind's destiny lies in the stars. I believe that candy really did taste better when I was a kid, that it's aerodynamically impossible for a bumble bee to fly, that light is a wave and a particle, that there's a cat in a box somewhere who's alive and dead at the same time (although if they don't ever open the box to feed it it'll eventually just be two different kinds of dead), and that there are stars in the universe billions of years older than the universe itself. I believe in a personal god who cares about me and worries and oversees everything I do. I believe in an impersonal god who set the universe in motion and went off to hang with her girlfriends and doesn't even know that I'm alive. I believe in an empty and godless universe of causal chaos, background noise, and sheer blind luck. I believe that anyone who says sex is overrated just hasn't done it properly. I believe that anyone who claims to know what's going on will lie about the little things too. I believe in absolute honesty and sensible social lies. I believe in a woman's right to choose, a baby's right to live, that while all human life is sacred there's nothing wrong with the death penalty if you can trust the legal system implicitly, and that no one but a moron would ever trust the legal system. I believe that life is a game, that life is a cruel joke, and that life is what happens when you're alive and that you might as well lie back and enjoy it.\" ",
            "date": "Answered December 11, 2017",
            "views": "21",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Iddi Joseph",
                    "user_href": "/profile/Iddi-Joseph"
                },
                {
                    "user_id": "Longa Delfin",
                    "user_href": "/profile/Longa-Delfin"
                },
                {
                    "user_id": "Akshay Lokhande",
                    "user_href": "/profile/Akshay-Lokhande"
                },
                {
                    "user_id": "Utkarsh Saxena",
                    "user_href": "/profile/Utkarsh-Saxena-32"
                },
                {
                    "user_id": "Anshuman Nanda",
                    "user_href": "/profile/Anshuman-Nanda-2"
                },
                {
                    "user_id": "Shalini Sarangi",
                    "user_href": "/profile/Shalini-Sarangi"
                },
                {
                    "user_id": "Rishabh Sharma",
                    "user_href": "/profile/ऋषभ-शर्मा-Rishabh-Sharma"
                },
                {
                    "user_id": "Nidhi Jain",
                    "user_href": "/profile/Nidhi-Jain-192"
                },
                {
                    "user_id": "Nirmal Mathew",
                    "user_href": "/profile/Nirmal-Mathew-3"
                },
                {
                    "user_id": "Ankita Agnihotri",
                    "user_href": "/profile/Ankita-Agnihotri-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shweta Arora",
                "href": "/profile/Shweta-Arora-72"
            },
            "answer_text": "I just came back from market. My friend & I had gone to buy some food items. We spent about Rs. 300 on them. On our way back, we saw a shop where hot Chhole-Bhature were being sold. We decided to get one plate packed. The menu was: Plain Chhole Bhature - Rs. 50Stuffed Chhole Bhature - Rs. 45Only Chhole - Rs. 30While we were waiting for our turn, a man came and stood adjacent to us. He was weak and wearing torn clothes. The jacket on him seemed very old. Hesitated as he was, he asked the shopkeeper to pack the third item on the list that costed Rs. 30. He took the plate and went to his rickshaw, which was his source of income. The plate had only chhole in it. I think everyone standing there had the same feeling as I was having. The same feeling that you are having while reading this. I can easily spend Rs. 300 on snacks and satisfy my craving for food. The man perhaps would have heard of the shop and his taste buds must have forced him to try it at least once, irrespective of his financial condition. He could afford only Rs. 30. What did I do to deserve a family that can afford my expenditure and what did he do to deserve a family that cannot? Yet, we complain. We complain about the things we don’t have. We complain about our unfulfilled desires. We complain all the time. I’ve got no right to pity the poor man. I didn’t do anything to deserve the life I’m living. The money I can spend is not even mine. I didn’t earn it. He earned his! He labours all day round, suffers physical exertion and still, while pacifying his taste buds, accepts his budget. And what we do is - accept less & expect more! Accept more & Expect less. The living philosophy of my life is: Accept that you can’t change what you were born with, but you can try to change the rest of your life. Life’s unfair - but that’s how it is!Trust your resources, not excuses. You can never have what you want, if you keep nagging about the absence of resources in your life.Don’t feel proud of your possessions unless you’ve earned them. Frankly, they’re not even your possessions.Even if you’ve earned them, understand that there were many factors in addition to your hard work and they played their role.Always feel grateful, rather than boasting about your achievements. Otherwise, you’ll neither have achievements, nor ears to hear you.",
            "date": "Answered January 7, 2017",
            "views": "28",
            "upvotes": " View 63 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Fabio Hideki",
                    "user_href": "/profile/Fabio-Hideki-2"
                },
                {
                    "user_id": "Ankur Kumar",
                    "user_href": "/profile/Ankur-Kumar-35"
                },
                {
                    "user_id": "Judith McGrath",
                    "user_href": "/profile/Judith-McGrath-9"
                },
                {
                    "user_id": "Samhitha Medipalli",
                    "user_href": "/profile/Samhitha-Medipalli-1"
                },
                {
                    "user_id": "Prarthana Fabyani",
                    "user_href": "/profile/Prarthana-Fabyani"
                },
                {
                    "user_id": "Harsh Ghawari",
                    "user_href": "/profile/Harsh-Ghawari-1"
                },
                {
                    "user_id": "Sachin Agarwal",
                    "user_href": "/profile/Sachin-Agarwal-534"
                },
                {
                    "user_id": "Akshatha Chakravarthy",
                    "user_href": "/profile/Akshatha-Chakravarthy"
                },
                {
                    "user_id": "Amanpreet Singh",
                    "user_href": "/profile/Amanpreet-Singh-83"
                },
                {
                    "user_id": "Rajaram Mohan",
                    "user_href": "/profile/Rajaram-Mohan-3"
                }
            ]
        }
    ]
}