{
    "title": "What are some technological advances that were predicted in the 20th century, but haven’t come about? - Quora",
    "tags": [
        "Technological Advancement",
        "History of Technology",
        "Innovation",
        "Invention and Inventions",
        "Technology Trends"
    ],
    "response": [
        {
            "author_info": {
                "name": "Israel Ramirez",
                "href": "/profile/Israel-Ramirez"
            },
            "answer_text": "We still don’t have a universal cure for cancer. People became enormously optimistic about what technology could accomplish in the 1960s. Americans had reached a high standard of living and had finally made real progress in medicine and creating marvelous inventions like color TV, commercial jets, nuclear power, and enormous computers. Americans had even sent spacecraft to the moon. Everything seemed possible. In 1971, President Nixon declared that he planned to launch an intensive campaign to find a cure for cancer: The time has come in America when the same kind of concentrated effort that split the atom and took man to the moon should be turned toward conquering this dread disease. Let us make a total national commitment to achieve this goal. Later that year President Nixon signed the National Cancer Act into law, and declared, \"I hope in the years ahead we will look back on this action today as the most significant action taken during my Administration.\"[1] [2]  A lot of ordinary people, back then, hoped that we would win that war or at least make a substantial progress. Scientists were more cautious but one cancer specialist predicted that cancer would be wiped out by the 1976 American Bicentennial.[3] President Clinton continued the war declaring, in 1998, \"I ask you to support this initiative so ours will be the generation that finally wins the war against cancer and begins a revolution in our fight against all deadly diseases.\"[4] More recently, Dr. Andrew von Eschenbach, the director of the National Cancer Institute, issued a Director's Challenge in 2003 promising quick success.[5] [6]  President Obama published a plan to double funding as part of a drive to find “a cure for cancer in our time.”[7] [8]  It’s been a long war but people still die from various kinds of cancers. This chart shows that death rates in the USA have fallen somewhat since then.  The same pattern appears if you look at individual cancer types. The big decline in death from tracheal, bronchus, and lung cancer is probably due to people smoking less.[9]  People disagree about the exact degree of improvement. One authority claims that, since 1991, cancer death rates dropped 25 percent.[10] Another is more pessimistic saying “since 1971, the cancer mortality rate has gone down about 5 to 10 percent.”[11] Here’s a good discussion of why it’s hard to judge how much rates have fallen.[12] Maybe you know someone who is alive on account of some new drug or treatment. Such people exist but not as many as we would like. There’s no question that we haven’t made as much progress as we hoped for. Why haven’t we conquered cancer? There are lots of things we didn’t appreciate in 1971: Cancers are very diverse. Even ones from the same organ can differ a lot from one person to the next. Treatments that work for one patient may not work for another.Cancers evolve. If you try to kill them with a drug, most of the cells die but are gradually replaced by ones that can resist that drug.Some cancerous cells have the ability to hide from drugs or the immune system.Cancer cells resemble normal ones. It’s hard to find drugs that act on the cancerous cells but not normal ones.Animal models haven’t been as helpful as we would like. Drugs that work on mice don’t always work on people. That makes it harder to test a lot of different possible drugs.It’s hard to conduct clinical trials on people. It’s hard to assemble a team that can treat patients consistently. It’s hard to get patients to volunteer for a trial in which they may get a placebo. It’s hard to meet current legal and ethical requirements. It’s hard to monitor patients for years. All of this requires a lot of money.Detecting cancer at an early stage is more difficult than anyone imagined in 1971. The sooner you detect it, the better your chances of success but it’s been hard to devise blood or other tests that reliably detect cancer at an early stage.It’s been hard to find ways to prevent cancers. Getting people to stop smoking works. Getting vaccinated for Hepatitis B and Human papillomavirus helps.[13] [14] But, beyond that, there aren’t many other proven methods.There’s one more thing that everyone forgets: Scientists had only a very crude understanding of cellular and molecular biology in 1971. They didn’t have anything like the understanding we have now concerning the genetic machinery and immunology. Lots of recently developed technologies are based on concepts that no one imagined back then. Even now, in 2019, we still have a long way to go.More to read This book gives a great history of the war on cancer:  This article covers the history in a different way: Rethinking the War on Cancer Here’s a history intended for scientists: Progress against Cancer (1971–2011): How far have we come? This article gives a provocative introduction to the problems of doing cancer research on people: How to Cure Cancer Footnotes[1] President Nixon declares war on cancer[2] Medscape Log In[3] https://www.washingtonpost.com/national/health-science/defeating-cancer-was-once-a-war-now-its-a-moonshot/2016/12/09/65d9628a-b70c-11e6-959c-172c82123976_story.html[4] Obama's new, new!, new!!, new!!!, new!!!! war on cancer: Column[5] The War on Cancer Rages On[6] NCI sets goal of eliminating suffering and death due to cancer by 2015.[7] The War on Cancer Rages On[8] Obama signs $6.3 billion law for cancer research, drug treatment[9] Cancer[10] Cancer death rate has dropped 25 percent since 1991 peak[11] https://www.washingtonpost.com/national/health-science/defeating-cancer-was-once-a-war-now-its-a-moonshot/2016/12/09/65d9628a-b70c-11e6-959c-172c82123976_story.html[12] Cancer Death Rate Continues to Decline[13] 7 healthy habits that can reduce your risk of cancer[14] How to Prevent Cancer or Find It Early",
            "date": "Answered October 8, 2019",
            "views": "13",
            "upvotes": " View 20 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bruno Mailly",
                    "user_href": "/profile/Bruno-Mailly"
                },
                {
                    "user_id": "Sujoy Das",
                    "user_href": "/profile/Sujoy-Das-225"
                },
                {
                    "user_id": "Ed Orduno",
                    "user_href": "/profile/Ed-Orduno"
                },
                {
                    "user_id": "Joshua Engel",
                    "user_href": "/profile/Joshua-Engel"
                },
                {
                    "user_id": "Vincent Omondi",
                    "user_href": "/profile/Vincent-Omondi-5"
                },
                {
                    "user_id": "Ethan Schoales",
                    "user_href": "/profile/Ethan-Schoales-1"
                },
                {
                    "user_id": "Mohamed Asif",
                    "user_href": "/profile/Mohamed-Asif-3"
                },
                {
                    "user_id": "Huang ZheYu",
                    "user_href": "/profile/Huang-ZheYu"
                },
                {
                    "user_id": "Marius Kieles",
                    "user_href": "/profile/Marius-Kieles"
                },
                {
                    "user_id": "Tanzilur Rahaman",
                    "user_href": "/profile/Tanzilur-Rahaman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sam Zbib",
                "href": "/profile/Sam-Zbib"
            },
            "answer_text": "Scientist are usually conservative when making predictions. In science, one can probably only make predictions about issues that have the fundamental science locked in place, but which still require breakthroughs in engineering and scale (in price, size, availability, etc…). So in this regard, faster than light space travel, or Matrix like living were never scientific predictions, because the basic sciences required to make them happen was never clear. Below may be examples that fit the definition for widely predicted scientific breakthroughs: Space Tourism would become commonplaceControlled Nuclear Fusion will solve all our energy needs.Even then, these aren’t just engineering issues but also required (and still do require) major breakthroughs in physics. But if you consider the the general lay person, or fiction novelist, predictions could range from time travel to teleportation and so on. It's 2018. Here's what people a century ago thought our lives would be like 11 ridiculous future predictions from the 1900 world's fair — and 3 that came true. ",
            "date": "Answered October 4, 2019",
            "views": "56",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bruno Mailly",
                    "user_href": "/profile/Bruno-Mailly"
                },
                {
                    "user_id": "Israel Ramirez",
                    "user_href": "/profile/Israel-Ramirez"
                }
            ]
        }
    ]
}