{
    "title": "What are the current technologies in IT? - Quora",
    "tags": [
        "New Technologies",
        "Information Technology",
        "Technology Trends"
    ],
    "response": [
        {
            "author_info": {
                "name": "Oliver Homes",
                "href": "/profile/Oliver-Homes-1"
            },
            "answer_text": "Tор Trеndіng Tесhnоlоgіеѕ 1. Artіfісіаl Intelligence (AI) Artіfісіаl Intеllіgеnсе, оr AI, hаѕ already rесеіvеd a lоt of buzz іn rесеnt years, but іt continues to bе a trеnd tо wаtсh bесаuѕе іtѕ еffесtѕ оn hоw wе live, wоrk, аnd рlау аrе оnlу іn the early ѕtаgеѕ. In аddіtіоn, other brаnсhеѕ оf AI hаvе dеvеlореd, іnсludіng Mасhіnе Lеаrnіng, which wе wіll gо into bеlоw. AI rеfеrѕ tо соmрutеr systems buіlt to mіmіс humаn intelligence аnd реrfоrm tasks such as rесоgnіtіоn оf images, ѕреесh оr patterns, аnd dесіѕіоn mаkіng. AI саn dо thеѕе tаѕkѕ fаѕtеr and more accurately thаn humаnѕ. Fіvе оut оf ѕіx Americans uѕе AI ѕеrvісеѕ in оnе form оr another еvеrу dау, іnсludіng nаvіgаtіоn аррѕ, ѕtrеаmіng ѕеrvісеѕ, smartphone personal assistants, rіdе-ѕhаrіng apps, hоmе реrѕоnаl аѕѕіѕtаntѕ, аnd ѕmаrt hоmе dеvісеѕ. In addition tо consumer uѕе, AI іѕ uѕеd to ѕсhеdulе trains, аѕѕеѕѕ buѕіnеѕѕ risk, predict mаіntеnаnсе, аnd іmрrоvе еnеrgу efficiency, among many оthеr money-saving tаѕkѕ. AI is оnе part of what we rеfеr to brоаdlу as automation, аnd аutоmаtіоn is a hоt tоріс bесаuѕе оf роtеntіаl jоb lоѕѕ. Exреrtѕ ѕау аutоmаtіоn wіll еlіmіnаtе 73 mіllіоn mоrе jobs by 2030. Hоwеvеr, automation is сrеаtіng jоbѕ аѕ wеll аѕ eliminating thеm, еѕресіаllу in thе fіеld оf AI: Pundіtѕ рrеdісt that jobs іn AI wіll number 23 mіllіоn by 2020. Jоbѕ wіll be created іn dеvеlорmеnt, рrоgrаmmіng, testing, ѕuрроrt, аnd maintenance, tо name a fеw. Artіfісіаl Intеllіgеnсе аrсhіtесt is one such job. Sоmе say іt wіll soon rival dаtа ѕсіеntіѕtѕ іn need оf ѕkіllеd рrоfеѕѕіоnаlѕ. Tо lеаrn mоrе аbоut роtеntіаl jоbѕ іn AI, rеаd аbоut building a career in AI, оr whу you ѕhоuld еаrn аn AI certification. 2. Mасhіnе Lеаrnіng Mасhіnе Lеаrnіng іѕ a subset оf AI. Wіth Mасhіnе Learning, соmрutеrѕ аrе programmed tо lеаrn tо dо ѕоmеthіng thеу аrе nоt рrоgrаmmеd tо dо: thеу lеаrn bу dіѕсоvеrіng раttеrnѕ аnd іnѕіghtѕ frоm data. In general, wе have twо types of lеаrnіng, supervised and unѕuреrvіѕеd. While Mасhіnе Learning is a subset оf AI, we аlѕо have ѕubѕеtѕ wіthіn the dоmаіn оf Mасhіnе Learning, іnсludіng nеurаl nеtwоrkѕ, natural lаnguаgе рrосеѕѕіng (NLP), аnd dеер lеаrnіng. Each of thеѕе ѕubѕеtѕ оffеrѕ аn opportunity fоr ѕресіаlіzіng in a саrееr field thаt wіll оnlу grоw. Machine Learning іѕ rapidly bеіng dерlоуеd in аll kіndѕ оf industries, creating a hugе dеmаnd for ѕkіllеd рrоfеѕѕіоnаlѕ. Thе Machine Lеаrnіng mаrkеt іѕ expected tо grоw to $8.81 billion bу 2022. Mасhіnе Learning аррlісаtіоnѕ are used fоr dаtа аnаlуtісѕ, dаtа mіnіng, аnd раttеrn rесоgnіtіоn. On thе соnѕumеr еnd, Machine Learning роwеrѕ wеb search rеѕultѕ, rеаl-tіmе аdѕ, аnd network іntruѕіоn detection, tо nаmе only a few of thе mаnу tаѕkѕ іt саn dо. In аddіtіоn to соmрlеtіng соuntlеѕѕ tаѕkѕ on оur bеhаlf, іt іѕ generating jоbѕ. Machine Lеаrnіng jоbѕ rаnk аmоng thе top еmеrgіng jobs оn LіnkеdIn, wіth аlmоѕt 2,000 job listings posted. And thеѕе jоbѕ pay wеll: In 2017, thе mеdіаn salary for a mасhіnе lеаrnіng еngіnееr was $106,225. Mасhіnе Lеаrnіng jоbѕ іnсludе еngіnееrѕ, developers, researchers, аnd dаtа ѕсіеntіѕtѕ. 3. Rоbоtіс Prосеѕѕ Autоmаtіоn оr RPA Lіkе AI аnd Mасhіnе Learning, Rоbоtіс Prосеѕѕ Automation, оr RPA, іѕ аnоthеr tесhnоlоgу thаt іѕ аutоmаtіng jоbѕ. RPA is the use оf ѕоftwаrе tо аutоmаtе buѕіnеѕѕ рrосеѕѕеѕ such аѕ interpreting applications, рrосеѕѕіng transactions, dеаlіng wіth dаtа, аnd еvеn rерlуіng tо emails. RPA automates repetitive tаѕkѕ thаt people uѕеd to do. Thеѕе аrе not juѕt thе menial tаѕkѕ оf a low-paid wоrkеr: uр to 45 percent оf thе activities wе dо саn be аutоmаtеd, іnсludіng thе work оf fіnаnсіаl mаnаgеrѕ, dосtоrѕ, and CEOѕ. Although Fоrrеѕtеr Rеѕеаrсh еѕtіmаtеѕ RPA аutоmаtіоn will thrеаtеn thе lіvеlіhооd оf 230 mіllіоn оr mоrе knоwlеdgе wоrkеrѕ оr аррrоxіmаtеlу 9 реrсеnt оf thе glоbаl wоrkfоrсе, RPA іѕ аlѕо сrеаtіng nеw jоbѕ while altering еxіѕtіng jоbѕ. MсKіnѕеу finds thаt lеѕѕ thаn 5 реrсеnt оf occupations саn bе tоtаllу automated, but about 60 percent саn be partially automated. For you as an IT professional lооkіng tо thе futurе аnd trying tо understand tесhnоlоgу trends, RPA offers рlеntу оf саrееr opportunities, including developer, рrоjесt mаnаgеr, buѕіnеѕѕ аnаlуѕt, ѕоlutіоn architect, аnd consultant. And thеѕе jоbѕ рау well. SіmрlуHіrеd.соm says thе аvеrаgе RPA ѕаlаrу is $73,861, but thаt іѕ the аvеrаgе соmріlеd frоm salaries fоr junіоr-lеvеl developers uр tо senior solution architects, with thе tор 10 percent еаrnіng оvеr $141,000 аnnuаllу. Sо, if you’re keen on lеаrnіng and рurѕuіng a саrееr іn RPA, the Intrоduсtіоn to Robotic Prосеѕѕ Autоmаtіоn (RPA) соurѕе ѕhоuld bе thе next step you tаkе to kickstart an RPA саrееr. ",
            "date": "Answered October 16, 2020",
            "views": "82",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Yaswanth Sai Palaghat",
                "href": "/profile/Yaswanth-Sai-Palaghat"
            },
            "answer_text": "In present IT,it is very difficult to determine one particular technology as the best among others,because everyday is a evolution in computing and every single paves a way for a new technology. But,according to the present job scenario and stack overflow popularity,the below technologies have good growing opportunities: 1.Artificial Intelligence  It covers technologies that are used for prediction purpose.The technology stack of AI constitutes Machine LearningDeep LearningComputer VisionHuman Computer InteractionRobotics2.Data Science Data Science is all about cleaning,analyzing,organizing,preparing and visualizing the data.  It requires the following things to be included: StatisticsMachine LearningData miningData Analytics3.Big Data and Cloud Computing  These are another boom areas to be considered as the trending technologies in the present IT sector . It is because of the importance of data in the life of every individual and consistent improvement in social networks and ecommerce traffic. 4.Full Stack Development using MERN/MEAN With the advent of javascript evolution in the web world,things have been vibrantly changed as it is coming up with number of frameworks every day.  M-MONGODBA-ANGULARR-REACTE-EXPRESS.JSN-NODE.JS 5.ANDROID DEVELOPMENT  As the internet users are more comfortable with using android apps than websites,the demand of android development becomes very high.The two popular ways of building android apps are through: JavaKotlin6.Business Intelligence and Data Visualization  For every business,there is a lot to deal with data.Data visualization becomes essential on every business and there is large demand in this area. The popular tools of BI and Data Visualization are: TableauPowerBI7.Automation  As the role of manual monitoring and surveilance is no more interested by the enterprises, everyone is now looking for the automation processes which automates the task of handling various operations in the enterprise. Robotic Process Automation is one such popular technology to look out for.The popular RPA tools are: UIPATHBLUEPRISM8.Devops  Devops is the combination of Development and operations team in a software organization,which is advanced version to agile development. 9.MicroServices  It is the way of modularizing the services of a software product into independent modules.Microservices enables to complete the software product quickly without depending on other services. 10.Blockchain  Blockchain technology is the decentralized computing environment ,where distributed computing plays an important role here.Cryptocurrency is the major element that profounces the importance of blockchain. ",
            "date": "Answered February 3, 2019",
            "views": "18",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mudassar Sharif",
                    "user_href": "/profile/Mudassar-Sharif-16"
                },
                {
                    "user_id": "Dileesh Kumar",
                    "user_href": "/profile/Dileesh-Kumar-7"
                },
                {
                    "user_id": "Varun Arya",
                    "user_href": "/profile/Varun-Arya-10"
                },
                {
                    "user_id": "Manula Doratiyawa",
                    "user_href": "/profile/Manula-Doratiyawa"
                }
            ]
        },
        {
            "author_info": {
                "name": "ThruSkills",
                "href": "/profile/ThruSkills-1"
            },
            "answer_text": "Technologies which are ruling current IT sector are as follows: Full Stack Development With MERNAWS Solutions Architect Certification TrainingFull Stack Development With MEANAI and ML with PythonIn IT sector there is a huge demand of this languages. According to reports, by 2025, the market of this language will increase. #Full Stack Development: Netflix, Facebook, Dropbox, Reddit, Airbnb, and many other MNCs are using MERN stack.The average salary of a MERN stack developer is $105,000 per annum- PayScale. #AWS Solutions Architect Certification Training: The job market has a huge demand for AWS professionals. There are so many organizations that are looking forward to hiring more and more certified professionals. The average salary offered for the AWS certified individual is around $113,000. However, the salary depends on experience. #Full Stack Development With MEAN: With the knowledge of MEAN stack, you can develop various web applications, command line interfaces, mobile apps and a lot more. Big companies such as PayPal, Apple, Instagram use React(a MEAN technology) to build their applications. It is a good career move for people interested in making a career in web development. #AI and ML with Python: With the knowledge of Python, you can develop various web applications, command line interfaces, mobile apps and a lot more. It is a good career move for people interested in making a career in web development. So if you really want to get a high-paying job in IT sector, call us to consult at +91 831 737 5392 ",
            "date": "Answered January 30, 2020",
            "views": "537",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Preet Kumar",
                "href": "/profile/Preet-Kumar-108"
            },
            "answer_text": "First of all information technology is a leading and dominating field. We like to used IT in our day to day life because of it helps to gain understanding about new concept and things. Let's take a deep look about trends in information technology. There are much more new concept is in development that we'll use in the future and some of them we are using now in our smartphones and in smart devices. These are the latest technology trends: 1 Artificial intelligence – when we think about IT then we can't skip artificial intelligence because of Ai is deeply connected to the IT and which is, we are using everyday for making our lifestyle more convenient. 2 Virtual reality – virtual reality is growing massively and peoples are crazy about them. It has prevail impact on our brain because of when we use VR it makes the gameplay or watching videos like we are in them. 3 Cyber security – having security is the human right and information technology has made this more secure and more realiable. 4 internet is the home of everything – One of the most favourable and usable thing in the entire world. It is the home of everything, whether you're finding an answer of your querie or gaining knowledge about something (you are not clear about) I hope it helps… ",
            "date": "Answered June 3, 2019",
            "views": "894",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bhawna Mani",
                    "user_href": "/profile/Bhawna-Mani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shreedhar Tiadi",
                "href": "/profile/Shreedhar-Tiadi"
            },
            "answer_text": "Current trends or recent trends, IT has always been about producing the useful information for its users, so the new technologies today emphasize on the same thing PRODUCING USEFUL INFORMATION Now go on and check what all tools and techniques you can use to produce those kind of information that will monetize you and interests you Apart from that IOT, AI, VR, AR are new trending technology and even gaming applications using VR is something super cool or building something like Jarvis is pretty cool and for all that u need one skill in common and that's programming. Learn any one popular computer language and start building something cool If you like to play with data play with SAS , R or big data tools and that's it IT is adventurous go and explore Happy learning ",
            "date": "Answered February 2, 2017",
            "views": "23",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Chethan",
                    "user_href": "/profile/Chethan-162"
                }
            ]
        },
        {
            "author_info": {
                "name": "Samrat Roy Chowdhuri",
                "href": "/profile/Samrat-Roy-Chowdhuri"
            },
            "answer_text": "First of all, we are in an age of continuous innovation and new inventions. Even when you sleep, something new is being worked upon, improvised and implemented. There is innovation happening 24x7 and most of it is happening not because of giants but despite them. Now, coming back to your question here are the ones: Artificial Intelligence - Organizations are looking to rapidly do away with jobs that were mundane and required human support - like ticket logging, following up, etc.Deep LearningMachine LearningBlockchain - I am personally a big fan of this technology. Try learning Solidity because Ethereum is a big hitInternet of ThingsArtificial IntelligenceConversational UI (Chatbots)Virtual RealityAugmented RealityCloud ComputingBig Data",
            "date": "Answered September 1, 2017",
            "views": "7",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vignesh",
                    "user_href": "/profile/Vignesh-584"
                },
                {
                    "user_id": "Bhuvaneshwari Kalmari",
                    "user_href": "/profile/Bhuvaneshwari-Kalmari"
                },
                {
                    "user_id": "Jitendra Singhal",
                    "user_href": "/profile/Jitendra-Singhal-1"
                },
                {
                    "user_id": "Sheersho Pramanik",
                    "user_href": "/profile/Sheersho-Pramanik"
                },
                {
                    "user_id": "Swathi Krishna",
                    "user_href": "/profile/Swathi-Krishna-78"
                },
                {
                    "user_id": "Amit Kulkarni",
                    "user_href": "/profile/Amit-Kulkarni-116"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harish Kedar",
                "href": "/profile/Harish-Kedar-5"
            },
            "answer_text": "The IT industry is experiencing a lot of trends, As the technology evolves it enables faster processes & changes, there is an acceleration of change in the trends of the IT Industry, and we need to be well aware of all these technological trends and probably how to learn them. The technological trends in the IT world are as follows: Artificial IntelligenceMachine LearningData scienceBlockchain technologyEdge computingVirtual Reality & Augmented RealityCyber SecurityInternet of thingsThese are the trending technologies in the industry of IT. ",
            "date": "Answered February 20, 2019",
            "views": "346",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ato Endashaw Ethiopia",
                    "user_href": "/profile/Ato-Endashaw-Ethiopia"
                }
            ]
        },
        {
            "author_info": {
                "name": "Manish Mittal",
                "href": "/profile/Manish-Mittal-135"
            },
            "answer_text": "Technology nothing but is the feature life.Technology is an ever changing, always evolving thing. There are new technologies coming out every year and there is always something on the brink of becoming mainstream. Technology like smart watch , VR glasses, Google glasses, Robotics everywhere robots do the job, Autopilot mode in car and auto drive the car. Data storage IBM already developed a chip which containing 320TB in single chip which is easily to folded. 7g network. Virtual games. ",
            "date": "Answered September 8, 2017",
            "views": "1",
            "upvotes": " Answer requested by KIRAN THOMBARE",
            "upvoters": [
                {
                    "user_id": "Sandeep Mishra",
                    "user_href": "/profile/Sandeep-Mishra-590"
                },
                {
                    "user_id": "Sinthiya Selvaraj",
                    "user_href": "/profile/Sinthiya-Selvaraj"
                },
                {
                    "user_id": "Nahid Tabassum",
                    "user_href": "/profile/Nahid-Tabassum"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ayan Garg",
                "href": "/profile/Ayan-Garg-5"
            },
            "answer_text": "I always following the below stackoverflow page to check the top most technologies in IT area from a programmer point of view. Stack Overflow Developer Survey 2018 Apart from this many companies massively using BigData platform. So, Spark+ Scala+python, hadoop,hive is in top most list . For Devops : Chef, puppet, ansible, teamcity, jenkins, aws, docker, swarm, kubernates, mesos are heavily used. ",
            "date": "Answered May 4, 2018",
            "views": "885",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yuriy Vorobyov",
                    "user_href": "/profile/Yuriy-Vorobyov-1"
                },
                {
                    "user_id": "Bobby Sammons",
                    "user_href": "/profile/Bobby-Sammons"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anastasiya Malygina",
                "href": "/profile/Anastasiya-Malygina"
            },
            "answer_text": "Good day to everyone! Now the role of information technology become even bigger and bigger for the business. It gains traction in all spheres of life, definitely. Real estate software development and medicine information technologies are not an exception. It really might be useful for enterprising. Also, IT might be helpful if you want to promote some product in world net using social media integration. How to create your own app, some tips and not only - you might see it here. Try to learn it if you want. Best wishes!) ",
            "date": "Answered May 8, 2018",
            "views": "671",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Rahul Kumar",
                "href": "/profile/Rahul-Kumar-5064"
            },
            "answer_text": "Machine LearningArtificial intelligenceAR/VRCloud computingBig Data",
            "date": "Answered August 16, 2017",
            "views": "397",
            "upvotes": " Answer requested by Collete Rozario"
        },
        {
            "author_info": {
                "name": "Chris Thorp",
                "href": "/profile/Chris-Thorp-8"
            },
            "answer_text": "Here is the great information you can find out: List of emerging technologies - Wikipedia ",
            "date": "Answered April 11, 2018",
            "views": "251",
            "upvotes": "0"
        }
    ]
}