{
    "title": "What are some of the cheapest ways to add nutrients to garden soil? - Quora",
    "tags": [
        "Urban Gardening",
        "Nutrients",
        "Vegetable Gardening",
        "Gardens",
        "Soil Science (pedology)",
        "Soil",
        "Gardening",
        "Farming",
        "Agriculture"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sharon Sampson",
                "href": "/profile/Stormy-Sampson-1"
            },
            "answer_text": "The word ‘nutrients’ suggests FOOD. No soil has food for plants, none! All plants that photosynthesize MAKE their own ‘food’ or ‘fuel’. We humans who want and need to grow plants for OUR use aesthetically or nutritionally have simply got to get this straight~! There is NOTHING we humans can add that would or could ever be considered nutrients for plants. This is an important bit of knowledge to KNOW. We humans, we animals think that plants must need food and whenever they put words on packages such as Plant Food or Plant Nutrients humans always think MORE IS BETTER. Wrong. Simply wrong way to think about fertilizer for plants. Plants make 100% of their own food/fuel. We humans who need to eat more than some ‘food forest’ is able to produce need to learn that WE have to add the chemistry plants need to be able to do photosynthesis to make enough for thriving plants as well as feed US humans. ALL soils are improved just by dumping DECOMPOSED organic matter on the SURFACE of the soil. Humans who think they can amend or make their soil better by adding gravel, sand, clay, gypsum, lime, water and rototilling are actually just making concrete. All soils are great soils if we understand the basics of soil and simply add DECOMPOSED organic matter to the surface of the soil. The soil organisms actually eat this stuff and multiply and swim swim swim in the top soil mixing the decomposed organic matter into the topsoil better than any human could or should. Get rid of the word ’nutrients’. Replace with the word chemistry. Once one’s beds are double dug  …adding shallow trenches at the perimeter, these beds you are looking at have lasted 8 years, no rototilling every year, simply cleaning out the trenches throwing that soil and goodies back up on the bed and one is ready for the next season. Plants need soil with T I L T H. These beds have tilth, drainage, tons of micro and macro soil organisms. These beds DO NOT HAVE the chemistry necessary for plants to make their own food, to stay vigorous and to stay disease free. We add an all purpose balanced fertilizer when our starts for plants have reached their 3rd set of leaves. We KNOW just by looking at plants what chemistry is lacking, what chemistry is too much and what elements are lacking or even too much. Fertilizer is NOT FOOD. The proper amount and type of fertilizer is AS CRITICAL AS water and light. This takes a bit of study on the gardener’s part. The fads that state: No fertilizer, no digging…are simply put, asinine. Immature and completely uneducated. Ugh. The fact that you asked this question shows that you have some plant sense in you! Cheap means efficient and effective gardening. One never cuts corners because of expense in the garden. Making mistakes in the garden can be very expensive but it isn’t because one can choose to be cheap or expensive. One needs to know the RIGHT ways to garden, the rules or every penny that chases one’s efforts and expenditures is a WASTE. Keep asking questions!! ",
            "date": "Answered October 14, 2020",
            "views": "106",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Clarence Uhrich",
                    "user_href": "/profile/Clarence-Uhrich"
                },
                {
                    "user_id": "Timothy Cox",
                    "user_href": "/profile/Timothy-Cox-52"
                },
                {
                    "user_id": "Charles Krin",
                    "user_href": "/profile/Charles-Krin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Patricia Snyder",
                "href": "/profile/Patricia-Snyder-11"
            },
            "answer_text": "Alright, you asked for cheapest, not necessarily the most convenient, so here goes: Nitrogen - Grass eating animal manure, chicken manurePhosphorous - Human urine, shrimp and crab waste, bone mealPotassium - Wood ash, banana peelsOther Macronutrients - Epsom salts for magnesium/sulfur, egg shells for calciumThe absolutely best thing to do is make a compost pile which will give your plants everything they need. Start with grass clippings, raked leaves, vegetable peels and scraps from the kitchen. You can add some of the above animal ingredients, but then you should know that you will have other animals and pests nosing around your compost pile attracted by the aroma. Instead, get an opened or damaged pile of cheap, complete, 10–10–10 fertilizer to provide food to the organisms that will break down your compost pile into fertilizer. These organisms require large quantities of nitrogen for rapid and thorough decomposition. This nitrogen and the other major macronutrients required by plants are released when the decomposition is completed and the compost is returned to the garden. Wet down the pile with a water hose and turn it with a pitch fork every so often to add air. Properly managed compost should have air and water to keep the beneficial microbes and fungi happily breaking things down. You will see steam rising from the pile as the decomposition process “heats up”. This means things are going well and that the pile will be free of weed seeds, pathogenic diseases, and parasites. Soon you will have created a wonderful, free soil supplement that will be beneficial to your garden. ",
            "date": "Answered October 22, 2020",
            "views": "55",
            "upvotes": " Answer requested by Myo Han"
        }
    ]
}