{
    "title": "What's the difference between actual mass and theoretical mass? - Quora",
    "tags": [
        "Theoretical Mass",
        "Mass (physics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Raymond George Davies",
                "href": "/profile/Raymond-George-Davies"
            },
            "answer_text": "In general use, the word ‘mass’ means the amount of matter or substance in a ‘Body of Mass’. When the measurement of the value of the weight of the mass was found by finding the force exerted on a balance caused by the Earth’s gravity, this was good enough for the word to be established in the language. But this raises two problems. Firstly, the mass varies with the Planet, but more importantly, the force was related to the mass by Newton’s definition of mass times acceleration,which gives the gives the mass attributes and dimensions that are more complex than is needed to indicate the amount of matter in the body. All that was needed was for mass to be the dimensionless number of quanta of mass units in the body, so that energy, momentum and other values can be calculated as the value for each unit of mass. The product of the masses of two bodies is the number of lines of force between them. Now we have kinetic energy as a function of one mass and Potential energy for two bodies of mass, Admtttedly, the constant g has a mass in its denominator that reduces the mass to one body, but that’s cheating. You need the mass there to make the time period which is next to the mass in the constant to satisfy Kepler’s findings. Then, to make maters worse, Einstein throws a wrench into the works by making mass a function of velocity. Now you know the answer to the question. ",
            "date": "Answered October 9, 2017",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sean Willits",
                "href": "/profile/Sean-Willits-1"
            },
            "answer_text": "In the language of analytical chemistry, actual or better accurate mass is something you can measure. This is the actual number you get i.e. from a mass spectrometer. The theoretical or exact mass is calculated based on what we know about the makeup of e.g. chemical elements, chemical bonds, molecules and ionisation. There is often some confusion or at least unclear language where accurate and exact mass are concerned. Depending on who you ask or what book you read you will find the above definition of exact mass being a theoretically calculated value and accurate mass being am experimental value with a very high accuracy i.e. close to the theroetical value. ",
            "date": "Answered July 25, 2017",
            "views": "29",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Danielle T.A Johns",
                    "user_href": "/profile/Danielle-T-A-Johns"
                },
                {
                    "user_id": "Jeffrey Brender",
                    "user_href": "/profile/Jeffrey-Brender"
                },
                {
                    "user_id": "Arjun Narayanan",
                    "user_href": "/profile/Arjun-Narayanan-13"
                },
                {
                    "user_id": "Md Nur Ali",
                    "user_href": "/profile/Md-Nur-Ali-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ali Abdulla",
                "href": "/profile/Ali-Abdulla-15"
            },
            "answer_text": "Actual mass is the measured mass ,while the theoretical mass is the one theoretically estimated,theoretically mass can be estimated between 450 -500 MeV for example,but the measured value found to be 470 MeV. ",
            "date": "Answered July 25, 2017",
            "views": "941",
            "upvotes": "0"
        }
    ]
}