{
    "title": "What is the direction of magnetic field? - Quora",
    "tags": [
        "Magnets",
        "Magnetism",
        "Magnetic Fields",
        "Electromagnetism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sam Gallagher",
                "href": "/profile/Sam-Gallagher-6"
            },
            "answer_text": "Great question! This is something rarely covered explicitly, but I have always found to be essential to intuitively understanding the electromagneric field. The magnetic field lines point in the direction where a magnetic force can never be. They are vectors, but not force vectors. The magnetic force depends on the direction of electric charge movement, for example picturing a map if you go north the force pushes east, if you go east the force pushes south, and so on. But for a given position in space there will be a direction the magnetic force can never point in. For the map example, maybe it can go north, south, east, west, and everything in between, but never up or down. So because the direction of the force changes depending on the movement of a charge for the force to act on, the magnetic field vector points perpendicular to this “plane” of possible force directions. Its the only unique direction. So theres more to the story of course. The magnetic force can only be in certain directions, but why? Because of the nature of the magnetic force. The magnetic force is the force between charges moving relative to one another. In fact, it is the electric force, but it behaves differently due to relativity. So the plane of force directions will always contain the electric force direction at that point, because you can always just have the electric force and no relative magnetic force. Note that due to the nature of the magnetic force, wherever the magnetic force exists there will be an electric force as well. This is left out in many problems for simplicity. So to answer your question, the magnetic field lines don’t point in a direction of force like the electric or gravitational field lines. They point perpendicular to the plane of possible force directions. Note that only one vector is needed to define a plane mathematically like this. PS: A convenient artifact is that magnetic dipoles (bar magnets at any scale) will align with the magnetic field lines, so e.g. a compass can point in the direction of the magnetic field line at a point. This is particularly interesting considering the magnetic field line does not point in the direction of the magnetic force. It is due to the dipole’s own magnetic force. Also note that the typical bar magnet will either force charges around its axis, or towards/away from it radially, but never from north to south. ",
            "date": "Answered October 17, 2017",
            "views": "93",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Subhranil Ghoshal",
                    "user_href": "/profile/Subhranil-Ghoshal-1"
                },
                {
                    "user_id": "Ahmet Atcı",
                    "user_href": "/profile/Ahmet-Atcı"
                },
                {
                    "user_id": "Rachel Greene",
                    "user_href": "/profile/Rachel-Greene-85"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Vanessa-847"
                },
                {
                    "user_id": "Maverish",
                    "user_href": "/profile/Maverish"
                },
                {
                    "user_id": "Amartya Kaushik",
                    "user_href": "/profile/Amartya-Kaushik-2"
                },
                {
                    "user_id": "S Harrish",
                    "user_href": "/profile/S-Harrish"
                },
                {
                    "user_id": "Romio Juliet",
                    "user_href": "/profile/Romio-Juliet-2"
                },
                {
                    "user_id": "Lewis Campbell",
                    "user_href": "/profile/Lewis-Campbell-21"
                },
                {
                    "user_id": "Derrick Scott Sugden",
                    "user_href": "/profile/Derrick-Scott-Sugden"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Keevil",
                "href": "/profile/John-Keevil-2"
            },
            "answer_text": "The question asks for the magnetic field direction not the magnetic force direction. And a correct answer can be given that is more general than for a magnet. Any magnetic field is directed around a circle that is perpendicular to and centered on the direction of the electric current that produces the field. If the current is linear the magnetic field is directed around a circle in a clockwise direction. In a current loop you add the circular fields of all the current elements comprising the loop with the result of max field through the center of the loop. In a solenoid the vast majority of the field is inside the solenoid directed parallel to the axis of the solenoid. A bar magnet is similar to a solenoid because (simplistic explanation) all the electron spins of the magnetic material align so that they appear to spin in circles, like the coils of the afore-mentioned solenoid. ",
            "date": "Updated September 30, 2019",
            "views": "938",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sunil Kumar",
                    "user_href": "/profile/Sunil-Kumar-35216"
                },
                {
                    "user_id": "Advait Yadav",
                    "user_href": "/profile/Advait-Yadav-2"
                },
                {
                    "user_id": "Falade Sesan",
                    "user_href": "/profile/Falade-Sesan-1"
                }
            ]
        }
    ]
}