{
    "title": "What are the most habitable looking exoplanets we’ve discovered? - Quora",
    "tags": [
        "Exoplanets",
        "Discoveries",
        "Planetary Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anikeit Jibalwad",
                "href": "/profile/Anikeit-Jibalwad"
            },
            "answer_text": "Yesterday, NASA and Belgian-led research team came with this amazing news that they have spotted seven earth-size planets around a star, some 40 light years far from earth, some or all of which could harbour water and possibly life.  They circle around the dimly lit star TREPPIST-1, with orbits ranging from one and a half to 20 days. If Trappist-1 were our sun, all these planets would fit inside the orbit of Mercury. That's how close they are to their star and why their orbits are so short. The planets have no real names. They're only known by letters, \"b\" through \"h.\" The letter \"A\" refers to the star itself.  Can this newly discovered solar system support life? -Six of TRAPPIST-1's \"exoplanets\" lie in a temperate zone where surface temperatures range from zero to 100C. -Of these, at least three are thought to be capable of having watery oceans, greatly increasing the likelihood of life. -No other star system known contains such a large number of Earth-sized and probably rocky planets. -All are about the same size as Earth or Venus, or slightly smaller. Because the parent star is so dim, the planets are warmed gently despite having orbits much smaller than that of Mercury, the planet closest to the sun. -Scientists said they need to study the atmospheres before determining whether these rocky, terrestrial planets could support some sort of life. -From the viewpoint of someone standing on the surface of one of the planets, some of the other worlds would appear larger than the moon in the Earth's sky. -Gazing up, it would be possible to see the geological features, oceans and clouds of your planetary neighbours. -The ultracool star at the heart of this system would shine 200 times dimmer than our sun, a perpetual twilight as we know it. And the star would glow red - maybe salmon-colored, the researchers speculate.  Though thousands of exoplanets have been known since 1992, this one certainly gives a lot of hopes about existence of our unseen neighbours. We see plants make their own food with sun and water. So no wonder if some day in future any bluish or greenish guy around us said “DHOOP!” Source: NASA Telescope Reveals Record-Breaking Exoplanet Discovery Exoplanet discovery: What does Nasa's announcement mean - and should we be excited about TRAPPIST-1? ",
            "date": "Answered February 23, 2017",
            "views": "519",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anmol Patel",
                    "user_href": "/profile/Anmol-Patel-6"
                },
                {
                    "user_id": "Ishank Bhardwaj",
                    "user_href": "/profile/Ishank-Bhardwaj"
                },
                {
                    "user_id": "Mohit Kumar Jha",
                    "user_href": "/profile/Mohit-Kumar-Jha-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martin Silvertant",
                "href": "/profile/Martin-Silvertant"
            },
            "answer_text": "With the help of User-11947834129243635495’ post What is the most habitable planet as of 2017?, I have updated and compiled a list of more than 50 of the most habitable exoplanets, and made a mapping of their locations (two-dimensional projection), and infographics of the distances, host stars, and equilibrium temperatures of the planets. The most likely to be habitable exoplanet found so far according to a recent paper is Kepler-186 f[1], though it has an equilibrium temperature of only 188 K (Earth is 255 K[2], and Mars is 210 K[3]). As such, Kepler-1229 b (216 K), Kepler-442 b (233 K), or Kepler-62 f (244 K) may be more likely habitable exoplanet candidates. NB: If you want to see a larger version of the image below (and you do!), please have a look at this post instead: Potentially habitable exoplanets  Image: copyright © 2017 Martin Silvertant. All rights reserved.  Kepler-186 f — 188 KKepler-1229 b — 213 KKepler-442 b — 233 KKepler-62 f — 244 KKepler-62 e — 270 KKepler-22 b — 262 KKepler-452 b — 265 KKOI-4427 b — 179 KKepler-283 c — 238 KKepler-1544 b — 248 KProxima Centauri b — 234 KGliese 667 C c — 277 KWolf 1061 c — 223 KKapteyn b — 205 KGJ 273 b — 273 KTRAPPIST-1 e — 230 KTRAPPIST-1 f — 200 KKepler-438 b — 276 KKepler-296 e — 337 KGliese 832 c — 253 KK2-3 d — 300 KTau Ceti e — 282 KGliese 180 c — 239 KKepler-440 b — 273 KGliese 180 b — 268 KHD 40307 g — 227 KGliese 163 c — 302 KK2-18 b — 272 KKepler-61 b — 273 KKepler-443 b — 247 KGliese 422 b — 231 KGliese 3293 c — 223 KKepler-298 d — 271 KKepler-174 d — 206 KKepler-296 f — 198 KKepler-1638 b — 276 KKepler-1090 b — 267 KLHS 1140 b — 230 KGliese 625 b — 288 KTRAPPIST-1 d — 263 KGJ 3323 b — 264 KK2-72 e — 280 KKepler-1410 b — 274 KKepler-705 b — 243 KKepler-1606 b — 277 KKepler-1552 b — 261 KGJ 3293 d — 220 KGJ 682 c — 198 KWolf 1061 d — 182 KTRAPPIST-1 g — 182 KK2-9 b — 314 KKepler-445 d — 305 KKIC-5522786 b — 305 KTRAPPIST-1 c — 341.9 KHD20794 e — 350 KFootnotes[1] https://arxiv.org/pdf/1707.07986.pdf[2] ATM S 211 - Notes[3] Mars Fact Sheet",
            "date": "Answered August 24, 2017",
            "views": "846",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lukas Groß",
                    "user_href": "/profile/Lukas-Groß"
                },
                {
                    "user_id": "Manasv Chhabra",
                    "user_href": "/profile/Manasv-Chhabra"
                },
                {
                    "user_id": "Horatio Oswald",
                    "user_href": "/profile/Horatio-Oswald"
                },
                {
                    "user_id": "Frank Nyx",
                    "user_href": "/profile/Frank-Nyx"
                },
                {
                    "user_id": "Shaikh Tahmidur",
                    "user_href": "/profile/Shaikh-Tahmidur"
                },
                {
                    "user_id": "Dimosthenis E. Gkotsis",
                    "user_href": "/profile/Dimosthenis-E-Gkotsis"
                },
                {
                    "user_id": "Gail Ellis",
                    "user_href": "/profile/Gail-Ellis-2"
                },
                {
                    "user_id": "Tapan Gupta",
                    "user_href": "/profile/Tapan-Gupta-22"
                },
                {
                    "user_id": "Shreeram Murali",
                    "user_href": "/profile/Shreeram-Murali"
                },
                {
                    "user_id": "Mark Benjamin",
                    "user_href": "/profile/Mark-Benjamin-74"
                }
            ]
        }
    ]
}