{
    "title": "What are the characteristics of elements in the periodic table? - Quora",
    "tags": [
        "Periodic Table",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Roy Galazka",
                "href": "/profile/Roy-Galazka"
            },
            "answer_text": "Before I answer this question, I would like to state that this question is very vague in nature. Therefore, I will answer it in the best way possible. The main characteristic of an element is that it is a pure substance. This means that it cannot be broken down any further and into any other substance. This goes for every element on the Periodic Table so far. However, there are more characteristics that characterize these elements. One of them is whether the element is a solid, liquid, or gas. This goes for all elements, and is pretty self-explanatory. Another is what crowd it belongs to. These crowds include metals, metalloids (metal/nonmetal hybrids), and nonmetals. Metals are elements that easily conduct heat and electricity, are lustrous and are malleable. Examples include Sodium (Na), Magnesium (Mg), and Gold (Au). Nonmetals are the opposite of metals, for they are not very durable nor do they conduct electricity and heat very well. These tend to be gases. Examples include Hydrogen (H), Helium (He), and Argon (Ar). Metalloids are a hybrid of metals and nonmetals. They can partly conduct electricity and heat, and depending on the element, are malleable. Examples include Boron (B), Silicon (Si), and Arsenic (As). Another classification of elements are groups. These are another word for the columns on the Periodic Table. Each group dictates a characteristic of the element. Group 1 contains the Alkaline Metals, which possess an additional electron. Group 2 consists of the Alkali Metals, which fill up part of an atom diagram, but not all of it. Group 17 consists of highly reactive materials, mamely Chlorine, which are looking to rid itself of the additional electron it possesses. These can react with Period 1 metals and make them harmless and vice versa. A compound known to do this is Sodium Chloride (NaCl), most well-known as table salt. Group 18 consists of the noble gases, or gases that fill the diagram of an atom. The Periodic Table also consists of periods or rows, which list the elements in order by atomic number, but nothing else. I hope that helps! ",
            "date": "Answered July 18, 2018",
            "views": "8",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alyssa Panlaan",
                    "user_href": "/profile/Alyssa-Panlaan"
                },
                {
                    "user_id": "Daniel James Berger",
                    "user_href": "/profile/Daniel-James-Berger"
                },
                {
                    "user_id": "Adlina Orielle",
                    "user_href": "/profile/Adlina-Orielle"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Hoffman",
                "href": "/profile/William-Hoffman-60"
            },
            "answer_text": "Start like this. The names are historic, but the scheme is simple. Element 1 has 1 proton. There is an electron for balance, Charge is 0 Element 26 has 26 protons. There are 26 electron for balance. Charge=0. Element 115 has 115 protons and 115 electrons. Charge=0 All the protons stick together because a thing called binding energy was released, so they don’t reject each other, but still are matched by the electrons. Most of the atoms have neutrons packed in them, in the “nucleus”, but for most chemistry they only make the atoms heavier. We could, if we wanted, rename all the elements as uno, duo, tres, quatro, cinquo, etc. without losing any knowledge. The latest synthetics are indeed named thus, until some committee gives them a famous scientist’s name. Most chemistry is a result of changes in the electrons. ",
            "date": "Answered July 29, 2019",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Arno Vigen",
                "href": "/profile/Arno-Vigen"
            },
            "answer_text": "Electrostatic force based upon the number of protons and neutronsValence which is the tendency based upon the shells/subshells to add or lose an electron as cations/ion in solutions - and for those electron to act as the bonding electron in solid.Subshell configuration of electronsElectrical conductivity which maximizes in the middle as Column 9 (1x), column 10 (2x) and Column 11 (3x) which is copper, gold, aluminum, etc.Melting pointBoiling pointMagnetic strength - whichElectrical spectrumSpectrum # lines which caps a Column 8Bonding energy - related to Row, Column, subshell configurationsBonding angles - related to subshell configuration",
            "date": "Answered July 17, 2018",
            "views": "23",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "SOHAM DAS Stad",
                    "user_href": "/profile/SOHAM-DAS-Stad"
                },
                {
                    "user_id": "Tyson Maghave",
                    "user_href": "/profile/Tyson-Maghave-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stuart Herring",
                "href": "/profile/Stuart-Herring-2"
            },
            "answer_text": " What are the characteristics of elements in the periodic table? Properly, this question would have 118 answers; it’s much too broad.However, you may be thinking of the biggest categories: metals, metalloids, and nonmetals. Further, within the metals, there are: alkali metals, alkaline-earth metals, transition metals, and poor metals. Within the nonmetals, there are: pnictogens, chalcogens, halogens, and noble gases. Each category has elements with similar characteristics (such as reflectivity and conductivity in metals, or nonreactivity in the noble gases).All of these categories are discussed in separate Wikipedia articles; happy reading to you! ",
            "date": "Updated August 29, 2018",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ashutosh Mohapatra",
                    "user_href": "/profile/Ashutosh-Mohapatra-55"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tyson Maghave",
                "href": "/profile/Tyson-Maghave-1"
            },
            "answer_text": "  ",
            "date": "Answered May 30, 2019",
            "views": "631",
            "upvotes": "0"
        }
    ]
}