{
    "title": "What is the evolution account for the similarities and differences among living organisms? - Quora",
    "tags": [
        "Living Organisms",
        "Organisms",
        "Similarities and Differences",
        "Evolution (process)",
        "Human Evolution",
        "Evolutionary Biology",
        "Science of Everyday Life",
        "Genetics and Heredity",
        "Biology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Derek Mathias",
                "href": "/profile/Derek-Mathias-3"
            },
            "answer_text": "If all life is genetically related, as must be true if evolutionary theory is true, then species that are closer to humans on the evolutionary tree based on physical characteristics should also share a higher percentage of DNA compared with species that are less similar. Sure enough, we now know that humans share approximately 99.5% of genes with other humans, 98% of genes with chimpanzees, 93% with monkeys, 92% with mice, 90% with cats, 84% with dogs, 80% with cows, 60% with chickens, 44% with fruit flies, 26% with yeast, 18% with plants, and 7% with bacteria. The logical reason for why we share so many genes with other life is because all life is related, and species bring along much of their genetic material when they evolve into new species. The longer species have to evolve from their ancestral species, the more differences build up in their genomes. And the reason there are differences between living organisms is because if the genetics remained the same…there would be no difference between species and all life would be one single species! ",
            "date": "Answered March 29, 2020",
            "views": "89",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pulkit Mathur",
                    "user_href": "/profile/Pulkit-Mathur-28"
                },
                {
                    "user_id": "Helgi Briem",
                    "user_href": "/profile/Helgi-Briem"
                },
                {
                    "user_id": "Paul Johnson",
                    "user_href": "/profile/Paul-Johnson-847"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ed Weir",
                "href": "/profile/Ed-Weir-1"
            },
            "answer_text": "The evolution account is just an ever changing group think story line which is based a few agreed upon vague ideas. There are no proven and repeatable and strickly defined mechanisms to accomplish what evolution boasts. If you stay with previous vagueness from the historical evolutionary heros you can pretty much say whatever you want about similarities and differences. It will be said whatever, you make up, that it is a fact and proven science. 🤗☝️😁❤️ ",
            "date": "Answered March 28, 2020",
            "views": "30",
            "upvotes": " Answer requested by Apostol Bæ"
        }
    ]
}