{
    "title": "What are examples of living things? - Quora",
    "tags": [
        "Living Things",
        "Biology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vaclav Krpec",
                "href": "/profile/Vaclav-Krpec"
            },
            "answer_text": "Well, I’m no biologist, but the question (in broader terms) is not that easy to answer. I mean I’d like to delve into it a bit deeper than answering “a potato” etc like others have done (no offence meant ;-). The problem is that in evolution, there are no strict boundaries; not as such. As life evolved from “non-living” or “inorganic” molecules AFAIK, the binary classification of living/non-living is faulty in principle. It’s actually the same question as when exactly was the 1st bird hatched from an egg of a lizard? The answer is: there was no such event. Lizards produced lizards. Those lizards were very slightly different each generation, but each child was pretty much the same as their parents. It was only after quite some time when they become so different to their grand ancestors that we stop calling them lizards and start to call them birds. Because they could fly, had feather and so on. But there was never a clear barrier which would mark the “beginning of birds”. What came first, a chicken or an egg? Neither came first. The distinction of life itself contains the same problem. Way back, there were just simple inorganic molecules. Again, I’m no biologist, but AFAIK due certain natural processes (under the sea, probably close to volcanic activity, hot water containing sulphur and whatnot), more complex molecules emerged, which we call organic. These had combined into yet more complex molecules, eventually producing lipids, amino acids, proteins, RNA, DNA etc. Is that already life? Maybe not. But more complex organic structures emerged. Perhaps protocells or viruses. Is a virus alive? That’s already much closer to our “definition”, although perhaps not fitting completely… We humans tend to enforce categories on everything we observe. With evolution, that’s problematic, for the reasons above. We want clear borders and boundaries, but the nature doesn’t oblige. So that’s why the question is fundamentally difficult to answer; our model simply doesn’t fit the reality (in finer distinctions). ",
            "date": "Answered January 18, 2018",
            "views": "129",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Islam Abdallah",
                    "user_href": "/profile/Islam-Abdallah-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alan West",
                "href": "/profile/Alan-West-6"
            },
            "answer_text": "Animals and plants. Donald Trump is said to be alive, and that this is proven by his mentioning of the size of his penis in public. Dead people, rocks, and pools of water never talk about their genitals, though robots could be programmed to do so, but why? Perhaps someone can make a TV show where fat extroverts with tattoos make, set or sell robots that talk voluminously about the quality and size of their genitals. Are viruses alive? They self-replicate, but I am never sure and my knowledge of biology is sadly lacking. Are you a living thing? Who knows.... ",
            "date": "Answered January 23, 2018",
            "views": "5",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Islam Abdallah",
                    "user_href": "/profile/Islam-Abdallah-8"
                }
            ]
        }
    ]
}