{
    "title": "What is contamination? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Uldis Sprogis",
                "href": "/profile/Uldis-Sprogis"
            },
            "answer_text": "Contaminate: v. to add a poisonous and/or polluting subset(s) You can contaminate something with a serious poison(s) or toxic chemical(s), artificial drug(s), and overly large amounts of relatively harmless chemicals like soap. Rather harmless pollution like dirt, suspended matter like emulsified oil, and good bacteria with minimal amounts of bad bacteria merely ruins the purity and taste of water. Biodegradable chemicals temporarily pollute the soil but these really have minimal long duration harmful effects. Air can also be contaminated but AC filters which exclude pollen and dust from the air is a costly sales gimmick which is unnecessary and even unhealthy for most of the general population excluding of course those allergic to certain pollen and/or dust who do benefit by costly filtration techniques. Germicidal soaps and cleansers are also a costly unhealthy ripoff because what you end up killing is mostly good bacteria in the environment with minimal amounts of bad bacteria which are realistically no danger to your health. The environment mostly consists of good bacteria which keep the bad bacteria from multiplying in great quantities known as the balance of nature which is good for you in the long duration and not bad. Don't buy anything with anti germicidal ingredients. They do more harm than good to your health in the long duration. A sterile hospital environment is not a healthy environment to be living in at home. Be part of nature, don't fight against it at every turn!!!!!! Your immune system needs to be surrounded by good bacteria!!!!!! Most germs are good for you and very few of them are bad for your health in the long duration. ",
            "date": "Answered February 20, 2017",
            "views": "238",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dudla Jyothi",
                "href": "/profile/Dudla-Jyothi"
            },
            "answer_text": "Something that makes a place or a substance (such as water, air, or food) no longer suitable for use: something that contaminates a place or substance. The acts of contaminating, or of making something impure or unsuitable by contact with something unclean, bad, etc. the act of contaminating, or of rendering something harmful or unusable by the addition of radioactive material: the contamination of food following a nuclear attack. Some common synonyms of contamination are defile, pollute, and taint. The definition of contamination is something that contaminates (causes an impurity) or is something that has been made impure or spoiled. Toxic waste that spoils the water supply is an example of contamination. The Safe Drinking Water Act (SDWA) defines \"contaminant\" as any physical, chemical, biological or radiological substance or matter in water. ... Some contaminants may be harmful if consumed at certain levels in drinking water. The most common types of contaminant include: Physical contamination. Examples: fiber material, particles, chips from your pill press tooling.Chemical contamination. Examples: vapor, gasses, moisture, molecules.Biological contamination. Examples: fungus, bacteria, viruses.Four Types of Food Contamination -Biological, Chemical, Physical, Cross. Examples of chemical contaminants include nitrogen, bleach, salts, pesticides, metals, toxins produced by bacteria, and human or animal drugs. ... They are also referred to as microbes or microbiological contaminants. Examples of biological or microbial contaminants include bacteria, viruses, protozoans, and parasites. Contamination is the presence of a constituent, impurity, or some other undesirable element that spoils, corrupts, infects, makes unfit, or makes inferior a material, physical body, natural environment, workplace, etc. Within the sciences, the word \"contamination\" can take on a variety of subtle differences in meaning, whether the contaminant is a solid or a liquid, as well as the variance of environment the contaminant, is found to be in. A contaminant may even be more abstract, as in the case of an unwanted energy source that may interfere with a process. The following represent examples of different types of contamination based on these and other variances.  Contamination on an agar plate Chemical contamination In chemistry, the term \"contamination\" usually describes a single constituent, but in specialized fields, the term can also mean chemical mixtures, even up to the level of cellular materials. All chemicals contain some level of impurity. Contamination may be recognized or not and may become an issue if the impure chemical is mixed with other chemicals or mixtures and causes additional chemical reactions. The resulting chemical reactions from the presence of an impurity may at times be beneficial, in which case the label \"contaminant\" may be replaced with \"reactant\" or \"catalyst.\" (This may be true even in physical chemistry, where, for example, the introduction of an impurity in an intrinsic semiconductor positively increases conductivity. If the additional reactions are detrimental, other terms are often applied such as \"toxin,\" \"poison,\" or pollutant, depending on the type of molecule involved. Chemical decontamination of substance can be achieved through decomposition, neutralization, and physical processes, though a clear understanding of the underlying chemistry is required. Environmental contamination In environmental chemistry, the term \"contamination\" is in some cases virtually equivalent to pollution, where the main interest is the harm done on a large scale to humans, organisms, or environments. An environmental contaminant may be chemical in nature, though it may also be a biological (pathogenic bacteria, virus, invasive species) or physical (energy) agent. Environmental monitoring is one mechanism available to scientists to catch contamination activities early before they become too detrimental. Agricultural contamination Another type of environmental contaminant can be found in the form of genetically modified organisms (GMOs), specifically when they come in contact with organic agriculture. This sort of contamination can result in the decertification of a farm. This sort of contamination can at times be difficult to control, necessitating mechanisms for compensating farmers where there has been contamination by GMOs. Food, beverage, and pharmaceutical contamination In food chemistry and medicinal chemistry, the term \"contamination\" is used to describe harmful intrusions, such as the presence of toxins or pathogens in food or pharmaceutical drugs. Radioactive contamination In environments where nuclear safety and radiation protection are required, radioactive contamination is a concern. Radioactive substances can appear on surfaces, or within solids, liquids, or gases (including the human body), where their presence is unintended or undesirable, and processes can give rise to their presence in such places. Several examples of radioactive contamination include: residual radioactive material remaining at a site after the completion of decommissioning of a site where there was a nuclear reactor, such as a power plant, experimental reactor, isotope reactor, or a nuclear-powered ship or submarine.ingested or absorbed radioactive material that contaminates a biological entity, whether unintentionally or intentionally (such as with radiopharmaceuticals)Note that the term \"radioactive contamination\" may have a connotation that is not intended. The term refers only to the presence of radioactivity and gives no indication itself of the magnitude of the hazard involved. However, radioactivity can be measured as a quantity in a given location or on a surface, or on a unit area of a surface, such as a square meter or centimeter.Like environmental monitoring, radiation monitoring can be employed to catch contamination activities early before they become too detrimental. Interplanetary contamination Interplanetary contamination occurs when a planetary body is biologically contaminated by a space probe or spacecraft, either deliberately or unintentionally. This can work both on arrival to the foreign planetary body and upon return to Earth. Contaminated evidence In forensic science, evidence can become contaminated. Contamination of fingerprints, hair, skin, or DNA—from first responders or from sources not related to the ongoing investigation, such as family members or friends of the victim who are not suspects—can lead to wrongful convictions, mistrials, or the dismissal of evidence. Contaminated samples In the biological sciences, the accidental introduction of \"foreign\" material can seriously distort the results of experiments where small samples are used. In cases where the contaminant is a living microorganism, it can often multiply and take over the experiment, especially cultures, and render them useless. A similar effect can be seen in geology, geochemistry, and archaeology, where even a few grains of material can distort the results of sophisticated experiments. ",
            "date": "Answered June 18, 2020",
            "views": "90",
            "upvotes": " Answer requested by Chandra Pradhan"
        }
    ]
}