{
    "title": "What constitutes 'observation' in quantum mechanics? - Quora",
    "tags": [
        "Observations (quantum mechanics)",
        "Quantum Mechanics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Flint",
                "href": "/profile/Alex-Flint"
            },
            "answer_text": "This is a good question, which I don't believe the current questions have adequately answered. The interesting part of the question, which I believe the OP was getting at, is: If \"collapse-of-the-wave-function\" is something that actually happens out there in the real world, then what exactly are the characteristics of an \"observation event\", and how can we possibly get to a mathematically precise notion of \"observation\"? The short answer is that Everett's many-worlds model is the only coherent explanation for what is happening here. The answers so far suggest why this is: Joshua suggested that interactions with \"large enough\" bodies somehow obey different rules. Now to make this explanation work, you really have to posit fundamentally different laws of physics that kick in above some mass threshold. It's not enough to say that large bodies obey the same microscopic rules of physics but produce statistically different macroscopic effects: To follow this through one would actually need different physics for small and large bodies. Not going to work. Jay's explanation is better: You can see the observer being split into two blobs of amplitude in his equations. The problem is that at the end of this line of reasoning we get a hand-waving claim that this leads to classical-like behavior. But this leaves the original question open: where *exactly* does the collapse occur? At what point is one of  or  finally \"selected\", and where is the mathematically precise model for how this happens? Everett's model simply says that  and  are never \"selected\" or \"collapsed\", but rather that the universe continues right on behaving according to the simple, concise, and elegant laws of quantum mechanics. No exceptions. No hand-waving. This is appealing because it means that the whole universe can be modeled in terms of a state vector (a set of numbers, more or less) and a single rule that specifies how the state at time T leads to the state at time T+1 (of which the Schrodinger equation is one formulation). There is no randomness, no special place for \"consciousness\", no hand-waving \"observation\" or \"collapse of the wave function\". Nothing but a simple and exception-less mathematical model that just happens to explain every physical phenomena physicists have ever observed. Doesn't sound too controversial right? The reason for the controversy is that if we follow Everett's reasoning through without blinking or balking at what we find then we discover a universe that is continuously branching, of which we experience just one branch. This all follows directly from the simple and concise mathematical model, but for some it seems too radical, so one retreats to the hand-waving of the Copenhagen interpretation's single universe. But this is just bad epistemology. In physics, the idea is to take some experimental data, look for a simple explanation, and then try to falsify that explanation with further experiments. If the consequences of the model seem crazy at first then by all means do more experiments, but the over the last 70 years experimentalists have just been confirming quantum mechanics over and over. With that much support for a theory, the proper response is to believe the consequences of the theory, not to add a fudge factor that aligns the model with your intuition! So biology says that there is no physically fundamental life force. Chemistry says that the whole world is built from a small number of identical building blocks. These seemed like outrageous conclusions when first proposed, but eventually the evidence outweighed intuition. So too with Everett's many worlds. An excellent and accessible explanation is given here: http://lesswrong.com/lw/r5/the_quantum_physics_sequence/ and in Gary Drescher's recent book \"Good and Real\". ",
            "date": "Updated September 7, 2015",
            "views": "33",
            "upvotes": " View 31 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dhruv Pandya",
                    "user_href": "/profile/Dhruv-Pandya-27"
                },
                {
                    "user_id": "Jim Mims",
                    "user_href": "/profile/Jim-Mims"
                },
                {
                    "user_id": "Tom Jennett",
                    "user_href": "/profile/Tom-Jennett"
                },
                {
                    "user_id": "Tom Lowe",
                    "user_href": "/profile/Tom-Lowe-34"
                },
                {
                    "user_id": "Abhinav Tripathi",
                    "user_href": "/profile/Abhinav-Tripathi-20"
                },
                {
                    "user_id": "Siddharth Acharya",
                    "user_href": "/profile/Siddharth-Acharya-8"
                },
                {
                    "user_id": "Mo Nastri",
                    "user_href": "/profile/Mo-Nastri"
                },
                {
                    "user_id": "James Comey",
                    "user_href": "/profile/James-Comey-7"
                },
                {
                    "user_id": "Gordon Hogenson",
                    "user_href": "/profile/Gordon-Hogenson"
                },
                {
                    "user_id": "Leto Lab",
                    "user_href": "/profile/Leto-Lab"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gerard Bassols",
                "href": "/profile/Gerard-Bassols-1"
            },
            "answer_text": "Anything that produces an irreversible change in our universe's course of history. In terms of the double slit experiment, when an electron is not 'observed' it is a wave, and thus it can pass through 2 slits simultaneously. This means that both possibilities coexist in our universe as a superposition, because the universe in which nobody will ever know which slit it went through is just one universe, not two. The universe did not have to make a choice. Nothing has changed in a universe where the information is and will never be known, it is one and only one universe reality. You might think that there could still be 2 different universes, one in which it passed through slit A but nobody will ever know, and another where it passed through slit B but also nobody will ever know. But this is how the quantum works, in practice those 2 universes would be identical, nothing would be irreversibly changed in them making them ever distinguishable from each other, their futures are identical until the end of times, so nature is economical and merges those 2 options as one single universe reality which is a superposition of both. On the other hand if the electron passes through slit A or through slit B leaving any irreversible change in the fabric of the universe, even if that change is not observed now but it will only become apparent within billions of years and in a very distant place, these are necessarily 2 different realities.If there is any way in which it will ever be possible to know that once an experiment was conducted on Earth in which the electron passed through slit A and not through B, then the universe needs to make a choice and become that reality and discard the option where it will be possible to know that it passed through slit B and not through A, because that would be a different universe, something irreversible was changed in the course of the experiment changing the future (some people think that when we put a detector the universe does actually split in 2 versions of itself, one in which the detector will detect slit A and the other where it will detect slit B). Anything we do which will allow, now or in the future, to know which slit the electron went through does necessarily force the universe to make the choice because they would be 2 different futures, they can not coexist. Anything that has the potential to alter the future is 'an observation'. When you think about it, it is actually logical, it could not be otherwise. What is actually nice is that as long as the futures are identical, all the possible options do actually coexist in superposition in the form of waves creating an interference among them, a kind of blurred reality consisting in a haze of all the possible realities, all the possible 'nows', which are consistent with that future. ",
            "date": "Answered May 18, 2015",
            "views": "868",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Be Conceptual",
                    "user_href": "/profile/Be-Conceptual"
                },
                {
                    "user_id": "Vivek Mangal",
                    "user_href": "/profile/Vivek-Mangal-29"
                },
                {
                    "user_id": "Alice Floyd",
                    "user_href": "/profile/Alice-Floyd-12"
                },
                {
                    "user_id": "Brent Meeker",
                    "user_href": "/profile/Brent-Meeker"
                },
                {
                    "user_id": "John Larcheveque",
                    "user_href": "/profile/John-Larcheveque"
                },
                {
                    "user_id": "Justin M",
                    "user_href": "/profile/Justin-M-24"
                }
            ]
        }
    ]
}