{
    "title": "What is organic matter in soil made of? - Quora",
    "tags": [
        "Organic Matter",
        "Soil Science (pedology)",
        "Soil"
    ],
    "response": [
        {
            "author_info": {
                "name": "Johnston Robert",
                "href": "/profile/Johnston-Robert"
            },
            "answer_text": "The organic matter in soil is known as humus. Unless the soil is largely organic in itself such as erogenous acidic soils like peat, it is in addition to the stones clay, sand, silt and minerals it contains. It is largely composed of broken down dead plant material, with some decayed animal faeces and urine and sometimes decomposed animal remains. The main agents of decomposition are bacteria and fungi and worms. The main benefits are to the crumb texture of the soil and in the addition of soluble salts and minerals mainly nitrates, but also phosphates and potassium with traces of others. However, unless calcium carbonate type stones are present horticultural soils increase in acidity and require a dressing of corrective lime. Worms play an important role in the initial processing of this material turning over the digested humus and bringing it to the surface. Charles Darwin actually made some useful observation regarding earthworms, although the experimentation he attempted was faulty due to poor controls. We can send rockets to the moon but not enough accurate scientific work has been done regarding what happens in the average compost heap. ",
            "date": "Answered November 19, 2016",
            "views": "601",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Scott Buckley",
                "href": "/profile/Scott-Buckley-16"
            },
            "answer_text": "A range of stuff, really. Essentially, organic matter is comprised of the decomposed or decomposing remains of anything and everything that lives in the soil - everything from dead microorganisms (bacteria, fungi etc.), micro- and macro-invertebrates (and their poop), plant roots & leaf litter. The forms in which you can actually find organic matter in are incredibly diverse. This can be anything from rather intact materials such as intact roots, or decomposed components of them such as lignin, cellulose, protein, amino acids etc. The diversity of compounds one can find in soil is huge, and we often find it hard to match particular components to their origins. ",
            "date": "Answered November 13, 2016",
            "views": "490",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brian Tremback",
                    "user_href": "/profile/Brian-Tremback-1"
                },
                {
                    "user_id": "Pavan V",
                    "user_href": "/profile/Pavan-V-49"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Huff",
                "href": "/profile/Michael-Huff-16"
            },
            "answer_text": "Decomposed plants and small microbes that break them down. as worms and other small critter borrow through the soil, they leave urine and feces, which adds nutrients to the soil. There is also bacteria and fungi present. A healthy soil contains all sorts of neat stuff. ",
            "date": "Answered November 7, 2016",
            "views": "107",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Emilie Quast",
                "href": "/profile/Emilie-Quast"
            },
            "answer_text": "If it could respire, it will be OM. Here’s a cool story about a family of micro gastropods in Minnesota: Tiny Travelers Click on the Tiny Travelers story. ",
            "date": "Answered November 16, 2016",
            "views": "39",
            "upvotes": "0"
        }
    ]
}