{
    "title": "What are the most abundant elements in the universe? - Quora",
    "tags": [
        "Astrophysics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Darshita Soni",
                "href": "/profile/Darshita-Soni"
            },
            "answer_text": "The abundance of a chemical element is a measure of the occurrence of the element relative to all other elements in a given environment. Abundance is measured in one of three ways: by the mass-fraction (the same as weight fraction); by the mole-fraction (fraction of atoms by numerical count, or sometimes fraction of molecules in gases); or by the volume-fraction. Volume-fraction is a common abundance measure in mixed gases such as planetary atmospheres, and is similar in value to molecular mole-fraction for gas mixtures at relatively low densities and pressures, and ideal gas mixtures. Most abundance values in this article are given as mass-fractions. For example, the abundance of oxygen in pure water can be measured in two ways: the mass fraction is about 89%, because that is the fraction of water's mass which is oxygen. However, the mole-fraction is 33.3333...% because only 1 atom of 3 in water, H ",
            "date": "Answered January 23, 2016",
            "views": "19",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nikhil Kumar",
                    "user_href": "/profile/Nikhil-Kumar-577"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eli Mendez",
                "href": "/profile/Eli-Mendez-1"
            },
            "answer_text": "Hydrogen is the most abundant element in the universe, helium a distant second, and oxygen a distant third. Other answers claim that dark matter is more abundant, but we currently don't know that dark matter definitely is matter. It appears to be some kind of “stuff” that isn't directly proportional to visible matter, and it has an effect on space that looks to be the same as that of mass. There is a reason it's categorised separately from regular matter. ",
            "date": "Answered September 3, 2018",
            "views": "529",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thomas Herbig",
                    "user_href": "/profile/Thomas-Herbig"
                },
                {
                    "user_id": "Frank Yu",
                    "user_href": "/profile/Frank-Yu-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Onyoo Ha (河溫柔/하온유)",
                "href": "/profile/Joseph-Onyoo-Ha-河溫柔-하온유"
            },
            "answer_text": "It's hydrogen. Protium requires little to create and is therefore the most abundant element in the universe. Heck, it's even lighter than a neutron! (In beta decay, a 'down' quark of a neutron emits an antineutrino and an electron to become an 'up' quark, transmuting the neutron into a proton.) Carbon just makes great polymers and that is required to make bodies of organisms. Who taught you that? ",
            "date": "Answered July 27, 2016",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Burke Tinsley",
                    "user_href": "/profile/Burke-Tinsley"
                },
                {
                    "user_id": "Kumaraswamy S Vasan",
                    "user_href": "/profile/Kumaraswamy-S-Vasan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ahalya",
                "href": "/profile/Ahalya-23"
            },
            "answer_text": "Universe -Hydrogen and HeliumEarth crust - Oxygen and SiliconEarth atmosphere- Nitrogen and OxygenMercury (planet)- Oxygen and SodiumVenus (atmosphere) - Carbon dioxide and NitrogenMars - Silicon and OxygenJupiter - Helium and HydrogenSaturn - Hydrogen and HeliumUranus - Hydrogen and HeliumNeptune - Hydrogen and HeliumMoon - Oxygen and SiliconSun - Hydrogen and Helium",
            "date": "Answered August 27, 2019",
            "views": "364",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sonam",
                    "user_href": "/profile/Sonam-430"
                },
                {
                    "user_id": "Pradeep Sagar",
                    "user_href": "/profile/Pradeep-Sagar-65"
                },
                {
                    "user_id": "Bapuji Behera",
                    "user_href": "/profile/Bapuji-Behera-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edwing Hivan",
                "href": "/profile/Edwing-Hivan"
            },
            "answer_text": "The most abundant element in the universe is Hydrogen, ...\"which makes up  about 75% of all matter\"... In second place,  Helium which...\"makes up most of the remaining 25%...\" and the third element is Oxygen.Reference:Element Distribution in the Earth's Crusthttp://ww2.wpunj.edu/cos/envsci-geo/distrib_resource.htm ",
            "date": "Answered April 25, 2011",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Malcolm Sargeant",
                    "user_href": "/profile/Malcolm-Sargeant"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dadarao Dhone",
                "href": "/profile/Dadarao-Dhone"
            },
            "answer_text": "The fundamental, basic, eternal original Dark Energy Particles having property of mass and gravity are filled in space through out the space of universe and the beyonds of the universe. Each particle have inside it electrical property as charge whose field is directed towars the inside center where opposite charge is concentrated in a point. The surface charge is negative and the concentrated charge at center is positive. When the particle move at velocity incrementaly greater than ‘c’ or tends to move at velocity greater than c, its charge appears , its negative charge appears in space prducing magnetic field to oppose the increase of motion beyond ,c,. When such two paticles collide against each other, gluon comes out it and the prticles gue with each other collectively forming Quarks. Scietist can detect these particles physically only when they can detect electrical-gravitational frequencies of the order of 10^60 Hz. It is derived from Planks Energy Relation, mass energy transformation energy relation and the Plank’s constants. ",
            "date": "Answered June 11, 2019",
            "views": "212",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Liu",
                "href": "/profile/Michael-Liu-3"
            },
            "answer_text": "To the observable universe, it must Hydrogen which makes up most of the stars. However dark matter plays a more significant role forming the mass of the universe. Since we don't know much about dark matter, the answer would be unknown. http://en.wikipedia.org/wiki/Dark_matter ",
            "date": "Answered July 4, 2011",
            "views": "19",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Matthew Jagielski",
                    "user_href": "/profile/Matthew-Jagielski"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel James Berger",
                "href": "/profile/Daniel-James-Berger"
            },
            "answer_text": "It isn’t. Carbon’s the fourth most abundant, behind hydrogen, helium and oxygen. Hydrogen and helium are far and away the most abundant elements; all the other elements put together add up to less than 3% certainly, perhaps less than 2%. ",
            "date": "Updated July 28, 2016",
            "views": "46",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Soso",
                    "user_href": "/profile/Michael-Soso"
                },
                {
                    "user_id": "Paolo Cuzzato",
                    "user_href": "/profile/Paolo-Cuzzato"
                },
                {
                    "user_id": "Callum Gray",
                    "user_href": "/profile/Callum-Gray-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "George Gonzalez",
                "href": "/profile/George-Gonzalez-5"
            },
            "answer_text": "It’s not, carbon is only about 0.5% of the Universe. Hydrogen is like 75%, Helium 23%, and all the rest are below 1%. Its interesting, the least abundant is Tantalum, at one part in 100 million, yet there are Tantalum mines here on earth. Helium is quite abundant as it’s the product of nuclear fusion, and we are looking at a relatively old Universe with a lot of ashes around. ",
            "date": "Answered July 27, 2016",
            "views": "582",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yan Kee",
                    "user_href": "/profile/Yan-Kee-5"
                },
                {
                    "user_id": "Loring Chien",
                    "user_href": "/profile/Loring-Chien"
                },
                {
                    "user_id": "Tom Hyer",
                    "user_href": "/profile/Tom-Hyer-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Erin Korzeniewski",
                "href": "/profile/Erin-Korzeniewski"
            },
            "answer_text": "Oxygen! It's in water (H2O) and the air we breathe in (O2) and the air we breathe out (CO2) and thousands of other things, including alcohol.This is by mass, though. I'm not sure if you calculate it by volume or atom. ",
            "date": "Answered April 29, 2014",
            "views": "571",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Janek Waza",
                    "user_href": "/profile/Janek-Waza"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emmanuel Hugh",
                "href": "/profile/Emmanuel-Hugh"
            },
            "answer_text": "Hydrogen, then the next is helium…. Physics 101, although there is dark matter thought to make up 27% of the universe. ",
            "date": "Answered August 28, 2018",
            "views": "88",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Albert Nielsen",
                    "user_href": "/profile/Albert-Nielsen-1"
                },
                {
                    "user_id": "Olivier Demeijer",
                    "user_href": "/profile/Olivier-Demeijer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Stratford",
                "href": "/profile/Richard-Stratford-2"
            },
            "answer_text": "In terms of the number of atoms, the ten most abundant elements are hydrogen, helium, oxygen, carbon, neon, nitrogen, magnesium, silicon, iron and sulphur. ",
            "date": "Answered October 13, 2020",
            "views": "9",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nitesh Singh",
                "href": "/profile/Nitesh-Singh-6"
            },
            "answer_text": "Abundance of the chemical elements ",
            "date": "Answered January 10, 2013",
            "views": "449",
            "upvotes": "0"
        }
    ]
}