{
    "title": "What are examples of thermodynamic systems? - Quora",
    "tags": [
        "Entropy (physics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yashasvi Aulak",
                "href": "/profile/Yashasvi-Aulak"
            },
            "answer_text": "See, it's like asking what're real life examples of Newton's laws. Almost everything you can observe with naked eye has to be consistent with Newton's laws, or shouldn't violate them. Similarly, thermodynamics is an even powerful theory. Everything (almost, can't speak of any exceptions), has to follow thermodynamics. So anything you can think of is actually a thermodynamic process, following all 3 laws. You can't find any process that violates them. So your question should be what are the processes where you can clearly analyse these processes. If you want a good idea and you're matured enough, then try reading Carnot cycle, you'll get a very good idea of the first 2 laws. Law 3 is more of a mathematical statement stating entropy at 0K is 0. Then fridges are a good system to study real life thermodynamics. For first law, a simple example is, consider a toy rubber balloon, try heating it. It'll burst at a point. Why did this happen? Because as you supply heat to the gas inside by heating, both it's temperature and volume increase, and at a point when balloon's rubber can't stretch any more, it bursts. So this is the first law, you gave heat to a system, it was used to increase it's internal energy (related to temperature) and to do some work (expansion of balloon, the gas that exerted pressure on the balloon displaced it in the direction of force, hence positive work was done by gas) So deltaQ=deltaW+deltaU Then for second law, there's a simple example solely governed by second law, and first law doesn't play a role here. Consider 2 boxes of 2 chemically inert different gas molecules but both at same temperature, pressure, volume and same other thermodynamic variables. Connecting them wouldn't cause any heat transfer or change in energy since neither do they react nor have different energies or temperature, so first law wouldn't say that the gases should mingle, note that it isn't being violated either, but it doesn't tell you anything here. But as seems natural or as is found experimentally, they would mingle spontaneously to make the configuration look as random as possible. This spontaneity is explained by the second law. It did so to increase it's entropy (the universe here is just the system of 2 boxes), as the number of states a system can be in now increases (classically speaking), which is naively interpreted as increase in randomness. Randomness is a very heuristic term, don't get swayed by it. Go for proper definitions only. Then for third law, we'll have to think of a bit complicated system, the Ising model, which'll take quite a bit of physics which I don't know if you'll be with. Just take it for the moment that it's just that entropy is 0 at 0K. That is a system will stay in just one configuration at 0K, which is the least energy configuration. In other terms there'll be no energy (or any) fluctuations, which is very intuitive actually because the temperature is 0 and you can associate fluctuations with temperature naturally. At higher temperatures fluctuations are high. If you still have any doubt, let me know. ",
            "date": "Answered July 13, 2017",
            "views": "61",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dylan Altman",
                    "user_href": "/profile/Dylan-Altman-5"
                },
                {
                    "user_id": "Suveg Sharma",
                    "user_href": "/profile/Suveg-Sharma-2"
                },
                {
                    "user_id": "Vibhash Sinha",
                    "user_href": "/profile/Vibhash-Sinha"
                },
                {
                    "user_id": "Lois Concidine",
                    "user_href": "/profile/Lois-Concidine"
                },
                {
                    "user_id": "Dheeraj.S",
                    "user_href": "/profile/Dheeraj-S-20"
                },
                {
                    "user_id": "Pranav Kirthick",
                    "user_href": "/profile/Pranav-Kirthick"
                },
                {
                    "user_id": "Swapnil Karale",
                    "user_href": "/profile/Swapnil-Karale-2"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Yogi-63"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rajashri Gavali",
                "href": "/profile/Rajashri-Gavali"
            },
            "answer_text": "The 4 Thermodynamic Processes are : Isothermal Process: In this process, temperature remains constant. As internal energy of a gas is a function of its temperature, for isothermal process, ΔU=0.For the isothermal expansion of an ideal gas, W=nRTx[ln(V2/V1)].W is positive if V2>V1. Since ΔU=0, the heat transferred to the gas is ΔQ=W.Adiabatic Process : In this process, no heat is exchanged between the system and the surrounding. So, Q=0. Hence, ΔU=-ΔW, i.e. ΔW equals the change in a physical property of the system.Isochoric Process : In this process, volume remains constant i.e. the change in volume of thermodynamic system is zero. As change in volume is zero so work done is zero. From First law, Q=ΔU. All the heat added to the system goes into increasing its internal energy.Isobaric Process: In this process, pressure remains constant. So, W=P(V2−V1). So if volume increases work done is positive else negative.And the additional one is, Cyclic Process : In this process, the final state of the system is equal to initial state. As change in internal energy is state function so in this case ∆U=0. ",
            "date": "Answered June 3, 2020",
            "views": "701",
            "upvotes": "0"
        }
    ]
}