{
    "title": "What alternatives are there for fracking? - Quora",
    "tags": [
        "Hydraulic Fracturing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nicholas Thwaites",
                "href": "/profile/Nicholas-Thwaites"
            },
            "answer_text": "It depends what you are really asking. If you mean a half century old, tried and tested method of increasing permeability in low permeability formations in the water industry or the oil & gas industry, there aren't many alternatives. I vaguely remember an experimental tool to drill long very small diameter drain holes out of a well bore that I saw at a conference that might do the same job…. If you mean a shorthand for developing unconventional oil & gas reservoirs, especially in the US, well other forms of electricity generation can replace some of the gas, and moving to electrical cars and public transport can replace some of the oil. In Northern Europe, most gas is used for space heating and water heating (I don't know what most households in Canada and the northern US use to heat their homes and water, but I guess gas fired central heating is in the mix) and there aren't a lot of cheap, easy to apply alternatives to gas heating. In terms of flying, there's no real alternative to oil, other than abstinence, which is very unpopular. ",
            "date": "Answered July 27, 2020",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Barnard",
                "href": "/profile/Michael-Barnard-14"
            },
            "answer_text": "Fracking fulfills a purpose. The dominant use for unconventional gas is in electrical generation. So the answer requires an alternative to burning that particular fossil fuel for electricity.  Luckily, we have utility scale wind generation which is actually cheaper than gas generation even in the USA now. And rooftop solar which brilliantly overlaps peak demand and is cheaper than the retail price of electricity, and available with zero-down leases from SolarCity.  So the alternative to fracking is renewable energy. Odd how in the USA wind energy is the only form of generation without any tax code breaks or other forms of subsidy. ",
            "date": "Answered June 20, 2014",
            "views": "649",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hubert Gertis",
                    "user_href": "/profile/Hubert-Gertis"
                },
                {
                    "user_id": "Marc Bodnick",
                    "user_href": "/profile/Marc-Bodnick"
                }
            ]
        }
    ]
}