{
    "title": "What if the Earth's atmosphere contained 100% Oxygen? - Quora",
    "tags": [
        "Oxygen",
        "Atmospheric Sciences",
        "Chemistry of Everyday Life",
        "Earth (planet)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bill Cravens",
                "href": "/profile/Bill-Cravens"
            },
            "answer_text": "At 100% oxygen?? Even at 50%, let alone 100%, we would not have forest \"fires\". We would have forest \"EXPLOSIONS\". Needless to say, the rate of oxidation (be it biological oxidation, or metals oxidizing (rust) or fires burning... whatever) will depend on how much oxygen is available. Higher concentrations of O2 will cause every chemical reaction that involves oxygen to run faster.  However, it is also important to keep the details of thermodynamics in mind. Since oxygen reacts as an atom, but is present as O2 under atmospheric conditions, the \"chemical equilibrium constant\" is proportional to the square of the oxygen \"activity\" (e.g. C + O2 --> C + 2 O --> CO2). Chemical rates of reaction tend to follow the chemical driving force, which is affected by the \"equilibrium constant\". (All other things being equal. Oftentimes, the kinetics of the mechanisms affect it to. Hence the effects of catalysts, etc.)  But once you've got a reaction going, as with combustion, the reaction rate is basically going to run according to the square of the oxygen content. Increase it by 10%, and the rate will tend to be 20% faster. (1.1 x 1.1 = 1.21). Increase it by 20% and reactions (all else being equal) will tend to be 44% faster. (1.2x1.2 = 1.44). Now then... increase it to 100%?? That is, to increase it by five times? This would (at least in theory) increase combustion rates by 2500% . Of course, in the real world, at some point other factors come into play. But an atmosphere of 100% oxygen (among the many other problems it would cause) would have two immediate and horrifying effects. 1) It would make ignition insanely easy, as compared to current conditions... and 2) It would provide for an astonishingly high rate of combustion, once ignition occurred.  As another poster remarked, consider the dreadful fate of the crew of Apollo 1. (Messrs. Grissom, White and Chaffee). The atmosphere inside their capsule, which was being run through simulation training with the astronauts inside, was pressurized with pure O2. I don't know who the engineers were who made that decision, but it was a bad one. And Grissom, White and Chaffee paid a horrible price for it.  At 100% O2, even a tiny spark can cause every potentially oxidizable material within its reach to immediately explode into flame. Paper, cloth, even wet, green foliage... FOOM! And you can't outrun it. The reaction tends to be so immediate, and its effects so concentrated that many factors which normally inhibit the spread of a fire are utterly overwhelmed. The rest of the ignitable material being too far away. The dissipation of the flame's heat over distance. The presence of moist, cool air tending to dampen the effects of sparks and flame, and preventing them from traveling to the next point of ignition. All of the things that either prevent a fire from spreading, or that greatly reduce it (so that people can deal with it) can be rendered null and void in a high-O2 atmosphere.  As a result, a fire in an atmosphere with enhanced oxygen is a truly awesome (and terrifying!) thing to behold! It is not just a \"hotter fire\" nor does it move \"a little faster\". It is more like an entirely different kind of thing.... lunging out like some kind of monster, and engulfing every potentially flammable object within its scope, at lightning speed. Things that normally do not burn, or that only burn when heated extensively, will immediately flash into flame. Human bodies can be engulfed in seconds, as though they were soaked in gasoline. At 100% oxygen, iron and steel can be ignited and burned. (I kid you not. I work in a steel mill. I have burned hot steel... melted it and cut it away... with nothing but a lance pipe feeding pressurized oxygen to it.)  I've read a variety of articles where researchers have tried to estimate the oxygen content of the Earth's atmosphere at various epochs in the remote past. Certainly there appear to be reasons to believe that, at some points, it was higher than now. Perhaps as much as 50% higher (i.e. 30 to 35% O2 instead of 20%). But I seriously doubt that it was ever double today's concentration or higher. For one thing, beyond a certain level, oxygen is not only a fire hazard, it also has toxic effects of its own. But a world with any organic life above the waterline, with an atmosphere that had 50% or more O2 in it, would be a world constantly at risk of being turned into an inferno. All it would take would be a spark. ",
            "date": "Answered December 7, 2018",
            "views": "48",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Severin Vogt",
                    "user_href": "/profile/Severin-Vogt"
                },
                {
                    "user_id": "Richie Mandina",
                    "user_href": "/profile/Richie-Mandina"
                },
                {
                    "user_id": "Soymilk Jacko",
                    "user_href": "/profile/Soymilk-Jacko"
                },
                {
                    "user_id": "Janis Tribble",
                    "user_href": "/profile/Janis-Tribble"
                },
                {
                    "user_id": "Chathindu Nethmina",
                    "user_href": "/profile/Chathindu-Nethmina"
                },
                {
                    "user_id": "David Bradbury",
                    "user_href": "/profile/David-Bradbury-16"
                },
                {
                    "user_id": "Abie GR",
                    "user_href": "/profile/Abie-GR"
                },
                {
                    "user_id": "Trygve Sørdal",
                    "user_href": "/profile/Trygve-Sørdal"
                },
                {
                    "user_id": "Bir Bahadur",
                    "user_href": "/profile/Bir-Bahadur"
                },
                {
                    "user_id": "Kieran Elrod",
                    "user_href": "/profile/Kieran-Elrod"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ed Sutton",
                "href": "/profile/Ed-Sutton-1"
            },
            "answer_text": "Please understand that I have medical opinions about oxygen that are formed from approx 30 yrs of CRTT/RpSGT combined work in Respiratory School & hospitals as a student and employee in the hospitals. Where I seem to digress from pure oxygen, please be patient, I am building foundations that affect the conclusions. Thank You in advance. If O2 became 100%, all the nitrogen in everything with lungs would start washing out, within 24 hrs the lung functions and anatomical reserves of space would start droping, all fires would burn 5X faster and be 5X hotter. Without CO2 most mammals with CO2 breathing drives (including us ) would start loosing breathing drives until they switched over to the weaker hypoxic breathing drives, but their blood oxygen levels would be too high to activate those drives and only the sick COPD sufferers would keep breathing for awhile, the rest would suffocate in a sea of pure oxygen - ironically. If folks adapted quick enough to survive, all the babies born would go blind soon after birth, if not already blind at birth, because the high O2 levels in maternal blood before birth would cause blood vessels in the eyes to contract enough to shut off blood flow, ( possibly the kidneys too ) . Internal blood vessels would shrink to some degree, and the ones just large enough for single file blood cells to pass, would shut down the blood flow over time. Life on Earth is not designed to breath a pure gas of ANY gas, death would occur BEFORE reproduction and any significant degree of adaptation could get under way enough to keep living. In the units ( ICU, CCU, NICU, SICU, etc ) - MD’s know the risks and only keep people on pure oxygen as short a time as possible to minimize the damage, it is an effort to save life by balancing one set of risks against what is happening inside the patient. Respiratory Care Staff & Critical Care Nursing Staff & all critical care authorized staff, are all credentialed and rigorously trained and supervised with checks and balances, then they and Critical Care privileged MD’s are under the direction of a Critical Care MD with authority and oversight of all those units and all staff working there, policies, procedures, protocols, and teaching, training, preventing bad outcomes if possible. Pure oxygen can attempt to delay death, and sometimes can setup processes that cause death, oxygen is a drug, a powerful drug, because it chemically causes and accelerates processes in the human body. In the 1990’s I read a report featured an RN magazine dealing with hyperbarics and blood and metabolism. I will paraphrase from memory. If humans did not use Krebs Cycle metabolism, they would not need oxygen, might not need to breath, could not drown, would no longer need blood. My addition to that conclusion regarding oxygen transfer/Kreb’s Cycle metabolism is this. 20–21% oxygen is good, 30–40% oxygen is good even for long term, the higher % the oxygen becomes the more risky, and faster more risky at the higher %’s . modern science now looks at life and the medical parameters that support it differently. With a different metabolism, no longer requiring oxygen to function and be healthy, functional space travel might become practical reality. If physically dense and strong and tough enough - a person physically would not be bothered by the rigors of space flight even without a space craft. Jesus made the disciples so afraid when they saw Him in the upper room so soon after dying in front of them, He had to eat food in front of them and prove He was read. He had told them FLESH and BLOOD does not inherit Heaven . He told them a spirit does not have FLESH and BONE as you see me have. He was saying to medically informed readers He no longer required blood / breathing / air. He physically ascended to Heaven in the sight of 500 believers, some of whom had never seen Him before, and doubted this man was who the 12 disciples claimed, till He started rising up and ascended out of sight. Medicine advances because someone connects data in new ways , extrapolates, expostulates, tries to safely try out the new process, see if it works, and / or gives the expected, or a new outcome. Tabulate that and keep moving forward. ",
            "date": "Answered December 3, 2017",
            "views": "763",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rebecca D'souza",
                    "user_href": "/profile/Rebecca-Dsouza-69"
                },
                {
                    "user_id": "Severin Vogt",
                    "user_href": "/profile/Severin-Vogt"
                },
                {
                    "user_id": "Richie Mandina",
                    "user_href": "/profile/Richie-Mandina"
                },
                {
                    "user_id": "Erwin Stenzel",
                    "user_href": "/profile/Erwin-Stenzel"
                },
                {
                    "user_id": "Bryant Jackson Green",
                    "user_href": "/profile/Bryant-Jackson-Green-1"
                },
                {
                    "user_id": "Thiago Quirino",
                    "user_href": "/profile/Thiago-Quirino"
                },
                {
                    "user_id": "Ayzaic Monsanto",
                    "user_href": "/profile/Ayzaic-Monsanto"
                },
                {
                    "user_id": "Jeff Sykes",
                    "user_href": "/profile/Jeff-Sykes-7"
                }
            ]
        }
    ]
}