{
    "title": "What is the Pauli exclusion principle and what would happen if this principle was broken or violated? - Quora",
    "tags": [
        "Electron Spin",
        "Pauli Exclusion Principle",
        "Quantum Field Theory",
        "Quantum Computing",
        "Theoretical Physics",
        "Particle Physics",
        "Quantum Mechanics",
        "Science",
        "Hypothetical Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mathias Brust",
                "href": "/profile/Mathias-Brust"
            },
            "answer_text": "I will attempt an answer that hopefully can be helpful to somebody who would ask this question here rather than look it up elsewhere. One of the most simplistic formulations of the Pauli principle is that certain particles (called Fermiones), which include those that make up all atoms (i.e. protons, neutrons and electrons), cannot all occupy the same state. A classical analogy would be the piling up of things in your storage room. They cannot all lie on the floor, which would be the state of lowest energy, where they would naturally fall down to. Likewise, both the protons and neutrons in the nucleus, and the electrons in the shell of the atoms pile up on top of each other following strict rules from which the entire periodic table of the elements is created. As a result, each atom stores a huge amount of energy, just like your storage room stores the energy of all the things that could in principle fall to the floor if there was enough space. The energy released in chemical reactions such as explosions, fires etc. comes from the electrons being offered a chance to fall further down by reshuffling between atoms and molecules. Likewise, nuclear reactions (fission and fusion) release enormous energy. If the Pauli principle were not valid, all the energy stored in atoms would be released by all electrons protons and neutrons falling to the lowest energy state, and all atoms would fall apart. Matter would cease to exist as we know it. ",
            "date": "Answered September 29, 2020",
            "views": "162",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Wayne Hardy",
                    "user_href": "/profile/Wayne-Hardy-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Duerig Christian",
                "href": "/profile/Duerig-Christian"
            },
            "answer_text": "No two electrons can have the same 4 quantum numbers. Please, study what quantum number are and how they are used to label each electron uniquely in any electron configuration of an atom. Remark: Do not be afraid of the words. They are only labels. Just learn how they are defined and what they represent. If you can follow the mathematical explanations, then you have learned a lot. Notice, that the building method of the electron configuration does not tell the correct result in 21 cases of the 118 chemical elements. Cr, Ni, Cu, Nb, Mo, Ru, Rh, (Pd), Ag, Pt, Au and La, Ce, Gd, Ac, (Th), Pa, U, Np, Cu, Lr are exceptions. In the first group, one electron moves inwards onto a lower energy level; but Pd shows, that two electrons move inwards. In the second group, one electron moves outward onto a higher energy level; but Th shows, that two electrons move outwards. You can check all this if you study carefully the electron configurations and learn, where the building method does not work. The errors were discovered via spectral analysis !!! For the future chemical elements, the building method becomes obsolet. There are far too many exceptions !!! TO YOUR QUESTION: The Pauli exclusion principle tells us, that the s-orbital has maximal 2 electrons. Further more: It tells us, that any orbital can only possess maximal 2 electrons. If you want to place a third electron into that orbital, then it will have the same 4 quantum numbers as one of the two already placed there. The p-orbital block has 3 orbitals, each maximal with 2 electrons. Therefore there are maximal 6 electrons in the p-orbital block. The d-orbital block has 5 orbitals, each with maximal 2 electrons. Therefore, there are 10 electrons in the d-orbital block. The f-orbital block has 7 orbitals, each with maximal 2 electrons. Therefore, there are maximal 14 electrons in the f-orbital block. The g-orbital block will have 9 orbitals, each maximal with 2 electrons. Therefore, the g-orbital block will have maximal 18 electrons. The h-orbital ….. and so on ! From now on: Do not use the term SHELL any more. Use ENERGY LEVEL. Notice, that any orbital has maximal 2 electrons. (Pauli exclusion principle) Watch via YouTube the video ORBITAL- CHEM DEF with Sir Prof. Dr. Martyn Poliakoff. He is the EINSTEIN OF CHEMISTRY. I wish you good luck. If you have further questions, then please let me know. Without the PAULI PRINCIPLE, every thing breaks down !!! ",
            "date": "Answered September 29, 2020",
            "views": "127",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "George Grubbs",
                    "user_href": "/profile/George-Grubbs"
                },
                {
                    "user_id": "Wayne Hardy",
                    "user_href": "/profile/Wayne-Hardy-6"
                }
            ]
        }
    ]
}