{
    "title": "What is conscious awareness? - Quora",
    "tags": [
        "Self-Awareness"
    ],
    "response": [
        {
            "author_info": {
                "name": "Siri Perera",
                "href": "/profile/Siri-Perera"
            },
            "answer_text": "I want to look at Conscious Awareness and see what it feels like and what science says about it.  Basically, how does the environment communicate with us? When the mind is silent and the lower personality mind is not, then conscious awareness is also the vehicle for the action of Truth and the “new” in you. Remember that 2020 has moved on from the mystics. They would not have had all these scientists now getting into consciousness with their experiments helping us to understand how conscious works. The mystics only has and had a sense of \"being\" or feeling of how it works. But scientists are helping us to understand how contact is made between the environment and us. How information is passed from the environment to our minds. If we were just being aware of contact from the environment will our description in words be something like this: When IT appears it can come through in many forms. An Insight in mind is also the presence of IT. It shows itself not through this image you have of IT in your mind. It shows itself by how it solves your problems for you. That is how it comes through. Remember that it is an underlying Cosmic force, no permanent form yet still unchanging in essence. The mind has to sit a certain way in silence for it to show itself to help you. Krishnamurti calls it \"consciousness awareness\" - full attention of just observation (no thinking) with no judgement passed of what you observe. I have been through this process in the studio when painting looking for insight or solutions. Others say one-pointedness but if it suggests concentration then it is not that. It is like observing with the whole Cosmos behind you waiting for the \"insight\" or \"word\" to come through, yet not doing it consciously, deliberately, but naturally so in that state of mind. (siri perera) Then comes the scientist and he takes over with his laboratory and all the equipment he/she has. Then he uses a magnetic field to replace the consciousness in the ether to stimulate your brain and he then records which parts of your brain lights up. The fact that when the switch is on some parts of the brain lights up and when he switches off the highlights disappear is enough already but he tried this. He takes 2 lots of people to test. One set is left normally as before and the other set he anaesthetises. He found that those he dulled out in mind with anaesthesia has much less highlight in their brains when a magnetic field was applied to the brain.  This is what Giulio Tononi is saying about his experiments in mapping out brain interactions with actions in mind. One study, published in 2015, examined the brains of participants under various forms of anaesthesia – including propofol and xenon. To get an idea of the brain’s capacity to integrate information, the team applied a magnetic field above the scalp to stimulate a small area of the cortex underneath – a standard non-invasive technique known as Transcranial Magnetic Stimulation (TMS). When awake, you would observe a complex ripple of activity as the brain responds to the TMS, with many different regions responding, which Tononi takes to be a sign of information integration between the different groups of neurons. But the brains of the people under propofol and xenon did not show that response – the brainwaves generated were much simpler in form compared to the hubbub of activity in the awake brain. By altering the levels of important neurotransmitters, the drugs appeared to have “broken down” the brain’s information integration – and this corresponded to the participants’ complete lack of awareness during the experiment. Their inner experience had faded to black.  Hence is deep meditation anaesthesia? - \"Their inner experience had faded to black\" where brain manifesting a probability stops. What are you saying - that being self-aware or sensing consciousness at any moment is as a result of the 5 senses. That consciousness itself is experienced or felt only when an \"integration\" takes place. If not we don't even know it is there? What happens then when we meditate or when our minds are silent of thinking - can we still feel consciousness here or it is there but not felt? So consciousness has to interact with the brain/mind via the 5 senses for us to know it is present? and then, \"Giulio Tononi's theory asserts that consciousness arises from certain kinds of information processing.\" and, \"They are combined and cross-linked to form a meaningful narrative. Every time we experience something new, it is integrated with that previous information. It is the reason that the taste of a single madeleine can trigger a memory from our distant childhood – and it is all part of our conscious experience.\" So it gives us an idea that some kind of docking system between the brain and consciousness is at work here. Is it possible that deep meditation itself is a kind of anaesthetized state of mind, restful and keeping out any intrusion by consciousness? Meditation is a kind of shutting down of the mind. It is a kind of sleep state while still awake. It is also a very good technique to show oneself how the mind has other mind spaces in it to be explored. Can we work off the other mind spaces with different forms of thinking rather than working only off the personality mind?. Finally: \"Although the concept of “group consciousness” may seem like a stretch, he thinks that Tononi’s theory might help us to understand how large bodies of people sometimes begin to think, feel, remember, decide, and react as one entity.\" and, \"...in the future, Tononi’s theory may help us to understand ‘minds’ that are very alien to our own.\" reference: Are we close to solving the puzzle of consciousness? 3rd January 2020 ",
            "date": "Answered January 3, 2020",
            "views": "415",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jaron Lukas",
                "href": "/profile/Jaron-Lukas"
            },
            "answer_text": "Conscious awareness refers to a mental state one reaches in which you have no thoughts and are simply “being”. If you meditate, you may recognize this feeling through witness consciousness, which is that expansive, boundless presence within you that observes your breath and other sensations. If you’re not familiar with this feeling, one way to understand it is to ask yourself: what is paying attention to my breath? Then try to turn your attention to that source of consciousness. When you are operating from the level of witness consciousness, you are said to be in a state of conscious awareness. Beyond that, you can also be in a state of conscious awareness with your eyes open as you go about your day. The best way I can describe this is moving through life as if you are plugged into your body instead of being trapped in it. You begin observing and processing everything around you not from our fear-based monkey brains but from a detached intelligence. You perceive that you are not only connected to everyone else, but that you are every other person around you in a certain way, so you begin to communicate more compassionately from something closer to an enlightened state. Visually, being in a state of conscious awareness feels like moving through life as if you’re in a first person video game. The opposite of this state would be to move through life based on your fears, guilt and hate—the low level emotions of conscious experience. The highest emotional levels of consciousness are acceptance, reason, love, joy, peace and enlightenment, and living all aspects of your life from these emotions are representative of being in a state of conscious awareness. Something to ponder… Imagine what it would be like to live in a state of conscious awareness all the time. ",
            "date": "Answered July 6, 2019",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ardon Lukasiewicz",
                    "user_href": "/profile/Ardon-Lukasiewicz-1"
                }
            ]
        }
    ]
}