{
    "title": "What effects does gravitational force have? - Quora",
    "tags": [
        "General Relativity",
        "Force (physics)",
        "Gravity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eugene Bunt",
                "href": "/profile/Eugene-Bunt"
            },
            "answer_text": "Gravity is a change in uniform motion. Albert Einstein said that you cannot distinguish from the inside of a windowless elevator whether you are in an accelerating elevator in deep space remote from all gravitational influence, or in a gravitational field. Centrifugal force is a change in uniform motion of mass restricted to a circular path, but it can be identified using a gyroscope from inside a sealed elevator subjected to the centripetal force of a rope holding it to the circular path. So how can it be that gravitational force, emanating from a spherical orb, be indistinguishable from an accelerating elevator while also being similar to centrifugal force? We are all familiar with momentum, change in momentum lags change in velocity. A Moving object doesn't just stop abruptly on contact with a surface, it has the power to penetrate with respect to its velocity. Sir Isaac Newton said we move through space freely without friction, and, an object in motion tends to stay in motion unless acted upon by an outside force. How can we reconcile these axioms, and, where will it take us? Einstein gave us the answer to gravity, warped space/time. And he told where to look for it, the bending of light in a gravitational field. On May 19, 1919 astronomer Arthur Eddington took a photograph of a constellation that lined up behind the Sun during a solar eclipse, and it confirmed Einstein's prediction of light bending in a gravitational field. The background star images moved away from the Sun, as if you were viewing the constellation through a huge positive lens. Einstein described the mechanics of this observation by imagining a series of elevators rising from the Sun’s surface; light enters the elevator at a higher level on the far side, and then it exits at a lower level on the side closest to us. As light traverses elevator after elevator, its path bends so that the star’s images appear to be at a greater angle away from the Sun (“The Evolution of Physics” © 1938 by Albert Einstein and Leopold Infeld page 220.)   Time is the second factor in this conundrum. Elements can be identified by the light they radiate due to the unique number and position of electrons in their electron energy-shell levels where photons are absorbed and emitted, resulting in dark spectral lines distinguishing each element. Using these spectral lines as light-wave-length markers; light-waves red-shift for each element when coming from a massive star, this means that light from specific elements travels farther in comparable length when coming from the slower time-rhythm of a massive star. The fabric of space stretches as illustrated in gravitational embedding diagrams at the center of mass allowing light and matter to move farther/faster toward the center of mass as compared to moving toward the faster time-rhythm surrounding the mass. Gravity is the result of moving farther/faster through the rising elevators toward the slower time-rhythm and then being stopped by the planet surface, change in momentum lags change in velocity, which feels like deceleration/gravity. Gravity is the kinetic energy of momentum.  These rising elevators can flow through each other and enhance the affect of one-another, causing galaxies to rotate as a single unit; a galaxy rotates as if you have drawn the stars on this paper, then rotate the paper, otherwise the galaxy would lose its shape in a single rotation. In a spiral galaxy the stars are moving through cross-flows (backward and forward) of space, adding to their kinetic energy (the missing dark matter) and holding the galaxy in lock step to unexpected velocities relative to what we expect, a greater velocity to maintain outer orbits. At a distant point from the gravity source momentum toward the field weakens enough to cause the expansion of the universe. Where more matter congregates more space is provided generating a homogeneous distribution of matter throughout the universe. Momentum of matter has a correspondence to the rate at which light is acquired in the electron energy-shells of an atom. Electrons move from one energy-shell to the next in jumps without occupying any position between those shell levels (Max Planck, the Ultraviolet Catastrophe and the start of Quantum Mechanics.) The distance of the electron energy-shell level from the nucleus of an atom out to the forth level are multiples of 5.29*10^-11 times 2, 8, 18, 32, beyond the fourth level the numbers have not been established. The number of electrons at these shell levels correspond to 2n^2 where n is the shell number starting from closest to the nucleus, or, 2, 8, 18, 32. A mass-less photon would seem to be a square-wave pulse movement of space-segments because of the way electrons move from one position to the next without occupying any space between positions. A photon has two dimensions, length and height devoid of a time element. Einstein also noted that it is peculiar that inertial mass is equivalent to gravitational mass. On page 202, in the book, The Evolution of Physics, by Albert Einstein and Leopold Infeld, there is a table of distance of a falling object from a tower with a height of 256 feet; the stone reaches the ground in four seconds. Time in seconds, Elevation in feet 0, 256 ft 1, 240 ft 2, 192 ft 3, 112 ft 4, 0 ft Divide the elevation by 8; the results are 32, 30, 24, 14, and 0. The differences between the numbers are 2, 6, 10, and 14. Add the differences together and you have 2, 8, 18, and 32. The similarity in number progression suggests that there is a correspondence between electron energy-shell levels and acceleration in a gravitational field. Electron energy-shell levels are where photons are absorbed and emitted. There is a time lag as the atom processes the added size and direction which determines the amount and direction of kinetic energy in the momentum. You are moving through longer segments of space in a shorter period of time toward the slower time-rhythm of the greater mass, then decelerating on the planet surface, gravity. The measure of the fabric of space and time are local phenomenon. The Michelson-Morley experiment comparing the speed of light from a distant star which was split in two perpendicular directions using our planet surface as a reference point in the 1890′s, showed no difference in the speed of light moving along perpendicular paths; was contradicted by the 1913 Georges Sagnac experiment on a rotating platform attached to the surface of the Earth, demonstrated that motion relative to the local gravitational-field does add and subtract from the speed of light. (verified by, Gravity Probe B) This suggests that the space/time scale is packaged in isotropic moving coordinate systems centered on a gravity source. Gravity is self perpetuating because: On the surface of a planet you are in a faster time-rhythm than the matter in the core of the planet, you are blue shifting (traveling through space) toward that core. Anything put under pressure radiates heat, that is how air conditioning works: the compression side is where the heat is extracted and the low pressure side is where air is cooled down for circulation. All of the blue shifting matter on the planet surface is applying tremendous pressure on the core, that is why the core is not cooling down after billions of years and will remain hot forever. The pressure slows the time-rhythm producing long-wave energy and radiates the gravity (moving space) we feel on the surface resulting in our momentum toward the core. ",
            "date": "Updated September 16, 2019",
            "views": "18",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ayokunle Yodex Ayoola",
                    "user_href": "/profile/Ayokunle-Yodex-Ayoola"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sudip Karn",
                "href": "/profile/Sudip-Karn"
            },
            "answer_text": "Tons of effects of Gravitational force are there. Have.a look here First of all *EXISTENCE OF PLANET IN SOLAR SYSTEM. Each and every planet as well as minor planet are there in orbit ,just because of some forces like centripetal force ,Gravitational force etc. We know for an object to be in it's orbit there's a necessary factor called centripetal force and this force acts towards the centre .In case of earth's orbit centripetal force is provided by Gravitational force between earth and the sun. F=mV^2/r=GMm/r^2 Where F is the centripetal force,M is the mass of sun,m is the mass of the earth ,and r is the distance between earth and sun. You might be wondering if centripetal force acts towards the centre ,then why earth isn't getting closer to the sun . Remember your academic study that is centripetal force is always perpendicular to the velocity .Change in velocity that is centripetal acceleration causes earth to move in circular orbit . If there's no orbit then change in season ,day and night is so unidentifiable . The same principle is for existence of satellites .  *STABILITY OF AN OBJECT IN THE EARTH Tall building,towers,house ,and many more is possible due to this force .If there's no Gravitational force then each object is moving here and there .Not only these falling down of rain ,stream water,blowing and many more else all due to this force . Hope you got it . Thanks. For being here !!! ",
            "date": "Answered April 26, 2018",
            "views": "607",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bishesh Dhaubhadel",
                    "user_href": "/profile/Bishesh-Dhaubhadel"
                },
                {
                    "user_id": "Kaushal Karna",
                    "user_href": "/profile/Kaushal-Karna"
                }
            ]
        },
        {
            "author_info": {
                "name": "Simon Bridge",
                "href": "/profile/Simon-Bridge-1"
            },
            "answer_text": "Question needs to be more specific… there are many many effects of the gravitational force or just one, depending on how you look at it. Context is everything. The one effect is gravity. That is, the gravitational force is one way of explaining the phenomenon that we call gravity. Since it is a force, the effect is the same as any force: a contribution to the acceleration in the direction of the force. Again, this is only one effect. This effect gives rise to all the gravitational phenomena… like objects falling down, orbital motion, ballistic motion, the shapes and structure of of planets, stars, galaxies… the list goes on. So what are you asking about? ",
            "date": "Answered May 10, 2018",
            "views": "328",
            "upvotes": " Answer requested by Manish Rupakheti"
        },
        {
            "author_info": {
                "name": "Dahny Patel",
                "href": "/profile/Dahny-Patel"
            },
            "answer_text": "We have to use laws of gravitation defined by the great genius Isaac Newton. He defined two formulas: Fg = g x m Fg = G x M1 x M2 / d^2 Force of gravity is proportional to mass of objects and distance between objects. We still do not know how gravity acts at a distance. Gravity is indeed a binding, pull force. We experience everyday on the Earth. Gravity is a long distance force. ",
            "date": "Answered July 31, 2019",
            "views": "159",
            "upvotes": " Answer requested by Enomfon Mfon"
        },
        {
            "author_info": {
                "name": "John H. Morrison",
                "href": "/profile/John-H-Morrison"
            },
            "answer_text": "Newtonian gravity — the force is proportional to both masses, and inversely proportional to the distance between them, and is attractive. Combine that with F=ma, and solve the equations. Probably it’s easier to use the energy equations instead, along with angular momentum conservation. If you’re referring to general relativity, where the source is energy, momentum, and stress — I have to pass on that, since it involves actually solving the Einstein field equation. ",
            "date": "Answered July 31, 2019",
            "views": "188",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shehzad Emritte",
                "href": "/profile/Shehzad-Emritte"
            },
            "answer_text": "Effect 1: Tidal Effect Effect 2: It prevents living things from floating around ",
            "date": "Answered April 26, 2018",
            "views": "124",
            "upvotes": "0"
        }
    ]
}