{
    "title": "What are biological molecules? - Quora",
    "tags": [
        "Chemistry and Biology",
        "Molecules",
        "Biology",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Bolles",
                "href": "/profile/Mark-Bolles-1"
            },
            "answer_text": "These are the four most important molecules: Proteins--composed of hydrogen, carbon, oxygen, nitrogen, and often sulfur.  These are the molecules that perform active tasks in the body including hormones and enzymes.  They also produce many of the structural components like keratin in your skin, hair, and fingernails.Carbohydrates--composed of hydrogen, carbon, and oxygen only.  These are the fuel burned by the body as various sugars.  Glucose is the most abundant and is utilized to make adenosine triphosphate(ATP) with the addition of phosphorus that is the primary source of cellular energy.Lipids--these fat molecules are made from hydrogen, carbon, oxygen, and usually phosphorus and nitrogen.  These store energy but also form cell membranes and hold water in the structures of soft tissues.Nucleic acids--also made from hydrogen, carbon, oxygen, phosphorus, and nitrogen.  The most important are cytosine, guanine, adenine, and thymine that code DNA and RNA which are the instructions for your body's shape, structure, and organs.Besides these it must be emphasized that the inorganic compound water is the single most abundant chemical in living things. As far as elements, here is a list of the most common in the human body.  The first column is percentage by weight and the second is percentage by number of molecules:  ​​ ",
            "date": "Answered June 24, 2016",
            "views": "13",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shanice Lee",
                    "user_href": "/profile/Shanice-Lee-7"
                },
                {
                    "user_id": "Riaan Engelbrecht",
                    "user_href": "/profile/Riaan-Engelbrecht"
                },
                {
                    "user_id": "Amulya Yedlapalli",
                    "user_href": "/profile/Amulya-Yedlapalli"
                },
                {
                    "user_id": "Ayan Goel",
                    "user_href": "/profile/Ayan-Goel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Meg Osterby",
                "href": "/profile/Meg-Osterby"
            },
            "answer_text": "There are four general classes of biological molecules. These are carbohydrates, lipids, proteins and nucleic acids. A study of biochemistry will introduce these, and then go into molecules that combine them. For example, the so called good cholesterol isn't cholesterol (a steroid lipid) at all, it's a lipo-protein, which is just what it sounds like, a compound with a lipid portion and a protein portion. Under the general heading of nucleic acids you will find nucleotides and nucleosides, one with nitrogenous base and the carbohydrate ribose, and the other with nitrogenous base, ribose and inorganic phosphate. So, it gets complicated. Basically the term biological molecule refers to any organic compound (carbon containing - except carbonates, bicarbonates, CO and CO2) that is made in and used in a biological organism, plant, animal, bacteria, or fungi. ",
            "date": "Answered October 24, 2020",
            "views": "51",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jennifer Bas Ilen",
                    "user_href": "/profile/Jennifer-Bas-Ilen"
                }
            ]
        }
    ]
}