{
    "title": "What factors contribute to a person becoming racist? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Cecili Chadwick",
                "href": "/profile/Cecili-Chadwick"
            },
            "answer_text": "Freud writes about two kinds of fear; one is real (both rational and suggestive of an actual threat) and the other is irrational and neurotic in nature — based entirely upon an imaginary threat. When white people express race-based hatred for people of color, it stems from a neurotic fear. When people of color develop race-based hatred for white people, it is based upon a real fear that comes from historical, political, legal, and social marginalization. The former constitutes racism and the latter involves some sort of self-preservation or cautionary posturing because of a real danger created by racial formations. Now, in answer to your first question as to why someone becomes racist, I think it starts out as a reactionary identity formation and later becomes manifest as an irrational fear of losing power. I also think the desire to inflict incessant and gratuitous humiliation upon an other because of the color of their skin can only be the result of a deep wound — some kind of insecurity that attaches itself with a psychosexual sadism. To your second question about how, I’d say it happens most effectively through historical, philosophic, scientific, legal, and economic spheres that have rationalized what ought to be considered irrational: racial prejudice. What’s scary about racism is that it is often unrecognized as such, unquestioned when it occurs, and highly convenient for those looking for someone to blame when the chips are down. You can be literally destroyed by what people think about you and the widespread mistreatment of people of color in the U.S. is a stain on the fabric of this great nation. A little history lesson could be useful here. At the same time that the first African slave was forcibly removed and brought to the shores of North America in 1619, Europeans were wondering if the Native Americans were indeed human beings with redeemable souls. In the late 17th century, when the original source of unpaid labor was performed by European indentured servants, they slowly started to win rights and entitlements as they were being replaced by African slaves on new tobacco plantations in Virginia and Maryland. By the time we get to the 1790 Naturalization Act, which permitted only \"free white persons\" to become naturalized citizens, the doors were wide open for European immigrants. It’s also worth remembering that only citizens could vote, serve on juries, hold office, and in some cases, even hold property. In fact, racial barriers to naturalized U.S. citizenship weren't removed until the McCarran-Walter Act in 1952, and white racial preferences in immigration remained (officially so) until 1965. Following the 1790 Naturalization Act, there was also the 1830 Indian Removal Act, which forcibly relocated Indian tribes to west of the Mississippi River to make room for white settlers. Citing the inferiority of Blacks and Indians was an easy way to justify racism. There are so many more examples in-between, but the next big one was the 1862 Homestead Act that gave away 270 million acres (10% of the total land area of the United States) of what had initially been Indian Territory. This land was converted to private hands, overwhelmingly white. When American slavery finally ended, the federal government never followed through on General Sherman's Civil War plan to divide up plantations and give each freed slave \"40 acres and a mule.\" The only monetary compensation that was made was in Washington, D.C. where the government paid up to $300 per slave upon emancipation - not to the slaves, of course — but to local slaveholders as compensation for a loss of property. The legacy of slavery lived on not only in the impoverished conditions for Black people but in the wealth and prosperity that white slaveowners and their descendents were afforded. Economists who try to place a dollar value on how much white Americans have profited from 200 years of unpaid slave labor, including interest, start their estimates at $1 trillion. Once we get to the 20th century, Alien Land Laws were passed in California and other states, reserving farm land for white growers by preventing Asian immigrants (who were ineligible to become citizens) from owning or leasing land. There is a widespread temptation to see race as either essence or illusion and neither really deals with the social, political and economic consequences of racial formations. Race is a socially constructed phenomenon, but that does not make it any less real. We are still deeply affected by racial tensions and those are exacerbated by gross income inequality. We are facing a serious threat right now — a kind of mild, pernicious apartheid. I am not sure how many people can really see it, but we all feel it, and the lines are being drawn by white supremacists. Understanding what racism is and how one becomes racist is of the utmost importance. ",
            "date": "Answered August 19, 2017",
            "views": "12",
            "upvotes": " View 46 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ade Axel",
                    "user_href": "/profile/Ade-Axel"
                },
                {
                    "user_id": "Felisha Pedersen",
                    "user_href": "/profile/Felisha-Pedersen"
                },
                {
                    "user_id": "Barak-Har Elkin",
                    "user_href": "/profile/Barak-Har-Elkin"
                },
                {
                    "user_id": "Amaka Nzenaguorae Dawn",
                    "user_href": "/profile/Amaka-Nzenaguorae-Dawn"
                },
                {
                    "user_id": "Samantha",
                    "user_href": "/profile/Samantha-813"
                },
                {
                    "user_id": "Gilberto De La Vega",
                    "user_href": "/profile/Gilberto-De-La-Vega"
                },
                {
                    "user_id": "Babatunde Odebiyi",
                    "user_href": "/profile/Babatunde-Odebiyi"
                },
                {
                    "user_id": "Sheila Payne",
                    "user_href": "/profile/Sheila-Payne-6"
                },
                {
                    "user_id": "Ryan Grummer",
                    "user_href": "/profile/Ryan-Grummer-1"
                },
                {
                    "user_id": "Katherine Bryce",
                    "user_href": "/profile/Katherine-Bryce"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Lat",
                "href": "/profile/Dave-Lat-1"
            },
            "answer_text": "I am going to disagree with most of the people here, but with a theory that should make more sense to people. In fact, it’s not likely that parents are at fault. These are the following steps for a child to become racist. The child become self-aware. Within the family, they learn to recognise and become familiar with the faces around them. Humans are adept at facial recognition and will subconsciously learn the process.The child experiences other people. The child notices that some people do not look like others, in that one particular feature overwhelms the more subtle facial recognition processes. A highly noticeable difference in skin colour would be the main feature noticed, however it could also be eye or face shape shape. Children will also notice obesity, homelessness, beauty, warts, tattoos and many other physical factors. If the community is very uniform in appearance, this step could be delayed, or it could be that only minor differences mark a person as different, such as very curly hair in a community with straight hair. Depending on level of diversity community, the child will create a memory model of the types of people they encounter. Adults can easily access these memory spaces: if I ask you to imagine an Chinese man or a European woman, you’ll instantly access these childhood models. Furthermore, if I ask you to imagine a Cologhlis and you don’t know where in Africa they are, you may access a generalised African image.The child experiences their community, town or city. They are going to notice that how people group together, how they relate to each other, how they speak, who is given authority and who seems to be out of place. They will get a sense of whom to fear and whom to trust. Adults will provide a range of clues about this from overt explanations good and bad, to body language and voice tone. Threatening and other negative personal experiences with people who match a group type will create strong neural pathways. Importantly children will also discuss among themselves, especially when they start to interact at school and decide who is a leader and who gets to be teased.The child attempts to assemble a worldview. Armed with these experiences plus what they’ve learnt from others, from school and the media, the child assembles the jigsaw puzzle of how people around the world are constituted. They won’t be able to avoid learning that dark skinned people are from Africa, and that light skinned people are from Europe. They may get different senses of how Asia, the Americas or Oceania is organised. The less experience the child has, the more abstract is their impression. Hence if there are many Vietnamese in the child’s community, they will represent Asians generally. If there are Indians, then they may represent Asia, or the child may differentiate into two or more groups. This is a complex and important problem, and the child will solve it dynamically and continuously.The child incorporates their moral view into their worldview. The child will begin to be told about their own role in the community, and their future contribution to it. The child will become aware of how the community organises itself, and their own responsibilities when dealing with other people. The community could be egalitarian, separated or homogeneous, some other description or hybrid, and the child will need to fit in with that or rebel against it. When dealing with a certain type of person, the child will want to know what to expect and how to avoid being in trouble. Questions will need to be answers: how to communicate? What customs should you follow? What is offensive to them? What role must take in practice for becoming adult? Who earns my national or cultural loyalty? How to I maintain my self-worth and confidence in the face of this complexity?The child takes a position on racialism. As people do not come with instruction labels, the obvious solution to an incomplete problem is to reconcile the cultural factors with how a person presents themselves visually, and those early experiences of fear and comfort. It is then inevitable that the child will learn that seemingly most people conveniently divide humanity into three to seven racial groups, and in many communities there’s a degree of consistency. For example, the United States has two main groups, called “black”/”people of color” and “white”, and then there’s four less commonly discussed, but consistently listed groups of Hispanic, Asian, Native American, Pacific Islanders. This is an authoritative solution for that country, never mind multi-racial people or having an ethnicity not quite in one group or the other. In other countries, a three-race model is commonplace, while other countries actively educate against all racialism. The child however may pick up an old book or look up Wikipedia and pick up an old anthropological scheme. If the child is scientifically-minded or aware of multi-racialism, they may comprehend the idea that humans vary by only small degrees, and no racial scheme can satisfy objective criteria - in which case they reject racialism and deal directly with complexity.The final step to being racist is to promote racialism as a primary method of assembling their worldview and assessing the people they encounter. Experiences with people, the understanding of the news, national identity and political positions are slotted into racial categories, which then leads to making broad assessments. These can even become self-reinforcing, such that every negative fact about an individual, community or country is evidence in support of the worldview. The person’s own identity is re-enforced positively or negatively depending on their disposition. Note that there’s different types of attachment to racism, for example a person may not be hateful. They just withdraw or may even be paternalistic. Poorly-handled, even diversity training can backfire and promote racism, where a strongly racialist position is pushed or assumed.In my view, the easiest way out of this process is to understand that racism is not just an evil, but it’s flawed and impractical. The scientific descriptions of humanity have long established this. As an adult, we could understand the humanity is far more diverse than we can imagine or experience. We’d be unwise to make assumptions about people in parts of the world we haven’t been. There are billions of varying face shapes, body types and skin colours. The people we meet are visually far more unique, than what we see at first glance. Importantly, when a person acts good or bad, this comes from their unique character, not their surface appearance. Finally, there is the humility in knowing we can never fully understand all of humanity. ",
            "date": "Answered July 18, 2018",
            "views": "492",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Albert Schmidt",
                "href": "/profile/Albert-Schmidt-7"
            },
            "answer_text": "Question: Why and how does a person become racist? I don’t feel as though I am fully qualified to answer this question as I myself am no specialist in psychology or sociology. I am, rather, a political science student, so I do end up learning a bit about racial conflicts within my university classes. Outside of university, I’ve also read some books on racial conflicts that tend to be written by sociologists wishing to make some avocation among society. But even then, I will not claim to be some specialist and will not pretend that I am one. However, I was requested by Tom Robinson, an individual I would consider a friend on Quora, to answer this question, so I will gladly oblige. From the literature I have read, it seems as though people who are openly racist share one quality: a lack of wealth. In fact, according to this study (Source: Economic scarcity alters the perception of race), falling on hard times can end up making people more racist. In general, this makes sense. We, as individuals, do not tend to like taking full accountability for our failures. We do not like thinking that it is our own faults for our failing economic conditions. As such, we may likely end up searching for scapegoats for our failures. In this case, could end up being race. Furthermore, with a lack of wealth comes a lack of education for many people. This means that the horizons of certain people are limited due to a lack of interacting with other people and they grow up in a relatively closed community. Hence, these individuals grow up with narrow perceptions of various issues around the world, including race relations. Another factor seems to be religion, particularly incredibly evangelical ones (Source: Religious People Tend to Be More Racist, Study Finds). Now. I’m going to be extremely clear here: I am not saying that being religious implies that you are racist. Rather, I am implying that individuals who tend to be racist also happen to be religious. In general, this can, in fact, make sense. Many religions, particularly extremely evangelical ones, create an ‘us vs them’ mentality, essentially committing the False Dilemma, otherwise known as the ‘either/or fallacy.’ Essentially, this dilemma is created when outsiders of one group is perceived by another group to be the ideological enemy. A prime example of this tactic can be seen in the hysteria that was the debate about our response to the September 11th terrorist attack. “Either you are with us Americans, or you are against us and work with the terrorists,” was a very common mantra held by many public figures as well as the general public. Essentially, this dilemma attempts to create an imaginary, singular enemy that one side can combat. It is an attempt to dishonestly and incorrectly over-simplify issues. In the case of incredibly evangelical belief systems, they could create false dilemma’s with virtually everyone else in the world different from them. And nothing is more easy to see as a difference than skin color. They could, in fact, attempt to justify the demonetization of other groups of people by race through some kind of religious text justification, typically one which most religious people at large will either disregard or not know the existence of. However, the main reason I feel as though racism remains pertinent in the United States is simply because of the way people are raised. And I do not believe that children are raised intentionally to perceive their race or group as superior to others. Rather, I feel as though one of two things could lead to many children developing racist tendencies. Firstly, there is an ongoing debate within psychology that asks the question or whether or not children are born racist or not. Now, by saying ‘born racist,’ I do not mean that children are born to hate other groups of people for their skin color. Rather, these undeveloped children could likely develop feelings of ‘us vs them’ that I explained prior as a kind of survival mechanism. It would be instinctual to perceive people different from their immediate group of peers as threats and, as such, develop disdain towards outsiders who are different. There are numerous articles and books written on this topic, but a good introductory source on this can be read here: Are Kids Racist?. This source, mind you, is not some incredibly conclusive study, but it is good introductory material in a topic that I myself cannot and will not claim to be an expert in, but find interesting myself. Another possibility in regards to children developing racist tendencies is societal influences on the children themselves in regards to how we raise them. Many articles are written on the topic of teaching children to be more race-conscious because as kids develop and do not themselves learn about racial diversity and how it’s natural, they could develop ideas within their own minds about race that are false. Over time, these ideas can take hold and make children themselves believe false ideas about other groups of people. It is not intentional by any means, but by not discussing racial differences with impressionable children, they could develop ideas that are not true in regards to race. Another article on that, which I personally think is far more detailed than the prior article, can be read here: Research-Based Advice on Teaching Children Not to Be Racist. So, what does all the information conveyed thus far lead to? Well, as with plenty of other subjects, the origin of racist thoughts in individuals is incredibly complicated. There are an endless myriad of influences on children and adults that can make them have more racist tendencies. Largely, I believe it is a mix of all three of these reasons, albeit the second one is, in my opinion, less significant of an influence on people. Rather, I believe that the lack of wealth and education, combined with impressionable children being taught non-deliberately to hold false views on different groups of people can lead to racism. The two of these combined may seem, in fact, to be an extremely potent force for racism. Allow me to explain. Imagine you raise a child from birth to adulthood. The child is either immediately born with ideas of ‘us vs them’ in his/her head, as might be natural among all humans first developing, and is never provided a discussion by the parent on race issues or never has his/her questions on race at a young age answered properly. Or perhaps the child just develops his/her often false ideas about people of different races. Either way, the child has a false perception of others based on their race that, itself, is likely benign in nature. As such, the child immediately develops feelings that are false of other groups of people from the beginning. Next, imagine that you raise that child in a poor household and that said child does not end up getting a good education. Now, perhaps this lifestyle of being poor is by no means your or anyone else’s fault, it’s just capitalism in play. Well, that child is now growing up in an environment where he/she is likely to not receive a good education on issues and, thus, will likely not broaden his/her horizons, and may end up becoming resentful of others in general. Combine this feelings of resentment and this relatively ignorant mind (again, the ignorance is the fault of nobody but the conditions the child grew up in) with the false ideas he/she grew up believing about race, and you basically end up with racism. Now, will this child grow up to become a Ku Klux Klansman? Likely not. However, that child him/herself will end up resenting other groups of people, perhaps holding incredibly false views of these other groups and their behaviors, and then said child will likely have children and the cycle will begin all over again. Perhaps those children may end up becoming racist too due to either the racist feelings of the parent being passed down unintentionally (or, if the parent is openly racist, intentionally) or due to the parent simply never talking of the issue. The cycle simply continues after that. Thankfully, we live in a far more educated world than once before. Topics of race are now on the forefront and new studies in psychology and sociology are tackling questions of race more than ever before. More people around the world are also receiving better education than was previously available to them. As such, I believe we are on our way into making the world a less racially hostile place to live in, and that is a sign of progress in my opinion. Racism and issues of race will probably never disappear, but I hope that they will become less relevant as more people are better educated in the future. ",
            "date": "Answered August 18, 2017",
            "views": "680",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mairi Beaton",
                    "user_href": "/profile/Mairi-Beaton-2"
                },
                {
                    "user_id": "Shivaprasad P",
                    "user_href": "/profile/Shivaprasad-P"
                },
                {
                    "user_id": "Tom Robinson",
                    "user_href": "/profile/Tom-Robinson-110"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashley Lande",
                "href": "/profile/Ashley-Lande-2"
            },
            "answer_text": "Most likely it was learned from a very young and impressionable age. I met a woman some years ago who was a racist in the sense that she openly stated she didn’t like black people. The reason she gave is she was raped on two separate occasions by two black men. I personally think that’s a pretty dumb way of thinking but at the same time extreme trauma doesn’t exactly lead to being more open minded about risk taking. Some people really do get led down a rabbit hole of misinformation and if you’re in an insulated environment, there’s nothing to stop you. The best argument for racially diverse areas is that when someone develops a stupid opinion based on misinformation of another race, there’s no one from that race to say “dude, what the hell are you talking about?”. There’s a man called Daryl Davis. He’s a black man who has deradicalised around 200 KKK members (which is about 2% of their membership). How did he do this? He befriended them. These white supremacists were so insulated and closed off that meeting and talking to a single black man got them out of their beliefs. Just think about that for a second. If you don’t have anyone in your life to act as a standard, misinformation and lies online or that you hear in life is a lot more likely to stick. If you know a black guy or a Jew then you know that the idea that the Jews meet in secret to topple the white world is a really stupid idea and you know the idea that blacks & Jews are subhuman is completely wrong. So I think a lack of real world connection to different people coupled with misinformation can absolutely lead to people becoming racist. Many (possibly most) I think can “unlearn” racism given the opportunity and attention. I don’t think it’s something we should just accept (though I do think to a degree the number of racists will never be 0). ",
            "date": "Answered August 25, 2019",
            "views": "541",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kenneth Hau",
                    "user_href": "/profile/Kenneth-Hau-2"
                },
                {
                    "user_id": "Emmett Cauchon",
                    "user_href": "/profile/Emmett-Cauchon"
                },
                {
                    "user_id": "Harry Haworth",
                    "user_href": "/profile/Harry-Haworth-2"
                },
                {
                    "user_id": "Janelle Ortolano",
                    "user_href": "/profile/Janelle-Ortolano"
                },
                {
                    "user_id": "Daniel Naor",
                    "user_href": "/profile/Daniel-Naor"
                },
                {
                    "user_id": "Mary Nelson",
                    "user_href": "/profile/Mary-Nelson-4"
                },
                {
                    "user_id": "Dale Walters",
                    "user_href": "/profile/Dale-Walters-2"
                },
                {
                    "user_id": "Jacob Gallo",
                    "user_href": "/profile/Jacob-Gallo-4"
                },
                {
                    "user_id": "William Lawyer",
                    "user_href": "/profile/William-Lawyer-1"
                },
                {
                    "user_id": "Keni Bates",
                    "user_href": "/profile/Keni-Bates"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Philippus",
                "href": "/profile/Daniel-Philippus-1"
            },
            "answer_text": "Humans are tribalistic. Virtually all humans. I spent (emphasis on the past tense) a long time thinking that those who weren’t liberal were idiots or monsters—along the lines of “basket of deplorables”. Then there was a while where I thought (again, past tense) any non-Libertarians were irrational and inconsistent (actually, most political ideologies are, but I admit that my own views are not self-consistent at that level; they are consistent with my underlying reasoning but that in turn draws on arbitrary premises). Anyway, my point is, I’m not just saying, vaguely, that people are tribalistic. I’m tribalistic; it takes constant vigilance to overcome those tendencies, I can’t be certain I’m succeeding, and I know that if I let my vigilance slip I go back to it. (Relatively recently, in irrationality induced by concern for a friend threatened by the belief I am about to refer to, I stated—and once again, I do not currently believe this—that those who believe apostates should be killed [believe, not act on it] should be denied immigration to the United States. Remind you of a certain political figure? Had to calm down before I remembered that I consider it invariably wrong to deny such things on the basis of belief.) Humans care about those who are in our tribe, whatever that means (political ideology, nationality, religion… skin color, perhaps?), and we don’t care about people who aren’t, and indeed often hate them. (This makes it very important to those who would avoid this tendency to remember the principle of cosmopolitanism: we are all citizens of the world, all the same tribe). So take, for example, a white person who is surrounded by white people for their entire life (also works with a black person surrounded by black people, a Muslim surrounded by Muslims, a straight person surrounded by straight people, etc). White people are their tribe—they have never learned to think of black people as equally important, and they will protect their own first. Now suppose that somebody has something to gain from a division and they say that black people are criminals, a threat. What reason does the person have to doubt this? They will want to protect their own against the enemy. And there you have it. A racist. Many people may not be racists, but I can guarantee you that, unless you take an incredible effort to avoid it, you [the reader] think the same way about something. You have a tribe, even if it’s not dictated by skin color, religion, nationality, or sexual orientation. ",
            "date": "Answered August 18, 2017",
            "views": "873",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Conor McMahon",
                    "user_href": "/profile/Conor-McMahon-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ulsen Myaci",
                "href": "/profile/Ulsen-Myaci"
            },
            "answer_text": "Truth is everyone is more or less a racist, the people we commonly dub  a racists are outspoken people who speak their thoughts or make unfair discrimination. Discrimination, unfair who doesn't do this, the only thing you need to do become a dubbed racist is speak your thoughts out loud or treat someone in a discriminatory way. You're not a racist if you have racist thoughts or maybe you are. Racist 1(noun)- a person with a prejudiced belief that one race is superior to others.  By this definition you can imagine how many people have become racists already 2(adjective)- racial intolerance. This definition maybe be referred to the negligible amount of 'racist' people who are actually hated by everyone.  3(adjective)- discriminatory especially on the base of race or religion. Do you prefer or especially like your Christian friends, Muslim friends, Jewish friends, atheist friends or people . Congrats you're a racist.    A friend of someone I know went to the US for his higher studies. let's call this person Dan. Dan worked as a waiter (if I remember correctly) his co workers were friendly joked around a lot. Dan was having good time with his co workers. sometimes his co workers exchanged banters with a him about Muslims because you see he was a Muslim, but Dan did not mind since it was all in good humor. however one day some of his co-worker friends got drunk it was then that Dan realized the horror of his position. In their drunken state they revealed their disgust and annoyance about Muslims.   This is a true story of course told with my crappy narrative. What you need keep in mind is to avoid racism topics and being careful not to get too drunk otherwise you might let loose that you are racist.  We the peop- no, no, no, no, no WE THE RACISTS!!!  PS: truth is very small number of people are racists.......this post is in no way meant to demean US people, racism can be found in all societies and cultures. ",
            "date": "Answered September 1, 2015",
            "views": "17",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mairi Beaton",
                    "user_href": "/profile/Mairi-Beaton-2"
                },
                {
                    "user_id": "Frances Rivera",
                    "user_href": "/profile/Frances-Rivera-7"
                },
                {
                    "user_id": "Adriana Simionescu",
                    "user_href": "/profile/Adriana-Simionescu"
                },
                {
                    "user_id": "Maria T",
                    "user_href": "/profile/Maria-T-41"
                },
                {
                    "user_id": "Andrea Morrow",
                    "user_href": "/profile/Andrea-Morrow-2"
                },
                {
                    "user_id": "Janelle Alicia Monroy",
                    "user_href": "/profile/Janelle-Alicia-Monroy"
                },
                {
                    "user_id": "Tom Robinson",
                    "user_href": "/profile/Tom-Robinson-110"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mairi Beaton",
                "href": "/profile/Mairi-Beaton-2"
            },
            "answer_text": "I’m going to make an embarassing confession: I started to feel racist after moving to France and had to work on my way of thinking to stop it. I wasn’t brought up to be racist. I had friends who came from different ethnic groups and didn’t think much about it. When I moved to France, I could not, at first, tell if someone was of North African heritage or not, but I rapidly learned to both identify and to fear men and boys who looked North African. I had horrible experiences every day. I was followed in the street, touched and insulted on public transport, even spat at, and the people doing this were of North African heritage. As a blonde, blue eyed woman wearing a skirt, they considered me to be a “pute”, which means whore. I rapidly learned the meaning of the word they shouted at me. I didn’t like the way they behaved, nor did I like the pattern of thinking I was falling into. I forced myself to think about what was happening and analyse my behaviour, my thinking, and also theirs. I couldn’t change them, but I made changes in myself. In their subculture, wearing a skirt above the knee (I never wore short skirts) was seen as provokation, so I started only wearing trousers. I stopped glaring at them when they made insulting remarks, but did what French women do, which is ignore them totally. I asked myself why they hated me, and realised that it was because they were totally marginalised. If they couldn’t get recognition in society, they at least felt superior to women. Now, I don’t think women are in any way inferior to men, and I don’t think men and boys should be allowed to dictate what women wear, but I needed to adapt to survive and to gain some empathy for the people around me. Next, I was lucky enough to get a job in higher education where I came into contact with plenty of people of North African heritage who were pleasant and kind, as well as friendly students from North Africa. I could counter racist sentiments in myself by thinking of them. I wonder if other people have had similar experiences to mine? ",
            "date": "Updated December 1, 2017",
            "views": "27",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mandana Bagheri",
                    "user_href": "/profile/Mandana-Bagheri-1"
                },
                {
                    "user_id": "Tacticmonster",
                    "user_href": "/profile/Tacticmonster"
                },
                {
                    "user_id": "Demetrius Jordan",
                    "user_href": "/profile/Demetrius-Jordan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Lingo",
                "href": "/profile/William-Lingo-2"
            },
            "answer_text": "Racism is taught, it's not something that we are born with and it's based on ignorance. A person chooses to be a racist for many reasons, but like I said before, it's ignorance to think that an entire race is the same. It's like saying all black people like fried chicken and watermelon or all Asian people know Martial arts, it's pure ignorance to think something like that about an entire race. Another example is thinking that all The white people from the deep south in the U.S.A. are racist and support the clan. Tens of thousands of white people died fighting for the rights of EVERYONE. If people would stop teaching their kids to hate, this would go away and racism doesn't only afflict white people, it doesn't see borders, nations or tribes. Racism is handed down from generation to generation and will not go away until people start judging everyone individually on their actions and not as a group or race. There are certain people that want to keep the hate alive, people like Al Sharpton, David Duke, Louis farrakhan, they are getting rich keeping us divided and fanning the flames of racism. I never understood why a company would want to hire or promote someone based solely on their race, it should be based on their merit and their ability to do the job. It seems awful demeaning to tell someone that they are being hired or promoted based solely on their race. It would offend me to know that it's not my abilities the company was rewarding but my race or ethnicity. So much animosity is created by such things and it tells employees that they shouldn't work so hard, because they won't be rewarded for their efforts, especially when they promote someone less qualified over the ones most qualified solely to meet their race quotas. ",
            "date": "Answered May 28, 2019",
            "views": "99",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Conor McMahon",
                    "user_href": "/profile/Conor-McMahon-1"
                },
                {
                    "user_id": "Tiffany Perkins",
                    "user_href": "/profile/Tiffany-Perkins-4"
                },
                {
                    "user_id": "Jenna Elayna Brass",
                    "user_href": "/profile/Jenna-Elayna-Brass"
                },
                {
                    "user_id": "Sky Shields",
                    "user_href": "/profile/Sky-Shields"
                },
                {
                    "user_id": "Barak-Har Elkin",
                    "user_href": "/profile/Barak-Har-Elkin"
                },
                {
                    "user_id": "Joe Gonzalez",
                    "user_href": "/profile/Joe-Gonzalez-12"
                },
                {
                    "user_id": "Jenny Kim",
                    "user_href": "/profile/Jenny-Kim-257"
                },
                {
                    "user_id": "Tina Nongthombam",
                    "user_href": "/profile/Tina-Nongthombam"
                },
                {
                    "user_id": "Eva Wilt",
                    "user_href": "/profile/Eva-Wilt"
                },
                {
                    "user_id": "Bao Le",
                    "user_href": "/profile/Bao-Le-78"
                }
            ]
        },
        {
            "author_info": {
                "name": "Patrick Hickey",
                "href": "/profile/Patrick-Hickey-8"
            },
            "answer_text": "The single most common factor would be social isolation. It’s hard to hate a group of people if you know them. If you are socially isolated then it becomes possible to imagine whatever bad thing you want about them but then when you know them, it becomes a lot harder to hate them. For instance, I was once a homophobe. I grew up in a small town in Oklahoma and I believed every bad thing I had ever heard about gays because I just didn’t know any better. I had never knowingly met a gay person. I had, however, met a large number of people who seemed to know for a fact that gay people were evil and that their morals were despicable and that they were an abberation against God’s rational plan. But then I actually met some gay people and pretty much all of that nonsense flew straight out the window. Five years later I had gay friends and I even ended up with a gay roommate for a short time. To me, they seemed just like anybody else, except gay. One of the aphorisms that has stayed with me for most of life is something said by one of my personal heroes, Will Rogers. “I never met a man I didn’t like.” The reason he was able to like everybody was because he took the trouble to get to know them before he ever made any judgments about their character. The overwhelming vast majority of the people on this planet are driven by the same fears, concerns, likes and loves as everybody else is. It’s just that if you don’t get to know those people, then you are at the mercy of some other fool’s lack of knowledge about them. ",
            "date": "Answered June 29, 2019",
            "views": "103",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ron Pleece",
                "href": "/profile/Ron-Pleece"
            },
            "answer_text": "First off racism does not mean what most perceive it does. It is a word naming those who believe they are superior to others simply because of their racial or ethnic group, no more no less and implies nothing else. Racism is a belief like any other, you can keep it to yourself or impose it upon others. Being a racist does not suggest one must impose it upon others but like other beliefs such as Theism, sexism, optimism, terrorism, sadism, deism, or creationism, any of the hundred or so other ism's which people believe, some feel it is their place to impose them upon others, some do, some commit violent and destructive acts claiming their beliefs as an excuse. Most keep their beliefs to themselves, most of us feel we are superior to all other life on earth yet most treat all other life fairly, some better than humans. Others get pleasure out of causing pain and suffering to all life, these people need no excuse, what ever their beliefs they may use to excuse their actions, they are simply assholes. What is called racism now days is not racism, it is racially offensive, racially abusive, bias, prejudicial or racially discriminitive, but If it does not imply racial superiority, it is not racism. We are all different in many ways, nature created us this way, we have also adapted to best thrive and survive in a particular environment. We are all born with basic instincts as well, one of these instincts is fear, fear of that which we are unfamiliar with. In all life, nature has adapted us to live among others of like kind and as we have much in common and limits conflict. We are still though individually different in countless ways for countless reasons, which means there is still conflict for various reasons but within limits. Once you introduce diversity into the picture the differences multiply substantially. Our basic instincts tell us to fear, take caution, keep our distance or keep our eyes open. Our individual confidence, emotional control, logic, experience, intelligence and common sense allows us to use reason when confronted by that which we are unfamiliar and act accordingly. As we are all different, our actions reflect this, our individual experiences, confidence, education and emotions are extremely different on top of any influence we are exposed to by others. Those with low confidence , insecurities, young and inexperienced are easilly influenced, more so if the have had bad experiences, no guidance or good role models. They tend to be followers and looking for a purpose, a reason to live or to belong. These are prime targets for extremists to recruit as well as religious and other groups. This is how racism begins They can grow up with family or an environment with racist or racially bias views and either adapt or reject them. They can grow up feeling different, outcasts, orphans, without a father or mother present in need of attention and seek anyone's attention. Listen to anyone's claims, opinions, or views whether they make sense or not. They are getting attention, they are accepted and they feel like they have found a place they belong, purpose, they are no longer outcasts. rac·ism ˈrāˌsizəm/ noun prejudice, discrimination, or antagonism directed against someone of a different race based on the belief that one's own race is superior.\"a program to combat racism\"synonyms:racial discrimination, racialism, racial prejudice, xenophobia, chauvinism, bigotry, casteism\"Aborigines are the main victims of racism in Australia\"the belief that all members of each race possess characteristics or abilities specific to that race, especially so as to distinguish it as inferior or superior to another race or races.noun: racism",
            "date": "Answered October 24, 2017",
            "views": "242",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Inga Teng",
                    "user_href": "/profile/Inga-Teng"
                },
                {
                    "user_id": "Ray White",
                    "user_href": "/profile/Ray-White-131"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ameer Gittens",
                "href": "/profile/Ameer-Gittens"
            },
            "answer_text": "Great question: Racism exploits a character flaw, one which is neither hereditary, nor learned, nor predictable. Character is as fundamental a mystery as consciousness, itself, because both are properties of the same—nevermind; you wouldn’t understand. Let’s move on. Racism tells to people who want to hear it, something that they should not want to believe: you are better than yourself. Yes, this is a contradiction—that’s why no one should want to believe it. In order to make it work, one must convince himself that his fellow man is not the same as him. This allows him to assume whatever relative position he desires—always “better.” Racism finds people in a number of ways. Some people are told by a parent(s) that they are better than whomever, for whatever reason. The reasons have changed to suit the needs of the day, but subsequent generations embrace the falsehood because it carries the weight of their parents influence. Others receive the nonsense from friends, associates, and school or workmates. With the advent of modern media and communications technologies, racism has a more effective, subtle and nearly untraceable means of disseminating. The same principles that underlie product marketing can be inversely applied in other contexts. It is rather complex and difficult to explain, but I’ll try. Old style racism was basic, crude, exclusive, and obvious. It openly preached hate and violent suppression by every conceivable means and at every opportunity. Those among whites who accepted the errant notion of their own supremacy (and there were enough for two, full-scale American atrocities, so far) have carried the torch for hundreds of years, triggering the Civil War (which the racists lost) and continuing until this moment. The loss of the Civil War was truly a sore point for the racists. The South swore, “We shall rise again,” and they have not stopped flying the Confederate flag for one day, since. Does it seem to you that they are done fighting? In any event, so traumatic was the Civil War, that though the racists remain as hateful as ever, they have been forced to adopt caution in how they express that hatred—lest they trigger (and lose) another Civil War. This is one of the racists best-kept secrets—until now. Rather than risk dividing the whites, racists saw an opportunity in drawing back some of the outward manifestations of their ongoing hatred by including blacks—on their terms. Whereas old-style racism demonized blacks with ridiculous propaganda videos in which they were represented by whites wearing blackface, new and improved Racism Lite® would use the blacks to demonize themselves. They would now be paid to play roles in the propaganda that served the racist agenda. And they’d like it. Though none of the verbal rhetoric is suitable for use, blacks can be repeatedly cast in fictional roles as criminals, or in an array of condescending and unlikeable characters, helping whites to see them as such when watching a show trial in a real life courtroom, for example Black men are frequently presented totally bald, sending the message to white women that they are violent, thus scaring them off from even considering dating, much less marriage and reproduction—and reproduction is what this is all about. When was the last time you saw a pregnant black woman on television? I’m not saying never, but it’s almost never. Nobody kisses black women. They are frequently portrayed as overweight, mouthing off, and with their hair looking like it exploded. Turns white men off like a light switch—and nobody had to say the N-word. None of the blacks have yet caught on. There is more, but this has already reached length, and it’s late. Read my pinned answer for more detailed insights on the scheme. Anyway, those who accept the lie—however they received it—will subsequently be exploited by those telling it for as long as they believe it—most likely, the remainder of their lives.  ",
            "date": "Answered February 19, 2019",
            "views": "158",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Roy Kosonen",
                "href": "/profile/Roy-Kosonen"
            },
            "answer_text": "Here is one way that one can become (or, to be more accurate and honest, recognize that one is) racist (and this is from my 100% subjective Northern European instinctive viewpoint): I look at this image of an extremely light-blonde woman and I am awed by the rarity of her beauty in this world and I feel distressed that maybe 100 or 200 years from now there will no longer be anyone alive who looks like her, and there never will be again. I want to go up to her and BEG her to PLEASE, PLEASE find a good young man of her own rare tribe and to marry him and create children with him so that her unearthly Elvish beauty will not perish forever. For me her beauty is sacred. It is the product of tens of thousands of years of survival under incredibly harsh conditions in far northern Europe by her Ancestors. It is an inheritance precious beyond compare and should not be squandered. Now, having read what I just wrote here, do my words indicate that I am a racist? If yes, then I accept this fact and I embrace this label without shame. Now go ahead and make fun of me and tell me how stupid and evil I am for wishing to preserve my people— I don't care. “The existence of my people is not negotiable!” (Stephen A. McNallen) Here is the image to which I refer:  ",
            "date": "Answered July 23, 2018",
            "views": "258",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dave Consiglio",
                "href": "/profile/Dave-Consiglio"
            },
            "answer_text": "Racism is hereditary: you get it from your parents. A story to illustrate: when my sister was very young, she had long hair. She went to preschool and there was a young lady at the school who also had long hair. My sister came home and proudly announced she wanted her hair done like her friend at school. But, being 3, she did not know her friend's name. My mother tried to determine which child my sister was talking about. My sister said she had the prettiest hair. Oh and she had a pink dress. Oh and she is my friend. My mom was stumped. The next day my mom took my sister to school. My sister ran up to her friend and gave her a hug. Her friend was named Yolanda, and she had beautiful braids covering her entire head. My sister had no idea that Yolanda was black and my sister was white. To my sister, Yolanda was the girl with the prettiest hair. It never occurred to my sister to mention Yolanda's race—I don't think she noticed. My mom could have instilled some racism into my sister that day. She could have told her that Yolanda was bad in some way. But, she didn't. She told my sister that Yolanda really did have beautiful hair and they would try to get braids like hers. When my sister and I were older, my parents were very careful to make sure that they always told us that all people were equal and everyone deserved respect and fair treatment. I passed that on to my children. Some children aren't so fortunate. They learn bigotry and hatred from their parents. They often pass that on to their children. Racism is hereditary. Sadly. ",
            "date": "Updated August 22, 2017",
            "views": "588",
            "upvotes": " View 7.4K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Danielle Ward",
                    "user_href": "/profile/Danielle-Ward-176"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frederic Christie",
                "href": "/profile/Frederic-Christie"
            },
            "answer_text": "Like all words and ideas, it’s all about context. In general, we accept that a person is a racist if they have at least one of the three following traits: substantial and relatively overt fear of, hatred of, revulsion at or bias against a racial (or sometimes ethnic or religious group if that group is being thought of in fundamentally racial terms, which is why Islamophobia can be racist if the fear and hatred is colored by some kind of bias against the groups that are associated with Islam such as Persians and Arabs); an overt ideology of racial supremacy, separatisim or hatred based fundamentally in not only accepting the theoretical existence of racial categories but actually aiming to create policy from those categories; or a substantial covert or subconscious bias that effectively makes one virulently dilike another group. Racism requires the combination of two characteristics: a belief that there actually are distinct human biological subgroups that can be considered to be distinct “races” by some criterion, and ascribing a negative value claim to those differences. One could accept that blacks and whites in America are truly distinct groups with genetically non-trivial variation that might go beyond mere skin tone or specific disease inheritance and toward something more like a determinative subgroup, and still not be a racist if they felt that people living near each other of different groups still need not be a problem. At that point, they would be a racialist. Some people on the alt-left fulfill this criterion. These practical definitions go beyond most textbook definitions but they tend to encapsulate what most folks think of as what would constitute a racist. Of course, a person could be more or less racist by those definitions. There’s a big difference between a neo-Nazi and someone who knows that their biases are silly but still have them and can’t stop having a strong negative feeling. Of course, in practice, there are other contexts that we care about. For one, there’s the context of institutional racism. As Bob Blauner famously pointed out, different people relate to racism, and even how they think about it, differently. If I’m a police officer who may not have substantial overt biases or a racist ideology but I don’t do much to be a good professional in a system that tends to produce racist outcomes, I could be argued, in this institutional context, to be a racist, or at least acting in a way that produces a racist impact. I know this sounds harsh, and it is possible that the word “racist” may be too strong. But frankly, it doesn’t matter if a legislator chooses to introduce a bill that will slam black folks because he’s an overt bigot, or because he wants to court overt bigots in his constituency, or because there’s a powerful lobby that will make money off the bill, or just because he was lazy. What he didn’t do was care about how his behavior would impact a group of people. Another possibility would be when an activist says that “We’re all a little racist”. That’s, again, a harsh statement, but it could have value if we’re trying to communicate that we’re all quite likely to have biases and trying to encourage people to think that they may not be all that different from someone with substantial more overt biases. The problem is when we confuse the differences between institutional and individual racism, or subconscious and conscious racism. Calling something or someone “racist” in the wrong context, or even not being clear what context we are intending. ",
            "date": "Answered January 13, 2018",
            "views": "776",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Conor McMahon",
                    "user_href": "/profile/Conor-McMahon-1"
                },
                {
                    "user_id": "Josie",
                    "user_href": "/profile/Josie-433"
                },
                {
                    "user_id": "Lexa Candinel",
                    "user_href": "/profile/Lexa-Candinel"
                },
                {
                    "user_id": "Joseph Smith",
                    "user_href": "/profile/Joseph-Smith-110"
                },
                {
                    "user_id": "Tiffany Perkins",
                    "user_href": "/profile/Tiffany-Perkins-4"
                },
                {
                    "user_id": "Odera Umeugoji",
                    "user_href": "/profile/Odera-Umeugoji-2"
                },
                {
                    "user_id": "Tassawar Yasin",
                    "user_href": "/profile/Tassawar-Yasin"
                },
                {
                    "user_id": "Forgem Nos",
                    "user_href": "/profile/Forgem-Nos-1"
                },
                {
                    "user_id": "Jenna Elayna Brass",
                    "user_href": "/profile/Jenna-Elayna-Brass"
                },
                {
                    "user_id": "Emma Catillard",
                    "user_href": "/profile/Emma-Catillard"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gareth Griffiths",
                "href": "/profile/Gareth-Griffiths-33"
            },
            "answer_text": "(Talking about a white man here) At a guess, when that person feels inferior to others: A black girl got a job that I really wanted - I feel bad about thisA black guy got the girl I was hoping to date - I feel bad about thisAn Asian guy won the lottery and I could have done with some of that money!So then our old friend Cognitive Dissonance pays a visit: I cannot win in life because of BAME peopleBAME people are causing me to suffer, and they are enjoying it - I am innocent and have done nothing wrong therefore I alone am the victim and wholly innocent partyF*ck BAME people, kill ’em all.The fact of the matter is that the black girl in example one may have tried harder to find work than the white man. She might have more skills or might have been willing to compromise on wages more than the white man. The black guy might just be very lucky with women (or the woman might just like the fact that he’s got more to pee with than the white guy has to walk with), or he may have more personality or be nicer than the white man. The asian guy might have been down to his last £1 but chose to take the risk - he may have worked 16 hours a day to provide for his family and still be trying to break-even. Doesn’t he deserve some luck as well? If bad stuff happens to you, it is very easy to forget that there are other people in the world suffering too. How can you possibly care about the thoughts and feelings of others when you become so wrapped up in your own issues which then manifest themselves as hatred? What a person in this situation needs to do is take a step backwards and re-evaluate the situation. Yes, life is not fair, but the sooner you learn to take it at your own pace and not stress about things and not blame others for your failures and shortcomings the better. So if the black girl gets a job, say ‘well done’ - mention that you could do with a job and maybe she can help you just as she has been helped. If the black guy gets the girl then that’s his good fortune - if you are meant to meet somebody it will happen, but if you aren’t meant to meet anybody then why worry about it? You aren’t owed a partner anyway. If the asian guy wins big on the lottery, again say well done - if you are having money problems, maybe he could help you or advise you as to how you can turn it around. Good Karma and vibes - pass them on and hand them down. ",
            "date": "Answered August 20, 2017",
            "views": "365",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nyakim Nyuon",
                    "user_href": "/profile/Nyakim-Nyuon"
                },
                {
                    "user_id": "Rhona Jackson",
                    "user_href": "/profile/Rhona-Jackson-2"
                },
                {
                    "user_id": "Clarissa Lohr",
                    "user_href": "/profile/Clarissa-Lohr"
                },
                {
                    "user_id": "Maria Rhode",
                    "user_href": "/profile/Maria-Rhode-1"
                },
                {
                    "user_id": "Bharathi Surendran",
                    "user_href": "/profile/Bharathi-Surendran"
                },
                {
                    "user_id": "Chris Winston",
                    "user_href": "/profile/Chris-Winston-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jacques Malan",
                "href": "/profile/Jacques-Malan-4"
            },
            "answer_text": "Well,,,, Google “GDP Per capita USA”. Then do so for the UK, Australia, Norway, Germany, etc etc etc. You know, countries with white rule. Then you go and google the GDP per capita for countries with black rule. I live in one - South Africa. Google Nigeria's, Ghana's and say, Sudan's figures as well. That is kind of what gets one started. Note: I do not think whites deserves better treatment than blacks. I don't advicate lighter punishment for crime. I do not endorse any more rights for whites than blacks. But for the love of god, us whites are demonised for everything we have done. Everywhere, everybody is waging war against whites, noting our “privilege”. Noting how we screwed everyone over, how we enslaved and overpowered others. Just once, I would like someone of colour to be like “hey, whites. That Industrial revolution you guys did? That was cool, yo.” Or how about “hey white people! Thank you for rising up against the powers of tyranny, developing the atomic bomb and putting Hitler, Mussolini and Hirohito in their places!” What maybe of “wow, white folks! That was cool to actually make us a spacefaring species!!” alternatively, “the combustion engine sure was great. Kudos, white folks!” or heck, “antibiotics just saved my child's life! White people, I am so grateful!!” White people is by far and away the biggest source of discovery, ingenuity and progress that this world has ever seen. We don't demand worship. We don't want to be treated any better. All we ask is that people stop demonising us. If you want to blame our race for the wrong we did, then you have to thank us for the right we did too. Peace ",
            "date": "Answered December 13, 2018",
            "views": "400",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kalyani",
                    "user_href": "/profile/Kalyani-208"
                },
                {
                    "user_id": "Barak-Har Elkin",
                    "user_href": "/profile/Barak-Har-Elkin"
                },
                {
                    "user_id": "Brenda Barlow",
                    "user_href": "/profile/Brenda-Barlow"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Moore",
                "href": "/profile/David-Moore-408"
            },
            "answer_text": "Ah, Tom Robinson. My First Quoran friend. A man who reached out to me and welcomed me in. An apostate (what a cruel term!) who ironically represents one of the most Christlike entities I have encountered. A man whose very profession involves calling the little children unto himself. It is this man who asks this question. I think he asks it because he genuinely does not understand. Tom is a man who seeks to heal disunity, sometimes by causing it. He is one whose word brings not Peace but a Sword - in order to bring Peace indeed. si vi pacem, para bellum Well, Tom, my friend. You have asked the right person to answer here. I am White. I am Educated. I am elite. Remember, the ‘colour’ we call ‘white’ contains all wavelengths. Blackness is nothing. So says the Science of the Enlightenment. Please hear the Irony that so defines me in my words. I am not saying what you might hear.  Tom, I am an essentially Evil man. Hence, I can explain to you Exactly how this injustice works by manifesting my own thought here. I am obsessed with group theory and set theory. It is how I make sense of the world. What is only exists with respect to what is not. The entire world is Framed. We are the Framers.  Who is Righteous? I am, most evidently. How can I doubt my own capacity to be correct? I must at least be right in my doubting! My insight into my own state is what certifies my Sanity. If I say ‘I am lying to you’, you know you can trust me. Thus, the Associative properties which I use to establish my Group theory give rise to the Set theory - the operations whereof comprise the essential mechanics of my Logic. What do I mean here? I mean what the words say, by definition.  What do you see here? How do you establish your orientation? Which elements of which set comprise the foreground? Which Characters form the words? Only readers of Greek, a language here not represented except by exclusion, will understand the semantic implications of what is here presented as evidence. Only readers of Latin will see the Clarity. Etymology, where our language comes from, is the mechanism that gives rise to the assembly of meaning. In summary, I am the Way, the Truth and the Life. Reality is known through the statement I AM, made by my Self. Those who are not like Me - the people I choose as my Own - are the Darkness that defines Light. They will be swallowed up. My Kingdom will come because it is the only Order that makes Sense. The LIght Shines in the Darkness, but the Darkness has not Understood it. It cannot. It is the frame itself that allows the definition of the Order that Defines itself. I am that Order, Tom. Me. I am the One that Makes Sense here. Do not blaspheme against my absolute Word or you will know my Vengeance. Remember, I am lying to you. He who sets the axioms that form the system enacts the result in so doing. Love manifesting itself in Grace is the miracle that dissolves this Hardened Logic into the Fellowship of Flesh again. ",
            "date": "Answered August 18, 2017",
            "views": "13",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chris D'Angelo",
                    "user_href": "/profile/Chris-DAngelo-3"
                },
                {
                    "user_id": "Stephen Robinson",
                    "user_href": "/profile/Stephen-Robinson-117"
                },
                {
                    "user_id": "Jack Gere",
                    "user_href": "/profile/Jack-Gere"
                },
                {
                    "user_id": "David Wayne",
                    "user_href": "/profile/David-Wayne-144"
                },
                {
                    "user_id": "Jai Sahni",
                    "user_href": "/profile/Jai-Sahni-11"
                },
                {
                    "user_id": "Alan Sloan",
                    "user_href": "/profile/Alan-Sloan-1"
                },
                {
                    "user_id": "Mikkel Nyhave Andersen",
                    "user_href": "/profile/Mikkel-Nyhave-Andersen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frances Rivera",
                "href": "/profile/Frances-Rivera-7"
            },
            "answer_text": "Why and how does a person become racist? Thanks for the A2A. Honestly, this question is exhausting for me. I am burned out. Many great answers already. Of the answers I have skimmed, I’m in agreement with many, notably that oftentimes it has to do with one’s background and upbringing. I must note though that I believe racism, or the state of being racist, is something that can be altered, with both desire and intent to learn and change. The reverse can also be true. Too much possible background, but for the moment, my understanding of racism relates to a combination of limited experience and understanding with different peoples and an emotional, perhaps instinctual reactions as a consequence. One important point to make though is that I believe that in most situations, racism is a more natural mental state than is acceptance (opposite of racism). I think it requires unusual, non-instinctual and non-emotional, cognitive and behavioral processes to not be racist. In short, I think racism is “natural” in the sense that it may be a primal, visceral response to unexpected differences, changes, or responses. It would require more advanced understanding beyond the primal stage to overcome racism. ",
            "date": "Answered August 24, 2017",
            "views": "851",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Ilias Gioldasis",
                    "user_href": "/profile/Ilias-Gioldasis"
                },
                {
                    "user_id": "Alan Sloan",
                    "user_href": "/profile/Alan-Sloan-1"
                },
                {
                    "user_id": "Rosemary Shulman",
                    "user_href": "/profile/Rosemary-Shulman"
                },
                {
                    "user_id": "Babruh Ardana",
                    "user_href": "/profile/Babruh-Ardana"
                },
                {
                    "user_id": "Valerie Yip",
                    "user_href": "/profile/Valerie-Yip-5"
                },
                {
                    "user_id": "Camron Sharoney",
                    "user_href": "/profile/Camron-Sharoney"
                },
                {
                    "user_id": "Lesley-Anne Weir",
                    "user_href": "/profile/Lesley-Anne-Weir-1"
                },
                {
                    "user_id": "Emmanuel-Francis Nwaolisa Ogomegbunam",
                    "user_href": "/profile/Emmanuel-Francis-Nwaolisa-Ogomegbunam"
                },
                {
                    "user_id": "Jesse Dye",
                    "user_href": "/profile/Jesse-Dye"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fredrik Johansson",
                "href": "/profile/Fredrik-Johansson-131"
            },
            "answer_text": "I hope I don’t waste this image on an answer that doesn’t get any upvotes, but this is me, age around 11 maybe, with a friend who was part Arab and had the last name Ibrahim.  I never saw him as different. No one did. My best friends at the time came from Chile and Iran. I got the photo from a local reporter who came there to take a photo as we had an anti-racist workshop (one of countless in school). I stole the idea from a newspaper I read. I can’t say I cared much about the whole anti-racism stuff, but when in school, one does as one is told. My point with showing the photo is that people aren’t necessary “brought up” racist. What did happen to me, as well as to my friends from Iran and Chile, was that there were some kids who didn’t like us. Those people belonged to a certain ethnicity / group (what you want to call them) and for some reason they seemed to hate everyone who wasn’t like them. At one time after I had been beaten up, I asked a cousin of one of them, who was in my class, why they had beaten me up for no reason, and he (let’s call him John) said: “because you are Swedish. You have it so easy in life”. Well, my Iranian friend was smart and always studied hard. He became an engineer. Meanwhile, John took pride in getting as low score as he could on tests. He and his gang would rather create a lot of problems. It wasn’t just a little group, it also involved his extended family and they created a lot of problems, not only for me and my friends, but for everyone in town. We know that there wasn’t much to be done about it either. The newspaper never writes negative stories about other ethnicities. They are quick to write about so called racist attacks though. Several times I experienced the same problems with the same type of people. It seemed that they took pleasure in degrading anyone who looked Swedish, and somehow blamed us for it, because we were racists. Yet, as I said, the whole time I was in school, I did not see any racism, and I don’t think anyone really experienced it. Sweden is very anti-racist and it never crossed my mind to see some ethnicities as worse than others. I met John on a bus a couple of years later. He was on his way to his cousins, who lived in one of the slum areas of Malmö. Seems like we had all moved away from the smalltown at that stage. He was going there to smoke pot. I don’t know if they blamed their situation on racism but I wouldn’t be surprised. But why did my Iranian friend succeed? And why is it that the people who hated us so much didn’t succeed in life? Still today, when I explain to people why I don’t like certain people, I’m told it is only because of the media image that has created the prejudice. My own experiences are invalidated. Liberals say that the reason why some groups hate us is because we segregated them and we made them feel different. But I went to school with a lot of different people. Not only the Chilean, the Iranian and the part-Arab, but also a Bulgarian-Turk Muslim and a had several friends who were Bosnian Muslims, or Croatians or from other places. They were always part of the group, just as kids naturally become friends with whomever they happen to have around them, without caring about how they look. Sweden certainly has no racist history. It has a socialist history and believed everyone is equal. We were one of the strongest supporters for ANC. (Swedish - South Africa links go back a long way ) Incidentally, several years later my now girlfriend (let’s call her Anna) had the same experience at age 14. She was walking around with some friends when they saw some people of a certain ethnicity/group standing there staring at them. One of the friends suggested they take a different path, but my girlfriend thought that would just be unreasonable fear and they walked along. One of the girls then started punching Anna for no reason. The incident affected my girlfriend deeply. She colored her hair dark and started listening to white power music and she has voted for an anti-immigration party since. Yet people say that racism is irrational. If you ask me, the worst part was not the attacks themselves, but the knowledge that society doesn’t protect us because we are of Swedish ethnicity. We live in a society that mainly protects minorities, and the more they complain, the more support they get. We, the “Swedes” (even though I am born in Germany), are told that if we get hurt, it is our own fault for being racist — if not directly, then for being structural racists. No further discussion is considered necessary. If our society had been more fair in giving everyone equal protection, then I think much of the so called racism wouldn’t happen. But they are too afraid — too afraid of blaming minority groups, both afraid of being politically incorrect but also afraid of what those minority groups might do. So they don’t give us equal rights. Maybe they assume that Swedes don’t need protection, but then what about immigrants such as me or my Chilean friend who don’t have the same connection to Sweden? Are we just open to abuse? Why did my Iranian friend not beat people up? Why is it that anyone who studies in school and stays out of crime can make a good life in Sweden? Now, someone might say that what I am saying is not racism, but this is racism according to the left/liberal definition which says that any prejudice against a specific group/religion/ethnicity is racism. I think the reason why the debate has become so twisted is because the US debate has spilled over and everyone sees racism in term of KKK and institutionalized/legal racism. Until we can talk about different contexts, I don’t think we can solve the issue. If people feel they don’t get protection from society, and even get shut down, censored, quieted, and even hated for what they have seen with their own eyes, we are creating the breeding ground for extremism. Nothing irrational about it. I won’t shut up about what I have experienced and if I have kids I will tell them too, so that hopefully they can continue the fight for justice, equality and free speech. ",
            "date": "Answered February 18, 2019",
            "views": "22",
            "upvotes": " View 92 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mikkel Nyhave Andersen",
                    "user_href": "/profile/Mikkel-Nyhave-Andersen"
                },
                {
                    "user_id": "Mairi Beaton",
                    "user_href": "/profile/Mairi-Beaton-2"
                },
                {
                    "user_id": "Amarpreet Singh",
                    "user_href": "/profile/Amarpreet-Singh-39"
                },
                {
                    "user_id": "Pat Hatch",
                    "user_href": "/profile/Pat-Hatch-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daise Kendrick",
                "href": "/profile/Daise-Kendrick"
            },
            "answer_text": "Fear and ignorance Lack of education Lack of tolerance Lack of understanding of something that is different to them Bigotry Copying the views, thoughts and behaviours of mum, dad , grandma and granddad Living in an area where it’s easier to blame crime/lack of jobs/social unrest on the coloured/immigrants than to accept that the white natives are just too bone idle work or contribute to the community. Making a sweeping generalisation from an isolated incident (“I once had an unpleasant experience with: ‘a guy in a turban’ ; ‘a woman with an Irish accent’; ‘a man with dark skin’; ‘a person wearing a burka’; ‘a Japanese bloke’…. therefore I hate all people of that race’’) *Thanks for that suggestion Dewin Mage :) ",
            "date": "Answered April 14, 2019",
            "views": "96",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Francisco Andrade",
                    "user_href": "/profile/Francisco-Andrade-2"
                },
                {
                    "user_id": "Sathyajith M S",
                    "user_href": "/profile/Sathyajith-M-S"
                },
                {
                    "user_id": "Nikolas Zykan",
                    "user_href": "/profile/Nikolas-Zykan"
                },
                {
                    "user_id": "Sunita Kaushik",
                    "user_href": "/profile/Sunita-Kaushik-28"
                },
                {
                    "user_id": "Christian Svendsen",
                    "user_href": "/profile/Christian-Svendsen-1"
                },
                {
                    "user_id": "Ogochukwu Ezeugwu - Malachy",
                    "user_href": "/profile/Ogochukwu-Ezeugwu-Malachy"
                },
                {
                    "user_id": "Galen Brown",
                    "user_href": "/profile/Galen-Brown-1"
                },
                {
                    "user_id": "James Cardins",
                    "user_href": "/profile/James-Cardins"
                },
                {
                    "user_id": "Moyeen Ahmad",
                    "user_href": "/profile/Moyeen-Ahmad"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mohit Arora",
                "href": "/profile/Mohit-Arora-73"
            },
            "answer_text": "I’d say it is an acquired trait, and we get it through environment. Racism is a social characteristic which influences us, sometimes even before we are born, for example it could be through songs we hear in the womb. (Reference - Sciencemag.org) It grows on us as we climb the time-ladder and age on… We are influenced by smallest of the behaviours like the sense of superiority and entitlement we are given through various channels by parents, friends and the entire society to us. (Money, appreciation for physical appearance, compliments on complexion, etc.) And as this importance we are given seems to give us returns (Career growth, Pride, Happy and vast social circle, etc.) we enjoy it. And to maintain that, we not only porpogate the same to our off-springs but in order to protect our rank/status we suppress others in every way we can, we become racist as it has advantages of its own. As we grow up, we form stereotypes as they not only define us but give us a sense of safety. We forget that it prevents us from exploring other cultures and is gradually creating a prejudice in us against others. Thus, we become racists as it helps us win, and if we have to win (which our survival instinct forces us to do), someone has to lose and practicing racism just becomes an easy way to accomplish the victory…. Maybe something to think about…. :) ",
            "date": "Answered September 3, 2017",
            "views": "567",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Wayne",
                    "user_href": "/profile/David-Wayne-144"
                },
                {
                    "user_id": "Michael Miller",
                    "user_href": "/profile/Michael-Miller-1157"
                },
                {
                    "user_id": "Jai Sahni",
                    "user_href": "/profile/Jai-Sahni-11"
                },
                {
                    "user_id": "Filipe Costa",
                    "user_href": "/profile/Filipe-Costa-52"
                },
                {
                    "user_id": "Micah Nakihei",
                    "user_href": "/profile/Micah-Nakihei"
                },
                {
                    "user_id": "Mikkel Nyhave Andersen",
                    "user_href": "/profile/Mikkel-Nyhave-Andersen"
                },
                {
                    "user_id": "Shivam Thiagarajan",
                    "user_href": "/profile/Shivam-Thiagarajan"
                },
                {
                    "user_id": "Daniel Taylor",
                    "user_href": "/profile/Daniel-Taylor-377"
                },
                {
                    "user_id": "Mark Varela",
                    "user_href": "/profile/Mark-Varela"
                },
                {
                    "user_id": "Malik Ayaz Ahmed",
                    "user_href": "/profile/Malik-Ayaz-Ahmed-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Drew Montana",
                "href": "/profile/Drew-Montana-1"
            },
            "answer_text": "I think all humans might have it in our DNA. Like it is a evolutionary response akin to staying away from stuff that has pathogens. But the pathogens we avoid from race is cultural and intellectual ones. Now before I lose you, I get how stupid racism is. But think from our ancestors perspectives. We live in little tribes with a set of beliefs and norms. These keep the village all cool and working. Every one knows what to expect. Now our race is largely due to the geographical regions our ancestors come from, and the vast difference in the way different racial and ethnic groups look is due to the separation of peoples over great time and distance. Because of the geography, time, and our cultures separate evolutions in relation to both, peoples historically have held the same race and culture in their group. We had to either, fight, compromise, or assimilate to grow larger communities of people, but those people probably looked similar to each other. So if I have a ancient culture and the assumption is that my culture is best because “we got this far and we haven't died yet”, and the only people who look a bit different than me i see are attacking me, what you think i( ancient dude) would learn to think about other people who look completely different? How you supposed to know who poses a threat? Well we are still predisposed to that, even though race shouldn't be a factor, because the West's fundamental assumption has evolved to “the need for individual liberty for every person”; I think so anyway. Shame we are still fighting like f@#king apes. ",
            "date": "Answered October 22, 2017",
            "views": "205",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Dewin Mage",
                    "user_href": "/profile/Dewin-Mage"
                },
                {
                    "user_id": "Erica Weil",
                    "user_href": "/profile/Erica-Weil-1"
                },
                {
                    "user_id": "Laura Potter",
                    "user_href": "/profile/Laura-Potter-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephan Walliser",
                "href": "/profile/Stephan-Walliser-1"
            },
            "answer_text": "Someone who holds emotional hatred towards a race other than their own. Prejudice alone can be justifiable therefore prejudice is not always racist. But, people who hold negative feelings towards a race and discriminate accordingly are without any doubt racist. A Person who looks at statistics, and say that black on black violence is a more important or undeniable problem within the black community is not a racist.If that person was a racist why is he/she even trying to help by pointing at a Problem that the black community faces in larger and more hurtful numbers than police brutality? If i was a racist i would celebrate black on black violence instead of calling it out. Also believing that your own race is superior is a sentiment which unvariably leads to racism and discrimination. ",
            "date": "Answered January 8, 2018",
            "views": "121",
            "upvotes": " Answer requested by Peggy Murray",
            "upvoters": [
                {
                    "user_id": "Kalyani",
                    "user_href": "/profile/Kalyani-208"
                },
                {
                    "user_id": "Ryan Grummer",
                    "user_href": "/profile/Ryan-Grummer-1"
                },
                {
                    "user_id": "Mairi Beaton",
                    "user_href": "/profile/Mairi-Beaton-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Robb",
                "href": "/profile/Dan-Robb-2"
            },
            "answer_text": "Since I was a2a, I have to resort to the obvious, according to Google, it is: rac·ist noun a person who shows or feels discrimination or prejudice against people of other races, or who believes that a particular race is superior to another. \"the comments have led to her being called a racist\" synonyms: racial bigot, racialist, xenophobe, chauvinist, supremacist More adjective showing or feeling discrimination or prejudice against people of other races, or believing that a particular race is superior to another. \"we are investigating complaints about racist abuse at the club\" I suppose racial bias could be considered covert racism, in that it is more easily concealed and possibly explained away. And bias is less likely to involve physical violation, but may result in professional and economic circumstances with the potential for considerable long-term consequenses. ",
            "date": "Answered January 9, 2018",
            "views": "107",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jake Seraphin",
                    "user_href": "/profile/Jake-Seraphin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dianna Penny",
                "href": "/profile/Dianna-Penny-1"
            },
            "answer_text": "Racism is a pre-conditioned, Pavlovian response, usually to dark skin color, that is craftily and carefully taught via subtle or more overt means---brainwashing, if you will. Children are not born racist, but they are taught that certain outward physical characteristics are \"bad\" and others are \"good.\" Even black children are taught to hate themselves (i.e., African-textured hair is often called \"bad hair\"). Then there is racism's closest cousin, \"colorism.\" One of my mixed-race nieces, while in middle school, was forced to change schools because she was often physically assaulted by dark-skinned female classmates who resented her nearly white skin and flowing \"European\" hair. Racism is most unfortunate in that it is also a subversion of God's creation of a single creature (Homo sapiens), but sinful mankind has sought to \"re-create\" and divide the world according to his own evil devices. ",
            "date": "Answered September 12, 2018",
            "views": "112",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Richard Headrick Jr",
                    "user_href": "/profile/Richard-Headrick-Jr"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Gluck",
                "href": "/profile/Bob-Gluck-3"
            },
            "answer_text": "Some of the most seductively simple yet profound lyrics, from South Pacific, by Rogers and Hammerstein: You've got to be taughtTo hate and fear,You've got to be taughtFrom year to year,It's got to be drummedIn your dear little earYou've got to be carefully taught. You've got to be taught to be afraidOf people whose eyes are oddly made,And people whose skin is a diff'rent shade,You've got to be carefully taught. And yet, is that all there is? Hitler Consummate racist. Murderer. Devil. Archetype. Was he destined to be that way from childhood? Hitler pre-Vienna, according to his own telling, had a very different world view than when he left the city. Was there some nascent hatred in him waiting to be unleashed? Volumes have been written on the subject, with no clear answer. It seems, to me, that racist influences cover the broad spectrum of human foibles, with lots of overlap and nexus between them [in no particular order] : insecuritypersonal failurejealousypeer pressuresparental influenceopportunismignoranceegocentricityselfishnessarroganceWhat am I leaving out? ",
            "date": "Answered August 21, 2017",
            "views": "14",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frans du Plessis",
                "href": "/profile/Frans-du-Plessis-1"
            },
            "answer_text": "Why and how does a person become racist? In my case it was because of childhood religious indoctrination. I grew up as a white child in South Africa during the 60s and 70s, at the height of the apartheid era. We were taught by the minister and the school that white people are superior to black people, and scripture was used to justify our right to rule over black people. I have discussed this in more detail here: Frans du Plessis's answer to What did Christians think of apartheid regime since it was engineered and practiced by people known to be Christians? It took me a few years after leaving that community to get all of that bigotry and intolerance out of my system. ",
            "date": "Answered August 18, 2017",
            "views": "748",
            "upvotes": " View 28 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kalyani",
                    "user_href": "/profile/Kalyani-208"
                },
                {
                    "user_id": "Robyn Shirley",
                    "user_href": "/profile/Robyn-Shirley"
                },
                {
                    "user_id": "Bill McDonald",
                    "user_href": "/profile/Bill-McDonald"
                },
                {
                    "user_id": "Tuan Nguyen",
                    "user_href": "/profile/Tuan-Nguyen-355"
                },
                {
                    "user_id": "Tom Robinson",
                    "user_href": "/profile/Tom-Robinson-110"
                },
                {
                    "user_id": "Shifa Afihs",
                    "user_href": "/profile/Shifa-Afihs"
                },
                {
                    "user_id": "Charles Faraone",
                    "user_href": "/profile/Charles-Faraone"
                },
                {
                    "user_id": "Leslie Dufour",
                    "user_href": "/profile/Leslie-Dufour"
                },
                {
                    "user_id": "Chris Graff",
                    "user_href": "/profile/Chris-Graff-3"
                },
                {
                    "user_id": "Vishvesh Koranne",
                    "user_href": "/profile/Vishvesh-Koranne"
                }
            ]
        },
        {
            "author_info": {
                "name": "Liz Barwick",
                "href": "/profile/Liz-Barwick"
            },
            "answer_text": "I’ve been thinking about this and my thinking has led me to this. i abhor racism in any form - I can’t stand the idea of judging anyone by the colour of their skin, their religion or anything else … but, being English, I hate the French! why do I hate the French? I have absolutely no idea - beyond the fact that the French hate us! It’s tradition! I’ve never met a French man or woman who was anything but charming and helpful, the holidays I’ve taken in France have always been delightful … but it’s in my very bones that I hate the people who live, about 20 miles away from me, across the English Channel! well, if that’s not daft, nothing is! But I wonder how much this cheerful, mutual dislike reflects the dawn of racism in other communities. Just a thought … ",
            "date": "Answered April 14, 2019",
            "views": "47",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Mairi Beaton",
                    "user_href": "/profile/Mairi-Beaton-2"
                },
                {
                    "user_id": "Harry Weseman",
                    "user_href": "/profile/Harry-Weseman"
                },
                {
                    "user_id": "John Robertson",
                    "user_href": "/profile/John-Robertson-159"
                },
                {
                    "user_id": "Pete Swanie",
                    "user_href": "/profile/Pete-Swanie"
                },
                {
                    "user_id": "Abigail Miller",
                    "user_href": "/profile/Abigail-Miller-12"
                },
                {
                    "user_id": "Simone Stocker",
                    "user_href": "/profile/Simone-Stocker-1"
                },
                {
                    "user_id": "Maria Santiago",
                    "user_href": "/profile/Maria-Santiago-3"
                },
                {
                    "user_id": "Alex Meza",
                    "user_href": "/profile/Alex-Meza-21"
                },
                {
                    "user_id": "Callum Sutherland",
                    "user_href": "/profile/Callum-Sutherland-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Dee",
                "href": "/profile/John-Dee-101"
            },
            "answer_text": "Reading others answers, I find it hard to see how racism is hereditary. Or am I mistaken between genetically handed down to decendants being hereditary? It seems hereditary in the answers refers to learnt habbit or behaviour taught by our parents, is that correct? I personally see that the term “racism” is being used more in australia, siimply because a group of people from one race are upsetting ballance in society. When the majority of the others in australia speak up about the minority, they deam it to be racist. That really is unfair, as it isn't racist to correct a wrong of a group who are similar to the majority, but it is to do the same to a minority group, just because they are from a similar race. We have gone crazy with racism of late I think. Lets say a person from race A has a home with a family. Person B and C come to persons A home late at night to attack the family of person A. If person A shoots and kills B anc C. It would be deamed as racist if the person B and C were of a minority amd of same race. Yet you see the same event but persons B and C of same race as person A, then it is just a person defending his home and family from attack. Racism needs to be abollished before we get too far to rectify the troubles it is causing thew society. All people should be treated the same as all others and under the same rules. Colour, education level, upbrining, etc. should not be something that determins ones rights and or hatered of others of difference. ",
            "date": "Answered September 5, 2017",
            "views": "231",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Laura Potter",
                    "user_href": "/profile/Laura-Potter-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Hamric",
                "href": "/profile/Mark-Hamric"
            },
            "answer_text": "The way this question is phrased it sounds like this is something you want to become. I hope I’m wrong about that and hope you are asking about how it happens. In most cases racism is passed down from parents or mentors who hold racist views and express those views without qualms in the presence of impressionable minds. Sometimes racism is spread through peer pressure. Racism is often rooted in cultural differences. What is considered normal and acceptable in one society might be looked at as wrong or evil in another society. These differences then become exaggerated and expanded upon to include physical differences. Often racism is began through wars over resources. If a neighboring country isn’t willing to trade fairly then people will make wild accusations or exaggerate small differences with the intent to create hostilities. These hostile stereo types can last for centuries after the real reason the war was fought is long forgotten. ",
            "date": "Answered October 30, 2017",
            "views": "269",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lisa Leigh",
                    "user_href": "/profile/Lisa-Leigh-2"
                },
                {
                    "user_id": "Heric Galiz",
                    "user_href": "/profile/Heric-Galiz-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Janet Chaize",
                "href": "/profile/Janet-Chaize-1"
            },
            "answer_text": "Many people on this thread have described how racism is learned. but I am more interested in how a racist upbringing or racist indoctrination can be overcome. I grew up in E. Tennessee in the 1950’s - 1960’s. Quite a few kids in my high school were brought up to be racist. What changed them? In our high school, a dear social studies teacher taught a class in which the only curriculum was black and white kids talking. She was a wonderful facilitator. Attending the class, many kids, whose parents were openly racist, denounced their parent’s views. People usually overcome racism by having an opportunity to really talk to and understand others. Christian Picciolini is a former New-Nazi who helps people in hate groups change their views through a group he started: “Life After Hate.” He says “What changed us is when we received compassion from the people we least deserved it from.” If you haven’t read his story, go here: Former Neo-Nazi Says It’s On White People To Fight White Supremacy ",
            "date": "Answered September 6, 2017",
            "views": "147",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Crowly Mathew Arackal",
                    "user_href": "/profile/Crowly-Mathew-Arackal"
                },
                {
                    "user_id": "Rory Young",
                    "user_href": "/profile/Rory-Young-1"
                },
                {
                    "user_id": "Katherine Bailey",
                    "user_href": "/profile/K-R-Bailey"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Evans",
                "href": "/profile/David-Evans-1004"
            },
            "answer_text": "It depends on what you view ‘racism’ as. You could be considered a racist (as well as all manner of horrible slurs) just for watching this video:  ‘But…where’s the racism? It’s a cartoon frog in a rainbow wig being silly… it doesn’t even make sense!’ OMG… The media has said that it is a sign of ‘white supremacy’ and so you must believe it or you are wrong! The problem is that anything can be considered racist if enough people say that it is. The ‘OK’ hand gesture is racist…because of a post on 4chan. Certain things will always be racist, and 99% of people will accept that things like the N word or throwing a banana at a black person are wrong, but racist/racism is such a broad church today…who knows anymore! ",
            "date": "Answered April 14, 2019",
            "views": "56",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Dave Lat",
                    "user_href": "/profile/Dave-Lat-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rickz Lee",
                "href": "/profile/Rickz-Lee"
            },
            "answer_text": "Their is many ways to become racist. 1) learning from other people.2) Being bully by only one race (only one of your kind in said place).3) Media (they like for you to be afraid).4) Upbringing (falls in line with learning from others).5) Seeing what said race is doing over and over. It's always that one race (blacks its crime, whites it's racism, Spanish it's illegal )6) Viewpoint of the world (where one race black or white or any other think they are better)7) Learning about history. (adds fuel to the hate/fear that may have never been their) And number 8 what is our us just wanting to be with our own kinds. (the ugly duckling) PS) to add to History my kid started school around 6 years old but thanks to her mom missed most of it. The next year she was at school with no miss days she got to learn about slavery (black feb) before this she never cared about the skin color of someone. She is now more worried about blacks (was worried her next teacher may be black). It's odd just odd… ",
            "date": "Answered August 24, 2017",
            "views": "185",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Amy Christa Ernano",
                "href": "/profile/Amy-Christa-Ernano"
            },
            "answer_text": "They can't. Racism is learned behavior; no one is born racist. The folk singer Woody Guthrie was born in Oklahoma in 1912. His father, Charles, was an active member of the Ku Klux Klan, and participated in the lynchings of an African-American woman, Laura Nelson, and her 14-year-old son, L.D., in 1911. Yet despite being born to and raised by a Klansman, Woody Guthrie was not a racist, ever. One of his closest friends as a child, and the person who inspired him to become a musician, was an African-American shoeshine boy named George, who taught him to play the harmonica, and as an adult, two of his closest friends were African-American fellow folk artists Huddie “Lead Belly” Ledbetter and Sonny Terry. The moral of the story is, if a person could be born racist, Woody Guthrie absolutely would have been. But no one is born racist. Racism is a choice, not a default. ",
            "date": "Answered May 26, 2019",
            "views": "451",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Laura Potter",
                    "user_href": "/profile/Laura-Potter-17"
                },
                {
                    "user_id": "Donna Bianca",
                    "user_href": "/profile/Donna-Bianca-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Craig Gorsuch",
                "href": "/profile/Craig-Gorsuch"
            },
            "answer_text": "The question goes deeper than ethnicity.  Anytime one feels superior to another in an absolute sense for superficial reasons, then one is closed-minded and bigoted. These feeling of superiority need not be ethnically based.  They can be based on educational attainment; physical prowess; sexual orientation; ideologically based (which includes \"religion\" but is not limited therewith); politically based; caste based (even here in the US - white collar vs blue collar comes to mind); sex based; etc... The most important thing to remember: there is no group immune to these feelings.  It is possible for the homosexual, single, atheist, political liberal, vegan, Puerto Rican, trans-woman to feel smug and superior to the straight, married, Christian, political conservative, hunting and meat eating, New England born, \"bio\"-man simply because they are homosexual, single, atheist, politically liberal, vegan, Puerto Rican and trans.  Let's not fall for the lie that bigotry only flows in one direction. ",
            "date": "Answered November 8, 2015",
            "views": "642",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Louis Rodrigues",
                    "user_href": "/profile/Louis-Rodrigues-1"
                },
                {
                    "user_id": "Nere Avern",
                    "user_href": "/profile/Nere-Avern"
                },
                {
                    "user_id": "Karen Humphrey",
                    "user_href": "/profile/Karen-Humphrey-18"
                },
                {
                    "user_id": "Robert Browning",
                    "user_href": "/profile/Robert-Browning-14"
                },
                {
                    "user_id": "Gabriel Guzman",
                    "user_href": "/profile/Gabriel-Guzman-10"
                },
                {
                    "user_id": "Donovan Minckler",
                    "user_href": "/profile/Donovan-Minckler"
                },
                {
                    "user_id": "Cecil Hester",
                    "user_href": "/profile/Cecil-Hester-2"
                },
                {
                    "user_id": "Eliot Layton",
                    "user_href": "/profile/Eliot-Layton"
                },
                {
                    "user_id": "Frank Zhang",
                    "user_href": "/profile/Frank-Zhang-218"
                }
            ]
        },
        {
            "author_info": {
                "name": "Murphy Barrett",
                "href": "/profile/Murphy-Barrett"
            },
            "answer_text": "What qualifies someone as a \"racist\"? It’s shockingly easy. There are two beliefs that make someone a racist. Just two. The belief that all members of a particular race posses qualities or characteristics specific to that race. Note that this belief is not necessarily antagonistic, even though it is mistaken.Prejudice, bigotry, or antagonism against all people not of one’s own race, or against all members of a particular race, based on the belief that one’s own race is superior, or that other races is inferior.Any person who holds one or both of these beliefs is racist. It’s pretty straightforward. ",
            "date": "Answered January 7, 2018",
            "views": "447",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Olivia Lau",
                    "user_href": "/profile/Olivia-Lau-6"
                },
                {
                    "user_id": "Tacticmonster",
                    "user_href": "/profile/Tacticmonster"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ronald Kimmons",
                "href": "/profile/Ronald-Kimmons"
            },
            "answer_text": "Racism arises from the very natural inclination to identify threats by categorizing things and suspecting the \"other\". To some extent, racism arises from that same place in the human mind that tells us that anything unfamiliar or strange is dangerous. It also arises from the natural tendency to assume that our group is better than all others, regardless of how arbitrary that distinction may be. Despite the evolutionary value such tendencies have had in the past, though, if we want to progress as a species, to some extent at least, these tendencies need to go the way of the tail and the proclivity to eat our rivals' young. Distinctions can still be good, but arbitrary and over-simplified distinctions...not so much. ",
            "date": "Answered September 1, 2015",
            "views": "16",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Diana Aulicino",
                    "user_href": "/profile/Diana-Aulicino-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ahmed Sayed",
                "href": "/profile/Ahmed-Sayed-13"
            },
            "answer_text": "It’s very simple. Luckily no one is born racist, however, -If your parents are racist, there’ a high chance that you’ll be racist as well. -If your neighborhood that you grew up in is racist, there’ a high chance that you’ll be racist as well. -If your school is racist, there’ a high chance that you’ll be racist as well. -If your country’s government is racist and has a lot of influence on the media contents that you watch, there’ a high chance that you’ll be racist as well. -If your friends are racist, there’ a high chance that you’ll be racist as well. The list goes on but you get my point. Whatever you were not born with, you gain it from your surroundings. Of course, there are exceptions who don’t obey the status quo and rebel against the surrounding system, but those aren’t the rule. ",
            "date": "Answered August 24, 2017",
            "views": "481",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Nicolás Miari",
                    "user_href": "/profile/Nicolás-Miari"
                },
                {
                    "user_id": "David Hansel",
                    "user_href": "/profile/David-Hansel-3"
                },
                {
                    "user_id": "Dylan Cooper",
                    "user_href": "/profile/Dylan-Cooper-21"
                },
                {
                    "user_id": "Adrian Mitchell",
                    "user_href": "/profile/Adrian-Mitchell-39"
                },
                {
                    "user_id": "Thomas Doyle",
                    "user_href": "/profile/Thomas-Doyle-44"
                },
                {
                    "user_id": "Daniel Philippus",
                    "user_href": "/profile/Daniel-Philippus-1"
                },
                {
                    "user_id": "Pedro Volpi",
                    "user_href": "/profile/Pedro-Volpi-1"
                },
                {
                    "user_id": "Clemens Hoste",
                    "user_href": "/profile/Clemens-Hoste"
                },
                {
                    "user_id": "Zach Raley",
                    "user_href": "/profile/Zach-Raley"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tyler Rhys Alexander",
                "href": "/profile/Tyler-Rhys-Alexander"
            },
            "answer_text": "Being raised by ignorant people. If you’re raised by people who have this idea that their race is better than anyone else’s, that’s going to rub off on you.Experiences with other races might make you a racist. Say for instance you’re a person of one race growing up in a majority other race than yours, and the people there are less than friendly. Being there a long time is going to warp your general perception of people of that race.",
            "date": "Answered June 29, 2019",
            "views": "37",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mairi Beaton",
                    "user_href": "/profile/Mairi-Beaton-2"
                },
                {
                    "user_id": "Andrew Ortega",
                    "user_href": "/profile/Andrew-Ortega-21"
                },
                {
                    "user_id": "Mfan Wakhe",
                    "user_href": "/profile/Mfan-Wakhe"
                },
                {
                    "user_id": "Demetrius Jordan",
                    "user_href": "/profile/Demetrius-Jordan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Parisella",
                "href": "/profile/Joseph-Parisella-2"
            },
            "answer_text": "My mum works at a primary school with little kids aged five. In her class she has black kids, white kids, Asian kids, even a ginger. All these kids come from different backgrounds, but whether they be rich or poor, coloured or not they all have one thing in common. They don't judge people based on the way they look. All they see is another potential playmate. It doesn't matter if their daddy says the n word frequently or mummy can't stand those cracker ass fools when they are kids they don't understand what that stuff means. All they see is someone to play with. Its not until they're older and they understand their parents prejudices that these racist ideologies begin to come to the fore. ",
            "date": "Answered September 26, 2017",
            "views": "334",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Nancy Katherine",
                    "user_href": "/profile/Nancy-Katherine-1"
                },
                {
                    "user_id": "Mairi Beaton",
                    "user_href": "/profile/Mairi-Beaton-2"
                },
                {
                    "user_id": "Simran Preet Singh",
                    "user_href": "/profile/Simran-Preet-Singh-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Françoise Marie",
                "href": "/profile/Françoise-Marie-1"
            },
            "answer_text": "The past is never dead. It leaves deep scars and painful memories. Some people cannot overcome their pain and sorrow. They just hate the descendants or ”lookalikes” of the people who killed or humiliated their ancestors. A white man once wrote the following on a popular forum : It is true that whites have by far the largest share of genocidal behavior. We colonized vast swathes and implemented the slave trade He said something not really different from the legendary Charles Darwin : Wherever the European has trod, death seems to pursue the aboriginal. Darwin on disease and indigenous populations Besides the several evident causes of destruction, there appears to be some more mysterious agency generally at work. Wherever the European has trod, death seems to pursue the aboriginal. We may look to the wide extent of the Americas, Polynesia, the Cape of Good Hope, and Australia, and we find the same result. ……… Nor is it the white man alone that thus acts the destroyer; the Polynesian of Malay extraction has in parts of the East Indian archipelago, thus driven before him the dark-coloured native. The varieties of man seem to act on each other in the same way as different species of animals -- the stronger always extirpating the weaker.  Chinese Coolies - Coolie Trade in the 19th Century Are Negros Closer to Apes Than to Humans? \"Mongolian imbecile\" Winston Churchill killed as many as the worst genocidal dictators of the 20th century, says Indian politician Smallpox in the Blankets Explainer: the evidence for the Tasmanian genocide https://defence.pk/pdf/threads/opium-wars-connection-to-indian-bengalis-famine-genocide-by-britian.288292/ …. Father stares at the hand and foot of his five-year-old, severed as a punishment for failing to make the daily rubber quota, Belgian Congo, 1904  A Congolese man looking at the severed hand and foot of his five-year-old daughter who was killed, and allegedly cannibalized, by the members of Anglo-Belgian India Rubber Company militia. The Century-Old Photos That Exposed the Evils of Colonialism in Africa  PHOTO BY ALICE SEELEY HARRIS. COPYRIGHT ANTI-SLAVERY INTERNATIONAL AND AUTOGRAPH ABP  The Most Devastating Atrocities Committed By Every European Colonial Empire Congo Free State (1885–1908)  Photo: Alice Harris/Wikimedia Commons/Public Domain British India And The Famines, 1865-1943  Photo: chinadaily/Wikimedia Commons/Public Domain German Namibia And The Herero Genocide, 1904-1907  Photo: Unknown/Wikimedia Commons/Public Domain EDIT # 1 White slavery under the Moors. Barbarian Cruelty: An Eye-Witness Account of White Slavery under the Moors: Brooks, Francis: 9781366513335: Amazon.com: Books  An original eye-witness account of white slavery under the Muslims of North Africa. It is a simple fact of the anti-white establishment that the Trans-Atlantic slave trade is known to all, but knowledge of the Muslim slave-trade in Europeans is deliberately suppressed. Europeans are continually \"blamed\" for African slavery (even though only a tiny minority were ever involved in it, and it was Europeans who brought it to an end), but no-one ever dares \"blame\" the Muslim world for their slave trade in Africans and Europeans, which lasted for centuries longer than the Atlantic slave trade. It was during the 1600s that Barbary corsairs-pirates from the Barbary Coast of North Africa (today Algeria, Libya and Morocco)-were at their most active and terrible. With the full support of the Moorish rulers of North Africa, these Muslim slavers raided southern Europe, the Atlantic European coast, Britain and Ireland almost at will. There are, sadly, no complete records for how many Europeans were captured by the Muslim slavers, but most estimates-based on the size of the Moorish cities-indicate that by 1780, at least 1.2 million Europeans had been seized. Amazon.com: White Slavery in the Barbary States eBook: Charles Sumner: Kindle Store  This controversial, oft-suppressed work is a fascinating glimpse into the practice of white slavery. In White Slavery in the Barbary States captivity expert Charles Sumner takes a detailed look at the white slave markets which flourished on the Barbary Coast of North Africa, which included the Ottoman provinces of Algeria, Tunisia and Tripolitania and the independent sultanate of Morocco, between the 16th and middle of the 18th century. How the Moors described their European foes: Sa-id of Andalusia wrote the following of his﻿ White Iberian opponents: They “are nearer animals than men . . . They are by nature unthinking and their manners crude. Their bellies protrude; their color is white and their hair is long. In sharpness and delicacy of spirit and in intellectual perspicacity, they are nil. Ignorance, lack of reasoning power and boorishness are common among them.” (Kitab Tabakat al Umaxn (Blachere K. p. 36. 1935). Thomas Sowell On the other side, an Islamic scholar of the 10th century noted that Europeans grow more pale the farther north you go and also that the \"farther they are to the north the more stupid, gross, and brutish they are.\" https://www.aei.org/carpe-diem/thomas-sowell-on-slavery-and-this-fact-there-are-more-slaves-today-than-were-seized-from-africa-in-four-centuries/ White people were still being bought and sold as slaves in the Ottoman Empire, decades after American blacks were freed. ",
            "date": "Answered April 18, 2020",
            "views": "354",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Jody Taylor",
                    "user_href": "/profile/Jody-Taylor-25"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barak-Har Elkin",
                "href": "/profile/Barak-Har-Elkin"
            },
            "answer_text": "Inadequate rational capacity, a cognitively dissonant overabundance of both self-love & self-loathing, inability to spot the evils of tradition, a general feeling of persecution, a strong sense of personal insecurity, unchallenged peer pressure, a cherished sense of justified resentment, a lack of any social standard, a love of violence & bullying, & likely several other things - all heaped upon a general lack of character or personal integrity. ",
            "date": "Answered December 17, 2019",
            "views": "22",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael David Cobb Bowen",
                "href": "/profile/Michael-David-Cobb-Bowen"
            },
            "answer_text": "Believe in race. That’s the first step. All you have to say is that I believe that race is deterministic of human behavior and it’s important that we pay attention. That’s all it takes. You might not be a particularly effective racist. You may not be a good racist at all. But it’s what you believe. You may not be convincing, or dangerous, or able to lead one other human being towards your way of thinking. But it is your way of thinking and it’s what you want to be. Knock yourself out. ",
            "date": "Answered October 30, 2017",
            "views": "260",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Olivia Lau",
                    "user_href": "/profile/Olivia-Lau-6"
                },
                {
                    "user_id": "Darrel Parham",
                    "user_href": "/profile/Darrel-Parham"
                },
                {
                    "user_id": "Charles Hamilton",
                    "user_href": "/profile/Charles-Hamilton-14"
                },
                {
                    "user_id": "Jeremy Markeith Thompson",
                    "user_href": "/profile/Jeremy-Markeith-Thompson"
                },
                {
                    "user_id": "Lucas Souza",
                    "user_href": "/profile/Lucas-Souza-36"
                },
                {
                    "user_id": "Lance LaSalle",
                    "user_href": "/profile/Lance-LaSalle"
                },
                {
                    "user_id": "Kala Fitch",
                    "user_href": "/profile/Kala-Fitch"
                }
            ]
        },
        {
            "author_info": {
                "name": "Varanasi Rama Srinivas",
                "href": "/profile/Varanasi-Rama-Srinivas"
            },
            "answer_text": "I think this picture does a great job explaining.  Source: Scroll in There could be many different environments (combination of fear and ignorance) which could breed hate. In my experience many a time it could be unfortunate personal experiences - like losing someone/something dear or being discriminated against. But for some it is superiority complex and for some it could manipulation by a politician. But at the end of the day it is a combination of the fear and/or ignorance that makes a person become racist. ",
            "date": "Answered December 16, 2017",
            "views": "11",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "Haydn Douglas",
                    "user_href": "/profile/Haydn-Douglas-1"
                },
                {
                    "user_id": "Noah Emerson",
                    "user_href": "/profile/Noah-Emerson-3"
                },
                {
                    "user_id": "John Denny",
                    "user_href": "/profile/John-Denny-54"
                },
                {
                    "user_id": "Federica Tavoletta",
                    "user_href": "/profile/Federica-Tavoletta"
                },
                {
                    "user_id": "Wambui Wa Mundu",
                    "user_href": "/profile/Wambui-Wa-Mundu"
                },
                {
                    "user_id": "Theodore Twombley",
                    "user_href": "/profile/Theodore-Twombley"
                },
                {
                    "user_id": "Lauri Ceriani",
                    "user_href": "/profile/Lauri-Ceriani"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Micah-Moose"
                }
            ]
        },
        {
            "author_info": {
                "name": "Claire Jordan",
                "href": "/profile/Claire-Jordan-10"
            },
            "answer_text": "The belief that a person’s ethnicity in itself makes them more or less worthy than average. ",
            "date": "Answered January 7, 2018",
            "views": "319",
            "upvotes": " View 30 Upvoters",
            "upvoters": [
                {
                    "user_id": "Roger Williams",
                    "user_href": "/profile/Roger-Williams-31"
                },
                {
                    "user_id": "Quinn Copeland",
                    "user_href": "/profile/Quinn-Copeland"
                },
                {
                    "user_id": "Nettuno Rossi",
                    "user_href": "/profile/Nettuno-Rossi"
                },
                {
                    "user_id": "Paul Brinkley",
                    "user_href": "/profile/Paul-Brinkley-1"
                },
                {
                    "user_id": "Samuel Allen",
                    "user_href": "/profile/Samuel-Allen-4"
                },
                {
                    "user_id": "Paul O'Brien",
                    "user_href": "/profile/Paul-OBrien-1"
                },
                {
                    "user_id": "Abe Lewis",
                    "user_href": "/profile/Abe-Lewis"
                },
                {
                    "user_id": "Manish Baluja",
                    "user_href": "/profile/Manish-Baluja-1"
                },
                {
                    "user_id": "Mike Bennett",
                    "user_href": "/profile/Mike-Bennett-83"
                },
                {
                    "user_id": "George Peterson",
                    "user_href": "/profile/George-Peterson-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Percy Clarke",
                "href": "/profile/Percy-Clarke"
            },
            "answer_text": "I live in a predominantly white part of England, I didn't see anyone that wasn't white until I was seven; a black girl joined my school. I also thought her hair was beautiful, and that's all that I would tell my parents about the new girl. It took parents' evening to see her and her mother before they realised that the girl was black and that's why I loved her hair so much. My parents pride themselves on me not being prejudiced, but I just didn't know how to be. Racism is taught. We don't naturally see people as inferior because of their race. ",
            "date": "Updated September 9, 2017",
            "views": "13",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Anantha",
                    "user_href": "/profile/Anantha-4"
                },
                {
                    "user_id": "Krishna Varanasi",
                    "user_href": "/profile/Krishna-Varanasi-3"
                },
                {
                    "user_id": "Chaitanya Matta",
                    "user_href": "/profile/Chaitanya-Matta-1"
                },
                {
                    "user_id": "Leith Essid",
                    "user_href": "/profile/Leith-Essid"
                },
                {
                    "user_id": "Karla Sophia",
                    "user_href": "/profile/Karla-Sophia"
                },
                {
                    "user_id": "Anupama Kannan",
                    "user_href": "/profile/Anupama-Kannan"
                },
                {
                    "user_id": "Anand Anderson",
                    "user_href": "/profile/Anand-Anderson-2"
                },
                {
                    "user_id": "Bharat Pillilli",
                    "user_href": "/profile/Bharat-Pillilli"
                },
                {
                    "user_id": "Sriram Karthikeya Chavali",
                    "user_href": "/profile/Sriram-Karthikeya-Chavali"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leslie Dufour",
                "href": "/profile/Leslie-Dufour"
            },
            "answer_text": "I think today young people are learning it from the internet. They are developing a community on line. I had no idea about this world until recently. I would call it a sub-cult. There is a vocabulary; there are personalities that they all know; methods they share of how to convince others to think like them-arguments to use etc.; all sorts of rationalizations for why diversity isn’t good for society; and t a shared mission and fear of increased diversity in our society. (And what is this obsession about beauty? Again and again this theme of alt-right women talking about how they are better looking than liberal women—bizarre stuff.) Look up redpilling on youtube, the videos are there. ",
            "date": "Answered August 21, 2017",
            "views": "310",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Michael Bieri",
                    "user_href": "/profile/Michael-Bieri"
                },
                {
                    "user_id": "Daniel Bezar",
                    "user_href": "/profile/Daniel-Bezar"
                },
                {
                    "user_id": "Felipe Alves",
                    "user_href": "/profile/Felipe-Alves-31"
                },
                {
                    "user_id": "Anir Akoch",
                    "user_href": "/profile/Anir-Akoch"
                },
                {
                    "user_id": "Yebraw Mada",
                    "user_href": "/profile/Yebraw-Mada"
                },
                {
                    "user_id": "Diwakar Kumar",
                    "user_href": "/profile/Diwakar-Kumar-दिवाकर-कुमार"
                },
                {
                    "user_id": "Isaac Rodríguez",
                    "user_href": "/profile/Isaac-Rodríguez-4"
                },
                {
                    "user_id": "Krysia Denys",
                    "user_href": "/profile/Krysia-Denys"
                },
                {
                    "user_id": "Juan Agudelo",
                    "user_href": "/profile/Juan-Agudelo-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Meyers",
                "href": "/profile/Andrew-Meyers-5"
            },
            "answer_text": "It is enough to be white, male and straight. Disagreeing with any point of the progressive agenda seals the bargain. The term is so abused I really don’t care anymore what some SJW twit calls me. I have a background in mathematics (white privilege) . I happen to respect George Washington, Columbus and Shakespeare. In this era of politically correct silliness this is enough to make me a racist. Call me a turnip, fascist, whatever you want. I just look at the source and snicker. If I offend your childlike sensitivities, that is your problem, not mine. ",
            "date": "Answered October 30, 2017",
            "views": "69",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Amleth Hanna",
                    "user_href": "/profile/Amleth-Hanna"
                },
                {
                    "user_id": "Jirka Kanding",
                    "user_href": "/profile/Jirka-Kanding"
                },
                {
                    "user_id": "Nusrat Shaikh",
                    "user_href": "/profile/Nusrat-Shaikh-1"
                },
                {
                    "user_id": "Renjith Chandrasekharan",
                    "user_href": "/profile/Renjith-Chandrasekharan"
                },
                {
                    "user_id": "Paramveer Singh",
                    "user_href": "/profile/Paramveer-Singh-51"
                },
                {
                    "user_id": "Mairi Beaton",
                    "user_href": "/profile/Mairi-Beaton-2"
                },
                {
                    "user_id": "Vince Gotera",
                    "user_href": "/profile/Vince-Gotera"
                },
                {
                    "user_id": "Lalentlingi Tochhawng",
                    "user_href": "/profile/Lalentlingi-Tochhawng"
                },
                {
                    "user_id": "Hajar Bh",
                    "user_href": "/profile/Hajar-Bh-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alton Sun",
                "href": "/profile/Alton-Sun"
            },
            "answer_text": "One factor might be being exposed to the news or TV, which has a direct financial incentive to draw more eyes of a specific group by exaggerating statistics or facts while giving disproportionate attention to what the source deems 'most appealing to their target demographics'. So what if it creates more ignorant bigots in the world if their ratings go up and they make more money? If we feed people fear, they will be hooked.  http://en.wikipedia.org/wiki/Stereotype_threat ",
            "date": "Updated March 7, 2011",
            "views": "32",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Mairi Beaton",
                    "user_href": "/profile/Mairi-Beaton-2"
                },
                {
                    "user_id": "John Robertson",
                    "user_href": "/profile/John-Robertson-159"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yhishara Cerise",
                "href": "/profile/Yhishara-Cerise"
            },
            "answer_text": "I would say experiences. If you constantly have a bad experience with certain people around you and the only common denominator in that experience was a certain physical trait the perpetrators had then you would begin associating that trait with a negative experience. It would almost become instinctual and you would want to not be around people that have that trait. You will just automatically anticipate problems when around them and so want to avoid it whenever possible. ",
            "date": "Answered August 5, 2020",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Wesley Cantebra",
                "href": "/profile/Wesley-Cantebra"
            },
            "answer_text": "First of all you have to understand that racism is not just about name calling or a negative racial attitude. To be capable to be a racist your people need to have the monopoly, in other words your people need to own and control big business, banking institution and corporation, you also need to control the law, politics, the money, the police forces, the military forces, special forces, spy agencies, the federal police and all other type of law inforcement agencies. You also need to own and control the media (tv stations, radio stations, magazines and news papers). When your people control all that they will be able to manipulate all this against the other races that they don’t like. Black people cannot be racist because black people don’t own and control the things that I have mentionned above. To be racist your people need to have power. ",
            "date": "Answered January 8, 2018",
            "views": "95",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Robert Goldstein",
                    "user_href": "/profile/Robert-Goldstein-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gillian Schifreen",
                "href": "/profile/Gillian-Schifreen-1"
            },
            "answer_text": "I was born in Africa to English parents and grew up with friends of many colours and nationalities. Although not religious I've always been interested in history and decided to travel to the ‘Holy Land' and stay for a year experiencing all the different cultures. I was a shapely blond 21 year old but have always been careful to dress fairly modestly even in hot climes — trousers and sleeved T shirts. I stayed right on the border of Israel and Gaza. Visited many Arab, Jewish and mixed towns and cities. And here goes: I never had a single bad experience with an Israeli and I never had a single good experience with a Palestinian. It was totally impossible to walk down any street without being groped by men. Hands between my legs, even up inside my T shirt. Dragged into doorways and molested. I made the error of hitching and getting in a car with a Palestinian. He abducted me and I got away be the skin of my teeth. I've hitchiked all over the world with no other problems. I can't begin to go into some of the massively far more serious negative experiences I had. Needless to say I went there with a friendly, curious open mind and came back a racist. ",
            "date": "Answered September 4, 2017",
            "views": "221",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kat Tanaka Okopnik",
                    "user_href": "/profile/Kat-Tanaka-Okopnik"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Martin",
                "href": "/profile/Tom-Martin-160"
            },
            "answer_text": "Discussing some of this with one of the offspring today, talking about offensive jokes, comments and how some would get a politician hammered. Environment, experience, personal perspective. I find it fascinating that one of my children, now well into being an adult, doesn’t even consider race when giving a description! If asked “OK, so what does Mr. Jenson look like?” “Older, like grandma, wears glasses.” Seriously. He doesn’t mention whether a person is taller or heavier, or what either unless pressed because he simply doesn’t see people that way. They’re either nice or not, older or young, male for female. ",
            "date": "Answered November 17, 2017",
            "views": "166",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Charles Givens",
                    "user_href": "/profile/Charles-Givens-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Scott Randolph",
                "href": "/profile/Scott-Randolph-14"
            },
            "answer_text": "Much like alcohol(ism) and drug use, people don’t wake up one day and realize they are an addict. Or racist. Unfortunately, this disgusting trait is passed along from generation to generation. And don’t get me started on the whole, ‘ It’s not your fault, it’s a disease’, thing. Please. Gag me with a Cuisinart. ",
            "date": "Answered October 30, 2017",
            "views": "47",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Edoardo Nikolov",
                    "user_href": "/profile/Edoardo-Nikolov"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Hahn",
                "href": "/profile/Mark-Hahn-2"
            },
            "answer_text": "A racist thinks that race matters and engages in behavior based on race. It’s really no different than a deist or a dentist or a determinist, except that there is a long and ongoing history of racism leading to violence, coercion, abuse. Mostly, people who treat teeth with reverence, and those who do not - those two sides get along OK. Less so with other -ists and -isms: consider communism. The real question is whether you, on one side of the -ism, think people on the other side are inferior, flawed, less worthy of humane treatment. ",
            "date": "Answered January 7, 2018",
            "views": "90",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sheila Payne",
                    "user_href": "/profile/Sheila-Payne-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gloria Cole",
                "href": "/profile/Gloria-Cole-1"
            },
            "answer_text": "Race is a cultural label. There are no biological races within the human species. AAPA adopts new Statement on Race and Racism. A biological race would be a genetically homogeneous population. There are none within the human species. Racism is learned cultural behavior directed at various classes of people categorized by superficial characteristics - such as skin color. The racist claims that that fits his his artificial classification is inferior to himself. ",
            "date": "Updated October 22, 2020",
            "views": "38",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bill Smith",
                    "user_href": "/profile/Bill-Smith-1198"
                },
                {
                    "user_id": "Michelle Pilecki",
                    "user_href": "/profile/Michelle-Pilecki"
                },
                {
                    "user_id": "Katherine Bailey",
                    "user_href": "/profile/K-R-Bailey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Everett LeGrande",
                "href": "/profile/Everett-LeGrande"
            },
            "answer_text": "Racist parents for programming racist beliefssell the propaganda and the hatemake them feel like they’re losing something to the other racekeep feeding the monster",
            "date": "Answered July 9, 2020",
            "views": "31",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Francis Jacquerye",
                    "user_href": "/profile/Francis-Jacquerye"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eben Visser",
                "href": "/profile/Eben-Visser"
            },
            "answer_text": "You take an average, hardworking person, and start labelling him with every derogatory remark you can find in the newspapers until he gets fed up with your crap and voila , a racist is served. ",
            "date": "Answered July 9, 2020",
            "views": "44",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Galan",
                "href": "/profile/Eric-Galan"
            },
            "answer_text": "The Merriam-Webster dictionary defines racism as the belief that some races are better than others(http://www.merriam-webster.com/dictionary/racist). Since all men and races are born equal I feel that it is the lack of understanding of other people and stereotypes from the media that influences this \"misunderstanding\" of each other. ",
            "date": "Answered November 1, 2015",
            "views": "163",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Karen Remick",
                "href": "/profile/Karen-Remick"
            },
            "answer_text": "There are 2 ways: Their parents, or someone they trust is racists, and teaches them that other races are somehow less worthwhile/human/good as they are.Someone of a different race does something bad to them and they generalize this to mean everyone of that race is bad.",
            "date": "Answered August 24, 2019",
            "views": "22",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Buddy Rushing",
                    "user_href": "/profile/Buddy-Rushing"
                },
                {
                    "user_id": "Lailan Murdock",
                    "user_href": "/profile/Lailan-Murdock"
                }
            ]
        },
        {
            "author_info": {
                "name": "Percy Thomas",
                "href": "/profile/Percy-Thomas-2"
            },
            "answer_text": "That answer has been twisted by people with racist tendencies to allow the comfort of some sort of moral justification of shady racist practices and ideas, but the short answer goes something like this…..The inability to recognize another human being as such and to respect and treat them as you would like to be respected and treated. In a nutshell. ",
            "date": "Answered January 7, 2018",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shaun Griswold",
                    "user_href": "/profile/Shaun-Griswold-1"
                },
                {
                    "user_id": "Brian Mckee",
                    "user_href": "/profile/Brian-Mckee-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wyatt Peck",
                "href": "/profile/Wyatt-Peck"
            },
            "answer_text": "Realize that there's a vested interest in proposing racial equality. Governments care about stability more than pragmatism, and promote equality.Do research: find out that intelligence, lifespan, onset of puberty, impulsiveness, and many other factors vary between racesBecome a race-realists, not a racist.",
            "date": "Answered November 2, 2017",
            "views": "44",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Omar Judah",
                "href": "/profile/Omar-Judah"
            },
            "answer_text": "Watching Tarantino movies. Wearing all white clothing. Reading the Bible or the Quran. Watching too many US slavery movies. Going to prison. Listening to Rush Limbaugh. Getting pulled over by just one cop regardless that you were in the wrong. [Which is the No.#1 leading cause in Texas. SMH]. Getting fired once by another ethnicity. [SMH-O&O] Believing You’re Part of the Enlightened Class & Everybody Else Has it All Wrong Because They Don’t Read & Believe in the Same Shady Internet Cultist Website You Espouse. ",
            "date": "Answered October 21, 2017",
            "views": "78",
            "upvotes": " Answer requested by Charles Xu",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Scott Booth",
                "href": "/profile/Scott-Booth-50"
            },
            "answer_text": "Maybe a person was dragged into an alley by a group of people with a different appearance from themselves, but all the kids look a lot alike. and the person starts being more cautious and uneasy around people that remind him of the group of people that attacked him that day. ",
            "date": "Answered August 19, 2019",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michelle Pilecki",
                "href": "/profile/Michelle-Pilecki"
            },
            "answer_text": "People aren’t born racists. They’re brought up to be racists. It’s very difficult to overcome. Richard Rodgers (Ft. William Tabbert) – You've Got to Be Carefully Taught  ",
            "date": "Answered October 30, 2017",
            "views": "101",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter McGlothin",
                "href": "/profile/Peter-McGlothin"
            },
            "answer_text": "As the song goes from South Pacific goes “you've got to be taught to hate and fear”. It is interesting though that I have a brother who met his girlfriend @ 15. He took on the values of her family and became an intolerant conservative. They have been married over 50 years. On the other hand I grew up with more Liberal views. Although over the years we learned not to talk about politics or religion with each other. Keeps peace in the family. ",
            "date": "Answered August 24, 2017",
            "views": "69",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Adam Turner",
                "href": "/profile/Adam-Turner-11"
            },
            "answer_text": "Racism is a political ideology, like fascism, communism, socialism, et al. Unless someone has the power to make legislation or otherwise discriminate against a group of people, they are not racists. They are bigots. They are prejudiced by skin color, religion, culture, language, physical appearance, borders, et al. And this behavior, for the most part, is effected by their upbringing. Now, they may support the racist, but by themselves, they’re simple bigots. ",
            "date": "Answered September 25, 2017",
            "views": "110",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Horretta Wilkins",
                    "user_href": "/profile/Horretta-Wilkins"
                },
                {
                    "user_id": "Elyaas Callahan",
                    "user_href": "/profile/Elyaas-Callahan"
                },
                {
                    "user_id": "Katherine Bailey",
                    "user_href": "/profile/K-R-Bailey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leslie Knight",
                "href": "/profile/Leslie-Knight-1"
            },
            "answer_text": "All you have to do is watch the news and see who is rioting and burning their own neighborhoods. You will see the same looting and killing their own more than anyone else. Pretty soon you will see a pattern. Violah! instant racist! ",
            "date": "Answered October 21, 2017",
            "views": "43",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lesa Osborne",
                "href": "/profile/Lesa-Osborne"
            },
            "answer_text": "They are taught, by their racist parents, from birth. If they never gain enough real world experience to recognize the obvious logical flaws, they pass the prejudice on to the next generation. ",
            "date": "Answered August 24, 2019",
            "views": "48",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dave Lat",
                    "user_href": "/profile/Dave-Lat-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Terra Dean",
                "href": "/profile/Terra-Dean-3"
            },
            "answer_text": "It can be learned, or they can be done wrong by people of a different race, or someone they love. If they don't understand the difference or don't like that they're different, that can cause it. Etc ",
            "date": "Answered August 24, 2019",
            "views": "23",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rosina L. Wachtel",
                "href": "/profile/Rosina-L-Wachtel"
            },
            "answer_text": "Insecurity. Lack of self-worth. Must believe that there are others inferior so that s/he can feel superior to something . Emotionally healthy people do not need to play such games. ",
            "date": "Answered December 13, 2018",
            "views": "10",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jonah Blackwell",
                    "user_href": "/profile/Jonah-Blackwell"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jamal Smith",
                "href": "/profile/Jamal-Smith-62"
            },
            "answer_text": "The answer ranges to how a person was raised , to who've they been around to their own personal experiences. Why does a person kill or live dangerously? These are exclusive, personal developments and causes involved in each and everybody's life. There's no uniformity to any of this. ",
            "date": "Answered September 15, 2018",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lailan Murdock",
                "href": "/profile/Lailan-Murdock"
            },
            "answer_text": "A bit of ignorance, a bit of arrogance, a bit of hate. Reinforce that with stereotypes and false beliefs in what race is, boom you have a racist. ",
            "date": "Answered July 9, 2020",
            "views": "16",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Mikkel Nyhave Andersen",
                    "user_href": "/profile/Mikkel-Nyhave-Andersen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Donna Bianca",
                "href": "/profile/Donna-Bianca-1"
            },
            "answer_text": "Personal experience. Pattern recognition. Racism isn’t taught, it’s learned. ",
            "date": "Answered June 29, 2019",
            "views": "9",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Caudill",
                "href": "/profile/John-Caudill-2"
            },
            "answer_text": "EASy? Go to public schools or read the New York Times, “if it looks like a goat, it must be a goat”! America, the land of the free? Free to whom? Those who besmirch others to forward their own passions? love for our specie should over shadow any disparity in ideology shouldn't it❤️? Apparently Hitler spawned a huge populace of animals who prey upon one another! ",
            "date": "Answered October 30, 2017",
            "views": "43",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Peña",
                "href": "/profile/Michael-Peña-5"
            },
            "answer_text": "You are not born with it. Hate is taught! ",
            "date": "Answered October 21, 2017",
            "views": "7",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dan Laskow",
                    "user_href": "/profile/Dan-Laskow"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rehna Fayaz",
                "href": "/profile/Rehna-Fayaz"
            },
            "answer_text": "Lol is it strange half pakistani guy with a white mother needs to feel superior to you. Is it awful the guy wishes his father was white. ",
            "date": "Answered January 7, 2018",
            "views": "8",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paul Zahn",
                "href": "/profile/Paul-Zahn-1"
            },
            "answer_text": "Racism is basing ones feelings about another race, ethnicity, ect, SOLELY on superficial feelings. But many times, perceptions are actually based on actual actions & behaviors, that is not racism. ",
            "date": "Answered October 30, 2017",
            "views": "39",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Debbie Evans",
                "href": "/profile/Debbie-Evans-38"
            },
            "answer_text": "Hereditary no! Ignorance is correct! Hereditary is a genetic. Racism isn't a genetic it's learned and spread through generations of lack of knowledge. You can either choose to become or not. I choose to color blind in that and other aspects of life. I certainly don't blame genetics, that's absurd! This World is full of people that it's their way or it's wrong. Having seen this is sad. History is bound to repeat itself if we don't all try to educate ourselves. Learn before you leap! ",
            "date": "Answered August 24, 2017",
            "views": "109",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Len Gould",
                "href": "/profile/Len-Gould"
            },
            "answer_text": "Assigning characteristics to people with whom the “someone” is not personally in a position to know whether the characteristic is true or not, based solely on some arbitrary identifying characteristic such as skin colour etc. unrelated to the characteristic assigned. ",
            "date": "Answered January 8, 2018",
            "views": "19",
            "upvotes": "0"
        }
    ]
}