{
    "title": "What happens when calcium and magnesium react with water? What are the equations to explain it? - Quora",
    "tags": [
        "Magnesium",
        "Calcium",
        "Water"
    ],
    "response": [
        {
            "author_info": {
                "name": "Raveen Thennakoon",
                "href": "/profile/Raveen-Thennakoon"
            },
            "answer_text": "When you go from top to bottom, the reactivity (regarding electron loss) gets higher. So Calcium reacts with water normally as Sodium does. Ca + 2H2O = Ca(OH)2 + H2 You can observe a gas getting exerted, thus providing an evidence for a chemical reaction. However, with Magnesium, things seem to be a bit different. Unlike Calcium, Magnesium has its valence shell electrons much closer to the nucleus than Calcium. Hence, it’s so hard to remove those two electrons from the valence shell with the energy in cool water. (Cool water or tap water has low temperature values, therefore low energy values) If you want to observe a chemical reaction with Magnesium, you need to have hot water. Hot water has enough energy to react with Magnesium, as hot water has high-energy particles rather than tapwater. Mg + 2H20 = Mg(OH)2 + H2 With steam, The equation gets much more complicated. Steam has much higher energy so it has enough energy to dissociate the hydroxide into water providing magnesium oxide and hydrogen gas. Mg + H20 = MgO + H2 ",
            "date": "Answered April 11, 2018",
            "views": "25",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chinmayi KB",
                    "user_href": "/profile/Chinmayi-KB"
                },
                {
                    "user_id": "Nhi Pham",
                    "user_href": "/profile/Nhi-Pham-66"
                },
                {
                    "user_id": "Fabio Breitenschmitzer",
                    "user_href": "/profile/Fabio-Breitenschmitzer"
                },
                {
                    "user_id": "Manish",
                    "user_href": "/profile/Manish-878"
                },
                {
                    "user_id": "Sonu Kumar",
                    "user_href": "/profile/Sonu-Kumar-4682"
                },
                {
                    "user_id": "Joh Nbo Sco",
                    "user_href": "/profile/Joh-Nbo-Sco"
                },
                {
                    "user_id": "Samuel Mahtab",
                    "user_href": "/profile/Samuel-Mahtab"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mohammad Sayed Immam",
                "href": "/profile/Mohammad-Sayed-Immam"
            },
            "answer_text": "Calcium is more reactive than magnesium. Calcium reacts with water to form calcium hydroxide and hydrogen gas. On the other hand,magnesium does not react with cold water but reacts with hot water to form magnesium hydroxide and hydrogen gas. Ca + 2H2O = Ca(OH)2 + H2 Mg + 2H2O = Mg(OH)2 + H2 ",
            "date": "Answered October 1, 2020",
            "views": "129",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bhanu Kode",
                    "user_href": "/profile/Bhanu-Kode-1"
                }
            ]
        }
    ]
}