{
    "title": "What is the biggest line of B.S. you've heard regarding COVID-19? - Quora",
    "tags": [
        "COVID-19 Pseudoscience",
        "Federal Government of the United States",
        "COVID-19 (2019-2020)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Guy D McCardle, Jr.",
                "href": "/profile/Guy-D-McCardle-Jr"
            },
            "answer_text": "Beware this man. He is the devil incarnate. Buy nothing he sells, believe nothing he says. He is a convicted fraudster trying to make money off of a frightened public by selling them tap water in a blue bottle.  ** This is Jim Bakker. Does he look familiar?  ** This also Jim Bakker in less felonious times with his then-wife Tammy Faye. When times are bad, most of us bond together and do what we can to help our fellow Americans. We’ve witnessed numerous scenes of the bravery of nurses, doctors, and first responders taking care of the victims of COVID-19. They often work back to back shifts with minimal personal protective equipment and a genuine chance of infection. On the other hand, there is always an element that sees mass tragedy and death as a way for them to make money. These are the fraudsters, the charlatans, and the snake oil salesmen. Enter one James Bakker. Does that name ring any bells? He is the octogenarian featured in the photo above. Back in the ’80s, he was a televangelist who hosted The PTL Club television program. Bakker was one of those, “send money now” guys. Ends up, the reverend flew a little too close to the sun and sold his flock tens of thousands of vouchers good for an annual three-night stay in a luxury hotel he was supposedly building. The problem was, Bakker built only one 500 bed hotel. Demand far exceeded capacity. Baker raised enough money to build two hotels and pocketed the rest. Justice caught up to Bakker, and he was convicted of 45 counts of fraud and sentenced to 45 years in federal prison. On appeal, it was cut back to eight years. The bottom line is, you’ve got to protect yourself from this guy. Somehow, he’s managed to get another TV show. It has the not too original name of “The James Bakker Show.” Damn, I could have thought of that. He’s doing his best to exploit the fears of the faithful and desperate by selling a supposed “cure” to COVID-19.  Here is an example of his salesmanship: On his February 12th broadcast, Bakker was holding up a blue and silver bottle as he questioned his guest, so-called “natural health expert,” Sherrill Sellman, who was sitting next to him. Turning to Sellman, Bakker said, “This influenza that is now circling the globe, you’re saying that Silver Solution would be effective.” She replied, “Well, let’s say it hasn’t been tested on this strain of the coronavirus, but it has been tested on other strains of the coronavirus and has been able to eliminate it within 12 hours. Totally eliminates it. Kills it. Deactivates it. And then it boosts your immune system so then you can support the recovery, because when you kill the virus, then the immune system comes into action to clear it out. So you want a vibrant immune system as well as an ability to deactivate these viruses.” She continued, “(Silver Solution) has been proven by the government that it has the ability to kill every pathogen it has ever been tested on, including SARS and HIV.” That’s some mighty powerful snake oil they are peddling. And a four-ounce bottle can be yours today only for the low, low price of $80. You may be asking, what do I get for my $80? The label states that the solution contains deionized water, but no other ingredients. First off, anyone who has had Chemistry 101 knows that a solution has to have more than one component to be called a solution. Secondly, you don’t need to have an MD to know that deionized water isn’t going to kill coronavirus, SARS, and HIV while at the same time boosting your immune system. Not a word of the sales pitch is accurate. I’ll bet it’s not even deionized water. It is probably tap water from some shady sweatshop in a bad part of town. The US Food and Drug Administration and the Federal Trade Commission warned Bakker that selling “unapproved new drugs” was a violation of federal law. Shortly after receiving the warnings, the product was no longer available from his website or Facebook page. Even though he has stopped selling the products, the government is still seeking a temporary restraining order ensuring that Bakker can’t slither out of his hole again and start selling the product in the future. Until there is a vaccine or real treatment for COVID-19, be sure to maintain social distancing, exercise good hand hygiene, and try to stay as physically and mentally healthy as possible. Remember, for every James Bakker out there; there are a hundred dedicated healthcare workers, first responders, and research scientists working around the clock to ensure a COVID-free future. ",
            "date": "Answered April 17, 2020",
            "views": "959",
            "upvotes": " View 3.8K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dave Billingsley",
                    "user_href": "/profile/Dave-Billingsley"
                },
                {
                    "user_id": "Panji Pandawa",
                    "user_href": "/profile/Panji-Pandawa"
                },
                {
                    "user_id": "Laurie Kidd",
                    "user_href": "/profile/Laurie-Kidd"
                },
                {
                    "user_id": "Marianne Hiller",
                    "user_href": "/profile/Marianne-Hiller-1"
                },
                {
                    "user_id": "Glenda Christian",
                    "user_href": "/profile/Glenda-Christian-3"
                },
                {
                    "user_id": "John Giunta",
                    "user_href": "/profile/John-Giunta-6"
                },
                {
                    "user_id": "Alejandro Gutiérrez",
                    "user_href": "/profile/Alejandro-Gutiérrez-5"
                },
                {
                    "user_id": "Khan Ubaid-ur-Rehman",
                    "user_href": "/profile/Khan-Ubaid-ur-Rehman"
                },
                {
                    "user_id": "Emma Ramshaw",
                    "user_href": "/profile/Emma-Ramshaw-2"
                },
                {
                    "user_id": "Jeffrey Hines",
                    "user_href": "/profile/Jeffrey-Hines-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew McCombs",
                "href": "/profile/Andrew-McCombs"
            },
            "answer_text": "“We’re all in this together.” Repeated over, and over, and over, and over, ad infinitum. “Thank you for your cooperation in these unprecedented times.” Repeated over, and over, and over, and over, ad infinitum. “We are all one. We are global citizens.” Repeated over, and over, and over, and over, ad infinitum. Silent Weapons for Quiet Wars. This is all an attempt to defeat humanity using a combination of contrived or semi-contrived events to induce terror and confusion, along with an absolutely blatant (and pathetically transparent) global propaganda campaign the likes of which history has never seen before. They overplayed their hand. It’s obvious. Even if Covid-19 is somewhat dangerous, there are a million other solutions to this problem. Instead, we get: “GLOBALISM….. because….reasons. Shut up, stupid!” ",
            "date": "Answered April 17, 2020",
            "views": "379",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sylvia Kovessy",
                    "user_href": "/profile/Sylvia-Kovessy"
                },
                {
                    "user_id": "Deniz",
                    "user_href": "/profile/Deniz-234"
                },
                {
                    "user_id": "Zsolt Pamuki",
                    "user_href": "/profile/Zsolt-Pamuki"
                },
                {
                    "user_id": "Leo Enticknap",
                    "user_href": "/profile/Leo-Enticknap"
                },
                {
                    "user_id": "Daniel Latimer",
                    "user_href": "/profile/Daniel-Latimer-8"
                },
                {
                    "user_id": "Jared Ryan",
                    "user_href": "/profile/Jared-Ryan-25"
                },
                {
                    "user_id": "Joel Joseph",
                    "user_href": "/profile/Joel-Joseph-100"
                },
                {
                    "user_id": "Brian Navarra",
                    "user_href": "/profile/Brian-Navarra"
                },
                {
                    "user_id": "Marcia Lupo",
                    "user_href": "/profile/Marcia-Lupo-1"
                }
            ]
        }
    ]
}