{
    "title": "What are the various career options after engineering? - Quora",
    "tags": [
        "Engineering Career Choices",
        "Jobs and Careers in Engineering ",
        "Engineering Careers",
        "Engineering Jobs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jasmine Paul",
                "href": "/profile/Jasmine-Paul-10"
            },
            "answer_text": "My advice for every b.tech aspirant(or otherwise) out there will be to study as hard as possible during your 4 years of college and try to engage in extra-curricular activities too. Whether you are forced by your parents or you really are an engineering maniac, try to study hard whatever is put in front of you. Learn it,understand it and then hate it finally if you want. For example, I can never tell you biriyani is my favourite food if I have not tried it. Similarly, if you want to know your real passion, study your subjects. Know them. Your B.tech degree will never make you an engineer. Of course, you can get an engineer tag through your campus placements but there is only a very little chance for you to end up in a real engineering role where your ideas are valued and solutions subjected to experimentation. You are going to put yourself in various fields in these 4 years. And that’s when you realize the following :- You are an engineer if your heart throbs for more practical knowledge than marks. If you love working with models ,machines, coding , screws, electricity for fun. If you want to rip open each and every device, to see what is inside. To know what is inside. This does not include showing off to other friends about your tech skills. Real lovers are silent and magnificent. You are an mba material if you like speaking to crowds and leading them , understand what is time management and team playing, can tolerate marketing techniques and corporate thinking. If you are able to manage groups of differently mannered people calmly when they are in their most aggressive form. If you like selling stuff, be it idea or product for business. You are “others” if you are least interested in both. Now “Others” is the most golden area to be in. You have tons of cool possibilities if you are “others” like arts, sports, entrepreneurship, creative ideas. film making,fashion designing etc…whatever makes your heart skip a beat.It’s you. Now, after all the steps which you have been practising throughout your four years , you still have no clue as to where does your heart lie . That’s where your marks come to your rescue. Since you have studied so hard like I advised, you are sure to land on a placement.Take it and enjoy being independent and bossy around your parents and relatives for a while, say an year. Think about yourself during this one year and I’m sure you will spot out that one thing which you are interested in. If your dream is too risky and you do not know whether you will prosper in it or not, try it as your hobby after your work hours. Once you are sure your idea will hit the sweet crowds out there , then yes, resign. Play safe. Play risky while you are absolutely safe. :) Thank you for reading this. Just 4 more very important things ,I would like you to let you know secretly out of love. 1} Getting a back paper is not the end of the world. I advise you not to get one but also never to go depressed if you get one. 2}Work on your language skills. Whether you hail from the family line of Ambani or from a local english medium school, work hard on this, Trust me , this might be the only one thing which is going to save you in future. Watch english series , movies, listen to english news channels and read,read ,read a lot. 3}Make very good friends. Friends in college are for life. Who knows maybe they will end up helping you during your most troubled times or be your life partner ;) 4}Do not fall in any kind of addictions. This will demotivate you and keep you unfocused. Trust me , its more dangerous than you think .It is not very cool. Please consider this as a statement which is coming from your own sister. I have seen guys and girls with a multitude of talents who did not reach anywhere just because of their addictions. When they woke up, it was too late. All the very best! ",
            "date": "Updated March 13, 2019",
            "views": "589",
            "upvotes": " View 322 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/GOKULNAATH-BASKAR"
                },
                {
                    "user_id": "Sahana Kharvi",
                    "user_href": "/profile/Sahana-Kharvi-1"
                },
                {
                    "user_id": "Uniall Pharma",
                    "user_href": "/profile/Uniall-Pharma"
                },
                {
                    "user_id": "Gokul Krisshna",
                    "user_href": "/profile/Gokul-Krisshna"
                },
                {
                    "user_id": "Akanksha Maloo",
                    "user_href": "/profile/Akanksha-Maloo-1"
                },
                {
                    "user_id": "Vishal Verma",
                    "user_href": "/profile/Vishal-Verma-472"
                },
                {
                    "user_id": "Harshita",
                    "user_href": "/profile/Harshita-147"
                },
                {
                    "user_id": "Shubham Raj",
                    "user_href": "/profile/Shubham-Raj-1756"
                },
                {
                    "user_id": "Gaurav Singh Negi",
                    "user_href": "/profile/Gaurav-Singh-Negi-7"
                },
                {
                    "user_id": "Nandadev Menon",
                    "user_href": "/profile/Nandadev-Menon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kasee Sreenivas",
                "href": "/profile/Kasee-Sreenivas"
            },
            "answer_text": "If you are from India, you can check this out..I don't know much about opportunities abroad. If you are technically strong and wish to contribute something to the subject, go for M.S in U.S or M.Tech in India. You can then go for research. If you wish to set up a business or join an MNC or find a job and interested in pure management kind of stuff, go for MBA in India. (Attempt CAT) If you like both, go for techno-management courses like Project Management / Industrial Management etc. You get a white collar job with a decent pay after completion of these programmes. Some colleges are listed below where you can pursue these kind of courses. --------------------------------------------------------------- For Civil, Mechanical, Electrical, Instrumentation, Production Engineers, this will be helpful. National Institute of Industrial Engineering (NITIE) - Mumbai National Institute of Industrial Engineering is one of the top B-Schools in India, located in Powai near Vihar Lake in Mumbai, India. It offers several programmes like: Post Graduate Diploma in PROJECT MANAGEMENT(PGDPM) Post Graduate Diploma in Industrial Management (PGDIM) These Courses are accredited as MBA equivalent by UGC (University Grants Commission) ------------------------------------------------------------- For Civil, Mechanical Engineers, this will be helpful. National Institute of Construction Management and Research Programmes offered from Pune, Hyderabad, Goa and Indore. Visit their website for more details. NICMAR gives more weight on Managerial aspects of Construction. (Costliest option of all :D ) Page on nicmar.ac.in Been there: Kasee Sreenivas's answer to How is life at NICMAR Pune? -------------------------------------------------------------- If you are a civil engineer, these options will be more helpful. Construction Technology and Management course -IIT Delhi and IIT - Madras Construction Technology and Management course -IIT Delhi gives more weight on Technical Aspects of Construction. RICS School of Built Environment, Amity University (UGC Approved) Set up in early 2013 as an industry led initiative, it is supported by leading employers & Ministry of Urban Development. It offers several programmes like: MBA in Real Estate and Urban Infrastructure, MBA in Construction Project Management, MBA in Construction Economics & Quantity Surveying, MBA in Infrastructure Management etc Global Institute of Construction Management and Research This institute provides Post Graduate Diploma in some courses (AICTE approved) For more details, visit GICMAR (Global Institute of Construction Management and Research) Maharashtra Institute of Technology - Pune This institute provides Post Graduation Diploma in Project & Construction Management. All are equally good from career point of view.  Other opportunities are: 1. IES : Indian Engineering Services. Believe me. You are now eligible to apply. (EVEN CIVIL SERVICES) 2. PSU : If you are technically strong, you can apply for PSU's. Nowadays they are mainly dependent on GATE score. So, prepare hard for GATE. Give your best shot. Some Government departments like Department of Atomic energy etc conduct their own exams for recruitment. Follow their advertisements. 3. State Government Jobs : Comparatively easy to crack (You know how tough it is to crack IES ?) You are even eligible for Bank Jobs in India. (Bank PO's) 4. Jobs @ Core companies. Go to their respective websites, search for CAREERS option, speak to HR persons or mail them your resume. If luck favours you, you might get a call for attending their interviews. You have many other options. I just enlisted what all came to my mind.  Which one to choose? I am not the right person to decide it for you :) All the best :)  Follow this for more: (For Indian Civil Engineers) Opportunities for Civil Engineers in India ",
            "date": "Answered February 13, 2016",
            "views": "887",
            "upvotes": " View 84 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nagesh Pulamarasetti",
                    "user_href": "/profile/Nagesh-Pulamarasetti"
                },
                {
                    "user_id": "Gaurav Singh Negi",
                    "user_href": "/profile/Gaurav-Singh-Negi-7"
                },
                {
                    "user_id": "Adithya T Sunil",
                    "user_href": "/profile/Adithya-T-Sunil"
                },
                {
                    "user_id": "Soubhik Mazumdar",
                    "user_href": "/profile/Soubhik-Mazumdar"
                },
                {
                    "user_id": "Sriram Chinta",
                    "user_href": "/profile/Sriram-Chinta"
                },
                {
                    "user_id": "Madan M",
                    "user_href": "/profile/Madan-M-31"
                },
                {
                    "user_id": "Zahid Masoom",
                    "user_href": "/profile/Zahid-Masoom-1"
                },
                {
                    "user_id": "Ayush Lohani",
                    "user_href": "/profile/Ayush-Lohani-5"
                },
                {
                    "user_id": "Sayali Mane",
                    "user_href": "/profile/Sayali-Mane-32"
                },
                {
                    "user_id": "Snarky Hype",
                    "user_href": "/profile/Snarky-Hype"
                }
            ]
        }
    ]
}