{
    "title": "What is political science? - Quora",
    "tags": [
        "Learning About Political Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Stinson",
                "href": "/profile/Mark-Stinson-15"
            },
            "answer_text": "What is political science? (A2A from two Quorans - thanks for asking) There are already a lot of outstanding answers, so I am not sure that I can contribute much more to the discussion than has already been put forward, but I’ll give it my best shot. The first is that the simple answer is almost always wrong and the complex answer is seldom right. The simple answer is that political science studies people and the ways in which they govern themselves and that answer is pretty much wrong because you have to already know the answer for the answer to make sense. The more complex answer is that political science is a group of subdisciplines that all fall under the same umbrella of trying to describe the small-r reality of a group of people (nations, states, localities, or whatever), how they make decisions as a group and how they enforce and implement the decisions they reach. There are four generally accepted areas of study, but “generally accepted” means that political scientists pretty much agree on these and there are some/many who do not. (1) Political Theory: this subdiscipline mostly grows out of philosophy and tries to create a set of rational and internally consistent “rules” or “principles” to explain what can be observed in the real world. You might further subdivide this into normative (what should be) and positive (what is) approaches, but I promise (pinky swear) that this is a rabbit hole that should be approached with extreme caution because there is no answer that everyone will agree is “right” and few that even a majority will support. (2) Comparative Politics: this subdiscipline mostly looks at how different cultures and societies produce different institutions, normative assumptions, and outcomes. For example, while the United States and the United Kingdom come from identical cultural, religious, and historical backgrounds (1607 is a reasonable but not uncontested break-point), they produced radically different political systems. An American “liberal” would probably be quite comfortable in the UK’s Conservative Party, for example (issues related to immigration, among others, would likely be an exception), but not in the Republican Party. Why and what are its effects? (3) Methodology: once you have framed the question, what constitutes an acceptable answer? What is acceptable evidence? How should that information be gathered? Which conclusions can be drawn from it and which conclusions are suspect/arguable? Lots of math, probabilities, and statistics in here, but also a lot of room for anecdotal or qualitative data in here. I like to think of it as the difference between what is possible (qualitative) and what is probable (quantitative), but that’s a major oversimplification. (4) International Relations: this kind of combines #1 and #2, but it focuses specifically on interactions between nations (whatever those might be) rather than politics within a nation. At the time that I did my undergraduate work, there were only a handful of approaches to questions in this area (realism or realpolitik being the dominant approach), but now there are dozens. All of them provide a slightly different lens through which these questions can be viewed and that difference produces a lot of different is/isn’t conclusions, leading to an even larger variety of approaches. The fifth category is going to be specific to the nation/country being examined. For the United States it’s conveniently labeled “Americanist” (very convenient), but it looks at questions involving the actors, institutions, and outcomes in a particular country and the answers are going to vary because of that. It would be extremely unreasonable to expect similar processes to produce similar outcomes in the American Congress (House and Senate) as those from the Russian Duma or the Japanese Diet, for example. It happens, but those folks are concerned with politics in individual countries. You can toss in areas like Public Policy, Law, Judiciary, state/local and the rest. I think most would probably agree that one or more of those are separate fields, but there is also a good argument that they are combinations of the big four/five. I’m not sure that I have given a really good answer to what political science is (even Bill Clinton had problems with what “is” is), but it’s hopefully a reasonable description of what it tries to understand. ",
            "date": "Answered May 31, 2019",
            "views": "2",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "TEAM BADYANGS",
                    "user_href": "/profile/TEAM-BADYANGS"
                },
                {
                    "user_id": "Ahmed Qureshi",
                    "user_href": "/profile/Ahmed-Qureshi-16"
                },
                {
                    "user_id": "Saniya Tiwari",
                    "user_href": "/profile/Saniya-Tiwari-1"
                },
                {
                    "user_id": "Lyaan Estremos",
                    "user_href": "/profile/Lyaan-Estremos"
                },
                {
                    "user_id": "Ghebrejummah Al Jaber",
                    "user_href": "/profile/Ghebrejummah-Al-Jaber"
                },
                {
                    "user_id": "Praise James",
                    "user_href": "/profile/Praise-James-9"
                },
                {
                    "user_id": "Isabel Musafare",
                    "user_href": "/profile/Isabel-Musafare"
                },
                {
                    "user_id": "Sean Carter",
                    "user_href": "/profile/Sean-Carter-135"
                }
            ]
        },
        {
            "author_info": {
                "name": "Augusta Vivian",
                "href": "/profile/Augusta-Vivian"
            },
            "answer_text": "Political science is a social science which deals with systems of governance, and the analysis of political activities, political thoughts and political behaviour. Political science focuses on the theory and practice of government and politics at the local, state, national, and international levels. We are dedicated to developing understandings of institutions, practices, and relations that constitute public life and modes of inquiry that promote citizenship. Etymologically, the term political science or politics has been derived from the Greek word’Polis’, which means the City- State or the State. Hence Political Science deals with the problems of City or the State in which men live. It is, therefore, defined as the study of the activities of the state. Some scholars definition : Seeley: “Political Science investigates the Phenomena of Government as Political Economy deals with wealth. Biology with life, Algebra with numbers and Geometry with space and magnitude”. Paul Janet: “Political Science is that part of science which treats of the foundations of the State, and principles of government.” Laski: “The study of politics concerns itself with the life of man in relation to organized States.” David Easton: “Political Science is concerned with the authoritative allocation of values for a society.” Bryce: “Politics is the conduct of public affairs for private advantage”. Hillman: “Politics is the science of who gets what, when and why.” Bottomore: “Political institutions are concerned with the distribution of powers in society.” ",
            "date": "Answered July 20, 2017",
            "views": "10",
            "upvotes": " View 26 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jatinder Dhillon",
                    "user_href": "/profile/Jatinder-Dhillon-62"
                },
                {
                    "user_id": "Saniya Tiwari",
                    "user_href": "/profile/Saniya-Tiwari-1"
                },
                {
                    "user_id": "Alexander Max",
                    "user_href": "/profile/Alexander-Max-19"
                },
                {
                    "user_id": "Waqar Alam",
                    "user_href": "/profile/Waqar-Alam-35"
                },
                {
                    "user_id": "Debasmita Mondal",
                    "user_href": "/profile/Debasmita-Mondal-15"
                },
                {
                    "user_id": "Felix Marcsen Gyamera",
                    "user_href": "/profile/Felix-Marcsen-Gyamera"
                },
                {
                    "user_id": "Sita Devi",
                    "user_href": "/profile/Sita-Devi-160"
                },
                {
                    "user_id": "kumar prakash",
                    "user_href": "/profile/kumar-prakash-73"
                },
                {
                    "user_id": "Saachi Grover",
                    "user_href": "/profile/Saachi-Grover-2"
                },
                {
                    "user_id": "Salim Raza",
                    "user_href": "/profile/Salim-Raza-41"
                },
                {
                    "user_id": "RangTalks",
                    "user_href": "/profile/RangTalks"
                },
                {
                    "user_id": "Lawrence Ejukwa",
                    "user_href": "/profile/Lawrence-Ejukwa"
                },
                {
                    "user_id": "Anju Chhikara",
                    "user_href": "/profile/Anju-Chhikara"
                },
                {
                    "user_id": "Praveen Kumar Kumar",
                    "user_href": "/profile/Praveen-Kumar-Kumar-18"
                },
                {
                    "user_id": "Hussain Karimi",
                    "user_href": "/profile/Hussain-Karimi-2"
                },
                {
                    "user_id": "DoLismita Borah",
                    "user_href": "/profile/DoLismita-Borah"
                },
                {
                    "user_id": "Abigail Motaung",
                    "user_href": "/profile/Abigail-Motaung"
                },
                {
                    "user_id": "Devesh Kr Yadav",
                    "user_href": "/profile/Devesh-Kr-Yadav"
                },
                {
                    "user_id": "Shoaib Mir",
                    "user_href": "/profile/Shoaib-Mir-23"
                },
                {
                    "user_id": "Varalakshmi Reddy",
                    "user_href": "/profile/Varalakshmi-Reddy-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vincent Lewis",
                "href": "/profile/Vincent-Lewis-53"
            },
            "answer_text": "Per University of Washington: What is Political Science? Political science focuses on the theory and practice of government and politics at the local, state, national, and international levels. We are dedicated to developing understandings of institutions, practices, and relations that constitute public life and modes of inquiry that promote citizenship. Some of the major subfields are described below. Political Theory Political theory is concerned mainly with the foundations of political community and institutions. It focuses on human nature and the moral purposes of political association. To clarify these concepts, political theorists draw on enduring political writings from ancient Greece to the present and on various writings by moral philosophers. Political theory also focuses on empirical research into the way political institutions function in practice. Here political theorists subject beliefs about political life found in important political writings to re-examination in the light of ongoing human behavior. In either case, political theory seeks to ultimately deepen political thinking and to spur citizens to responsible and creative political action. POL S 201, Introduction to Political Theory, provides students with an overview of the main lines of thought in political theory. Advanced courses focus on given concepts, topics, and thought in political theorizing. Comparative Politics Comparative politics is a broad field with a variety of approaches and goals. Some scholars and researchers compare contemporary political systems in order to judge which types best provide particular values: order, equality, freedom, or economic security and well-being for their citizens. Others suggest that the main purpose of comparative politics is to provide an understanding of how and why different societies develop different kinds of political institutions. Still others use comparative politics as a way of discovering general laws and theories that will explain human political behavior and its variability. Comparative politics courses are of two basic types. One offers comparisons of a particular set of problems or institutions in a number of different countries. The second type offers in-depth analyses of the basic political institutions and processes of a single country or group of countries in a world region. Most students will want to begin their study of comparative politics with the Introduction to Comparative Politics (POL S 204), which combines the two main approaches by including comparative discussions of particular problems, issues, processes, and institutions in a wide variety of political settings as well as in-depth readings and lectures on some of the major countries in the contemporary world. International Relations The field of international relations is concerned with developing an understanding of why states and non-state international actors, like the United Nations and multinational corporations, interact as they do. International relations is a diverse field both in terms of what kinds of behavior are studied and how they are studied. International conflict, particularly war, continues to be an important focus of the field. Why do wars start? Who wins and why? How can wars be prevented? What is the role of international law and organizations? As the world has become more interdependent, scholars have become more aware of the importance of international economic activity. As a result, scholars are analyzing world trade, communications, development, foreign investment, and international finance. How states make foreign policy decisions is another important area of study. National security policy, nuclear deterrence, arms control and defense spending decisions are typical examples of foreign policy decisions. POL S 203, International Relations, introduces the student to International politics. This is the foundation for a wide variety of offerings at the 300 and 400 levels, such as American foreign policy, global environmental politics, international political economy, and international conflict. American Government and Politics Students of American government and politics seek an understanding of politics as practiced in the United States. In addition to courses on the American presidency, the U.S. Congress, and the courts, the department offers specialized courses on such topics as the political role of mass media, the politics of race and ethnicity, constitutional law, policy formation, state politics, and American political thought. Some of the broad questions that concern students in this field are: How and why did American political institutions, ideas, and practices develop as they have? How does one go about evaluating them? Are American political institutions, ideas and practices unique, or are they similar to other societies? How might American politics be improved? POL S 202, Introduction to American Politics, is recommended preparation for most other courses in American Politics. To acquire first-hand experience with the American political system, students are encouraged to participate in academic internships in Washington D.C., Olympia, or Seattle. Political Methodology The subfield of political methodology is concerned using the philosophical bases of governmental technology, personal technology, empirical analysis design and analysis, and practical area study knowledge. Courses inside governmental methodology field cover philosophical problems with respect to the likelihood of a science of politics, the similarities and differences when considering political science as well as other personal sciences, alternative modes of description, and the truth of knowledge claims. Additionally they study the formulation of experimental and non-experimental research designs to make causal inferences about political processes and behavior and explore the. usage of data, math and computers for analysis of political data generated by these types of analysis designs. Pupils are supplied a way to perform specific and team studies through seminars. The governmental methodology faculty have actually current study and training interests such diverse subjects as media, feminist principle, language politics, political economy, rational option concept, and general public plan. ",
            "date": "Answered April 12, 2020",
            "views": "559",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sona Jain",
                    "user_href": "/profile/Sona-Jain-103"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kenneth Teague",
                "href": "/profile/Kenneth-Teague"
            },
            "answer_text": "Per University of Washington: What is Political Science? Political science focuses on the theory and practice of government and politics at the local, state, national, and international levels. We are dedicated to developing understandings of institutions, practices, and relations that constitute public life and modes of inquiry that promote citizenship. Some of the major subfields are described below. Political Theory Political theory is concerned mainly with the foundations of political community and institutions. It focuses on human nature and the moral purposes of political association. To clarify these concepts, political theorists draw on enduring political writings from ancient Greece to the present and on various writings by moral philosophers. Political theory also focuses on empirical research into the way political institutions function in practice. Here political theorists subject beliefs about political life found in important political writings to re-examination in the light of ongoing human behavior. In either case, political theory seeks to ultimately deepen political thinking and to spur citizens to responsible and creative political action. POL S 201, Introduction to Political Theory, provides students with an overview of the main lines of thought in political theory. Advanced courses focus on given concepts, topics, and thought in political theorizing. Comparative Politics Comparative politics is a broad field with a variety of approaches and goals. Some scholars and researchers compare contemporary political systems in order to judge which types best provide particular values: order, equality, freedom, or economic security and well-being for their citizens. Others suggest that the main purpose of comparative politics is to provide an understanding of how and why different societies develop different kinds of political institutions. Still others use comparative politics as a way of discovering general laws and theories that will explain human political behavior and its variability. Comparative politics courses are of two basic types. One offers comparisons of a particular set of problems or institutions in a number of different countries. The second type offers in-depth analyses of the basic political institutions and processes of a single country or group of countries in a world region. Most students will want to begin their study of comparative politics with the Introduction to Comparative Politics (POL S 204), which combines the two main approaches by including comparative discussions of particular problems, issues, processes, and institutions in a wide variety of political settings as well as in-depth readings and lectures on some of the major countries in the contemporary world. International Relations The field of international relations is concerned with developing an understanding of why states and non-state international actors, like the United Nations and multinational corporations, interact as they do. International relations is a diverse field both in terms of what kinds of behavior are studied and how they are studied. International conflict, particularly war, continues to be an important focus of the field. Why do wars start? Who wins and why? How can wars be prevented? What is the role of international law and organizations? As the world has become more interdependent, scholars have become more aware of the importance of international economic activity. As a result, scholars are analyzing world trade, communications, development, foreign investment, and international finance. How states make foreign policy decisions is another important area of study. National security policy, nuclear deterrence, arms control and defense spending decisions are typical examples of foreign policy decisions. POL S 203, International Relations, introduces the student to International politics. This is the foundation for a wide variety of offerings at the 300 and 400 levels, such as American foreign policy, global environmental politics, international political economy, and international conflict. American Government and Politics Students of American government and politics seek an understanding of politics as practiced in the United States. In addition to courses on the American presidency, the U.S. Congress, and the courts, the department offers specialized courses on such topics as the political role of mass media, the politics of race and ethnicity, constitutional law, policy formation, state politics, and American political thought. Some of the broad questions that concern students in this field are: How and why did American political institutions, ideas, and practices develop as they have? How does one go about evaluating them? Are American political institutions, ideas and practices unique, or are they similar to other societies? How might American politics be improved? POL S 202, Introduction to American Politics, is recommended preparation for most other courses in American Politics. To acquire first-hand experience with the American political system, students are encouraged to participate in academic internships in Washington D.C., Olympia, or Seattle. Political Methodology The subfield of political methodology is concerned with the philosophical bases of political science, social science, empirical research design and analysis, and practical field research experience. Courses in the political methodology field cover philosophical issues regarding the possibility of a science of politics, the similarities and differences between political science and other social sciences, alternative modes of explanation, and the truth of knowledge claims. They also examine the formulation of experimental and non-experimental research designs for making causal inferences about political processes and behavior and explore the. use of statistics, mathematics and computers for the analysis of political data generated by such research designs. Students are also provided an opportunity to conduct individual and group research projects through seminars. The political methodology faculty have current research and teaching interests in such diverse topics as mass media, feminist theory, language politics, political economy, rational choice theory, and public policy. ",
            "date": "Answered November 25, 2017",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ranjan Tripathi",
                    "user_href": "/profile/Ranjan-Tripathi-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Lawrence",
                "href": "/profile/Jeff-Lawrence-43"
            },
            "answer_text": "Political science, also called government, is a social science which deals with systems of governance, and the analysis of political activities, political thoughts and political behaviour. It deals extensively with the theory and practice of politics which is commonly thought of as determining of the distribution of power and resources. Political scientists \"see themselves engaged in revealing the relationships underlying political events and conditions, and from these revelations they attempt to construct general principles about the way the world of politics works.\" Political science comprises numerous subfields, including comparative politics, political economy, international relations, political theory, public administration, public policy and political methodology. Furthermore, political science is related to, and draws upon, the fields of economics, law, sociology, history, philosophy, geography, psychology, and anthropology. Comparative politics is the science of comparison and teaching of different types of constitutions, political actors, legislature and associated fields, all of them from an intrastate perspective. International relations deals with the interaction between nation-states as well as intergovernmental and transnational organizations. Political theory is more concerned with contributions of various classical and contemporary thinkers and philosophers. Political science is methodologically diverse and appropriates many methods originating in social research. Approaches include positivism, interpretivism, rational choice theory, behaviouralism, structuralism, post-structuralism, realism, institutionalism, and pluralism. Political science, as one of the social sciences, uses methods and techniques that relate to the kinds of inquiries sought: primary sources such as historical documents and official records, secondary sources such as scholarly journal articles, survey research, statistical analysis, case studies, experimental research and model building. ",
            "date": "Answered August 3, 2017",
            "views": "625",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Driscoll",
                    "user_href": "/profile/John-Driscoll-40"
                },
                {
                    "user_id": "Ross Nkama",
                    "user_href": "/profile/Ross-Nkama"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chandrasekaran Avanavadi Sundaram Iyer",
                "href": "/profile/Chandrasekaran-Avanavadi-Sundaram-Iyer"
            },
            "answer_text": "What is political science in simple words? Political science isa branch of social sciencethat is concerned with theory, description, analysis and prediction ofpolitical behavior,political systems andpolitics.Thus Political science is the study of politics and power from domestic, international, and comparative perspectives. It entails understanding political ideas, ideologies, institutions, policies, processes, and behavior, as well as groups, classes, government, diplomacy, law, strategy, and war.The purpose of studying this subject is to deepen knowledge and understanding of one of the most powerful forces operating on people, communities and corporations today, namely government and politics in the USA and around the world.This knowledge and understanding is valuable for all citizens.Who is called the father of political science? Aristotle The antecedents of Wester politics can be traced back to the Socratic political philosophers, such as Aristotle (\"The Father of Political Science\") (384–322 BC). Aristotle was one of the first people to give a working definition of political science. Political science, as Aristotle developed it, therefore, is the science (episteme) or knowledge of human action within a field of ends reaching from the highest (the divine reality) to the lowest existent things in the order of being.",
            "date": "Answered September 11, 2020",
            "views": "546",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Nazarene Joy Nicor",
                    "user_href": "/profile/Nazarene-Joy-Nicor"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tanvi Khera",
                "href": "/profile/Tanvi-Khera-2"
            },
            "answer_text": "Hello Aspirants, Political science is that branch of the social sciences that studies the state, politics, and government. Political Science deals extensively with the analysis of political systems, the theoretical and practical applications to politics, and the examination of political behavior. The Greek thinker, Aristotle, defined political science as the study of the state. Many political scientists view themselves as being engaged in fleshing out the connections between political events and conditions, and by this understanding they hope to construct a system of general principles that posit the way the world of politics works. Political science is not a standalone field and it intersects many other branches like sociology, economics, history, anthropology, public policy among others. Political scientists are much sought after these days because of the changing landscape of politics across the world and since the society wants to understand how the political world works, they need someone to explain the nuances of the political economy. Any casual perusal of the newspapers and the television channels reveals that political scientists are at the forefront of debates and discussions for their knowledge and expertise. Scope of Political Science The scope of political science is vast and experts have divided the field of political science into five sub-disciplines that are political theory, public administration, comparative politics, international relations, and public law. It needs to be noted that these sub-disciplines cover the entire gamut of the modern political economy and provide the basis for the study and understanding of how the global political economy works. The study of the matters concerning the allocation and distribution as well as the transfer of power is one of the main preoccupations of political scientists. The success or otherwise of the governance structures is gauged by political scientists who examine the multifaceted and multilayered factors at work that contribute to good or bad governance. The scope of the political scientists has now been broadened to include the realm of the study of the democratic elections across the world. In other words, with the explosion in the political systems all over the world, political scientists, and their scope of study has been considerably enhanced. Top Universities in India Delhi Technological University, Delhi University of Calcutta SASTRA University, Thanjavur Lovely Professional University, Punjab APJ Abdul Kalam Technological University, Thiruvananthapuram Anna University, Chennai University of Allahabad, Allahabad Takecare and All the Best!!! ",
            "date": "Answered September 20, 2018",
            "views": "41",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Saniya Tiwari",
                    "user_href": "/profile/Saniya-Tiwari-1"
                },
                {
                    "user_id": "Guddu Baghel",
                    "user_href": "/profile/Guddu-Baghel-2"
                },
                {
                    "user_id": "Aman Vishwakarma",
                    "user_href": "/profile/Aman-Vishwakarma-76"
                },
                {
                    "user_id": "Praise James",
                    "user_href": "/profile/Praise-James-9"
                },
                {
                    "user_id": "Nemichand Khichar",
                    "user_href": "/profile/Nemichand-Khichar-2"
                },
                {
                    "user_id": "William Hendrick",
                    "user_href": "/profile/William-Hendrick-10"
                },
                {
                    "user_id": "Amita Arya",
                    "user_href": "/profile/Amita-Arya-11"
                },
                {
                    "user_id": "Alexander Max",
                    "user_href": "/profile/Alexander-Max-19"
                },
                {
                    "user_id": "Pallavi Awhale",
                    "user_href": "/profile/Pallavi-Awhale"
                },
                {
                    "user_id": "Vaishnavi Kathalkar",
                    "user_href": "/profile/Vaishnavi-Kathalkar"
                },
                {
                    "user_id": "Star",
                    "user_href": "/profile/Star-493"
                },
                {
                    "user_id": "RangTalks",
                    "user_href": "/profile/RangTalks"
                },
                {
                    "user_id": "Dalouzii Konah",
                    "user_href": "/profile/Dalouzii-Konah"
                },
                {
                    "user_id": "Mohammad Khaleel",
                    "user_href": "/profile/Mohammad-Khaleel-14"
                },
                {
                    "user_id": "Subham Kar",
                    "user_href": "/profile/Subham-Kar-18"
                },
                {
                    "user_id": "Fayesash Bayabao",
                    "user_href": "/profile/Fayesash-Bayabao"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sam Qwato",
                "href": "/profile/Sam-Qwato"
            },
            "answer_text": "Q. What is political science? What does it study? (1) There’s alot of uncertainty, if not confusion, on what constitutes Political philosophyPolitical sciencePoliticsThis answer explains the three. It starts with Political Philosophy because that’s the starting point, from ideas through practice. (2) Political Philosophy (PP) It attempts to answer these questions. How does politics contribute to the well-being or otherwise of people?What is ‘The Good Life’? How is it achieved?What principles and values should be used to shape and judge political institutions?What sort of society will best allow its citizens to flourish?What do we really mean by equality, justice and freedom?Is it ever right to go to war? (Sam Qwato's answer to What are the principles of the Just War Theory?)Is it ever right to rebel against a government?What responsibility should government have for dealing with the global issues of terroism or the environment?PP is about good government. What does it involve? How is it to be regulated? How it is brought about? It’s about the principles that help people decide whether any particular government is to be judged good or bad. It requires an examination of the fundamental principles of government. Why we need government?What its goals should be?How is it to be regulated?If it goes wrong, how to repair or replace it?PP may be seen as a branch of Ethics, or Moral Philosophy. Ethics looks at all issues of right and wrong in the way people treat one another, while PP limits itself to the specific issues related to our collective or political life. The ethics of social organization, applied across society. PP is Normative - this is what people should do.As opposed to ‘descriptive’ - this is what people actually do.(3) Political Science (PS) PS is ‘descriptive’, as opposed to ‘normative’. PS describes actual political societies or institutions.It’s the study of politics.It’s a study of the way in which nations and empires have have developed and spread globally, the study of Political geography.It’s the study of how economics (finance, trade and the markets) shape society.(4) Politics Politics itself can be a practical, mechanical business. Sorting out how best to deliver agreed benefits, and so on. If it were only that, there would be few political issues to discuss. Every form of government would be judged simply on the basis of its delivery track record. But, life is not so straightforward. Our daily news feed is full of colorful, dramatic political animations that keep us hopeful, entertained, amused, flabbergasted, shocked, disgusted in equal measures. People disagree, ad nauseam, on the principles upon which society should be run. This perpetual tension brings us full circle back to PP! (5) PP, Politics and Economics Ultimately, PP is about ends. What we seek to achieve through Politics.Once the ends are agreed on, Politics and Economics are the delivery arms.But, political and economic systems tend to generate their own ends. So, these too are scrutinized within PP. (6) Piqued? Immerse here: Sam Qwato's answer to What are the classics of political philosophy? (7) On political ideologies: Sam Qwato's answer to What is political ideology?Sam Qwato's answer to What inspires political ideology?(8) Ideas, philosophies and politics in live action: An illustration: Sam Qwato's answer to Why are some Americans so opposed to universal healthcare? ",
            "date": "Answered August 10, 2017",
            "views": "32",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gabe Gronlund",
                    "user_href": "/profile/Gabe-Gronlund"
                },
                {
                    "user_id": "Kundan Kumar",
                    "user_href": "/profile/Kundan-Kumar-522"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Marks",
                "href": "/profile/Paul-Marks-12"
            },
            "answer_text": "“Political Science” is the study of politics - both the theory of politics (going off into Political Philosophy) and the practice of politics - how people win elections, get Bills passed and so on. Whether the study of politics should be called a “science” depends on whether one thinks that the word “science” should be reserved for the physical sciences (such as physics) or can be used in relation to the “human sciences” as well. Certainly the same method can NOT be used in relation to politics as it is in the study of physics and the other physical sciences. Treating human beings as if they (we) are not beings (have no free will - no agency) and are just collections of chemicals which are, in turn, collections of atoms - is a very bad way way to study politics. So the term “political science” is fine - as long as one does not try to use the “scientific method” of the physical sciences - and remembers that the word “science” originally meant just a body of knowledge, or area of study. By the way the use of mathematics to try and “plan” society goes back at least to the economist Sir William Petty in the mid 17th century, and (in some ways) goes all the way back to Plato. It is a very bad way of trying to understand human affairs - human action and conduct. ",
            "date": "Answered August 7, 2017",
            "views": "14",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Priyanka Sharma",
                    "user_href": "/profile/प्रियंका-शर्मा-Priyanka-Sharma"
                },
                {
                    "user_id": "Amy Marshall",
                    "user_href": "/profile/Amy-Marshall-41"
                },
                {
                    "user_id": "Som Bath",
                    "user_href": "/profile/Som-Bath-2"
                },
                {
                    "user_id": "Simon Kirui",
                    "user_href": "/profile/Simon-Kirui-1"
                },
                {
                    "user_id": "Alvin Rodriguez",
                    "user_href": "/profile/Alvin-Rodriguez-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wayne Francis",
                "href": "/profile/Wayne-Francis"
            },
            "answer_text": "Political science is the study of government, its policies, the decision making process and the outcomes from those policies and processes. It is the narrow area within the social sciences which study society and our relationships within society, but don't let that mislead you. It is a very complex science that involves a lot of fields like economics,sociology,religion,psychology,anthropologyand many other fields. People with political science degrees have a wide variety of jobs they can go into besides just governments positions. Businesses will hire people with these skills to help predict and respond to changes within the laws and consumers reactions. Often companies will become proactive in the process in attempts to have policies and laws enacted that will benefit them the most. Other organisations such as charities will often use people with this same skill set to help implement plans to further the causes on which they're focused. ",
            "date": "Updated May 20, 2018",
            "views": "124",
            "upvotes": " View 30 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ghebrejummah Al Jaber",
                    "user_href": "/profile/Ghebrejummah-Al-Jaber"
                },
                {
                    "user_id": "Yash Bendale",
                    "user_href": "/profile/Yash-Bendale-2"
                },
                {
                    "user_id": "Praise James",
                    "user_href": "/profile/Praise-James-9"
                },
                {
                    "user_id": "Harmas Amjad",
                    "user_href": "/profile/Harmas-Amjad"
                },
                {
                    "user_id": "Nockz Turna",
                    "user_href": "/profile/Nockz-Turna"
                },
                {
                    "user_id": "Evan Smith",
                    "user_href": "/profile/Evan-Smith-394"
                },
                {
                    "user_id": "Akki Sunariya",
                    "user_href": "/profile/Akki-Sunariya"
                },
                {
                    "user_id": "Jeode Obedozā",
                    "user_href": "/profile/Jeode-Obedozā"
                },
                {
                    "user_id": "Alejandro Feliu",
                    "user_href": "/profile/Alejandro-Feliu"
                },
                {
                    "user_id": "Muhammad Saeed Kt",
                    "user_href": "/profile/Muhammad-Saeed-Kt"
                },
                {
                    "user_id": "Gwydion Madawc Williams",
                    "user_href": "/profile/Gwydion-Madawc-Williams"
                },
                {
                    "user_id": "YANAMALA RAMU",
                    "user_href": "/profile/YANAMALA-RAMU-2"
                },
                {
                    "user_id": "Ronin Tuwhangai",
                    "user_href": "/profile/Ronin-Tuwhangai"
                },
                {
                    "user_id": "William Elliott",
                    "user_href": "/profile/William-Elliott-29"
                },
                {
                    "user_id": "Jason Rebello",
                    "user_href": "/profile/Jason-Rebello-6"
                },
                {
                    "user_id": "Laga Bi",
                    "user_href": "/profile/Laga-Bi"
                },
                {
                    "user_id": "Aaron Jocker",
                    "user_href": "/profile/Aaron-Jocker"
                },
                {
                    "user_id": "Mohammad Akram",
                    "user_href": "/profile/Mohammad-Akram-192"
                },
                {
                    "user_id": "Subhash Somu",
                    "user_href": "/profile/Subhash-Somu"
                },
                {
                    "user_id": "Arshita Mavi",
                    "user_href": "/profile/Arshita-Mavi"
                },
                {
                    "user_id": "Limongkam Tikhak",
                    "user_href": "/profile/Limongkam-Tikhak"
                },
                {
                    "user_id": "Vishal Garla",
                    "user_href": "/profile/Vishal-Garla"
                },
                {
                    "user_id": "Donna Joaquino",
                    "user_href": "/profile/Donna-Joaquino"
                },
                {
                    "user_id": "Manu Gupta",
                    "user_href": "/profile/Manu-Gupta-237"
                },
                {
                    "user_id": "Vidushi Gupta",
                    "user_href": "/profile/Vidushi-Gupta-55"
                },
                {
                    "user_id": "Marife Hegakit",
                    "user_href": "/profile/Marife-Hegakit"
                },
                {
                    "user_id": "Moehan",
                    "user_href": "/profile/Moehan"
                },
                {
                    "user_id": "Jobelyn Candido",
                    "user_href": "/profile/Jobelyn-Candido"
                },
                {
                    "user_id": "Daryl Tew",
                    "user_href": "/profile/Daryl-Tew"
                },
                {
                    "user_id": "Mika Brox",
                    "user_href": "/profile/Mika-Brox"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ankit Hooda",
                "href": "/profile/Ankit-Hooda"
            },
            "answer_text": "Political science or government is a social science which deals with systems of governanace and analysis of political thought (philosophy) and political behaviour (theory). It deals with theory and practices which supposedly are factors determining the distribution of power and economic resources . It has following sub-fields political theory/philosophycomparative politicspolitical economypublic policy and administrationinternational relations (theories and practice)political methodologyit draws upon nearly all fields of social sciences, sociology, anthropology, economics , law etc. There are various ways and methods that can be used to approach political science. These are: logical positivism (empirical method), Behaviouralism (individual and group behaviour),structuralism (allocation of functions), institutionalism (organisations with specific objectives), rational choice, public choice theory (balance of power between people and state, common interest), normative principles (expected outcomes) and natural reason (impartiality). It studies how government is constituted, how government functions (structure), what are its policies and what is their impact/success. Its success can be measured by testing where it stands on meeting certain objectives. These objectives are: security and stability, justice of all kinds, development- social and economic, also cultural (mainly education). ",
            "date": "Answered August 10, 2018",
            "views": "18",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Esnala Banda",
                    "user_href": "/profile/Esnala-Banda"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vilnis Krumins",
                "href": "/profile/Vilnis-Krumins"
            },
            "answer_text": "It's a number of things ... It can be a critical examination of politics (i.e., what subjects are important in a political culture and why). For example, Why is a politician's personal life relevant in some cultures and not in others?Why are business criminals executed in some cultures and, relatively, immune to punishment in others?How important is religion in politics?It can be a critical examination of the structures used in a society to resolve and manage differences between groups in the society. This would include how authority is divided between various institutions,how membership to those institutions is determined, andhow laws are enacted, managed and enforced,and this can include the politics of private organizations (e.g., private corporations). It can be an examination of the history of politics: How and why political institutions and political culture change through time (if at all).What things influence those changes,what connections exist between political events, orwhat differences exist in a culture at different times, etc.Of course, it can also be an examination of the methodology of political science: Who has written about the subject andhow have opinions about it changed through time.What methods are used to \"characterize\" a \"political culture\" or compare them, andhow valid are those methods,etc.",
            "date": "Updated May 20, 2018",
            "views": "27",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sakshi Rai",
                    "user_href": "/profile/Sakshi-Rai-48"
                },
                {
                    "user_id": "Vidushi Gupta",
                    "user_href": "/profile/Vidushi-Gupta-55"
                },
                {
                    "user_id": "Marife Hegakit",
                    "user_href": "/profile/Marife-Hegakit"
                },
                {
                    "user_id": "Jobelyn Candido",
                    "user_href": "/profile/Jobelyn-Candido"
                },
                {
                    "user_id": "Rhea Fe Fallera",
                    "user_href": "/profile/Rhea-Fe-Fallera"
                },
                {
                    "user_id": "Khaliq Kakar",
                    "user_href": "/profile/Khaliq-Kakar"
                },
                {
                    "user_id": "Sidharth Nambiar",
                    "user_href": "/profile/Sidharth-Nambiar-1"
                },
                {
                    "user_id": "Vv Ramkumar",
                    "user_href": "/profile/Vv-Ramkumar"
                },
                {
                    "user_id": "Elina Geller",
                    "user_href": "/profile/Elina-Geller"
                },
                {
                    "user_id": "Abdul Rahman",
                    "user_href": "/profile/Abdul-Rahman-153"
                },
                {
                    "user_id": "Jawad A. Pullin",
                    "user_href": "/profile/Jawad-A-Pullin"
                },
                {
                    "user_id": "Youssef Ben-Youssef",
                    "user_href": "/profile/Youssef-Ben-Youssef"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gagan Kaur",
                "href": "/profile/Gagan-Kaur-149"
            },
            "answer_text": "Dear student, Political science is that branch of the social sciences that studies the state, politics, and government. Political Science deals extensively with the analysis of political systems, the theoretical and practical applications to politics, and the examination of political behavior. The Greek thinker, Aristotle, defined political science as the study of the state. Many political scientists view themselves as being engaged in fleshing out the connections between political events and conditions, and by this understanding they hope to construct a system of general principles that posit the way the world of politics works. Political science is not a standalone field and it intersects many other branches like sociology, economics, history, anthropology, public policy among others. Political scientists are much sought after these days because of the changing landscape of politics across the world and since the society wants to understand how the political world works, they need someone to explain the nuances of the political economy. Any casual perusal of the newspapers and the television channels reveals that political scientists are at the forefront of debates and discussions for their knowledge and expertise. Scope of Political Science The scope of political science is vast and experts have divided the field of political science into five sub-disciplines that are political theory, public administration, comparative politics, international relations, and public law. It needs to be noted that these sub-disciplines cover the entire gamut of the modern political economy and provide the basis for the study and understanding of how the global political economy works. The study of the matters concerning the allocation and distribution as well as the transfer of power is one of the main preoccupations of political scientists. The success or otherwise of the governance structures is gauged by political scientists who examine the multifaceted and multilayered factors at work that contribute to good or bad governance. The scope of the political scientists has now been broadened to include the realm of the study of the democratic elections across the world. In other words, with the explosion in the political systems all over the world, political scientists, and their scope of study has been considerably enhanced. Top Universities in India Delhi Technological University, Delhi University of Calcutta SASTRA University, Thanjavur Lovely Professional University, Punjab APJ Abdul Kalam Technological University, Thiruvananthapuram Anna University, Chennai University of Allahabad, Allahabad Good Luck ",
            "date": "Answered July 7, 2018",
            "views": "35",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Saniya Tiwari",
                    "user_href": "/profile/Saniya-Tiwari-1"
                },
                {
                    "user_id": "Alexander Max",
                    "user_href": "/profile/Alexander-Max-19"
                },
                {
                    "user_id": "Sijan Raj Mahat",
                    "user_href": "/profile/Sijan-Raj-Mahat"
                },
                {
                    "user_id": "Fayesash Bayabao",
                    "user_href": "/profile/Fayesash-Bayabao"
                },
                {
                    "user_id": "Daipayan Choudhury",
                    "user_href": "/profile/Daipayan-Choudhury"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Fox",
                "href": "/profile/Stephen-Fox-57"
            },
            "answer_text": "Perhaps you have no access to Wikipedia? “Political science is a social science which deals with systems of governance, and the analysis of political activities, political thoughts, and political behavior. It deals extensively with the theory and practice of politics which is commonly thought of as determining of the distribution of power and resources. Political scientists \"see themselves engaged in revealing the relationships underlying political events and conditions, and from these revelations they attempt to construct general principles about the way the world of politics works.\" Political science—occasionally called politicology—comprises numerous subfields, including comparative politics, political economy, international relations, political theory, public administration, public policy, and political methodology. Furthermore, political science is related to, and draws upon, the fields of economics, law, sociology, history, philosophy, geography, psychology/psychiatry, and anthropology.” Aristotle (384-322 BCE) is known as the father of political science. Aristotle was a Greek philosopher who wrote on a wide range of subjects, including natural science, poetry, ethics and geology. He is called the father of political science largely because of his work entitled Politics. ",
            "date": "Answered May 15, 2019",
            "views": "360",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sean Carter",
                    "user_href": "/profile/Sean-Carter-135"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vivek Rohan Sharma",
                "href": "/profile/Vivek-Rohan-Sharma"
            },
            "answer_text": "We all are engaged in politics whether we know this fact or not. So every human being do some political activity and have some political ideas/belief. This political activity and belief have strong impact on any society and State/Country. A state functions on the belief of their people, and Political Science studies all this functions and impact on state. Thus Political Science is the study of human behavior in Politics.Politics Science is the study of State/Government.Political Science is the study of Authority and its legitimisation.Political Science is the study of Power.Political Science is the study of relationship between people and State and between two States.Political Science searchs the better and the best political society, what are the best situation for people and state to achieve Good Life. What kind of laws are good for people and what are bad ones.Well, there is no one and definite defination of Political Science. There is no consensus among the Political Scientist on defination. Politics is, who gets what, when and how and study of this proces is called Political Science. — Lasswell. ",
            "date": "Updated May 20, 2018",
            "views": "26",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sana",
                    "user_href": "/profile/Sana-185"
                },
                {
                    "user_id": "Jasmine Siddiqui",
                    "user_href": "/profile/Jasmine-Siddiqui-7"
                },
                {
                    "user_id": "Aizat Zain",
                    "user_href": "/profile/Aizat-Zain"
                },
                {
                    "user_id": "Arvind Singh",
                    "user_href": "/profile/Arvind-Singh-1020"
                },
                {
                    "user_id": "Mohit Raj",
                    "user_href": "/profile/Mohit-Raj-56"
                },
                {
                    "user_id": "Tina Sharma",
                    "user_href": "/profile/Tina-Sharma-93"
                },
                {
                    "user_id": "Saurabh Raj",
                    "user_href": "/profile/Saurabh-Raj-156"
                }
            ]
        },
        {
            "author_info": {
                "name": "Minnie Graves",
                "href": "/profile/Minnie-Graves-1"
            },
            "answer_text": "“Political Science” is the study of politics - both the theory of politics (going off into Political Philosophy) and the practice of politics - how people win elections, get Bills passed and so on. Whether the study of politics should be called a “science” depends on whether one thinks that the word “science” should be reserved for the physical sciences (such as physics) or can be used in relation to the “human sciences” as well. Certainly the same method can NOT be used in relation to politics as it is in the study of physics and the other physical sciences. Treating human beings as if they (we) are not beings (have no free will - no agency) and are just collections of chemicals which are, in turn, collections of atoms - is a very bad way way to study politics. So the term “political science” is fine - as long as one does not try to use the “scientific method” of the physical sciences - and remembers that the word “science” originally meant just a body of knowledge, or area of study. By the way the using math to try to “plan” society dates back at the very least into economist Sir William Petty in the mid seventeenth century, and (in certain methods) goes all the way back to Plato. Its a rather bad method of attempting to understand real human affairs - human action and conduct. ",
            "date": "Answered April 11, 2020",
            "views": "993",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chitta Ranjan Ghorai",
                "href": "/profile/Chitta-Ranjan-Ghorai"
            },
            "answer_text": "At present the meaning of the political science is not limited to the study of the origin of state, nature of government, citizenship, public administration, rights and duties etc. Today a democratic form of government is the most accepted form of government. Today people should study political science not for only acquiring knowledge but it's implementation in the practical field. The success of the democratic set up of a country depends upon the politically conscious people. In order to form Public Opinion , the people should have a good knowledge in Political Science. So now a days the approach of studying Political Science is different in the sense of being more conscious about rights and entitlements and puting pressure upon the administrators for making them more sensitive in welfare legislation. ",
            "date": "Answered July 31, 2019",
            "views": "246",
            "upvotes": " Answer requested by Amit Kumar",
            "upvoters": [
                {
                    "user_id": "Bitthal Sarangi",
                    "user_href": "/profile/Bitthal-Sarangi"
                },
                {
                    "user_id": "Meenakshi Sundaram Meyyappan",
                    "user_href": "/profile/Meenakshi-Sundaram-Meyyappan"
                },
                {
                    "user_id": "Arvind Raja",
                    "user_href": "/profile/Arvind-Raja-4"
                },
                {
                    "user_id": "Bharath Kumar",
                    "user_href": "/profile/Bharath-Kumar-1046"
                }
            ]
        },
        {
            "author_info": {
                "name": "Avinaash Ravichanderan",
                "href": "/profile/Avinaash-Ravichanderan"
            },
            "answer_text": "Rodney King was an African-American taxi driver who was the victim of unwarranted police brutality in 1991. The acquittal of the accused in the case sparked off the 1992 Los Angeles Riots. During the riots, a desperate King made a television appearance, in which he made a fervent appeal for peace. He famously asked “Can we all get along?” This is the fundamental question that political science attempts to answer, the question of whether we can all get along. Full credits to one of my Professors for this answer. Great teachers not only explain ideas and concepts clearly, but also throw new light upon things and fundamentally transform one’s understanding of the world. From then on, I started looking at political science not just as a bunch of theories but as an exploration into one of the most basic aspects of the human condition. Hobbes, Locke, Rousseau and others started making much more sense. ",
            "date": "Answered May 1, 2018",
            "views": "18",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mohammed Saiful Alam Siddiquee",
                    "user_href": "/profile/Mohammed-Saiful-Alam-Siddiquee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Don Tracy",
                "href": "/profile/Don-Tracy-2"
            },
            "answer_text": "Answered Nov 24, 2017 Originally Answered: What is meant by political science? According to Wikipedia: Political science, also called government, is a social science which deals with systems of governance, and the analysis of political activities, political thoughts and political behavior. It deals extensively with the theory and practice of politics which is commonly thought of as determining the distribution of power and resources. Political scientists \"see themselves engaged in revealing the relationships underlying political events and conditions, and from these revelations they attempt to construct general principles about the way the world of politics works.\" Political science comprises numerous sub-fields, including comparative politics, political economy, international relations, political theory, public administration, public policy, and political methodology. Furthermore, political science is related to, and draws upon, the fields of economics, law, sociology, history, philosophy, geography, psychology, and anthropology. ",
            "date": "Updated August 10, 2018",
            "views": "554",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Frank Smitha",
                "href": "/profile/Frank-Smitha-1"
            },
            "answer_text": "Political Science, should we respect it or ignore it? What is it? It’s a social science, and in the opinion of some it is not a science at all. It’s gigantic: a study of governance, political philosophy, political behavior, macro-economics, human nature and recent history – a bundle that requires focus. It’s not like the physical sciences, but it’s an attitude that includes empiricism and rigorous thought. Political Science can be a guide for action for people outside or no longer in academia. It’s better than relying on one’s assumptions gut feelings. It’s a move against ignorance that if practiced by everyone in politics or punditry would save us from the vitriol and wordy spin common in today’s political discourse. Political Science requires from us more than passive attention. If we accept it we need to do so with our discretion sensors turned on. We need to be on guard against a writer who lets his ideology distort the empirically obvious (as has happened occasionally in the physical sciences). We need to be on guard against ideas put together by “cherry-picking” (biased selectivity). We need to be on guard against mere assumptions of causality. We need to understand public opinion polls as rough approximations. And what else? Weak definitions and overly simplistic labeling? It would be childishly utopian to believe that among the good work done by people in Political Science absolutely none of it is erroneous, and it would be primitive to dismiss Political Science or any other subject taught by our great universities because it is imperfect. And because of its benefits it would be nonsense to label interest in it as elitist. ",
            "date": "Answered December 6, 2019",
            "views": "283",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gatluak Yiel Yam",
                    "user_href": "/profile/Gatluak-Yiel-Yam"
                },
                {
                    "user_id": "Maryam Shah",
                    "user_href": "/profile/Maryam-Shah-32"
                }
            ]
        },
        {
            "author_info": {
                "name": "Drame Macire Said",
                "href": "/profile/Drame-Macire-Said"
            },
            "answer_text": "Political science first of all is a social science it has to do with knowledge that deals with the state and structure of government; the scientific analysis of political activity and behavior. Political science studies: Political Philosophy; Political theories and thoughts of different well known scholars. It has to do with politics, relationship between states that is to say International Affair, economy, security and social well-being so, political science is much more than what we actually think of. It covers all aspect of human life for example when there is an incident we make call and who are we calling? Undoubtedly firefighters department. to cut the explanation short, we cannot live without politics it is everywhere around us wherever we go touching all area of our life. People take to the street: To show their anger toward a situation To support a bill and a new law To ask for economic reform To ……. To………. ",
            "date": "Answered May 24, 2018",
            "views": "171",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "RUCHI PATEL",
                    "user_href": "/profile/RUCHI-PATEL-150"
                }
            ]
        },
        {
            "author_info": {
                "name": "Piyush Ranjan",
                "href": "/profile/Piyush-Ranjan-422"
            },
            "answer_text": "Political science is a science which deals with state and government. According to Garner “political science starts and ends with state .” The term political in its current usage is much comprehensive than politics. It connotes the whole range of knowledge regarding the state and embraces the theory of the state. It includes both theoretical politics and practical or applied politics. The three major branches of political science today seems to be 1.political science proper :2. Public administration and international relations. While the latter two are really branches of political science, on account of their great importance in the modern world, there is a increasing tendency to give them an almost independent status. ",
            "date": "Answered November 14, 2017",
            "views": "925",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sean Carter",
                    "user_href": "/profile/Sean-Carter-135"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roland Temmerman",
                "href": "/profile/Roland-Temmerman-1"
            },
            "answer_text": "Hey Sean. Political science is the study of politics and power from domestic, international, and comparative perspectives. It entails understanding political ideas, ideologies, institutions, policies, processes, and behavior, as well as groups, classes, government, diplomacy, law, strategy, and war. A political scientist studies political and governmental behavior as a career, in order to aid campaigns in elections, analyze voting patterns for lobbyists, and create models to predict future political trends. That’s basically what political science is… ",
            "date": "Answered June 20, 2019",
            "views": "138",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Hazrat Ali",
                    "user_href": "/profile/Hazrat-Ali-194"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shah Zaman",
                "href": "/profile/Shah-Zaman-59"
            },
            "answer_text": "What is meant by political science? According to Wikipedia: Political science, also called government, is a social science which deals with systems of governance, and the analysis of political activities, political thoughts and political behavior. It deals extensively with the theory and practice of politics which is commonly thought of as determining the distribution of power and resources. Political scientists \"see themselves engaged in revealing the relationships underlying political events and conditions, and from these revelations they attempt to construct general principles about the way the world of politics works.\" Political science comprises numerous sub-fields, including comparative politics, political economy, international relations, political theory, public administration, public policy, and political methodology. Furthermore, political science is related to, and draws upon, the fields of economics, law, sociology, history, philosophy, geography, psychology, and anthropology. ",
            "date": "Answered September 6, 2018",
            "views": "200",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chijioke Onyeulo",
                    "user_href": "/profile/Chijioke-Onyeulo"
                },
                {
                    "user_id": "Rich Pratt",
                    "user_href": "/profile/Rich-Pratt-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Louis Nnamuchi",
                "href": "/profile/Louis-Nnamuchi"
            },
            "answer_text": "Question: What is political science in brief? Answer: I have nothing to do with Politics. I saw the above question and also saw an answer from Augusta Vivian of ESUT, Enugu and I thought I could re -reproduce that answer of July 20, 2017. She wrote thus: “’ Political Science is a social science which deals with systems of governance and the analysis of political behavior. Political Science focuses on the theory and practice of government and politics at the local, state, national and international levels. The author went to recite definitions of Political Science by some scholars, namely: Seeley, Paul Janet, Laski, David Easton , Bryce, Hillman and Bottomore. Also worth reading is the answer by Sam Qwato on August 10, 2017. He spent useful time to define : (a) Political Philosophy (b) Political Science , and (c) Politics. Superb write up ; a must read. ",
            "date": "Answered November 3, 2019",
            "views": "212",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aditya Mishra",
                    "user_href": "/profile/Aditya-Mishra-472"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Thompson",
                "href": "/profile/Richard-Thompson-624"
            },
            "answer_text": "Rodney King was an African-American taxi driver who was the victim of unwarranted police brutality in 1991. The acquittal of the accused in the case sparked off the 1992 Los Angeles Riots. During the riots, a desperate King made a television appearance, in which he made a fervent appeal for peace. He famously asked “Can we all get along?” here is the fundamental question that political research attempts to answer, the question of whether we could all get on. Full credits to 1 of my teachers for this answer. Great teachers not only clarify tips and concepts plainly, additionally put new light upon things and fundamentally transform one’s understanding of society. From after that on, we started evaluating governmental technology not only as a lot of theories but as an exploration into very basic areas of the real human problem. Hobbes, Locke, Rousseau and others started making so much more feeling. ",
            "date": "Answered April 6, 2020",
            "views": "61",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Beth Johnson",
                "href": "/profile/Beth-Johnson-42"
            },
            "answer_text": "Well, according to Merriam-Webster, it is defined as: a social science concerned chiefly with the description and analysis of political and especially governmental institutions and processes. What is poli-sci to ME? Simply put, the study/investigation/research of the government and political structure of any given nation. My undergraduate concentration was on our American political system. Upon graduation I began my M.P.A. (Master of Public Administration) program, which is similar to a M.B.A., but with an emphasis on the principles of governance. ",
            "date": "Answered July 24, 2018",
            "views": "241",
            "upvotes": " Answer requested by Zenniah Valencia",
            "upvoters": [
                {
                    "user_id": "Md Malik Azad",
                    "user_href": "/profile/Md-Malik-Azad"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Brewer",
                "href": "/profile/John-Brewer-13"
            },
            "answer_text": "Political Science is not a science, but is an academic discipline which focuses on governments and governmental systems, how they govern, and theories of governmental process. Political Science includes the study of foreign policies, and how different political systems influence the behavior of various governmental entities from county to international levels. Political Science is often studied as part of a pre-law major prior to law school. ",
            "date": "Answered March 3, 2019",
            "views": "117",
            "upvotes": " Answer requested by Abubakar Jafar",
            "upvoters": [
                {
                    "user_id": "Sean Carter",
                    "user_href": "/profile/Sean-Carter-135"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jay Dimes",
                "href": "/profile/Jay-Dimes"
            },
            "answer_text": "Political Science - noun - a social science dealing with political institutions and with the principles and conduct of government. the definition of political science a social science which deals with systems of governance, and the analysis of political activities, political thoughts and political behavior. It deals extensively with the theory and practice of politics which is commonly thought of as determining of the distribution of power and resources. Political science - Wikipedia ",
            "date": "Answered July 17, 2017",
            "views": "410",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aasif Dar",
                "href": "/profile/Aasif-Dar-6"
            },
            "answer_text": "Thanx for the question. For me political science is lifeline for me. It is the drug that keeps the love of books and studies alive in me and it is that anchor which i held when i was about to drown. Basically Political Science is a sub division of the realm of politics with other subdivisions namely Political theory and political pjilosophy. according to andrew heywood (Political theory) \"Political science is essentially empirical, claiming to describe, analyse and explain government and other political institutions in a rigorous and impartial manner.” ",
            "date": "Answered August 15, 2018",
            "views": "249",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Saud Ali",
                    "user_href": "/profile/Saud-Ali-24"
                },
                {
                    "user_id": "Shikha Chaudhary",
                    "user_href": "/profile/Shikha-Chaudhary-42"
                },
                {
                    "user_id": "Rhibhu G",
                    "user_href": "/profile/Rhibhu-G"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex Lemieux",
                "href": "/profile/Alex-Lemieux-7"
            },
            "answer_text": "The definition of political science could be as long as it has been studied whether it be comparative, theoretical, electoral, economic, methodological, relational, or any of the many other types of political studies. To pair it down to a short response, essentially it is the analysis of the political activities, thoughts, behavior, and reason used to accomplish a goal. Pragmatically, it could be seen as the study of the distribution of power and resources. ",
            "date": "Answered July 25, 2018",
            "views": "258",
            "upvotes": " Answer requested by Zenniah Valencia",
            "upvoters": [
                {
                    "user_id": "Sean Carter",
                    "user_href": "/profile/Sean-Carter-135"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Dunlap",
                "href": "/profile/David-Dunlap-5"
            },
            "answer_text": "Political science is the study of power relations in a society. It contains several branches, from the most abstract (political theory, Plato through Rawls) to the most concrete (mechanics of municipal government). Some political scientists (Larry Sabato being a good example) specialize in such niches as voting behavior. It’s a big tent, all directed to understanding various aspects of power relations in society. ",
            "date": "Answered August 7, 2017",
            "views": "608",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dilshad Ahmed Siddiqui",
                    "user_href": "/profile/Dilshad-Ahmed-Siddiqui"
                },
                {
                    "user_id": "Milan Basumatary",
                    "user_href": "/profile/Milan-Basumatary-3"
                },
                {
                    "user_id": "Jonam Manjeykhun",
                    "user_href": "/profile/Jonam-Manjeykhun"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christy Woodward Kaupert",
                "href": "/profile/Christy-Woodward-Kaupert"
            },
            "answer_text": "Hi Sean, the best way to describe Political Science is to say it is the study of government and the things that it does, although this is a very superficial definition. Our discipline has many subfields and include Public Administration, Political theory and philosophy, methodology and statistical analysis, American Institutions, Comparative Government or International Relations. ",
            "date": "Answered June 10, 2019",
            "views": "125",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "James Steinmetz",
                    "user_href": "/profile/James-Steinmetz-4"
                },
                {
                    "user_id": "Saurabh Raj",
                    "user_href": "/profile/Saurabh-Raj-156"
                },
                {
                    "user_id": "Vivek Rohan Sharma",
                    "user_href": "/profile/Vivek-Rohan-Sharma"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tabassum",
                "href": "/profile/Tabassum-24"
            },
            "answer_text": "The study of politics is usually seen to encompass three subdivisions.On one hand,there is POLITICAL SCIENCE and on the other hand there is POLITICAL THEORY and POLITICAL PHILOSOPHY. ‘Science’ refers to a means of acquiring knowledge through observations,experiments and measurements. Political Science is therefore essentially empirical,claiming to describe, analyse and explain government and other political institutions in impartial manner. ",
            "date": "Answered August 13, 2018",
            "views": "559",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Yosey Huff",
                    "user_href": "/profile/Yosey-Huff"
                },
                {
                    "user_id": "Sean Carter",
                    "user_href": "/profile/Sean-Carter-135"
                },
                {
                    "user_id": "Virginia Hanlon",
                    "user_href": "/profile/Virginia-Hanlon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Solomon Longpuan",
                "href": "/profile/Solomon-Longpuan"
            },
            "answer_text": "Political science has been defined from different angles perspective by many scholars too numerous to mention, but i guess that is not what you are after otherwise you would just google it. At this point i want to assume you want my opinion of what political science is. Haven said that, i think political science is basically the study of political processes and phenomena as it occurs in different countries across the world, why it happens and the resultant effects as it affects society and other aspects of life. I could go on but i just want to keep it short and basic since your question is not asking for anything further. Once you understand this you have a very good picture of political science. ",
            "date": "Answered May 28, 2019",
            "views": "152",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sean Carter",
                    "user_href": "/profile/Sean-Carter-135"
                },
                {
                    "user_id": "Jamie Vennix",
                    "user_href": "/profile/Jamie-Vennix-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob RJ Abrams",
                "href": "/profile/Bob-RJ-Abrams"
            },
            "answer_text": "Political science is a gateway curriculum. It can lead to a wide variety of jobs: CIA Analyst or Agent, City Planner, Congressional Office Staffer, Environmental Policy Analyst, Federal Government Analyst, Foreign Service Officer, Journalist, Political Correspondent, Juvenile Justice Specialist, Labor Relations Specialist, Lawyer, Lobbyist, Mediator, Non-Profit Program Manager, Policy Analyst, Political Commentator, Polling/Survey Analyst, Public Affairs Research Analyst, State Legislator, Urban Policy Planner. As for finding any “meaning” in political science, that’s up for debate. I think if there was any real meaning to it, the world might be a safer place. ",
            "date": "Answered June 11, 2018",
            "views": "373",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kartik Saini",
                "href": "/profile/Kartik-Saini-8"
            },
            "answer_text": "Political Science is one of the major subject of Art Stream..One can do Pol Science Hons in graduation or can take this subject in B.A Program or as GE in other courses..This subject helps us to analyse and discuss various policies,power relationships, politics..To become an aware and responsible citizen knowledge of Pol Science is must.. Sometimes,we adopt and use many principles of Pol Science but we are unaware of this fact.. ",
            "date": "Answered August 7, 2017",
            "views": "287",
            "upvotes": " Answer requested by Vivek Rohan Sharma"
        },
        {
            "author_info": {
                "name": "Sajjad Ali",
                "href": "/profile/Sajjad-Ali-523"
            },
            "answer_text": "Political science is not an exact science. But in political science we can rely on assumptions on the other hand in an exact science we cannot believe in assumptions. We are that’s why considered politics as political science because in it we evaluate a person and problematics of the society. Politics is a function to run a country’s system. In an exact science we experiment in a laboratory on the other hand in social sciences we experiment on different countries systems and different kinds of cultures practices. ",
            "date": "Answered September 6, 2018",
            "views": "146",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Subhash Mathur",
                "href": "/profile/Subhash-Mathur-8"
            },
            "answer_text": "Political science is a subject that examines Political systems around the world Constitutions and their functioning Political parties and pressure groups Parliamentary processes world over Practises and precepts of political science Impact of economic systems on political processes Study of important offices ,institutions and personalities Comparative systems of parliamentary procedures Behaviour of the electorate and the pattern of votes and voters Impact of international events on political systems . The gamut of activities is large and very meaningful ",
            "date": "Answered July 19, 2017",
            "views": "643",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bradley Snider",
                "href": "/profile/Bradley-Snider-1"
            },
            "answer_text": "The science of governments and political perspectives unique to each culture or community. Political science is the observation and comparison of governance of citizens within that community: the limitations of law and what customs they agree to protect their given rights within those laws. ",
            "date": "Answered June 11, 2017",
            "views": "263",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Timothy Wiedman",
                "href": "/profile/Timothy-Wiedman"
            },
            "answer_text": "Poly Sci is one of the disciplines among the social sciences that studies how groups of people govern their individual societies by creating systems of governmental structures, bodies of laws, and the legal enforcement apparatus to ensure that laws are generally followed so that civilizations can survive long-term. ",
            "date": "Answered November 4, 2019",
            "views": "69",
            "upvotes": " Answer requested by Kal Malerno"
        },
        {
            "author_info": {
                "name": "James Evans",
                "href": "/profile/James-Evans-270"
            },
            "answer_text": "Political science is an academic discipline that focuses on the theory and practice of government and politics at the local, state, national, and international levels. Political science strives to develop understandings of institutions, practices, and relations that constitute public life and modes of inquiry that promote citizenship. ",
            "date": "Answered August 3, 2017",
            "views": "88",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Srinivasaraghavan Sridharan",
                "href": "/profile/Srinivasaraghavan-Sridharan"
            },
            "answer_text": "The science of governance that combines ensuring of economic prosperity, safe and secured life, disparityless cooperative Existence is what is political science. This is what people in countries like Singapore, Sweden, Finland, Holland etc., think. But people in a few other countries may think that dividing and ruling people on the basis of caste and religion in order to stay in power is what is political science. ",
            "date": "Answered August 23, 2018",
            "views": "235",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Naveen JSingh",
                "href": "/profile/Naveen-JSingh"
            },
            "answer_text": "Apart from bookish language…… Political Science is the study of…. How to make life good and effective.It studies human behaviour, its ability to control(how to behave in) different situations. (e.g, Atal Bihari Vajpayee)Power relationships are central to a political scientist.The main concern is how to get it and how to use it legitimately. ☺",
            "date": "Answered April 28, 2017",
            "views": "15",
            "upvotes": " View 3 Upvoters "
        },
        {
            "author_info": {
                "name": "Steve Hayes",
                "href": "/profile/Steve-Hayes-28"
            },
            "answer_text": "Political science is the comparative study of political institutions and systems and theories of government, and how they are put into practice.. Someone once described it as “history without dates”, but that is not strictly true, because there is more to history than political and diplomatic history. ",
            "date": "Answered November 24, 2017",
            "views": "180",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Priyanka",
                "href": "/profile/Priyanka-1164"
            },
            "answer_text": "Political science focuses on the theory and practice of government and politics at the local, state, national, and international levels. We are dedicated to developing understandings of institutions, practices, and relations that constitute public life and modes of inquiry that promote citizenship. ",
            "date": "Answered December 12, 2017",
            "views": "267",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Hughes",
                "href": "/profile/Michael-Hughes-414"
            },
            "answer_text": "It is the study of politics throughout history from the comparison to different ideals to the societal cause for the change in ideals, etc. It is interesting, if taught well; but is often bastardized by the professors to suit their personal agenda, which is unfortunate. ",
            "date": "Answered August 17, 2018",
            "views": "89",
            "upvotes": " Answer requested by Kim Santiago"
        },
        {
            "author_info": {
                "name": "Sana",
                "href": "/profile/Sana-185"
            },
            "answer_text": "Your answer on this question is very apt, just to add to it- David Easton’s remarks- Authoritative allocation of values in a society sums it all. ",
            "date": "Answered August 7, 2017",
            "views": "340",
            "upvotes": " View 3 Upvoters "
        },
        {
            "author_info": {
                "name": "Nero Wright",
                "href": "/profile/Nero-Wright-1"
            },
            "answer_text": "Political Science is a field of study of the processes, principles, and structure of government and other political institutions. ",
            "date": "Answered June 24, 2019",
            "views": "70",
            "upvotes": " View 3 Upvoters "
        },
        {
            "author_info": {
                "name": "James Risner",
                "href": "/profile/James-Risner-6"
            },
            "answer_text": "I study political science, and I’d would say it’s certainly more political than a science. Basically the term political science means applying the scientific method, using statistical analysis, hypotheses and so forth to formulate actionable knowledge that conforms to reasonable assertions. Most political science isn’t predictive, but rather reactive. Finding out why events happened rather than attempting to find out what will happen. ",
            "date": "Answered September 17, 2017",
            "views": "232",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shintia Zaman Riva",
                "href": "/profile/Shintia-Riva-1"
            },
            "answer_text": "It’s the study of government and different branches of government, the analysis and functionality of each government as well the history and development of the braches. ",
            "date": "Answered June 18, 2019",
            "views": "127",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Harshita Sakshi",
                "href": "/profile/Harshita-Sakshi"
            },
            "answer_text": "THE STUDY OF SCIENCE IN THE FIELD OF POLITICS AND POLITICAL CULTURE IS KNOWN TO BE A POLITICAL SCIENCE. EVERYONE SHOULD GET THIS FIELD OF KNOWLEDGE BECAUSE WITH THE HELP OF THIS KNOWLEDGE YOU GET A VAST UNDERSTANDING OF THE SOCIAL AND CULTURAL UNDERSTANDING OF OUR POLITICS AND EVEN THOUGH ITS TRUE IN INDIA EVERYONE IS NOT AWARE OF OUR CONSTITUTION AND THIS CONSTITUTIONS GIVE US A RIGHT OF LIVING FREELY IN THIS BEAUTIFUL COUNTRY. PROUD TO BE INDIAN BUT PLEASE GIVE OUR CITIZENS A VAST UNDERSTANDING OF FUNDAMENTAL RIGHTS ",
            "date": "Answered July 18, 2017",
            "views": "176",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dr.kshitij Prabha",
                "href": "/profile/Dr-kshitij-Prabha"
            },
            "answer_text": "Politics is an art and craft of capturing political power of a state for governance and Political Science is systematic and scientific study of state, government, politics, diplomacy and Internatioanl relations. ",
            "date": "Answered March 16, 2018",
            "views": "272",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Benjamin Allen",
                "href": "/profile/Benjamin-Allen-17"
            },
            "answer_text": "The study of politics is the study of power. Power can range from individuals, to the state and multilateral systems. Power is how you get someone to do something they don't want to do. ",
            "date": "Answered August 13, 2017",
            "views": "40",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sharath Chandra",
                "href": "/profile/Sharath-Chandra-1138"
            },
            "answer_text": "Thanks for the A2A. Political science is the branch of knowledge that deals with the state and systems of government, the scientific analysis of political activity and behaviour.  ",
            "date": "Answered August 10, 2018",
            "views": "155",
            "upvotes": " Answer requested by Sudesh Singh"
        },
        {
            "author_info": {
                "name": "Brendan Illis",
                "href": "/profile/Brendan-Illis"
            },
            "answer_text": "One of my professor used to say that politics is the study “the nature and purpose of human association” which I think sums it up nicely ",
            "date": "Answered April 9, 2018",
            "views": "413",
            "upvotes": " Answer requested by Vasiq Nawaz"
        },
        {
            "author_info": {
                "name": "Les Connors",
                "href": "/profile/Les-Connors-1"
            },
            "answer_text": "Short version? It's the study of politics. Long version? It is a systematic study of institutions, philosophies, and interactions which have a profound effect on your daily life. ",
            "date": "Answered June 5, 2019",
            "views": "80",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vivek kumar",
                "href": "/profile/Vivek-kumar-9171"
            },
            "answer_text": "Its a systematic study of the state and it's institutions. Concerned with who gets what when and how ? Shaping and sharing of power, Authoritative allocation of values. ",
            "date": "Answered December 29, 2018",
            "views": "63",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Eliza Yoseva",
                "href": "/profile/Eliza-Yoseva"
            },
            "answer_text": "Political science is a branch from social science but it is specific about philosophy, rules,policy,history and politic itself. ",
            "date": "Answered January 5, 2019",
            "views": "35",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dan Appleton",
                "href": "/profile/Dan-Appleton-3"
            },
            "answer_text": "Political science is the use of statistics ops research and data analysis to engineer political campaigns. ",
            "date": "Answered November 3, 2019",
            "views": "50",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Patty Lacefield",
                "href": "/profile/Patty-Lacefield"
            },
            "answer_text": "The study of government, political systems and ideologies, as well as political behavior and associated activities. ",
            "date": "Answered November 3, 2019",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Naresh Dadhich",
                "href": "/profile/Naresh-Dadhich"
            },
            "answer_text": "Political Science is name of study of politics.The name is popular in USA and consequently in many countries including India. ",
            "date": "Answered July 31, 2019",
            "views": "34",
            "upvotes": " Answer requested by Amit Kumar"
        },
        {
            "author_info": {
                "name": "Mir Ashraf Ali",
                "href": "/profile/Mir-Ashraf-Ali-8"
            },
            "answer_text": "Political science is the study of a man in his relation with government and state ",
            "date": "Answered March 13, 2020",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Walter Thompson",
                "href": "/profile/Walter-Thompson-54"
            },
            "answer_text": "Political science is the description and analysis of political and governmental institutions and processes. ",
            "date": "Answered September 11, 2020",
            "views": "14",
            "upvotes": " Answer requested by Yanna Esperanza"
        },
        {
            "author_info": {
                "name": "Christyna Moore",
                "href": "/profile/Christyna-Moore"
            },
            "answer_text": "http://www.apsanet.org/content_9181.cfm?navID=727 ",
            "date": "Answered June 12, 2014",
            "views": "297",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "FAZLA RABBI",
                "href": "/profile/FAZLA-RABBI-19"
            },
            "answer_text": "Know Details ",
            "date": "Answered May 24, 2018",
            "views": "36",
            "upvotes": "0"
        }
    ]
}