{
    "title": "What is life cycle costing? - Quora",
    "tags": [
        "Life Cycle Costing",
        "Costing",
        "Life Cycles"
    ],
    "response": [
        {
            "author_info": {
                "name": "George Todorov",
                "href": "/profile/George-Todorov-4"
            },
            "answer_text": "Life-cycle cost analysis, also known as LCA is a tool which can help you analyze the overall economic sustanability of your assets. It can help you make the right decision whether to keep a certain asset or sell it if it produces more expenses rather than income. It is a great and powerful tool for for property owners who are looking to optimize property related processes. Here are the main benefits which come with using a LCA tool: Calculating the right budget for maintainance and repairs.The LCA will help you calculate the right budget and avoid any addiotional and unexpected project expenses.Learning in detail about all the costs of a certain property.LCA tools can be very helpful when it comes to getting a know-how of property expenses. You can be surprised of how many different expenses can occur from the purchase to the investment itself, all the way to energy costs and more.Maintenance.With the power of a LCA tool your team can for example schedule the exact maintenance expenses, without getting surprised with hidden ones. Also you can see whether you have all the demanded resources in stock.Public safety.Using a great LCA tool can help you determine whether a certain property is safe for residents. For example Andromeda systems have their own LCA system, you can have a look at the capabilties of their LCA, to have more clarity on the matter.",
            "date": "Answered August 13, 2018",
            "views": "450",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jorge Melton",
                "href": "/profile/Jorge-Melton"
            },
            "answer_text": "Life-cycle cost analysis (LCCA) is a tool to determine the most cost-effective option among different competing alternatives to purchase, own, operate, maintain and, finally, dispose of an object or process, when each is equally appropriate to be implemented on technical grounds. For example, for a highway pavement, in addition to the initial construction cost, LCCA takes into account all the user costs, (e.g., reduced capacity at work zones), and agency costs related to future activities, including future periodic maintenance and rehabilitation. All the costs are usually discounted and total to a present-day value known as net present value (NPV). This example can be generalized on any type of material, product, or system. ",
            "date": "Answered August 26, 2016",
            "views": "669",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rangana Sooriyaarachchi",
                    "user_href": "/profile/Rangana-Sooriyaarachchi"
                },
                {
                    "user_id": "Aditya Sivateja Ramakanth",
                    "user_href": "/profile/Aditya-Sivateja-Ramakanth"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mehrnaz Vs",
                "href": "/profile/Mehrnaz-Vs-1"
            },
            "answer_text": "I guess … Life cycle costing, or whole-life costing, is the process of estimating how much money you will spend on an asset over the course of its useful life. Whole-life costing covers an asset’s costs from the time you purchase it to the time you get rid of it. Buying an asset is a cost commitment that extends beyond its price tag. For example, think of a car. The car’s price tag is only part of the car’s overall life cycle cost. You also need to consider expenses for car insurance, interest, gas, oil changes, and any other necessary maintenance to keep the car running. Not planning for these additional costs can set you back. The cost to buy, use, and maintain a business asset adds up. Whether you’re purchasing a car, a copier, a computer, or inventory, you should consider and budget for the asset’s future costs. ",
            "date": "Answered May 3, 2020",
            "views": "67",
            "upvotes": "0"
        }
    ]
}