{
    "title": "What does the theory of evolution explain about living organisms? - Quora",
    "tags": [
        "Darwinism",
        "Evolutionary Theory",
        "Organisms",
        "Evolution (process)",
        "Human Evolution"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joel Henry Hinrichs",
                "href": "/profile/Joel-Henry-Hinrichs"
            },
            "answer_text": "Living organisms are the foam on top of a deep vessel of obsolete (extinct) species. Evolution is a picture (think of your color monitor) with its pixels supplied by data points uncovered by many, many distinct areas of scientific research and exploration. Year by year the picture acquires new detail and sharper focus. There is no “theory” since in science a thought about how things might work is a hypothesis that can be tested and proven false (falsified). Hypotheses that survive all attempts to disprove them acquire greater and greater support. At some time they come to appear rather obvious, and are called theories. Evolution isn’t falsifiable. It’s rather difficult to set up and run a test that goes far enough to form a whole new species so thoroughly changed that the new species isn’t capable of reproducing with a member of the original species. BUT the beautifully detailed picture which we have allows us to look into nooks and crannies we never thought existed. The connectedness and the incredible variation are, to those who study them, like profound music or deepest philosophical thought. ",
            "date": "Answered December 20, 2019",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Andy Heilveil",
                "href": "/profile/Andy-Heilveil"
            },
            "answer_text": "The theory of evolution explains why organisms can be effectively classified into groups and why those groups can be grouped.  It explains how groups become different from other groups over generations. It explains the commonalities across organisms and gives clues as to why the differences exist both in general (DNA copying isn’t perfect) and specific (ecology affects reproduction rate). ",
            "date": "Answered December 18, 2019",
            "views": "40",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Christopher Schardl",
                    "user_href": "/profile/Christopher-Schardl"
                },
                {
                    "user_id": "Keith Robison",
                    "user_href": "/profile/Keith-Robison"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ann Carlyle",
                "href": "/profile/Ann-Carlyle"
            },
            "answer_text": "Q: What does the theory of evolution explain about living organisms? It explains why they are so similar and so different    ",
            "date": "Answered December 18, 2019",
            "views": "49",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Keith Robison",
                    "user_href": "/profile/Keith-Robison"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Van Dinther",
                "href": "/profile/John-Van-Dinther-1"
            },
            "answer_text": "It explains where the DNA of living organisms came from and why human DNA includes ape DNA and how apes descended from earlier critters all the way back. ",
            "date": "Answered December 18, 2019",
            "views": "17",
            "upvotes": "0"
        }
    ]
}