{
    "title": "What are some research topics in mathematics? - Quora",
    "tags": [
        "Academic Research",
        "Research"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dan Cazacu",
                "href": "/profile/Dan-Cazacu-1"
            },
            "answer_text": "A number of good answers were already given. The problem in explaining what some research topics would be, is the very knowledge that must first be acquired in order to understand the problem. Having a list of unsolved problems can always be useful. You will try to answer a question posed by someone in the past, who could not quite answer it himself/ herself, but was close enough to an answer to understand its importance or relevance. In trying, you may answer it ( hooray to you!) but even if you do not, you may take a few steps in a new direction (and end up creating something else). You may want to maybe narrow it down to a field of study ( Algebra, Geometry, Analysis, Number Theory, Topology, etc.) only to see later that a problem transcends the box you want to put it in… Anyhow, best of luck, this was a good question. ",
            "date": "Answered March 20, 2018",
            "views": "81",
            "upvotes": " Answer requested by Sandra Molina",
            "upvoters": [
                {
                    "user_id": "Dan Cazacu",
                    "user_href": "/profile/Dan-Cazacu-1"
                },
                {
                    "user_id": "Christie Chong",
                    "user_href": "/profile/Christie-Chong-3"
                },
                {
                    "user_id": "Manish Kumar",
                    "user_href": "/profile/Manish-Kumar-3495"
                }
            ]
        },
        {
            "author_info": {
                "name": "Collin Bleak",
                "href": "/profile/Collin-Bleak"
            },
            "answer_text": "A good way to get into this is to read a book like Crilly’s “The Big Questions: Mathematics” to get some overview of what people think about these days (short book, and an easy read). Then, with some Google Power, exploring a bit deeper until you start to feel you have a good overview of the thrust of modern mathematics. Generally, though, one cannot honestly figure this out without spending a long time working in the subject to see what fits you. Is U.S. Ph.D. programs, students usually are figuring this out in their first or second year of graduate school, and then spend about three more years working for their Ph.D.. ",
            "date": "Answered August 1, 2016",
            "views": "74",
            "upvotes": " View 3 Upvoters "
        }
    ]
}