{
    "title": "What is the intersection of design science and criminology? - Quora",
    "tags": [
        "Crime Prevention",
        "Design Thinking",
        "Object-Oriented Design Patterns"
    ],
    "response": [
        {
            "author_info": {
                "name": "Priscilla Standridge",
                "href": "/profile/Priscilla-Standridge"
            },
            "answer_text": "The relationship between design and crime prevention has been explored based on the \"Rational Choice\" theory which postulates that individuals weigh costs and benefits when deciding a course of action.This theory applied to criminal behavior hypothesizes that crime or disorder results when (1) likely offenders and (2) suitable targets come together in (3) time and space, in the absence of capable guardians for that target. A simple version of a problem analysis triangle looks like this:  Based on this premise, to prevent crime there are 5 possible courses of action: Increasing the effort the offender must make to carry out the crime.Increasing the risks the offender must face in completing the crime.Reducing the rewards or benefits the offender expects to obtain from the crime.Removing excuses that offenders may use to “rationalize” or justify their actions.Reducing or avoiding provocations that may tempt or incite offenders into criminal acts.(source: Center for Problem-Oriented Policing) These strategies can be applied in (1) architecture and urban planning as well as  (2) the design of objects.(1) Extensive research on \"criminology of place\" has studied the relationship between the characteristics of certain places (ranging from entire neighborhoods to single building complexes) and the crimes that occur (see Environmental criminology). Accordingly, the study of how changes in the characteristics of a place can affect crime has led to the development of \"Crime prevention through environmental design\" (CPTED).  An example of CPTED is improved lighting and natural surveillance (i.e. visibility) in areas in which there is a crime problem in order to increase the chance of apprehension of criminal activity. In other words making an area that previously allowed for illicit activity to be carried out in an undisturbed fashion, less hidden and \"safe\" for criminals.(2) The design of objects can also aim to reduce crime. The objective of designing products against crime is to make them less \"CRAVED\" (concealable, removable, available, valuable, enjoyable and disposable). According to this approach, \"CRAVED\" objects are more likely to be subject to or used for crime. A good example of a product that might be subject to crime is a cell-phone which can be easily hidden on your person (concealable) and taken from the victim without being noticed (removable), commonly available and therefore not likely to arouse suspicion (available), relatively valuable and enjoyable to use, as well as easily sold to others (disposable). On the other hand certain objects can be used to commit crimes. For example glass bottles can be considered CRAVED objects in the event of bar fights and be broken and used as weapons.A dedicated research center within the University of Arts London has developed a variety of projects to reduce crimes including bicycle theft, shoplifting and graffiti (see Design Against Crime  ). ",
            "date": "Answered January 27, 2015",
            "views": "332",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Šmehlík",
                    "user_href": "/profile/David-Šmehlík"
                },
                {
                    "user_id": "Jeff Wright",
                    "user_href": "/profile/Jeff-Wright-10"
                }
            ]
        }
    ]
}