{
    "title": "What are the benefits of satellites? - Quora",
    "tags": [
        "Satellite Communications"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kevin Rome",
                "href": "/profile/Kevin-Rome-2"
            },
            "answer_text": "I’m assuming you’re referring to artificial satellites. So, here are a few people may not often consider… Feeding people: Today’s farmers can incorporate satellite data to help maximize crop yields and minimize environmental impacts from their activities[1].Save People: Earth facing satellites are used for weather monitoring. Big hurricane forming? We’ll know and can warn people now.Save the planet: (Maybe). So much if our Earth science data comes from satellites. At least we have the information. Hopefully we can use it wisely.Guide People: Any of the satellite navigation systems help guide people around the world.Add to our collective knowledge: Hubble, Spitzer, ISS…etc. The last being as actual floating laboratory, where experiments can be carried out in the unique environment of microgravity.Footnotes[1] Farmers benefit from satellite coverage",
            "date": "Answered February 24, 2018",
            "views": "27",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aashish Shinde",
                    "user_href": "/profile/Aashish-Shinde-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Wilson",
                "href": "/profile/Paul-Wilson-82"
            },
            "answer_text": "Direct broadcast TV, Internet access (yes, even now before things like Elon Musk’s Starlink is available), weather, military surveillance (photographic, radar), military communications, early warning, environmental monitoring, astronomy, solar weather monitoring, exploration, research into the biological effects of long term spaceflight, civil communications including paging systems and phones (look up Iridium), GPS (several constellations from different countries), disaster assistance, earth resources. You can probably find more if you look. This is one of those questions I don’t understand - it takes little or no time to find this out for yourself. ",
            "date": "Answered September 29, 2019",
            "views": "14",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Kes",
                    "user_href": "/profile/John-Kes"
                },
                {
                    "user_id": "Al Klein",
                    "user_href": "/profile/Al-Klein"
                }
            ]
        },
        {
            "author_info": {
                "name": "Indrajeet",
                "href": "/profile/Indrajeet-32"
            },
            "answer_text": "1. Connecting remote assets Business operations that extend to geographically remote environments depend on satellites to provide the critical communication means to conduct remote facility monitoring and real-time asset management at unmanned sites and offshore platforms. 2. Driving the use of sensor networks Energy and mining companies are exploring more extensive usage of satellite-based sensor networks to support their offshore exploration projects. 3. Transforming transportation infrastructure Broadband connectivity on trains, cargo vehicles and maritime vessels is a burgeoning trend in the global transportation landscape, and satellite communications plays a pivotal role in enabling innovative mobility services. 4. Developing sustainable cities City administrators around the world are harnessing the power of the IoT to drive energy efficiency measures and smarter resource allocation to help make cities more sustainable; for instance, satellite is key to enabling smart grids to be extended to remote regions where terrestrial networks fall short. 5. Facilitating mobile banking and retail Satellite can serve as the communications backbone that keeps wireless ATMs and mobile point-of-sales applications running smoothly across a broad geographical span. Despite the roll-out of terrestrial networks to many parts of the world, there are many regions that remain unconnected which rely on satellite connectivity. 7. Reliability In an era of increased communications traffic, maintaining a high level of service reliability is always a key requirement for effective IoT deployments. Carrier integrated providers need to work with a satellite provider with a reliable network that caters to applications such as remote asset monitoring ensuring reliable, always-on connectivity. 6. Ubiquitous coverage A new breed of innovative IoT applications will emerge from the connectivity of intelligent devices. Expected to encompass billions of devices around the world, the potential scale of the IoT demands ubiquitous network coverage between satellite operators and carrier integrated services, even in remote locations. 8. Speed The future landscape of the IoT involves the exchange of data between interconnected objects to facilitate quicker decision making and enhance business processes. As such, the emergence of IoT is therefore driving up the demand for high broadband speeds to support bandwidth-intensive applications in real time. Users need to invest in mobile satellite equipment designed to deliver industry-leading broadband speeds with ease. 9. Cost Terrestrial networks can be costly to deploy in some remote regions, and mobile satellite services are still widely viewed as a more affordable communications technology over other existing satellite platforms. 10. Integration The IoT is expected to continue driving up market demand for the integration of satellite into the communications mix. Carrier integration providers need to partner with a satellite operator that is able to provide the necessary technology integration support as well as innovative hardware and flexible satellite infrastructure which are customizable to their users’ needs. The benefits that that are outlined above capture the relevance that mobile satellite communications brings to the IoT landscape. But these are just the top of the proverbial iceberg. To deliver the promise, satellite operators and carrier integrators need to work together to enable seamless connectivity that propel our generation into the future. How we do that effectively will be the key to transforming IoT affects us all. ",
            "date": "Answered October 3, 2019",
            "views": "952",
            "upvotes": " Answer requested by Gourav Kumar",
            "upvoters": [
                {
                    "user_id": "Akinyele Emmanuel",
                    "user_href": "/profile/Akinyele-Emmanuel"
                },
                {
                    "user_id": "Radu Cușmir",
                    "user_href": "/profile/Radu-Cușmir"
                },
                {
                    "user_id": "Calum Bird",
                    "user_href": "/profile/Calum-Bird"
                },
                {
                    "user_id": "John Kes",
                    "user_href": "/profile/John-Kes"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stijn Ilsen",
                "href": "/profile/Stijn-Ilsen"
            },
            "answer_text": "I’m interpreting the question related to the physical sides of the satellites. Believe me, all sides are important and serve a function on the satellite. During the design, an accomodation is made which tries to find the optimum solution of the mounting of the different sensors, actuators, computers, battery, solar panels, payloads, antenna’s and transceivers, etc… This is hugely difficult because you need to take many factors into acocunt: required orientations, structural qualification, thermal ranges, radiation levels, EMC, etc… Especially for thermal design, every side of the satellite needs to be modelled and finetuned to ensure the correct thermal properties. ",
            "date": "Answered February 24, 2018",
            "views": "19",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nutan Katiyar",
                    "user_href": "/profile/Nutan-Katiyar-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Khushbu Gohil",
                "href": "/profile/Khushbu-Gohil-4"
            },
            "answer_text": "There are many benefits is their some for General application and some for specific application >Location finding Using GPS >Faster communication >Connect whole world in one point by Internet Some benefits for defence related or for organization like >Communication through Satellite phone (content more security code) >aircraft tracking >Information get about forest,mountains, river or capturing image of earth also weather broad casting ",
            "date": "Answered May 28, 2018",
            "views": "44",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Robson",
                    "user_href": "/profile/John-Robson-110"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harry Harshimoto",
                "href": "/profile/Harry-Harshimoto"
            },
            "answer_text": "There are many benefits to satellites. Their most popular uses being media broadcasts, particularly weather. Satellites are also used to “sync” GPS devices and GPS-watches (yes, they exist). There are multiple “intelligence” related applications as well. Supposedly we can resolve the stitches on a baseball from orbit, the optics on our satellites are finely developed. Note that very few spacecraft have active optics. ",
            "date": "Answered July 8, 2017",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Abdulla Jinah Ali",
                "href": "/profile/Abdulla-Jinah-Ali"
            },
            "answer_text": "They can see a large area of the Earth, so they can transmit to a larger area than ground antennas, and take photos of bigger areas, good for spying and science. They can do difficult space science experiments. They can be used in astronomy better than ground telescopes, because they are not affected by daylight, clouds, atmospheric turbulence, dust, etc, and are less blocked by the ground. They are also harder to attack, because of their height and speed. ",
            "date": "Answered March 9, 2020",
            "views": "154",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nayeem Hossen",
                    "user_href": "/profile/Nayeem-Hossen"
                },
                {
                    "user_id": "Sharif Mamun",
                    "user_href": "/profile/Sharif-Mamun"
                },
                {
                    "user_id": "Jaime Golombek",
                    "user_href": "/profile/Jaime-Golombek"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raul Concha",
                "href": "/profile/Raul-Concha-1"
            },
            "answer_text": "They are specially suitable in those geographic areas where cable is not easily deployed. Rainforest, or mountain regions, for example. Satellite is probably the best backup link for any wide signal. And, of course, it is easy to restore any communication terrestrial network in case of natural catastrophe. I think they will also play an important role in the new Internet of Things. ",
            "date": "Answered April 26, 2017",
            "views": "17",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Raul Concha",
                    "user_href": "/profile/Raul-Concha-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrey Dudnikov",
                "href": "/profile/Andrey-Dudnikov"
            },
            "answer_text": "Big coverage area (spot or beam)communicate for any geographic point in big area of satellite spot coverage.possible to use satellite communication on moving objectslow time for creation of new link",
            "date": "Answered April 22, 2017",
            "views": "724",
            "upvotes": " View 1 Upvoter"
        }
    ]
}