{
    "title": "What are the trends in chemical reactivity of the elements? - Quora",
    "tags": [
        "Reactivity",
        "Periodic Table",
        "Trends"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rahul Karda",
                "href": "/profile/Rahul-Karda-8"
            },
            "answer_text": "Trends in chemical reactivity of elements : Atomic Radius: DOWN a Group: Atomic radius INCREASES as you go DOWN a Group because each successive Period (row) has an additional occupied energy level. If you visualize the not 100% accurate but still useful Bohr model of the atom, you can think of it this way: each time you drop down a row, you add a \"ring.\"ACROSS a Period: Atomic radius DECREASES as you go ACROSS a Period because the net nuclear charge increases (Huh?). Remember, it's the protons (+) in the nucleus that pull on or attract the electrons in the orbitals. Across a Period you are adding more and more protons pulling on electrons occupying the same orbitals. The overall effect is more pulling power in the same basic space. This draws the electrons in closer, making the overall atomic radius smaller at the right side of a Period.Ionization Energy: DOWN a Group: Ionization energy DECREASES as you go DOWN a Group because the farther the valence electrons are from the nucleus (pulling power of the protons) the less energy it costs another atom to steal them.ACROSS a Period: Ionization energy INCREASES as you go ACROSS a Period because atoms are getting ever closer to that magic \"octet\" rule for stability via the Noble Gas configuration. In plain speak - your frequent buyer punch card gets one step closer to the freebie each time you move closer to the right of the Periodic Table so you guard those punches more carefully. The atomic radius is getting smaller, too, so those protons do a great job of holding on tighter.Electron Affinity: Electron affinity is a bit outside the scope of this class so I'm not going to get into it too deeply, other than to point out the general trend. DOWN a Group: Electron Affinity DECREASES (a tiny bit) as you go DOWN a Group because elements become slightly less attractive toward electrons. Father from the pull of those protons, remember?ACROSS a Period: Electron Affinity INCREASES as you go ACROSS a Period because generally speaking (and remember, exclude the Noble Gases here) elements toward the right of the Periodic Table give off a great deal of energy when they gaining electrons to become more stable.Electronegativity: DOWN a Group: Electronegativity DECREASES as you go DOWN a Group because the valence electrons are increasingly farther away from the attraction of the protons in the nucleus. Less pull, less \"desire\" to grab other electrons.ACROSS a Period: Electronegativity INCREASES as you go ACROSS a Period because the number of protons (+ charges) in the nucleus increases. More protons in the nucleus means electrons are more strongly attracted to the nucleus.Chemical Reactivity: METALS DOWN a Group: In METALS reactivity INCREASES as you go DOWN a Group because the farther down a Group of metals you go, the easier it is for electrons to be given or taken away, resulting in higher reactivity.ACROSS a Period: In METALS reactivity DECREASES as you go ACROSS a Period because though they still want to give away valence electrons they have more of them to get rid of, which requires more energy.Hope it helps :p ",
            "date": "Answered February 12, 2018",
            "views": "34",
            "upvotes": " View 56 Upvoters",
            "upvoters": [
                {
                    "user_id": "Indumathi Sukumaran",
                    "user_href": "/profile/Indumathi-Sukumaran-2"
                },
                {
                    "user_id": "ASHMEET",
                    "user_href": "/profile/ASHMEET-12"
                },
                {
                    "user_id": "Jake Cool Guy",
                    "user_href": "/profile/Jake-Cool-Guy"
                },
                {
                    "user_id": "Meena D'Souza",
                    "user_href": "/profile/Meena-DSouza-1"
                },
                {
                    "user_id": "Rhienna Tannisha",
                    "user_href": "/profile/Rhienna-Tannisha"
                },
                {
                    "user_id": "Subbiah Reigns",
                    "user_href": "/profile/Subbiah-Reigns"
                },
                {
                    "user_id": "Poonam Bhardwaj",
                    "user_href": "/profile/Poonam-Bhardwaj-17"
                },
                {
                    "user_id": "For Cricket Fans",
                    "user_href": "/profile/For-Cricket-Fans"
                },
                {
                    "user_id": "Mishkat Fatma",
                    "user_href": "/profile/Mishkat-Fatma"
                },
                {
                    "user_id": "Charul Wankhede",
                    "user_href": "/profile/Charul-Wankhede"
                }
            ]
        },
        {
            "author_info": {
                "name": "Samiul Islam",
                "href": "/profile/Samiul-Islam-103"
            },
            "answer_text": "DOWN a Group: Atomic radius INCREASES as you go DOWN a Group because each successive Period (row) has an additional occupied energy level. If you visualize the not 100% accurate but still useful Bohr model of the atom, you can think of it this way: each time you drop down a row, you add a \"ring.\"ACROSS a Period: Atomic radius DECREASES as you go ACROSS a Period because the net nuclear charge increases (Huh?). Remember, it's the protons (+) in the nucleus that pull on or attract the electrons in the orbitals. Across a Period you are adding more and more protons pulling on electrons occupying the same orbitals. The overall effect is more pulling power in the same basic space. This draws the electrons in closer, making the overall atomic radius smaller at the right side of a Period.",
            "date": "Answered February 12, 2018",
            "views": "82",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Crystalhydra",
                    "user_href": "/profile/Crystalhydra"
                },
                {
                    "user_id": "J. Gwendolyn Young",
                    "user_href": "/profile/J-Gwendolyn-Young-2"
                },
                {
                    "user_id": "Aditya Basarkar",
                    "user_href": "/profile/Aditya-Basarkar-3"
                },
                {
                    "user_id": "Salmali Debsarkar",
                    "user_href": "/profile/Salmali-Debsarkar"
                },
                {
                    "user_id": "Tony Ding",
                    "user_href": "/profile/Tony-Ding-12"
                }
            ]
        }
    ]
}