{
    "title": "What is curing disease based on? - Quora",
    "tags": [
        "Mold Allergy Treatment",
        "Mold Allergies",
        "Curing",
        "Medical Conditions and Diseases",
        "Health"
    ],
    "response": [
        {
            "author_info": {
                "name": "Karen L. Pringle",
                "href": "/profile/Karen-L-Pringle"
            },
            "answer_text": "Greetings, To cure is to remove the symptoms of a lack of energy, vibrance, or health and wellness within one. Curing is more of a medical industry terminology than a realistic one. For legal reasons and for those I mention above, we use bringing back the health force energy and generation of power, regeneration of skin, bones, hair, tissues, cells, proliferative life force energy that is within us all but is aging prematurely as we are sold products, and advice, contraptions and radical processes that are not in fact helping us much quite often. There are exceptions where we must turn to such drastic procedures but most are draconian! Curing disease is based upon a rightful assessment that takes into account purposefully and with goodwill intention, not simply for profit the true condition of the spirit, the vehicle (body), and the mind. You can more easily assess the rash on the skin, the heat emanating from the body which is now forming eczema or psoriasis or even dandruff, however, can you “sense” it from the mind? If we continue to check and treat our people in this harsh manner we will no longer have a human experience. You can already see that we are in trouble! Talk of rogue viruses? People donning paper masks, dirty bandanas, the generation of phobias, are a certain outcome that was easy to predict given the “catching it” paradigm, commonly known as quite often, “Pathology!” Curing disease is done by connecting people, reconnecting nature, cleaning our water, our air, and taking a critical look at what has been done and what needs to be done to unravel this domination! Thankful for my Grandmother and her teachings in the early 1960s, I never stopped thinking about what to do, and kept seeking from a great many sources! ",
            "date": "Answered October 7, 2020",
            "views": "29",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Kim Alicia",
                    "user_href": "/profile/Kim-Alicia-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stacy Ellis",
                "href": "/profile/Stacy-Ellis-1"
            },
            "answer_text": "Curing disease is based on what causes the disease and what is causing the disease to continue. For example, I have multiple sclerosis, which is lipid metabolism disorder. So I reverse it and keep it in remission using diet, which means that I don’t eat the fats that I can’t process. The conventional/allopathic medical system focuses on managing the symptoms by selling drugs whereas other systems of medicine focus on the cause. I went to a Naturopathic doctor. They are replacing the medical doctors. I don’t have a neurologist because there’s nothing they can do for me except give me drugs to suppress symptoms. But if I don’t have the symptoms, then I don’t know what I need to treat. And the drugs don’t stop the progression of the disease. So I’d rather eat the right foods, watch my symptoms, so that I know what to do and how to treat myself. ",
            "date": "Answered October 7, 2020",
            "views": "12",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Karen L. Pringle",
                    "user_href": "/profile/Karen-L-Pringle"
                }
            ]
        }
    ]
}