{
    "title": "What is a coulomb damping force? - Quora",
    "tags": [
        "Coulomb's Law",
        "Force (physics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vikrant Taide",
                "href": "/profile/Vikrant-Taide-1"
            },
            "answer_text": "Coulomb Damping =: It is a type of constant mechanical damping in which energy is absorbed via sliding friction. The friction generated by the relative motion of the two surfaces that press against each other is a source of energy dissipation. In general, damping is the dissipation of energy from a vibrating system where the kinetic energy is converted into heat by the friction. Coulomb damping is a common damping mechanism that occurs in machinery. Example:= For a simple example, a block of mass m slides over a rough horizontal surface under the restraint of a spring with a spring constantk. The spring is attached to the block and mounted to an immobile object on the other end allowing the block to be moved by the force of the spring Because the surface is horizontal, the normal force is constant and equal to the weight of the block, or N=mg. This can be determined by summing the forces in the vertical direction. A position x is then measured horizontally to the right from the location of the block when the spring is unstretched. As stated earlier, the friction force acts in a direction opposite the motion of the block. Once put into motion the block will oscillate back and forth around the equilibrium position. Newton's Second Law states that the equation of motion of the block . A real-life example of Coulomb damping occurs in large structures with non-welded joints such as airplane wings.  *Source reference:= Ginsberg, Jerry (2001). Mechanical and Structural Vibrations: Theory and Applications(1st ed.). John Wiley & Sons, Inc. ISBN 0-471-37084-3.Inman, Daniel (2001). Engineering Vibration(2nd ed.). Prentice Hall. ISBN 0-13-726142-X.Walshaw, A.C. (1984). Mechanical Vibrations with Applications (1st ed.). Ellis Horwood Limited. ISBN 0-85312-593-7.",
            "date": "Answered June 8, 2017",
            "views": "17",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "ساکب شبنم",
                    "user_href": "/profile/ساکب-شبنم"
                },
                {
                    "user_id": "Sohan Pawaskar",
                    "user_href": "/profile/Sohan-Pawaskar"
                },
                {
                    "user_id": "Vikrant Taide",
                    "user_href": "/profile/Vikrant-Taide"
                },
                {
                    "user_id": "Pratik Bagde",
                    "user_href": "/profile/Pratik-Bagde-4"
                },
                {
                    "user_id": "Sumit Shende",
                    "user_href": "/profile/Sumit-Shende-7"
                },
                {
                    "user_id": "Malti Taide",
                    "user_href": "/profile/Malti-Taide"
                },
                {
                    "user_id": "Sourav Sarkar",
                    "user_href": "/profile/Sourav-Sarkar-271"
                }
            ]
        }
    ]
}