{
    "title": "What does molar and molarity means? - Quora",
    "tags": [
        "Molar Mass (chemistry)",
        "Mass (physics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Kay",
                "href": "/profile/Michael-Kay-8"
            },
            "answer_text": "Molar and molarity are very close in meaning. Molar can be an adjective describing a property: such as in the Ideal Gas Law, the molar volume of an ideal gas at Standard Temperature and Pressure is 22.414 liters/mole at 0.0 degrees Centigrade, and an atmospheric pressure of 100,000 Pascals, or 14.5 psi (pounds per square inch), also called 1 Atmosphere.  Molar can also apply to the concentration of a solute in water: a 1.0 Molar solution has 1.0 moles of solute made up to 1.0 liters of solution. This is easily done with a volumetric flask here the solute is weighed into the flask, pure water is added. and the solute dissolved. Then the volume is carefully adjusted by adding water until the level is at the ring marked on the neck of the flask. The stopper is placed into the flask, and it is held in place while the flask is repeatedly inverted to thoroughly mix the solution. Molarity refers to the concentration of a solute in solution, usually moles per liter. That will be the same number as the molar concentration.  0.1 M HCl has 0.1 moles of Hydrogen Chloride per liter of solution. This would be labeled 0.1 M HCl or 0.1 M Hydrochloric Acid. A mole is 6.02 x 10^23 atoms or molecules of a given substance. It is the number of atoms in the amount of a chemical equal to its molecular weight in grams. That varies greatly--from 2 grams for H2 as a molecule, the lightest element, to 238.06 grams for Uranium-238, the most common naturally occurring isotope of Uranium.  ",
            "date": "Answered December 23, 2015",
            "views": "95",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Manav AGRAWAL",
                    "user_href": "/profile/Manav-AGRAWAL-35"
                },
                {
                    "user_id": "Malcolm Sargeant",
                    "user_href": "/profile/Malcolm-Sargeant"
                }
            ]
        },
        {
            "author_info": {
                "name": "Surya Pratap Singh",
                "href": "/profile/Surya-Pratap-Singh-43"
            },
            "answer_text": "Molar is a general preffix in Chemistry which means for 1 mol and when you add it to any quantity like mass, it means the answer(mass) you get is corresponding to 1 mol species.For example 'the molar mass of H2O molecule is 18 g' , it means that 1 mole molecules (Na; Avogadro constant) of H2O weigh18g.Molar Heat Capacity : heat capacity corresponding to 1 mol species and so on.While 'molarity' is a term which represents the concentration of a solution. Molarity describes the number of moles of solute particles dissolved in 1L of solution, for example if concentration of a solution of HCl is 0.1M it means in one litre of solution 0.1 mols of HCl are present.There are also some other concentration terms like molality, normality and mole fraction etc. ",
            "date": "Answered February 25, 2016",
            "views": "27",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vedang Bahuguna",
                    "user_href": "/profile/Vedang-Bahuguna"
                }
            ]
        }
    ]
}