{
    "title": "What is chemical shift in NMR spectroscopy and what causes it? - Quora",
    "tags": [
        "Nuclear Magnetic Resonance",
        "Analytical Chemistry",
        "Spectroscopy",
        "Chemistry of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Saul Stokar",
                "href": "/profile/Saul-Stokar"
            },
            "answer_text": "There is a wikipedia entry on this: Chemical shift - Wikipedia To quote the introduction: In nuclear magnetic resonance (NMR) spectroscopy, the chemical shift is the resonant frequency of a nucleus relative to a standard in a magnetic field. Often the position and number of chemical shifts are diagnostic of the structure of a molecule. Some atomic nuclei possess a magnetic moment (nuclear spin), which gives rise to different energy levels and resonance frequencies in a magnetic field. The total magnetic field experienced by a nucleus includes local magnetic fields induced by currents of electrons in the molecular orbitals (note that electrons have a magnetic moment themselves). The electron distribution of the same type of nucleus (e.g. 1H, 13C, 15N) usually varies according to the local geometry (binding partners, bond lengths, angles between bonds, and so on), and with it the local magnetic field at each nucleus. This is reflected in the spin energy levels (and resonance frequencies). The variations of nuclear magnetic resonance frequencies of the same kind of nucleus, due to variations in the electron distribution, is called the chemical shift. The size of the chemical shift is given with respect to a reference frequency or reference sample (see also chemical shift referencing), usually a molecule with a barely distorted electron distribution. ",
            "date": "Answered November 6, 2019",
            "views": "270",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tomas De Paulis",
                "href": "/profile/Tomas-De-Paulis"
            },
            "answer_text": "Here is a more laymany answer. Think of an organic molecule as an automobile. Each part in the vehicle has a specific neighboring part. So, for every part there is a unique pattern of type and distance to all the other parts. The NMR signal from each and everyone of the hydrogen atoms in an organic molecule has a unique pattern (frequency shift and chemical coupling) due to its type and distance from the other hydrogen atoms. By using the knowledge of the origin of the observed pattern, the chemical structure can be found. ",
            "date": "Answered May 21, 2020",
            "views": "58",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        }
    ]
}