{
    "title": "When does a hypothesis become a scientific theory? - Quora",
    "tags": [
        "Hypotheses",
        "Theory and Theories",
        "Scientific Research"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard Gibson",
                "href": "/profile/Richard-Gibson-6"
            },
            "answer_text": "Short answer: scientific consensus agrees on theoryhood. Basically, an idea about how physical reality works begins as a conjecture. The person with the idea spends a lot of time making the math work, to describe how the idea behaves over time, what it looks like interfacing with parts of reality already well understood, and so on. If the work is good, coherent, simple, elegant, then consensus may well confer hypothesis-hood on it Where a hypothesis is REALLY good, is if/when it makes predictions about things one should observe. Other scientists may go out looking for them, either through observation out in the real world, or through experiments. Over time, it may happen that enough confirming evidence accrues, that the consensus agrees the hypothesis is the best available explanation for that part of reality-->congratulations, proud parent of a bouncing baby theory. ",
            "date": "Answered April 23, 2020",
            "views": "148",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Cliff Moore",
                "href": "/profile/Cliff-Moore-4"
            },
            "answer_text": "It doesn't. A hypothesis is a guess at how a specific aspect of reality works under certain conditions. A theory is a collection of knowledge on a specific yet general subject, knowledge which is gathered from experiments conducted to determine whether or not various hypotheses are right or wrong. This is an EXTREMELY basic answer, though, and it's quite possible that I'm wrong in a number of ways. I'm no scientist, after all; I just trust them because they gave me the ability to type this answer with just my thumb and then send it to you using lightning and radiation which they tricked into living in plastic and metal boxes. ",
            "date": "Answered April 23, 2020",
            "views": "95",
            "upvotes": "0"
        }
    ]
}