{
    "title": "When does a leaf die? - Quora",
    "tags": [
        "Leaves",
        "Plants",
        "Death and Dying"
    ],
    "response": [
        {
            "author_info": {
                "name": "Predrag Maksimovich",
                "href": "/profile/Predrag-Maksimovich"
            },
            "answer_text": "Leaves are not organisms by themselves. They are part of a living organism called a plant. Depending on the type of the plant, some leaves stay permanently and don’t fall off while others do as part of a normal process of lifecycle of that partical plant. Leaves are basically liver, and kidneys, and lungs in one. Process of photosynthesis happens there. The rest of the plant brings water and minerals from the ground and protects the leaves, carries them and exposes leaves to the sunshine. So, some leaves “die” on the branch and fall of “dead”. Some fall or are taken down by some outside force (a curious human, maybe!) and thereafter they still continue with “living” for sometime, ie, processes continue. Was the exact mechanism and time of “death” I don’t know but it probably has to do with absence of fluid, ie, water. ",
            "date": "Answered July 13, 2016",
            "views": "2",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Max Singer",
                    "user_href": "/profile/Max-Singer-10"
                },
                {
                    "user_id": "Ilana Halupovich",
                    "user_href": "/profile/Ilana-Halupovich"
                },
                {
                    "user_id": "Branko Dodig",
                    "user_href": "/profile/Branko-Dodig"
                },
                {
                    "user_id": "Maurya Jandyala",
                    "user_href": "/profile/Maurya-Jandyala"
                },
                {
                    "user_id": "Sebi Bihari",
                    "user_href": "/profile/Sebi-Bihari"
                },
                {
                    "user_id": "Ilva Gjoka",
                    "user_href": "/profile/Ilva-Gjoka"
                },
                {
                    "user_id": "Marco Domínguez",
                    "user_href": "/profile/Marco-Domínguez"
                },
                {
                    "user_id": "Jim Gene",
                    "user_href": "/profile/Jim-Gene"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sue Sanders",
                "href": "/profile/Sue-Sanders-3"
            },
            "answer_text": "A leaf doesn’t die at all; neither is it born. Nothing is born or dies. In the case of your leaf, its elements lose stability, it falls apart, becomes humus, then soil, and moves on to nourish other living things. We’re all connected, and the connections aren’t broken; they continue. A leaf in the American Midwest will become soil, butterflies, dust on the piano, even the piano itself; it’ll become part of the person your great grandchild marries; it’ll be part of a fly that pauses on the new president’s nose during the inauguration. Be nice to every living thing, says the Dalai Lama, because everything was once your mother. Even the leaf. ",
            "date": "Answered July 13, 2016",
            "views": "803",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Carol Cotton",
                    "user_href": "/profile/Carol-Cotton-1"
                },
                {
                    "user_id": "Whitney Frederickson",
                    "user_href": "/profile/Whitney-Frederickson"
                },
                {
                    "user_id": "Dawn Friedman",
                    "user_href": "/profile/Dawn-Friedman-2"
                },
                {
                    "user_id": "Marco Domínguez",
                    "user_href": "/profile/Marco-Domínguez"
                }
            ]
        }
    ]
}