{
    "title": "When will we see a clear photograph of an exoplanet? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Kim Bott",
                "href": "/profile/Kim-Bott"
            },
            "answer_text": "According to my friend who works on direct imaging of exoplanets, not for a really long time, as in, there are no projects currently in the works to do this.  And if you have a sense for how long it can take for a project to get off the ground, that means a long time. Background When taking pictures of exoplanets, like the dozen or so [1] so far imaged, what you are looking for is contrast.  With the overwhelming brightness of the star, you need to mask the star and then use cutting edge adaptive optics and really brilliant post-processing to see the little \"blurry dots\".  But this is a matter of contrast.  You are trying to differentiate between the light from the star and the light from a planet. You can imagine a firefly beside a lighthouse in the distance.  That really is the kind of difference you get.  [2]  A tiny bit of that light is from the firefly, sure, but you have to block the lighthouse' light to stand a chance at seeing that firefly.  Add to this, the fact that you are looking through a turbulent atmosphere, like looking up at someone's face (or anything) from the bottom of a pool, and you can see how much cleaning up the image needs.  We need to take pictures of the planet at different points in its orbit to ensure that it isn't just a coincidental blob of misplaced star light (think of how distorted things outside the water look from the bottom of a pool). To resolve a diskWhat you're asking for is for us to resolve a disk... to resolve the planet, not just differentiate its light from the host star's light.  Even for stars (besides our sun), that has only been done for a couple, and it's not exactly detailed.  This problem is a matter of angular resolution.  We'd like to be able to tell at least if one side of a planet were more blue, for instance, than the other.  For this you'd need a huge interferometer (donate your money to astronomy! :) )--an enormous telescope to get that kind of resolution If you want to think of it mathematicallysin (a) = 1.22 (w / d)where:a is the angular resolutionw is the wavelength of the lightd is the diameter of the aperture So if we want a tiny angular resolution (a small angle across which we can differentiate the light we are receiving) we want to make d, the diameter, as huge as possible.  (sin of a tiny number is a tinier number) Nothing we have is big enough to do this yet. Work-aroundWhile we can't actually take a picture so to speak, we can still map the planet!This is done by looking at the way the color changes as it goes through phases (or using polarimetry to get an idea of what angle the light is coming from). We can work out fairly well what the orbits are like for some planets, and so, if we have time (donate money to astronomy!), we can monitor how a planet's light changes as it is in a crescent phase, a quarter phase, nearly full and so on.  We know we are getting light from different parts of the planet as it moves in its orbit, so we can get some idea of how the appearance changes as you look at different parts of it (this has been done for Earth in fact). [3] If you'd like to see what a planet might look like, check out the last few links below.  Note that some of these maps are in infrared.   [1] List of extrasolar planets directly imaged[2] Idea totally stolen from Dr. Salter, possibly others previous[3]Science: Alien Maps of an Ocean Bearing World[4]http://arxiv.org/pdf/1202.1883v2.pdf <-- HD 189733b a \"Hot Jupiter\" with a hot spot[5]http://arxiv.org/pdf/1202.3829v2.pdf <-- more HD189733b[6]http://arxiv.org/pdf/1210.6915v1.pdf <-- on the fine art of planet-mapping ",
            "date": "Answered March 10, 2013",
            "views": "24",
            "upvotes": " View 22 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Simon Stahli",
                    "user_href": "/profile/Simon-Stahli"
                },
                {
                    "user_id": "Abir Bhattacharyya",
                    "user_href": "/profile/Abir-Bhattacharyya"
                },
                {
                    "user_id": "James Kelley",
                    "user_href": "/profile/James-Kelley-36"
                },
                {
                    "user_id": "Mike Van Horn",
                    "user_href": "/profile/Mike-Van-Horn"
                },
                {
                    "user_id": "Bhushan Shah",
                    "user_href": "/profile/Bhushan-Shah-3"
                },
                {
                    "user_id": "Ved Dubhashy",
                    "user_href": "/profile/Ved-Dubhashy"
                },
                {
                    "user_id": "Vytautas Aukstikalnis",
                    "user_href": "/profile/Vytautas-Aukstikalnis"
                },
                {
                    "user_id": "Adhikarla Avinash",
                    "user_href": "/profile/Adhikarla-Avinash"
                },
                {
                    "user_id": "Andrea Klein",
                    "user_href": "/profile/Andrea-Klein"
                },
                {
                    "user_id": "Karim Jebari",
                    "user_href": "/profile/Karim-Jebari"
                }
            ]
        },
        {
            "author_info": {
                "name": "Malcolm Sargeant",
                "href": "/profile/Malcolm-Sargeant"
            },
            "answer_text": "With existing equipment, the number of photons coming directly from an exoplanet can be counted by hand, no chance of getting an image that way. Equipment under construction now will allow us to get infrared spectra of the atmosphere of certain exoplanets  under ideal conditions (James Webb Telescope)Getting a clear photograph of these planets will have to wait until we build a FTL spaceship and go there. UPDATE:Astronomers conduct first remote reconnaissance of another planetary system ",
            "date": "Updated March 12, 2013",
            "views": "712",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sue Condon",
                    "user_href": "/profile/Sue-Condon"
                },
                {
                    "user_id": "Joe Samson",
                    "user_href": "/profile/Joe-Samson"
                },
                {
                    "user_id": "Max Jones",
                    "user_href": "/profile/Max-Jones"
                }
            ]
        }
    ]
}