{
    "title": "When scientists say something is millions of years old. How do they figure that out? Or dating something to a specific time period even as close as thousands of years ago? - Quora",
    "tags": [
        "Scientists"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ben Letto",
                "href": "/profile/Ben-Letto-2"
            },
            "answer_text": "Firstly, scientists have been studying the decay rates for radioactive materials for the last 120-years…so those calculations give us an idea about the half-life of those radioactive elements. There are 2 types of materials that can be “dated”…one is igneous rock, and the other is carbon-based biological matter. In regards to igneous rock samples…dating them means you take the measured decay rates for the radioactive elements found in those rocks, you make an assumption about the amount of initial parent element, and you make an assumption about the amount of initial daughter element. (“Daughter” elements are the results of radioactive decay of the “Parent” element). So that’s your assumed initial ratio of the two elements. Then, you measure the current ratio of daughter to parent, and you can then calculate how long your assumed initial ratio became the current ratio. Naturally, there are problems with this calculation…there are untestable assumptions which are part of the equation. The initial ratio is an assumption, and also the assumption that the decay rate has been constant throughout the period being measured. Yes, so you take 120-years of measurement, and you apply that to 20,000,000 years (or more) of supposed decay time. In regards to biological matter, we use C14/C12 ratio, and we have a bit of an edge in this calculation. We can calibrate the measurement to some degree using biological matter of a known age (like the papyrus of a book or scroll from a certain known time period, or the contents of an egyptian tomb of known age), and we then can compare modern carbon content to that of the papyrus scroll or egyptian tomb, and have a measured basis for the radioactive decay rate. Naturally, this is still a problem if you are dating something older than 2,000 or 3,000 years (the length of your calibrated period). And of course, you still need to make assumptions about the initial ratio between parent and daughter C14 and C12. So when we calculate an age of 30,000 years, we are using a 3,000-year decay rate to measure an unknown 30,000 year decay time. So there’s still a certain amount of error involved. That brings us to a serious point…what is the “% error” of the calculation of age? Every scientific process needs to know how poor or inaccurate the tool is, or the calculation method. This is called “% error”. Basically what is the deviation percentage when we compare the measured age against the known age. So if I know some object to be 1000 years old, and I use C14/C12 dating method, if I get an age of 1025 years, then I know my % error is (1025–1000)/1000 = 2.5% This calculation, as you see, requires us to “know” the actual age, so we can determine the deviation of our measurements. With most dating methods…like the igneous rock calculations and the longer-date C14/C12 dating, we do NOT know the actual age of the material. We are attempting to calculate the actual age! So that’s a problem…if you are being scientific, you cannot calculate your actual age. You need to observe the actual, not calculate it. So this problem…the inability to calculate the “% error” means that ALL radioactive dating methods are 100% useless as a tool in scientific inquiry. All of them are myth. So whenever you hear of some “scientist” using radioactive dating techniques to provide support to their theory or prediction, you now know that such a “scientist” is either a non-critical scientist (one who doesn’t know his tools), or it’s a deceptive scientist (one who knows the reality of the situation, and chooses to ignore it). ",
            "date": "Answered October 13, 2019",
            "views": "119",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mark David",
                    "user_href": "/profile/Mark-David-220"
                },
                {
                    "user_id": "S. J. MacLaren",
                    "user_href": "/profile/S-J-MacLaren"
                },
                {
                    "user_id": "Matt Clarke",
                    "user_href": "/profile/Matt-Clarke-187"
                },
                {
                    "user_id": "Mike Hill",
                    "user_href": "/profile/Mike-Hill-182"
                },
                {
                    "user_id": "Brett Passmore",
                    "user_href": "/profile/Brett-Passmore"
                },
                {
                    "user_id": "Tracy Pavlik",
                    "user_href": "/profile/Tracy-Pavlik-1"
                },
                {
                    "user_id": "Ryan Thornton",
                    "user_href": "/profile/Ryan-Thornton-38"
                },
                {
                    "user_id": "T. Stephen Cornelius",
                    "user_href": "/profile/T-Stephen-Cornelius"
                },
                {
                    "user_id": "Michele Shipley Klika",
                    "user_href": "/profile/Michele-Shipley-Klika"
                },
                {
                    "user_id": "James Elmore",
                    "user_href": "/profile/James-Elmore-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fred Civish",
                "href": "/profile/Fred-Civish"
            },
            "answer_text": "I wasn’t going to answer this question, but I decided I needed to do so, once I saw that a number of other people have posted some very erroneous comments. Dating ancient things employs a lot of different scientific principles and techniques, which have been well studied and verified over and over. People who perform the dating, and who do ‘real’ studies, know how to do it right. The end result, using multiple independent dating methods, is that we definitely can date most archaeological finds, and most fossils, and we know when something is tens of thousands or tens of millions of years old. From many dating methods, we know the earth is 4.5 billion years old and the universe is about 13 billion years old. I’ll start first with Carbon 14, since that is often used to date the most recent ORGANIC things, and it is the one that ‘Creationists’ complain about the most. I’m not sure why they complain so much about C14 in particular. But I think it might be just because that is the only Radionuclide dating method that most people have ever heard of. Carbon 14 only dates things back to 50,000 years or so, and after that, ALL readings continue to look like they are 25,000 to 50,000 years old, because there is no accuracy after that age. But even if C14 didn’t exist, other dating methods show the earth itself to be billions of years old and there is NO possible way that any error in the range of those measurements would bring those dates into concordance with the Young Earth Creationists. There are also other radiometric dating techniques for ‘young things,’ but something thousands of years old is probably dated most often by Carbon 14. It MUST contain organic material, derived from plants (which includes animals that eat plants), and the plant must have lived on land and been able to obtain its carbon by adsorbing it out of the atmosphere. If the carbon comes from the soil, or from water (where there is a lot of carbon from Calcium Carbonate shells and reefs) then it cannot be used to date things accurately, because the levels of C14 will be way off, since most C14 is produced directly in the air. C14 works for dates of about 100 years old to 50,000 years old. It is not completely accurate, because it gives a ‘range,’ but it is dependable. There is a range of error of measurement, but these factors are known and taken into account. When done properly, it is quite accurate. Besides, if we think something is 4000 years old, and C14 gives ranges of 3,500 to 4,500, then you couldn’t set you clock based on that, but you really can see that it gives useful information. When you repeat measurements many times, on different materials from the same site, or the same materials from different sites, you can narrow down the range of error quite a bit. And that is exactly what archaeology has done. The point is that accuracy to the exact year is rarely very important when you are dealing with something thousands of years old, but accuracy to a few hundred years is important. I hear creationists complain all the time about inaccuracies of C14, but, since the inaccuracies and confounding factors are well known and accounted for, when it is done correctly C14 can be very useful (when it isn’t being used to date something ‘impossible’ such as dinosaur bones, which are WAY too old to get an accurate C14 reading). For older things, millions of years old, we generally date other radioactive elements and isotopes. Many of these Radioactive elements are most often found in igneous rock, such as lava flows, and not so much in sedimentary rock, which is where most fossils are found. However, as has been pointed out, if you get a layer of sedimentary rock containing fossils and it is somewhere above a lava layer, even many layers above, and then is below another lava layer, even if those layers are millions of years apart, it is possible to ‘bracket’ the fossils and to know that they are within a certain range. Also, certain ‘index’ fossils are always found in certain layers. They are life forms that are common, such as certain sea shells, but they change over time, so when we find certain species, we know what layer they came from. After examining tens of thousands, and perhaps even hundreds of thousands of rock layers that have been dateable by various different techniques, scientists have been able to settle quite exactly on certain dates and ranges. Some people argue that all the dating is based on circular reasoning, where each dating method is based on some other dating method, but that is completely untrue. All the dating methods have been calibrated and corroborated independently. Others claim that we cannot have known how much of the ‘parent isotope’ and the ‘product isotope’ were present to begin with, but, in fact, we often can. Some things, such as cubic Zircons will not allow the element Lead to enter into them while they are forming, but they will allow uranium. So you can measure the uranium and the Lead in them and the ratio will tell you how old that cubic zircon is. We have thus dated some cubic zircons to over 4 billion years. For most molten igneous rock, uranium is 1.67 times more heavy than Lead (its breakdown product) so in their molten state, while in magma, Lead floats on uranium and they separate out from each other. When dealing with radionuclide dating, there is something that Creationists never bring up whenever they complain about inaccuracies in dating, and that is that, even if you assume the absolute most inaccurate measurements possible, NONE of the dating methods ever show the earth to be 6000 years old. I imagine this must bother them a lot. For example, the half life of Uranium 238 is 4.5 billion years. This half life is always the same and never changes. So, after 4.5 billion years, HALF of the Uranium 238 would have become Lead. Lead can occur separately from Uranium. Some Lead was previously made by supernovas, so not ALL the Lead on earth came from Uranium. BUT, WHENEVER URANIUM AND LEAD OCCUR TOGETHER, YOU CAN BE QUITE SURE THAT THE LEAD CAME FROM THE URANIUM, because their properties are so different that, as I said, Uranium separates from Lead whenever possible, and only occurs together when the Uranium breaks down into the Lead. Now, lets assume that you find a mass of Uranium and Lead mixed together, and the ratio is half and half. If that is the case, then the mass should be 4.5 billion years old. End of story. Even if it flowed out of the earth last week (and it would have separated in the heat, but let’s assume it didn’t) then, though the lava flow is recent, the Lead and Uranium are still 4.5 billion years old! So, that wouldn’t date any dinosaurs, but it would date the earth itself! As an example of supposed inaccuracies, there are a number of web sites that claim that a recent dating that was done on lava from Mt St Helens, that was known to be only about 20 years old, dated out to hundreds of thousands or even millions of years old. But the dating method was the K40-Ar40 (Potassium to Argon) dating method which has a half life of 1.25 billion years and is extremely difficult to measure if it is less than about 5000 years old. Every scientist who has looked at that ‘study’ has shown that there were serious errors that were made. As one website said (How Old Is the Mount St. Helens Lava Dome?) “In June of 1992, Dr. Steven Austin took a sample of dacite from the new lava dome inside Mount St. Helens, the volcano in Washington state. The dacite sample was known to have been formed from a 1986 magma flow, and so its actual age was an established fact. Dr. Austin submitted the sample for radiometric dating to an independent laboratory in Cambridge, Massachusetts. The results came back dating the rock to 350,000 years old, with certain compounds within it as old as 2.8 million years. Dr. Austin's conclusion is that radiometric dating is uselessly unreliable. Critics found that Dr. Austin chose a dating technique that is inappropriate for the sample tested, and charged that he deliberately used the wrong experiment in order to promote the idea that science fails to show that the Earth is older than the Bible claims. Yet the experiment remains as one of the cornerstones of the Young Earth movement.” Here is more information from another website: (The Failure of Austin and Swenson to Recognize Obviously Ancient Minerals) said, “Because radiometric dating utterly refutes their biblical interpretations, young-Earth creationists (YECs) are desperate to undermine the reality of these methods. As part of their efforts, YEC Dr. Steve Austin and his associates at the Institute for Creation 'Research' (ICR) collected a dacite sample from Mt. St. Helens, Washington State, USA, which probably erupted in 1986 AD. Austin et al. then ineffectively separated the sample into several mineral and glass 'fractions', submitted the dacite and its 'fractions' for potassium 40-argon 40 (K-Ar) dating, and subsequently used the bogus results to inappropriately attack the K-Ar method. Austin's conclusions on this project are summarized at the ICR website. The 'research' efforts of Austin and his colleagues and their 'expertise' in radiometric dating have been widely criticized, including by Joe Meert (also here), Karen Bartelt and company and myself at No Answers in Genesis and in my web debate with Dr. David Plaisted at Tim Thompson's 'A Radiometric Dating Resource List' (also here). Considering that the half-life of potassium-40 (40K) is fairly long (1,250 million years, McDougall and Harrison, 1999, p. 9), the K-Ar method cannot be used to date samples that are much younger than 6,000 years old (Dalrymple, 1991, p. 93). A few thousand years are not enough time for 40Ar to accumulate in a sample at high enough concentrations to be detected and quantified. Furthermore, many geochronology laboratories do not have the expensive state-of-the-art equipment to accurately measure argon in samples that are only a few million years old. Specifically, the laboratory personnel that performed the K-Ar dating for Austin et al. Specifically, personnel at Geochron Laboratories of Cambridge, Massachusetts, USA, performed the K-Ar dating for Austin et al. This laboratory no longer performs K-Ar dating. However, when they did, their website clearly stated in a footnote that their equipment could not accurately date rocks that are younger than about 2 million years old (\"We cannot analyze samples expected to be younger than 2 M.Y.\"; also see discussions by Bartelt et al.). With less advanced equipment, 'memory effects' can be a problem with very young samples (Dalrymple, 1969, p. 48). That is, very tiny amounts of argon contaminants from previous analyses may remain within the equipment, which precludes accurate dates for very young samples. For older samples, which contain more 40Ar, the contamination is diluted and has insignificant effects. Considering the statements at the Geochron website and the lowest age limitations of the K-Ar method, why did Austin submit a recently erupted dacite to this laboratory and expect a reliable answer??? Contrary to Swenson's uninformed claim that ' Dr Austin carefully designed the research to counter all possible objections', Austin clearly demonstrated his inexperience in geochronology when he wasted a lot of money using the K-Ar method on the wrong type of samples.” Anyway, just be assured that there are good and accurate ways to date ancient things, but the techniques are actually fairly complex and if you want to REALLY understand them, you should do some research on science sites where they teach about these things. ",
            "date": "Answered October 13, 2019",
            "views": "44",
            "upvotes": "0"
        }
    ]
}