{
    "title": "When is the Yellowstone super volcano going to erupt? - Quora",
    "tags": [
        "Yellowstone Volcano",
        "Supervolcanoes",
        "Yellowstone National Park"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jesse Lee O’Connor 李杰西",
                "href": "/profile/Jesse-Lee-O-Connor-李杰西"
            },
            "answer_text": "Originally answered 18 May, 2018. Another caldera-forming eruption is theoretically possible, but it is very unlikely in the next thousand or even 10,000 years. Scientists have also found no indication of an imminent smaller eruption of lava in more than 30 years of monitoring. Volcano - Yellowstone National Park (U.S. National Park Service) I like to tease my Yellowstone tour guests as we come around the bend between Lewis Falls and Lewis Lake, upon just having enterered the Lava Creek caldera of the most recent super eruption: “They say that Yellowstone erupts on average every 600,000 years. The last one was 631,000 years ago. Uh, oh! We’re overdue! This means it could go off any minute now, right?” (Many resources including displays at Yellowstone’s Canyon Visitor Education Center are still using numbers from more than three years ago: 640,000)  https://howsyourrobot.com/2011/12/27/yellowstone-super-volcano-boom/ Who are these “they” people anyway? Who is providing the popular information on the street, giving out free samples of addictive paranoia to hook the guileless? It’s fake science or at least manipulated anxiety. Then I share the reassurances given by the Yellowstone Volcano Observatory and the good folks at the University of Utah who monitor and analyse data continually of the activity of the hot spot below us, that it won’t happen for at least 10,000 years. They could be mistaken, and, all experts admit we will probably have smaller volcanic events within that time which fall short of a full caldera-forming eruption. But all scientists who I read and cite agree there will be advance warning, especially in the form of massive uplift of the ground where magmic pressure is warping and stretching the earth’s crust. Increased and different kinds of eathquakes than what we experience frequently in the park are also being watched/listened for.  Interpreting The Landscape Recent And Ongoing Geology Of Gtnp And Ynp p. 12. Then, I say, “Its not going to happen today or even this year but I’d better not make any more promises!” Nervous laughter from behind me. I go on to play a little bit of devil’s advocate saying that a “small event” of this hot spot could be the size of Mt. St. Helen’s 18 May, 1980 eruption, 40 years ago, or larger! Eruptions are relative. Resistance is futile. A Volcanic Explosivity Index - 5 eruption can only be called “small” in comparison to the potential of VEI 8. But smaller events than that are extremely likely before larger ones.  https://www.google.com/search?biw=414&bih=622&tbm=isch&sa=1&ei=InL_WqPTJMO0tQWJ9KywBQ&q=yellowstone+yogi+boo+boo+eruption&oq=yellowstone+yogi+boo+boo+eruption&gs_l=mobile-gws-wiz-img.3...6795.9725..11045...0....302.2303.0j1j7j1......0....1.........30i10.cNaqBSnXnVI%3D#  Yellowstone volcano eruptions caused 80-year winters, researchers say Those who say it “goes off every 600,000 years” so that it’s “overdue” misrepresent the geologic record. Where did this “every 600,000 years” supposed average come from? I can see why 600,000–800,000 years would appeal, since the average interval between the three most recent caldera forming eruptions was 700,000 years, [2,100,000 divided by 3] lending wiggle room for a very inexact prediction. But the 631,000 years ago eruption, even last year’s number 640,000 makes the next by no means “overdue.” But then again, 13,800 years ago an eruption of Mary Bay of Yellowstone Lake made a 5 km. mini caldera. 174,000 years ago West Thumb Bay was formed…Five events within 2,100,000 years equals an average of 420,000 years, making the next one very overdue, if you spin it that way. Your odds are still much greater of heart attack or nuclear war or being struck by lightning in your lifetime.  The Four Horses of the Apocalypse - 2000pc Jigsaw Puzzle by Anatolian Jesse Lee O’Connor 李杰西's answer to If Yellowstone eruption is 40k years late, why hasn't it erupted? Add the 70,000 YA lava flow to make 6 events in 2,100,000 years? Ooooh. Better not. This information is a regular feature in my guided Yellowstone tour. ™ More recent research allows a large eruption could happen sooner than 10,000 years but it would give decades of advanced notice before the magma becomes more fluidic or eruptible. even if large eruptions are preceded by only decades of unrest, this is still something we are positioned to detect well in advance. Dr. Michael Poland YVO/USGS The Yellowstone supervolcano could rumble to life far faster than we thought) ",
            "date": "Updated February 22, 2020",
            "views": "35",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ron Garrett",
                    "user_href": "/profile/Ron-Garrett-2"
                },
                {
                    "user_id": "Lynn Mungo",
                    "user_href": "/profile/Lynn-Mungo"
                },
                {
                    "user_id": "Carol Dieter",
                    "user_href": "/profile/Carol-Dieter-2"
                },
                {
                    "user_id": "Rigopoula Tsambou Talarantas",
                    "user_href": "/profile/Rigopoula-Tsambou-Talarantas"
                },
                {
                    "user_id": "Carly Jolan",
                    "user_href": "/profile/Carly-Jolan"
                },
                {
                    "user_id": "Denis Oakley",
                    "user_href": "/profile/Denis-Oakley"
                },
                {
                    "user_id": "David Berger",
                    "user_href": "/profile/David-Berger-64"
                },
                {
                    "user_id": "Harsh Godhwani",
                    "user_href": "/profile/Harsh-Godhwani"
                },
                {
                    "user_id": "Brian Parham",
                    "user_href": "/profile/Brian-Parham-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kelly Martin",
                "href": "/profile/Kelly-Martin-26"
            },
            "answer_text": "No one really knows. The last three big eruptions at Yellowstone were 2.1 million, 1.3 million, and 630,000 years ago. That’s intervals of 800,000 and 670,000 years, and an as-yet-unfinished interval of 630,000 years. Based on so few data points, we cannot say what the statistically expected recurrence interval is with any degree of precision. A qualitative guess might yield an estimated recurrence interval of ~500,000–1,000,000 years, but that is not a good scientific answer. Additional data along the hotspot track leads the USGS to estimate that there have been “15 to 20 caldera-forming eruptions” along the hotspot track from “western Idaho to Yellowstone within the past 16.5 million years.” That is an average of one large eruption every ~825,000–1,100,000 years. Knowing that, the last few eruptions seem anomalously close together. Does that mean these eruption recurrence intervals were unusual, and the next one will be longer? (say, closer to 1 million years after the last eruption, which is ~370,000 years from now)? Or that the eruptions are getting more frequent, and the next one will be closer in time to the last one? (say, anytime after 600,000 years since the last one, which is any day now)? Volcanoes are not alarm clocks or metronomes. They are complex systems affected by both long and short term earth processes. As scientists, we are only scratching the surface (literally) in our understanding of the Earth. The recent study that has been picked up by the news media (e.g., Yellowstone supervolcano could blow faster than thought, destroy all of mankind) tells us little to nothing about when the super volcano could erupt. Rather, the study shows that the last eruption occurred faster than previously thought. Large caldera eruptions are usually preceded and followed by smaller non-explosive eruptions of lava, significant shifting of the overlying land, earthquakes, etc. Previously, researchers thought that these changes spanned >1000 years. That means any large explosive eruption would come with a lot of warning (probably centuries). What the recent study shows is that the events leading up to and following the previous eruption may have spanned decades rather than centuries. If the eruption and its precursors can really happen that quickly, we would have significantly less warning of a catastrophic event. That warning should still be decades. But the difference between decades and centuries is important. Oh, and we also need to remember that the Yellowstone caldera has had numerous non-explosive eruptions over its lifespan. The last rhyolitic lava flow was only ~70,000 years ago. So it is possible for Yellowstone to ‘erupt’ without it producing the explosive event that could wipe out a lot of North America. It’s only the big explosive events that we need to worry about. Further Reading: Volcano Hazards Program YVO Yellowstone Yellowstone Caldera - Wikipedia ",
            "date": "Answered October 15, 2017",
            "views": "59",
            "upvotes": " View 41 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nicholas Geimer",
                    "user_href": "/profile/Nicholas-Geimer"
                },
                {
                    "user_id": "Denis Oakley",
                    "user_href": "/profile/Denis-Oakley"
                },
                {
                    "user_id": "Guillaume Paquette",
                    "user_href": "/profile/Guillaume-Paquette"
                },
                {
                    "user_id": "Venkat Thota",
                    "user_href": "/profile/Venkat-Thota-13"
                },
                {
                    "user_id": "Jonathan K. Skean",
                    "user_href": "/profile/Jonathan-K-Skean"
                },
                {
                    "user_id": "Davide Sacchetti",
                    "user_href": "/profile/Davide-Sacchetti"
                },
                {
                    "user_id": "Anne Runge",
                    "user_href": "/profile/Anne-Runge"
                },
                {
                    "user_id": "Robert Reiland",
                    "user_href": "/profile/Robert-Reiland"
                },
                {
                    "user_id": "Çağrı Mert Bakırcı",
                    "user_href": "/profile/Çağrı-Mert-Bakırcı-1"
                },
                {
                    "user_id": "Vince Padilla",
                    "user_href": "/profile/Vince-Padilla-4"
                }
            ]
        }
    ]
}