{
    "title": "When and how was the ozone layer formed? - Quora",
    "tags": [
        "Ozone & Ozone Layer",
        "Atmospheric Sciences",
        "Science of Everyday Life",
        "Earth (planet)",
        "Planetary Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cathy Garrett",
                "href": "/profile/Cathy-Garrett-7"
            },
            "answer_text": "Welcome to Earth, where the atmosphere is about 20% oxygen. That goes for the gasses at the top of the atmosphere as well, though it’s much lower pressure and more rarefied up there. Being rarefied, it lets in more sunlight than down at ground level, but the oxygen up there still has to deal with the brunt of the solar radiation that the Sun emits. Now, chemicly, oxygen likes being diatomic. that means it prefers pairing up with another oxygen buddy so they can each share and have shared with them, an outer shell electron to make them more chemicly stable. A lone oxygen atom is in a higher energy state than a pair of them chemicly bonded together like this, and nature is always seeking a lower energy state to be in. But, when the unfiltered light from the Sun arrives, especially the UV, it’s bearing a lot of energy. Some of that energy is absorbed by the diatomic oxygen, and they break apart into monatomic oxygen again. With more energy streaming through the upper atmosphere, all that energized monatomic oxygen can come together to form triatomic oxygen, aka. ozone.  So, John is sharing an electron with Jane, who shares an electron with Joe, who shares an electron with John. Everyone gets the electron that they need to be more chemicly stable than being monatomic. Two things: Ozone is more dense than diatomic oxygen, so it falls down in the atmosphere, slightly, so there’s always more diatomic and monatomic oxygen at the highest levels for the Sun’s UV light to turn into ozone, and ozone is in a lower energy state than monatomic oxygen, but not as low as diatomic oxygen, so it’s always looking to kick one of the trio out so the remaining two can drop to the lower energy diatomic form. This gives a “free radical”, a monatomic oxygen where a moment ago there was none, that is now looking for a new chemical dance partner. Some people, nay charlatans, have pitched breathing in ozone as a cure-all. I mean, it has 50% more oxygen than regular air. That’s gotta be better for ya, right? Except that when the above happens in the lungs, and it will if you’re breathing in a lot of it, those monatomic oxygen atoms will happily join with whatever atoms and molecules it finds in your lung tissue.  You think lung cancer from smoking is bad? Well, when a lot of oxygen combines with a lot of other material, we have a few common words to describe that. Corrosion is one. Combustion is another. People who deliberately breathe in ozone are literally burning their lung tissue. Ground level ozone is a pollutant. It’s only the ozone at high altitude that is a UV filter for the atmosphere. ",
            "date": "Answered September 29, 2018",
            "views": "15",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Julian Grodzicky",
                    "user_href": "/profile/Julian-Grodzicky"
                },
                {
                    "user_id": "Daniel James Berger",
                    "user_href": "/profile/Daniel-James-Berger"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vikas Kumar Bishnoi",
                "href": "/profile/Vikas-Kumar-Bishnoi"
            },
            "answer_text": "Stratospheric ozone- Stratospheric ozone is formed naturally by chemical reactions involving solar ultraviolet radiation (sunlight) and oxygen molecules, which make up 21% of the atmosphere. In the first step, solar ultraviolet radiation breaks apart one oxygen molecule (O2) to produce two oxygen atoms (2 O) (see Figure Q2-1). In the second step, each of these highly reactive atoms combines with an oxygen molecule to produce an ozone molecule (O3). These reactions occur continually whenever solar ultraviolet radiation is present in the stratosphere. As a result, the largest ozone production occurs in the tropical stratosphere. The production of stratospheric ozone is balanced by its destruction in chemical reactions. Ozone reacts continually with sunlight and a wide variety of natural and humanproduced chemicals in the stratosphere. In each reaction, an ozone molecule is lost and other chemical compounds are produced. Important reactive gases that destroy ozone are hydrogen and nitrogen oxides and those containing chlorine and bromine . Some stratospheric ozone is regularly transported down into the troposphere and can occasionally influence ozone amounts at Earth’s surface, particularly in remote, unpolluted regions of the globe. Tropospheric ozone- Near Earth’s surface, ozone is produced by chemical reactions involving naturally occurring gases and gases from pollution sources. Ozone production reactions primarily involve hydrocarbon and nitrogen oxide gases, as well as ozone itself, and all require sunlight for completion. Fossil fuel combustion is a primary source of pollutant gases that lead to tropospheric ozone production. The production of ozone near the surface does not significantly contribute to the abundance of stratospheric ozone. The amount of surface ozone is too small in comparison and the transport of surface air to the stratosphere is not effective enough. As in the stratosphere, ozone in the troposphere is destroyed by naturally occurring chemical reactions and by reactions involving human-produced chemicals. Tropospheric ozone can also be destroyed when ozone reacts with a variety of surfaces, such as those of soils and plants.  Stratosphere ozone is good ozone bcz it protect us from Sun's biologically harmful ultraviolet rays and also formed by reaction of natural components. Tropospheric ozone is bad ozone, formed by the reaction of man made pollutants, harmful to plants and animals. ",
            "date": "Answered September 15, 2017",
            "views": "5",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sharat Behera",
                    "user_href": "/profile/Sharat-Behera-2"
                },
                {
                    "user_id": "Rishabh Goyal",
                    "user_href": "/profile/Rishabh-Goyal-17"
                },
                {
                    "user_id": "Daniel James Berger",
                    "user_href": "/profile/Daniel-James-Berger"
                },
                {
                    "user_id": "Riya Gohil",
                    "user_href": "/profile/Riya-Gohil-3"
                },
                {
                    "user_id": "Abhimanyu Yadav",
                    "user_href": "/profile/Abhimanyu-Yadav-115"
                },
                {
                    "user_id": "Gurpreet Sidhu",
                    "user_href": "/profile/Gurpreet-Sidhu-7"
                },
                {
                    "user_id": "Naresh Thakur",
                    "user_href": "/profile/Naresh-Thakur-5"
                }
            ]
        }
    ]
}