{
    "title": "When passing white light through a glass prism, which colour ray will deviate the most? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Dadarao Dhone",
                "href": "/profile/Dadarao-Dhone"
            },
            "answer_text": "The violate will bent the most; but, why? For please go through below. An ultimate the smallest single light photon representing a single wave, representing a single boson light photon, having any frequency, have energy and corresponding mass equal to ‘h’ J.one cycle; the planks constant and mass, m=h/c^2. Each wave of each color-light has the same energy and the same mass in free space. Mass is associated with gravitational force proportionate to its mass multiple of mass of which gravity is acting on it. In this case the light is passing through the prism and the gravitational forcec of particles of prism are acting on the light. All partical masses of each particle of prism are constant. Each prism particle length in direction of light travel, is also the same. Hence in a suitable unit length, the particles of prism will show, the same gravitational force. But, the light particle length differs and depends on light frequency of that color light.Hence, in an unit length, different color lights’ particles will be differing in quantity; the red will be smaller and the O, Y, G, B, I, V serially will be increasing. When all these seven colored lights are directed in a thin ray on the prism’s slanting surface; the red light will experience less and consecutively the violate light most gravitational pull towards the base of the prism because, the prism goes widening towards base increasing number of prism particles in line parallel to the base thus increasing gravitational force more on its nearer light, Through plane glass this phenomena doesn’t happen . Gravity acts on particle basis. Beween any two masses each partcle each mass acts on all particles of other mass. Hence, the fact we see that, the acceleration due to gravity of earth on different masses creates the same acceleration. ",
            "date": "Answered February 28, 2018",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bheem Singh Chouhan",
                "href": "/profile/Bheem-Singh-Chouhan"
            },
            "answer_text": " Maximum deviation in voilet color due to its minimum wavelength. ",
            "date": "Answered February 8, 2018",
            "views": "16",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Beginners Blog",
                    "user_href": "/profile/Beginners-Blog-2"
                }
            ]
        }
    ]
}