{
    "title": "When will Donald Trump admit that COVID-19 is serious? - Quora",
    "tags": [
        "Conspiracy Theories",
        "COVID-19 (2019-2020)",
        "Donald Trump (politician, business person)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sherman Winston",
                "href": "/profile/Sherman-Winston"
            },
            "answer_text": "Admit to who? Himself? It must be. I can't imagine any person in there right mind, needing Donald Trump to admit to the conditions of Covid-19. A pandemic virus, that's been globally loose for over seven months,— and is on the every news channels 24/7. That, is mind blowing. Shari. Off course! He has admitted. I'm pretty sure that he has long accepted that Covid 19, is a reality. The president is still the best looked after body in person living in America. Even— more so, now that he is President. Donald Trump has everything he desires at his beck and call. That's also true before, and as President. The king like life? Some would say. And. I do believe that, that mixture of the man has not yet been inferred into the frontal lobes of a society,—his critics, shall we say? A collective mindset, sort of, antique fashioned, —a culture notion of customary expectations, that has always been the norm,— to expect from every president. “Please America, wake up”, screams the nerves of the man. It's the twenty-first century. No wonder traits of eighteenth century are believed to be in linger in America. Trump is European in blood. A very significant element, presently revealing. But, left untouched. President Trump, from the very beginning, has been unleashing a Socrates style rhetoric, and that hasn't change. Must he conform in adherence to the fake media,—as he beautifully calls them? Or, fake them instead? You bet, the latter. Is the Presidency of Donald Trump, an energy opening the flawed gates of the American democratic-policy making system? We ought be thankful, if that was so. And. How many would admit to that, had that been the question? As the question of admitting is stock like a pie to Trumps’ face. Does anybody out there really believe, that their conception of the Covid-19,—to affect the reality of the pandemic rampage in America, is any different from anybody else's,— to include Donald Trump? The title president, makes no difference. At least that's displayed in the attitude of the man, — and rightly so. For, he is President, and has been given power to conduct his ego which ever way. For the people, or for God knows what? Let's suppose, that he was a (“war mongrel President”), extending his ego for the nation sovereign pride,— responsible for the destruction and mayhem to other nations women, children and soldiers alike? Would there be question, so long lasting on his integrity of admittance? History says, “No\". So. What really comes to light, presently is a hypocrisy of a people amidst a complex immaturity that need growing up? And. I won't. be surprised, if that's what circles in the mind of the man, as he have repeatedly ask his haters to get a life. ",
            "date": "Updated August 10, 2020",
            "views": "156",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Janet Day",
                    "user_href": "/profile/Janet-Day-5"
                },
                {
                    "user_id": "Ronald Turkett",
                    "user_href": "/profile/Ronald-Turkett"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amie Wilson",
                "href": "/profile/Amie-Wilson-43"
            },
            "answer_text": "He is never going to admit it. Right now it is Friday evening, July 10. And I am astounded, my jaw is dropped, at the rate of infection and death again. This is Trump's biggest crime by far. This is the innocent deaths of people that could have been stopped a long time ago. It is inexcusable, it is actually negligent homicide. He will be charged for these crimes the first step he takes off of the lawn of the White House when he is elected out of office. I don't care if you're Republican or Democrat this is just absolutely unbelievable. It is a nightmare. These are innocent lives that are being snuffed out completely 100% by Trump and his administration's policies. I have been a nurse for the past 25 years, let me tell you… these people that are dying it is the most intense suffering, brutal way to die. To strangle in the fluid built up in your lungs, to panic and not have oxygen, to be deathly afraid and no family member is allowed to even be by you. This is crimes against humanity people. Does everybody get it now? Please, I hope everybody understands…the monster in the White House does not care at all about any of us, not even our children. All of us, we need to step up and get it stopped right now. please you all. There cannot be any more deaths and suffering, it's all needless it should not be happening. I beg everybody. Please ",
            "date": "Answered July 10, 2020",
            "views": "362",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mark Astley",
                    "user_href": "/profile/Mark-Astley-5"
                },
                {
                    "user_id": "Derek Beck",
                    "user_href": "/profile/Derek-Beck-17"
                },
                {
                    "user_id": "Marilyn Kessler",
                    "user_href": "/profile/Marilyn-Kessler-4"
                },
                {
                    "user_id": "Janet Day",
                    "user_href": "/profile/Janet-Day-5"
                },
                {
                    "user_id": "Andre Dzierla",
                    "user_href": "/profile/Andre-Dzierla"
                },
                {
                    "user_id": "Nila Martin",
                    "user_href": "/profile/Nila-Martin"
                },
                {
                    "user_id": "Kirsty Bonner",
                    "user_href": "/profile/Kirsty-Bonner-2"
                },
                {
                    "user_id": "Joan Hardie",
                    "user_href": "/profile/Joan-Hardie-1"
                },
                {
                    "user_id": "Daniel Barlow",
                    "user_href": "/profile/Daniel-Barlow-21"
                },
                {
                    "user_id": "Mike Roberts",
                    "user_href": "/profile/Mike-Roberts-782"
                }
            ]
        }
    ]
}