{
    "title": "When has a thief impressed you with ingenuity? - Quora",
    "tags": [
        "Ingenuity",
        "Thieves",
        "Theft",
        "Crime"
    ],
    "response": [
        {
            "author_info": {
                "name": "Roger Cole",
                "href": "/profile/Roger-Cole"
            },
            "answer_text": "In the 1990′s all the way up to early 2010’s a thief named Blane Nordahl only stole one thing: Silver – specifically fine silver tea sets, bowls, platters, candy dishes, vases, candlesticks, salt shakers, and the like. Why? Because the objects he stole were high value, but more importantly… the owners of the items would typically not know of the theft or report the theft to the police for weeks, and months, and more. Seriously, how often do you bring out the $12,000 silver tea set for afternoon tea in Connecticut According to the New Yorker article linked below, he was known to have burglarized from Ivana Trump, Bruce Springsteen, Steven Spielberg, and other celebrities. He worked rich areas all over Mid-Atlantic. He became an expert at knowing fine silver. Say what you want about despicable thieves. But stealing over $3 million in items that the owners didn’t notice gone for months is ingenious. The Thief Who Steals Only Silver ",
            "date": "Answered July 21, 2020",
            "views": "468",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dan Winnestaffer",
                "href": "/profile/Dan-Winnestaffer"
            },
            "answer_text": "It wasn't a thief. It was an offender at the prison I worked. He had a bunch of full cans of soda stacked in the corner of his cell. I was doing a routine cell search. I picked up a couple of them to do a random “temperature test\". If it doesn't feel cool to the touch, that is an indication that the soda has been taken out and that there may be something else in there. He had figured out how to get the top off the can. Had put some K2 inside a small pill bottle. Put the pill bottle down inside the can. Poured some melted soap inside there can with it. So that when there soap hardened again it would keep the pill bottle from vibrating if I picked it up. He then meticulously glued the cans top back on. Then he put it at the bottom of all the other FULL cans of soda. There was probably 30 cans of soda there. A+ for ingenuity. ",
            "date": "Answered May 20, 2020",
            "views": "87",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gwyn McVay",
                    "user_href": "/profile/Gwyn-McVay"
                },
                {
                    "user_id": "Horace Thon",
                    "user_href": "/profile/Horace-Thon"
                },
                {
                    "user_id": "Roger Cole",
                    "user_href": "/profile/Roger-Cole"
                }
            ]
        }
    ]
}