{
    "title": "When pressure and temperature increases, what happens to volume? - Quora",
    "tags": [
        "Pressure (physics)",
        "Temperature",
        "Thermodynamics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Valente Hernandez Perez",
                "href": "/profile/Valente-Hernandez-Perez"
            },
            "answer_text": "Increasing simultaneously both the temperature and pressure of the gas in a container can either produce a change on the volume or the volume can remain constant, depending on the amount of changes in the temperature and pressure, as well as whether the container can expand to change its volume. If the container is rigid, the volume will remain constant, which is called isovolumetric process, Otherwise, If the container can deform and/or expand to some extent, the volume will increase or decrease depending on the amount of changes in the temperature and pressure, as the volume is directly proportional to temperature, but inversely proportional to pressure. The volume will remain constant if both temperature and pressure increase by the same factor. This is governed by the ideal gas law, V=nRT/P. ",
            "date": "Answered September 26, 2020",
            "views": "769",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rand Gerald",
                "href": "/profile/Rand-Gerald"
            },
            "answer_text": "Volume could increase, decrease, or even be unchanged. It all depends upon which factors change and by how much. The ideal gas model: p v = n r t can be generalized as: v = n r t / p The volume is proportional to temperature but inversely proportional to pressure. temperature doubles and pressure stays the same: v = n r 2t / p -> volume doublestemperature stays the same and pressure doubles: v = n r t / 2p -> volume halvestemperature and pressure both double: v = n r 2t / 2p = n r t / p -> volume stays the same",
            "date": "Answered August 28, 2018",
            "views": "37",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vy Giang",
                    "user_href": "/profile/Vy-Giang-1"
                },
                {
                    "user_id": "Yonah Elorza",
                    "user_href": "/profile/Yonah-Elorza"
                },
                {
                    "user_id": "Josiah Loh",
                    "user_href": "/profile/Josiah-Loh"
                },
                {
                    "user_id": "Jacques Proot",
                    "user_href": "/profile/Jacques-Proot"
                }
            ]
        }
    ]
}