{
    "title": "Where is zinc used? - Quora",
    "tags": [
        "Zinc (element)",
        "Biochemistry",
        "Chemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rahul Dhanuka",
                "href": "/profile/Rahul-Dhanuka-15"
            },
            "answer_text": "There are so many usage of Zinc: Zinc is currently the fourth most widely consumed metal in the world after iron, aluminum, and copper. It has strong anticorrosive properties and bonds well with other metals. Consequently, about one-half of the zinc that is produced is used in zinc galvanizing, which is the process of adding thin layers of zinc to iron or steel to prevent rusting. The next leading use of zinc is as an alloy; the zinc is combined with copper (to form brass) and with other metals to form materials that are used in automobiles, electrical components, and household fixtures. A third significant use of zinc is in the production of zinc oxide (the most important zinc chemical by production volume), which is used in rubber manufacturing and as a protective skin ointment. Contact with Best Zinc Manufacturer, Ambica Dhatu Private Limited. ",
            "date": "Answered September 3, 2019",
            "views": "107",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sonya Morris",
                "href": "/profile/Sonya-Morris-2"
            },
            "answer_text": "Zinc is currently the fourth most widely consumed metal in the world after iron, aluminum, and copper. It has strong anticorrosive properties and bonds well with other metals. Consequently, about one-half of the zinc that is produced is used in zinc galvanizing, which is the process of adding thin layers of zinc to iron or steel to prevent rusting.   The next leading use of zinc is as an alloy; the zinc is combined with copper (to form brass) and with other metals to form materials that are used in automobiles, electrical components, and household fixtures. A third significant use of zinc is in the production of zinc oxide (the most important zinc chemical by production volume), which is used in rubber manufacturing and as a protective skin ointment.   Zinc is also important for health. It is a necessary element for the proper growth and development of humans, animals, and plants. The adult human body contains between 2 and 3 grams of zinc, which is the amount needed for the body's enzymes and immune system to function properly. It is also important for taste, smell, and to heal wounds. Trace amounts of zinc occur in many foods, such as oysters, beef, and peanuts.  ",
            "date": "Answered January 1, 2016",
            "views": "822",
            "upvotes": "0"
        }
    ]
}