{
    "title": "Where is the largest radio telescope on Earth? - Quora",
    "tags": [
        "Amateur Astronomy",
        "Telescopes",
        "Radio",
        "Earth (planet)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kevin Parker",
                "href": "/profile/Kevin-Parker-281"
            },
            "answer_text": "For over fifty years, the world’s largest single-dish radio telescope was the National Astronomy and Ionosphere Center (NAIC), popularly known as the Arecibo Observatory due to its location outside the city of Arecibo in Puerto Rico. Literally built in a karst sinkhole, it’s 1,000 feet (305 meters) in diameter and went operational in 1963.  The NAIC radio telescope in Arecibo, Puerto Rico. However, in July 2016 the Chinese completed work on their Five-hundred-meter Aperture Spherical Radio Telescope (FAST for short). Likewise built over a natural depression (in Guizhou in southwest China), it’s a whopping 500 meters (1640 feet) in diameter.  The Chinese FAST radio telescope in the late stages of construction. You could also make the case that by diameter the Russian RATAN-600 radio telescope is larger. It’s 576 meters (1900 feet) in diameter, but it’s not a solid dish, just a ring that focuses radio waves onto a receptor antenna in the center.  The Academy of Sciences Radio Astronomy Telescope – 600 in Russia. (The acronym is of course based on the Russian form of the name.) However, none of these dishes are steerable. The largest fully steerable radio telescope is the Robert C. Byrd Green Bank Telescope (GBT) in Green Bank, West Virginia, 100 meters (328 feet) in diameter.  The Green Bank Telescope, with a collecting surface of 2.3 acres (0.93 hectares). And if you include arrays of telescopes that work together, the nod goes to the Atacama Large Millimeter/submillimeter Array (ALMA), an international collaborative installation of 66 dishes up to 12 meters (40 feet) in diameter in Chile, which can be moved close together or spread out up to 16 kilometers (10 miles) apart. It is said that if you could use radio waves to detect pepperoni, ALMA could pick out individual chunks on a pizza 325 miles (525 kilometers) away.  Some of the dishes that make up the ALMA array. ",
            "date": "Answered January 17, 2020",
            "views": "225",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "John George",
                    "user_href": "/profile/John-George-251"
                },
                {
                    "user_id": "Steve Tanner",
                    "user_href": "/profile/Steve-Tanner-21"
                },
                {
                    "user_id": "Paul McQuesten",
                    "user_href": "/profile/Paul-McQuesten-1"
                },
                {
                    "user_id": "Mitchell Schoenbrun",
                    "user_href": "/profile/Mitchell-Schoenbrun"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roger Phelps",
                "href": "/profile/Roger-Phelps-4"
            },
            "answer_text": "It depends on what you mean by radio telescope. If it is a single structure then Aricebo is a good candidate. It is set to be overtaken by a telescope under construction in China. These point straight up so their steerability is limited. Green bank is a candidate for the largest mechanically steered single antenna. There are various synthesised radio telescopes that use a large number of individual antennae, steerable or not, that deliver very fine angular resolution. The biggest of these can span the whole surface of the Earth (at any given time only the hemisphere for which the object being viewed is above the horizon can be used). Such an interferometric array is currently being used in attempt to resolve the black hole at the centre of the Milky Way. ",
            "date": "Answered November 30, 2018",
            "views": "79",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mike Griffin",
                    "user_href": "/profile/Mike-Griffin-150"
                },
                {
                    "user_id": "Steve Dutch",
                    "user_href": "/profile/Steve-Dutch"
                }
            ]
        }
    ]
}