{
    "title": "Where does Water on earth came from? - Miracles of Quran - Quora",
    "tags": [
        "History of the Quran",
        "Islam and Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mohsin.S Rizvi",
                "href": "/profile/Mohsin-S-Rizvi"
            },
            "answer_text": "When those comets enter our atmosphere the heat generated on entry vaporizes this ice into the atmosphere. Comets, trans-Neptunian objects, or water-rich meteoroids (protoplanets) from the outer reaches of the asteroid belt colliding with Earth may have brought water to the world's oceans. Asteroids may have been primarily responsible based on several studies, including measurements of the ratio of the hydrogen isotopes deuterium and protium, since similar percentage impurities as in carbon-rich chondrites were found in oceanic water, whereas previous measurement of the isotopes' concentrations in comets and trans-Neptunian objects correspond only slightly to water on Earth. In January 2018, researchers reported that two 4.5 billion-year-old meteorites found on Earth contained liquid water alongside a wide diversity of deuterium-poor organic matter.Wikipedia, Origin of water on Earth, 2019 The Christian Bible says that God created water directly on Earth, however the Quran didn't do this mistake instead it says that God sent down water from outer space and then made Earth its dwelling: [Quran 23.18] And We sent down water from the heaven in proper quantity, and we made Earth its dwelling, and We are Able to take it away.  If God made Earth its dwelling (فَأَسْكَنَّاهُ فِي الْأَرْضِ ) then this means that water formed in outer space. In another verse the Quran explains how water came down from outer space. [Quran 2.164] ... In the water which Allah sent down from the Heavens and brought with it life to Earth after being dead and gave life in it to every kind of land animal; And in directing the winds; And in the clouds that are enslaved between the Heavens and the Earth; [All these] are Signs for a people who comprehend.  So the water itself came from the heavens above the clouds. Here God is not talking about rain (matar or wadk in Arabic) instead God is talking about water (مَاءٍ). In another verse, the Quran says that water originally came from the heavens above the clouds in the form of ice. There are mountains in the heaven that have ice inside them; those mountains could fall on Earth making a very bright flash: [Quran 24.43] Can't you see that Allah makes the clouds move gently, then joins them together, then makes them into a pile? Then you see rain come out from within? And He sends down from heaven mountains with ice inside them; that strike whomever He wishes or miss whoever He wishes; Its flash almost blinds you.  God sent down from the heavens (above the clouds) mountains with ice inside them!!! The clouds are enslaved between the Heavens and the Earth but the water itself originally came from the Heavens (above the clouds) in the form of ice in mountains. They make a bright flash; but this is the same description of comets and meteors when they hit our atmosphere. How could an illiterate man who lived 1400 years ago have known that water originally came from ice in comets? More than half your body weight is water. Animals and plants on Earth are mostly water. All life in our universe also needs water. When scientists search for life on exoplanets they only look for planets with water; No water no life. However Moslems knew about this 1400 years before it was discovered. [Quran 21.30] Do not those who disbelieve see that the heavens and the Earth were meshed together then We ripped them apart? And then We made of water everything living? Would they still not believe?  In the Quran all life, on Earth and in the heavens, depends on water. How could an illiterate man who lived 1400 years ago have known that all life in the universe also needs water? Water covers about 71% of Earth's surface. This is also the same ratio the word \"Sea\" and word \"Land\" appear in the Quran. \"Sea\" 32 times and \"Land\" 13 times. The ratio of \"Sea\" to the total (Sea + Land) = 32/(32+13) = 71%. (The rainbow is a phenomena caused by the interaction of light with water droplets. The characteristics of light and how it interacts with other substances didn't change since the Big Bang, 13.7 bln years ago. But according to the Bible God created the Rainbow only 4000 years ago at the time of Noah. Genesis 9:12-13). ",
            "date": "September 24, 2020",
            "views": "523",
            "upvotes": " View 25 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Muhammad Ayaz",
                    "user_href": "/profile/Muhammad-Ayaz-382"
                },
                {
                    "user_id": "Ahmed Nabebizz",
                    "user_href": "/profile/Ahmed-Nabebizz"
                },
                {
                    "user_id": "Azem",
                    "user_href": "/profile/Azem-1"
                },
                {
                    "user_id": "Arafath Hosain",
                    "user_href": "/profile/Arafath-Hosain"
                },
                {
                    "user_id": "Aqsa Shakeel",
                    "user_href": "/profile/Aqsa-Shakeel-26"
                },
                {
                    "user_id": "Rowa M",
                    "user_href": "/profile/Rowa-M"
                },
                {
                    "user_id": "Mahathir Inidal",
                    "user_href": "/profile/Mahathir-Inidal"
                },
                {
                    "user_id": "Asad Ullah",
                    "user_href": "/profile/Asad-Ullah-735"
                },
                {
                    "user_id": "M Taheer",
                    "user_href": "/profile/M-Taheer-1"
                },
                {
                    "user_id": "Maria Tavarez",
                    "user_href": "/profile/Maria-Tavarez-20"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ray Richard",
                "href": "/profile/Ray-Richard-21"
            },
            "answer_text": "Water is hydrogen burning. It’s usually contained in comets. They come from a place called space. There are quadrillions of planets and stars, none of which have any life on them. There’s nothing inherently special about this planet. Sure, it feels special to us, because it’s the only one we have, but that doesn’t mean this is all part of some divine plan. In order to even begin to suggest so, you’d have to have an overwhelming amount of evidence that suggests that a deity even literally exists. ",
            "date": "September 25, 2020",
            "views": "125",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sarah Cossald",
                    "user_href": "/profile/Sarah-Cossald"
                },
                {
                    "user_id": "Laiba Saeed",
                    "user_href": "/profile/Laiba-Saeed-27"
                },
                {
                    "user_id": "Mohsin.S Rizvi",
                    "user_href": "/profile/Mohsin-S-Rizvi"
                }
            ]
        }
    ]
}