{
    "title": "Where does The Big Bang Theory take place? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Wayne Francis",
                "href": "/profile/Wayne-Francis"
            },
            "answer_text": "It took place everywhere we can see about 13.8 billion years ago.It is a common misconception that it had a centre point.  Observations don't support that with regards to spacial dimensions.  You could think of it having a centre point with relation to the time dimension if it helps you.The Big Bang Theory stars with a preexisting universe that is of a given volume > 0 and in a very hot dense state.  Then for some reason underwent a phase transition where every point in that >0 volume of space inflated rapidly.  ",
            "date": "Answered February 25, 2016",
            "views": "817",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Emi Buliga",
                    "user_href": "/profile/Emi-Buliga"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Chidakel",
                "href": "/profile/David-Chidakel"
            },
            "answer_text": "Edwin Hubble discovered the expansion of the universe in 1929; he observed that objects move away from each other in approximate proportion to the distance of their separation from one another. Because of this, galaxies that are very far from Earth recede from us faster than light can return and are thus invisible to us. We call the visible portion of the universe the “known” universe. The rest we say is unknown, Because we can directly observe the known universe, we can state categorically that the Big Bang takes place there. We can only infer expansion for the invisible portion. ",
            "date": "Answered December 28, 2019",
            "views": "301",
            "upvotes": "0"
        }
    ]
}