{
    "title": "Which is more important in sport - winning or taking part? Are you a good loser? - Quora",
    "tags": [
        "Losers",
        "Winning",
        "Professional Sports"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Thompson",
                "href": "/profile/John-Thompson-514"
            },
            "answer_text": "In high school I was an athlete and was very good in some sports while others I was just average or slightly above average. Later in martial arts I established myself as a pretty good fighter in full contact kick boxing and amassed a pretty good record. Still later after accomplishing all I could with that I then did the tournament and sport karate thing and established myself in that quite a bit and even qualified for the US Pan Am/World Games Team in 1993. What I have learned throughout all this is that part of competing and winning is also losing and that you are going to sometimes lose for anyone of a number of reasons including someone being better than you or performing better than you on a given day. You can only directly control somewhat how good you are and perform to some extent and not always so much the other guy or the other team. When you do lose the important is that it was not for something within your control that you could have otherwise changed that would have made a difference then. That and learning from your mistakes and why you lost are important and you not repeating the same mistakes and being better next time out as well as how you respond to losing. Others respect you for winning but they will respect you even more and in different ways if you can take your loss well and look at it objectively and learn from it is what I have also found and how I look at it. Just let me add that I have also played a few intramural sports or sports for fun. Then having fun is the important thing and is the priority for most I think but some people are so competitive that they can’t turn having to win off. So participating and taking part is the important thing there with that I think ",
            "date": "Answered July 8, 2020",
            "views": "330",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Thomas McKeon",
                "href": "/profile/Thomas-McKeon-14"
            },
            "answer_text": "For me winning was the reason I played. I was rejected growing up from any team I tried out for. I had a nightmarish academic experience that left me with very few options in all facets of adult life. I always knew I could play sports. I felt less than pretty much every one. The jocks got to live my dreams, and to everyone else I was just stupid. My senior year of high school I made up all my 3 years of Phys Ed. Gym teacher had me 9 classes a week for a year. They let me live in the gym playing basketball. I became one helluva player upon leaving school. I was unable to find a real job. I did find a lot of trouble at the bottom of a bottle. Through it all, I always had sports to buoy my flagging spirits. I threw all my time into lifting weights, playing ball and putting to rest the idea that I had any athletic equal in my cliquish town. All I had were painful memories of failing. At school and at sports. Sports doesn’t end after school, it goes on and on. I made sure there was one thing in life that would earn me a reputation for something positive. Yes I could out run anyone, out play every one in any sport. I climbed ladders with 3 bundles of roof shingles on my shoulder for years. When I ran on a flat surface I felt like I needed a parachute to slow down. Sports were my way of trying to erase shitty childhood memories. All I had. I played with a lot of white collar people who never understood my intensity. Lawyers, businessmen, people who were accomplished. All I could do was separate myself athletically from everyone. ",
            "date": "Answered April 30, 2020",
            "views": "385",
            "upvotes": "0"
        }
    ]
}