{
    "title": "Which colour has the least wavelength in water? - Quora",
    "tags": [
        "Waves (physics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Harshita Vaswani",
                "href": "/profile/Harshita-Vaswani-1"
            },
            "answer_text": "Violet Vibgyor, you must have heard this word. The order of light in colours are arranged on the basis of their wavelength and this order is lucid because it is known by its name 'Vibgyor'.  V- violet has the lowest wavelength I- indigo comes next B-blue occupies the third place succeeding green, yellow, orange and red. It is clearly visible in the picture that the length of violet seems to be the shortest but the color that scatter the most is not violet but blue because Violet is human eye sensitive.Blue succeed violet.but let us hold on for a while and again read the above mentioned question, this time question want an answer for the least wavelength in ‘water'.?? Still the answer is violet but the reason for violet to not scatter the most is that it is color sensitive and blue stabs violet and replaces it. Answer to why this is so Water owns intrinsic blue colour that means that the color of water which scatters most in water is blue. PS. We know that wavelength is inversely proportional to scattering of light because the mother earth gave birth to people like 'Releign’ ( great respect to you sir). So smaller the wavelength of a particular color of light more the scattering of light by that colour. I guess that answers your question.Please upvote if you liked my answer.",
            "date": "Answered February 16, 2017",
            "views": "732",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Filhaal Nihal",
                    "user_href": "/profile/Filhaal-Nihal-1"
                },
                {
                    "user_id": "Dewansh Vaswani",
                    "user_href": "/profile/Dewansh-Vaswani"
                },
                {
                    "user_id": "Prajjwal Sinha",
                    "user_href": "/profile/Prajjwal-Sinha"
                }
            ]
        }
    ]
}