{
    "title": "Which element has 18 electrons and 20 neutrons and charge is - 2? - Quora",
    "tags": [
        "Neutrons",
        "Protons",
        "Electrons",
        "Particle Physics",
        "Chemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sanket Kulkarni",
                "href": "/profile/Sanket-Kulkarni-23"
            },
            "answer_text": "Before answering your question you intended to ask ,basic chemistry says that elements can't have charges . If elements are represented with charges they are called as ions. Elements give or take electrons depending on their affinity to electrons to become ions. Now giving possible solutions for an ion with 18 electrons 20 neutrons and -2 oxidation state , here are the one which are near to the description Ca(2+) has 18 electrons and 20 neutrons but +2 oxidation state.S(2-) has 18 electrons and -2 oxidation state but only 18 neutrons.Somewhat hypothetical and could be an isotope of sulphur with mass number of 36 that is (16) S (36) , with an oxidation state of -2 can have the required configuration of electrons and neutrons,this isotope constitutes about 0.02 percentage of sulphur present.Cheers, happy chemistrying. ",
            "date": "Updated February 11, 2018",
            "views": "18",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rohan Das",
                    "user_href": "/profile/Rohan-Das-273"
                },
                {
                    "user_id": "Sourabh Kulkarni",
                    "user_href": "/profile/Sourabh-Kulkarni-92"
                },
                {
                    "user_id": "Bhavik Bansal",
                    "user_href": "/profile/Bhavik-Bansal-5"
                },
                {
                    "user_id": "Sariel Ilyanovich",
                    "user_href": "/profile/Sariel-Ilyanovich"
                }
            ]
        },
        {
            "author_info": {
                "name": "M Yazdan",
                "href": "/profile/M-Yazdan"
            },
            "answer_text": "Since the net charge is -2 and there are 18 electrons, that means x -18 = -2 (where x is the total positive charge) Therefore, x=16, thus there are 16 units of positive charge which ultimately means that there are 16 protons. Hence, the atomic number of the element is 16. Moreover, we know that the element with atomic number 16 is Sulphur (S). Also, the charge is -2 which means it is a Sulphide ion (S²-). Conclusion: Element is sulphur but as it is carrying 2 units of negative charge, therefore the ion is Sulphide ion. hope it helps… ",
            "date": "Answered September 16, 2019",
            "views": "185",
            "upvotes": "0"
        }
    ]
}