{
    "title": "Which decade contributed the most to the advancements of technology? - Quora",
    "tags": [
        "History of Technology",
        "Technology Trends"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carmel M Toussaint",
                "href": "/profile/Carmel-M-Toussaint-1"
            },
            "answer_text": "This is a great question. I suggest that the graph of technological development follows an exponential curve which can be seen at the end of chapter one of my recent book Technology and Society - Rewards and Challenges. My review covered the period from the Renaissance to the first decade of the 21st Century. From this perspective, a technological explosion occurred in the preceding century. For instance, consider the social impact of the invention of the transistor and the internet! As time goes on, it is wise to expect a turning point in human affairs (health, transportation, education, work etc) in the current century because of the accelerating development of Cybernetics, Nanotechnology and Artificial Intelligence. ",
            "date": "Answered November 9, 2017",
            "views": "807",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Amit Tayade",
                    "user_href": "/profile/Amit-Tayade-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathan Coppedge",
                "href": "/profile/Nathan-Coppedge"
            },
            "answer_text": "So far, I would predict the 1990’s, and 2nd decade of the 21st Century. 1990’s: pentium computers, improvements in telescopes, nano-manufacturing, economic / stock market boom, advent of personal computer. 2010’s: numerous philosophical heuristics and perpetual motion in my opinion: Programmable Heuristics Perpetual Motion Links by Nathan Coppedge  “Say… you talk about pulling something up an inclined plane with an equal weight. You're right. This is possible. And not at all a violation of conservation of energy.” --Ian Switzer, CEO of a Cornell engineering company ",
            "date": "Answered November 9, 2017",
            "views": "434",
            "upvotes": "0"
        }
    ]
}