{
    "title": "Which group of measurements is the most precise: 3g, 4g, 5; 3.0g, 4.0g, 5.0g; 3.10g, 3.20g, 3.23g; or 3.0g, 4.0g, 5.0g, 6.0g? - Quora",
    "tags": [
        "Physics Measurements",
        "Accuracy",
        "Measurements"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard Muller",
                "href": "/profile/Richard-Muller-3"
            },
            "answer_text": "In experimental science, we use the word “precise” in a special way, and we distinguish it from a special definition of “accurate”. In this specialized use of the language, precision is an indication of the number of significant figures reported. So 3.14 is less precise than 3.14159. In this case, it is also a less accurate estimation of pi. On the other hand, 3.14000000000 is more precise than 3.1416, and yet it is less accurate. In physics publications, it is typically frowned upon to give more decimal places than are warranted by the accuracy of the measurement. Doing so can mislead the reader, or the public. It can give the misimpression that the result is more accurate than it truly is. We see this frequently in reported polls, in which one candidate may be ahead by 2 percentage points; then a footnote states that the accuracy of the polls is estimated to be 3 percentage points. In other words, the leading candidate in the polls might actually be lagging in reality. On the other hand, if you have a lot of numbers to average, then it often makes sense to report a value with more significant figures than are justified by the accuracy. Doing that reduces the danger of “round-off error”. So scientists will typically report one extra digit. One convention commonly used is to put the uncertain digits in parentheses. Thus, if I did an imprecise calculation of pi, I might write pi = 3.141(44). The reader knows to be wary of the last two digits. And yet in this case if you were to include them you would have a result that would be more accurate than the simple 3.141. In general use by non-scientists, there is not such a big difference between “precise” and “accurate”. A newspaper reporter who uses them interchangeably is not wrong; the reporter is simply not adopting the scientist’s convention. If I look at your set of numbers, the third set is the most precise. If I assume (you don’t say this) that they all represent remeasurements of the same weight, then the third set of measurements is the most self-consistent, and therefore may be the most accurate. But that might not be true. It could be that the scale reports more digits, but got stuck, and is not reporting them accurately even though they are consistent with each other. That’s called a systematic error. To see if that is the case requires measurements with calibrated weights, and other measures to reduce the possibility of systematic bias. When my friend Steve Koonin visited the lab of Pons and Fleishman, the scientists in Utah who had reported the discovery of “cold fusion”, he asked them how they calibrated their instruments. They told him that they had not done so. He took that as a strong indication to be suspicious of their work. Indeed, their reported discovery turned out not to be repeatable by other more careful laboratories, and is now generally discredited. ",
            "date": "Answered September 14, 2016",
            "views": "153",
            "upvotes": " View 128 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jay Wacker",
                    "user_href": "/profile/Jay-Wacker"
                },
                {
                    "user_id": "Frederic Rachford",
                    "user_href": "/profile/Frederic-Rachford"
                },
                {
                    "user_id": "Allan Steinhardt",
                    "user_href": "/profile/Allan-Steinhardt"
                },
                {
                    "user_id": "Ed Caruthers",
                    "user_href": "/profile/Ed-Caruthers"
                },
                {
                    "user_id": "Bryan White",
                    "user_href": "/profile/Bryan-White-43"
                },
                {
                    "user_id": "Moin Khan",
                    "user_href": "/profile/Moin-Khan-429"
                },
                {
                    "user_id": "Anupam Nayak",
                    "user_href": "/profile/Anupam-Nayak-12"
                },
                {
                    "user_id": "Trenton Lum",
                    "user_href": "/profile/Trenton-Lum"
                },
                {
                    "user_id": "Zeeshan Khan",
                    "user_href": "/profile/Zeeshan-Khan-62"
                },
                {
                    "user_id": "Giovanni Sartori",
                    "user_href": "/profile/Giovanni-Sartori"
                }
            ]
        },
        {
            "author_info": {
                "name": "Howard Ludwig",
                "href": "/profile/Howard-Ludwig"
            },
            "answer_text": "This question about precision needs to be asked more precisely. There are [at least] two reasonable interpretations, depending on context. The precision of an individual measurement is based roughly on how many significant digits it is expressed to—the more significant digits, the finer the precision. (There are other closely related, but not identical ways of evaluating which has the “best” precision, such as the place value of the least-significant digit shown.) Each value in the first group in the question is expressed to 1 significant digit and to the nearest 1 g; groups 2 and 4 have values with 2 significant digits and to the nearest 0.1 g; group 3 has values with 3 significant digits and measured to the nearest 0.01 g. (Note that 3.0 g and 0.0030 kg are measured to the same level of precision—both with 2 significant digits and both to the nearest 0.0010 kg = 1.0 g.) Thus, in this category of senses, group 3 has the most precise measurements [individually].For a collection of measurements, precision is usually used to indicate how close the measurements are to each other, not how precisely each value is expressed. This is typically assessed via the standard deviation of the values, often in relative comparison to the mean, so one might refer to precision as so many parts per million relative precision, for example. Group 3 has the most tightly packed collection of measurements, so it is the most precise in this sense.With the data sets given in this question, both ways of looking at the precision regarded group 3 as the finest precision. The two methods do not always agree. A disagreement sometimes indicates that the individual data values may not be getting expressed to an appropriate number of significant digits. One rule of thumb is that uncertainty levels (often indicated by an assessment of the standard deviation of the mean of a collection of values) should be expressed to two significant digits and the mean measure should be expressed to the same level of place value. For example, the current “best” value for Planck’s constant is often written as: h = 6.626 070 040(81) × 10⁻³⁴ J · s,which is shorthand notation for: 6.626 070 040 × 10⁻³⁴ J · s ± 0.000 000 081 × 10⁻³⁴ J · s,for which the first line is the best currently determinable value and the second line is the uncertainty as a standard deviation—notice the 2 significant digits in the uncertainty, the least significant of which is in the 10⁻⁴¹ J · s place, so the value determined for h is likewise written to the nearest 10⁻⁴¹ J · s place.This determination of h has a relative uncertainty of 1.2 × 10⁻⁸ and 10 significant digits. ",
            "date": "Answered January 19, 2017",
            "views": "12",
            "upvotes": "0"
        }
    ]
}