{
    "title": "Which career should I choose, computer science or medicine? - Quora",
    "tags": [
        "Jobs and Careers in Computer Science",
        "Jobs and Careers in Computer Programming",
        "Career Choices",
        "Computer Science Education",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Skye J Coleman, PE",
                "href": "/profile/Skye-J-Coleman-PE"
            },
            "answer_text": "Do you want to be forced to work the rest of your life to make money? If so, then medicine is for you. Now don't get me wrong, after you finish your undergrad, medical degree, residency, and licensure you'll make a good amount of money. On average, a doctor makes $195,000 a year[1]. But here's how long it'll take you:  (Source: injectionartistry.com) I don't know about you, but putting 20 years into a professional before making a big payday just isn't worth it. So what if you choose computer science instead? Then you could go and get a bachelor's degree. Or you could take a free coding boot camp online [2] and learn a lot of the same material in a lot less time and for free. Not only that, but now you're not bound to working for someone else for the rest of your life. Many programmers I know have very free lives where they only spend a few hours a week doing work for their clients. They are freelancers who have recurring revenue from their clients to keep websites and apps running. Still others have started their own software companies working directly with established businesses. The world of computers and the internet is endless, do yourself a favor and choose the future. Footnotes[1] http://www.busisnessinsider.com/how-much-salary-does-a-doctor-make-2015-4/[2] 12 Sites That Will Teach You Coding for Free",
            "date": "Answered February 2, 2018",
            "views": "13",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Justin Ng",
                    "user_href": "/profile/Justin-Ng-6"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/TN-87"
                },
                {
                    "user_id": "Gowtham Bc",
                    "user_href": "/profile/Gowtham-Bc"
                }
            ]
        },
        {
            "author_info": {
                "name": "Voja Stankovic",
                "href": "/profile/Voja-Stankovic"
            },
            "answer_text": "I'd suggest you go with CS. It's your dream, and doing something just because there's a lot of money is kinda stupid. We don't need much. You don't need Ferrari's and huge mansions, you need a normal home, plenty of food to eat, water... Everything which almost every job can give you. From what i've seen, you have reasonable english skills, so you could always work for foreign companies. But, a last piece of advice. Give medicine a try, maybe you'll like it. You've alredy been programming for 2 years, but what about medicine. Give it a fair chance and decide. And when you do give it a try, follow your passion. If you then decide on medicine, then follow that. ",
            "date": "Answered May 11, 2015",
            "views": "42",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Joshua Oyewole",
                    "user_href": "/profile/Joshua-Oyewole-4"
                }
            ]
        }
    ]
}