{
    "title": "Which scientists died because of their discovery? - Quora",
    "tags": [
        "Scientific Discoveries",
        "History of Science",
        "Discoveries",
        "Scientists",
        "Invention and Inventions",
        "Scientific Research",
        "Science of Everyday Life",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "P.r. Mahesh Kumar",
                "href": "/profile/P-r-Mahesh-Kumar"
            },
            "answer_text": "Following are the 10 Scientists who died because of accidents/issues related to their discoveries while conducting tests and experiments: Max Valier: Valier was one of the earliest humans to foresee potential in the rockets. In 1930, Valier died at the age of 35 when there was an explosion in his experimental setup.Li Si :Li Si, who served as the Prime Minister of the China’s Qin Dynasty, was killed using the Five Punishments he conceptualized. These five penalties included making tattoos in the face, cutting off the nose, removing kneecap, eliminating reproductive organs, and death sentence by boiling alive or tearing limbs apart.Francis Edgar Stanley: He was another name on the list of inventors who died because of their own inventions. Francis crashed into a woodpile while driving a Stanley Steamer.It was a steam engine-based car developed by Stanley Motor Carriage Company, founded by Francis E. Stanley and his twin Freelan O. Stanley. He was trying to maintain a distance from a farm wagon traveling alongside his car.Jean-François Pilâtre de Rozier: Jean-François Pilâtre de Rozier was a physics and chemistry teacher who lived in France. On June 15, 1785, Rozier was crossing the English Channel along with Pierre Romain in his Rozière balloon which crashed near Wimereux in the Pas-de-Calais. The deaths due to the trajic accident are probably the first known air crash fatalities.Franz Reichelt: Referred as Flying tailor, he jumped off the Eiffel Tower wearing his home-made parachute but destiny had already decided an unfortunate fate for his very first flight. The police authorities had assumed that Franz would use a dummy to demonstrate his custom designed parachute and they gave him the permission. Instead, he took the job himself and become one of the people who’s inventions took their lives.Henry Smolinski: Smolinski took wings of the Cessna 337 aircraft and joined it to a Ford Pinto with an intention to create a flying car. The car known as AVE Mizar was manufactured by Henry’s company Advanced Vehicle Engineers. He, along with his friend Hal Blake, took it for a test flight and died in a crash. Smolinski’s “Pinto Craft” struck the top of a tree and crashed into a pickup truck before bursting into flames.William Bullock: A) The story of William Bullock is enough to give you goosebumps after knowing how his own invention led to his painful demise. William created a rotary printing press machine in which the images to be printed were put on a roller and then could be printed on any substrate.B)A few years later after his invention, his foot got crushed into the new machine during an ongoing installation. Later, William died during the amputation process because his foot had developed gangrene.Horace Lawson Hunley: Hunley was a marine engineer in the Confederate States of America. He was the inventor of the first war submarine. During a routine test, Hunley, along with a 7-member crew, sunk to death in a previously damaged submarine.Marie Curie: The renowned physicist and chemist of Polish origin, Madame Curie had exposure to ionizing radiations for a prolonged time as her experiments involved materials like radium which exhibits radioactive properties. Back then, the harmful effects of the radioactive emissions were not known.Curie was diagnosed with aplastic anemia which was the cause of her death.Karel Soucek: An invention demo turned out to be a fatal death show when Karel Soucek rolled down from the roof of Houston Astrodome in his self-made shock-absorbent barrel. He was to land in a water tank kept 180-feet below, but the barrel hit the rim of the tank causing fatal injuries to him.For more details on the above, please check the link below: 10 Inventors Who Died Because Of Their Own Inventions  ",
            "date": "Answered August 23, 2020",
            "views": "221",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sathish P",
                    "user_href": "/profile/Sathish-P-97"
                },
                {
                    "user_id": "Demetrios E. Lekkas",
                    "user_href": "/profile/Demetrios-E-Lekkas"
                },
                {
                    "user_id": "Thyaga Rajan",
                    "user_href": "/profile/Thyaga-Rajan-2"
                },
                {
                    "user_id": "Philippe Jaran",
                    "user_href": "/profile/Philippe-Jaran"
                },
                {
                    "user_id": "Sai Dileep Vallam Reddy",
                    "user_href": "/profile/Sai-Dileep-Vallam-Reddy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Salami Guadalupa",
                "href": "/profile/Salami-Guadalupa"
            },
            "answer_text": "1.Carl Scheele (1742 — 1786) The genius pharmaceutical chemist who discovered many elements, most famously oxygen as well as molybdenum, tungsten, manganese and chlorine. But this was the days before the OSHA and the knowledge of toxic chemicals were known. He died because of toxic chemicals such as hydrogen cyanide, mercury and other toxic chemicals started to accumulate at the body.  2. Marie Curie The discovery of radioactivity inspired a couple, Marie and pierre to study about radioactivity. Their brilliant research led to the discovery of polonium and radium that release lots of radiation which led to her demise due to continuous exposure of radioactive elements that cause her to get leukemia. She died in 1934.  3. Scientist working at new mexico laboratory called omega site received a lethal dose of plutonium bomb. 8 scientist were working on a plutonium bomb including Louis Slotin and and S.Allan Kline were working on an action that would bring close proximity the 2 halves of a berryllium coated sphere and convert the plutonium into a critical state. The screwdriver that was keeping the 2 halves from touching slipped and release a blue light that is the visible sign of emitting a lethal dose of radiation. Slotin died in 9 days because of radiation poisoning.  4.William Bullock William Bullock invented a better version of the rottary printing press in 1863. In 1867, he accidentally put his leg in the gears and got crushed by the machine. He then get gangrene because of the injuries of the machine. He died soon after.  5.The inventor of the flying car “ford pinto\" Henry Smolinski and Hal Blake invented the AVE Mizar, a flying car with detachable wings. They envisioned a flying car that would act like helicopter and would travel hundreds of miles between airports. The driver can detach the wings after the flight and drive off the airports. They died when the flying car wings detach during mid air flight and they fall down and die.  ",
            "date": "Updated September 10, 2020",
            "views": "328",
            "upvotes": " View 288 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vivek Ghosh",
                    "user_href": "/profile/Vivek-Ghosh-51"
                },
                {
                    "user_id": "Samudra Sekhara",
                    "user_href": "/profile/Samudra-Sekhara"
                },
                {
                    "user_id": "Mina Yannaki",
                    "user_href": "/profile/Mina-Yannaki"
                },
                {
                    "user_id": "Emily Zvirbulis",
                    "user_href": "/profile/Emily-Zvirbulis-1"
                },
                {
                    "user_id": "Alex Mcintosh",
                    "user_href": "/profile/Alex-Mcintosh-68"
                },
                {
                    "user_id": "Tejaswini Gurram",
                    "user_href": "/profile/Tejaswini-Gurram-7"
                },
                {
                    "user_id": "Đăng Huỳnh Lâm Hải",
                    "user_href": "/profile/Đăng-Huỳnh-Lâm-Hải"
                },
                {
                    "user_id": "Amy Jo Buchanan",
                    "user_href": "/profile/Amy-Jo-Buchanan-4"
                },
                {
                    "user_id": "Russell Tuttle",
                    "user_href": "/profile/Russell-Tuttle-1"
                },
                {
                    "user_id": "Ivan Peter Larombe",
                    "user_href": "/profile/Ivan-Peter-Larombe"
                }
            ]
        }
    ]
}