{
    "title": "Which among the three social science disciplines is more relevant in your life? Why? - Quora",
    "tags": [
        "Disciplines",
        "Relevance",
        "Discipline",
        "Social Sciences",
        "Sociology",
        "Science",
        "Philosophy of Everyday Life",
        "Education",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard Quenneville",
                "href": "/profile/Richard-Quenneville"
            },
            "answer_text": "Britannica names five: “The social sciences include cultural (or social) anthropology, sociology, social psychology, political science, and economics.” social science | History, Disciplines, & Facts After careful examination, I can’t see any of them as important to me. However, a person studying would find that a study of myself and friends might prove interesting for the study of Sociology or Social Psychology, since I am a member of a small group that is neither fanatiocal nor peculiar in their beliefs or practices; and that group is Traditional Catholics, meaning those who do not incorporate the post Vatican Council II beliefs or practices common among so many Catholics today. A few of the things they will not change are the Latin Mass; the Catechism; the 1968 Sanctoral Calendar; modest dress for men and women; and the like. While the Society of St. Pius X, [SSPX], has suffered from some homosexuality, it has been far below in numbers what is common in mainstream Catholic Seminaries, and as soon as discovered, they must leave. The basic idea followed is that: “If it was true before, it’s still true.” Obviously this idea is only in regards Catholic doctrine, not customs that can change. ",
            "date": "Answered June 23, 2020",
            "views": "137",
            "upvotes": " Answer requested by Roksana Parvin Yasmin"
        },
        {
            "author_info": {
                "name": "Masayo Hanyuda",
                "href": "/profile/Masayo-Hanyuda"
            },
            "answer_text": "Be selective of your friendsMaintain honesty with self and othersBe kind to everyone regardless of like or dislike the personThese are the basic rules with my social disciplines. ",
            "date": "Answered October 9, 2019",
            "views": "56",
            "upvotes": " Answer requested by Nobleza Angel"
        }
    ]
}