{
    "title": "Which is the process in which the energy released per unit mass is more, nuclear fission or fusion? - Quora",
    "tags": [
        "Nuclear Fission",
        "Nuclear Fusion",
        "Nuclear Physics",
        "Nuclear Energy",
        "Energy (physics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Roger Linnemann",
                "href": "/profile/Roger-Linnemann-1"
            },
            "answer_text": "Fusion. The fusion of two atoms into one atom releases much more energy per unit than fission , the splitting of one large atom into two smaller atoms. Compare the hydrogen bomb, fusion, to the smaller energy atomic bomb, fission dropped on Hiroshima and Nagasacki. The Hydrogen bomb has never been dropped in anger. The largest Hydrogen bomb tested was a Russian 50 megaton bomb. Compare that to Hiroshima/Nagasacki-- 20 kilotons. Our largest active hydrogen bombs are about 1 megaton. The blast energy from this large a hydrogen bomb will destroy things and kill about 95% of the population out to a radius of 1 to 2 miles. With resulting thermal and ionizing radiation damage -fallout- many thousands of people will die out to tens and even hundreds of miles in next few weeks and months. The exact number of anything or people destroyed can vary considerably depending upon the characteristics of the bomb, the height of explosion and the characteristics of the terrain below. ",
            "date": "Answered October 26, 2017",
            "views": "200",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Virgil Fenn",
                "href": "/profile/Virgil-Fenn"
            },
            "answer_text": "Fusion, of course. The energy released is the binding energy and is in the same ballpark for fission and fusion on a per event basis. The large mass of the fissionable fuel relative the the mass of the fusion fuel on a per event basis makes the energy released on a per mass basis look much better for fusion. But, I have to ask “So, what?” The weight of the fuel is only important if the reactor is on a flying platform or must be lifted to Earth orbit or higher. On land, the weight of the fuel is insignificant. Please note that the objection to burning coal for energy is objectionable because of the release of CO2 and air pollution, NOT because a daily 100 railroad car full of coal is heavy. The weight of the entire fusion or fission power plant will keep both confined to the surface of Earth. I advocate for fission nuclear power rather than for fusion is simply because I think the need for clean energy is urgent - so urgent that we should be building fission nuclear power plants of existing and proven designs as fast as possible even while even better designs are being developed and built. Existing fission nuclear power technology is already a better source of clean energy that everything else and still has more potential for expansion with very little environmental impact. The objections to fission nuclear power are all political and/or educational, not technical. ",
            "date": "Answered October 26, 2017",
            "views": "241",
            "upvotes": "0"
        }
    ]
}