{
    "title": "Which plant produces the most photosynthesis? - Quora",
    "tags": [
        "Photosynthesis",
        "Crops",
        "Agriculture",
        "Science of Everyday Life",
        "Plants"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Hall",
                "href": "/profile/Chris-Hall-201"
            },
            "answer_text": "The short answer is we don't know. Maybe a few hundred photosynthetic species have been measured for maximum photosynthetic rates, and I'd only consider a few dozen of those species to really be thoroughly examined. There is a trend, however. Desert plants that must live their entire lives (sprout from seed, grow, flower, and then make new seeds) on the water from a single rain event have faster rates of photosynthesis because they have to grow very quickly and don't live very long. Crops plants (the plants we eat) actually tend to be a little worse at photosynthesis (so far, we've increased yield only by selecting for smaller plants with bigger fruit). The fastest known rates of photosynthesis occur in microalgae, which makes a lot of sense because many species of algae are barely more than giant chloroplasts with flagella (e.g. Chlamydomonas reinhardtii). ",
            "date": "Answered April 19, 2016",
            "views": "74",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anamol Pokharel",
                    "user_href": "/profile/Anamol-Pokharel-1"
                },
                {
                    "user_id": "Pankaj Kaushik",
                    "user_href": "/profile/Pankaj-Kaushik-72"
                },
                {
                    "user_id": "Reghu Raman",
                    "user_href": "/profile/Reghu-Raman"
                },
                {
                    "user_id": "Sastha DS",
                    "user_href": "/profile/Sastha-DS"
                },
                {
                    "user_id": "Akash Amat",
                    "user_href": "/profile/Akash-Amat"
                },
                {
                    "user_id": "William Halmeck",
                    "user_href": "/profile/William-Halmeck"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ray Austin",
                "href": "/profile/Ray-Austin-2"
            },
            "answer_text": "Photosynthesis is a chemical process that occurs in many forms of bacteria and virtually all plants, including aquatic plants and algae. Using just three simple ingredients (carbon dioxide, water, and sunlight) plants and bacteria are able to make their own food. Early forms of algae and bacteria were the first organisms to photosynthesize. Scientists estimate that it takes approximately 2,000 years of photosynthetic activity to \"turn over\" or replenish all the oxygen in the earth's biosphere. Plants, including aquatic plants, produce oxygen, and they also use oxygen. \"Sun plants\" experience an increased rate of photosynthesis as light intensity increases. Leaves on a \"sun plant\" tend to be smaller and thicker, with more pronounced lobes than shade plant leaves. Special cells in these leaves allow higher rates of photosynthesis. ",
            "date": "Answered April 13, 2016",
            "views": "48",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kyle Ingram",
                    "user_href": "/profile/Kyle-Ingram-13"
                },
                {
                    "user_id": "Sastha DS",
                    "user_href": "/profile/Sastha-DS"
                }
            ]
        }
    ]
}