{
    "title": "Which mathematicians have best explained math topics in plain language? - Quora",
    "tags": [
        "Plain Language",
        "Teaching Mathematics",
        "Mathematicians",
        "Applied Mathematics",
        "Layman's Explanations",
        "Mathematics and Physics",
        "Mathematics Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rajratna Adsul",
                "href": "/profile/Rajratna-Adsul"
            },
            "answer_text": "Mathematicians generally do not explain math topics in plain language. There is a series of short books, “ A very short introduction to…….” Fields Medalist Gowers has written a short book in this series : “A very short introduction to mathematics.” It's a lucid introduction. Terence Tao is exceptional in his ability to explain complex topics in mathematics in understandable way, and he has done this job excellently in the book Princeton Companion to Mathematics. He is the chief contributor to many terms in mathematics and he has explained some advanced concepts lucidly. Ian Stewart is another mathematician who writes incredibly well. His book “ Concepts of Modern Mathematics” is a must addition to mathematics books.  👆This book treats topics from congruences in number theory upto concepts like Hecke operators on space of modular forms. The authors have written with exceptional clarity and simplicity. Their other books Elliptic Tales and Fearless Symmetry introduce elliptic curves, modular forms, L- functions, Galois representation and Birch-Swinnerton Dyer conjecture. These books are the popular books on these concepts and yet they have actually managed to construct Galois representations in some simple cases! Galois representations are the building blocks in the proof of FLT by Wiles. A feast for number theorists. 👍😃 ",
            "date": "Answered July 3, 2020",
            "views": "97",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joseph A Jansen Jr",
                    "user_href": "/profile/Joseph-A-Jansen-Jr"
                },
                {
                    "user_id": "Alethea Alexandria",
                    "user_href": "/profile/Alethea-Alexandria"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Manning",
                "href": "/profile/Chris-Manning-37"
            },
            "answer_text": "An Australian mathematics teacher called Eddie Woo is very good at doing this. He has also written a number of books. Eddie Woo Eddie Woo - Wikipedia ",
            "date": "Answered July 5, 2020",
            "views": "48",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alan Bustany",
                    "user_href": "/profile/Alan-Bustany"
                }
            ]
        }
    ]
}