{
    "title": "Which great scientist was repeatedly rejected by his colleges? - Quora",
    "tags": [
        "History of Science",
        "Rejection",
        "Academia",
        "Scientists",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Benzion Inditsky",
                "href": "/profile/Benzion-Inditsky"
            },
            "answer_text": "Let me remind that there were less lucky male chemical scientists who were not elected to THE RUSSIAN ACADEMY of SCIENCE D. Mendeleev 1880 rejected by an appointing commission. Outside Russia he was MEMBER OF 150 ACADEMIES AND SOCIETIES: FOR.MEM.R.S ., PARIS, BOLOGNA , ACCADEMIA DEI LINCEI , ROME , ETC BROAD SPECTRUM OF INTERESTS AND PUBLICATIONS (25 volumes). In 1890, he resigned his professorship at St. Petersburg University following a dispute with officials at the Ministry of Education over the treatment of university students. In 1892 he was appointed director of Russia's Central Bureau of Weights and Measures, and led the way to standardize fundamental prototypes and measurement procedures. He set up an inspection system, and introduced the metric system to Russia.  He was also rejected by Nobel Committee In 1905, Mendeleev was elected a member of the Royal Swedish Academy of Sciences. The following year the Nobel Committee for Chemistry recommended to the Swedish Academy to award the Nobel Prize in Chemistry for 1906 to Mendeleev for his discovery of the periodic system. The Chemistry Section of the Swedish Academy supported this recommendation. The Academy was then supposed to approve the Committee's choice, as it has done in almost every case. Unexpectedly, at the full meeting of the Academy, a dissenting member of the Nobel Committee, Peter Klason, proposed the candidacy of Henri Moissan whom he favored. Svante Arrhenius, although not a member of the Nobel Committee for Chemistry, had a great deal of influence in the Academy and also pressed for the rejection of Mendeleev, arguing that the periodic system was too old to acknowledge its discovery in 1906.  Mendeleev, Alfred Werner, Adolf von Baeyer and other prominent chemists According to the contemporaries, Arrhenius was motivated by the grudge he held against Mendeleev for his critique of Arrhenius's dissociation theory. After heated arguments, the majority of the Academy chose Moissan by a margin of one vote. The attempts to nominate Mendeleev in 1907 were again frustrated by the absolute opposition of Arrhenius. In 1907, Mendeleev died at the age of 72 in Saint Petersburg from influenza. His last words were to his physician: \"Doctor, you have science, I have faith,\" which is possibly a Jules Verne quote. ",
            "date": "Answered October 11, 2020",
            "views": "26",
            "upvotes": " View 30 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Giota Detsi",
                    "user_href": "/profile/Giota-Detsi"
                },
                {
                    "user_id": "Alexei Sinitsa",
                    "user_href": "/profile/Alexei-Sinitsa-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Luc-Luc-18"
                },
                {
                    "user_id": "Ömer Arda Kaya",
                    "user_href": "/profile/Ömer-Arda-Kaya"
                },
                {
                    "user_id": "Paul Llido",
                    "user_href": "/profile/Paul-Llido"
                },
                {
                    "user_id": "Jose Rodriguez",
                    "user_href": "/profile/Jose-Rodriguez-183"
                },
                {
                    "user_id": "Jerome Sadudaquil",
                    "user_href": "/profile/Jerome-Sadudaquil"
                },
                {
                    "user_id": "Mordi Avigdor",
                    "user_href": "/profile/Mordi-Avigdor"
                },
                {
                    "user_id": "Galih Priambodo",
                    "user_href": "/profile/Galih-Priambodo-2"
                },
                {
                    "user_id": "Michael Chen",
                    "user_href": "/profile/Michael-Chen-909"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aj.Raymond James Ritchie",
                "href": "/profile/Aj-Raymond-James-Ritchie"
            },
            "answer_text": "Peter MITCHELL (Nobel Prize, Chemiosmotic Theory of ATP synthesis) was consistently treated badly. He resorted to settling up his own laboratory in a farmhouse in Cornwall and publishing his work privately as a little soft-cover book. My PhD supervisor had a copy. Nicolo TESLA was not treated well either. He died in poverty. ",
            "date": "Answered October 11, 2020",
            "views": "197",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ben Wyrwoll",
                    "user_href": "/profile/Ben-Wyrwoll"
                },
                {
                    "user_id": "Giota Detsi",
                    "user_href": "/profile/Giota-Detsi"
                },
                {
                    "user_id": "Heinrich Weipert",
                    "user_href": "/profile/Heinrich-Weipert"
                },
                {
                    "user_id": "Crystal de Parker",
                    "user_href": "/profile/Crystal-de-Parker"
                },
                {
                    "user_id": "Kelly Gass",
                    "user_href": "/profile/Kelly-Gass"
                }
            ]
        }
    ]
}