{
    "title": "Which school has a better science school, Oxford or Cambridge? - Quora",
    "tags": [
        "University of Cambridge",
        "University of Oxford"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Schramm",
                "href": "/profile/David-Schramm-1"
            },
            "answer_text": "As a student who recently applied for a natural science programme at Oxbridge, I was tasked with deciding which school I wanted to apply to. It is very difficult to say whether Oxford or Cambridge is a better science school, and I believe that there isn’t a wrong decision when it comes to these schools. Let’s start with some of their similarities and differences. As with most UK schools, Oxford and Cambridge provide 3-year Bachelor degrees and 4-year Master’s degrees available to its students. There is little choice in your courses outside of what you are studying, and you are fixed into the science stream from the beginning of your time at the universities. This is unlike most US schools, which give you freedom to choose courses outside of your subject area. Both schools feature tutorial-based teaching and have a long history of innovation and discovery in the natural science world. Both schools are world class universities that provide an extremely high level of education. The science programme at Cambridge is more generalized. At Cambridge, all natural science students will apply to Cambridge’s natural science programme, and will have the option to choose their science courses throughout their time at Cambridge. This allows students to design their degree a bit more than Oxford’s science programmes. Instead of one single programme, Oxford has many different programmes for various science disciplines. These include biological sciences, biochemistry, biomedical sciences, archaeology/anthropology, geology, materials science, chemistry, physics (and physics/philosophy), and psychology. These courses are focused in their respective fields, and provide a more directed experience in the sciences. Here are a couple other differences about the universities as a whole. While Cambridge has a higher number of publications, Oxford has a higher faculty-to-student ratio. Oxford examinations are usually sat near the end of the course, while Cambridge examinations happen annually. Cambridge offers are typically higher at A*A*A (at the A-Levels) while Oxford will typically require A*AA. This is not to say that Oxford is easier to get into, it is simply that the conditions that need to be met at the end of the year are slightly lower (students likely have similar grades of either A*A*A* or A*A*A if they are offered a place at one of these universities). It is difficult to compare the quality of the science educations at both universities, because it can fluctuate depending on one’s professor/tutor and one’s course. Generally, Cambridge is known to be stronger in just about all of the natural science disciplines. However, Oxford’s medical programme is known to be stronger than Cambridge’s, which can make any medicine related studies better at Oxford. It’s best to remember that, when looking at the rankings of these universities in their subject areas, it is like splitting hairs. In subjects like the social sciences, Oxford offers a higher level of education. In engineering, Cambridge has a clear advantage over Oxford. However, with the natural sciences, it is very similar between these two schools. What it came down to for me when I was deciding was the application process. Cambridge required that natural sciences students write their new standardized test, while Oxford biochemistry did not requires any additional testing. The interview for Oxford’s courses would also be more focused on a subject area I was confident in. I also had no idea whether Cambridge would test me on a subject that I am completely clueless in, like astrophysics. I did not want to go through the process of being tested on material I was unsure of, and I did not want to jeopardize my one chance at Oxbridge with a standardized test that I had little practice with (Note: for US standardized tests such as the SAT and ACT, there is a thorough amount of preparation that is required before students sit the exam—I found myself largely unprepared for Cambridge’s exam). As an IB student who took French as one of my HLs, it would also be a part of my conditions for Cambridge. Oxford’s conditions of 766 only applied to my relevant courses, which I am strongest in (Biology HL, Chemistry HL, and Math SL). As a result, I chose Oxford and decided to apply for Biochemistry. The interview was focused on material I was familiar with and I was somehow offered a place! TLDR: You can’t pick a wrong school when it comes to Cambridge or Oxford for the natural sciences. If you want a course that has a slightly higher reputation and more freedom to make your own degree, go with Cambridge. If you want your course to be more focused and directed, so that you’re immediately studying in your subject of specialty, I would opt for Oxford. ",
            "date": "Answered June 22, 2017",
            "views": "521",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kiseki Hirakawa",
                    "user_href": "/profile/平川-奇跡-Kiseki-Hirakawa"
                },
                {
                    "user_id": "Isaac Hadfield",
                    "user_href": "/profile/Isaac-Hadfield"
                },
                {
                    "user_id": "Josh Tall",
                    "user_href": "/profile/Josh-Tall-1"
                }
            ]
        }
    ]
}