{
    "title": "Which region is associated with the phenomenon called the inversion of temperature? - Quora",
    "tags": [
        "Temperature Inversion",
        "Temperature"
    ],
    "response": [
        {
            "author_info": {
                "name": "Santiago M. Ferreiro",
                "href": "/profile/Santiago-M-Ferreiro"
            },
            "answer_text": "Temperature inversion is condition in which the temperature of the atmosphere increases with altitude in contrast to the normal decrease with altitude. When temperature inversion occurs, cold air underlies warmer air at higher altitudes.  INVERSION OF TEMPERATURE [1] Normally, temperature decreases with increase in elevation. It is called normal lapse rate. At times, the situations is reversed and the normal lapse rate is inverted. It is called Inversion of temperature. Inversion is usually of short duration but quite common nonetheless. A long winter night with clear skies and still air is ideal situation for inversion. The heat of the day is radiated off during the night, and by early morning hours, the earth is cooler than the air above. Over polar areas, temperature inversion is normal throughout the year. Surface inversion promotes stability in the lower layers of the atmosphere. Smoke and dust particles get collected beneath the inversion layer and spread horizontally to fill the lower strata of the atmosphere. Dense fogs in mornings are common occurrences especially during winter season. This inversion commonly lasts for few hours until the sun comes up and beings to warm the earth. The inversion takes place in hills and mountains due to air drainage. Cold air at the hills and mountains, produced during night, flows under the influence of gravity. Being heavy and dense, the cold air acts almost like water and moves down the slope to pile up deeply in pockets and valley bottoms with warm air above. This is called air drainage. It protects plants from frost damages. (From Geographymaterials.blogspot.com) Footnotes[1] INVERSION OF TEMPERATURE",
            "date": "Answered September 5, 2018",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "G. Sowjanya",
                    "user_href": "/profile/G-Sowjanya-3"
                }
            ]
        }
    ]
}