{
    "title": "Which is the best mathematics course in the world? - Quora",
    "tags": [
        "Mathematics Education",
        "Educational Courses"
    ],
    "response": [
        {
            "author_info": {
                "name": "Doug Garnett",
                "href": "/profile/Doug-Garnett"
            },
            "answer_text": "I had always been good at math. And suffered through the incredibly dull detail of introduction to differential calculus. But I fell in love with math when we shifted to integral calculus. Nothing in high school math prepares students for the gorgeous ability of math to involve abstract thinking and high concepts. Mostly, leading up to that point, it had been a type of drudgery - do the work but don’t enjoy it. Beyond that, loved, also, my next course — a proof’s course where we learned the process of mathematically proving things. It was not taught directly but by each student working through a set of 90 proofs about real numbers. This course kept going my fascination with the ideas and challenge of abstract math. (Key was the professor who taught the class.) Finally, my graduate degree was all finite elements. Incredibly detailed workings on proofs of error and convergence of estimation techniques - but very effective training from a brilliant numerical analyst. What I’ve found, though, is that all students are different. Those are the ones I’d say were my “best”. ",
            "date": "Answered June 22, 2016",
            "views": "24",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aman Karunakaran",
                    "user_href": "/profile/Aman-Karunakaran"
                },
                {
                    "user_id": "Murali Krishna Kesapragada",
                    "user_href": "/profile/Murali-Krishna-Kesapragada"
                },
                {
                    "user_id": "Sergey Monin",
                    "user_href": "/profile/Sergey-Monin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rajiv Kumar",
                "href": "/profile/Rajiv-Kumar-1491"
            },
            "answer_text": "If you are deeply interested and wish to build your career in mathematics, it is possible to have a good satisfying career ahead. Math is one of the few subjects, wherein the higher you go in your studies, the more reasoning and logic is required. Hence, it is important that students have the following skills to begin with while starting their career in Mathematics. Good skills at solving mathematical problemsLogical reasoning, andPrecise thinking Careers one can choose in Mathematics In India mostly students take up teaching as a career after their graduation or post graduation in math. However there are many other career options which you can choose to with mathematics. Apart from teaching, the following organisation/departments are open for students to have a great career in mathematics Opportunities in government organisations ISRO (The Indian Space Research Organisation)DRDO (Defence Research and Development Organisation)NAL (National Aeronautics Limited)These organisations need mathematicians to solve sophisticated mathematical problems related to their respective research areas of space, defense and aeronautics. Opportunities in Private Industries IT companies are another good option, where they need mathematicians to work in their research department. With every little thing having a computerised chip inside, the complexities involved in calculations and design of these things need expert mathematicians at its core.Banks and Insurance companies needs mathematicians who combines maths and stats to come up with various financial models / products (eg., loans, investments etc.,). Only a skilled mathematician is able to calculate and reason to design such complex and critical financial models.Biotechnology companies needs students with strong academic background in biology and mathematics for their researchOpportunities in the field of TeachingTeaching is always a good option as the salary package offered are decent from the entry level to lecturers and professors. With the number of institutions coming up every day we have lack of supply to the surging demand of lecturers/professors. Hence, teaching as a career has always been in demand and we have vacant jobs for specialists in institutions more than the number of students passing out every year. The following institutions offers great job/ career opportunities to students with good academic background in mathematics DST – Department of Science and TechnologyIITs – Indian Institute of TechnologyIISc – Indian Institute of ScienceAcademic Courses The academic courses a student need to take up for a career in mathematics are:- After 12th Courses in MathematicsB. Sc Regular (Math)B. Sc (Hons) courseB. Sc (Actuarial Science) After Graduation Courses in Mathematics M. Sc Integrated CoursesA student, after 12th, can also opt for a integrated courses: 4-year B.S. and 1 year M.S programIISc is currently having a 4 year B.S (Bachelor’s in Science) and 1 year M.S. (Master’s in Science) programme for study in Mathematics] 5-year Integrated M. Sc programThe following institutions are currently having this 5-year integrated program:- IITsIISERsNISERLovely Professional UniversityCentral University-HyderabadCentral University-PondicherryPost Graduation Courses- M.Phil and PhD With more students taking up teaching as a career, there is also cut-throat competition. To have an upper-hand and to get in to the best Institution it is important that student pursue higher studies in research. The following institutes offers higher learning in research areas for Mathematics TIFR – Tata Institute of Fundamental ResearchIMSc – Institute of Mathematical Sciences (IMSc)HRI – Harish Chandra Research InstituteIndian Statistical InstituteIITsIIScIISERs – Indian Institutes of Science Education and ResearchNISER – National Institute of Science Education and ResearchCMI – Chennai Mathematical InstituteISRO – It has its institution for research studies at ThiruvananthapuramUniversities – All State and Central UniversitiesSpecializations – A few specialization that you can opt for in Mathematics in higher studies AlgebraGeometryBiomathematicsComplex DynamicsCombinatoricsMathematical LogicDifferential EquationsFluid MechanicsComputational Fluid DynamicsImage Processing and Probability and Statistics",
            "date": "Answered April 28, 2018",
            "views": "426",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jax Ryker",
                    "user_href": "/profile/Jax-Ryker"
                }
            ]
        }
    ]
}