{
    "title": "Who created the Big Bang if there is an end to the universe? - Quora",
    "tags": [
        "The Big Bang",
        "Big Bang Cosmology",
        "The Universe"
    ],
    "response": [
        {
            "author_info": {
                "name": "Erik Lovin",
                "href": "/profile/Erik-Lovin"
            },
            "answer_text": "Who created the big bang? If we don’t address the question where did the universe come from we are building science on sand without a foundation. If there was a creation or birth there will be an end. The Universe Before the Big Bang The Big Bang wasn’t the Start of the Universe The Big Bang is our best model of the beginning of our universe. However, to be accurate we should mention the Source of the Big Bang happened before the big bang. Truth be told an explosion didn’t start the universe. It was a push of energy from a non physical dimension into absolute space to create a physical dimension. A lot of physics and quantum fluctuations happened in 10^ -21 seconds before the “Big Bang”. So, let’s dig in and go over the details. But before we start I want to say this information is a new way of thinking about the big bang. This theory makes sense and answers all the questions you might have about the big bang. It’s not spewing out the same old stuff in different words.  The Big Bang wasn’t an explosion. It was a big implosion of energy and the beginning of the Universe, first into the 6th dimension. Quickly the implosion goes past the 5th and 4th dimensions. The implosion stops in the dense 3rd dimension where our time begins. We are currently in the 4th dimension as the universe expands back to the 6th dimension where a Big explosion of matter and antimatter ends the Universe. The Phase Transition Non physical energy pushed past the phase boundary separating the non physical from the physical. This movement of energy came from the 7th dimension into absolute space creating the 6th dimension. Immediately energy begins to decrease as it changes from high frequency non physical radiation into lower frequencies.  The diagram shows how the energy moves into matter and antimatter dimensions until they annihilate in the 6th dimension ending the universe. Matter and Antimatter Funnel The resulting implosion of energies into the 6th dimension separates energy into matter and antimatter types. Matter is pushed into the 5th dimension and the antimatter into the 5th antimatter dimension. Imagine energies going down a funnel into a smaller more dense space. During this separation the energy gets entangled. Entanglement is “spooky action at a distance”. The energies are connected to each other for any distance and for any length of time in the future. Implosion into 4th dimensions As the energy cools it passes another phase transition into the twin 4th dimensions. During this implosion the energies are more evenly mixed to create a homogeneous state. Note, that the popular opinion is that the big bang was an explosion. Explosions go outwards from the source while implosions go inwards from the source. During the implosion the energy gets more dense, smaller in size and lower in frequency. All of these energy fluctuations happened before the so called Big Bang. So the Big Bang wasn’t the beginning of time or the beginning of the universe. Deflation to the 3rd Dimension In a fraction of a second the energy arrives into the lowest frequency and most dense dimension. The implosion enters from all directions so there isn’t any pinhole center that created the 3rd dimension. There was no singularity or separate inflationary reaction. The universe became the size of the observable universe by deflation from all sides of the 7th dimension sphere towards the 3rd dimension. It explains how it happened so fast and why there isn’t a center spot or singularity in the universe that was the entrance point of energy. Building the 3rd Dimension Theory says that the temperature was billions of degrees in the beginning. Various times and temperatures have been extrapolated by doing the math backwards in time. Because the universe is currently expanding, the backwards math and assumption is that in the beginning the universe must have been infinitesimally small. Not so... My new theory suggests the big bang was a big implosion into our small 3rd dimension. After about 300 million years later the 3rd dimension started to expand slowly. Energy of Light - Let There be Light Enter the 3rd dimension as a big ball of Photon radiation. This ball of energy came in at the speed of light creating a dimension smaller and more dense than the 4th dimension. The only reaction was a movement of energy during a phase transition and a cooling down into the lowest dimension of physical matter. The first matter appeared when light created electrons. Next an energy soup of quarks and gluons were formed during a plasma era of matter. Imagine light created matter, which has been demonstrated in the LHC collider in CERN. During this plasma era the universe was opaque to light. After all the original light radiation was captured and converted into matter the universe went transparent to light. The Cosmic Microwave Background radiation (CMB) is a snapshot of the remnants of the energy. After about 380,000 years the CMB is the first real information we have of the universe. The Creation of Gravity and Light The next era is called the Dark Era of the universe. All the initial light radiation was used up. Quarks and gluons form and capture electrons creating stable atoms of hydrogen and helium. Time began for us when light entered the 3rd dimension (our observable universe). Because the speed of light is invariant therefore, time is invariant. (unchanging). Gravity appeared when quarks and gluons formed. The gravitational constant (G) is invariant like time. Gravity starts when gluons attract more gluons. Gravity is an attractive force and massive amounts of gluons attracted large clouds of gas. Then the power of gravity created a nuclear fusion reaction and a star was born. The universe gets new light and evolution of matter continues. Cosmology suggests that the first stars appeared about 300 million years later and galaxies formed in one billion years. However, they suggest that dark matter was present and black holes formed in the early universe. This is exactly what my theory is based on. The Inflationary Universe Consider that the inflationary theory is wrong if the big bang was an implosion instead of an explosion. There was no singularity the size of a pinhole that created the big bang. Since we know that the universe is expanding what is causing the inflationary reaction of the visible universe? Cosmologists have already answered that question. They suggest that dark matter is causing the expansion due to the strong gravity in black holes. My theory has a similar answer to the expanding universe. In the early universe black holes formed before or during the first galaxy. The early stars were giant sizes that created many black holes. The side effect of stars going supernova is that the outer crust of stars is blown away into space during a black hole creation. Some of that material can create other stars but much of it gets attracted into black holes.  Black Holes move matter into higher frequency dimensions. The universe expands into the other dimensions moving to the 6th and final physical dimension. Matter and antimatter collide and annihilate the universe sending all the energy back to the source. Black Holes expand the Universe The early phase of black holes attracted matter away from our 3rd dimension. Matter that enters black holes cannot come back out so where does it go? Imagine that black holes are a Phase Transition machine. Matter that is attracted into the strong gravity field of black holes undergoes a phase change into high frequency matter. That matter is unstable inside a black hole and is ejected into a higher frequency space/dimension. Think of the process like a portal into another dimension that we can’t see. This answers the question where does the matter go when it enters a black hole. When matter leaves our dimension into another dimension we call it dark matter. That’s why we can’t find any of it in our dimension. Our 3rd dimension only has about 4% of the total matter that should be in the universe. The rest of the matter is in the 4th/5th dimension. Also it explains why our visible universe is accelerating its expansion. We have a very small amount of matter in our dimension so we are being pulled towards more massive dimensions. The Current Universe What we see is that far away galaxies are speeding away from us faster than near galaxies. The current theory is that the dark matter is causing the universe to push matter away like an expanding balloon. My theory is that dark matter is pulling our observable universe outward towards the 4th and 5th dimensions. I’m going to make another post about this theory and the shape of the universe. So stay tuned… Key Takeaways The Big Bang wasn’t the start of time or of our universe.The Big Bang was an implosion into the 6th dimensionThe implosion created the homogeneous universeMatter and antimatter separate into parallel universes and get entangledLight energy created matter and electronsStars evolve into black holesBlack holes collect matter which becomes Dark matterThe accelerating universe is caused by Black Holes and GravityIf you resonate with this new information I want you to be on my tribe of followers. I would like to encourage your dreams and confirm your thoughts that science of light will show us the Ultimate Truth. I care about you and hope you will join this journey into understanding science and light. Your influence is greater than you can imagine! Join my list of subscribers and get my latest post in your email. Thanks for being here. As always, be well. https://lovinthings.c ",
            "date": "Answered May 14, 2019",
            "views": "132",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jagan Pal",
                "href": "/profile/Jagan-Pal-3"
            },
            "answer_text": "In 1927, the Belgian Catholic priest Georges Lemaltre proposed an expanding model for the universe to explain the observed redshifts of spiral nebulae. The universal origin story known as the Big Bang postulates that, 13.7 billion years ago, our universe emerged from a singularity — a point of infinite density and gravity — and that before this event, space and time did not exist (which means the Big Bang took place at no place and no time). The geometry of the universe is, at least on a very large scale, elliptic. In a closed universe, gravity eventually stops the expansion of the universe, after which it starts to contract until all matter in the universe collapses to a point, a final singularity termed the \"Big Crunch\", the opposite of the Big Bang. ",
            "date": "Answered May 14, 2019",
            "views": "43",
            "upvotes": " View Sharers"
        }
    ]
}