{
    "title": "Who is the founder of scientific management? - Quora",
    "tags": [
        "Scientific Management"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Franz-Lien",
                "href": "/profile/Jeff-Franz-Lien"
            },
            "answer_text": "A2A. The founder of Scientific Management? That would be Frederick Taylor. Initially, Taylor called it “process management” and “shop management” until the term “scientific management” was coined and became the norm. It was also called Taylorism after its founder. Essentially, the practice involves analyzing process workflows to see where efficiency gains can be made. The results were impressive and the discipline caught on throughout the United States in the early 20th century. If you want learn more about Scientific Management’s methods, Frank and Lilian Gilbreth’s book, Cheaper by the Dozen is a highly-entertaining read. The Gilbreth’s were also pioneers in the field, and made their own unique contributions. The book, written by two of their children, is a biography of the Gilbreths and their twelve kids, with frequent and hilarious cross-over between work and family life.  References: The Economist: Scientific management Scientific management - Wikipedia ",
            "date": "Answered December 5, 2017",
            "views": "896",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Karen Marie Shelton",
                    "user_href": "/profile/Karen-Marie-Shelton"
                },
                {
                    "user_id": "Xin. Wang",
                    "user_href": "/profile/Xin-Wang-269"
                },
                {
                    "user_id": "Sarvesh Chakraborty",
                    "user_href": "/profile/Sarvesh-Chakraborty-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Braudis",
                "href": "/profile/Brian-Braudis"
            },
            "answer_text": "It was Frederick Taylor he is so entrenched with scientific management that the study is often referred to as Taylorism. Brian Braudis, Increase Your Impact ",
            "date": "Answered December 3, 2017",
            "views": "132",
            "upvotes": " Answer requested by Naznin Sultana"
        }
    ]
}