{
    "title": "Who denied Jesus in the Bible? - Quora",
    "tags": [
        "Jesus",
        "The Bible",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Omar Salah",
                "href": "/profile/Omar-Salah-101"
            },
            "answer_text": "Well, it seems complex but it's not. Everyone denies Jesus except the Muslims. Quran 19:88–93:- وَقَالُواْ ٱتَّخَذَ ٱلرَّحۡمَٰنُ وَلَدٗا The disbelievers say, ‘The Lord of Mercy has offspring.’ لَّقَدۡ جِئۡتُمۡ شَيۡـًٔا إِدّٗا How terrible is this thing you assert: تَكَادُ ٱلسَّمَٰوَٰتُ يَتَفَطَّرۡنَ مِنۡهُ وَتَنشَقُّ ٱلۡأَرۡضُ وَتَخِرُّ ٱلۡجِبَالُ هَدًّا it almost causes the heavens to be torn apart, the earth to split asunder, the mountains to crumble to pieces, أَن دَعَوۡاْ لِلرَّحۡمَٰنِ وَلَدٗا that they attribute offspring to the Lord of Mercy. وَمَا يَنۢبَغِي لِلرَّحۡمَٰنِ أَن يَتَّخِذَ وَلَدًا It does not befit the Lord of Mercy [to have offspring]: إِن كُلُّ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ إِلَّآ ءَاتِي ٱلرَّحۡمَٰنِ عَبۡدٗا there is no one in the heavens or earth who will not come to the Lord of Mercy as a servant- Acts 3:13 GW:- “The God that Abraham, Isaac, Jacob, and our other ancestors worshiped has brought honor to his Servant Jesus. He is the one you betrayed. You turned against him when he was being tried by Pilate, even though Pilate wanted to set him free.” Luke 22:27 CEVDCI:- “Who do people think is the greatest, a person who is served or one who serves? Isn't it the one who is served? But I have been with you as a servant.” John 13:16 CEVDCI:- “I tell you for certain that servants are not greater than their master, and messengers are not greater than the one who sent them.” John 17:3 CEVDCI:- “Eternal life is to know you, the only true God, and to know Jesus Christ, the one you sent.” John 10:32 CEVDCI:- “But he said, “I have shown you many good things my Father sent me to do. Which one are you going to stone me for?” Mark 12:29–32 CEVDCI:- “Jesus answered, “The most important one says: ‘People of Israel, you have only one Lord and God. You must love him with all your heart, soul, mind, and strength.’ The second most important commandment says: ‘Love others as much as you love yourself.’ No other commandment is more important than these.” The man replied, “Teacher, you are certainly right to say there is only one God.” We believe in this: Luke 24:19 CEVDCI:- ““What do you mean?” Jesus asked. They answered: Those things that happened to Jesus from Nazareth. By what he did and said he showed that he was a powerful prophet, who pleased God and all the people.” Mathew 23:39 CEVDCI:- “You won't see me again until you say, “Blessed is the one who comes in the name of the Lord.”” Quran 1:1:- بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ In the name of God, the Lord of Mercy, the Giver of Mercy! Detailed answers based intensively on the Biblical texts: What does the Bible say about Prophet Muhammad? Does God want people to be Catholic or Protestant? ",
            "date": "Answered December 28, 2019",
            "views": "89",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Youssof Sahab",
                    "user_href": "/profile/Youssof-Sahab"
                },
                {
                    "user_id": "Zaid Mujtaba",
                    "user_href": "/profile/Zaid-Mujtaba"
                },
                {
                    "user_id": "Caleb Mahone",
                    "user_href": "/profile/Caleb-Mahone"
                }
            ]
        },
        {
            "author_info": {
                "name": "Enver Weitz",
                "href": "/profile/Enver-Weitz"
            },
            "answer_text": "Everyone that knew him & his teachings denied him. He never asked to be worshipped. In Hebrews 5:9 ‘’…unto all them that ‘’OBEY'' him.’: Nobody obeyed him but rather saw him as God and worshipped him. There are thing that he said they MUST do enter the kingdom but they never did what he said, so the all denies him. ",
            "date": "Answered December 28, 2019",
            "views": "28",
            "upvotes": "0"
        }
    ]
}