{
    "title": "Who was Father Ernetti? Did he really invent a time machine? - Quora",
    "tags": [
        "Time Machines",
        "Time Travel",
        "Time Travel Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aman Joshi",
                "href": "/profile/Aman-Joshi-74"
            },
            "answer_text": "OK, So to answer first part of question,Wikipedia is always available. But here is a short intro though. Marcello Pellegrino Ernetti (October 13, 1925 – April 8, 1994) was an Italian Roman Catholic Benedictine monk. The book Father Ernetti's Chronovisor: The Creation and Disappearance of the World's First Time Machine, written in German in 1997 by Peter Krassa claims that Ernetti invented a device that allowed him to witness past events. Now coming to second part. After going through the information available it’s clear that he invented a device which could channelize the past events on a screen by detecting all the sights and sounds that humanity had made that still floated through space. What he made was a device like a TV screen which shows events of past whereas in my knowledge Time machines are devices that transport people from one time or space to another.However time travel is a concept still so far away from us but real question is, what about a device that just deals with images and sounds? Could a machine like Father Ernetti described be built? Well we actually use crude versions of chronovisors every day. A security camera hooked to a video recorder will enable us to see into the past. Even something as a simple as mirror is really a type of chronovisor. We don't see ourselves in the mirror as we currently are, but as we were just a few millionths of a second before (the time it takes the light to travel from our face to the mirror, reflect off and return to our eyes.) But could we capture something from past as far as WW I or back till age of dinosaurs.Well as of now we don’t have any device but maybe someday after studying and quantum physics someday we might be able to do that. Also if you want to read what proof’s Father Ernetti had? Visit this The UnMuseum - The Missing Chronovisor ,you ll get a lot of information. Enjoy, Thanks for A2A Tschuss. ",
            "date": "Answered May 6, 2017",
            "views": "78",
            "upvotes": " View 24 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ten Cruse",
                    "user_href": "/profile/Ten-Cruse"
                },
                {
                    "user_id": "Anahita Singhania",
                    "user_href": "/profile/Anahita-Singhania-1"
                },
                {
                    "user_id": "Paritosh Dwivedi",
                    "user_href": "/profile/Paritosh-Dwivedi-4"
                },
                {
                    "user_id": "Lakshmi Sundar",
                    "user_href": "/profile/Lakshmi-Sundar-6"
                },
                {
                    "user_id": "Nurul Hazmi",
                    "user_href": "/profile/Nurul-Hazmi"
                },
                {
                    "user_id": "Ria Bansal",
                    "user_href": "/profile/Ria-Bansal"
                },
                {
                    "user_id": "George Billing",
                    "user_href": "/profile/George-Billing"
                },
                {
                    "user_id": "Yash Singh",
                    "user_href": "/profile/Yash-Singh-411"
                },
                {
                    "user_id": "Anish Raj",
                    "user_href": "/profile/Anish-Raj-234"
                },
                {
                    "user_id": "Sarika D",
                    "user_href": "/profile/Sarika-D-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vishal Singh",
                "href": "/profile/Vishal-Singh-2114"
            },
            "answer_text": "“The Creation and Disappearance of the World's First \t\t\t\tTime Machine” now here in between the journey of creation and disappearance there to proof weather it existed or not there is a book written on Father Ernetti's Chronoviso(Father Pellegrino Maria Ernetti (1925-1994) was a Benedictine \tpriest, scientist, and world-class authority on \"archaic\" music (pre-Christian to 10th century A.D.). He claimed to have yoked quantum physics to the occult arts to construct a time-machine - the chronovisor. Father Ernetti said he had traveled to Rome in 169 B.C. to witness a performance of the now-lost tragedy, Thyestes, by the father of Latin poetry, Quintus Ennius. ) Buy Father Ernetti's Chronovisor: The Creation and Disappearance of the World's First Time Machine Book Online at Low Prices in India you could buy it and can while reading you will witness a never before seen aspect of the pre written history book depicting how the incident took place . and since time machine isn’t there the proof is that we are still safe or if even if it existed it is in safe hands .. but as you know one wise person had said that “never believe anything until you see it feel it and lesson it personally ”.. hope it would have cleared your curiosity .. ",
            "date": "Answered May 10, 2017",
            "views": "29",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Shree Ram",
                    "user_href": "/profile/Shree-Ram-45"
                }
            ]
        }
    ]
}