{
    "title": "Who is older Jesus or Muhammad? - Quora",
    "tags": [
        "Muhammad (Islamic prophet)",
        "Jesus",
        "Islam",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Micheal Pitso Zwane",
                "href": "/profile/Micheal-Pitso-Zwane"
            },
            "answer_text": "Very interesting answers. From a non beliver or reseacher, I definately know that Mohammed was a later creation of Rome, meaning Christianity predates Islam. And other characters predates Jesus because Christianity documents are borrowed from older religion. Back in the day I was a Christian and I never studied other religions but when I abandoned Christianity I started researching other main religions. The results were that they are all the same. They talk about heavenly bodies/planets to different locations, so you become what the society make you. So none of them are older in age or creation because the stories predates our modern religions, the rulers changes the names to rule the masses. So my answer is Jesus Christ story is based on 1 year. It ends after the resurrection of the sun/son, meaning after Christmas. It's all Astrotheology, hopeful that might lighten up human kind to see beyond the veil. Please do not take religion literally otherwise you’'ll around killing innocent people. Much love The spirit of God is in everybody so is the devil. They is no-one above the sky. ",
            "date": "Answered June 20, 2018",
            "views": "22",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Talina Kisner",
                    "user_href": "/profile/Talina-Kisner-1"
                },
                {
                    "user_id": "Narendra Varma",
                    "user_href": "/profile/Narendra-Varma-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Iain Cam",
                "href": "/profile/Iain-Cam"
            },
            "answer_text": "Jesus is older because he still lives as per both religions while Muhammad died. Christians believe he was resurrected and ascended to heaven on Ascension Day and being God is alive. Islam which by stating Allah is the single divine God can not accept that but included the ascension belief so states Jesus (Isa) was not crucified (contrary to evidence) but instead someone else was crucified and made to look like him while the true Isa was raised to heaven alive to return to Earth during the end of days. The issue of who is right on the divinity of God - a single God or a single divine being of three personages is a major dispute but the Tanakh (Old Testament) does in Hebrew clearly talk of a triune God (YHWH, the Angel of YHWH and the Holy Spirit). Depending on one's theistic belief the interpretation of God and his attributes differs as both religions are very different. ",
            "date": "Answered June 15, 2018",
            "views": "12",
            "upvotes": "0"
        }
    ]
}