{
    "title": "Who was the first person to classify elements? - Quora",
    "tags": [
        "Periodic Table",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nahush Modak",
                "href": "/profile/Nahush-Modak"
            },
            "answer_text": "If a periodic table is regarded as an ordering of the chemical elements demonstrating the periodicity of chemical and physical properties, credit for the first periodic table (published in 1862) probably should be given to a French geologist, A.E.Beguyer de Chancourtois. De Chancourtois transcribed a list of the elements positioned on a cylinder in terms of increasing atomic weight. When the cylinder was constructed so that 16 mass units could be written on the cylinder per turn, closely related elements were lined up vertically. This led de Chancourtois to propose that \"the properties of the elements are the properties of numbers.\" De Chancourtois was first to recognize that elemental properties reoccur every seven elements, and using this chart, he was able to predict the stoichiometry of several metallic oxides. Unfortunately, his chart included some ions and compounds in addition to elements. And not Döbereiner. His work was exemplary but it was not a periodic table it was a set of elements which had shown similarities in their properties. ",
            "date": "Answered May 1, 2018",
            "views": "489",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Henry",
                "href": "/profile/James-Henry-105"
            },
            "answer_text": "It depends what you mean by “arranged the elements”. Empedocles first put forward the theory of the elements - basic pieces of matter in the fifth century BCE. However he also conceived of the elements as being earth, water, air and fire, which didn’t help. Antoine Lavoisier first defined an element as a substance that cannot be broken down into a simpler substance by a chemical reaction, but he included quite a few things - like “caloric” - which aren’t elements or even substances. John Dalton put forward atomic weight and atomic theory and William Prout pointed out the connexions between other elements’ Vs and hydrogen’s atomic weight. And after that it became a matter of applied intelligence and thought until Mendeleev made a comprehensive version. ",
            "date": "Answered October 24, 2020",
            "views": "45",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mark Werner",
                    "user_href": "/profile/Mark-Werner-4"
                },
                {
                    "user_id": "Yoram Beer",
                    "user_href": "/profile/Yoram-Beer"
                }
            ]
        }
    ]
}