{
    "title": "Who has a better understanding of science, Trump or Biden? - Quora",
    "tags": [
        "Understanding and Comprehension",
        "Joe Biden (politician)",
        "Political Science",
        "Science of Everyday Life",
        "Politicians and Government Leaders",
        "Science",
        "Donald Trump (politician, business person)",
        "Politics",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert L Gerrard",
                "href": "/profile/Robert-L-Gerrard"
            },
            "answer_text": "There is something about science that people like Donald Trump know all too well. They use this thing to their advantage all the time. It’s a powerful thing and very dangerous because it will only become more true as science advances. Here it is: Science has now advanced far beyond the point where a scientific fact can be delivered in a sentence, whilst a conspiracy theory can still be put forward in a simple soundbite. You’ll see it in action time after time. A stupid idea put forward in a single soundbite, which results in a series of lengthy articles explaining the scientific fact that it was nonsense and why that’s the case… whilst every scientific fact put forward in that argument becomes the target of further soundbite nonsense that requires yet another tranche of science-based debunking articles. The resulting noise BORES people because all that science is complicated, so they give up trying to understand (or in the case of the knowledgeable people, give up trying to promote) the science and just let the soundbites take over. Sadly, the majority of the human race does not want to accept that the way things work is so complex that unless a person is dedicated to studying a subject, they will probably come to all the wrong conclusions. They’ll have their mind full of misconceptions and misunderstandings about it, and find it easier to believe a simplistic incorrect viewpoint put forward in a soundbite than accept that the more complex truth about it is counter-intuitive. And now, this answer is falling into that category of becoming such a long brow-furrowing explanation that it won’t make sense. Even for me. See how easy it is? ",
            "date": "Answered October 18, 2020",
            "views": "276",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lee Thé",
                    "user_href": "/profile/Lee-Thé"
                },
                {
                    "user_id": "Allen Friedman",
                    "user_href": "/profile/Allen-Friedman-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevin Davidson",
                "href": "/profile/Kevin-Davidson-9"
            },
            "answer_text": "Trump said in December of 2016: \"Technology — nobody knows more about technology than me.\" Scientific American magazine, for the first time in its 175 year history, has endorsed a presidential candidate, Joe Biden. They said: The evidence and the science show that Donald Trump has badly damaged the U.S. and its people—because he rejects evidence and science. The most devastating example is his dishonest and inept response to the COVID-19 pandemic, which cost more than 190,000 Americans their lives by the middle of September. He has also attacked environmental protections, medical care, and the researchers and public science agencies that help this country prepare for its greatest challenges. That is why we urge you to vote for Joe Biden, who is offering fact-based plans to protect our health, our economy and the environment. These and other proposals he has put forth can set the country back on course for a safer, more prosperous and more equitable future.[1] The research journal, Nature, endorses Joe Biden: We cannot stand by and let science be undermined. Joe Biden’s trust in truth, evidence, science and democracy make him the only choice in the US election…. No US president in recent history has so relentlessly attacked and undermined so many valuable institutions, from science agencies to the media, the courts, the Department of Justice — and even the electoral system.[2] If Donald Trump actually knew anything about science, then his anti-science policies can only be interpreted as an attack on America. Vote Biden. Footnotes[1] Scientific American Endorses Joe Biden[2] Why Nature supports Joe Biden for US president",
            "date": "Answered October 17, 2020",
            "views": "265",
            "upvotes": " View 548 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Margaret Bernard",
                    "user_href": "/profile/Margaret-Bernard-4"
                },
                {
                    "user_id": "Steve Smith",
                    "user_href": "/profile/Steve-Smith-1625"
                },
                {
                    "user_id": "Kasie Liang",
                    "user_href": "/profile/Kasie-Liang"
                },
                {
                    "user_id": "Andy Patmore",
                    "user_href": "/profile/Andy-Patmore"
                },
                {
                    "user_id": "Geoffrey Richard Driscoll-Tobin",
                    "user_href": "/profile/Geoffrey-Richard-Driscoll-Tobin"
                },
                {
                    "user_id": "Gary Barnet",
                    "user_href": "/profile/Gary-Barnet"
                },
                {
                    "user_id": "Tom Borland",
                    "user_href": "/profile/Tom-Borland-1"
                },
                {
                    "user_id": "Stephen Bosarge",
                    "user_href": "/profile/Stephen-Bosarge"
                },
                {
                    "user_id": "Howard Brazee",
                    "user_href": "/profile/Howard-Brazee"
                },
                {
                    "user_id": "Dave Moore",
                    "user_href": "/profile/Dave-Moore-194"
                }
            ]
        }
    ]
}