{
    "title": "Why is DNA stable but RNA is not? - Quora",
    "tags": [
        "RNA",
        "DNA"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Min",
                "href": "/profile/David-Min-40"
            },
            "answer_text": "Think about it this way. From DNA you get protein, but the right amount of protein. It’s sent in a message from the nucleus to the cytoplasm. It is a transcribed message. The message is encoded in mRNA. You would keep using the genetic code in the process of translation. If the message were long-lived, it would keep creating protein in the absence of a reason to do so. Ribosomes are catalytic organelles if you consider it. The first catalysts were made of RNA and ribosomes are just protein and rRNA. So mRNA must degrade quickly. If not, you’ll keep making protein. DNA on the other hand must survive generation after generation for billions of years. That’s why we are able, with our respective DNA heritages, to consider the difference between the two. The difference between DNA and RNA (A missing -OH group at the 2′ position of ribose) is the same reason the two differ and the same reason they are not of equal stability.  RNA was never designed to survive long periods of time (an hour or so) like DNA…billions of years. RNA (free nucleotides) are converted into DNA (free nucleotides-dNTPs) by ribonucleotide reductase. RNA has a 2′ hydroxyl group and it acts in intramolecular cleavage of itself. It is designed chemically to break itself down at certain temperatures, pHs, etc. The reason RNA is more fragile than DNA is the presence of the 2′ hydroxyl. The absence of that hydroxyl group makes DNA harder to destroy. Why? RNA breaks down easily: (it’s a 1,2 diol). So it can trap certain electrophiles. See it? To the bottom left is an intact RNA strand each squiggly line from 5′O top left to the 3′ O of the phosphodiester bond. Each nucleobase in RNA is capable of splicing the transcript at any point on its own. DNA cannot perform this transfer reaction and is quite stable unless irradiated or intercalated[1].  Footnotes[1] Intercalation (biochemistry) - Wikipedia",
            "date": "Answered October 30, 2020",
            "views": "231",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Chris Schmidt",
                    "user_href": "/profile/Chris-Schmidt-102"
                }
            ]
        },
        {
            "author_info": {
                "name": "Varshit Dusad",
                "href": "/profile/Varshit-Dusad"
            },
            "answer_text": "DNA (deoxyribonucleic Acid) is much stable than RNA (ribonucleic Acid) for following reasons: Double Strand: DNA is double stranded which makes it stable becauseHydrogen bonding between bases release free energy providing it thermodynamic stability.Double strand also ensures that reactive bases (A,T,G,C) are kept occupied with their bonds. Also the structure of double helix ensures that foreign electrophiles are unable to reach in vicinity of bases. This prevents unexpected reactions from taking places.The double helix structure is stable in itself. The perpendicularly stacked bases joined by hydrogen bonding provides support to phosphodiester bond to maintain the helix structure.Lacking 2′ OH: OH groups are reactive by nature. However, in DNA the sugar molecule does not have a spare OH group. The sole OH group it possess is used up in making phosphodiester bonds. This further makes DNA immune to chemical reactions. While RNA has extra OH group which making it chemically promiscuous. 3. Stability of Thymine over Uracil: Thymine is more resistant to photomutation than Uracil. This makes DNA resistance stronger towards radioactive mutagenic agents. ",
            "date": "Answered May 30, 2017",
            "views": "436",
            "upvotes": " View 113 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Buraq Abdullah",
                    "user_href": "/profile/Buraq-Abdullah"
                },
                {
                    "user_id": "Robin Sinha",
                    "user_href": "/profile/Robin-Sinha-11"
                },
                {
                    "user_id": "Subhashree Das",
                    "user_href": "/profile/Subhashree-Das-102"
                },
                {
                    "user_id": "Tousief Irshad Ahmed Sirwal",
                    "user_href": "/profile/Tousief-Irshad-Ahmed-Sirwal"
                },
                {
                    "user_id": "Debjit Mandal",
                    "user_href": "/profile/Debjit-Mandal-6"
                },
                {
                    "user_id": "Medhakriti Debnath",
                    "user_href": "/profile/Medhakriti-Debnath"
                },
                {
                    "user_id": "Sarmistha Garnaik",
                    "user_href": "/profile/Sarmistha-Garnaik"
                },
                {
                    "user_id": "Fatemeh Meschi",
                    "user_href": "/profile/Fatemeh-Meschi"
                },
                {
                    "user_id": "Nisha Vani",
                    "user_href": "/profile/Nisha-Vani-4"
                },
                {
                    "user_id": "Nandini Yadav",
                    "user_href": "/profile/Nandini-Yadav-100"
                }
            ]
        }
    ]
}