{
    "title": "Why are all stars in our universe mostly made up of hydrogen and helium? - Quora",
    "tags": [
        "Helium",
        "Hydrogen",
        "The Universe",
        "Cosmology",
        "Astronomy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Muhammad Hassan",
                "href": "/profile/Muhammad-Hassan-442"
            },
            "answer_text": "Basically, stars are big exploding balls of gas, mostly hydrogen and helium. Our nearest star, the Sun, is so hot that the huge amount of hydrogen is undergoing a constant star-wide nuclear reaction, like in a hydrogen bomb. Even though it is constantly exploding in a nuclear reaction, the Sun and other stars are so large and have so much matter in them that it will take billions of years for the explosion to use all the \"fuel\" in the star. The huge reactions taking place in stars are constantly releasing energy (called electromagnetic radiation) into the universe, which is why we can see them and find them on radio telescopes such as the ones in the Deep Space Network (DSN). Stars, including the Sun, also send out a solar wind and burst out occasional solar flares.  The Saggitarius Star Cloud, found at the center of our galaxy. Star color is linked to temperature. A relatively cool, yellow star like our Sun would seem dim in this photograph. Hubble Space Telescope Image from the Astronomy Picture of the Day Archive. APOD: January 13, 1999 Scientists think that the core of the Sun is a 15 million degree Celsius plasma, a soup of electrons and protons that are stripped from hydrogen atoms. This \"soup,\" called plasma, makes up 90 percent of the Sun. Every second, thousands of protons in the Sun's core collide with other protons to produce helium nuclei in a nuclear fusion reaction that releases energy. Just outside the core, energy moves outward by a process called radiation. Closer to the surface, the energy moves out by a process called convection - hot gases rise, cool, and sink back down again. As these masses of gas move, they push off of each other causing \"Sun-quakes.\" These make the material in the Sun vibrate. These Sun-quakes help scientists determine the Sun's internal structure and the processes occurring at different locations underneath the Sun's surface.  NASA Photo of the Sun taken by Skylab in 1973. From the Astronomy Piture of the Day Archives, APOD: September 16, 1996  This drawing shows the major features of the Sun. The Sun actually consists of 90% hydrogen and a mixture of other gases. In diameter, it is over 100 times bigger than the Earth. From the Education and Public Outreach Page of the Solar and Heliospheric Observatory (SOHO) project at NASA.  The theme of this concept is that : Stars are made of very hot gas. This gas is mostly hydrogen and helium, which are the two lightest elements.Stars shine by burning hydrogen intohelium in their cores, and later in their lives create heavier elements. ",
            "date": "Answered February 25, 2018",
            "views": "499",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kirsten Murray",
                    "user_href": "/profile/Kirsten-Murray-6"
                },
                {
                    "user_id": "Don Feldman",
                    "user_href": "/profile/Don-Feldman-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saif Ullah",
                "href": "/profile/Saif-Ullah-86"
            },
            "answer_text": "Hydrogen and helium account for nearly all the nuclear matter in today's universe. This is consistent with the standard or \"big bang\" model. The process of forming the hydrogen and helium and other trace constituents is often called \"big bang nucleosynthesis\". Schramm's figures for relative abundances indicate that helium is about 25% by mass and hydrogen about 73% with all other elements constituting less than 2%. Carroll & Ostlie give 23 to 24% helium. There is a window of uncertainty, but it is clear that hydrogen and helium make up 98% plus of the ordinary matter in the universe. This high percentage of helium argues strongly for the big bang model, since other models gave very small percentages of helium. Since there is no known process which significantly changes this H/He ratio, it is taken to be the ratio which existed at the time when the deuteron became stable in the expansion of the universe. This ratio is significant as a test of cosmological models since it will be affected by the time period from the time when the temperature dropped below that necessary to produce neutrons from protons to the time when the deuteron became stable, halting the decay of the free neutrons. Basically , the hydrogen-helium abundance helps us to model the expansion rate of the early universe. If it had been faster, there would be more neutrons and more helium. If it had been slower, more of the free neutrons would have decayed before the deuterium stability point and there would be less helium.  ",
            "date": "Answered March 1, 2017",
            "views": "19",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bill Collis",
                    "user_href": "/profile/Bill-Collis-2"
                },
                {
                    "user_id": "Kirsten Murray",
                    "user_href": "/profile/Kirsten-Murray-6"
                },
                {
                    "user_id": "Sam Jaques",
                    "user_href": "/profile/Sam-Jaques"
                },
                {
                    "user_id": "Shahab Ahmed",
                    "user_href": "/profile/Shahab-Ahmed-24"
                },
                {
                    "user_id": "Sriram Srungaram",
                    "user_href": "/profile/Sriram-Srungaram"
                },
                {
                    "user_id": "Karan Singh",
                    "user_href": "/profile/Karan-Singh-1301"
                }
            ]
        }
    ]
}