{
    "title": "Why do we study literature? - Quora",
    "tags": [
        "Literature",
        "Studying"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ernst Stolz",
                "href": "/profile/Ernst-Stolz"
            },
            "answer_text": "I studied literature among other things. And even though I’ve studied it I agree that its purpose is not at all obvious since it is not practical. It’s not something we can use elsewhere. It’s not like a programming language which we learn and then use to build things. Literature is not like that. You don’t use literature. What would that even mean, right? But what’s its purpose then? Literature is a body of written work. But it’s not just any work; it’s a collection of experiences. Actually, it’s even more than that. It’s a way to evoke the sensation of lived experience. When you read a work of art you don’t simply skim through it but become immersed in a world that you can experience for yourself. Literature is capable of transporting you from your living room into a world of its own. This way you can experience things you could never have experienced otherwise. You learn about ambition and success, about hatred and failure, and about mixtures of both, represented in fateful characters and narrators. They’re telling a story of their lives. And we are listening to it. We listen to its ups and downs and we listen to the voice of the narrator which sometimes misleads us to believe something else than the truth. Ahh, you might say! But how can we read one thing and believe another? We read what we read! True. And yet the narrator is telling the story. And he can tell it in such a way that you won’t be sure whether to trust him or not. That’s an unreliable narrator. It adds a question. How is it possible that a written piece of work can bring to life a subjectivity that we perceive as a narrator of the story? After all, it’s a piece of text and not a person! Why then do we feel that the narrator has intentions of misleading us? This brings us to studying literature and its effects. And there are many things to study, various subdisciplines that deal with things like culture, values, and even copyright issues in our increasingly digital age. The field of literature is huge. I particularly got interested in cognitive literary studies. It’s an interdisciplinary research field that focuses on what’s going on in our brain when we read literary work and on what we think and feel is going on subjectively. For example, our physical sense of balance is hypothesized to scale up to an understanding of abstraction and fairness. The researcher Ellen Spolsky says, What the infant body learns, then, taking its first steps, is not just how to walk but how to avoid falling. Smetacek here suggests that balance in relation to gravity is the most basic level at which the ability to recognize failure or error activates mechanisms of correction with survival value. If this was sufficient, cats would be judges. Humans, however, use language and thought as the scaffolding by which their evolved sensitivity to imbalance scales up to support judgments of equity in interpersonal relations. And you see that suddenly it becomes interesting to look at how we use language. How do we support the judgments we make? Can we find evidence of our language use that showcases how we rely on our “evolved sensitivity to imbalances”? That, at least, is one purpose of literature. We dig down into our repository of literary work which literally is a collection of human experience. ",
            "date": "Updated December 29, 2018",
            "views": "231",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nishant Sharma",
                    "user_href": "/profile/Nishant-Sharma-1437"
                },
                {
                    "user_id": "Kristina Theresa Orat",
                    "user_href": "/profile/Kristina-Theresa-Orat"
                },
                {
                    "user_id": "Negin Youseframaki",
                    "user_href": "/profile/Negin-Youseframaki"
                },
                {
                    "user_id": "Nijel Jedrick",
                    "user_href": "/profile/Nijel-Jedrick"
                },
                {
                    "user_id": "Edwin Gregor Salazar",
                    "user_href": "/profile/Edwin-Gregor-Salazar"
                },
                {
                    "user_id": "Maximiliane Von Tresckow",
                    "user_href": "/profile/Maximiliane-Von-Tresckow"
                },
                {
                    "user_id": "Zahir Shah",
                    "user_href": "/profile/Zahir-Shah-225"
                },
                {
                    "user_id": "Clair Sheehan",
                    "user_href": "/profile/Clair-Sheehan-1"
                },
                {
                    "user_id": "Nina Blankestijn",
                    "user_href": "/profile/Nina-Blankestijn"
                },
                {
                    "user_id": "Jesse Chang",
                    "user_href": "/profile/Jesse-Chang-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thomas L. Johnson",
                "href": "/profile/Thomas-L-Johnson-1"
            },
            "answer_text": "Why indeed. Although I spent the majority  of my working career outside of the field of literature, I lived my life very much within it. In the last year, for instance, I have returned to German literature as I worked on a book, The Germany Fairy Tale Landscape, that has its formal release in Germany on April 11.  The lasting appeal? Literature is often the best that a culture can produce. While there is little technology and  few physical inventions from the 19th century that continue to have relevance in the 21st, the literature does. Whether it is Charles Dickens, Gustave Flaubert, Leo Tolstoy, Theodor Fontane, or George Eliot, the worlds they create have the ability to grab us and hold us. It is no accident that film-makers continue to go back to that rich literature. Literature adds something remarkable to the landscapes it inhabits. I remember going to Oxford, Mississippi, shortly after William Faulkner had passed from the scene. While it was, in reality, a fairly typical southern university setting, the fact that Faulkner had set his literary production almost completely in that landscape made it remarkable. The same is true of Luebeck, the setting for Thomas Mann's Buddenbrooks or the Paris of Victor Hugo or Charles Dickens. What was prosaic becomes enchanted. Literature challenges the status quo and adds richness to the language and culture from which it comes. Poetry, in particular, changes language by pushing it into new ways of registering the human experience. The greatest of the poets -- Neruda, Yeats, Tranströmer, Rilke, for instance -- mine language and transform it the way Yeats does in his Second Coming:      Turning and turning in the widening gyre    The falcon cannot hear the falconer;    Things fall apart; the centre cannot hold;    Mere anarchy is loosed upon the world,    The blood-dimmed tide is loosed, and everywhere    The ceremony of innocence is drowned;    The best lack all conviction, while the worst    Are full of passionate intensity.The Second Coming - YeatsLiterature, Music, Painting, Sculpture, Theater, Dance -- the arts in general, provide a place we go for comfort, for challenge, for enjoyment. That is the enduring power of the arts. ",
            "date": "Answered March 12, 2015",
            "views": "79",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jyoti Shukla",
                    "user_href": "/profile/Jyoti-Shukla-281"
                },
                {
                    "user_id": "Martin Raja",
                    "user_href": "/profile/Martin-Raja"
                },
                {
                    "user_id": "Kaviya Aarushi",
                    "user_href": "/profile/Kaviya-Aarushi"
                },
                {
                    "user_id": "Yusra Jeon",
                    "user_href": "/profile/Yusra-Jeon"
                },
                {
                    "user_id": "Acacia Harris",
                    "user_href": "/profile/Acacia-Harris"
                },
                {
                    "user_id": "Mythri",
                    "user_href": "/profile/Mythri-17"
                },
                {
                    "user_id": "Preetika Rathee",
                    "user_href": "/profile/Preetika-Rathee"
                },
                {
                    "user_id": "Arjun Ravichandran",
                    "user_href": "/profile/Arjun-Ravichandran-1"
                },
                {
                    "user_id": "Kirby Stone",
                    "user_href": "/profile/Kirby-Stone"
                }
            ]
        }
    ]
}