{
    "title": "Why did most inventions get invented within the last 400-500 years? - Quora",
    "tags": [
        "History of Inventions",
        "Inventors",
        "Innovation",
        "Invention and Inventions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Taylor",
                "href": "/profile/Paul-Taylor-1311"
            },
            "answer_text": "I have always pondered this. As has already been stated, ideas and invention build on themselves. But I feel there is another factor at play. It isn't enough just to have a good idea. You also need the materials with which to put that idea into practice. There is much about inventiveness that is revolutionary. but the development of metals and other engineering materials has been far more evolutionary and this takes time. Many inventions which people assume are modern are far older than most appreciate. But it is not enough for Roger Bacon (b1220ad) to muse on how to build a gas turbine engine or the possibility that in the future huge mechanically powered flying machines might carry people at great speed over the oceans. 800 years ago or so, there was simply no way of putting these ideas into practice because the materials needed to do so simply didn't exist. And it took a long time to actually develop the materials sciences to the point where these ideas could be put into practice. ",
            "date": "Answered June 2, 2020",
            "views": "260",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tom Meier",
                "href": "/profile/Tom-Meier-18"
            },
            "answer_text": "Two main reasons, first as Sven Bremberg says, invention builds on itself. Second, incentive, when you have a reason to be inventive you are more likely to invent. It’s only in the past 500 years or so that ordinary people have had security in their private property. If you aren’t going to get anything out of it, why would you spend time working and refining an invention? ",
            "date": "Answered June 1, 2020",
            "views": "64",
            "upvotes": "0"
        }
    ]
}