{
    "title": "Why don't electrons repel other electrons in an atom? - Quora",
    "tags": [
        "Atomic Physics",
        "Electrons",
        "Atoms"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lucas Curtis",
                "href": "/profile/Lucas-Curtis"
            },
            "answer_text": "They do! In fact, the mutual repulsion among electrons gives rise to many of the properties of atoms — their sizes, they way they react with other atoms, the way they interact with light, etc. But perhaps you mean to ask: why don’t electrons fly away from each other in atoms? You see, each electron in an atom is subject to two flavors of electromagnetic force. They are repelled by other electrons, yes, but they are also attracted to the protons in the atomic nucleus. I’m glossing over a lot of details here, but the arrangement of electrons in atoms is actually a compromise between these competing forces. The amount of force between charged particles varies with the amount of charge, but it varies inversely with the distance between the particles. Protons and electrons all have the same amount of charge (with the difference being that protons are positive and electrons are negative), so that part of the equation is essentially a constant where subatomic particles are concerned. Ergo, distance is the major variable. Due to the complexities of quantum mechanics, electrons organize themselves into “layers”, with each layer having a different average distance from the protons in the atomic nucleus. The electrons that occupy the layer closest to the nucleus are most strongly attracted to it, and therefore the least likely to fly apart due to their mutual repulsion. As you move from one layer to the next — away from the nucleus — the number of potential electrons increases, and so does the amount of repulsion they could potentially feel from other electrons. Ergo, the further you get from the nucleus, the weaker the electrons are held to the atom. After you’ve added a certain number of electrons to an atom, the attraction to the nucleus is overwhelmed by the repulsion from other electrons, and the repulsion does drive away any additional electrons that might approach the atom. The number of electrons needed to generate enough repulsion to drive away additional electrons varies from atom to atom and by situation. A full discussion of the mechanics behind the behavior of electrons is far beyond the scope of this answer. But suffice it to say that electrons do indeed repel each other in atoms; nevertheless they are held in place by their attraction to the nucleus. ",
            "date": "Answered February 9, 2018",
            "views": "746",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lane Votapka",
                    "user_href": "/profile/Lane-Votapka"
                },
                {
                    "user_id": "Aqsa Taj",
                    "user_href": "/profile/Aqsa-Taj-2"
                },
                {
                    "user_id": "Shahrukh Mateen",
                    "user_href": "/profile/Shahrukh-Mateen"
                },
                {
                    "user_id": "Kenneth Armstrong",
                    "user_href": "/profile/Kenneth-Armstrong-9"
                },
                {
                    "user_id": "Benjamin Robert Barber",
                    "user_href": "/profile/Benjamin-Robert-Barber"
                },
                {
                    "user_id": "Mahesh Pandey",
                    "user_href": "/profile/Mahesh-Pandey-105"
                },
                {
                    "user_id": "Sarthak Tanwar",
                    "user_href": "/profile/Sarthak-Tanwar-1"
                },
                {
                    "user_id": "Kush Kumar",
                    "user_href": "/profile/Kush-Kumar-142"
                },
                {
                    "user_id": "Joseph Dylan Leister",
                    "user_href": "/profile/Joseph-Dylan-Leister"
                },
                {
                    "user_id": "Stephen Frantz",
                    "user_href": "/profile/Stephen-Frantz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stefano Vezzoli",
                "href": "/profile/Stefano-Vezzoli"
            },
            "answer_text": "They do, but this repulsive force is normally overcome by the attractive force of the nucleus. Think of the atom as a lot of empty space with a tiny point in the center, which is the positively charged nucleus, and all the tiny electrons orbiting at high speed, very far from it (compared to their size). In the first approximation each electron feels the central attraction of the nucleus, eventually ‘screened’ by the electrons which are in the lower orbitals. As long as there are more positive charges in the nucleus than electrons orbiting around it the overall potential will be attractive and you can add other electrons. Since there is a lot of empty space in the atom and the electrons do not have proper orbits like planets, because of the rules of Quantum Mechanics, the electrons spinning around the nucleus are almost never close to each others (this probability is extremely low). Quantum Mechanics forbids 2 electrons with the same quantum numbers to even exist! (Fermi principle) For this reason they do not repel each others as effectively as one could naively expect. Instead if the atom has 5 protons in the nucleus and there are already 4 electrons around it, you can normally add another electron easily, as this new electron will ‘see’ an overall single positive charge. Obviously there are complications to this very simple picture, which makes sometimes possible and preferable for an atom to keep more or less electrons than protons. We call this state an ion, and in most of the cases it is not very stable. ",
            "date": "Answered February 9, 2018",
            "views": "17",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Naveen Sundar",
                    "user_href": "/profile/Naveen-Sundar-21"
                },
                {
                    "user_id": "Kenneth Armstrong",
                    "user_href": "/profile/Kenneth-Armstrong-9"
                },
                {
                    "user_id": "Sarthak Tanwar",
                    "user_href": "/profile/Sarthak-Tanwar-1"
                },
                {
                    "user_id": "Vincnzo Bruno",
                    "user_href": "/profile/Vincnzo-Bruno"
                },
                {
                    "user_id": "Stefano Dellafiore",
                    "user_href": "/profile/Stefano-Dellafiore-1"
                },
                {
                    "user_id": "Giuliano Vezzoli",
                    "user_href": "/profile/Giuliano-Vezzoli"
                },
                {
                    "user_id": "Noel Malone",
                    "user_href": "/profile/Noel-Malone-5"
                },
                {
                    "user_id": "Raffaella Belotti",
                    "user_href": "/profile/Raffaella-Belotti"
                },
                {
                    "user_id": "Davide Margiotta",
                    "user_href": "/profile/Davide-Margiotta"
                },
                {
                    "user_id": "Joy Jie Yu",
                    "user_href": "/profile/Joy-Jie-Yu"
                }
            ]
        }
    ]
}