{
    "title": "Why do scientific theories have to be falsifiable? - Quora",
    "tags": [
        "Falsifiability in Physics",
        "Philosophy of Science",
        "Theory and Theories"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jared Gordon",
                "href": "/profile/Jared-Gordon-3"
            },
            "answer_text": "Because non-falsifiable theories don't advance knowledge. Anything non-falsifiable is by definition 'true'. More than that, it is true no matter what observations are made, and no matter what the universe looks like. The point of scientific theories is to provide tools to improve understanding of reality and to allow us to effectively predict outcomes from initial conditions. But a non-falsifiable theory by definition must be true in all possible outcomes, so applying it doesn't actually tell us anything about what is happening and what the outcome will be. Imagine the future as a branching path of possibilities, and theories as guides to picking out the right path. Good theories point you down the right path, OK theories might go in the right direction but miss the mark a bit, Bad theories might lead you down the wrong path. Un-falsifiable theories don't eliminate any paths at all, so of course they're useless for finding anything. All three of the first three types of theories can tell you something about the world, and all three can be tested by using the theory, then looking back and seeing how you did. The last type however is only ever used by people looking back and claiming that their theory perfectly fit the path taken, ignoring the fact that that would be true no matter where you ended up. I would like to clarify that this applies only to scientific theories. If you're not concerned about actually applying your theory to the universe, or about it being useful for predicting outcomes, you can theorize whatever you want. People aren't likely to take that sort of thing too seriously though. Note: I'm using a somewhat non-standard definition of 'true', meaning that it agrees with everything observed in reality, not that it necessarily corresponds to some fundamental aspect of the world. In practice these are indistinguishable. ",
            "date": "Updated July 24, 2017",
            "views": "25",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Bass",
                    "user_href": "/profile/Michael-Bass-116"
                },
                {
                    "user_id": "Sravan Danda",
                    "user_href": "/profile/Sravan-Danda"
                },
                {
                    "user_id": "Renita Moore",
                    "user_href": "/profile/Renita-Moore-3"
                },
                {
                    "user_id": "Greg Tingey",
                    "user_href": "/profile/Greg-Tingey"
                },
                {
                    "user_id": "Prakash Chandra Badal",
                    "user_href": "/profile/Prakash-Chandra-Badal"
                },
                {
                    "user_id": "Yates Buckley",
                    "user_href": "/profile/Yates-Buckley"
                },
                {
                    "user_id": "Ryan Mars",
                    "user_href": "/profile/Ryan-Mars-2"
                },
                {
                    "user_id": "Stephen Baish",
                    "user_href": "/profile/Stephen-Baish"
                },
                {
                    "user_id": "Joshua Engel",
                    "user_href": "/profile/Joshua-Engel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Issac Fung",
                "href": "/profile/Issac-Fung-1"
            },
            "answer_text": "Basically, falsifiability is the property of a theory which can be disproved empirically. This results in theories which are realistic and open, where they can be tested against other theories and the existing evidence. According to Karl Popper, science has to be falsifiable for it to get meaningful results. This means that hypotheses need to have a capacity for being disproven, so it can be checked against the latest body of evidence empirically. If something was not falsifiable (e.g proving the existence of an invisible dragon which we cannot feel or hear or detect with anything we have at the moment), then we cannot disprove it, and it would have no meaning empirically. However, if I say ‘The speed of sound is about 300m/second’, then it is falsifiable as you can disprove it. If you can't disprove it, this means that the theory holds, and is accepted as fact until someone new is able to disprove it. When it comes to scientific progress, falsifiability is really important, as it allows theories to be challenged and sets a reliable measurement of which theories are the best. This is why scientific theories have to be falsifiable: it is the only way it can be challenged, disproven or accepted. Otherwise it would just be mere speculation. ",
            "date": "Answered June 20, 2016",
            "views": "839",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael LaRosa",
                    "user_href": "/profile/Michael-LaRosa"
                },
                {
                    "user_id": "John Robinson",
                    "user_href": "/profile/John-Robinson-183"
                },
                {
                    "user_id": "Léon Noe",
                    "user_href": "/profile/Léon-Noe"
                },
                {
                    "user_id": "Robert Cameron",
                    "user_href": "/profile/Robert-Cameron-16"
                }
            ]
        }
    ]
}