{
    "title": "Why don't protons in a nucleus repel each other? Why doesn't the nucleus break apart? - Quora",
    "tags": [
        "Protons",
        "Atoms",
        "Particle Physics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Erwin Rockenbauer",
                "href": "/profile/Erwin-Rockenbauer"
            },
            "answer_text": "protons have one unit of positive electromagnetic charge. the electromagnetic force is quite strong so those protons repel each other. however: protons consist of three quarks and those have electromagnetic charge but also color charge (charge of the strong interaction). the strong interaction is about a hundred times stronger than the electromagnetic force, so it can keep those quarks together. the strong interaction is mediated by special bosons called gluons (yes - the name comes from “glue” because gluons glue the quarks together). those gluons themself carry color charge and therefore can interact with each other. hence protons are not like cannon balls but more like a cloud: three quarks whirling around and hold together by a “sea” of gluons. and protons have no well defined surface. when multiple protons are in close distance to each other, the gluons of those protons can interact. as the strong interaction is very strong there are very high levels of energy involved (99% of the mass of a proton is the potential energy of the strong interaction). and the strange thing about the strong interaction is that it gets stronger over distance (opposite to the other forces which get weaker). if the distance is right the energy is high enough to form a quark-antiquark pair. those pairs are generally called mesons (pair of any quark and antiquark) and in this special case they are pions (pair of up-quark and anti-down-quark). those pions also carry color charge. and because their spin is 0 they are bosons and can mediate the so called nuclear force (or residual strong force) which is based on the strong interaction. so those pions mediate the nuclear force between the protons. and that force is stronger as the electromagnetic force therefore the protons stay together. but hold on: the strong interaction gets stronger with distance? what stops it from gluing everything together? ok - fist: the strong interaction is only effective between particles with color charge. particles with no color charge (like electrons) don’t feel that force at all. second: there’s something called confinement: a triplet of three quarks with different color charges (red, green and blue = white) acts like it has no charge at all (not exactly but almost). so there is only very little force between those triplets aka nucleons (protons, neutrons) - only the nuclear force that is mediated by pions. pions have two quarks with color charge but not it is one color and its anti-color (eg. red and anti-red => black) which is kind of the same as white - and therefore like also very little force. third: if you try to separate two gluons which are hold together by the strong interaction you have to invest energy. the farther those gluons are put afar, the stronger that force gets and the more of energy you have to invest. if the gluons are separated too far, the energy you have invested is high enough to produce a particle-antiparticle-pair - each with color charge. the gluons then interact with one of that new particles and not with each other. and that “gluon-particle-pack” is self-confinded and doesn’t interact with other particles over the strong interaction anymore. by the way: color charge is somewhat misleading: no “real” colors are involved. the strong interaction has 8 types of charge and they behave somewhat like colors: red + green + blue = white; cyan (anti-red) + magenta (anti-green) + yellow (anti-blue) = black (anti-white). the pioneer of this field - murray gell-mann - called it “the eight-fold way” and wasn’t quite happy with that color-nonsense. so there you have it: protons are triplets of quarks hold together by strong interaction mediated by gluons. in close distance that strong interaction forms pions which mediate the nuclear force which holds that protons together because it is stronger than the electromagnetic force which tries to separate the protons.. ",
            "date": "Answered March 17, 2020",
            "views": "12",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rohan Nowal",
                    "user_href": "/profile/Rohan-Nowal"
                },
                {
                    "user_id": "Harold Muniz",
                    "user_href": "/profile/Harold-Muniz-1"
                },
                {
                    "user_id": "Judah Kang",
                    "user_href": "/profile/Judah-Kang"
                },
                {
                    "user_id": "Sang Dhong",
                    "user_href": "/profile/Sang-Dhong"
                },
                {
                    "user_id": "Mohammed Saiful Alam Siddiquee",
                    "user_href": "/profile/Mohammed-Saiful-Alam-Siddiquee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhishek Shyam",
                "href": "/profile/Abhishek-Shyam"
            },
            "answer_text": "The Strong Nuclear Force (also referred to as the strong force) is one of the four basic forces in nature (the others being gravity, the electromagnetic force, and the weak nuclear force). As its name implies, it is the strongest of the four. However, it also has the shortest range, meaning that particles must be extremely close before its effects are felt. Its main job is to hold together the subatomic particles of the nucleus (protons, which carry a positive charge, and neutrons, which carry no charge. These particles are collectively called nucleons). As most people learn in their science education, like charges repel (+ +, or - -), and unlike charges attract (+ -). If you consider that the nucleus of all atoms except hydrogen contain more than one proton, and each proton carries a positive charge, then why would the nuclei of these atoms stay together? The protons must feel a repulsive force from the other neighboring protons. This is where the strong nuclear force comes in. The strong nuclear force is created between nucleons by the exchange of particles called mesons. This exchange can be likened to constantly hitting a ping-pong ball or a tennis ball back and forth between two people. As long as this meson exchange can happen, the strong force is able to hold the participating nucleons together.  The nucleons must be extremely close together in order for this exchange to happen. The distance required is about the diameter of a proton or a neutron. If a proton or neutron can get closer than this distance to another nucleon, the exchange of mesons can occur, and the particles will stick to each other. If they can't get that close, the strong force is too weak to make them stick together, and other competing forces (usually the electromagnetic force) can influence the particles to move apart. This is represented in the following graphic. The dotted line surrounding the nucleon being approached represents any electrostatic repulsion that might be present due to the charges of the nucleons/particles that are involved. A particle must be able to cross this barrier in order for the strong force to \"glue\" the particles together.  In the case of approaching protons/nuclei, the closer they get, the more they feel the repulsion from the other proton/nucleus (the electromagnetic force). As a result, in order to get two protons/nuclei close enough to begin exchanging mesons, they must be moving extremely fast (which means the temperature must be really high), and/or they must be under immense pressure so that they are forced to get close enough to allow the exchange of meson to create the strong force. Now, back to the nucleus. One thing that helps reduce the repulsion between protons within a nucleus is the presence of any neutrons. Since they have no charge they don't add to the repulsion already present, and they help separate the protons from each other so they don't feel as strong a repulsive force from any other nearby protons. Also, the neutrons are a source of more strong force for the nucleus since they participate in the meson exchange. These factors, coupled with the tight packing of protons in the nucleus so that they can exchange mesons creates enough strong force to overcome their mutual repulsion and force the nucleons to stay bound together. The preceding explanation shows the reason why it is easier to bombard a nucleus with neutrons than with protons. Since the neutrons have no charge, as they approach a positively charged nucleus they will not feel any repulsion. They therefore can easily \"break\" the electrostatic repulsion barrier to being exchanging mesons with the nucleus, thus becoming incorporated into it. ",
            "date": "Answered October 11, 2015",
            "views": "9",
            "upvotes": " View 26 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shreya Vishwakarma",
                    "user_href": "/profile/Shreya-Vishwakarma-35"
                },
                {
                    "user_id": "Antara Ghosh",
                    "user_href": "/profile/Antara-Ghosh-75"
                },
                {
                    "user_id": "Vaishnavi",
                    "user_href": "/profile/Vaishnavi-246"
                },
                {
                    "user_id": "John McClelland",
                    "user_href": "/profile/John-McClelland-31"
                },
                {
                    "user_id": "Shabir Hussain",
                    "user_href": "/profile/Shabir-Hussain-159"
                },
                {
                    "user_id": "Hussain Rassiwala",
                    "user_href": "/profile/Hussain-Rassiwala"
                },
                {
                    "user_id": "Debarun Biswas",
                    "user_href": "/profile/Debarun-Biswas"
                },
                {
                    "user_id": "Pavithra Rajindra",
                    "user_href": "/profile/Pavithra-Rajindra"
                },
                {
                    "user_id": "Priyanka Sengupta",
                    "user_href": "/profile/Priyanka-Sengupta-5"
                },
                {
                    "user_id": "Sujit Das",
                    "user_href": "/profile/Sujit-Das-487"
                }
            ]
        }
    ]
}