{
    "title": "Why do we allow ourselves to be categorized by race when there is only human race? - Quora",
    "tags": [
        "Sociology",
        "Racism",
        "Race and Ethnicity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Frederic Christie",
                "href": "/profile/Frederic-Christie"
            },
            "answer_text": "This is of course a complex answer that deserves a long response. The first aspect of this is that ethnicity is very real, and we erroneously conflated ethnicity with genetics at a time where it was politically convenient and the science wasn't clear enough to deny that attempt. And because ethnicity often includes religion, language, culture, nation, tribal identity, and dozens of other components, it can itself be a complex identification. We have natural tribal tendencies. Someone who is, say, Luba in the Democratic Republic of Congo, might identify themselves as part of the Bantu linguistic group, as Congolese when it comes to their national identity, and as Luba when it comes to ethnic and tribal self-identification. Such a person in ordinary life is not likely to feel a strong pan-African or \"black\" identification... until they have to interact with someone talking trash about their continent. At that point and in that context, they may view themselves as allied with people who they would ordinarily view as outsiders and may not even give the time of day to. I think that phenomenon, a kind of continental super-identification or a kind of rallying around the flag where when one is attacked one embraces others that one normally despises, is one of the big untold stories of race. In Asia, ethnic Kinh (Viet), Tay, Tai, Koreans, Japanese, Ainu, Han Chinese, Uighurs, Hmong, Lao… these groups do not view themselves as identical or allied. People emphatically have not forgotten Japan's aggression in World War II. Of course it's not the case that the only cleavage in Asian politics is ethnic: Han Chinese are the majority in both Taiwan and the PRC, and North and South Koreans are basically the same ethnic group. But these political debates take on ethnic dimensions. North and South Koreans refer to themselves differently, and there's a kind of country-city divide. And the Taiwanese have definitely developed a very different culture from mainland China. Over time, those cultural changes transform the way people think of their identity. This is how ethnicities have changed. Does anyone still talk about the Scythians? No. These Iranian peoples were important to antiquity and don't matter anymore. Over human history, the humber of tribes that have been forgotten or no longer have modern people identifying with them is literally uncountable: we don't know all of them. Can you imagine how many Paleolithic tribes were exterminated, lost, or changed through intermarriage? And that idea, that politics drives ethnicity and then ethnicity drives politics, is crucial. See, people like me argue that \"whiteness\" is an artificial construct in the U.S. White ethnic groups lost their ethnicity and traded it in for this idea of \"whiteness\". They lost their language, they lost their heritage, they lost their food. In college, in multicultural classes, every person had a story of multicultural loss. One of my fellow students lost his family's latkes and Russian and Jewish food. Many of the Asian students felt a sense of loss at having American rather than Chinese names. Tim Wise tells how his Russian grandfather tried to tell the stories of Tim’s great-grandfather and about the homeland, but just had nothing left to remember, starting stories but being unable to conclude them, unable to give his grandson any heritage. Tim says that even if all he had lost was his real name (Weiss instead of Wise), that would have been \"nothing: nothing except one's past of course. Nothing except the intergenerational fiber that has kept your people together for generations. Nothing except the story of how you survived\". And these arguments have a great validity. American culture has so little in terms of truly unique and regional food dishes, so little in terms of an authentically deep and rich culture. That's part of why America is in a real sense the birthplace of mass-produced consumer culture: we always were a kind of impostor, taking spaghetti and combining it with meat sauce here, appropriating a hamburger there. Yet there's also a sense in which it's misleading. After the Civil Rights movement, as Mary Waters has detailed, people started rediscovering their heritage. Now we have Irish-American celebrations, Italian-American celebrations, Polish-American fraternities and churches... But if time goes on long enough, \"American\" will become a real identity. And if we don't challenge white supremacy, \"white American\" will remain different from \"African-American\". I'm reminded of the difference between a pidgin and a creole. A pidgin is a combination of languages that people make up for specific instrumental needs: it could be one trade talk, or it could be long-term co-existence. But over time, a pidgin will evolve into a creole, its own independent language that blends and borrows and then starts to develop its own syntax. It can take as little as a generation. American ethnicity right now is a pidgin. But it could truly evolve into a creole. And while the idea that we should rise above identity politics and become truly cosmopolitan might be appealing, it actually has some deeply creepy implications. After all, Tim's wisdom above applies to the loss of identity to nationalization, but it also applies to the loss of identity to globalization. If we lost our names, or our religions, or our food, or our songs, to homogeneity, that'd be a problem. The challenge the human species faces in the 21st century is if we can avoid the twin extremes of homogeneity and discord, and instead arrive at harmony, where different voices and influences coexist to create something greater than the sum of its parts. For all this, though, there is a political side to race as well. People use ethno-racial cleavages to justify violence and to maintain control and domination. In America, whiteness, as well as maleness and straightness and Christianness, has formed a kind of folk community that the rich, who have very different interests from the poor, can identify with and ultimately control. Those with political and economic power do not have the same needs as those without. The poor and powerless would without an ideology of race (and similar ideologies) be able to ally themselves and, as a majority, demand massive changes. The boss needs you, but you don't necessarily need the boss, as the old anarchist slogan goes. This is why it remains persistent. It's just too useful. It gives people who would otherwise be debased a way to come together and imagine that they belong. A poor white family may not have much, but they are American, dammit. And when a Hispanic person comes along, they'd rather have their Americanness than more neighbors who might be able to help them not be poor. A friend of mine pointed out how the need to hold onto relative advantage is magnified when we have massive absolute disadvantage.  As long as there are massive inequities in power and privilege, people will try to come up with ways to bolster their self-esteem, and others will exploit that tendency to maintain those inequities. Between these two phenomena, I think that most of the explanation is clear. ",
            "date": "Answered May 12, 2016",
            "views": "706",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Christian Eidenert",
                    "user_href": "/profile/Christian-Eidenert"
                },
                {
                    "user_id": "Manu Mann",
                    "user_href": "/profile/Manu-Mann-3"
                },
                {
                    "user_id": "William E Donges III",
                    "user_href": "/profile/William-E-Donges-III"
                },
                {
                    "user_id": "Thomas Parker",
                    "user_href": "/profile/Thomas-Parker-23"
                },
                {
                    "user_id": "Vasu Kapoor",
                    "user_href": "/profile/Vasu-Kapoor-1"
                },
                {
                    "user_id": "Hamza Shaikh",
                    "user_href": "/profile/Hamza-Shaikh-3"
                },
                {
                    "user_id": "Kristoffer Greene",
                    "user_href": "/profile/Kristoffer-Greene"
                }
            ]
        },
        {
            "author_info": {
                "name": "Soo J. Oh",
                "href": "/profile/Soo-J-Oh"
            },
            "answer_text": "On many governmental forms, checking off race serves as data-collecting.  The information gathered by census-takers are used for many functions, be it sociology books by think tanks academics, voting drives during election years, or even fighting against racism. As much as I wanted to believe that race blindness would be the answer for racism when I was younger, I am no longer of that mindset.  As an Asian-American, I've seen how not having a strong political identity is actually a detriment in the fight for representation and having a political voice.   One interesting upcoming change on the next census is a new category for Middle Eastern and North African Americans.  Previously, they were categorized as white.  However, Middle Eastern and North African Americans actively lobbied for a category on the census so that they can be accurately counted.  In the political process, one must first be recognized before having one's needs met.  ",
            "date": "Answered May 4, 2016",
            "views": "205",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Matthew Gamble",
                    "user_href": "/profile/Matthew-Gamble-7"
                },
                {
                    "user_id": "Hamza Shaikh",
                    "user_href": "/profile/Hamza-Shaikh-3"
                }
            ]
        }
    ]
}