{
    "title": "Why don’t we see a line, double image, gap, etc. in the middle of our vision when we see with both eyes? - Quora",
    "tags": [
        "Ophthalmology",
        "Eyesight"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Light",
                "href": "/profile/John-Light-2"
            },
            "answer_text": "Q: “Why don’t we see a line, double image, gap, etc. in the middle of our vision when we see with both eyes?” This is a good question, one I have considered several times. The left and right sides of the visual field are definitely projected into the right and left hemispheres, respectively. And there is a clear demarcation between the hemispheres physiologically. The answer is that the the projections overlap. The left hemisphere gets all of the right side of the field of vision plus a small bit of the left side. The right hemisphere gets all of the left side of the field of vision plus a small bit of the right. This overlap requires that the center of vision must be processed redundantly, but the redundancy means that boundary artifacts can be minimized to a level that the brain can ignore. Furthermore, there is evidence that when we are reading and doing other types of detail work, the left hemisphere is doing most of the visual processing, and it primarily attends to the right side of the field of vision so as to avoid latencies inherent in accessing signals from the other hemisphere. By using only one half of the field of vision (from both eyes) for detail work, even minimal boundary artifacts can be avoided. ",
            "date": "Answered October 24, 2020",
            "views": "24",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nataly VanWyngarden",
                    "user_href": "/profile/Nataly-VanWyngarden"
                },
                {
                    "user_id": "Sharon Breivogel-Leonard",
                    "user_href": "/profile/Sharon-Breivogel-Leonard"
                },
                {
                    "user_id": "Steven J Greenfield",
                    "user_href": "/profile/Steven-J-Greenfield"
                },
                {
                    "user_id": "Kostea Frunza",
                    "user_href": "/profile/Kostea-Frunza"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adrian Mudd",
                "href": "/profile/Adrian-Mudd-2"
            },
            "answer_text": "Because both eyes are looking at the same thing, AND they are NOT cameras. They do NOT send pictures to the brain They send information about shapes edges and colours and movement, and because they are a few inches apart and have slightly different view the brain can calculate how far away things are. The brain uses that information to build up a three dimensional ‘model’ in your head of what your eyes are telling you about. That is what you see. Nope ? So do you actually really know how a digital camera works inside? Because that is a whole ballgame simpler than what your brain and eyes does. ",
            "date": "Answered October 22, 2020",
            "views": "23",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Wes Ono",
                    "user_href": "/profile/Wes-Ono"
                }
            ]
        }
    ]
}