{
    "title": "Why does heat kill bacteria? - Quora",
    "tags": [
        "Bacteriology",
        "Bacteria",
        "Microbiology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Liam Crowleigh",
                "href": "/profile/Liam-Crowleigh"
            },
            "answer_text": "“Does heat kill bacteria?” Yes, heat will kill most bacteria. But not all. There’s a class of bacteria called extremophiles. Extremophiles are bacteria and archaea that live in conditions outside of what normal bacteria, indeed outside of what normal living organisms can live in. There are 3 types of extremophiles, thermophiles, those that live in extremely hot environments (above 70° C), acidophiles, those that live in extremely acidic environments (down to a pH of 0) and thermoacidophiles, those that can survive in environments that are both extremely hot and extremely acidic. Extremophiles were first discovered by Thomas Brock in 1966 when he was working at the hot springs in Yellowstone National Park, Wyoming. Until then it was thought that no organisms could live in such hot conditions since most proteins start to denature (start to break apart) and cause the bodily processes to cease when temperatures increase. As a result, most bacteria can’t reproduce above 39°C and die above 49°C. Following Brock’s discovery extremophiles have been found in many regions of more stable volcanic activity such as Iceland, Japan and New Zealand. Microbial Life in Extremely Hot Environments Life in hot springs Thomas D. Brock - Wikipedia ",
            "date": "Answered July 22, 2019",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jay Alexander",
                "href": "/profile/Jay-Alexander-45"
            },
            "answer_text": "The same reason you would die if your body temperature gets too high. Our bodies are meant to perform at an optimal temperature because the cells within our body perform cellular processes perfectly at that temperature. Same goes with bacteria. At high temperatures, proteins degrade and denature and fail to function. Your membrane transport proteins break apart: you can't get things in or out of your cells. You can no longer establish electron gradients for ATP synthesis: your body can no long provide itself with energy. Your ribosomes denature and fail to carry out protein synthesis: you cannot build new cells to replace the dying ones. You are dead. ",
            "date": "Answered February 15, 2017",
            "views": "62",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Galymzhan Zharas",
                    "user_href": "/profile/Galymzhan-Zharas"
                },
                {
                    "user_id": "Curtis Meares",
                    "user_href": "/profile/Curtis-Meares-1"
                },
                {
                    "user_id": "Mahima Setty",
                    "user_href": "/profile/Mahima-Setty-1"
                },
                {
                    "user_id": "Joseph Strain",
                    "user_href": "/profile/Joseph-Strain-8"
                },
                {
                    "user_id": "Louis Regnault",
                    "user_href": "/profile/Louis-Regnault"
                },
                {
                    "user_id": "Nate Leavy",
                    "user_href": "/profile/Nate-Leavy"
                },
                {
                    "user_id": "Cathrine Moale",
                    "user_href": "/profile/Cathrine-Moale"
                },
                {
                    "user_id": "Marijn Verhaeg",
                    "user_href": "/profile/Marijn-Verhaeg"
                },
                {
                    "user_id": "Alexander Wong",
                    "user_href": "/profile/Alexander-Wong-41"
                },
                {
                    "user_id": "Ahmed Zein",
                    "user_href": "/profile/Ahmed-Zein-10"
                }
            ]
        }
    ]
}