{
    "title": "Why does negativity seem more intelligent than positively? - Quora",
    "tags": [
        "Negativity (personality trait)",
        "Optimism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Linda Rudolph",
                "href": "/profile/Linda-Rudolph"
            },
            "answer_text": "I’ve read the other responses and, frankly, I’m both amazed and saddened. Why do you feel that negativity is more intelligent? If by negativity you mean criticism, then I guess I can sort of understand. But to me negativity is more synonymous with looking at the bad side of things as opposed to looking at the positive. In other words it’s pessimism and I think that’s far removed from anything or anyone I’ve ever found to be associated with intelligence. To think in a critical way is not being negative. It’s being not as gullible as many others tend to be. I always tell my husband to not believe the things he hears, sees, or reads on TV or in magazines or journals without looking them up further. If it’s a topic that’s important to you it’s worth the extra 30 or so minutes. If you noticed, I included journals because they too can be biased. Often the research is funded by the same people or companies, or even preformed by the same groups in the same labs. Be wary, be critical, even cynical, but not negative. An example is one that happened to me with my niece in college for dental hygiene. She had to do a research paper and presentation on whether or not dental rinses (like Plax) that alleged to prevent or reduce the build up of plaque actually did reduce it. After a couple of weeks of pouring through various journal articles she called me. She was totally stumped. She couldn’t find supporting data in either direction that definitively proved it one way or the other. I asked her to summarize and after she did I saw her dilemma. Some said it worked while others said just the opposite, that it didn’t do any better than warm water. So, we thought, let’s look at it from a different angle. I asked her to look through and separate all the ones that were ‘pro’ (that said it worked), from all the ‘cons’ (that said it was no better than anything else). Once that was done we looked at one other thing: Who funded the research? All of a sudden we started to notice a pattern. Virtually all the ‘pro’ papers were funded by Colgate-Palmolive (the manufacturers of Plax) while the ‘cons’ were funded and run by individuals from various people and labs across the country. It appeared, and pretty clearly too, that the ‘pro’ results were only ‘pro’ because the manufacturers only released those results that backed their product. There may have been hundreds more, the ‘cons’, that were shelved and hidden away because they negated their claims. It actually made for a much more interesting presentation too. (By the way, she got an”A” on that one.) My point is that our ripping through those papers was neither negative nor positive in nature. It was only an attempt to get at the truth in a way that was unbiased and with no preformed opinions about the validity of Plax. At the time, I too was studying biology and biochemistry and it was a real eye-opener to both of us. Virtually all the people I’ve met who were in the science field had one thing in common. Virtually all of them had a great sense of humor and a highly positive outlook and personality. Yes, they were critical in their thinking and their evaluation of any data presented to them, bu they were never what I could be called negative. Not in any sense of the word. I hope that helps, even if only a little. In the meantime, smile! ",
            "date": "Answered January 4, 2017",
            "views": "231",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Julia Alvarez",
                "href": "/profile/Julia-Alvarez-9"
            },
            "answer_text": "It does unfortunately seem that way. From what I have seen, people who focus on the negative (i.e. problems in society, personal life, character, etc.) are often seen as deeper and more intelligent by others. This is often because they are usually critical and analytical of the world around them. It is important to question information presented to us and look at negative consequences of the decisions we make. However, the intelligence that positivity exhibits is unconventional. Negativity deals with the analytical while positivity is more creative. It takes effort to think about the positive, especially when we are constantly flooded with negativity everywhere. People who see negative side are practical and focus on the current. People who see the brighter side of situations think above and beyond what they have. Because the word “intelligence” is often associated with more mechanical and analytical skills, the intelligence that positivity is related to is harder to see, and thus, can be missed by many. Let’s hope that realism, the synergy between the positive and the negative, rises in society <3. ",
            "date": "Answered March 19, 2018",
            "views": "207",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Harshit Madan",
                    "user_href": "/profile/Harshit-Madan-9"
                }
            ]
        }
    ]
}