{
    "title": "Why are most scientists, inventors and entrepreneurs men? - Quora",
    "tags": [
        "Inventors",
        "Scientists",
        "Invention and Inventions",
        "Startup Founders and Entrepreneurs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stephen Round",
                "href": "/profile/Stephen-Round-2"
            },
            "answer_text": "One would think that women would be able to run a Company better than men because they are more conducive to the concept of nuturing. However modern business methodology appear to be little better than barely legitimised piracy freely conducted under invisible letters of marque by persons ….unknown. It seems that personalities such as psychopaths make the best businessmen just as they made up the majority of pirates in days of yore but some of these were women and they were succesful too. As for scientists and inventors the opportunities now available will bring out the brightest in both sexes but it wasn’t always the case. Men do seem to have a much higher incidence of autism which does occassionaly create some outstanding scientists and inventors and a whole milleau of military men too the list of such blessedly cursed and gifted people is very long in the annals of science and World history. In Victorian times there was no such thing as a national curriculum and what was taught was highly variable from school to school and sometimes not considered to be relevent. This melange of multiple methodologies created inventive and ambitious people like First Sea Lord Jackie Fisher and Churchill …Dirac ..Swinton the list is as long as it is wide and deep these people were not cursed by titles such as autistic they were accepted as being part of the system and that was that. Women were always on the outside looking in ..until recently so lets hope our partners … our soul mates can make the World in their image because we need as much humanity as we can find .. ",
            "date": "Answered July 18, 2017",
            "views": "671",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kuldeep Kalia",
                    "user_href": "/profile/Kuldeep-Kalia-3"
                },
                {
                    "user_id": "Bob Malcomb",
                    "user_href": "/profile/Bob-Malcomb-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rahmat Reza",
                "href": "/profile/Rahmat-Reza"
            },
            "answer_text": "Imagine this mate. Women only gain the oportunity on most upper level education on around 60 years ago. Arround 60 bloody years ago. Just a generation ago, women FINALLY properly got into upper level education. Let that sink for a moment. Now think this. How can you invent something without any propper education, methods, facility and resource that mostly, only UPPER LEVEL EDUCATION INSTALATION CAN PROVIDE?. If you know how new scientific discoveries, invention, and theories get introduced and accepted, you will realized that one barrier you must go throught is aproval of your scientist peers. How can you get those aproval if YOUR ENTIRE EXISTENCE IS A DEALBREAKER FOR THOSE BIG WIGS? Also, try do a full domestic work for a while. Commited to it fully. You will realize how BACKBREAKING and EXTREMELY TIME CONSUMING those work was, and it’ll NEVER END. When people pushing the idea that those domestic works are your entire existence, for millenia of human existance, do you think you’ll have time for luxury like Invention or discoveries or enterpreneurship? Think about that for a moment. Here’s my tip: Never so quickly delve into evolutionary psychology bullcrap, that was most of the time hard to understood, controversial, full of unproven hypotheses that get overblown by media, as your fundamental reason to judge people. Reason build on logical fallacy is a fail. ",
            "date": "Answered April 5, 2020",
            "views": "154",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Salami Guadalupa",
                    "user_href": "/profile/Salami-Guadalupa"
                },
                {
                    "user_id": "Baffour Owusu-Ansah",
                    "user_href": "/profile/Baffour-Owusu-Ansah"
                }
            ]
        }
    ]
}