{
    "title": "Why is the plasma membrane important? - Quora",
    "tags": [
        "Membrane Biophysics",
        "Membrane Proteins",
        "Cell Biology",
        "Biochemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Belair",
                "href": "/profile/David-Belair"
            },
            "answer_text": "As others have said, the plasma membrane acts as a selectively permeable barrier separating compartments and organizing the cell and tissue. More importantly though, because of its ability to segregate two compartments, the plasma membrane enables a cell to generate and store energy in the form of an electrochemical gradient, formed mostly through the action of the sodium-potassium pump[1] . The cell uses energy to generate the electrochemical gradients and can later leverage these gradients for processes including active transport. Gradients across the plasma membrane also allow for the generation and propagation of action potentials in neurons[2] .    Footnotes[1] Primary Active Transport - Boundless Open Textbook[2] Ch 1 - 6 - Biological Sciences 435 with Pendergrass at University of Kansas - StudyBlue",
            "date": "Answered March 22, 2016",
            "views": "47",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Robin Corey",
                    "user_href": "/profile/Robin-Corey"
                },
                {
                    "user_id": "Anireddy Venkat Reddy",
                    "user_href": "/profile/Anireddy-Venkat-Reddy"
                },
                {
                    "user_id": "Utkarsha Khadka",
                    "user_href": "/profile/Utkarsha-Khadka"
                },
                {
                    "user_id": "Vasuretha Chandar",
                    "user_href": "/profile/Vasuretha-Chandar"
                },
                {
                    "user_id": "Christopher VanLang",
                    "user_href": "/profile/Christopher-VanLang"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Sampson",
                "href": "/profile/Robert-Sampson-12"
            },
            "answer_text": "Cell membranes contain and protect the contents of the cell.They are active in signaling other cells, and proteins embedded in their matrix regulate the cell's chemistry by selectively absorbing and secreting chemicals. Many single-celled organisms, such as amoebae, use their flexible membranes for locomotion and food gathering. ",
            "date": "Answered March 22, 2016",
            "views": "12",
            "upvotes": "0"
        }
    ]
}