{
    "title": "Why isn't linguistics considered STEM? Many of the fields within the study have to do with the effect of language on the brain (ex. psycholinguistics, neurolinguistics, etc). If psychology is considered STEM, shouldn't linguistics be too? - Quora",
    "tags": [
        "Neurolinguistics",
        "Women in STEM",
        "Psycholinguistics",
        "Linguists",
        "Education in STEM",
        "Human Brain",
        "Linguistics",
        "Neuroscience",
        "Language",
        "Studying"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nick Picard",
                "href": "/profile/Nick-Picard"
            },
            "answer_text": "As far as I know, there isn’t a central global committee that says which subjects are STEM or not. If you think your linguistics degree should count as STEM, just start saying you have a STEM degree. If people challenge you on it, make your case. You run the risk of their disagreeing, of course. Linguistics is incredibly broad. During my 4-year undergraduate degree in linguistics, I did exactly one (1) statistical regression, and I got a C in that course. My program was not very scientific. I was totally focused on the philosophical implications of language and how language interacted with logic, meaning, and thought. It would be bizarre for me to claim I have a STEM degree. Meanwhile, my closest friend in school was dual-majoring in Computer Science. He mostly took courses that helped his research into AI for natural language processing (NLP). It would be totally silly to say he didn’t have a STEM degree. So if you paint all linguistics undergrads with the same brush, you will get it wrong for some students. Two solutions: Develop a system to decide which linguistics students are STEM majors and which aren’t based on their course selection and approach to assignments; orSimply stipulate that Linguistics on its own is a liberal arts major, as it was historically, but you can call it a STEM major by dual-majoring in psychology, computer science, statistics, biology, or any other scientific field closely related to linguistics.Solution 2 is what’s currently in place. It would be a big cultural change to replace it with solution 1 everywhere, and I don’t see what the advantage would be. ",
            "date": "Answered August 10, 2020",
            "views": "53",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Estefanía Lescaille",
                    "user_href": "/profile/Estefanía-Lescaille"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Daland",
                "href": "/profile/Robert-Daland"
            },
            "answer_text": "The important thing is to ask whether a degree is preparing you for your chosen career. Not everyone agrees that Psychology is a part of STEM. The S in STEM stands for science, but I think for many people it really is exclusive to the hard sciences. Psychology is a social science. I myself am all in favor of classifying social sciences as science (since they follow the scientific method), but anyways it’s obvious that science focusing on human behavior specifically needs to be a lot more humanistic than, say, astrophysics. As others have remarked, Linguistics is quite broad. Some sub-disciplines, such as formal language theory, are actually branches of mathematics. Others, such as sociolinguistics, may have variable relations to math but necessarily involve a lot of humanities. Philology, historical linguistics, and anthropological linguistics are inherently humanistic, because they deal with how cultures interact with their languages, and vice versa. So with all that said, maybe linguistics should count as STEM. But what is most important is, is it preparing you for what you want to do after? ",
            "date": "Answered August 10, 2020",
            "views": "45",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Estefanía Lescaille",
                    "user_href": "/profile/Estefanía-Lescaille"
                },
                {
                    "user_id": "Wenke Adam",
                    "user_href": "/profile/Wenke-Adam"
                }
            ]
        }
    ]
}