{
    "title": "Why do we use helium in balloons? - Quora",
    "tags": [
        "Helium Balloons",
        "Helium"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tushar Bharti",
                "href": "/profile/Tushar-Bharti-5"
            },
            "answer_text": "Helium is used in balloons because hydrogen is dangerous and causes severe problems like it escapes into the upper atmosphere and depletes ozone layer by forming freons .Also it ignites even with the slightest heat on coming in contact with the atmosphere .It is also typical to collect and store hydrogen and also very expensive. Hydrogen being very lighter escapes suddenly into atmosphere.Therefore because of several issues helium gas is preferred over hydrogen gas in balloons which is also very light and have almost similar properties as that of hydrogen. ",
            "date": "Answered May 22, 2017",
            "views": "11",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kumar Shiveshwar",
                    "user_href": "/profile/Kumar-Shiveshwar-3"
                },
                {
                    "user_id": "Shahid Idris",
                    "user_href": "/profile/Shahid-Idris-2"
                },
                {
                    "user_id": "João Gama",
                    "user_href": "/profile/João-Gama-6"
                },
                {
                    "user_id": "Tanishk Chauhan",
                    "user_href": "/profile/Tanishk-Chauhan"
                },
                {
                    "user_id": "Khushi Lalit",
                    "user_href": "/profile/Khushi-Lalit"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shahid Idris",
                "href": "/profile/Shahid-Idris-2"
            },
            "answer_text": "Though helium is a little expensive gas, we prefer using helium gas for balloons. This because it is much safer for children and kids. It prevents the explosion and does not catch fire easily. Whereas hydrogen is the lightest element in the earth, catches fire easily. It is not much safer to use in ballons. Since helium gas, is lighter than air balloons float in the air and make the parties and occasions a special one for your lovable ones. ",
            "date": "Answered March 1, 2019",
            "views": "157",
            "upvotes": "0"
        }
    ]
}