{
    "title": "Why did it take humans so long to evolve meaningful technology? - Quora",
    "tags": [
        "The Human Race and Condition"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Akridge",
                "href": "/profile/Robert-Akridge"
            },
            "answer_text": "At the first level of community development and control we find the sheriff, the Preacher and the Banker. At the next level of community we find a grocery store, a drug store and a hardware store. By the beginning of the 21st century, the softwarestore had not only found its place but was taking market share from previously established community entities. Human beings had not only found technology but technology had found us. A small percentage of humans have begun to recognize that if they do not manage technology, technology will manage them. A new field of study has developed which calls itself Techno-philosophy--How to optimize the positive effects of technology and minimize the negative effects? I think the reason it is taking humans so long to recognize technology and the importance of managing technology is related to the larger question of why we tend not to recognize our own culture, against the back drop of an array of world cultures.I developed a workshop on Diversity Training for human service workers and their main take away from being exposed to different cultures was...\"You mean we have one too? At a deeper level, awareness of an array of cultural differences reinforcesthe fact that there are no essential human difference among us. The things that makes one human are universal across the species. Using and improving existing technology is part of what makes us human. ",
            "date": "Answered July 5, 2016",
            "views": "540",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aravind Ravichandran",
                "href": "/profile/Aravind-Ravichandran-4"
            },
            "answer_text": "I can relate to what you've meant by \"meaningful technology\", though technology have always been there through the ages. Please bear with me if the answer goes a bit lengthy, but I'll try to be as brief in elaborating the human history. Advancement in technology has never been stopped at any point of time, but has seen lots of hindrances that slows down its development. Technology doesn't just bloomup at a single point of time, but it builds itself over the pre-existing technologies. Why did primitive man remain primitive for such a long period of time? Though modern humans evolved two lakh years ago, it took them almost till 60000 years back to completely eliminate the neanderthals, or other forms of homninis for that matter. Primitive man never had a permanent settlement. Their technology was very minimal, such as the weapons made out of twigs and branches, invention of fire etc... But that didn't really differentiate him from animals. Permanent settlement will provide meaningful permanent technology.No substantial increase in population as they get killed by animals or other humans.No distinct language.No requirement of writing. Permanent settlement will require the necessity of passing on the information to the future generations.Thus acquired knowledge and technology died then and there.Men began to differentiate himself from other animals only when he began to produce. Production is the most substantial step towards development in human's history. Know these following two important terms. Means of production -( land, technology, raw materials, human labour etc)Forces of production - (tends to relate with their property relations, i.e- primitive communism, slavery, serfdom, capitalism, communism, etc..)The dialectical relationship between the above two, influences almost every aspect of humans life, social institutions like religion, political ideologies, humans ideology etc. For instance, the primitive man (70000-64000 years ago) never had any substantiate technology. They were nomads who ate from trees wherever they find. No big social setup, no inequality, no male-female inequality and the Forces to production was Primitive communism here. But when he began to settle down permanently on lands to carry out settled agriculture, that's when men began to dominate fellow men to work on their lands. Slavery was born. Slaves need to be coerced to work, they are forced to serve. Several centuries later, with the technological advancements, these slaves were expected to have some interest to learn them. Will you have interest if you are coerced? No, right! So this slavery was changed to serfdom. Serfs were given little freedom than slaves. They can now have their own families, landlords gave a little land to the serfs for their own production, kind of incentives were provided. Producers now formed guild (associations) were they could sell by themselves and take care of their needs. But with the rise of merchants (middlemen who stood between the producers and market), guild system slowly began to fail. And with several historic factors like the discovery of route to south-asia, discovery of America, failure of crusades etc,.. gave birth to Captitalism. Capitalism as far as now, is the king of technological advancements. Though it had lots & lots of negative impacts on society, it also had positive impact on technological innovations. But why did i tell all these stories of human history of production? Because, according to marx the means of production and the forces of production are the two very aspects that influence all the social ideas, be it Religion, politics, education, human thinking etc. I would say, religion is the most important aspect that structured the society. Religion Religion has been through several forms and structures through human history. Religion and politics has been hand in hand throughout history. Religious leaders were also the political leaders, and religious beliefs is what framed the education, social stratification etc. According to august comte, theological ideas has been the human ideas ever since. Initial religions were fetishism (includes naturism, animism, totemism, etc..), then came polytheism (belief in several gods), then monotheism (single god belief), then metaphysical thinking which has been platform for reasoning and increase in secularism, which opened many hurdles for scientific thinking. Religion has controlled any free thinking and people who were open minded or spoke up against the religion were always executed and burnt in the name of god. You can find such instances happened even before the birth of Jesus, even in Greeks which happened to be the place of initial intellectual development. Religion controlled state, thus education, superstitions limited human thinking and thus technological development. But Religion was also responsible for advanced technological development! - With the reformation and the birth & rise of Protestatism, where martin Luther's belief on 'beruf' - calling and calvinist beliefs of 'predestination' made several countries to convert to Protestatism. And these beliefs made them work and work so much on the occupation, in the name of god, which was the most important factor responsible for the rise in capitalism. Capitalism gave way for increase in technological advancement in very short span of time. Thousands and thousands of industries bloomup, goods were produced in extremely large amount, researches were made to improve technologies so as to compete with the fellow competitors. It was not the people who really were interested in developing new technologies, but it was the capitalistic system that demanded improvement in existing technologies, so as to sustain in the Market. ",
            "date": "Updated October 29, 2016",
            "views": "904",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ahmed",
                    "user_href": "/profile/Ahmed-1452"
                },
                {
                    "user_id": "Stefan Erhardsson",
                    "user_href": "/profile/Stefan-Erhardsson"
                }
            ]
        }
    ]
}