{
    "title": "Why must a hypothesis theory be falsifiable? - Quora",
    "tags": [
        "Falsifiability in Physics",
        "Statistical Hypothesis Testing",
        "Hypotheses"
    ],
    "response": [
        {
            "author_info": {
                "name": "Fred Civish",
                "href": "/profile/Fred-Civish"
            },
            "answer_text": "A Hypothesis is an IDEA. Hopefully, an idea based on actual observations of fact. But it is JUST an idea, and relatively worthless, until or unless it is tested, over and over, and it accumulates more evidence and facts and data behind it. That is why it must be falsifiable. Falsifiable just means TESTABLE. If you can’t test it, then a hypothesis might be ‘interesting,’ but it is pretty worthless. It might be an idea that is TRUE, or it might be untrue, but you can’t know unless you can test it. The testing - the falsifiability - DOES NOT PROVE the Hypothesis, or make it real. But it can FALSIFY it and DISPROVE it. The more often you test it and the more it withstands that testing and IS NOT FALSIFIED, then the more dependable the Hypothesis becomes. Once it has enough evidence behind it, and has been tested and tested and has accounted for all the data and has NOT been disproven by the data, then the Hypothesis might eventually graduate to the level of a THEORY. A Theory is a Hypothesis that has been tested and tested and found to work. A Hypothesis might be a NEW idea. But a Theory is not new. A Theory does not DISCOVER something. A Theory explains something that has already been discovered. Darwin did not ‘discover’ evolution. Evolution is simply heritable change in a population. Evolution had been observed and commented on for thousands of years, but nobody could figure out how it worked. Until Darwin came up with his Theory of Natural Selection, which eventually was modified to become the Theory of Evolution. Theories CAN be modified. If we get new data, such as information about GENES, which were unknown during Darwin’s time, then the theory can be expanded to accommodate that. If the data DISPROVES the Theory, then the theory MUST be either expanded or modified to account for this data that disproves it (FALSIFIES it) or else it will then be replaced by a better theory. The Theory of Evolution has withstood these tests for 160 years. EVERY SINGLE DAY, experiments are published where someone attempted to falsify something about evolution. And Evolution still stands. So, a Hypothesis is an Idea, but it is not a Theory, because it doesn’t have enough evidence. If enough attempts are made to falsify the Hypothesis and it is NOT falsified, then, after this happens enough, it can become a Theory. ",
            "date": "Updated October 15, 2020",
            "views": "20",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Darryl Wagoner",
                    "user_href": "/profile/Darryl-Wagoner"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Spencer",
                "href": "/profile/Paul-Spencer-56"
            },
            "answer_text": "The hypothesis stage of the process is where you prepare your idea for testing against reality. The entire purpose of theory is to help us understand reality and know how to expect it to behave, so if our ideas are at odds with reality then they will give us a misleading expectation of how reality is going to behave. So the aim in constructing a hypothesis is to distil the idea down to the precise step forward that it hopes to make in our model of reality, and to provide a means for distinguishing between a world where our model is right and one where it's wrong. The testing phase then goes into the world and makes observations that will be used to assess whether it's more likely that the reality we're observing is in keeping with the model or at odds with it. If a hypothesis isn't falsifiable, that merely means that it hasn't been constructed to achieve this purpose, so it's not a well formed hypothesis and doesn't advance our knowledge. Q: Why must a hypothesis theory be falsifiable? ",
            "date": "Answered October 12, 2020",
            "views": "25",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Paul Meyer",
                    "user_href": "/profile/Paul-Meyer-191"
                },
                {
                    "user_id": "Eric Bolden",
                    "user_href": "/profile/Eric-Bolden-1"
                },
                {
                    "user_id": "Derek Mathias",
                    "user_href": "/profile/Derek-Mathias-3"
                },
                {
                    "user_id": "Gautam Khanna",
                    "user_href": "/profile/Gautam-Khanna-32"
                }
            ]
        }
    ]
}