{
    "title": "Why do we use an umbrella on rainy days? - Quora",
    "tags": [
        "Rainy Day Activities",
        "Why Do We X?",
        "Umbrellas",
        "Rain"
    ],
    "response": [
        {
            "author_info": {
                "name": "Armanos Arman",
                "href": "/profile/Armanos-Arman"
            },
            "answer_text": "Yes, I don't get it either. Your bottom half is going to be soaked when you use an umbrella unless it’s a very light drizzle. You also have to hold the umbrella against the wind so that means covering your sight unless the wind is blowing against your back. This could be dangerous. I remember this one incident, I felt bad but it was funny. The wind is blowing and it was raining. This guy holds the umbrella in front of him so he can’t see the taxi about to drive into the puddle on the side road. He hears the hoot of the taxi and lifts the umbrella up to see and the taxi drives into the puddle. He was entirely soaked. I guess you need a training course in making an umbrella useful in the rain. I have raincoat pants and top. The top has flexible peak cap structure that keeps some of the rain out. It also has drawstring so that it can be pulled tightly around the face. So only face gets wet and that can be dried. I’ve added in a zip at the ends of the legs so that I can zip it tightly around my shoes. So if I step into a puddle my pants won’t get wet. Looks weird through but I am dry. ",
            "date": "Answered June 29, 2018",
            "views": "33",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Moba Yumkaibam",
                    "user_href": "/profile/Moba-Yumkaibam"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shannon Gledhill",
                "href": "/profile/Shannon-Gledhill"
            },
            "answer_text": "We have these wonderful, portable devices called ‘Umbrella’ that are designed to keep the rain off your head and clothes as you are outside. Umbrellas the only thing which you we can use for saving us from rain. In the market for an umbrella that won't let you down in a downpour, we've got your back. Umbrellas boasting windproof builds and lifetime warranties, and even some that double as self-defense tools, are all available. ",
            "date": "Answered May 16, 2017",
            "views": "69",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Moba Yumkaibam",
                    "user_href": "/profile/Moba-Yumkaibam"
                },
                {
                    "user_id": "Mou Sumi",
                    "user_href": "/profile/Mou-Sumi-4"
                }
            ]
        }
    ]
}