{
    "title": "Why do oxygen and hydrogen (two gases) form a liquid when they combine? - Quora",
    "tags": [
        "Properties of Water",
        "Liquids",
        "Hydrogen",
        "Oxygen",
        "Water"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alan Marble",
                "href": "/profile/Alan-Marble"
            },
            "answer_text": "That's a good question, as it certainly seems counterintuitive that combining two gases could make a liquid! To understand the answer you need to understand the differences between solids, liquids and gases.  There are a number of different types of chemical bonds that can hold molecules together; for the sake of brevity I won't go into them here, but Chemical bond is an excellent Wikipedia article that describes the different kinds of bonds.  It is sufficient here to say that the different types of bonds have varying strengths; some are stronger than others. In any material, there's a constant \"battle\" between these bonds and the kinetic energy of the individual molecules - the bonds try to keep the molecules together, while the kinetic energy tries to separate them.  In a solid, the bonds are strong enough to keep the molecules firmly in place, connected to one another, and overcome the kinetic energy.  In a liquid, these bonds are weaker, and are constantly being broken and reformed as the molecules move around - not strong enough to keep them in place, but strong enough to keep them from flying away.  In a gas, there are no bonds, or they are weak enough that the molecules are free to move about. That explains why things can melt and boil.  Add enough heat (energy) to ice and it overcomes the ability of the bonds to hold the molecules in place.  Add more heat to the water and it overcomes the ability of the bonds to hold the molecules together at all, and it evaporates into steam.  Cool it down (remove the energy) and the bonds are once again strong enough to hold the molecules together once again. So how come hydrogen and oxygen are gases, while water is a liquid, at room temperature?  Both hydrogen and oxygen create diatomic molecules, where one H atom binds to another, single H (or O to O) to form H2 (or O2).  There is not sufficient attraction between individual H2 or O2 molecules to overcome their kinetic energy at room temperature, and they remain gases. The shape of an H2O molecule is bent at an angle rather than being a straight line, like a V with oxygen at the point and a hydrogen at each end.  While the molecule has no net charge, the shape of the molecule means that the point has a slight negative charge, while the ends have slight positive charges, think almost like a bar magnet.  There is, therefore, a slight attraction between the \"point\" of one molecule of water and the \"end\" of another molecule of water.  This attraction is referred to as a hydrogen bond and is sufficiently strong to overcome kinetic energy at room temperature and make water a liquid. ",
            "date": "Answered January 22, 2015",
            "views": "129",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Valitsarin Pattanaprommas",
                    "user_href": "/profile/Valitsarin-Pattanaprommas-1"
                },
                {
                    "user_id": "Mohuya Gupta",
                    "user_href": "/profile/Mohuya-Gupta"
                },
                {
                    "user_id": "Sudha Divakar",
                    "user_href": "/profile/Sudha-Divakar"
                },
                {
                    "user_id": "Kevin Gillette",
                    "user_href": "/profile/Kevin-Gillette-5"
                },
                {
                    "user_id": "Chris Reed",
                    "user_href": "/profile/Chris-Reed-65"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Greg-296"
                },
                {
                    "user_id": "Jayesh Menon",
                    "user_href": "/profile/Jayesh-Menon-11"
                },
                {
                    "user_id": "Greg O'Toole",
                    "user_href": "/profile/Greg-OToole-3"
                },
                {
                    "user_id": "Curt Tricarico",
                    "user_href": "/profile/Curt-Tricarico"
                },
                {
                    "user_id": "Angela Brown Sutherland",
                    "user_href": "/profile/Angela-Brown-Sutherland"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tonka S",
                "href": "/profile/Tonka-S"
            },
            "answer_text": "Actually, the answer to this question is much simpler than one may think. All you need to know and understand are the basic properties of each of the phase states (gas, liquid and solid). Intuitively, solids are hard because of the molecules forming it are stacked closely together thanks to the strong intermolecular forces that hold them together. Those forces in liquids are less strong and in gases, they are almost nonexistent. Now, before oxygen and hydrogen become gases they are in form of atoms. Two atoms of oxygen form O2 molecule which is a gas, and the same thing happens with hydrogen forming H2. Since it’s the two same atoms coming together, they have the same electronegativity which means they both attract shared electrons with the same force. That’s not the case in heteroatomic molecules, example of which is water. Water is consisted of two hydrogen atoms and one oxygen, all of which are connected with covalent bonds. In a polar H20 molecule, there is an evident distribution of charge since oxygen is more electronegative and will pull the electrons closer to its atom while also having two free electron pairs. Although a permanent dipole, water molecules form hydrogen bonds with each other (because they’re stronger than dipole-dipole bonds). Both hydrogen bonds and dipole-dipole attractive forces are stronger than those in oxygen or hydrogen molecules where there is a symetrical charge distribution (and no way to form hydrogen bonds), but since there is not an actual charge of atoms, they’re not the strongest posible which is the case in solids. If you want to know more about the intra- and intermolecular forces, I recommend searching the internet or going to the library. Peter Atkins’ General chemistry is a go to :-) ",
            "date": "Updated February 7, 2018",
            "views": "29",
            "upvotes": "0"
        }
    ]
}