{
    "title": "Why does air exist? - Quora",
    "tags": [
        "Air",
        "Heating, Ventilation, and Air Conditioning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Basil Smith",
                "href": "/profile/Basil-Smith-5"
            },
            "answer_text": "The Classical Elements typically refer to the concepts in ancient Greece of: Earth, Water, Air, Fire, and Aether, which attempt to explain the Nature and Complexity of all Matter in terms of Simpler Substances. However, when considering the question of why does Air exist, we are asking a very fundamental question about existence itself which the Early Civilizations contended with and came up with the Four and then Five Elements: Earth, Water, Air, Fire, and Aether --as being the Basis of all Matter and Life. Air is essential for the existence of Sentient Matter as man’s search for another planet on which to establish a Human Colony the essential life sustaining requirements are the existence of Air and Water basically. Air is the transmission medium for our Acoustic System upon which Sound depends. Air is also responsible for the transmission of heat and in the maintenance of an ecological balance including the changing of Seasons and Climate. Air is as essential to Life as is Water and therefore when we ask the question as to why Air exists, we might as well ask the question why does Water exist or any of the other Elements as such and finally culminating in the ultimate question, “Why does Man or Life exist”? Furthermore, If you consider that this latter question is for some reason superfluous, then one can proceed further by then stating that, “As Man or Life came into existence, so did all the other things that existed naturally before, contemporaneously with or after Man or Life”. ",
            "date": "Answered March 8, 2018",
            "views": "624",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joe Cano",
                "href": "/profile/Joe-Cano-5"
            },
            "answer_text": "Because “God want us to exist…” We need air to exist… ",
            "date": "Answered March 7, 2018",
            "views": "88",
            "upvotes": "0"
        }
    ]
}