{
    "title": "Why should I watch Star Trek? - Quora",
    "tags": [
        "Star Trek (creative franchise)",
        "Science Fiction (genre)",
        "Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Timothy Ellis",
                "href": "/profile/Timothy-Ellis-4"
            },
            "answer_text": "Star Wars is grand adventure in a movie style. Makes you feel good while you watch it, but that’s all there is. Light and Fluffy sci-fi for the non-thinker. Doctor Who was originally long winded drama, taking human values out to the cosmos and exploring what you could do with them, by looking at how an alien interacts with humans. After the break, New Who brought the production down from long series to 1 hour episodes, but continues to look at human values through the eyes of an alien. Star Trek started out as that old Oregon Trail, only in space. Roddenberry couldn't sell it as anything but wagon train to the stars. But at its core, its an exploration of the human condition, thrust into the future, with explained tech, and lots of drama. The characters are real, fallible, and likeable or hate-able. Honestly, if you like Doctor Who, you should like Trek. Now, the first season of each version of Trek, needs to be waded through. First up in chronological order, is Enterprise, but it was made last. Bit slow like all of them to get really going, but by the end of season four you will be wondering why some idiot cancelled it 3 years too early. The first season of The Original Series, is badly dated, and lacks a certain coherence. But this was the 60’s, and no-one really knew where the show was going that year. Seasons 2 and 3 have some of the great gems of Trek. They only did 1 season of the animated show, but it starts where TOS stopped, and its pretty good, in a cartoony way. Watch Tos and animated, then watch the 5 five movies. The movies feel a lot like Star Wars does, and should give you the same sort of buzz. Next Generation starts the whole thing again some 80 years in the future. The tech is really good, and still stands up now. But its first season is all about introducing everyone and everything, as they always are. Its season 3 before things really start to click, and after that, its really good viewing. Now you watch movies 6 to 9. Deep Space Nine was spawned off from NextGen season 6. Again, its first season is something to wade through, and 2 & 3 are nothing special. But when a character from NextGen arrives at the beginning of season 4, the show kicks into high gear, and is essential watching to the end. DS9 is different, being based on a station instead of a ship, but they get the ship as well in season 3. Its also darker, and from 4 on, its all overshadowed by the Dominion war. Voyager was spawned from Deep Space Nine, also in season 6, and is fairly consistent all the way through. imo. Now you watch movie 10. As far as watching is concerned, Wars is a short view. Trek is a marathon, the same as Classic Doctor Who. New Who, with 9 short seasons out, is starting to become a marathon. Trek seasons mostly did 26 episodes. Who 13. Wars 1 every 3 years and then take a long break. If you like your sci-fi light and fluffy, stay with Wars. If you like to immerse yourself in a universe, you’ve been missing out by not watching Trek in all its forms. One comment about Trek which can be made is Roddenberry had a vision of where he wanted the show to go. It shines through TOS and the first 5 seasons of NextGen, and to a certain extent, hamstrings the show. After his death, the shows all took off with the brakes removed, so to speak. Roddenberry was all about exploring the human condition, and this didn't always make for compelling sci-fi. But he laid a foundation which was later proved to be very solid. If you really cant stand to watch TOS, at least what Trouble with Tribbles, so you will understand whats going on in DSN’s Trials and Tribilations, which is one of the best episodes done. imo. 2020 Edit: Discovery now slots in after Enterprise, but before TOS. 2 seasons in this time line, and then jumps way after movie 10. The 3 reboot movies are set after movie 10, but change everything to an alternate timeline. In terms of watching Trek is concerned, these are optional, and imo, not really Trek. A reboot which failed to gain enough acceptance, and left behind by Discovery which began after the 3rd movie. Discovery has some influence from the these movies though. ",
            "date": "Updated July 18, 2020",
            "views": "17",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Eric Njuki",
                    "user_href": "/profile/Eric-Njuki"
                },
                {
                    "user_id": "Tjboy Drago",
                    "user_href": "/profile/Tjboy-Drago"
                },
                {
                    "user_id": "Anmol Sharma Don",
                    "user_href": "/profile/Anmol-Sharma-Don"
                },
                {
                    "user_id": "Alexandra Hutter Nordwall",
                    "user_href": "/profile/Alexandra-Hutter-Nordwall"
                },
                {
                    "user_id": "Oather Taylor",
                    "user_href": "/profile/Oather-Taylor"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kelli Halliburton",
                "href": "/profile/Kelli-Halliburton"
            },
            "answer_text": "I think I might have some inkling of why you might prefer Doctor Who and Star Wars over Star Trek, and it’s something that actor Chris Pine has talked about in the context of recent Star Trek movies, and why they differ from the episodes of the original TV series. In most episodes of Doctor Who, the TARDIS lands, the Doctor jumps out, and they get shot at, the companion gets kidnapped, or they’re in some really weird odd environment—the story starts right away. In Star Wars movies, we’re thrown right into some sort of action the moment after the perspective crawl fades out. Star Trek almost always takes a (comparatively) long time to get to the meat of the story. Star Trek is about an organization known as Starfleet that has both a military and exploratory mission for a political entity composed of many planets and beings known as the United Federation of Planets (“the Federation”), and the various crews of various ships, scattered throughout the galaxy, and over the course of about two and a half centuries. The various series in the order they were produced are: the original Star Trek, known as “The Original Series” (TOS), set in the mid 2260s, and produced in the mid 1960s; Star Trek: The Animated Series (TAS), set immediately following the third season of TOS with the same characters, and produced in the early 1970s; Star Trek: The Next Generation (TNG), set in the 2360s, and produced in the late 1980s and early 1990s; Star Trek: Deep Space Nine (DS9), set in the late 2360s and into the 2370s, produced overlapping with TNG starting from TNG’s season 6; Star Trek: Voyager (VOY), set in the 2370s, produced starting after the final season of TNG; and Star Trek: Enterprise—titled simply Enterprise for the first two seasons, which is set in the 2150s and shows the formative years of Starfleet, and produced starting after the conclusion of VOY. The first six movies (and the first few minutes of the seventh) are based on TOS, and feature those characters and actors, but set later, around the 2270s and 2280s. The seventh through tenth movies are based on the TNG series, featuring those actors, and following on almost immediately following the conclusion of the TV series. The last two movies have been based on the TOS characters, but set in a new timeline created at the beginning of the tenth movie, and at an earlier point in their lives, so they are played by different actors. These movies have been produced at a rate of about one every two to three years, staring in 1979 through today. There is a 13th movie set to be released fairly soon that follows in the same timeline as the most recent two. There is another TV series being produced for exclusive release on an online pay streaming service run by the company that owns the television rights to the property, CBS; at this time, it appears that it will be set in the original timeline, but it is not clear at what point in that timeline. The series TOS, TAS, TNG, VOY, and ENT deal with exploration; of the four, only VOY is not set aboard a ship named Enterprise. It is also set in a far corner of the galaxy, where the ship Voyager is thrown in the premiere episode, and the premise of the show involves the exploration along with the primary mission of the crew to get back home, a trip that under the typical speeds available to their technology would take a minimum of 75 years. The other three series are, as mentioned, set aboard various ships named Enterprise, and the crew’s adventures in exploring the galaxy, encountering new cultures and forms of life, and occasionally performing specific missions for Starfleet that usually wind up being more complicated than the mission profile would indicate. DS9, on the other hand, deals with an outpost far from Earth (the titular Deep Space 9 space station), not far from the frontier of another civilization, and next to a wormhole that allows passage to a remote part of the galaxy. Later seasons deal with conflict that arises between the beings on both the other side of the frontier and the other side of the wormhole. What I would recommend you do is to watch the second, third, and fourth movies—that is, Star Trek II: The Wrath of Khan, Star Trek III: The Search for Spock, and Star Trek IV: The Voyage Home. Watch the TNG episode “Best of Both Worlds” two-parter starting from about 15 minutes into it (if doing visual search, right where the big cube shows up on the screen). Watch the DS9 episode “Favor the Bold.” Watch the final two-part episode of VOY, “Endgame.” Watch the new ‘reboot’ movies. These are the more action-packed parts of the franchise. If you can get into those, then it might get its hooks into you far enough to consider other episodes. Episodes to stay away from (at first): TOS: “Is There in Truth No Beauty?”, “Dagger of the Mind,” “Spock’s Brain”; TNG: “Measure of a Man,” “Encounter at Farpoint,” “Lower Decks”; DS9: “Dramatis Personae,” “Take Me Out to the Holosuite”; VOY: “Course: Oblivion,” “The 37s”; ENT: “These Are the Voyages…”. These episodes can be ‘slow’ or ‘weird’ or just ‘bad’. ",
            "date": "Answered June 27, 2016",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Perry Nein",
                    "user_href": "/profile/Perry-Nein"
                }
            ]
        }
    ]
}