{
    "title": "Why does sound go through walls? - Quora",
    "tags": [
        "Walls",
        "Sound"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steven Walter",
                "href": "/profile/Steven-Walter-12"
            },
            "answer_text": "Let’s start by considering how a drum produces sound. If you hit a drumhead, it will vibrate up and down. The moving drumhead will vibrate the surrounding air by repeatedly pushing it away and pulling it back. The method for how air and drumheads conduct sound are different. The drumhead’s vibrations are periodic stretches and contractions of the drumhead material. In contrast, air conducts sound as very small fluctuations in air pressure. These air pressure fluctuations travel as a wave away from the drumhead, just as jumping into a pool of water will cause waves to move away from the place where the person jumped in. In other words, the vibrating drumhead will transfer some of its the energy and momentum to the surrounding air, and that energy and momentum will travel as a pressure wave through the room. Using this analogy, as sound waves hit a wall, some of the energy and momentum carried by the pressure waves will be reflected back into the room. However, the remainder will be imparted to the wall, causing it to vibrate in sync with the air. (If you want to see this effect in action, turn up your stereo and rest your hand on a window; you should be able to feel the window shake as acoustic pressures waves traveling from your speaker to the window causes the window to vibrate. ) In turn, as the wall vibrates from the sound on one of its side, it will act as a drumhead imparting its energy and momentum to the air on the other side of the room, causing people in the other room to hear the sound from the adjoining room. PS Don’t be afraid to upvote this answer if you liked it. ",
            "date": "Answered March 1, 2017",
            "views": "39",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "MARVEL NEWS",
                    "user_href": "/profile/MARVEL-NEWS"
                },
                {
                    "user_id": "Papp Benjámin",
                    "user_href": "/profile/Papp-Benjámin"
                },
                {
                    "user_id": "Farhad Cool",
                    "user_href": "/profile/Farhad-Cool"
                },
                {
                    "user_id": "Prasad Patil",
                    "user_href": "/profile/Prasad-Patil-37"
                },
                {
                    "user_id": "Syiqah Jasman",
                    "user_href": "/profile/Syiqah-Jasman"
                },
                {
                    "user_id": "Lim Shi Mei",
                    "user_href": "/profile/Lim-Shi-Mei"
                },
                {
                    "user_id": "Sydney Danger",
                    "user_href": "/profile/Sydney-Danger"
                },
                {
                    "user_id": "Shaka Zulu",
                    "user_href": "/profile/Shaka-Zulu-61"
                },
                {
                    "user_id": "James Taylor",
                    "user_href": "/profile/James-Taylor-1213"
                },
                {
                    "user_id": "Amber Pace",
                    "user_href": "/profile/Amber-Pace-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bencarol Mark",
                "href": "/profile/Bencarol-Mark"
            },
            "answer_text": "Whether any form of wave can pass through an object depends on how strongly that wave is reflected, scattered or absorbed. Sound waves are certainly reflected by a wall, otherwise you wouldn't hear an echo from it, but not all the sound is reflected so some travels into the wall.  Enhance the image of your project using Intexa’s Timbascape acoustic fencing range. The uniquely designed palings create a shadow-line effect that is certain to impress. ",
            "date": "Answered March 1, 2018",
            "views": "790",
            "upvotes": "0"
        }
    ]
}