{
    "title": "Why are the sciences separate from philosophy? - Quora",
    "tags": [
        "Analytic Philosophy",
        "Philosophy of Science",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rishi Banerjee",
                "href": "/profile/Rishi-Banerjee-10"
            },
            "answer_text": "The demarcation problem is an ancient issue in the philosophy of science that asks the question: How do we distinguish science from non-science? The short answer is that no solution has been found, but several good heuristics have been developed. The most famous of these is probably Karl Popper's falsifiability criteria: A scientific theory must be capable of being falsified by some observational evidence. This is widely recognized to fail as a demarcation criteria. My favorite reason for this is that the goal of science is to produce a theory that is perfectly isomorphic with reality - a theory whose every prediction turns out to be true. But if we ever did find such a theory, it would be by definition unfalsifiable, since no prediction could possibly falsify it. If his criteria for science makes its end goal unscientific, I'd say that this is a pretty major failure of the part of the criteria! Nevertheless it does capture a good deal of our intuitions about what makes science what it is. My best guess is that like most other human behaviors, there simply is no single clear demarcation criterion that sets apart science from everything else we do. We can, all the same, list features that are typical of the sciences. For instance, science studies empirical phenomena. Simple and elegant explanations are typically valued in science. Falsifiability, verifiability, predictive power and explanatory power are all important in the evaluation of scientific theories. But to your more specific question, what makes science distinct from philosophy? Just as there is no good answer to the question of what exactly is science, I haven't ever heard a satisfying answer as to what exactly is philosophy. But typically, philosophy is not solely concerned with exploring empirical phenomena and is concerned with very broad questions like 'What is the nature of knowledge?', \"What is the fundamental makeup of reality?\", \"What is the nature of our ethical judgements?\", \"What is the relationship between language and meaning?\", and even \"Why are the sciences separate from philosophy?\" ;) Science certainly rests on a foundation of metaphysical and epistemological assumptions (there is an external world, we have access to this external world, there is a rational system for drawing conclusions about the world, this system includes induction, etc etc). As such, some say that science is just a branch of philosophy, but this is also unsatisfying to me (Is the question of why ice floats in water a philosophical question?). I like Daniel Dennett's suggestion along the lines of 'Philosophy is what you are doing before you have figured out the right questions to ask.' That is, philosophy is largely concerned with seeking conceptual clarity and providing a vocabulary that unambiguously expresses our ideas. Once this has been established, philosophy hands the problem over to specialists in science or some other area of human knowledge. If you liked this, I have more writings at my blog here: Rising Entropy :) ",
            "date": "Updated January 28, 2018",
            "views": "382",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stephen Simon",
                "href": "/profile/Stephen-Simon-12"
            },
            "answer_text": "This is an extremely interesting question, and much more difficult to answer than might appear at first. It's particularly interesting because the separation of science from philosophy is relatively recent (in grand historical terms, that is). One of the first few truly astounding philosophers--Aristotle--was fascinated by biology, by observable patterns in the physical world in general. Indeed, one of the deep connections between what we think of today as science and philosophy is the quest for the most fundamental patterns underlying the universe and our interaction with it. The Enlightenment is often thought of as the historical moment when science really took flight, but it's notable that many of the great early \"scientists\" were also engaged with questions that we think of today as \"philosophical.\" And, conversely, some of the most famous Enlightenment \"philosophers\" also made cutting-edge advancements in science. This excerpt from the Stanford Encyclopedia entry on Newton's Philosophy  is so on point that it's worth quoting at some length: << [begin quote] There are historical reasons for resisting the temptation to think of Newton as a scientist. For starters, no such category existed during Newton's day: the category of the scientist—along with that word in English—is a nineteenth century invention. . .  Before the early nineteenth century, people like Newton were called 'philosophers,' or more specifically, 'natural philosophers.' . . The modern disciplines of physics, chemistry, biology and so on had not yet been formed. Philosophers who studied nature investigated such things as planetary motions and the possibility of a vacuum, but they also discussed many aspects of human beings, including the psyche, and how nature reflects its divine creator. [end quote] >> Descartes made significant contributions not only to mathematics but also to optics. Leibniz made important contributions to understandings of force and energy, and famously argued with Newton over such scientific questions as the nature of space (in some respects contemporary science has seemed to vindicate Leibniz rather than Newton). Blaise Pascal was not only a philosopher, theologian, mathematician, but also a noted physicist and inventor. Fast forward to around 1920, when Rudolf Carnap--one of the twentieth-century's most influential philosophers--initially had difficulty getting his dissertation accepted because the Physics department (at the University of Jena in Germany) told him it was too philosophical, and the Philosophy department told him it was too scientific. Of course, in 2016, the fields of physics (or science more generally) and philosophy are miles apart in terms of career paths and how they are widely perceived. The original question asks why this has happened. One could approach that question from many different angles, including, for instance, sociological and economic. To me, the most interest aspects of the question concern the two fields as intellectual disciplines. What are the reasons that they should be treated as such distinct areas of inquiry? While the full story is surely too complex for a single Quora answer, I'll just mention a couple of relevant considerations, one practical and the other intellectual. The practical consideration is that the realm of science became more complex and mathematical. Today, scientific research in fields like particle physics is so intricate and requires such extensive training that it would be extraordinarily difficult to reach the upper echelon in the world of physics and still have time to simultaneously engage in depth with the philosophical literature. The other consideration, though, runs deeper in intellectual terms. This concerns how physicists (and researchers in other fields) perceive their own ultimate task and how that task differs from how they conceive of the very distinctive role of philosophy. Today, many physicists view their job as being fundamentally about: MAKING PREDICTIONS. From that mindset, questions are framed in terms of what we should expect to observe based on certain initial conditions. Science succeeds when it can say: Given X conditions, we can expect to observe Y. Everything is cashed out in terms of observable predictions. Researchers operating from this mindset often will want to dismiss questions that do not concern observable predictions as \"meaningless,\" \"beside the point,\" \"irrelevant,\" or, with tongue somewhat in cheek: \"above my pay-grade.\" The matters ruled out-of-bounds include questions that have the gist of: \"Okay, the observable predictions are all well and good. It's truly wonderful that quantum mechanics has made possible computers, lasers, and other technologies that we can't imagine life without. But what is the stuff of the universe REALLY LIKE?\" For many scientists (and also many twentieth-century philosophers), there is no REALLY LIKE. All there is, is what we can observe. The rest is fantasy. If someone wants to spin a yarn about what's happening when or where we're not looking, have at it--just don't call it science. But for many others, science is not just about making predictions and inventions, but about UNDERSTANDING. To be sure, there are physicists who are deeply concerned with seeking to understand what is REALLY GOING ON in or out there. And there are philosophical schools of thought that have focused precisely on ruling out certain kinds of metaphysical conversations as meaningless. So it's not an intellectual disagreement that necessarily pits scientists against philosophers.  Nevertheless, I think it's fair to say that the intellectual movements that have helped to separate science from philosophy tend to foster hostility to the kind of speculative reasoning (i.e., not empirically testable) that is the bread and butter of a great many philosophers. ",
            "date": "Answered January 15, 2016",
            "views": "17",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mose Cagen",
                    "user_href": "/profile/Mose-Cagen"
                },
                {
                    "user_id": "Akash Mehrotra",
                    "user_href": "/profile/Akash-Mehrotra-11"
                },
                {
                    "user_id": "Michael Curran",
                    "user_href": "/profile/Michael-Curran-33"
                },
                {
                    "user_id": "Emmanuela Louis",
                    "user_href": "/profile/Emmanuela-Louis"
                },
                {
                    "user_id": "Gwydion Madawc Williams",
                    "user_href": "/profile/Gwydion-Madawc-Williams"
                },
                {
                    "user_id": "Chris van der Walt",
                    "user_href": "/profile/Chris-van-der-Walt-1"
                },
                {
                    "user_id": "Michael Gautier",
                    "user_href": "/profile/Michael-Gautier-1"
                },
                {
                    "user_id": "Harry Dewulf",
                    "user_href": "/profile/Harry-Dewulf"
                },
                {
                    "user_id": "Quinn Rusnell",
                    "user_href": "/profile/Quinn-Rusnell"
                }
            ]
        }
    ]
}