{
    "title": "Why do some elements form ionic bonds while others form covalent bonds? - Quora",
    "tags": [
        "Covalent Bonds",
        "Physical Chemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alfred Dominic Vella",
                "href": "/profile/Alfred-Dominic-Vella"
            },
            "answer_text": "It is not the elements that are ionic or covalent but the molecules that they form. Compounds form when there is an energy advantage in doing so and this advantage is usually due to electrons finding lower energy states. These might be on one atom or group of atoms or more or less evenly spread throughout the molecule. An ionic bond occurs when electrons from one atom are donated to another forming two ions. Covalent bonds occur when electrons are more or less shared. Now the most energetically stable orbitals have 2, 8 etc electrons in their outer shell and which depends on the row in the periodic table. Elements near the edge of the table can gain or lose a small number of electrons and get to stability. Others would have to lose or gain 3 or 4 electrons and each electron gained or lost increases the net charge on the atom so the more you need to move the harder it becomes. So in general elements in groups 1, 2, 6 and 7 like to form ionic bonds elements in groups 3, 4, 5 form covalent though 3 and 5 do also form ionic bonds. This is of course an oversimplification and individual energy calculations are needed to predict what actually happens. ",
            "date": "Updated November 22, 2018",
            "views": "43",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sky Finger",
                    "user_href": "/profile/Sky-Finger"
                },
                {
                    "user_id": "Dina Amir",
                    "user_href": "/profile/Dina-Amir-7"
                },
                {
                    "user_id": "Yew Tan",
                    "user_href": "/profile/Yew-Tan-4"
                },
                {
                    "user_id": "Milind Mahāvastu (ಮಿಲಿಂದ್ ಮಹವಾಸ್ತು)",
                    "user_href": "/profile/Milind-Mahāvastu-ಮಿಲಿಂದ್-ಮಹವಾಸ್ತು"
                },
                {
                    "user_id": "Theresa Meyers",
                    "user_href": "/profile/Theresa-Meyers-2"
                },
                {
                    "user_id": "MD Sarwar Azad",
                    "user_href": "/profile/MD-Sarwar-Azad"
                },
                {
                    "user_id": "Meet Kalaria",
                    "user_href": "/profile/Meet-Kalaria"
                }
            ]
        },
        {
            "author_info": {
                "name": "Theresa Meyers",
                "href": "/profile/Theresa-Meyers-2"
            },
            "answer_text": "Very good question. I will approach this from the angle of periodic trends and the defition of covalent and organic. Covalent compounds are formed between two non metal compounds. Those are the elements to the right of the jagged line. (except for hydrogen on the far left). This is the simplified definition. The more complex definition has to do with how the bond itself is formed. If electrons are shared equally or unequally between the two elements so that they form a bond with a shared pair of electrons this is a covalent bond. Now Ionic Bonds are a result of electron transfer and resulting electrostatic attraction. If you have a non metal that wants electrons to complete its outer shell, it will take electrons from a metal to do so. The non metallic element then gains an overall negative charge. The metal that donated the electron gets an overall positive charge. The attraction of positive and negative then forms an ionic formula unit. ",
            "date": "Answered May 31, 2016",
            "views": "53",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ilin Moskovski",
                    "user_href": "/profile/Ilin-Moskovski"
                },
                {
                    "user_id": "Avinash Pandey",
                    "user_href": "/profile/Avinash-Pandey-375"
                },
                {
                    "user_id": "Ebrahim Qamar",
                    "user_href": "/profile/Ebrahim-Qamar"
                },
                {
                    "user_id": "Yash Gupta",
                    "user_href": "/profile/Yash-Gupta-1264"
                },
                {
                    "user_id": "Abhinav Jagetia",
                    "user_href": "/profile/Abhinav-Jagetia-1"
                },
                {
                    "user_id": "Milind Mahāvastu (ಮಿಲಿಂದ್ ಮಹವಾಸ್ತು)",
                    "user_href": "/profile/Milind-Mahāvastu-ಮಿಲಿಂದ್-ಮಹವಾಸ್ತು"
                },
                {
                    "user_id": "Yan Kee",
                    "user_href": "/profile/Yan-Kee-5"
                }
            ]
        }
    ]
}