{
    "title": "Why are some people opposed to making America great again? - Quora",
    "tags": [
        "Patriotism in the United States",
        "Hillary Clinton and Donald Trump",
        "Clinton-Kaine 2016",
        "Hillary Clinton",
        "2016 US Presidential Campaign and Election",
        "US Presidential Elections",
        "Trump-Pence 2016",
        "Donald Trump (politician, business person)",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sandra Wiley",
                "href": "/profile/Sandra-Wiley"
            },
            "answer_text": "Some people are opposed to making America what Trump thinks is great, again. Many of us identify many problems, so I empathize with your concern! I for one, desire a major makeover in our political, business, and legal system. Eg. I believe America would be greater if it did not allow wealthy business people with sociopathic tendencies, to not pay contract workers. (You thought I was talking about Trump, I’m referring to a personal experience of the system ignoring such a crime that happened to me as an independent contractor not being paid and CEO filed the predicted bankruptcy though continuing to rehire and not pay the next group). PLEASE, PLEASE study in detail Trumps ability, or lack there of to follow thru. Do not rely on the marketing image of “The Apprentice”. He is not Superman. This is an unreal Reality Show. But, He is skilled, skilled at “marketing” (some say coning)to a certain group of people. We need repair, and some of what he and other candidates are doing, needs repair. You are part of the “fix”, so research and help us all find better leadership in the next election, if we are still around. ",
            "date": "Updated October 10, 2019",
            "views": "153",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Johnna Kay Zwernemann",
                    "user_href": "/profile/Johnna-Kay-Zwernemann"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shawn Keating",
                "href": "/profile/Shawn-Keating"
            },
            "answer_text": "Because the leftists HATE, hate, hate, with a passion, the best, most exceptional, parts about America- our capitalism, our freedoms, our Christian heritage, being a superpower, our success, our military, our openness, and our God. They felt so close to destroying it all under Obama’s regulations, eagerly anticipating for Hillary to administer the coup de grace to the old America, and institute Euro-socialism for all. Then President Trump had the unmitigated gall to throw all those preparations into the dumpster- setting back their plans by at least another decade. That enrages them as he rebuilt the military, reclaims our superpower status, gets our freedoms back, and he unleashes the power of the American economy to actively overcome the damages done by the previous administration. MAGA stands contrary to every plan they have for more power and domination over the American peoples’ lives. ",
            "date": "Answered October 13, 2019",
            "views": "30",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Michael Riemer",
                    "user_href": "/profile/Michael-Riemer-7"
                }
            ]
        }
    ]
}