{
    "title": "Why does my tap water feel somewhat greasy? - Quora",
    "tags": [
        "Tap Water",
        "Drinking Water",
        "Water"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Chandler",
                "href": "/profile/Tom-Chandler-16"
            },
            "answer_text": "Minerals in tap water change the surface tension of the water that affects the “wetting” affect that makes the skin feel slippery ( maybe slimy?) whne the mineral content of the water is low. Water that feels slimy or silky ( maybe greasy) is common with water that is treated with a water softener. A water softener removes some minerals ( calcium and magnesium) that change the “wetting” charactersitics of the water . It wets and covers your skin to greater extent and behaves like a “better “ lubricant, resulting in a slimy feeling Some tap water is naturally soft without using a conditioner, based on the public water supply. I first noticed this affect from many years ago after I moved to the Jersey shore… seemed like i could never rinse the soap from hair, when in affect, the water was cleaner and just felt slippery. If the softness ( slipperyness) of your water varies throughout the house none of this makes sense to me Read the reference here...Explain the Slimy Feeling With Soft Water ",
            "date": "Answered May 9, 2017",
            "views": "132",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Laura Fuller Glass",
                    "user_href": "/profile/Laura-Fuller-Glass"
                },
                {
                    "user_id": "Sanetha Pirelo",
                    "user_href": "/profile/Sanetha-Pirelo"
                },
                {
                    "user_id": "Veda Mantena",
                    "user_href": "/profile/Veda-Mantena"
                },
                {
                    "user_id": "Wella Binay Buenaobra",
                    "user_href": "/profile/Wella-Binay-Buenaobra"
                },
                {
                    "user_id": "Mark Frikenn",
                    "user_href": "/profile/Mark-Frikenn"
                },
                {
                    "user_id": "Sai M",
                    "user_href": "/profile/Sai-M-74"
                },
                {
                    "user_id": "Xavier Zee",
                    "user_href": "/profile/Xavier-Zee-1"
                },
                {
                    "user_id": "Mike Wyner",
                    "user_href": "/profile/Mike-Wyner"
                },
                {
                    "user_id": "Mark Haberer",
                    "user_href": "/profile/Mark-Haberer"
                },
                {
                    "user_id": "John Tanner",
                    "user_href": "/profile/John-Tanner-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Spaeth",
                "href": "/profile/Jeff-Spaeth-1"
            },
            "answer_text": "First check your pH….basic substances (ie. >7 on pH scale) Basic substances commonly feel slippery…or greasy… Other dissolved solids could also affect the waters’ “feel” as you put it. Water softeners also change the character of dihydrogen oxide. To test your own water for dissolved solids….place a drop on a piece of glass along side a drop of “distilled” H20 as a control….which should nearly be impossible to see after it dries up. Nothing in it, so nothing should be there. ph test paper is better than any pH reader….Controls should always be run. Any reader of pH must have 3 calibrators that must be on hand and must not yet be expired. Then the number read off the screen can be trusted. Grease in a water supply suggests contamination of water source from a gray water take-off system. ",
            "date": "Answered April 2, 2018",
            "views": "73",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bryan Klein",
                    "user_href": "/profile/Bryan-Klein-19"
                },
                {
                    "user_id": "Julissa Herrera",
                    "user_href": "/profile/Julissa-Herrera-14"
                }
            ]
        }
    ]
}