{
    "title": "Why don't we use nuclear fission to boost nuclear fusion? - Quora",
    "tags": [
        "Nuclear Fission",
        "Nuclear Fusion",
        "Nuclear Physics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joel Berson",
                "href": "/profile/Joel-Berson"
            },
            "answer_text": "Fission and fusion are 2 very different processes and have very little to do with each other, bombs notwithstanding. Fission basically splits an atom of uranium by neutron bombardment, resulting in a release of thermal energy, as well as radiation. You need a “critical mass” of uranium to initiate the reaction which occurs in micro-seconds all at once. But it is only controllable if the mass is below critical and some moderating element is used to control the neutron dispersion. Fusion combines 2 hydrogen (or tritium) atoms into a helium atom, which also releases thermal energy but very little radiation. But you need to compress that hydrogen to a point where its temperature gets into the tens of thousands of degrees to initiate the reaction. There is no material known to science that can contain that heat, so a magnetic field, a VERY strong magnetic field is used to compress and contain the reaction. That reaction occurs in pico-seconds, but if some way is found to keep feeding the contained reaction with hydrogen, it can go on continuously. So far that has only been successful for mili-seconds. In a hydrogen bomb, the fusion reaction has enough energy to compress hydrogen into a fusion reaction, but since there is no containment (blown away by the fission reaction) you get a bomb blast…. big time. A controlled fission reaction releases a lot of heat and radiation. The heat is nowhere near what a fission reaction needs, and the radiation has zero effect in that fusion reaction as well. Other than a bomb, the only way a fission reaction could contribute to a fusion reaction is as an electric power generator for the magnetic containment field. ",
            "date": "Answered March 19, 2017",
            "views": "649",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lisa Bezier",
                    "user_href": "/profile/Lisa-Bezier"
                }
            ]
        },
        {
            "author_info": {
                "name": "Warren Williamson",
                "href": "/profile/Warren-Williamson-1"
            },
            "answer_text": "Right now, the only effective way we have to produce fusion is to trigger it with nuclear fission. The effect is further enhanced by encasing a hydrogen weapon in fissile material. This is the concept of any thermonuclear warhead. If you are asking about sustained nuclear fusion for energy production, we are still unable to produce a controlled fusion reaction for anymore than a fraction of a second. In order to do so, we need to maintain the fusion materials under intense temperatures and pressures. If we were to try to do that using nuclear fission, we would need to produce and contain a sustained fission explosion which, I believe, would be problematic. Current fission reactors use highly controlled reactions which release heat at a slow rate, but I do not believe that process would be helpful in providing the conditions necessary for fusion. ",
            "date": "Answered March 19, 2017",
            "views": "173",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dan Cope",
                    "user_href": "/profile/Dan-Cope-1"
                },
                {
                    "user_id": "William Boyer",
                    "user_href": "/profile/William-Boyer-1"
                }
            ]
        }
    ]
}