{
    "title": "Why is studying fundamental science (such as black holes) useful to mankind despite it not having any direct application to date? - Quora",
    "tags": [
        "Black Holes",
        "Science of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marco Pereira",
                "href": "/profile/Marco-Pereira-1"
            },
            "answer_text": "Basic science provides the most stringent requirements both technological and in terms of modeling. In this answer, I explained that astronomy is the reason why your phone has a camera these days. If it wasn’t for Astronomy paying for the first large CCD detectors, we wouldn’t have them used en masse today. Science pays for the initial development of all technologies we use in society. From your microwave oven (klystrons) to your internet (DARPA developed for scientists to communicate), to your phone camera (CCD detectors for astronomy), to transistors used in your computers (miniaturized computers used in space research - Apolo trips to the Moon), etc. In other words, the PEOPLE of society pays for development. The scientists provide the challenges to be tackled. So, scientists provide the motivation, the focus for technologists to work. Society benefits from the outcomes. So, even obscure research like Black Holes has societal outcomes. Remember, Black Holes research uses microwaves amplifiers, oscillators, etc. That is the bread and butter of communications. They also use massive computer calculations, so they pay for the building of cloud computing infrastructure which we will all use at one time or another. So, the role of Science is to develop knowledge. The harder the challenge, the larger the benefit (as a rule of thumb). This doesn’t mean that we should always aim at the almost impossible but that means that we should always keep an eye for what is becoming possible and keep trying it. There is another way for society to evolve and that is through wars. Wars justify spending money on developing new technologies (to kill people). Eventually, some of these technologies might benefit society. That said, the carnage, destruction of Wars is a Con to this approach. In other words, supporting Science is the best investment a society can make, not to mention the fact that it provides a function for the best brains in the general population. In the USA, the politics of grievance tries to toss the less educated against the more educated. This is wrong for many reasons. First, these brainiacs come from the general populace and thus they are your kids, brothers, or yourself. Second, once they are educated, they work for society and pay higher taxes than they would do otherwise (without the education). In other words, a successful society will always value education, expertise, and hard work and understand WHY John Fitzgerald Kennedy (JFK) told us: “We go to the Moon, not because it is EASY, We go to the Moon because it is HARD”  THAT IS HOW IT IS DONE!!! ",
            "date": "Answered October 23, 2020",
            "views": "875",
            "upvotes": " View 18 Upvoters ",
            "upvoters": [
                {
                    "user_id": "J Lafont",
                    "user_href": "/profile/J-Lafont"
                },
                {
                    "user_id": "Aisha Miah",
                    "user_href": "/profile/Aisha-Miah-2"
                },
                {
                    "user_id": "Vaibhav Mittal",
                    "user_href": "/profile/Vaibhav-Mittal-233"
                },
                {
                    "user_id": "Rubén Palma",
                    "user_href": "/profile/Rubén-Palma"
                },
                {
                    "user_id": "Akshaya Sekar",
                    "user_href": "/profile/Akshaya-Sekar-9"
                },
                {
                    "user_id": "Anuraag Godika",
                    "user_href": "/profile/Anuraag-Godika"
                },
                {
                    "user_id": "Aniruddha Bhattacharya",
                    "user_href": "/profile/Aniruddha-Bhattacharya-56"
                },
                {
                    "user_id": "Wladislaw Derevianko (Владислав Дерев'янко)",
                    "user_href": "/profile/Wladislaw-Derevianko-Владислав-Деревянко"
                },
                {
                    "user_id": "Philippe Raymond",
                    "user_href": "/profile/Philippe-Raymond"
                },
                {
                    "user_id": "Diego Arrigoni",
                    "user_href": "/profile/Diego-Arrigoni-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Osborne",
                "href": "/profile/Robert-Osborne-80"
            },
            "answer_text": "What good is the study of black-holes if it serves no useful purpose? Although black-hole research may satisfy an insatiable, intellectual curiosity among researchers, this does not contribute any concrete benefit or improvement to human life. One might have said the same thing with respect to Einstein’s work in physics. Einstein’s work was entirely abstract; it had no practical purpose; it sought only to answer obscure mathematical questions regarding a curious aspect about the speed of light. It’s iconic testimony to the power and heights of the human intellect went largely unnoticed. Pure, fundamental science ordinarily envisions NO economic or useful reward that might serve or facilitate human needs. The non-teleological aim of pure science is the acquisition of knowledge, which may or may not have some future value. Non-teleological curiosity, completely separated from practical application or economic benefit, drives pure science and such things as black-hole research. Moreover, it is indeed possible that unfettered, feline curiosity may be a basis for the evolution of the human intellect. The acquisition and accumulation of non-teleological-knowledge may represent the most important activity associated with the human intellect and, indeed, the human race. Moreover, knowledge, regardless of its practicality, provides philosophic insight into our somewhat weird place in the universe and our insatiable appetite for meaning. ",
            "date": "Updated October 26, 2020",
            "views": "531",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Philippe Raymond",
                    "user_href": "/profile/Philippe-Raymond"
                },
                {
                    "user_id": "Richard Gibson",
                    "user_href": "/profile/Richard-Gibson-141"
                },
                {
                    "user_id": "Sushma Sharma",
                    "user_href": "/profile/Sushma-Sharma-74"
                },
                {
                    "user_id": "Sarthak Kumar (सार्थक कुमार)",
                    "user_href": "/profile/Sarthak-Kumar-सार्थक-कुमार"
                },
                {
                    "user_id": "Mario Hunstorfer",
                    "user_href": "/profile/Mario-Hunstorfer"
                },
                {
                    "user_id": "Martin Cosentino",
                    "user_href": "/profile/Martin-Cosentino-1"
                },
                {
                    "user_id": "Robert Keller",
                    "user_href": "/profile/Robert-Keller-56"
                },
                {
                    "user_id": "Alia Suhaila",
                    "user_href": "/profile/Alia-Suhaila"
                }
            ]
        }
    ]
}