{
    "title": "Why is assessment important? - Quora",
    "tags": [
        "Self Assessment",
        "Assessment",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thiruvikraman Ramadoss",
                "href": "/profile/Thiruvikraman-Ramadoss-1"
            },
            "answer_text": "Assessment helps us to enhance learning. Assessment of Learning: Assessment acts as a feedback mechanism to find out what has been learnt. Assessment for learning: Assessments shall also be administered to help students learn. Assessment shall be used as a tool to provoke curiosity of the assessed. Assessment questions shall be designed to create a search for understanding. For example: In open book tests or comprehension, the questions provoke what is to be understood, rather than what has been learnt. Assessment as a selection tool: Assessments are also used in recruitment process. Assessments shall be used to assess the subject expert of a list of candidates. In such cases assessments are used to do preliminary selection. Functionally assessments, help students to know where they stand in terms of knowledge, help trainers to know how much the trainees have understood, helpd to make students curious and eventually learn and also to select or eliminate candidates in a recruitment process. Assessment is part of learning and recruitment, and hence is a significant area to be refined and enhanced more. ",
            "date": "Answered July 24, 2017",
            "views": "2",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Isaac Chirwa",
                    "user_href": "/profile/Isaac-Chirwa-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Niva Bhandari",
                "href": "/profile/Niva-Bhandari"
            },
            "answer_text": "Assessment is the measurement of learning acquired. If there is no assessment, there is no proof of learning. If there is no learning happening then the entire effort of providing learning is futile and it should be stopped. Assessments goes hand in hand with feedback. Feedback helps a learner to understand the gap areas and to make more effort to fill up the gap area. Assessment also helps to determine the direction of learning. ",
            "date": "Answered May 1, 2017",
            "views": "12",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Angie Aninon Dorimon Cambongga",
                    "user_href": "/profile/Angie-Aninon-Dorimon-Cambongga"
                },
                {
                    "user_id": "Bus Comm",
                    "user_href": "/profile/Bus-Comm"
                },
                {
                    "user_id": "Shahbaaz Ahmed",
                    "user_href": "/profile/Shahbaaz-Ahmed-3"
                },
                {
                    "user_id": "Riyana",
                    "user_href": "/profile/Riyana-2"
                }
            ]
        }
    ]
}