{
    "title": "Why do atoms absorb or emit light only at particular frequencies? - Quora",
    "tags": [
        "Atomic Physics",
        "Speed of Light",
        "Atoms",
        "Visible Light"
    ],
    "response": [
        {
            "author_info": {
                "name": "Avijeet Singh Gill",
                "href": "/profile/Avijeet-Singh-Gill"
            },
            "answer_text": "The correct answer to this question would require lengthy analysis and complicated formulas requiring the knowledge of differential calculus and quantum mechanics. For reference you can look upto introduction to quantum mechanics by griffiths and jump to the 4th chapter. For a layman i can paraphrase the answer as follows. The electron in an atom is a bound system. In this system there exists some states in which the electron can be without loosing energy i.e. the electron can revolve around the nucleus without loosing energy. These are called stationary states. (stationary doesn't mean that the electron doesn't move. Its is quite a confusing term to a layman but physicists are stuck with it since it makes sense in quantum mechanics) Now these states exist at different distances from the nucleus of the atom. These states have a fixed difference in energy. The electron can jump between these states only if it absorbs/releases a fixed amount of energy. It cannot absorb/release some energy to exist in between the states. Thus the elctron literally jumps between the states and not go there. Think of it like the electron can only teleport inbetween the states if it absorbs/releases certain energy. Since it can release only certain values of energy, the light it emits can only be if certain frequencies. If the electron moved inbetween the states, we would see many frequencies of light emission. An answer which will make sense to even a 3rd grade child would be that electron goes directly from 1 to 2. It doesnt go from 1 to 1.1 to 1.2 to…… to 2. ",
            "date": "Answered November 15, 2018",
            "views": "191",
            "upvotes": "0"
        }
    ]
}