{
    "title": "Why can't we go faster than light? Why is that the max speed achievable? - Quora",
    "tags": [
        "General Relativity",
        "Special Relativity",
        "Speed of Light",
        "Speed",
        "Relativity (physics)",
        "Science of Everyday Life",
        "Astrophysics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael McClennen",
                "href": "/profile/Michael-McClennen"
            },
            "answer_text": "Your question actually has it backwards. The fundamental point, the point from which all of physics starts, is that there exists a fastest speed possible in the Universe. We have no idea why this is true, it is just the way the Universe we live in happens to be structured. It is a fixed and undeniable fact of nature, and we will probably never be able to find any kind of underlying reason for it. Consequently, we just need to take it as a given. This “fastest speed possible in the Universe” also serves as the constant of proportionality between space and time. There are four dimensions to our Universe, three spatial and one temporal, and that fixed speed defines how the temporal dimension relates quantitatively to the spatial ones. This speed is invariant in every frame of reference. Two observers who are moving with respect to each other will always measure the same velocity for anything moving at this fastest possible speed. This implies that two observers who are moving with respect to each other will in fact observe time passing differently, and under certain circumstances one of them may even observe a particular sequence of events happening in a different order than the other one observes. In other words, there is no such thing as an absolute sequential chronicle of events in the Universe that everybody can agree upon. The rate at which time passes and the sequence of observed events changes relative to the motion of the observer. Many other measured quantities also differ according to the relative motion of the observer, such as length, kinetic energy, electrical and magnetic field strengths, and others. That is why the theory that explains how all of this works is called the Theory of Relativity. None of this has anything to do with light. All of it would still be true even if there were no such thing as light in the Universe. There would still be a Theory of Relativity, and there would still be the same absolute speed beyond which nothing can possibly travel. The nature of light is such that it always travels at the fastest speed possible for it to travel. For historical reasons, we call the fastest speed possible for everything in the Universe “the speed of light” because that is how it was first measured. But the fact that this speed exists and its precise magnitude have nothing at all to do with light. ",
            "date": "Answered July 13, 2020",
            "views": "111",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Lent",
                    "user_href": "/profile/Michael-Lent"
                },
                {
                    "user_id": "Mark Nealon",
                    "user_href": "/profile/Mark-Nealon-1"
                },
                {
                    "user_id": "Drew McIntosh",
                    "user_href": "/profile/Drew-McIntosh"
                },
                {
                    "user_id": "Ruben Alaniz",
                    "user_href": "/profile/Ruben-Alaniz-4"
                },
                {
                    "user_id": "Thomas Bostick",
                    "user_href": "/profile/Thomas-Bostick"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saso Vrtovec",
                "href": "/profile/Saso-Vrtovec"
            },
            "answer_text": "That is because of the equations of the theory of relativity. It is a fact that if we want to increase the speed of an object, we have to give energy to this object to accelerate it and according to the equations of relativity, this energy is increasing greatly when the object approaches the speed of light. According to this equation(s), the speed of light can not be surpassed nor even attained for objects with mass. And for objects without mass - such as fotons - it can only be attained, but also not surpassed. It is a general missunderstanding, that the kinetic energy is calculated by the formula Ek=mv^2/2, but this formula is just an APROXIMATION for kinetic energy at speeds much lower than the speed of light, just as i.e.the number Pi is NOT equal to 3,14 but is 3,141592654……. So 3,14 is just a two-decimal aproximation of the number Pi. Similarly, the formula for kinetic energy of an object with mass is - according to the theory of relativity- more complex and more precise and mv^2/2 is just a convinient approximation for small speeds. The predictions of the formulas of relativity theory are in accordance with measurments of speeds and energies of fast moving particles in particle acceleration machines in CERN and others, so the predictions and calculations of the relativity theory are in accordance with measurements. ",
            "date": "Answered July 14, 2020",
            "views": "38",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Michael Lent",
                    "user_href": "/profile/Michael-Lent"
                }
            ]
        }
    ]
}