{
    "title": "Why do winners win and losers lose? - Quora",
    "tags": [
        "Losers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Javed Bhatti",
                "href": "/profile/Javed-Bhatti-2"
            },
            "answer_text": "Life is like a mirror. Each person has their own way of seeing this mirror. In this mirror, we become the way we see ourselves. If we see ourselves as a loser then we will become a loser and if we look like a winner then we will become winner. Wiener has always said to himself that I can win, yes I can win and he certainly wins while loser always talks about losing, so he has a fear of losing that he does not win and always loses. While Winner focuses on his weaknesses, he is always able to overcome them, leading to his winning conviction. While Looser never sees his weaknesses. One of the most successful person was once asked what the real secret to his success is? He said that he made quick decisions. Again it was said that making a quick decision will also hurt you many times. He answered yes many times. But my losses are in the millions and the gains in the billions. Therefore, hesitation and delaying the decisions are the signs of a looser. Making of quick decision is rarely found in winning people. Such people reach at the highest points in short time. One of the most important features of Winners is their confidence of success. Modern ideas are available for everyone and almost all of them work hard, but the early decisions worth them. Successful people do not think after making a decision, but start working hard to make their decision successful while the loosers are always working hard but when it comes to decision making, they are faced with awe and strife. The successful man always looks at the tomorrow, whereas the failed man thinks only of the today's benefit and therefore his care is limited and he cannot see tomorrow. That is because it does not happen before tomorrow to make any decision. But for today, the decision that he will make will reflect his fear. What challenges you in adulthood changes your destiny. Easy ways never lead to the path of success. All the thorns in your life today will become the flowers of your life tomorrow. If you have to change your total focus on your destination, not on hard work, and move forward with planning. Time passes through the hand like sand. We realize this when we fail to meet our needs. Then we realize that the time, what was about to change, we have wasted and didn't made right decisions. Time is gold, so make it by making the right decisions at right time. ",
            "date": "Answered November 30, 2019",
            "views": "95",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gustaf Johansson",
                "href": "/profile/Gustaf-Johansson"
            },
            "answer_text": "Who cares? It’s not about winning or losing. It’s about learning and improving. ",
            "date": "Answered June 26, 2020",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Raj Shankar Prasaad",
                    "user_href": "/profile/Raj-Shankar-Prasaad"
                }
            ]
        }
    ]
}