{
    "title": "Why is the average human life expectancy increasing? - Quora",
    "tags": [
        "Longevity",
        "Aging",
        "Human Biology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Gregg",
                "href": "/profile/Chris-Gregg-1"
            },
            "answer_text": "A lot of good answers have been written already, so forgive me for repeating. If you want a longer answer, read this, as I my PhD thesis dealt with certain aspects on longevity so I'm very interested in it. In the past, people would die of poor hygiene, especially infants. Running water is a big deal, being able to dispose of sewage lowers the rate of infant diarrhea which, believe it or not, was a significant cause of death among infants in the early 1900s. Since you're talking in centuries it's worth noting that our agriculture has also improved and by improved I mean, we have ways to lower the amount of pests that destroy crops. When people complain about \"non-organic\" foods, they usually are complaining about pesticides which ultimately are very helpful in protecting the devastation of our food. Less famine certainly increases life expectancy. This paper is behind a pay wall, but if you have access it is a good read and expounds on the ideas above. Personal hygiene and life expectancy improvements since 1850: Historic and epidemiologic associationsby Velvl W Greene It was mentioned already but it can bear repeating in this day and age. Vaccines! In the last century alone diseases that used to kill at a very young age have been almost eradicated. Others have been eradicated. Vaccination may be one of the most miraculous innovations of modern medicine which is why it is infuriating to see people resist it. In 1980 measles killed an estimated 2.6 million people. Now, the number is 96,000 mostly in the developing world where there is less access to vaccination. You may be wondering, what kills people today? In North America you are most likely to die from cancer, diabetes or heart disease and most forms of these diseases are associated with diet and/or old age. The developed world is suffering an obesity epidemic. We eat more and engage in less physical activity. This means our bodies are exposed to higher levels of sugar and fat and you probably know that high sugar and high fat can lead to diabetes, heart disease and cancer. At the cellular level, one of the mechanisms causing aging is that sugar, fat etc... activate a metabolic pathway called mTOR. mTOR activates certain processes, like cell growth, that accelerate aging. Why human lifespan is rapidly increasing: solving ?longevity riddle? with ?revealed-slow-aging? hypothesis This raises another interesting questions which is, why does food kill us? Why does it make us fat? Couldn't our bodies have evolved to just get rid of what we don't need? One observation is that we evolved in conditions of scarcity. Before agriculture food was scarce, so it was probably advantageous for your body to store whatever food energy you got as fat. Because people never lived into old age they never got a chance to get cancer, diabetes etc... They would be eaten or killed by war before that happened. So, in an unfortunate twist, we have evolved to store extra energy as fat. A lot of fat, that ultimately is largely correlated with old age diseases. Another hypothesis I had heard long ago was that some organisms (like yeast) have probably evolved to die at certain points in their life, ie their death is programmed by evolution. If there is a lot food in an environment, it is a good time to reproduce because your offspring will have an abundance of food available to them. However, you don't want to compete with your offspring therefore your cells (yeast cells in the example I'm thinking about) are programmed to die. This is an old idea I've heard and I'm not sure if it's given much attention anymore, so take it with a huge grain of salt. I can't find the paper that suggested this right now. I do think it's something worth considering, because if you ever get around to reading the paper above, it describes how aging can be \"delayed\" rather than \"slowed\". Certain experiments have been done on mice, including genetic interventions and dietary interventions (usually caloric restriction) that extend lifespan. However, extended lifespan in some of these cases delays the reproductive age of the mice basically meaning you hit puberty later. To me, this implies a kind of a \"program\". Less food? Therefore not a good time to reproduce therefore have children later in life, and don't age until then. Lots of food? -> have children now, age sooner. Again, take all of this with a grain of salt, I have no references at the moment. Regardless, all this should come as very good news (if you want to live to 100+ years) because it  means that with better diets we can be sure to increase our lifespans. There is also a lot of talk about what kind of drugs or genetic interventions could continue to extend our lifespans. Indeed, the article I linked above says our lifespans continue to increase at a very fast rate which leaves only one other problem. What will we do with a planet full of people who are living to over 100 years old? ",
            "date": "Answered July 1, 2015",
            "views": "36",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tony Simms",
                    "user_href": "/profile/Tony-Simms-3"
                },
                {
                    "user_id": "Lillian Taylor",
                    "user_href": "/profile/Lillian-Taylor-4"
                },
                {
                    "user_id": "Gunjan Jain",
                    "user_href": "/profile/Gunjan-Jain"
                },
                {
                    "user_id": "Garth Ware",
                    "user_href": "/profile/Garth-Ware"
                },
                {
                    "user_id": "Sneha Ramamoorthy",
                    "user_href": "/profile/Sneha-Ramamoorthy-1"
                },
                {
                    "user_id": "Duc Nguyen",
                    "user_href": "/profile/Duc-Nguyen-711"
                },
                {
                    "user_id": "Santhosh Jain",
                    "user_href": "/profile/Santhosh-Jain"
                },
                {
                    "user_id": "Roman Smirnov",
                    "user_href": "/profile/Roman-Smirnov-2"
                },
                {
                    "user_id": "Kirk A. Janowiak",
                    "user_href": "/profile/Kirk-A-Janowiak"
                },
                {
                    "user_id": "Henry Huang",
                    "user_href": "/profile/Henry-Huang-24"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marvin Dookharan",
                "href": "/profile/Marvin-Dookharan"
            },
            "answer_text": "Because of calculation tricks involving the infant mortality rate. In reality the life expectancy hasn’t changed much just the calculated life expectancy. Many people who have answered here claim things like improvements in personal hygiene, healthcare, vaccines, and other things caused the life expectancy but I doubt it. Hispanics in the US have a higher life expectancy than Whites in the US but nearly half never visit the doctor, nearly three-fourths use prescription medicine, so how is this possible? It’s simple Hispanics in the US have around the same infant mortality rate…the causation is obviously the infant mortality rate (Hispanics Have Highest Life Expectancy in U.S.). A study involving more than 182,000 people showed that regular doctor visits do not reduce mortality as imagined/speculated by many (General health checks in adults for reducing morbidity and mortality from disease: Cochrane systematic review and meta-analysis). Another study shows that the life expectancy at age 5 during the mid-Victorian era was 75 for males, 73 for females once again pointing towards the infant mortality rate as the main factor in life expectancy calculations (An unsuitable and degraded diet? Part three: Victorian consumption patterns and their health benefits). This means essentially anything that causes a low infant mortality rate will cause a higher calculated life expectancy even if it’s not actually healthy in reality. There are many things linked to causing infertility, sterility, low sperm count, erectile dysfunction, and other things which would probably cause a lower infant mortality rate but isn’t really healthy in reality. Artificial cleanliness or good personal hygiene has been linked to causing infertility…this means in reality good personal hygiene may not be actually healthy just linked to causing infertility which in turn causes a lower infant mortality rate. I don’t know where people got the idea that good personal hygiene is healthy since cleaning supplies and body sprays have been linked to causing poisoning, lung issues, infertility, and other health problems. Doctors do not recommend showering too much it’s not healthy they in fact recommend showering less often as it’s been linked to causing skin issues especially. Artificial cleanliness is especially bad for infants as good hygiene has been linked to a weaker immune system (Newborns Exposed to Dirt, Dander and Germs May Have Lower Allergy and Asthma Risk - 06/06/2014). This means people who practice poor personal hygiene with a low infant mortality rate may live longer than people who practice good hygiene with the same low infant mortality rate. People have also claimed vaccines but that’s also just speculation…in reality without healthcare, vaccines, good personal hygiene, and other things with a low infant mortality rate the life expectancy may be much higher than it is now. There’s also been evidence showing that medical errors are a leading cause of death in the US, also the issue of hospital-acquired infections and the unknown effects of many drugs so without healthcare with a low infant mortality rate the life expectancy may be much higher than it is now. Simply focusing on reducing accidental deaths like car accident deaths would do more to increase the life expectancy than many things people claim. Leading causes of infant mortality are just things like dehydration and malnutrition…which has to do with a lack of food and water so it shouldn’t be that difficult to gain a low infant mortality rate without all that other stuff. If you control for infant mortality rates and other big factors that impact life expectancy like suicides, homicides, accidental deaths, substance abuse the life expectancy hasn’t changed much at all. The life expectancy has actually been decreasing slightly in recent years even with the big infant mortality rate decreases (US life expectancy drops for second year in a row). Calculations don’t always reflect reality especially for one individual…I still know many people who died in their 50s or earlier in the US (from illnesses not suicides, homicides, or accidental deaths) even though the calculated life expectancy in the US is nearly 80. We can also point out individuals who lived long in the past when the calculated life expectancy was much lower…like Issac Newton who died at age 84 which is still very high for a male in modern times. ",
            "date": "Answered August 7, 2018",
            "views": "515",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Asimina Giannikaki",
                    "user_href": "/profile/Asimina-Giannikaki-1"
                },
                {
                    "user_id": "Vijay Gupta",
                    "user_href": "/profile/Vijay-Gupta"
                }
            ]
        }
    ]
}