{
    "title": "Why do we sleep? - Quora",
    "tags": [
        "Sleep Science",
        "Sleep Habits"
    ],
    "response": [
        {
            "author_info": {
                "name": "Milo Beckman",
                "href": "/profile/Milo-Beckman"
            },
            "answer_text": "From my website, romyasks.com: We have no idea. Humans have figured out where we came from, what everything’s made of, what happened billions of years ago, and will happen billions of years from now. We’ve worked out the causes of diseases and developed ways of beating them. We’ve mastered physics so well that we can fly through the air at 500 mph or talk to someone on the other side of the planet. But we’re not sure why we spend a third of our lives paralyzed and unconscious.  Here’s one thing we do know: we definitely need sleep. If it wasn’t super important, it would be a pretty stupid idea. You can lock your door at night, but other animals are totally defenseless when they sleep — not a great move. So why sleep? Well, if you’ve ever tried not to, you know what happens. You get a little loopy. Going 24 hours without sleep does the same thing to your brain as chugging five beers. And if you never sleep? Scientists made some unfortunate rats stay up way past their bedtimes to see what would happen. The rats had to hang out on a disk over shallow water. If they nodded off, the disk would spin. The rat would have to wake up and walk the other way or it would get spun into the water.  Spoilers: all the rats died. But we can’t say why. They didn’t have ulcers or brain damage. All their organs were fine. As far as we can tell, they were just tired to death. We have three guesses about why we sleep, but they’re just guesses.One guess is that we sleep to restore whatever oomph we used up during the day. We do know that sleeping makes wounds heal faster, cancer grow slower, and your immune system work better. But we haven’t found any “life force” that drains when you’re awake. Another guess is that we sleep to save energy. It’s true that you don’t use as many calories when you’re asleep, so you need less food overall. But wouldn’t it be easier just to eat more? And why would being low on calories make you hungry sometimes and tired other times? The best guess is that your brain has to do some regular upkeep, and can’t do it while you’re awake. For example, your memory is better if you sleep more. Recently we found out that your brain loses unnecessary connections while you’re sleeping, so you run more efficiently. Still, though, why does that mean you have to conk out for eight hours? Your brain is great at multitasking. Right now, it’s supervising thousands of things you’re not even aware of! To summarize, we don’t know. I’ll let William Dement, one of the world’s experts on sleep science, take it from here.  As far as I know, the only reason we need to sleep that is really, really solid is because we get sleepy. ",
            "date": "Answered February 4, 2015",
            "views": "73",
            "upvotes": " View 53 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Charlie Snatule",
                    "user_href": "/profile/Charlie-Snatule"
                },
                {
                    "user_id": "Alexander Pann",
                    "user_href": "/profile/Alexander-Pann-1"
                },
                {
                    "user_id": "Takeuchi Bonny",
                    "user_href": "/profile/Takeuchi-Bonny"
                },
                {
                    "user_id": "Andy Trump",
                    "user_href": "/profile/Andy-Trump-1"
                },
                {
                    "user_id": "Milano Preen",
                    "user_href": "/profile/Milano-Preen"
                },
                {
                    "user_id": "Or Dadon",
                    "user_href": "/profile/Or-Dadon-1"
                },
                {
                    "user_id": "Salami Guadalupa",
                    "user_href": "/profile/Salami-Guadalupa"
                },
                {
                    "user_id": "Stephon Hendricks",
                    "user_href": "/profile/Stephon-Hendricks-2"
                },
                {
                    "user_id": "Alice Floyd",
                    "user_href": "/profile/Alice-Floyd-12"
                },
                {
                    "user_id": "Brennan Green",
                    "user_href": "/profile/Brennan-Green-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karen Lier",
                "href": "/profile/Karen-Lier-1"
            },
            "answer_text": "Our best scientific minds still don’t understand exactly what it is we are doing during all those hours we sleep. We know we dream during sleep. We know memory consolidation takes place during sleep. We know muscles and tissues heal at a more rapid rate during sleep than during our waking state. But, what is the purpose of sleep? Why sleep and not some other state of consciousness? Wouldn’t some other method be more productive than snoozing a huge chunk of our lives away? What would our lives be like if we didn’t have to spend 1/3 of it sleeping? What If We Didn’t Need Sleep? The most significant change would be the amount of time we would gain in our waking lives — think of increasing your productivity or creativity by 50%. What used to be a mere 16 waking hours now becomes 24 waking hours. Now, think about the entire global population increasing their productivity and creativity by 50%. It is mind-boggling to consider. What would be different? Everything. Our lives are completely scheduled around our natural sleep patterns, so if we didn’t need any sleep at all, our time structures would shift. Normal mealtimes would shift, normal work hours would be much more varied (and potentially longer), businesses would be open around the clock, and we could hangout with friends at any time of the day or night. It is probable we’d devise all sorts of new societal norms about what activities are appropriate for various times of the day/night cycle and those who don’t subscribe to the norms would be considered rebels, misfits, or crackpots. When I think about all the hours we spend sleeping, I wonder why we couldn’t simply have evolved to recharge, heal, consolidate memories, and work out our unconscious quandaries while we go about our lives. Remember those self-winding watches? They rewound via the movement of the wearer’s arm throughout the day. Why can’t we do the same? What is the point of spending 1/3 of every day in a prone position in another (although decidedly enjoyable) state of consciousness? One reason that makes sense is that we need a majority of our resources for running our bodies, minds, and lives during our waking hours. Doing both processes at once (being awake and recharging) may require more resources than we have on board. Evolution may have split the processes up into time zones (circadian rhythm) for efficiency purposes. If this is true, then it is possible this will change as we continue to merge our biological selves with technology. Another potential reason for spending one-third of our lives asleep is that we may be absorbing or emitting some “thing” or “stuff” that we have yet to discover or understand. It could be this is a necessary input or output in the same way that air or water is necessary to us. This would help to explain why all living creatures need to sleep — even though not all other animals sleep in the same way as humans. Doing it Different Bullfrogs were found to react to stimulus in the same way whether they were in their resting phase or their awake phase. Scientists remain confounded with regards to whether they ever sleep or not. Dolphins are able to allow just half their brains to sleep at a time which means they are awake and alert and still swimming around using the other half of their brain while they sleep. This may partially explain the large size of the dolphin brain. Bees don’t need to catch up on sleep if they’ve missed a lot of it. Instead, after a period of sleep deficit, they simply sleep as usual and are rarin’ to go again. Roaches and tilapia are similar. There are other animals, too, who sleep much deeper than humans and thus require much less sleep than we do. This, in itself, is a significant indicator about the purpose of sleep. It is fun to think about what it might be like if humans were capable of dolphin style sleep. We could still recharge, heal, etc, but we’d still have those hours available to live our lives. We could learn, build, communicate, think, plan and associate full-time if we wanted. Maybe we’d be in a lesser vitality mode during the half-brain phase, but there are people who are completely functional and quite intelligent who have only one-half of a brain. Some people are born this way and it isn’t ever noticed until they go to a hospital for some unrelated disorder. Others lose the function of half of their brain due to stroke or injury. Others have large portions of their brain removed due to disease processes. If we didn’t need to sleep at all, think of all the industries, professions, and branches of science that revolve around those dream-sopped hours—all of them would be gone or severely diminished. For example, we might still enjoy laying atop a marshmallow-soft bed for a short while, or making love there, but odds are those beds would look different than those we use for long hours of sleep. It would be the same for everything sleep-related. What if we still had the capacity for sleep but it was a luxury pastime available only to the wealthy or connected individuals? There are so many possibilities. They are all fun to think about. There’s a lot of research underway regarding sleep and its function. Hopefully, technology will help our understanding move forward in ways we cannot yet even imagine. ",
            "date": "Answered May 27, 2017",
            "views": "86",
            "upvotes": " View 66 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Milano Preen",
                    "user_href": "/profile/Milano-Preen"
                },
                {
                    "user_id": "Andy Trump",
                    "user_href": "/profile/Andy-Trump-1"
                },
                {
                    "user_id": "Izzy Bizzy",
                    "user_href": "/profile/Izzy-Bizzy-37"
                },
                {
                    "user_id": "Tuanku Muhammad Rifyal Fahmi",
                    "user_href": "/profile/Tuanku-Muhammad-Rifyal-Fahmi"
                },
                {
                    "user_id": "The King of Jungle",
                    "user_href": "/profile/The-King-of-Jungle"
                },
                {
                    "user_id": "Tim Larsen",
                    "user_href": "/profile/Tim-Larsen-29"
                },
                {
                    "user_id": "Nadeem Hassan",
                    "user_href": "/profile/Nadeem-Hassan-43"
                },
                {
                    "user_id": "Tempest Twin",
                    "user_href": "/profile/Tempest-Twin"
                },
                {
                    "user_id": "Donald Denis",
                    "user_href": "/profile/Donald-Denis-1"
                },
                {
                    "user_id": "B Fearns",
                    "user_href": "/profile/B-Fearns"
                }
            ]
        }
    ]
}