{
    "title": "Why can't the corona virus be tackled by silencing the RNA using RNA interference? - Quora",
    "tags": [
        "RNA Interference (RNAi)",
        "Molecular Biology Research in Depth",
        "RNA",
        "Viruses (biology)",
        "Molecular Biology",
        "Virology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mayur Vaishnav",
                "href": "/profile/Mayur-Vaishnav-14"
            },
            "answer_text": "Hi, I’m really glad that you ask this question. Coronaviruses are known for their ability to recombine using both homologous and non-homologous recombination. The ability of these viruses to recombine is tied to the strand switching ability of the RdRp. Recombination likely plays a prominent role in viral evolution and is the basis for targeted RNA recombination, a reverse genetics tool used to engineer viral recombinants at the 3′ end of the genome. Few studies have published that an experiment was carried out using RNAi mechanism to inhibit the gene expression but the results have failed to show the response. While also few studies have proven to show positive results in mammalian cells, experiments are still being carried out in animals and humans, still far away to know the results. As per the data about coronavirus, scientists are only able to develop vaccine by using recombinant mechanism which is said to be effective and phase 1 experiment have already started in U.S and is said to take 6 weeks for complete results to begin out the phase 2 trails. Thank you. ",
            "date": "Answered March 27, 2020",
            "views": "30",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aashish Sharma",
                "href": "/profile/Aashish-Sharma-120"
            },
            "answer_text": "Who said it can't be.. actually it is the only way to make it stop but guess what.. it is really a big task to produce siRNA because viral enzymes are erroneous so identification of fixed sequences which can help controlling the RNA polymerase activity is tough otherwise it is the potent way to keep in check the spread of any virus.. Keep smiling ♡A@shi ",
            "date": "Answered April 4, 2020",
            "views": "57",
            "upvotes": " Answer requested by Ken Adams"
        }
    ]
}