{
    "title": "Why is Japanese science and technology so advanced? - Quora",
    "tags": [
        "Culture of Japan",
        "Japan",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bruce Graham",
                "href": "/profile/Bruce-Graham-1"
            },
            "answer_text": "The Charter Oath of 1868 - a founding document of Japan’s modernization under Emperor Meiji had five articles. Article 5 stated: \"Knowledge shall be sought throughout the world so as to strengthen the foundations of imperial rule.\" So from its founding as a modern state, one of the key national drives was to scour the world for technology. This they have done. At least partly by copying - ‘it involved technological plagiarism on a truly heroic scale and the adoption of critical aspects of a completely alien culture,’ Gavin Weightman, The Industrial Revolutionaries, (London: Atlantic Books, 2007), 390 The world was searched, but also the past. The fax, for example, was invented by Scottish inventor, Alexander Bain and in 1846 was able to reproduce graphic signs in laboratory experiments. He received British patent 9745 on May 27, 1843 for his \"Electric Printing Telegraph.” Perfect for sending messages with Japan’s cumbersome script.  Eric Laithwaite - the ‘father’ of maglev, probably had no idea his invention would be used to break the world speed record - in Japan. Japan's maglev train breaks world speed record with 600km/h test run  Ever since Commander Perry forced open Japan with his dreaded Black Ships the Japanese have been acutely aware of the power of technology.  Perry demonstrated a fully operational Norris Works, one-fourth scale model train, complete with 350 feet of 18-gauge track, engine, tender, and car, representing one of these \"triumphs of civilization\" which he used to influence the Japanese. Behind the Yokohama reception hall, the Americans assembled and operated the locomotive for the Japanese officials, some of whom rode by sitting on top of the car. Perry In Japan  One hundred and eleven years later, to celebrate the first Olympics held in Asia, the ‘Shinkansen’ the bullet train, the world’s fastest, started operating in 1964, just nine days before the Tokyo Olympics began. Ever since the 1850’s Japan has been riding a rocket of change, or transformation- the rocket hasn’t stopped yet, or run out of fuel. ",
            "date": "Updated April 22, 2019",
            "views": "88",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Redric Blue",
                    "user_href": "/profile/Redric-Blue"
                },
                {
                    "user_id": "Yaadhav Raaj",
                    "user_href": "/profile/Yaadhav-Raaj"
                },
                {
                    "user_id": "Rohan Theodore",
                    "user_href": "/profile/Rohan-Theodore-1"
                },
                {
                    "user_id": "Asad Parihar",
                    "user_href": "/profile/Asad-Parihar"
                },
                {
                    "user_id": "Ryan Hughes",
                    "user_href": "/profile/Ryan-Hughes-284"
                },
                {
                    "user_id": "Michael Sangiorgio",
                    "user_href": "/profile/Michael-Sangiorgio"
                },
                {
                    "user_id": "Mohit Agrawal",
                    "user_href": "/profile/Mohit-Agrawal-102"
                },
                {
                    "user_id": "Thomas Knowles",
                    "user_href": "/profile/Thomas-Knowles-6"
                },
                {
                    "user_id": "Dipen Joshi",
                    "user_href": "/profile/Dipen-Joshi-4"
                },
                {
                    "user_id": "Dave Anselmi",
                    "user_href": "/profile/Dave-Anselmi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dandu Suresh",
                "href": "/profile/Dandu-Suresh"
            },
            "answer_text": "Japan is well known for its electronics industry throughout the world, and Japanese electronic products account for a large share in the world market, compared to a majority of other countries. Japan is one of the leading nations in the fields of scientific research, technology, machinery, and medical research with the world's third largest budget for research and development at $130 billion USD, and over 677,731 researchers. Japan has received the most science Nobel prizes in Asia (see List of Nobel laureates by country)Japan has large international corporate conglomerates such as Fuji (which developed the nation's first electronic computer, FUJIC1999, in 1956) and Sony. Sony, Panasonic, Canon, Fujitsu, Hitachi, Sharp, NEC, Nintendo, Epson and Toshiba are among the best-known electronics companies in the world. Toyota, Honda, Nissan, Mazda, Mitsubishi, Suzuki, and Subaru are also very well known automobile companies in the world. The Japan Aerospace Exploration Agency (JAXA) conducts space and planetary research, aviation research, and development of rockets and satellites. It has developed a series of rockets, the latest and the most powerful of which is H-IIB. H-IIA/B rockets which have the capability of carrying 8-ton payload to the GTO at maximum are now managed by the private-own company Mitsubishi Heavy Industry. It also built the Japanese Experiment Module, which was launched and added to the International Space Station during Space Shuttle assembly flights in 2007 and 2008 and the HTV to transfer payloads to the station in 2009. Since 1973, Japan has been looking to become less dependent on imported fuel and start to depend on nuclear energy In 2008, after the opening of 7 brand new nuclear reactors in Japan (3 on Honshū, and 1 each on Hokkaidō, Kyūshū, Shikoku, andTanegashima)[citation needed] Japan became the third largest nuclear power user in the world with 55 nuclear reactors. These provide 34.5% of Japan's electricity.Following an earthquake, tsunami, and the failure of cooling systems at the Fukushima I Nuclear Power Plant on March 11, 2011, a nuclear emergency was declared. 140,000 residents within 20 km of the plant were evacuated. See Radiation effects from Fukushima Daiichi nuclear disaster 900 ",
            "date": "Answered March 31, 2015",
            "views": "57",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Loganathan D",
                    "user_href": "/profile/Loganathan-D-11"
                }
            ]
        }
    ]
}