{
    "title": "Why is it black in outer space? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Unnikrishnan Menon",
                "href": "/profile/Unnikrishnan-Menon-5"
            },
            "answer_text": "Why is Space So Dark?  I mean, there are innumerable numbers of Stars out there right? Countless number of them which are all as bright as our own Sun. (or more) Our cosmos is so big that no matter in which direction you look, you’ll always stumble upon a cluster of stars or galaxies! From this reasoning, our sky should be appearing bright [math]24 \\times 7[/math], no matter what time you pick. So, why don’t we see this???  All of our evidences seem to indicate that space has no edge. But the Universe itself does have one! Now this is not spatial edge but this is a temporal one. Our current understanding of the Cosmos suggests that it had a beginning. This beginning was about [math]13.7[/math] billion years ago when our Universe was so small and crumpled up with itself that our current notion of space and time simply breaks down at that point! Now as I said, only a finite amount of time (13.7 billion yrs) has passed since the beginning of our Cosmos. What that means is when we point out telescopes at the heavens, we are able to see only those stars whose light has been able to reach us. So some of the stars necessary to fill up the brightness in every direction are so far away that the photons of light that are emitting haven’t yet reached us ! This is somewhat similar to what happens during a Thunderstorm…  You first see a flash of light in the sky, the lightning. After that there’s a time delay. And after this time delay, you get to hear the roar of the thunder! It takes some time for the sound to reach us. But there’s more to this story…. Let’s say you were looking at the night sky using your telescope. You point your telescope at a particular direction and suddenly, you spot a lonely star. Let’s say Star-X. Let’s say a photon left the surface of that star in 1917. Now the Star X is so far away from us that this photon had to travel for the next hundred years. So starting from 1917 to 2017, this photon was sailing through the Universe. Now when you saw that star, what really happened is that the photon entered your eye. So basically, what you are seeing in the telescope is an image of the star but that’s not how it looks at present. That’s how it looked like in 1917! You are gazing at the past!  What’s even more fascinating (atleast to me) is the fact that some of these stars may be dead by now (at present), but because of the vastness of this Cosmos, the last photon that left that star’s surface hasn’t reached us yet! They can be thought of like ghosts. They are not there but we can still see them.  So when we look up at the night sky, what we are really seeing is the past of our Cosmos. We see that part of the Universe as it had been when the light was emitted. So when we look at 13.5 billion year old light, it’s not that we don’t see stars just because the light from them hasn’t reached us yet. We don’t see stars because we are getting a peak at the Universe BEFORE any stars had formed! How crazy is that! A Starless Universe! We can find points in the sky where there aren’t any stars by looking past the earliest stars and thus further back in time! But even when we point our telescopes past the earliest stars, we still see LIGHT! This is weird because this is not Starlight but it is the light left over from the Big Bang! That’s what Astrophysicists like to call as the Cosmic Background Radiation.  So, the night sky really isn’t that dark in the first place!And we see this coming more or less evenly from all directions! That’s what our marvellous telescopes tell us. If you are wondering why we can’t see this Cosmic light, here’s why…  Our high resolution telescopes like The Hubble, use Infrared cameras. Distant stars and galaxies are moving away from us as the Universe is expanding. So, the Doppler Effect spoils the fun by making the light appear Redder to us! Yeah that’s Redshifting of Light. So, the further away they are, the faster they are moving away from us and they also appear to be more Redder!  Now the degree of Redshift the Light from the Big Bang undergoes is enormous. So much that the light no longer comes under the Visible part of the Spectrum! It becomes Infrared Light. And since the infrared light can be detected by cameras, our telescopes are able to capture them but not our curious Human Eyes. Infrared images look something like this…  Thanks For Reading :) ",
            "date": "Updated April 20, 2017",
            "views": "101",
            "upvotes": " View 136 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Oliver Grey",
                    "user_href": "/profile/Oliver-Grey-18"
                },
                {
                    "user_id": "Jannat Rushmi",
                    "user_href": "/profile/Jannat-Rushmi"
                },
                {
                    "user_id": "Abhishek Shivanand",
                    "user_href": "/profile/Abhishek-Shivanand"
                },
                {
                    "user_id": "Anjan Mehra",
                    "user_href": "/profile/Anjan-Mehra-4"
                },
                {
                    "user_id": "Vishal Rituraj",
                    "user_href": "/profile/Vishal-Rituraj"
                },
                {
                    "user_id": "Allan Minder",
                    "user_href": "/profile/Allan-Minder"
                },
                {
                    "user_id": "Meet",
                    "user_href": "/profile/Meet-134"
                },
                {
                    "user_id": "Kirtik Soni",
                    "user_href": "/profile/Kirtik-Soni"
                },
                {
                    "user_id": "Foram Chotalia",
                    "user_href": "/profile/Foram-Chotalia"
                },
                {
                    "user_id": "Dibakar Yadav",
                    "user_href": "/profile/Dibakar-Yadav"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rebecca Harbison",
                "href": "/profile/Rebecca-Harbison"
            },
            "answer_text": "Believe it or not, this is a seriously insightful question. It is dark in space because of the Big Bang. Yeah, that needs more of an explanation. So, the idea is that it is dark because there is no light — if you look at a star or a nebula (like the one in Orion’s belt), you see light. Even if you can’t make out the individual stars — the Milky Way, or the Andromeda galaxy to the unaided eye don’t show individual stars, but produce a hazy glow — you can still see light. But why isn’t there light? Well, you’re not looking at a star. But if the universe is infinite (as we think it is), in every direction there should be a star or something heated to starlike temperatures by absorbing starlight. This is called Olber’s paradox — that in an infinite and unchanging universe, the sky should be as bright as the Sun all over. So, that means that the unnerves isn’t infinite or is changing on large scales — the Big Bang fits this. The Big Bang postulates two things. The first is that the universe has a beginning — if we look far enough away, there isn’t time for light to get from there to here in the age of the universe. The second is that space is expanding ever since the Big Bang. The expansion of space actually stretches out light waves moving through space. This changes them from visible light, to infrared light, to microwave. If we look at the microwave sky, it faintly glows from a time early in the universe’s history where matter was close enough together it resembled the surface of a star (we call this the Cosmic Microwave Background). Space has expanded so much that this light has gotten fainter and is visible only at microwave wavelengths. So, I hope you learned a bit. ",
            "date": "Answered September 12, 2017",
            "views": "19",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sue Donym",
                    "user_href": "/profile/Sue-Donym-14"
                },
                {
                    "user_id": "Gary King",
                    "user_href": "/profile/Gary-King-89"
                },
                {
                    "user_id": "Sunil Mathpal",
                    "user_href": "/profile/Sunil-Mathpal"
                },
                {
                    "user_id": "Manish Mishra",
                    "user_href": "/profile/Manish-Mishra-340"
                },
                {
                    "user_id": "Yaseen Petersen",
                    "user_href": "/profile/Yaseen-Petersen"
                },
                {
                    "user_id": "Ankita Shinde",
                    "user_href": "/profile/Ankita-Shinde-5"
                },
                {
                    "user_id": "Haylee Cain",
                    "user_href": "/profile/Haylee-Cain"
                },
                {
                    "user_id": "Andrew Lonero",
                    "user_href": "/profile/Andrew-Lonero-1"
                },
                {
                    "user_id": "Lidija Milovanovic",
                    "user_href": "/profile/Lidija-Milovanovic"
                },
                {
                    "user_id": "Ngan Nguyen",
                    "user_href": "/profile/Ngan-Nguyen-108"
                }
            ]
        }
    ]
}