{
    "title": "Why is it important to zero the spectrophotometer? - Quora",
    "tags": [
        "Spectrophotometry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kris Silverman",
                "href": "/profile/Kris-Silverman"
            },
            "answer_text": "Why is it important to zero the spectrophotometer? Can’t say I know the specifics of a spectrophotometer. However, something I see taken for granted everywhere but precision manufacturing is Calibration - Wikipedia. instrument calibration and the metrologists who do so concern themselves with the things most people forget: that tape measure isn’t a perfect inch/cm. It has manufacturing flaws, tolerances of the instruments that make it, wear and tear, even weather that affect how long that tape actually is, and therefore how inaccurate it is. So when you’re measuring something, what is zero? What is one? truth is we’re blindly trusting the instrument in our hand, and unless you’ve gone through some lengths to verify or control those conditions, you’re rolling some dice that nothing changed much. In home construction, thats probably ok. In Aerospace, you can lose a multi-million dollar system over a small measurement futz. A spectrophotometer measures intensity based on at least the same two specific things for nearly all measurement tools in existence: its default state (in this case, no power to your light wave), and its excited state, which is often just measured as a difference from its zero state. Its the same reason that a scale that reads 1.0 with nothing on it will never be right. I have more familiarity with lower frequency RF; same principles apply. When an instrument is so finicky that you need to know or control air temp and humidity at a microwave level… I can’t imagine a higher frequency wave on the spectrophotometer are magically more forgiving. Something to think about it next time you grab a torque wrench for your lug nuts: how sure are you really that its measurement is right? If its older, how do you know it didn’t change? ",
            "date": "Answered September 1, 2020",
            "views": "24",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sankaran Murthy",
                    "user_href": "/profile/Sankaran-Murthy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tante Tagamolila",
                "href": "/profile/Tante-Tagamolila"
            },
            "answer_text": "To calibrate it, similar to the reason why you zero a weighing scale. For a spectrometer, you might calibrate it against a standard reagent. ",
            "date": "Answered September 2, 2020",
            "views": "6",
            "upvotes": "0"
        }
    ]
}