{
    "title": "Why is motion considered relative? - Quora",
    "tags": [
        "Motion (physics)",
        "Relativity (physics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Swingland",
                "href": "/profile/James-Swingland-1"
            },
            "answer_text": "Because it appears to be. Some things are absolutes, others are relative. My mass is 85kg. Notice I am not comparing myself to anything. This is absolute. I am currently east of the US, but west of Russia. That is a relative location. I cannot sensibly describe my position as east or west without including where that is relative to. Physics appears to be the same no matter what \"absolute\" speed you are doing. There is no way to identify an absolute speed. No way to measure it. No reason to. All that matters in any situation is your speed relative to something (the air, the wall, the planet etc). You are free to define your system of speeds however you want. Speed is arbitrary, so the simplest definition is to just take relative speeds...otherwise you'd keep adding/subtracting to get the absolutes. The requirement that speed is arbitrary - I.e. there are no absolutes, and the realisation that the speed of light is a physical constant (from Maxwell) allows you to derive all of special relativity. ",
            "date": "Answered May 29, 2016",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aayush Kafle",
                    "user_href": "/profile/Aayush-Kafle-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Schuhler",
                "href": "/profile/Michael-Schuhler"
            },
            "answer_text": "Motion is relative to the person viewing it. Say you are in a car going 120 MPH, and you are riding next to another car going the same speed in the same direction. From your viewpoint, you aren't moving relative to the car next to you. But if you were to look out the other side of the window, it would appear that the trees on the side of the road are speeding away from you, because you aren't moving relative to your car. If a gas station worker was out cleaning up some spilled gas, and you two drove past, he would see two speeding a-holes flying down the road, because the car is moving relative to him. I think you get the point. ",
            "date": "Answered May 30, 2016",
            "views": "14",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Minesi Rajapaksha",
                    "user_href": "/profile/Minesi-Rajapaksha"
                },
                {
                    "user_id": "Kaitlin Sheldrake",
                    "user_href": "/profile/Kaitlin-Sheldrake"
                }
            ]
        }
    ]
}