{
    "title": "Why do white people have black, brown, blond and even red hair while other races don't? - Quora",
    "tags": [
        "Population Genetics",
        "White Women",
        "Women",
        "Hair Color",
        "Genetics and Heredity",
        "Hair"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tan Teka",
                "href": "/profile/Tan-Teka"
            },
            "answer_text": "You have a lot of fantastic answers. However, the answer is actually a lot simpler. Theory of evolution talks about the evolution of human traits and human phenotypes as well. People in the Africans and middle east and asia have browner eyes and darker hair. It’s important to note that there is no such thing as a black color in nature, in fact. What you see as black is a deep concentration of a brown pigment. Meaning, black is a void color. That it actually doesn’t exist. It’s other colors making it black. Darker colors in high concentration become black or darker shade. You see this in blue vs navy blue. Red….really dark red. White is the nonexistence of any color. Meaning color is being stripped of something. In essence, such is true in human colors. People actually have blue/green, grey, colored eyes, etc., and brown exists in order to protect the eye from the sun. As does brown skin…..these are all pigments that are made my humans to keep the sun from burning your eyes and skin. The same goes for hair. It is all about the stripping of color. This is also the reason to why skin lightens very, very easily with bleaching or even when you see mixed race people…their skin might lighten very quickly, but keep their facial features or bone structure or hair or even eyes. Mixed individuals are very telling of this phenomenon. Usually, mixed individuals have lighter skin, but their bone structure keeps to a dominant side. Skin, both again lightens AND DARKENS easily. You go to the sun, skin darkness. You bleach it or stay out of the sun, skin lightenings. What is an interesting observation is if you have a caucasian person and an African individual mix, the rarest of combination you will get is one were the offspring is really dark-skinned with bone structure of caucasians. This is extremely rare to happen in fact. White people obviously also can darken their skin staying in the sun. But you never get a combination where a mixed individuals between a caucasian and African naturally comes out with really dark skin but keeping caucasian bone structure. When people die their hair blond, they are taking away the color. That’s what makes it blond….and that’s why it becomes brittle, because it is losing a lot of content. How this connects with genetics is something of a study. People that do have blond/blue/red, etc., hair do have genetics to go with it. Generally, no always, but very generally, bone structure also follows type of hair/eye/etc., color. So, if you have a blond person/blue eyes, they make that offspring, even if they are in Africa, etc. Sometimes, you see that white babies have blond hair, but the hair gets darker as they age. It’s a complicated phenomenon. ",
            "date": "Updated September 26, 2020",
            "views": "51",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hasan Khimjee",
                    "user_href": "/profile/Hasan-Khimjee"
                },
                {
                    "user_id": "Nataraja Ganapathy",
                    "user_href": "/profile/Nataraja-Ganapathy"
                },
                {
                    "user_id": "Adjiva77 7",
                    "user_href": "/profile/Adjiva77-7"
                },
                {
                    "user_id": "Cadri C",
                    "user_href": "/profile/Cadri-C"
                },
                {
                    "user_id": "Ramessu Amen-Bey",
                    "user_href": "/profile/Ramessu-Amen-Bey"
                },
                {
                    "user_id": "Harini Jayasankar",
                    "user_href": "/profile/Harini-Jayasankar-1"
                },
                {
                    "user_id": "Joe Heene",
                    "user_href": "/profile/Joe-Heene"
                }
            ]
        },
        {
            "author_info": {
                "name": "Collin Spears",
                "href": "/profile/Collin-Spears-1"
            },
            "answer_text": "The reality is no one really knows...but there is a lot of speculations, divergent theories. My favorite is by a researcher named Peter Frost.Why Do Europeans Have So Many Hair and Eye Colors? I think his time scale is off, but his general theory is correct.  It was due to sexual selection, this is why skin and hair lightened in Europe at such a fast pace (in the last 12,000 years) before that people we consider phenotypically Northern or Central European, did not exist.  That is an AMAZINGLY FAST RATE OF CHANGE for selection sweeps to take place.  If you consider 25 years per generation, and 12,000 years that is 480 generations. It seems the mix of light skin and eyes did not develop together in Europe but mixed together in Europe due to migration into Europe. I've talked about that more here: Collin Anthony Spears' answer to Were the Europeans during the middle ages black? So why so such a broad spectrum of skin and eye colors in Europeans and people on the borders of Europe? The Puzzle of European Hair, Eye, and Skin Color  Most humans have black hair, brown eyes, and brown skin. Europeans are different: their hair is also brown, flaxen, golden, or red, their eyes also blue, gray, hazel, or green, and their skin pale, almost like an albino’s. This is particularly the case in northern and eastern Europeans.How did this color scheme come about? Perhaps the same genes that lighten skin pigmentation also affect hair and eye pigmentation. Yet the genes are different in each case. Our skin became white mainly through the replacement of one allele by another at three separate genes. Our hair acquired a diverse palette of colors through a proliferation of new alleles at another gene. Our eyes acquired a similar palette through similar changes at yet another gene. SNIP  In sum, the European steppe-tundra was a singularity among the many environments that confronted early humans as they spread around the world. Food was abundant but accessible only to males of hunting age, whose ranks were thinned by hunting deaths. A surplus of single women developed, partly because men were fewer in number and partly because men could not easily bear the cost of providing for a second wife and her children. Women thus had to compete against each other for a smaller number of potential mates, the result being strong sexual selection for those women with eye-catching characteristics.  SNIP  Another witness is sex linkage. If sexual selection had acted on early European women, it should have directly modified their physical appearance. Since most genes have little or no sex linkage, this selection would have also indirectly modified the appearance of early European men. But there should still be some signs of sex linkage. We know, for example, that blue eyes are associated with a more feminine face shape. Other examples probably remain to be found.  Also adding my own \"2 Cent\", there was no environmental pressure to prevent mutation...look where Europe is on the map:    Europe is VERY far north...most of it, even Spain and Italy are north of most of the Continental United States....and much of Northern Europe is equal in level to Northern Canada, the only reason Europe is fairly warm is due to the Atlantic Ocean being somewhat of a modifying factor, the sun is fairly weak there, even weaker in winter, which is longer than in much of North America, definitely more longer than in China or most of Japan. With such weak sunlight most of the year there is no evolutionary pressure to maintain dark pigment to shield the skin from solar radiation. Here is a map of radiation levels, it's quite clear most Europeans live in the \"darkest\", yet most populated area of the world...   ",
            "date": "Answered August 16, 2015",
            "views": "271",
            "upvotes": " View 54 Upvoters",
            "upvoters": [
                {
                    "user_id": "Radu M",
                    "user_href": "/profile/Radu-M-4"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Kastila"
                },
                {
                    "user_id": "Javi GS",
                    "user_href": "/profile/Javi-GS-4"
                },
                {
                    "user_id": "Josette Harrison",
                    "user_href": "/profile/Josette-Harrison"
                },
                {
                    "user_id": "Quanghuy Tran",
                    "user_href": "/profile/Quanghuy-Tran"
                },
                {
                    "user_id": "Kedean Duffus",
                    "user_href": "/profile/Kedean-Duffus"
                },
                {
                    "user_id": "Greg Moten",
                    "user_href": "/profile/Greg-Moten-2"
                },
                {
                    "user_id": "Maria Valeska Bianchi",
                    "user_href": "/profile/Maria-Valeska-Bianchi"
                },
                {
                    "user_id": "Li Shu Yan",
                    "user_href": "/profile/Li-Shu-Yan"
                },
                {
                    "user_id": "Calle L. Heilborn",
                    "user_href": "/profile/Calle-L-Heilborn-1"
                }
            ]
        }
    ]
}