{
    "title": "Why does the moon's gravity cause tides on earth but the sun's gravity doesn't? - Quora",
    "tags": [
        "Tides",
        "Gravity of Earth",
        "The Sun",
        "The Moon (astronomy)",
        "Gravity",
        "Earth (planet)",
        "Astrophysics",
        "Planetary Science",
        "Astronomy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Grimshaw",
                "href": "/profile/Paul-Grimshaw-6"
            },
            "answer_text": "Why does the moon's gravity cause tides on earth but the sun's gravity doesn't? The premise is incorrect. Not only does the Sun influence Earth’s tides, its impact on them is almost a half of that of the Moon. Let’s first understand how the Moon causes tides. It is indeed because of the Moon’s gravitational pull on Earth, but if it were as simple as this then you would expect the Moon to pull upwards on the sea on the side of the Earth facing the Moon and downwards (through the Earth) on the side opposite. But this would cause a massive tidal effect once a day as Earth rotates, instead of a relatively small effect twice a day. So it can’t be this simple. Instead what’s actually going on is the balance of two forces. To understand this in the case of the Moon you have to understand what’s really going on with the Moon’s orbit. The Moon doesn’t actually orbit the centre of Earth with Earth staying still, but instead both orbit each other around their common centre of mass at a point between them called the orbital barycentre.  This barycentre is actually inside the Earth, around 2/3rds of the way from the centre towards the Moon. It’s at the origin where the axes cross in the picture above. The Moon’s orbit around this is the purple dashed line, and the Earth’s orbit around it is the blue dashed line. The diagram is to scale with the exception of the distance of the Moon from the Earth, which is actually around 10 times the scaled distance that I’ve shown. Now critically Earth’s orbit around this barycentre creates a centrifugal force on the Earth, which for the centre of the Earth is balanced by the Moon’s gravitational pull on the Earth. That’s what keeps the Earth in this orbit. But if you think about it then every point on Earth is going to experience the same centrifugal force, in the direction away from the Moon. (Note that the Earth is orbiting around the barycentre but not rotating with the orbit. This is different from the Moon for example which rotates in step with its orbit around the barycentre, and so keeping the same face towards the Earth.) However although the Moon’s gravitational force balances the centrifugal force at Earth’s centre, at points on the Earth further from the Moon the gravity will be slightly less due to the increased distance, resulting in a net force away from the Moon as the centrifugal force wins. Similarly on points closer to the Moon the Moon’s gravitational force wins, this time giving a net force towards the Moon. I’ve illustrated this imbalance with the blue and purple arrows, although the difference in the size of the purple Moon gravity arrows is highly exaggerated. So it’s the difference between these mismatching forces that causes the tides on Earth. The difference depends on the strength of the Moon’s gravity together with how much the Earth’s radius increases or reduces the distance from the Moon. The calculation for the net gravitational impact at the closest and furthest points on Earth relative to the Moon is: [math]\\qquad \\dfrac{Gm}{384400^2}-\\dfrac{Gm}{(384400+6378)^2}[/math] where [math]m[/math] is the Moon’s mass, 384400 the distance from the Moon in km, 6378 being the Earth radius in km, and [math]G[/math] the standard gravitation constant in the appropriate units. The answer comes out to be around 0.0000011 m/s² or 1.1 µm/s², which is a lot smaller than the Moon’s gravitational pull on Earth at around 0.000033 m/s². So what about the Sun? Well it’s exactly the same reasoning except that in this case what we’re interested in is the imbalance between the centrifugal force on Earth of the Earth’s orbit around the Sun (strictly the Sun-Earth barycentre but the difference here is negligible) and the Sun’s gravity on Earth. The worst case tidal impact of the Sun is therefore: [math]\\qquad \\dfrac{GM}{150000000^2}-\\dfrac{GM}{(150000000+6378)^2}[/math] with [math]M[/math] being the mass of the Sun and 150000000 km being the distance of the Sun from the Earth. This works out to be around 0.00000051 m/s² or 0.51 µm/s². So contrary to the premise in the question that the Sun has no tidal effect, in fact the Sun’s tidal influence on Earth is equal to around half that of the Moon[1]. (Some people may be surprised by this. The calculation above actually simplifies to equal approximately the influencing body’s gravity on Earth times the ratio of Earth’s diameter to its distance from the body. So the reason that the Sun’s tidal influence is so large despite its relatively large distance from Earth is that Sun’s gravity on Earth is also so much larger than the Moon’s, at around 0.006 m/s², due of course to the Sun’s relatively huge mass.) In practice it is the Sun’s tidal effect that causes most of the large variation in tides at different times of the month, with the large ones where Sun and Moon work together being the spring tides and the small ones where they work against each other being the neap tides. Footnotes[1] Tidal force - Wikipedia",
            "date": "Updated July 12, 2020",
            "views": "18",
            "upvotes": " View 21 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ron Wagner",
                    "user_href": "/profile/Ron-Wagner-2"
                },
                {
                    "user_id": "Mark Thomas Vetter",
                    "user_href": "/profile/Mark-Thomas-Vetter"
                },
                {
                    "user_id": "Roland Giersig",
                    "user_href": "/profile/Roland-Giersig"
                },
                {
                    "user_id": "John Prichard",
                    "user_href": "/profile/John-Prichard-12"
                },
                {
                    "user_id": "Tony White",
                    "user_href": "/profile/Tony-White-19"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Migs-Mortz"
                },
                {
                    "user_id": "Mitul Patel",
                    "user_href": "/profile/Mitul-Patel-657"
                },
                {
                    "user_id": "Krišjānis Liepiņš",
                    "user_href": "/profile/Krišjānis-Liepiņš"
                },
                {
                    "user_id": "Zachary Tay",
                    "user_href": "/profile/Zachary-Tay-5"
                },
                {
                    "user_id": "Hermanpaye .",
                    "user_href": "/profile/Hermanpaye"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mahmud Husain",
                "href": "/profile/Mahmud-Husain-5"
            },
            "answer_text": " This is a good question. An easy, one line answer for this could be : Wind from a fan could fly away a piece of paper, but a cyclone or tornado can fly your house away. Nobody ask, why a tornado does not fly away a piece of paper Now, let us see the fact behind it. First we need to know the size and distance. You have seen toy cars many times. Those toy car have everything in a small and proportionally correct size. You can call them, a model of car. Let us make a model of Sun, Earth and Moon. The size and distance will be proportional. This model will be very small. The model earth will be a size of a golf ball. Very small and shiny. You can not see anything on that model earth. The great wall of china, Eiffel tower, Burj Khalifa, Gteat pyramid, everything will be so small that you can not see that. Only, the Mount Everest (almost 9 km high) will be felt like a small dot when touched. I hope, you understand, how small the model earth is. Let us make a model moon. That model moon will be at a size of a green peas and will be 110 meters away. Let us make the sun. The model sun will be a giant ball of fire as big as a tennis court and will be 37 kilometers away from the golf ball sized model earth. The moon is 110 meters away, the sun is 37 kilometers away. The point I am trying to make is, the sun is too far to have a small impact like tide. Now, let us know about the gravity and it's effect. Take a small piece of stone, tie that up with a short rope. Hold the other end of the rope and quickly rotate that rope above your head. The stone will move around you in a circle. You are in the centre and the stone rotates around you. The stone rotates around you for two reasons. One , the velocity (speed). Two, it is tied with your hand by a rope. You stop the speed, the stone will hang in your arm. Leave the rope, the stone will fly away. In fact, the stone does NOT want to rotate around you. It wants to fly away. The rope stops the stone to fly away. The same mechanism is used, when the earth rotates the sun. The earth moves very fast and want to fly away and get lost in the space. But, the strong gravity if the sun is holding the earth. The same way, the moon moves around the earth. By it's gravity, the sun is holding the whole earth. Sun does not do small things like tides. Moon have very small gravity and can make tides. Yes, I am back to that point, tornado can fly away a whole house. For flying away papers, there are fans. ",
            "date": "Answered June 25, 2020",
            "views": "114",
            "upvotes": " View 60 Upvoters ",
            "upvoters": [
                {
                    "user_id": "BD Pandey",
                    "user_href": "/profile/BD-Pandey-4"
                },
                {
                    "user_id": "Abdul Rafey Farooqi",
                    "user_href": "/profile/Abdul-Rafey-Farooqi"
                },
                {
                    "user_id": "Lawrence Mokpai",
                    "user_href": "/profile/Lawrence-Mokpai"
                },
                {
                    "user_id": "Najib Fadil",
                    "user_href": "/profile/Najib-Fadil"
                },
                {
                    "user_id": "Dinesh Rajan",
                    "user_href": "/profile/Dinesh-Rajan-2"
                },
                {
                    "user_id": "Mostafa Farhan Haque",
                    "user_href": "/profile/Mostafa-Farhan-Haque"
                },
                {
                    "user_id": "Shamim Mahmud Ahmed",
                    "user_href": "/profile/Shamim-Mahmud-Ahmed"
                },
                {
                    "user_id": "Mark Chambers",
                    "user_href": "/profile/Mark-Chambers-109"
                },
                {
                    "user_id": "Alankar Choudhary",
                    "user_href": "/profile/Alankar-Choudhary"
                },
                {
                    "user_id": "Ramanuja Chakraborty",
                    "user_href": "/profile/Ramanuja-Chakraborty"
                }
            ]
        }
    ]
}