{
    "title": "Why are enzymes secreted in an inactive form? - Quora",
    "tags": [
        "Enzymology",
        "Enzymes",
        "Biochemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Debayan Chaudhury",
                "href": "/profile/Debayan-Chaudhury"
            },
            "answer_text": "Sudarshan K K has nicely summarized one part of the picture, namely the easier transport of inactive enzymes as compared to the transport of functionally active enzymes. Another main aspect of the reason as to why enzymes are secreted in an inactive form would be to regulate the function of the enzyme. Biological network design is intricate and exquisite, and a tight control over all aspects of cell functioning is necessary for life. Enzymes are no different, and the activity of an enzyme is generally controlled by inhibitors (which decrease activity) and allosteric factors (which both increase/decrease) activity within the cell. An interesting case study (and the textbook example) would be the serine proteases. The serine proteases comprise of a family of enzymes such as typsin and chymotrypsin (which are common digestive enzymes) and are secreted in their inactive forms, trypsinogen and chymotrypsinogen respectively. This is understandable as the active form of the digestive enzymes are responsible for the cleavage of peptide bonds in proteins (effectively digesting the protein) and therefore could cause serious damage to cellular proteins (leading to some form of self digestion). Indeed, the Wikipedia page for Trypsinogen - Wikipedia states that around 5% of trypsinogen gets activated in the pancreas, and we have evolved significant defenses to prevent such inappropriate activation. Trypsinogen is essentially nothing but a longer form of the enzyme which functionally gets restricted to structural factors-I am not sure of the exact mechanism. Trypsiongen on the appropriate cleavage gives the active form of the enzyme trypsin. ",
            "date": "Answered April 28, 2017",
            "views": "95",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Awais Ahmed",
                    "user_href": "/profile/Awais-Ahmed-110"
                },
                {
                    "user_id": "M M",
                    "user_href": "/profile/M-M-1978"
                },
                {
                    "user_id": "Urshalla Gupta",
                    "user_href": "/profile/Urshalla-Gupta"
                },
                {
                    "user_id": "Hitakshi Buttan",
                    "user_href": "/profile/Hitakshi-Buttan"
                },
                {
                    "user_id": "Tuba Koraye",
                    "user_href": "/profile/Tuba-Koraye"
                },
                {
                    "user_id": "Lenka Kralikova",
                    "user_href": "/profile/Lenka-Kralikova"
                },
                {
                    "user_id": "Shritej Chavan",
                    "user_href": "/profile/Shritej-Chavan"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Aarunee-Krishna"
                },
                {
                    "user_id": "Shubh Agarwal",
                    "user_href": "/profile/Shubh-Agarwal-63"
                },
                {
                    "user_id": "Diwakar Singh",
                    "user_href": "/profile/Diwakar-Singh-251"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dharti Maadam",
                "href": "/profile/Dharti-Maadam"
            },
            "answer_text": "Enzymes are known to accompany a chemical reaction by helping in its process. It is necessary that the enzymes be in their inactive form to avoid it's reaction with other cells/tissues. For example, Trypsinogen is the inactive form of trypsin acting in the intestine (produced by the pancreas). It is converted into Trypsin with the help of enzyme Enterokinase which is produced in the Succus entericus. Trypsin is known to digest proteins converting bipeptides and polypeptides into amino acids. However, apart from the protein content in the food present in the GI tract, there are also proteins in the cells of the smooth muscles which forms the alimentary canal. Cells have their plasma membrane made up of phospholipids and proteins. If trypsin is present in its active form all the time (i.e. even in the absence of food in the GI tract) the enzyme can digest the protein of the smooth muscle cells, thus distorting its structure and function. Therefore, it is necessary for the enzyme to be present in its inactive form. ",
            "date": "Answered January 9, 2018",
            "views": "12",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Edith Kokuhumuliza",
                    "user_href": "/profile/Edith-Kokuhumuliza"
                },
                {
                    "user_id": "Rory Maguire",
                    "user_href": "/profile/Rory-Maguire-13"
                },
                {
                    "user_id": "Rawan Adel",
                    "user_href": "/profile/Rawan-Adel-3"
                },
                {
                    "user_id": "Sonali Thakur Saniya",
                    "user_href": "/profile/Sonali-Thakur-Saniya"
                },
                {
                    "user_id": "Sudipta Ghosh",
                    "user_href": "/profile/Sudipta-Ghosh-230"
                },
                {
                    "user_id": "V Varun Kashyap",
                    "user_href": "/profile/V-Varun-Kashyap"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/ABD-HUNTED"
                },
                {
                    "user_id": "M M",
                    "user_href": "/profile/M-M-1978"
                },
                {
                    "user_id": "KAILASH PRAJAPAT",
                    "user_href": "/profile/KAILASH-PRAJAPAT-10"
                },
                {
                    "user_id": "Oliver Clennan",
                    "user_href": "/profile/Oliver-Clennan"
                }
            ]
        }
    ]
}