{
    "title": "Why do volcanoes erupt? - Quora",
    "tags": [
        "Volcanoes"
    ],
    "response": [
        {
            "author_info": {
                "name": "Emily Devenport",
                "href": "/profile/Emily-Devenport"
            },
            "answer_text": "Pressure is what causes volcanoes to erupt. The pressure is caused by some combination of heat and/or gases. The popular image is of a composite volcano, like Mount Aetna, spewing lava. But composite volcanoes usually act more like Mount St. Helens did, erupting with a pyroclastic explosion full of ash and super-heated gases. The runny lava you see on TV is more likely to erupt from a shield volcano, like Kilauea in Hawaii. With Kilauea, the pressure is caused mostly by the heat of the magma. With Mount Saint Helens, it was caused by a combination of magma and gases. There are volcanic features called maar craters that are caused by gas explosions (no lava involved). Here’s a link to a site about one of those in Death Valley NP: Death Valley National Park (U.S. National Park Service) Mud volcanoes can also be caused by pressure from gas, with no lava involved: Mud volcano - Wikipedia And finally, eruptions can be relatively nonviolent and slow, producing lava domes: Lava dome - Wikipedia The magma that produces that sort of feature has a higher ratio of silica, and is more viscous (sticky). There is very little gas involved. I like to imagine the lava extruding like toothpaste (this is a fanciful notion, since toothpaste is not super-hot). The most explosive volcanoes have a high content of volatile gases. The big boom occurs when the gases are suddenly released, like soda pop that was shaken inside its can and then released when the tab is popped. ",
            "date": "Updated June 30, 2019",
            "views": "2",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shamita Kate Secillano",
                    "user_href": "/profile/Shamita-Kate-Secillano"
                },
                {
                    "user_id": "Yannick Kremer",
                    "user_href": "/profile/Yannick-Kremer"
                },
                {
                    "user_id": "Tait Rief",
                    "user_href": "/profile/Tait-Rief"
                },
                {
                    "user_id": "Samuel Soohoo",
                    "user_href": "/profile/Samuel-Soohoo"
                },
                {
                    "user_id": "Arsa Gafna",
                    "user_href": "/profile/Arsa-Gafna"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maya Tripathi",
                "href": "/profile/Maya-Tripathi"
            },
            "answer_text": "For a better understanding of what causes a volcano to erupt we should know the answer to the following questions. 1. What is the internal structure of earth? 2. What is a volcano? 3. Is there any distribution pattern of Volcanoes around the globe? Lets us start with the internal structure of earth  Now Crust and Upper mantle , together know as lithosphere and it is broken into several plates known as tectonic plate. These plates are in relative movement to each other and the relative movement of the plates typically ranges from zero to 100 mm annually.  now what is a volcano? A Volcano is a rupture in the crust of a Earth, that allows hot lava, Volcanic ash, and gases to escape from a magma chamber below the surface.  As volcanoes are opening or cracks in the crust of Earth and lithosphere is broken into several plates so with the help of this information we can understand that volcanoes are mainly distributed along the plate margins. let us check whether there any distribution pattern of Volcanoes around the globe?  we can see the distribution of volcano is along the plate margins mainly. What causes a volcano to erupt? When a part of the earth's upper mantle or lower crust melts, magma forms and a volcano is essentially an opening or a vent through which this magma and the dissolved gases it contains are discharged. Although there are several factors triggering a volcanic eruption, three predominate: 1.the buoyancy of the magma As rock inside the earth melts, its mass remains the same while its volume increases--producing a melt that is less dense than the surrounding rock. This lighter magma then rises toward the surface by virtue of its buoyancy. If the density of the magma between the zone of its generation and the surface is less than that of the surrounding and overlying rocks, the magma reaches the surface and erupts. 2. the pressure from the exsolved gases in the magma Magmas of so-called andesitic and rhyolitic compositions also contain dissolved volatiles such as water, sulfur dioxide and carbon dioxide. Experiments have shown that the amount of a dissolved gas in magma (its solubility) at atmospheric pressure is zero, but rises with increasing pressure. For example, in an andesitic magma saturated with water and six kilometers below the surface, about 5 percent of its weight is dissolved water. As this magma moves toward the surface, the solubility of the water in the magma decreases, and so the excess water separates from the magma in the form of bubbles. As the magma moves closer to the surface, more and more water exsolves from the magma, thereby increasing the gas/magma ratio in the conduit. When the volume of bubbles reaches about 75 percent, the magma disintegrates to pyroclasts (partially molten and solid fragments) and erupts explosively 3.the injection of a new batch of magma into an already filled magma chamber This injection forces some of the magma in the chamber to move up in the conduit and erupt at the surface. Image source: Google ",
            "date": "Answered February 20, 2017",
            "views": "47",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Abhishek Kasar Patil",
                    "user_href": "/profile/Abhishek-Kasar-Patil"
                },
                {
                    "user_id": "Prathamesh Pilankar",
                    "user_href": "/profile/Prathamesh-Pilankar"
                },
                {
                    "user_id": "Khushee Yadav",
                    "user_href": "/profile/Khushee-Yadav-3"
                },
                {
                    "user_id": "Navjot Kaur",
                    "user_href": "/profile/Navjot-Kaur-1138"
                },
                {
                    "user_id": "Epanije",
                    "user_href": "/profile/Epanije"
                },
                {
                    "user_id": "Ishan Yadav",
                    "user_href": "/profile/Ishan-Yadav-47"
                },
                {
                    "user_id": "Yannick Kremer",
                    "user_href": "/profile/Yannick-Kremer"
                },
                {
                    "user_id": "Prasanta Kumar Baro",
                    "user_href": "/profile/Prasanta-Kumar-Baro"
                },
                {
                    "user_id": "Saif Ali",
                    "user_href": "/profile/Saif-Ali-166"
                },
                {
                    "user_id": "Abhishek Kumar Lal",
                    "user_href": "/profile/Abhishek-Kumar-Lal-1"
                }
            ]
        }
    ]
}