{
    "title": "Why is falsifiability important? - Quora",
    "tags": [
        "Falsifiability in Physics",
        "Scientific Method",
        "Philosophy of Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marcus Geduld",
                "href": "/profile/Marcus-Geduld"
            },
            "answer_text": "Science is a tool for helping us make accurate predictions. In order to refine it--so that our predictions become more accurate in the future than they are now--we need to ask questions and try to answer them.  For instance, we could ask the question, \"Do cats purr by swallowing rocks and then rattling them inside their stomachs?\" To answer it, we can take the concrete steps of observing cats to see if they actually swallow rocks. Then, we can x-ray them while they're purring to see if the rocks they swallowed are vibrating. Multiple people can repeat these steps, each confirming or negating the question. In the end, we'll have a better model of purring--even if all we've done is to have ruled out a possibility.  \"Do cats purr by swallowing rocks...?\" is falsifiable. Or, rather, the same question in the form of a statement--\"Cats purr by swallowing rocks...\"--is falsifiable in the sense that there are specific things we can do to prove it wrong. By succeeding or failing in that proof, we refine our model, and we can then use the refined model to make better predictions, e.g. about what will or won't happen as a result of a cat swallowing some rocks. \"Cats purr because their spirit essences are anxious\" is not falsifiable. It may be true; it may be false. But there are no concrete, repeatable steps we can take to know. We can't measure spirit essences or know whether they're anxious or not.  If I try to falsify the claim by saying, \"I've dissected 100 cats and haven't found a spirit essence inside any of them,\" you can reply, \"Well, that's because spirit essences can't be seen by the naked eye or detected by scientific instruments.\" Which gets us nowhere. As before, the claim might be true or it might be false. Our model is the same as it was, and our predictions haven't improved. ",
            "date": "Answered June 28, 2015",
            "views": "61",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Derrick Lanigan",
                    "user_href": "/profile/Derrick-Lanigan"
                },
                {
                    "user_id": "Ronniel Padua",
                    "user_href": "/profile/Ronniel-Padua"
                },
                {
                    "user_id": "Sarah M",
                    "user_href": "/profile/Sarah-M-287"
                },
                {
                    "user_id": "Razan Ibrahim Omer",
                    "user_href": "/profile/Razan-Ibrahim-Omer"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/A-B-David"
                },
                {
                    "user_id": "Arjun S Nath",
                    "user_href": "/profile/Arjun-S-Nath"
                },
                {
                    "user_id": "Kurien Kalarickal",
                    "user_href": "/profile/Kurien-Kalarickal"
                },
                {
                    "user_id": "Andrei Streche",
                    "user_href": "/profile/Andrei-Streche"
                },
                {
                    "user_id": "R. Eric Sawyer",
                    "user_href": "/profile/R-Eric-Sawyer"
                },
                {
                    "user_id": "Brad Tittle",
                    "user_href": "/profile/Brad-Tittle"
                }
            ]
        },
        {
            "author_info": {
                "name": "William La Chenal",
                "href": "/profile/William-La-Chenal"
            },
            "answer_text": "Why is falsifiability important?Mainly, because Karl Popper said so, and a huge majority of scientist are in awe of his reputation, so they defer to his authority.To the extent that, if anyone disagrees, they risk being denigrated as \"unscientific\", shouted at, and voted down. One of the things Popper was trying to get away from, of course, was just that kind of \"authority\". His ghost probably complains that most people don't understand what he meant. Other thoughts of Popper appeal to me , culturally, as quite sound - such as science being a matter of trial and error, a general process for arriving at what it useful. The falsifiability criterion however is overly reductionist (though one can see how it arises from ancient thought). The main problem arising (as I see it) is that anything innately true, cannot be falsfied. It is true, it cannot be false. Opinions about it can be falsified, the thing itself cannot. (There's a difference he noted, between intrinsic & extrinsic validity, also to do with prior perceptions.)This leads to inexorably to the decision that innate truths of nature are 'unscientific', and the implication that they are therefore untrue. Consider existence itself. Then, as corollary, consider the natural behaviours of existence, themselves. Popperian 'science' can never reach these truths. Many followers of Popper's view will expressly deny a phenomenon which does not fit with their view of how science is 'established'. Eheu, argumentum ad verecundiam, iterum. We see that with some modern scientists who refuse to accept observation as a primary consideration, unless it is verified by some arbitrary test outside of generality. I can see why they do that, I see also some of them can have difficulty in telling when they are wrong, if they insist on a test which is inappropriate. Popper is not the one and only philosopher of Science. Some very insighful thinkers, such as Susan Haack, have completely given up on him. I understand she would say that 'science' as we currently know it is a social construct, and has little to do with a search for truth but only for agreement and therefore influence. It risks becoming a reflection of the mediæval Church.No-one expected that. ~~~~ Wow. One upvote (thanks!). I’m whelmed. ",
            "date": "Updated February 24, 2017",
            "views": "17",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vicky Krishnan",
                    "user_href": "/profile/Vicky-Krishnan"
                },
                {
                    "user_id": "Aromal Shreyas",
                    "user_href": "/profile/Aromal-Shreyas"
                },
                {
                    "user_id": "Ashiry Juma",
                    "user_href": "/profile/Ashiry-Juma"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/A-B-David"
                }
            ]
        }
    ]
}