{
    "title": "Why do some objects move continuously while some moving objects stop suddenly? - Quora",
    "tags": [
        "Objects",
        "Relativity (physics)",
        "Physics of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Murad Shah",
                "href": "/profile/Murad-Shah-6"
            },
            "answer_text": "Because of friction.  Friction is a force that acts in the opposite direction to the motion. Here’s a little experiment that you can do right now:Take a pen and push it on a carpet,calculate the distance it moved.Then do the same thing on a flat surface like a table or floor.You’ll notice that the pen moves further on a smooth surface rather than on a rough one,because there is less friction there. Now do the same thing with a smooth glass.Again you’ll notice that when a smooth object moves through a smooth surface there is less friction(object moves further without stopping) than when a rough object moves through a smooth surface. This is all considering that there’s no other force acting on an object.Newton’s First Law states: An object will remain at rest or in uniform motion in a straight line unless acted upon by an external force (Newton's Laws) So to answer your question: The reason why some objects move for a longer period of time than others is because of a force known as friction. Fun fact: If you throw a ball in space it’ll (probably) move on forever if not affected by planet’s and star’s gravity. Any corrections and suggestions are more than welcomed. ",
            "date": "Answered January 25, 2018",
            "views": "18",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jaime Andrade",
                    "user_href": "/profile/Jaime-Andrade-15"
                },
                {
                    "user_id": "DizesAaron",
                    "user_href": "/profile/DizesAaron"
                },
                {
                    "user_id": "Utsav Nautiyal",
                    "user_href": "/profile/Utsav-Nautiyal-2"
                },
                {
                    "user_id": "Wyatt Stewart",
                    "user_href": "/profile/Wyatt-Stewart"
                },
                {
                    "user_id": "Sujoy Mukerji",
                    "user_href": "/profile/Sujoy-Mukerji"
                }
            ]
        },
        {
            "author_info": {
                "name": "Simon Bridge",
                "href": "/profile/Simon-Bridge-1"
            },
            "answer_text": "Some moving objects encounter opposition to their movement… the opposition can be quite strong and abrupt. For details, I would need an example. I take it you are not puzzled about how some people keep walking, some speed up and slow down, and some suddenly stop? I take it you are not puzzled about why a car comes to an abrupt stop when it hits a wall, while the car next to it, missing the wall, keeps going? So what are you talking about? ",
            "date": "Answered February 10, 2020",
            "views": "224",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Brett Schmidt",
                    "user_href": "/profile/Brett-Schmidt-5"
                }
            ]
        }
    ]
}