{
    "title": "Why can things other than photons emit light? - Quora",
    "tags": [
        "Light (physics)",
        "Photons",
        "Visible Light",
        "Relativity (physics)",
        "Particle Physics",
        "Science of Everyday Life",
        "Physics of Everyday Life",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nirmalendu Das",
                "href": "/profile/Nirmalendu-Das-1"
            },
            "answer_text": "All matter made by photons. If we classify E = mc^2, we see that matter is converting to photons. In the universe, the matter created first from black particle. Photon, Graviton particle create from black particle. When all particles are made by photons, then, all matter can radiate energy and energy means light particle. Due to difference of bunch of photons, different matter created as formed different properties. Even, alpha, bita, gamma, different types of subatomic particles, quarks, Higss, etc are made by photons. Its mass is 1.659x10^-54 gm, energy 9.30x10^-22 ev. The photon itself colorless like Diamond. Why ? Because, before Big Bang, early universe was completely filled by unexpected huge amount of black particles. Once up on a time, black particles dense together with creating unthinkable force, thrush and produced first photons and gravitons particle. 10^24 black particles makes a photon. 10^18 black particles yield graviton particle. What is the Logic of it ? We know coal mine, huge amount of coal is there, but only few diamond we found. Coal is carbon, diamond is carbon, but structure and properties are different. Likewise, black particle and photon. So, we can classify photon that born from black particle. Only bunch of photon can emit light. All answer written in my book “Endless Theory of the Universe (Complete Unified Theory)”, Published by LAP LAMBERT, Germany, 2014. This theory is single theory, we can explain all from particle to the universe. ",
            "date": "Answered July 28, 2019",
            "views": "96",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nicholas Schiff",
                "href": "/profile/Nicholas-Schiff"
            },
            "answer_text": "Photons do not emit light. Light is photons. Photons are the particles of electromagnetic radiation, including visible light. ",
            "date": "Answered July 24, 2019",
            "views": "28",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Charlie (Chaddyfynn) Perkins",
                    "user_href": "/profile/Charlie-Chaddyfynn-Perkins"
                },
                {
                    "user_id": "TJ Berens",
                    "user_href": "/profile/TJ-Berens"
                },
                {
                    "user_id": "Tommy White",
                    "user_href": "/profile/Tommy-White-67"
                },
                {
                    "user_id": "Norman Simenson",
                    "user_href": "/profile/Norman-Simenson-1"
                },
                {
                    "user_id": "Brent Meeker",
                    "user_href": "/profile/Brent-Meeker"
                }
            ]
        }
    ]
}