{
    "title": "Why is 30 minutes of exercise per day considered the 'magic number?' - Quora",
    "tags": [
        "Healthy Exercise",
        "Health and Exercise",
        "Healthy Living",
        "Exercise",
        "Fitness"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bev Morrissy-Merriman",
                "href": "/profile/Bev-Morrissey-Merriman"
            },
            "answer_text": "Well, frankly who knows? But I think a lot of government health units chose that number because they’re trying to do something about the growing levels of physically unfit obese people, given the cost of taking care of them as the years go by. I always remember our vet saying to us “fat dogs keep me in business!” Yup, a stark reality about how chronic overweight and high body fat percentages will wreak havoc on biochemical bodys!!! When you think about it, 30 minutes sounds do-able for sedentary people who are contemplating exercise. Personally I like to exercise 60 minutes daily for anywhere from 4–6 days weekly. And I do about 80% resistance/weight anaerobic training and about 20% aerobic exercise. ",
            "date": "Answered June 8, 2020",
            "views": "269",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Justin Stanchfield",
                    "user_href": "/profile/Justin-Stanchfield"
                }
            ]
        },
        {
            "author_info": {
                "name": "Darren Beattie",
                "href": "/profile/Darren-Beattie"
            },
            "answer_text": "It’s not “magic.” 150 minutes of moderate activity per week is a common health association recommendation. This adds up to 30 minutes of exercise Monday through Friday. That’s all. However, 75 minutes of vigorous activity per week is also a common health association recommendation. Meaning 25 minutes of intense exercise Monday, Wednesday, Friday (or whatever split gives you a day of recovery). The “magic” amount of exercise is the amount of exercise you’ll actually do. ",
            "date": "Answered June 5, 2020",
            "views": "258",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Marilyn Hubbard",
                    "user_href": "/profile/Marilyn-Hubbard-1"
                },
                {
                    "user_id": "Lucia R. Hicks",
                    "user_href": "/profile/Lucia-R-Hicks"
                },
                {
                    "user_id": "Sudarshan Konge",
                    "user_href": "/profile/Sudarshan-Konge"
                },
                {
                    "user_id": "Justin Stanchfield",
                    "user_href": "/profile/Justin-Stanchfield-1"
                },
                {
                    "user_id": "Darren Charles Bates",
                    "user_href": "/profile/Darren-Charles-Bates-1"
                }
            ]
        }
    ]
}