{
    "title": "Why is it that string theory is so popular? - Quora",
    "tags": [
        "M-theory",
        "String Theory",
        "Theoretical Physics",
        "Particle Physics"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Cousens",
                "href": "/profile/David-Cousens"
            },
            "answer_text": "Physics is not a popularity contest, at least in the conventional sense. String theory is being explored as one possible methodology for combining quantum field theory and general relativity into a single theory. Other ways of achieving this are also being explored - see quantum loop gravity for example. So far no-one has been able to test whether string theory makes any predictions which are different from other competing theories and that agree better with what we observe in nature. At this stage string theory is only a contender for a unified theory and not experimentally confirmed as a unified theory of physics. Physicists who work on string theory or the alternatives may have a bias towards the theory they are working on and the general physics community will have a range of opinions about which route they may think is more likely to succeed but until a critical experimental test can be designed and performed these remain only opinions and preferences not established physics. Physics research is an exploratory endeavour where one often has to follow many metaphorical blind alleys to the end to find out they are unproductive before hopefully eventually finding the one which is not closed off. Physicists may use their intuition based on which sort of ideas have been successful in other areas of investigation to guide which alleys they explore first in the hope of finding the open one quickly. ",
            "date": "Answered September 27, 2019",
            "views": "116",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alan Monday",
                    "user_href": "/profile/Alan-Monday"
                },
                {
                    "user_id": "Andy Briggs",
                    "user_href": "/profile/Andy-Briggs-11"
                },
                {
                    "user_id": "Gwydion Madawc Williams",
                    "user_href": "/profile/Gwydion-Madawc-Williams"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alan Monday",
                "href": "/profile/Alan-Monday"
            },
            "answer_text": "It is only popular in the Myth Creating popular science press to sell advertising. But, it is completely dis-favored now. The lastest run of the Large Hadron Collider has ruled out all the important predictions. Popularity in this case would be to draw more Graduates to the field. The opposite is happening. In fact, the TV comedy show, Big Bang Theory, has the Physicist, Sheldon Cooper abandoning String Theory for Dark Matter Theory. So, it is sort of a double joke in that both Theories are turning out to be tail chasing, career killing, dead end efforts ",
            "date": "Answered September 30, 2019",
            "views": "43",
            "upvotes": "0"
        }
    ]
}