{
    "title": "Why does anything exist? Before there was something, there was nothing. And out of nothing, how did we get something? - Quora",
    "tags": [
        "Nothing",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Prashant Ravindra Murarilal Sitaram Gupta",
                "href": "/profile/Prashant-Ravindra-Murarilal-Sitaram-Gupta"
            },
            "answer_text": "Clever question, I was thinking about this last week when a meme popped up saying “If matter can not be created nor be destroyed how was it created in the first place?” Our science has effectively traced back our origin to the point of singularity. Unfortunately what happened before that time is out of our perspective. Think of it this way. It is your father’s birthday. You and your mother had decided to bake a double layered cake. Mother had promised us that she will bake the bigger bottom part and will assist you in making the smaller layer to be placed on top of it, or you can bake it yourself in case she had to leave for the market to do some other shopping by following the instructions in the recipe book. You went to school, and mother has done preparing her part of the cake. Unfortunately, the oven has malfunctioned after preparing that cake, and mother had to take it to the nearest electrical shop. You reached home, there is a delicious mouth watering cake waiting for you in the kitchen. You look around for your mother, she isn’t there. You look for the recipe book. It is there. You start preparing it. You have got yourself a batter and a not so clean kitchen, when the instructions read, Bake the batter in the oven. You look around. What is this oven? There is a picture of it in the book, but there is nothing similar to it in your kitchen. You wonder, “Mother has already made a cake. But how is it possible without this oven thing?” You have a cake that means there must be something our mother did to bake that cake.  Bottom line is, we have to take account of factor that we might not have entire information with us.  ",
            "date": "Answered April 20, 2018",
            "views": "378",
            "upvotes": " Answer requested by Quora User"
        }
    ]
}