{
    "title": "Why do Americans use different linear and weight measurements? - Quora",
    "tags": [
        "Measurements",
        "American Ethnicity and People",
        "Science of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Scott Priddy",
                "href": "/profile/Scott-Priddy"
            },
            "answer_text": "It's not so much that they chose to do things differently as it is that they didn't choose to change the system they were using.  The USA is older than the metric system, and the great start of the metric system came with the Napoleonic era.  Additionally, most countries that had not yet industrialized at the time the metric system was created simply brought the metric system in along with all the other systems relating to the process of industrialization and/or westernization.  The greatest hold-outs have been in the Anglophone world (the English-speaking countries), because they were never coquered by Napoleon, they were already industrialized, and they formed a large body of relative independence.  Thus the US, UK, Canada, etc. have held out longer, and the transition in places like the UK are still incomplete (cooking, for instance, is still done in cups and ounces rather than mL and grams, and body weight is measured in \"stone\"). The USA, being the largest and most independent of the non-French (not falling into French control, directly or indirectly in the 19th Century) nations industrialized and commercialized before the introduction of the metric system, has had the largest inertia in maintaining its older and less efficient system (owing to the larger social and physical transition required to change, and by the larger number of people that have to come together to agree to change to get the ball rolling). ",
            "date": "Answered January 9, 2015",
            "views": "380",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Wen Gu",
                    "user_href": "/profile/Wen-Gu-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rod Young",
                "href": "/profile/Rod-Young"
            },
            "answer_text": "It is a little more complicated than what  others have suggested.In the U. S. many grocery products have both systems listed.I can buy a coke in a 12 oz. can or a 2 liter bottle.  Many industries use metric units. Hover we still use miles and gallons on the road.Though some cities have distances in both english and metric. ",
            "date": "Answered January 10, 2015",
            "views": "139",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Waqar Hussain",
                    "user_href": "/profile/Waqar-Hussain-40"
                },
                {
                    "user_id": "Brandyn Krol",
                    "user_href": "/profile/Brandyn-Krol"
                }
            ]
        }
    ]
}