{
    "title": "Why doesn’t bicarbonate ion hydrolyse to carbonate ion in water? - Quora",
    "tags": [
        "Bicarbonate Ion",
        "Bicarbonate",
        "Ions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kasper Emil Feld",
                "href": "/profile/Kasper-Emil-Feld"
            },
            "answer_text": "It does, all the time, it just very quickly picks up a new hydrogen ion to form bicarbonate again. Of course the more acidic the water the quicker it will pick a new one up. In order for the dissociation to be faster than the reconnection, hydronium ions need to be rare enough. In pure or acidic water there are far too many hydronium ions. You need to increase the pH of the water to 10.6 in order for the ions to be found in the carbonate form half of the time. This is also known as the pKa of the bicarbonate ion. So why does the carbonate ion pick up hydrogen so relatively easily? Well, opposite charges attract and carbonate have two negative charges. You are actually quite hard pressed to find double anions which wouldn’t be even quicker to pick up hydrogens. Compare [math]CH_3^-[/math] which will definitely not give up a second hydrogen ion, but rather grab them from anywhere. Bicarbonate quite easily dissociates, in other words is quite acidic, for an anion. It is quite acidic because the oxygens are capable of sharing the charge. What you are really asking is: “Why is bicarbonate only weakly acidic? Why is it not a stronger acid?” Well few anions are. Hydrogen sulfide ([math]HSO_4^-[/math]) comes to mind. It stays as sulfate much easier (pKa ~ 2), but well it does have four oxygen atoms. ",
            "date": "Answered April 13, 2018",
            "views": "214",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Weber",
                "href": "/profile/Robert-Weber-36"
            },
            "answer_text": "It does. If you have a “bicarbonate solution” what you really have is a solution that is mostly bicarbonate (hydrogen carbonate) and some carbonate and some carbonic acid. These are two equilibria that are established: HCO3- → H+ + CO3(2-) and HCO3- + H+ → H2CO3. If you know the inital concentration of the bicarbonate you should be able to calculate the concentration of the ions using the known equilibrium constants for the equilibria. ",
            "date": "Answered April 13, 2018",
            "views": "123",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Andrew Lonero",
                    "user_href": "/profile/Andrew-Lonero-1"
                }
            ]
        }
    ]
}