{
    "title": "Why didn't primitive man in cold climate make and wear coverings (coats) of animals' fur on the inside and hide on the outside since it seems to be warmer that way? - Quora",
    "tags": [
        "Furs",
        "Prehistoric Humans",
        "Prehistory",
        "Anthropology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nina Lanyon",
                "href": "/profile/Nina-Lanyon"
            },
            "answer_text": "> Why didn't primitive man in cold climate make and wear coverings (coats) of animals' fur on the inside and hide on the outside since it seems to be warmer that way? Didn’t they? Are you suggesting that the Inuit only discovered the benefits of inward facing fur after the white man came to show them the error of their ways? See this web page for a description of Inuit clothing: Facts About Inuit Clothing Anyway, man hasn’t been primitive for close to a quarter of a million years. What exactly do you mean by primitive? Also if you have ever actually worn a good fur coat in the snow or even rain you will know that even with the fur on the outside it keeps you very warm. One or two relatively thin layers of wool under a fur coat can keep you quite remarkably warm. Another point is that fur coats are always more expensive (more time and labour) than clothes made from domesticated animals once you have an agricultural society so one reason to make them with the fur on the outside is to advertise the wealth of the wearer or to make it appear that the wearer is wealthy, just as it is now. Most people in cold climates would probably not have fur coats but would have used leather made from cow or sheep skin. And sheep skin with the fleece still on is invariably worn with the fleece on the inside. Still some did have such clothing; see the section on clothes and shoes in:Ötzi - Wikipedia ",
            "date": "Answered April 19, 2020",
            "views": "129",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alan Dillman",
                    "user_href": "/profile/Alan-Dillman"
                },
                {
                    "user_id": "Michel Renbarre",
                    "user_href": "/profile/Michèle-Renbarre"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Harland",
                "href": "/profile/John-Harland-2"
            },
            "answer_text": "“Why didn't primitive man in cold climate make and wear coverings (coats) of animals' fur on the inside and hide on the outside since it seems to be warmer that way?” Fur coats are not something that survives at all well in the outside environment. If you have seen some evidence that “primitive” people - by which I suppose you mean people from tens of thousands of years ago - wore their fur one way out or the other? Wearing fur facing outward is something people in wealthy societies do to boast about their ability to afford the fur. People who actually need to feel warm in cold conditions commonly wear the fleece or fur facing inward. I wonder if you are basing your assumption on drawings by the illustrators of school history books? Historians sometimes make quite unjustified assumptions about how people in past ages did things but then the illustrators - supervised by the publisher, not the author - sometimes add more errors. ",
            "date": "Answered April 24, 2020",
            "views": "54",
            "upvotes": "0"
        }
    ]
}