{
    "title": "Why is technology good for humanity? - Quora",
    "tags": [
        "The Human Race and Condition"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alexander Hopper",
                "href": "/profile/Alexander-Hopper"
            },
            "answer_text": "Here the technology is being good for humanity and to know more about technology visit this article. The importance of technology in the development of humanity Since there are records of the life of the human being, technology has been the key to evolution as a society. Without the different technologies that man has developed, life today would not be as we know it, we would probably continue to live in caves and totally dark when night comes. From the torches with which man was able to go out into the darkness, the agriculture that returned to the sedentary man, the irrigation systems of ancient Mesopotamia, the steam engines of the seventeenth century, the first focus of Thomas Edison, the first car built by Karl Benz, up to today's Smartphones technology is the reason for the greatest change in society.  If we think how it is that all the devices to which we are dependent have a story behind so complex and often so advanced that we do not even know how things work, I am sure we are surprised. For example, the internet, how does this information network work where most of the human beings interact? How is it that from our cell phone, which is not physically connected to anything, we write a message and in seconds another person receives the message from the other side of the world, through nothing physically visible ?. All these advances result in benefits for the countries that develop these new technologies and it is often believed that the technology is derived from a large economy, so first world countries that have these very advanced characteristics, but the reality is that a Great economy is derived from a better technological development. For this reason the technology is fundamental for the development in a society, clear examples are the United States, which became a power because it discovered new and better ways to extract oil, and China that is a power for the technology that has to produce objects to prices much lower than the competition. A country with technology is equal to a country with a great economy, better education, better infrastructure, so it is time that we discover this world of technology and begin to improve existing technologies or even develop their own, I invite you to look for solutions and not wait for someone else to do it. This will be derived, through us, in a development for our country. ",
            "date": "Answered April 19, 2018",
            "views": "35",
            "upvotes": " View 32 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andrea Tucker",
                    "user_href": "/profile/Andrea-Tucker-33"
                },
                {
                    "user_id": "Peter Trujillo",
                    "user_href": "/profile/Peter-Trujillo-3"
                },
                {
                    "user_id": "Trina Baker",
                    "user_href": "/profile/Trina-Baker-11"
                },
                {
                    "user_id": "Howard Soto",
                    "user_href": "/profile/Howard-Soto-1"
                },
                {
                    "user_id": "Opal Warner",
                    "user_href": "/profile/Opal-Warner"
                },
                {
                    "user_id": "Алексей Шмаков",
                    "user_href": "/profile/Алексей-Шмаков-1"
                },
                {
                    "user_id": "Felecia Sanders",
                    "user_href": "/profile/Felecia-Sanders-1"
                },
                {
                    "user_id": "Sherrie Gilbert",
                    "user_href": "/profile/Sherrie-Gilbert-2"
                },
                {
                    "user_id": "Надежда Коновалова",
                    "user_href": "/profile/Надежда-Коновалова"
                },
                {
                    "user_id": "Shiryaeva",
                    "user_href": "/profile/Shiryaeva"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Werner",
                "href": "/profile/Mark-Werner-4"
            },
            "answer_text": "Were it not for technology, we would still be somewhat upright-walking primates, huddling in the trees at night so as not to be eaten by predators. But we developed tools (primitive at first) and then weapons, and mastered fire, and made clothing that allowed us to move to different climates, and on and on till the present day. All of those things are “technology”. Now, there is always the thought that whatever the current state of technology is… Is bad. Harmful in some way, dehumanizing, disruptive to societies. No doubt there were Romans who thought that those clever aqueducts that brought fresh water into the city were a terrible idea as they threw water-carriers out of work….. The Industrial Revolution caused all manner of displacement… Huge numbers of agricultural workers who picked crops and tended fields by hand were thrown out of work by the introduction of mechanized tractors and reapers and other machines. But humanity coped, and has always coped. The digital revolution has changed society in many ways, but young folks who have never known anything else don’t seem to be bothered at all. There are always downsides…. We have nuclear bombs and nerve gas and computer viruses and “fake news”…. But to a curious and inventive species like ourselves…. it’s been part of life since as long as we’ve been human. ",
            "date": "Answered April 5, 2017",
            "views": "16",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sahala Sulaiman",
                    "user_href": "/profile/Sahala-Sulaiman"
                },
                {
                    "user_id": "Princess Eshun",
                    "user_href": "/profile/Princess-Eshun"
                },
                {
                    "user_id": "Al Barleta",
                    "user_href": "/profile/Al-Barleta"
                }
            ]
        }
    ]
}