{
    "title": "Why do people continue to mischaracterize President Trump as saying that Covid-19 the disease is a hoax when that's been repeatedly debunked as false? - Quora",
    "tags": [
        "Hoaxes",
        "Conspiracy Theories",
        "COVID-19 (2019-2020)",
        "Donald Trump (politician, business person)",
        "Politics of the United States of America",
        "The United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kevin Davidson",
                "href": "/profile/Kevin-Davidson-9"
            },
            "answer_text": "The question links to the Washington Post article providing that debunking, so Washington Post readers (like me) already knew what Trump actually said and meant. To understand the reason for this mischaracterization, we have to start with how President Trump talks. For most people, saying the virus is a hoax would mean that there was no virus. But for Trump “fake news” and “hoax” refer to negative judgments about him, not things that are simply made up out of whole cloth or factually false (see note below). Someone who regularly follows Trump remarks would quickly realize that Trump using the word “hoax” in a discussion of his administration’s handling of the Coronavirus, refers to the criticism, not the virus, and further that he is not saying the points raised by critics are lies, but rather that they are negative and judge his performance wrongly. But Donald Trump has a long string of statements minimizing the threat from the virus, and that makes it easier for someone to believe Trump called the virus a hoax. His dismissal of the seriousness of the threat is not too far away from calling the threat of Coronavirus a hoax. See lists of Trump statements dismissive of the threat such as this one: The President is Crazy. People also continue to think the President literally called the virus a hoax because some political advertisements say he did and, as the Post points out, edit video to string “virus” and “hoax” together, when they were separate. Note: Trump, for example, called the impeachment a hoax in the same statement about Coronavirus. Trump really was impeached. Trump really said and did the things the House charged him with. The Senate said he shouldn’t be removed from office, not that he never said certain things to the Ukrainian president. So it was not a “hoax” in normal English usage) He just says that they were wrong judgments. See also: Kevin Davidson's answer to Do you think President Trump regrets saying on Feb. 28 at a South Carolina rally that the coronavirus was a hoax? ",
            "date": "Answered March 28, 2020",
            "views": "12",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Peter Szilagyi",
                    "user_href": "/profile/Peter-Szilagyi-4"
                },
                {
                    "user_id": "Sarah Mills",
                    "user_href": "/profile/Sarah-Mills-4"
                },
                {
                    "user_id": "Marc Mularz",
                    "user_href": "/profile/Marc-Mularz-1"
                },
                {
                    "user_id": "Richard Petek",
                    "user_href": "/profile/Richard-Petek"
                },
                {
                    "user_id": "Reed White",
                    "user_href": "/profile/Reed-White"
                },
                {
                    "user_id": "James Greene Sr",
                    "user_href": "/profile/James-Greene-Sr-1"
                },
                {
                    "user_id": "Scott DeBruyne",
                    "user_href": "/profile/Scott-DeBruyne"
                },
                {
                    "user_id": "Charlie Richmond",
                    "user_href": "/profile/Charlie-Richmond-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Johnna Kay Zwernemann",
                "href": "/profile/Johnna-Kay-Zwernemann"
            },
            "answer_text": "The legendary singer Irma Thomas gave good advice in the song “I Wish It Would Rain”. She tells people in the song to sit down and think about themselves. A lot of us have a lot of time on our hands due to lock downs, and I've been doing a little thinking myself lately. But, this is not about me. It is about the person that asked this question. Listen up. Trump used the words “hoax” and “coronavirus” in the same sentence several times on live television. He is famous for calling things that are not a hoax… hoaxes. He wanted the people he was talking at to concur with him that his political opponents were making a big deal out of something that was not a big deal. His body language, his smirky smile and the other words that surrounded the parts where he use the word “hoax” in the same sentence as “coronavirus” all led to the same idea. Namely, Democrats are bad, Democrats are liars, and there is no emergency. The idea that the Democrats were making a big deal out of something that was not a big deal is the same thing as saying the coronavirus is not a big deal. With all due respect, this question is indicative of the fact that the person who asked it needs to sit down and think about theirself, because their life is in Trump's hands. If that's where they want it to stay, I say head on out for Spring Break in New Orleans, so you can get a head start showing off your impressive denial of what's coming our way. Meanwhile I will be right here…getting my news from Al Jazeera…in my house. Louisiana emerging as the next US coronavirus hot spot The Associated Press is pretty good too for Reliable information:'Off the charts': Virus hot spots grow in middle America ",
            "date": "Updated July 28, 2020",
            "views": "197",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mathew Callaghan",
                    "user_href": "/profile/Mathew-Callaghan"
                },
                {
                    "user_id": "Scott DeBruyne",
                    "user_href": "/profile/Scott-DeBruyne"
                }
            ]
        }
    ]
}