{
    "title": "Why do we not know what causes gravity? - Quora",
    "tags": [
        "Gravity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ian Miller",
                "href": "/profile/Ian-Miller-39"
            },
            "answer_text": "Because we cannot answer the more basic question: why does gravity attract mass? Generally speaking, why questions have yet to be answered, and perhaps never will. The general structure of a scientific theory starts like this. The theoretician gathers a set of observations that needs explaining and he writes down a premise. Thus Newton would have started with the premise “all masses attract each other”. Such a premise is either true or not true, and the next step is to go over the observations and see if there are any that violate the premise. In this case, no, so Newton would have proceeded by asking, what sort of relationship would this attraction have? New premise: force is equal to inverse square of distance. Now he would do some mathematics, and work out that that premise means the attraction leads to trajectories that are conic sections. He is now pleased because he knows That Kepler’s laws are consistent with conic sections, so he has his theory of gravity. However, he has no means of knowing why it attracts; all he has is a theory that describes the motion, and he can predict the positions of celestial bodies, and also from his dynamics, predict a lot of other motion. The descriptions of dynamics can be made because the premises required are testable, and precise mathematical relationships are produced. However, when we get to “what causes gravity” we have one observation (mass attracts) and no means of varying it. Therefore we have no means of testing any proposition. You will see some explanations that gravity is caused by bending spacetime, but that begs the question, what is spacetime? If it is a mathematical means of predicting where bodies move to, then you still have no cause. If you postulate spacetime is a “thing”, then you have something you can test, except so far that does not seem to have happened. We can make models that predict what happens when . . . but fundamental causes still appear out of grasp. That is also true for other forces. In my opinion, we still do not know what causes the electromagnetic forces; we do know how to describe what they do, but not why they do it. ",
            "date": "Answered October 24, 2016",
            "views": "34",
            "upvotes": " View 24 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Elliot Rooy",
                    "user_href": "/profile/Elliot-Rooy-1"
                },
                {
                    "user_id": "Clint McDonald",
                    "user_href": "/profile/Clint-McDonald-5"
                },
                {
                    "user_id": "RAhul SHrama",
                    "user_href": "/profile/RAhul-SHrama-25"
                },
                {
                    "user_id": "Ahmet Caliskan",
                    "user_href": "/profile/Ahmet-Caliskan-4"
                },
                {
                    "user_id": "Jonathan Davies",
                    "user_href": "/profile/Jonathan-Davies-48"
                },
                {
                    "user_id": "Enrique Casanovas",
                    "user_href": "/profile/Enrique-Casanovas-3"
                },
                {
                    "user_id": "Fred Semendy",
                    "user_href": "/profile/Fred-Semendy"
                },
                {
                    "user_id": "John Snakenburg",
                    "user_href": "/profile/John-Snakenburg"
                },
                {
                    "user_id": "Haifan Zhu",
                    "user_href": "/profile/Haifan-Zhu-2"
                },
                {
                    "user_id": "James Putnam",
                    "user_href": "/profile/James-Putnam-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Putnam",
                "href": "/profile/James-Putnam-8"
            },
            "answer_text": "Here are three reasons: We do not know what mass is. Mass is a mathematically undefined, unexplained property. The layperson type of ‘definitions’ put forward by theoretical physicists, avoid direct answers. For this very important fundamental property, there still is no mathematical expression that defines mass in the historical physics manner that is still in use today.We do not know what cause is. Empirical evidence consists of effects. We learn what cause does, but, not what cause is. The first introduction we have to a cause is in the equation f=ma. Force is cause. There are just two properties introduced to us directly by the empirical evidence ‘a’. Those two properties are force and mass. Mainstream physics has failed, ever since mass was introduced, to recognize that mass must be made a defined property. All the other properties of mechanics are properly defined.The orderly operation of the Universe is evidence that fundamental unity exists. Fundamental unity requires that there be just one cause for all effects. Each of the separate fundamental forces that physics currently teaches exists, have to be different aspects of that same single cause.Fix the errors of theoretical physics that perpetuate fundamental disunity in the equations of physics. Like those three fundamental undefined properties of mass, temperature, and electric charge. Define mass and temperature in the historical manner that has always been followed except for when theorists didn’t know how. Remove the circular definition of electric charge. No longer teach that indirect empirical evidence is sufficient proof for the existence of empirically unverifiable properties such as space-time. Leave no unanswered questions behind like: What did Clausius discover when he defined the original real thermodynamic entropy. It then becomes possible to advance scientific learning further to where we can learn the nature of the single cause. A major block to learning what causes gravity is themainstream defense of Relativity Theory. Relativity theory lacks any empirical support for its involvement with gravity. There is no empirical evidence for either space or time either suffering effects caused by objects or causing effects upon objects. All evidence consists of objects leading to effects upon other objects. All physics measurements relate to object cyclic activity or to object length. There are no controlled specimens of either time or space located in any laboratory anywhere. There has been no experimentation directly upon the properties of space or time. The existence of relativity type of effects on objects is real, but the Relativity Theory claimed causes are not empirically supported. When we learn what causes gravity, we will have learned what causes all mechanical type of effects.",
            "date": "Updated May 28, 2018",
            "views": "252",
            "upvotes": " View 65 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nick Trierweiler",
                    "user_href": "/profile/Nick-Trierweiler-1"
                },
                {
                    "user_id": "Michael Brenner",
                    "user_href": "/profile/Michael-Brenner-13"
                },
                {
                    "user_id": "Tony Collins",
                    "user_href": "/profile/Tony-Collins-43"
                },
                {
                    "user_id": "Enrique Casanovas",
                    "user_href": "/profile/Enrique-Casanovas-3"
                },
                {
                    "user_id": "Tamas Fejes",
                    "user_href": "/profile/Tamas-Fejes-1"
                },
                {
                    "user_id": "Eugenio Selvaggi",
                    "user_href": "/profile/Eugenio-Selvaggi"
                },
                {
                    "user_id": "Nikola Milovic",
                    "user_href": "/profile/Nikola-Milovic-1"
                },
                {
                    "user_id": "Earl Cox",
                    "user_href": "/profile/Earl-Cox"
                },
                {
                    "user_id": "Ian Macmillan",
                    "user_href": "/profile/Ian-Macmillan-8"
                },
                {
                    "user_id": "Michael Fabiano",
                    "user_href": "/profile/Michael-Fabiano"
                }
            ]
        }
    ]
}