{
    "title": "Why did Charles Babbage invent the computer? - Quora",
    "tags": [
        "Charles Babbage",
        "Inventors",
        "Invention and Inventions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Travis Casey",
                "href": "/profile/Travis-Casey-4"
            },
            "answer_text": "The answers so far seem to be showing a common bit of confusion: namely, failing to distinguish between Babbage’s difference engine and analytical engine. Babbage first conceived of the difference engine, which was to be a sophisticated calculator which could automatically compute and print tables of polynomials using a mathematical technique called the method of differences. Difference Engine 0 had its design completed in 1820, and was finished in 1822. It was fairly small and operated by means of a hand crank. It worked with two orders of differences, allowing it to calculate quadratic approximations (i.e., those of the form [math]ax^2+bx+c[/math]) in numbers of up to 8 digits. This is the only one of his ‘engines’ which Babbage successfully built. This wasn’t too greatly useful, but it was interesting enough to get the British Government to give him £17,000 (£1.9 million 2017 equivalent) to work toward building an improved version. This was supposed to be Difference Engine 1, and work on it began in 1823. Babbage intended to build an engine that could handle sixth-order polynomial approximations (i.e., [math]ax^6+bx^5+cx^4+dx^3+ex^2+fx+g[/math]) in numbers up to 20 digits. By 1833, Babbage had managed to complete about 14% of DE1. While DE1 was being built, Babbage had the idea for the analytical engine. This would have been the equivalent of a modern computer: a machine that could be programmed via punched cards to compute many different things. It would have internal memory, and would be able to stamp the results of its computations into soft metal, which could then be used to make plates for printing presses. Using the funding for DE1, Babbage began working on the AE in 1834. The British government was not happy about this — the DE1 was nowhere near complete, Babbage was already talking about building another engine, with seemingly fabulous promises about what it would do, and he was asking for more money. He was also already talking about building a Difference Engine 2, using ideas that he’d had while designing the AE. He insisted that the new techniques he’d thought of would make it cheaper and faster to build than completing DE1. He wanted to abandon DE1 and start on DE2 instead, saying that doing so would cost less money and result in faster completion. He also planned for it to work with 31 digit numbers and seventh-order polynomials. The British government, however, was having none of it. To them, it was beginning to look like Babbage was either a charlatan or a fool. In 1842, DE1 was abandoned. It was less than 25% finished after 19 years of construction and cost overruns. In 1847, Babbage completed the design of DE2. The British government, however, was not interested in funding him to try to build it, or the AE. Per George Scheutz and his son Edward built a working DE1 in 1851–1853. Theirs was less ambitious than Babbage’s, working with 4th order polynomials and up to 15 digits. The British government ordered one in 1857, which was completed in 1859. Babbage’s son built part of the AE in 1910. This was part of “the mill” — essentially the equivalent of the arithmetic and logic unit (ALU) of a modern computer. As a computer without a memory, control unit, or inputs and outputs, however, it was essentially only a curiosity. It still exists and works. A working DE2 was finally built in 1989–1991. The production of the machine revealed some errors in Babbage’s design, although it has been speculated that these were deliberate, intended as protection against someone stealing the plans. The machine was built with part tolerances achievable in Babbage’s time, proving that it could have been built then. However, no working Analytical Engine has yet been built. There is a project working to raise funds to study the plans. The intent is to build a virtual model of the AE, test that, and then build a physical AE once they’ve succeeded with that. So far, they’ve been unable to arrive at a consistent understanding of Babbage’s plans that would allow for even a virtual model to be built. There is an emulator of the AE. However, it does not attempt to model the workings of the AE, but instead simply models the set of operators that Babbage had proposed for it. It in no way proves that the AE would actually work. So, to answer the question: Babbage conceived of the Difference Engine to compute tables, as described in other answers. While working on the DE, however, he conceived of a machine that could do more than simply print tables of a particular function. Instead, it would be able to follow an arbitrary program. It’s not clear what Babbage intended to do with the AE, but he thought it would be a powerful tool for mathematicians. ",
            "date": "Answered September 12, 2018",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Neil Aitken",
                    "user_href": "/profile/Neil-Aitken-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Miller",
                "href": "/profile/Mark-Miller-89"
            },
            "answer_text": "Andrew Daviel has basically got it. Up through WW II, a “computer” was defined as a person who made tables of calculations. Babbage supervised human computers who were creating astronomical tables for navigation. He noticed that calculating these tables by hand was error-prone. Depending on the type of calculations being done, a mistake at one point could ruin a whole book, because the mistake would be propagated into all of the calculations in the remainder of the tables. As more mistakes occurred, the miscalculations would compound on each other. At one point, Babbage tried having two human computers work on the same tables in parallel, so they could do error checks on each other’s results, in an effort to improve the quality of these tables. It was slow, tedious work. Babbage said, “I wish to God these numbers had been computed by steam!”, thinking about the efficiency and labor-saving that machines offered in the industrial revolution that was happening at the time. He did not invent the mechanical computer. Inventing means building a working model, and while he designed a complete model in blueprints, his Difference Engine, he never fully built it. He got 1/7th of it built, what he called his “fragment.” It was enough to demonstrate as a prototype at soirées, but not much more than that. A couple other British machinists, inspired by Babbage’s designs, built complete working models. You can read about that at Difference engine - Wikipedia. The reason the difference engine helped with computing tables is that one method of computing these tables was called the “method of finite differences.” There were two steps for carrying out this method. A book of math tables would lay out computations of a polynomial. A mathematician would get the process started by computing some initial values for the polynomial. These would then be given to some human computers, who would do nothing but additions, which would provide all of the remaining results for the table. The process was so simple that hairdressers used to do it as double-duty. The difference engine was designed to take over for the “hairdressers.” It could be programmed with initial values, and what specific additions it needed to do. Its calculation method could not be reprogrammed, though. ",
            "date": "Answered September 11, 2018",
            "views": "796",
            "upvotes": " Answer requested by Sven Perlberg"
        }
    ]
}