{
    "title": "Why does gravity stop working on us in water? - Quora",
    "tags": [
        "Gravity (physics)",
        "Gravity",
        "Science of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sasha Kononova",
                "href": "/profile/Sasha-Kononova-1"
            },
            "answer_text": "It doesn’t. This is why stuff sinks. But obviously, other stuff floats. And then there’s humans, who are largely water, and who sometimes sink and sometimes float. The force of gravity is always acting on you. But in fluids, there’s also a force of buoyancy acting upwards. This force is related to the fact that when you’re in a fluid, you’re displacing part of that fluid. If your density is low, then a liter of water is going to be heavier than a liter of you — well, any unit of volume, I’m just using liter for convenience. You’re too light to displace the water. But something like a chunk of metal is more dense than water, so it does displace it, and promptly sink — the buoyant force is too low to help it out much. The buoyant force also explains why not all things sink at the same rate. You can try this at home, really. Fill a sink or preferably a bathtub with water, maybe use a pool if you have access to it, and try to sink some stuff in it. Some will go down quickly, some slowly, some not at all. (For ideal results, you’d want to use objects of roughly the same shape. Think about it like this: submarines and fish are usually in pretty specific shapes, shapes that make moving through water more efficient. This implies that some objects you’re working with would also have an easier time moving through water based on their shape; this is similar to how when dropping things outside of water, air resistance can play a pretty important role.) ",
            "date": "Answered October 17, 2020",
            "views": "196",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Bueno",
                    "user_href": "/profile/John-Bueno-13"
                },
                {
                    "user_id": "Mark Gallaway",
                    "user_href": "/profile/Mark-Gallaway"
                },
                {
                    "user_id": "Monica Gellar",
                    "user_href": "/profile/Monica-Gellar-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gene Ewald",
                "href": "/profile/Gene-Ewald"
            },
            "answer_text": "Gravity does NOT stop “working on us” in water … nor on the water or even the air. Gravity keeps all of us and the earth together. The question is what order we should be from the center out … we cannot all be the closest together. In general, things get stacked up with the greatest density lowest. Gravity has already “worked on us” to be below the air ( we have greater density). We would go even lower; but the water is already there. We try anyway. We don’t sit on top of the water; but are allowed entry until we’ve displaced enough water to equal our weight. For most people, they can be vertical and keep their head out. Upside down is not good. Horizontal, you can float on your back. Face down is not good. In deep enough calm water, you can experiment with this idea. Taking a deep breath will cause you to expand and be larger without becoming much heavier — so less dense. start by floating in a vertical positiontake a deep breath and note that you rise upslowly let the air out and note that you start to sinktake in more air to rise again.Submarines do this with water to control their density. Balloons do it with heat. Gravity will not likely stop working during out lifetime. It just treats all mass the same. ",
            "date": "Answered October 17, 2020",
            "views": "40",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "John Bueno",
                    "user_href": "/profile/John-Bueno-13"
                }
            ]
        }
    ]
}