{
    "title": "Why is the speed of light so fast? - Quora",
    "tags": [
        "Speed of Light",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bill Gaede",
                "href": "/profile/Bill-Gaede"
            },
            "answer_text": "The short answer is that light is so fast because it doesn’t go anywhere. Like the mediators of gravity and magnetism, light is invisible and intangible. Therefore, we have no chance of discovering the secret agent that mediates light by running an experiment in the lab. What a theorist is required to do is imagine and visualize what entity could possibly be performing all the magical tricks that light is known to do. For the last 400 or so years, researchers have imagined and visualized light as a stream of discrete particles affectionately called photons. By their very nature, particles can only flow in one direction. This means that simulating light as a stream of particles necessarily requires measuring the speed of a given photon in one direction: from A to B. The photon hypothesis inevitably raises many questions. 1. Why do these particles travel ‘straight’? A series of photons coming out of a spinning atom of our spinning Sun should collectively curve in space like droplets coming out of a water sprinkler. 2. How are these discrete beads related to wavelength as required by Maxwell’s equations, Compton’s Effect, Slit Experiment, and other amply verified phenomena? 3. And yes, why is the speed of these discrete particles so fast? What stops them from going faster? After all, theorists have postulated faster-than-light tachyons and routinely tell the world that two particles on opposite sides of the Universe physically affect each other instantaneously, a phenomenon known as entanglement. Light has consistently been measured and calculated to travel, propagate, oscillate, vibrate, etc., between two points in a vacuum at 300,000 km/s. The wave equation — (c =ƒ λ = 300,000 km/s) — implies that frequency (ƒ) is inversely proportional to wavelength (λ). This means that if the frequency goes up, wavelength must come down. Why would this be so? Why can’t we increase both the frequency AND the wavelength and travel faster than little c? What physical impediment is there? (Incidentally, plane transverse waves widely used by theorists for the last 400 years also travel one way.) Today, we make a new assumption. Let us assume that light is not mediated by one-way waves or particles, but rather by an elongated pair of twined threads: a DNA-like double-helix that physically binds any two atoms.  Under this model, light is not a flow of beads. Light consists of torsions ‘propagating’ along this taut medium. Actually, the straight rope-like mediator merely twirls in place. This model explains: 1. Why light ‘travels straight’. 2. Why light travels in opposite directions simultaneously. 3. Why light is so fast (i.e., nothing beats a torsion ‘wave’ along a taut rope!) 4. Why frequency (# of links) is inversely proportional to wavelength (length of the link). Corollary: the wave equation of light (c =ƒ λ) is the equation of a rope.  . . . ",
            "date": "Answered August 27, 2020",
            "views": "14",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Hello World",
                    "user_href": "/profile/Hello-World-2250"
                },
                {
                    "user_id": "Sufal Paudel",
                    "user_href": "/profile/Sufal-Paudel"
                },
                {
                    "user_id": "Woberto Magdanz",
                    "user_href": "/profile/Woberto-Magdanz"
                },
                {
                    "user_id": "Bhushan N",
                    "user_href": "/profile/Bhushan-N-11"
                },
                {
                    "user_id": "N Shakhapur",
                    "user_href": "/profile/N-Shakhapur"
                },
                {
                    "user_id": "Franco Bruno Corteletti",
                    "user_href": "/profile/Franco-Bruno-Corteletti"
                },
                {
                    "user_id": "Bryan Barcelo",
                    "user_href": "/profile/Bryan-Barcelo"
                },
                {
                    "user_id": "Daniel Chen",
                    "user_href": "/profile/Daniel-Chen-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Philip Freeman",
                "href": "/profile/Philip-Freeman-3"
            },
            "answer_text": "Question asked: Why is light very fast? Light isn’t very fast. We are very slow! There is a natural way to measure and compare space and time (and hence velocity). You just convert them into the same units, remembering that special relativity shows us that time is just another dimension. So you can convert seconds to metres, and express a velocity as so many metres of space per metre of time. The conversion factor from seconds to metres is that there are 299792458 metres in one second. Yes, that’s a familiar looking number. The value c = 299792458 m/s, often called ‘the speed of light’ isn’t a speed, it’s a conversion constant. Once you do this conversion, therefore, the speed of light is just 1 metre of space per metre of time. Just 1. On the other hand the speed limit where I live is 0.000000046 metres of space per metre of time. Very very slow indeed. But why should we be so slow? Let me explain using a video game from the distant past! When I was at university (many years ago) I spent more than than I should have playing a computer game called Starflight.  <image electronic arts via Wikipedia> It was an ‘explore space and acquire resources so you an build up your ship and explore more’ genre of game, with a back story about investigating a series of novas that threaten your homeworld. You could find various metals etc. but the prize resource was lumps of a strange crystaline mineral called endurium, which you needed to power your ship’s FTL engines. Along the way you find ancient ruins and alien technology, and a story gradually unfolds. <spoilers for a 30 year old game ahead> Eventually you discover that the alien ruins you’ve been exploring aren’t ruins at all, they are the living cities of a life form that lives millions of times more slowly than humans. Sentient beings that take years to think a thought, decades to move. Intelligent creatures who look like lumps of a strange mineral to us. It’s a wonderful horrible moment when you realise that through the whole game you’ve been feeding living sentient beings into your engines! What has that got to do with your question? Well, we are those very slow living aliens. We live very very very slowly, so that it takes us millions of metres to think a thought, trillions of metres to move. Why? Blame chemistry! We are chemically based creatures. All the activity of our body depends on chemical reactions. And for two chemicals to react is incredibly unlikely! Not only do the right molecules have to collide in a sea of other molecules, they have to hit at just the right angle with just the right speed  You have to win the lottery millions of times just to think a thought. Reading this article has required waiting for trillions of one in a billion chances to pay out. It’s a wonder we can do anything at all, and no surprise that we are so slow that light seems to pass in, well, the blink of an eye. On a more ‘natural’ scale light is quite slow… which is why travel to the stars is so unfortunately difficult (and why computer chips are limited by the time it takes signals to travel). It’s just that we are way way way slower.  ",
            "date": "Answered October 21, 2020",
            "views": "149",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Eduardo Moreira",
                    "user_href": "/profile/Eduardo-Moreira-14"
                },
                {
                    "user_id": "John Gould",
                    "user_href": "/profile/John-Gould-6"
                },
                {
                    "user_id": "Carl Ingoe",
                    "user_href": "/profile/Carl-Ingoe"
                },
                {
                    "user_id": "Dimitrios Kalemis",
                    "user_href": "/profile/Dimitrios-Kalemis"
                }
            ]
        }
    ]
}