{
    "title": "Why are some compounds that contain carbon not considered as organic compounds? - Quora",
    "tags": [
        "Organic Compounds",
        "Organic Chemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Farhan Amin",
                "href": "/profile/Farhan-Amin-4"
            },
            "answer_text": "There are multiple definitions of “organic compounds”. The ancient one that these are compounds synthesized by living beings has long been discarded. One definition insists on the presence of C-H bonds. By that definition, molecules like CCl4 and oxalic acid are not organic. Which seems crazy, because these are typical organic compounds - non polar multihaloalkane and dicarboxylic acid, respectively. Another definition requires the presence of C-C bonds. By that, again CCl4 - and even methane - wouldn’t be organic. The most acceptable definition is that any carbon-containing molecule should be called organic. However, certain carbon-containers are not part of the big, bad family. See what Wikipedia has to say on this subject in the introduction: “For historical reasons discussed below, a few types of carbon-containing compounds, such as carbides, carbonates, simple oxides of carbon (such as CO and CO2), and cyanides are considered inorganic… The distinction between organic and inorganic carbon compounds, while \"useful in organizing the vast subject of chemistry... is somewhat arbitrary\"…” (Source: Organic compound) There does not seem to be much merit to the argument that “Cyanides, CO2, Carbonates etc. are not organic”. Cyanides may be thought of as the salts of methanenitrile; CO2, as methanedione/oxomethanal; carbonates, as salts of methanedioic acid. It would, thus, appear that this is a silly old distinction, kept alive for no particular reason. ",
            "date": "Answered June 4, 2016",
            "views": "171",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bansi Joshi",
                    "user_href": "/profile/Bansi-Joshi-13"
                },
                {
                    "user_id": "Priti Bora",
                    "user_href": "/profile/Priti-Bora-2"
                },
                {
                    "user_id": "Catana Valente",
                    "user_href": "/profile/Catana-Valente"
                },
                {
                    "user_id": "Sivaprakash",
                    "user_href": "/profile/Sivaprakash-18"
                },
                {
                    "user_id": "Precious Chukwu",
                    "user_href": "/profile/Precious-Chukwu-1"
                },
                {
                    "user_id": "Harshit Shukla",
                    "user_href": "/profile/Harshit-Shukla-118"
                },
                {
                    "user_id": "Rocky Jagtiani",
                    "user_href": "/profile/Rocky-Jagtiani"
                },
                {
                    "user_id": "Mohammed Raheesh",
                    "user_href": "/profile/Mohammed-Raheesh"
                },
                {
                    "user_id": "Albin Jaison Thundathil",
                    "user_href": "/profile/Albin-Jaison-Thundathil"
                },
                {
                    "user_id": "Henry Rasia",
                    "user_href": "/profile/Henry-Rasia"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charu Singh",
                "href": "/profile/Charu-Singh-94"
            },
            "answer_text": "Some examples include carbon dioxide (CO2) carbon monoxide (CO), sodium bicarbonate, iron cyanide complexes, and carbon tetrachloride. As you might expect, elemental carbon isn't organic either. Amorphous carbon, buckminsterfullerene, graphite, and diamond are all inorganic. The answer is because organic molecules don't just contain carbon. They contain hydrocarbons or carbon bonded to hydrogen. The C-H bond has a lower bond energy than the carbon-oxygen bond in carbon dioxide, making carbon dioxide (CO2) more stable/less reactive than the typical organic compound. So, when you're determining whether a carbon compound is organic or not, look to see whether it contains hydrogen in addition to carbon and whether the carbon is bonded to the hydrogen. Make sense? hope it helped! ",
            "date": "Answered December 29, 2017",
            "views": "197",
            "upvotes": " View 49 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chandra Shekhar Azad Boddupally",
                    "user_href": "/profile/Chandra-Shekhar-Azad-Boddupally"
                },
                {
                    "user_id": "Alyssa .",
                    "user_href": "/profile/Alyssa-1601"
                },
                {
                    "user_id": "Andrei Petrica",
                    "user_href": "/profile/Andrei-Petrica"
                },
                {
                    "user_id": "Ijlal Shah",
                    "user_href": "/profile/Ijlal-Shah-7"
                },
                {
                    "user_id": "Kenneth Armstrong",
                    "user_href": "/profile/Kenneth-Armstrong-9"
                },
                {
                    "user_id": "Shatadeba Banerjee",
                    "user_href": "/profile/Shatadeba-Banerjee"
                },
                {
                    "user_id": "Lutufullah Memon",
                    "user_href": "/profile/Lutufullah-Memon"
                },
                {
                    "user_id": "Diana-Abasi Etuk",
                    "user_href": "/profile/Diana-Abasi-Etuk"
                },
                {
                    "user_id": "Lavesh Punjabi",
                    "user_href": "/profile/Lavesh-Punjabi-5"
                },
                {
                    "user_id": "Harsh Shah",
                    "user_href": "/profile/Harsh-Shah-1732"
                }
            ]
        }
    ]
}