{
    "title": "Why is Acetylacetone highly stable in enol-form? - Quora",
    "tags": [
        "Acetylacetone",
        "Stability",
        "Organic Chemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anik Chowdhury",
                "href": "/profile/Anik-Chowdhury-27"
            },
            "answer_text": "Acetylacetone (2,4-pentanedione) exists in two isomeric forms, shown below. The Keto form is on the left, and the Enol form is on the right. These two interconvert with each other, but the process is slow enough that an NMR spectrum will show signals from each separate isomer.  ***The 2,4-pentanedione enol form shown is the more stable enol, since the lone pair on the enol oxygen can delocalize across the five atoms to the electronegative carbonyl oxygen. ***The enol form of acetylacetone is reported to be more stable and it is stabilised by an internal hydrogen bond referred to as chelated enol (Lozada-Garcia, 2011). From the mid-IR signature of acetylacetone, it is indicated that the main tautomeric form is the chelated enol form but both the keto and enol forms coexist in both the liquid and gaseous states. ***There are two strong factors that will shift the equilibrium toward the enol form : 1. Aromaticity. Phenols can theoretically exist in their keto forms, but the enol form is greatly favored due to aromatic stabilization. 2. Hydrogen Bonding. Nearby hydrogen bond acceptors stabilize the enol form. When a Lewis basic group is nearby, the enol form is stabilized by internal hydrogen bonding.  Hydrogen bonding can stabilize the enol form. If the hydrogen bond is strong enough, and particularly if other factors also stabilize the enol form, the enol form can predominate. 2,4-pentanedione, is indeed a good example. ",
            "date": "Answered November 26, 2017",
            "views": "78",
            "upvotes": " View 17 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Łukasz Golon",
                    "user_href": "/profile/Łukasz-Golon"
                },
                {
                    "user_id": "Gary Hiel",
                    "user_href": "/profile/Gary-Hiel"
                },
                {
                    "user_id": "Tharini Shree",
                    "user_href": "/profile/Tharini-Shree"
                },
                {
                    "user_id": "Bipasha Das",
                    "user_href": "/profile/Bipasha-Das-43"
                },
                {
                    "user_id": "Shaik Mabu Subhani",
                    "user_href": "/profile/Shaik-Mabu-Subhani"
                },
                {
                    "user_id": "Sutirtha Sil",
                    "user_href": "/profile/Sutirtha-Sil"
                },
                {
                    "user_id": "Madison Edge",
                    "user_href": "/profile/Madison-Edge-2"
                },
                {
                    "user_id": "Arjaita",
                    "user_href": "/profile/Arjaita-1"
                },
                {
                    "user_id": "Abhinav Singh",
                    "user_href": "/profile/Abhinav-Singh-2309"
                },
                {
                    "user_id": "Diana",
                    "user_href": "/profile/Diana-895"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhay Tripathi",
                "href": "/profile/Abhay-Tripathi-86"
            },
            "answer_text": "I have cleared you all about what is dipole moment in my previous answer. Now I am going to tell you its applications. Let's see the example of methyl fluoride and methyl chloride. For answering which of them have high dipole moment we have to consider two points, 1-:We know that electronegativity of fluorine is 4 and electronegativity of chlorine is 3 so there is very big difference . We accordingly know that diff of EN value matters the most, means it's a dominant factor when we are comparing dipole moment between two molecules but here its not so. 2-: The 2nd thing that matter is distance which is not dominant as Electronegativity but have the it's role in defining and determining the dipole moment. In this case it comes in play and determine who is going to prove the power of DM. Since the atomic size of fluorine beacuse of poor shielding is extremely small, thereby the bond length between C & F become significantly smaller as compared with C & Cl. Still you don't have to worry about this because it's a type of exception. The dipole moment value of methyl chloride is 1.90 D and that of methyl fluoride is 1.88D . So you are missing the right answer just by a little. ",
            "date": "Answered October 11, 2018",
            "views": "22",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pratik Kulkarni",
                    "user_href": "/profile/Pratik-Kulkarni-88"
                },
                {
                    "user_id": "Hafiz Mamoon Mudasar Sipraa",
                    "user_href": "/profile/Hafiz-Mamoon-Mudasar-Sipraa"
                },
                {
                    "user_id": "Madison Edge",
                    "user_href": "/profile/Madison-Edge-2"
                }
            ]
        }
    ]
}