{
    "title": "Why are wave functions in quantum mechanics expressed in the form “e^ikx”? - Quora",
    "tags": [
        "Quantum Computing",
        "Waves (physics)",
        "Quantum Mechanics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Krishna Gangadhara",
                "href": "/profile/Krishna-Gangadhara"
            },
            "answer_text": "In quantum mechanics, we generally find problems which contain moving electrons in a well defined constant potential or periodically varying potentials. The dynamical state of electrons present in such potentials are represented by quantum mechanical wave functions, that describe the physical properties of electrons and the corresponding systems in terms of associated de Broglie matter waves. The electron waves usually travel with certain velocities and the corresponding electron velocity is equal to the group velocity. Mathematically such traveling waves can be well described by plane wave functions such as i.e. exp(ikx). Such functions are well suited to describe the nature of free electrons as well as the electrons present in periodically varying potentials (multiplied with the periodic function). The advantage with plane wave functions i.e. exp(ikx) is that the linear combination of them can be used to represent standing waves, which are very useful in describing the origin of energy gap in periodic crystals. ",
            "date": "Answered July 15, 2018",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "D Bhava",
                    "user_href": "/profile/D-Bhava"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ian Miller",
                "href": "/profile/Ian-Miller-39"
            },
            "answer_text": "There are four functions that give waves: sinx, cosx, e^ikx, e^-ikx. As it happens, only e^2πiS/h, where S is the action, gives results that represent what we see. Thus we use this because nature has told us this is what to use. If we use sinx, for example, we do not obtain results that nature requires. Whatever else you may feel about elegance, mathematics, whatever, unless your equations give you what nature requires, you are just plain wrong. Only nature is relevant. ",
            "date": "Answered July 16, 2018",
            "views": "359",
            "upvotes": "0"
        }
    ]
}