{
    "title": "Why water has no colour? - Quora",
    "tags": [
        "Colors (vision)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carla Pappalardo",
                "href": "/profile/Carla-Pappalardo-1"
            },
            "answer_text": "Basically, water has absolutely no color whatsoever to it although many people think it’s blue. It is transparent/clear because it’s made up of 2 gases, Hydrogen and Oxygen and in their natural state, these gases are invisible to the eye. [Sorry, I can’t get into the specifics of all this scientifically because I’m not an expert; just pulling out of my memory banks]. However, water can appear different colors, dependent upon what solids may be in it, like algae, sand, sediment, clay on the bottom of a river, etc. For example, say the Northeast Coast of the United States, where the water often looks murky. It’s because of silt and sediment that gets stirred up. But the water in, say, the Caribbean looks crystal clear turquoise (changing from light aqua in the shallows to dark blue in deeper water), because the sandy bottom is made up of broken bits of shell and coral, etc. and a) that is heavier and doesn’t get stirred up as much as it does up the east coast, and b) it’s bleached by the sun and fairly light in color. Water can also appear to look blue (usually) depending upon how the light is absorbs/refracted, since it absorbs the color red and refracts blue (sorry, but you’ll have to look up the specifics of that if you want to, I’m not expert enough to explain it concisely and with the accurate lingo, etc). This relates to how our eyes/retinas see color. Anyway, hope this layperson’s explanation made sense and helped a little bit. I like the topic. ",
            "date": "Answered February 13, 2017",
            "views": "28",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Abhi Srivastava",
                    "user_href": "/profile/Abhi-Srivastava-50"
                },
                {
                    "user_id": "Jacob Hirschfeld",
                    "user_href": "/profile/Jacob-Hirschfeld"
                },
                {
                    "user_id": "Krystale Wardin",
                    "user_href": "/profile/Krystale-Wardin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roopanshu Dwivedi",
                "href": "/profile/Roopanshu-Dwivedi"
            },
            "answer_text": "When water is in small quantities (e.g. in a glass) it appears colorless to the human eye While relatively small quantities of water appear to be colorless, water's tint becomes a deeper blue as the thickness of the observed sample increases. The blue hue of water is an intrinsic property and is caused by the selective absorption and scattering of white light. Impurities dissolved or suspended in water may give water different colored appearances. The intrinsic color of liquid water may be demonstrated by looking at a white light source through a long pipe that is filled with purified water and closed at both ends with a transparent window. The light turquoise blue color is caused by weak absorption in the red part of the visible spectrum Many people wander why water has a clear, pristine appearance while so many other liquids seem to have at least minimal color. The answer is a complex one and it all begins with the molecular make-up water. Water is entirely composed of hydrogen and oxygen. Both elements are gases in nature and are invisible. ",
            "date": "Answered March 6, 2017",
            "views": "98",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anjali Singh",
                    "user_href": "/profile/Anjali-Singh-1291"
                },
                {
                    "user_id": "Karin Downs",
                    "user_href": "/profile/Karin-Downs"
                },
                {
                    "user_id": "Isaac Pope",
                    "user_href": "/profile/Isaac-Pope-4"
                },
                {
                    "user_id": "Kenneth Porras Granados",
                    "user_href": "/profile/Kenneth-Porras-Granados"
                },
                {
                    "user_id": "Deusdedit Shirima",
                    "user_href": "/profile/Deusdedit-Shirima"
                },
                {
                    "user_id": "Chae Due",
                    "user_href": "/profile/Chae-Due"
                },
                {
                    "user_id": "Nasir Ali",
                    "user_href": "/profile/Nasir-Ali-361"
                },
                {
                    "user_id": "Malcolm Sargeant",
                    "user_href": "/profile/Malcolm-Sargeant"
                }
            ]
        }
    ]
}