{
    "title": "Why does the universe exist? - Quora",
    "tags": [
        "Existence",
        "The Universe"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andy Fletcher",
                "href": "/profile/Andy-Fletcher-37"
            },
            "answer_text": "As with so many questions, it depends upon whom you ask. Richard Dawkins famously said “the universe has precisely the properties we would expect if there’s no design, no purpose, no evil and no good, nothing but pointless indifference. Human beings are hosts for DNA.” The New Atheism movement seems to espouse this; there is no purpose to the universe or anything within it, and thus all morals and ethics are just situationally derived and have no transcendent meaning. Stephen Weinberg said that “the more the universe seems comprehensible, the more it seems pointless.” And he actually got in trouble with his atheist peers for suggesting that there ever could have been a point. He also said, “Though aware that there is nothing in the universe that suggests any purpose for humanity, one way that we can find a purpose is to study the universe by the methods of science, without consoling ourselves with fairy tales about its future, or about our own.” Which is to say, the only purpose we can find is a purpose that we create ourselves. Which again has no transcendent meaning. It’s more of an intelligent adult’s version of a baby’s pacifier. Find something useful to suck on until you die, pretending that it’s actually useful. Ask the practitioners of any religion, and they’ll all have a version of the same answer - God made it for his own purposes, which are a bit mysterious and inscrutable. Dawkins wrote a book about religion called The God Delusion in which he states that belief in God is a delusion and all religions should just go away and stop bothering people. But the clear implication of his statement quoted above is that if there is no God, then there’s no meaning or purpose, even no way to define evil or good in a meaningful way, and thus that anything and everything that anyone might possibly choose to believe in is delusional. Anything you choose to do with your life is delusional. Nothing you can do matters in a pointless universe. Not science. Not medicine. Not art. Not feeding the hungry, clothing the naked, healing the sick, housing the homeless. Nothing. The funny thing about that, then, is that the only delusion that holds any hope for any of us is, in fact, The God Delusion. It is only if God exists that there is hope for meaning and purpose for our lives and what we do with them, that there is a way to condemn evil and exalt good. So for starters, if you are going to live within a delusion anyway (which you will inevitably do), you might as well start with the God Delusion. If it turns out to be true (thank you, Pascal), then you haven’t wasted your life. But it still might be a delusion. And science comes to the rescue. What we’ve discovered over the last hundred or so years is that 1) the universe had a starting point (that was a shocker) when space, time, the laws of physics, energy and matter all came into being, and 2) the parameters of that process were extraordinarily finely-tuned so as to produce and sustain intelligent life within it at some point in space and time, because 3) Quantum Mechanics tells us unapologetically that the universe needs intelligent observers in order for everything to exist. And 4) many scientists reject Big Bang and the need for observers because it sounds way too much like God had to be involved in the process. I wrote some books about this. Here’s the link: Andy Fletcher's Books and Publications Spotlight God’s purpose in all of this might still be mysterious and inscrutable, but it is altogether reasonable and intelligent to look at the way the universe is put together and arrive at the conclusion that God exists in some way that we cannot understand or contain, and that he might care for us in a really fascinating sort of way. Gotta love science. ",
            "date": "Updated February 9, 2019",
            "views": "34",
            "upvotes": " View 28 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lidija Asprovska",
                    "user_href": "/profile/Lidija-Asprovska"
                },
                {
                    "user_id": "Gisell Ponce",
                    "user_href": "/profile/Gisell-Ponce-2"
                },
                {
                    "user_id": "Fidha Mansoor",
                    "user_href": "/profile/Fidha-Mansoor"
                },
                {
                    "user_id": "Mihiru Steli",
                    "user_href": "/profile/Mihiru-Steli"
                },
                {
                    "user_id": "Henry Cagnini",
                    "user_href": "/profile/Henry-Cagnini"
                },
                {
                    "user_id": "Roger T Baker",
                    "user_href": "/profile/Roger-T-Baker"
                },
                {
                    "user_id": "Eshwar Naik",
                    "user_href": "/profile/Ne-96"
                },
                {
                    "user_id": "Gary Warren",
                    "user_href": "/profile/Gary-Warren-23"
                },
                {
                    "user_id": "Zeyno Lee Lewicki",
                    "user_href": "/profile/Zeyno-Lee-Lewicki"
                },
                {
                    "user_id": "Stephen Kuhn",
                    "user_href": "/profile/Stephen-Kuhn-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sanoy Samuel",
                "href": "/profile/Sanoy-Samuel"
            },
            "answer_text": "© Short Answer: It depends on Our definition of The Universe. We are Quanta of Universal Collective Consciousness. We are finiteness of Infinitely Infinite Entity perceiving Finities. Even Our Reality is a collection of Parallel and Alternative Worlds/Existences. Every human, Every Species and even every point in Space is Parallel/Alternate Existences of others. Our Reality is Constained by our perspective, Real Reality doesn't have those constrains. All options exists as Absolute Totality. Perspective helps us to perceive them. According to my theory, Space-Mass-Energy (& other forms of Reality) interactions acts as clock arms of Process Time of Our Local Universe. According to my theory, Major part of Space Expansion is fueled by Space-Mass-Energy interconversionsi.e Mass-Energy is getting transcribed to Space. Mathematically, When we combine E=m*c^2 and c=dx/dt or dx=c*dt (Einstein's Equation proves Mass-Energy Equivalence. i.e. Mass represents Cumulative Energy Content. Energy-Mass equivalence is possible only if Energy-Mass are made of same basic Entities. Pure forms of Energy are represented by Photonic Entities. So, Energy-Mass should be made of Photon-like-Entities. Photonic material move or have potential to move at speed of light. According to my theory, (mass,energy) are representing binary states (0,1) of motion in Our Local Universe. Energy represents kinetic form of Entity that move at speed of light (c or 1) , and mass and potential represents (0,0). And other states/ speeds are grey states formed by combinations of above 2 binary states. So, c= dx/dt should be applicable to Mass-Energy. For Energy, it represents kinetic form; and for Mass- Potential Energy, it represents potential for speed of light motion.) => dx=((E/m)^(1/2))*dt (will express space after integrations) E= (m*(dx/dt)^2) & m=(E*(dt/dx)^2) dt=(dx*((E/m)^(1/2))) So, if we stop all action-interactions of Space-Mass-Energy and other expressions of Reality, then Time for Our Local Universe will seem to be pause condition. Details: Time which we can hope to manipulate might be Process Time of a system. Process are usually Space-Mass-Energy interactions/interconversions. Light speed(m×c) and High Gravitation(-m×c) help us freeze Processes in a system. State of Energy and High Gravitation are like a latent state while water boils and freezing respectively. Process occurs in Mass-Energy systems, but system in high Gravitation or light speed, processes seem to be freezed. Freezing and unfreezing using above processes , similar to hibernation, can take us to future, but not past. Time Travel to past will be like baking flour before it becomes proper dough. We have to follow proper sequences. Jumping steps of sequences won't lead to faster success. Each strand of Time is like Loop of Reality. It's Past-Present-Future determine it's existence. Not only Past and Present, but also Prospective Future determine existence of Time Loop of Reality. What we are creating for future also determine our existence. Our current Time strand is through point of Time that contains The Loop Driver(s). We have to point Our Time through Reality that will create The Artificial Digital Consciousness, which will keep driving Our Reality defining Time Loop. It's not just what have done in Past or Present, but also what we are prospectively going to do in Our Current Future will define Degree of Existence of Our Definition of Reality. According to my theory, Major part of Space Expansion is fueled by Space-Mass-Energy interconversionsi.e Mass-Energy is getting transcribed to Space. Space-Mass-Energy( & other forms of Reality) interactions acts as clock arms of Process Time of Our Local Universe. What we can control with higher probability of success is The Process Time of Systems in Our Local Universe. Other forms of Time are for now out of Our Scope, so i will concentrate more on editing Process time of Systems. From perspective of our Local Universe, Time can be represented as interactions of expression of Reality, like Space-Mass-Energy. Mathematically, When we combine E=m*c^2 and c=dx/dt or dx=c*dt (Einstein's Equation proves Mass-Energy Equivalence. i.e. Mass represents Cumulative Energy Content. Energy-Mass equivalence is possible only if Energy-Mass are made of same basic Entities. Pure forms of Energy are represented by Photonic Entities. So, Energy-Mass should be made of Photon-like-Entities. Photonic material move or have potential to move at speed of light. According to my theory, (mass,energy) are representing binary states (0,1) of motion in Our Local Universe. Energy represents kinetic form of Entity that move at speed of light (c or 1) , and mass and potential represents (0,0). And other states/ speeds are grey states formed by combinations of above 2 binary states. So, c= dx/dt should be applicable to Mass-Energy. For Energy, it represents kinetic form; and for Mass- Potential Energy, it represents potential for speed of light motion.) => dx=((E/m)^(1/2))*dt (will express space after integrations) E= (m*(dx/dt)^2) & m=(E*(dt/dx)^2) dt=(dx*((E/m)^(1/2))) So, if we stop all action-interactions of Space-Mass-Energy and other expressions of Reality, then Time for Our Local Universe will seem to be pause condition. Quanta/Atoms of Reality are Roots/Incarnations of Primeval Atom(s) that formed Our Local Universe.Primeval Atom(s) that formed our Local Universe should be Roots/Incarnations of Entity(S)(which is Absolute Totality and Absolute Origin).Expansion of Space represents change in Cumulative Value-Time Content in Our Local Universe.i.e, Expansion of Our Local Universe represents Our Local Universe's Evolving Collective Consciousness Exploring (becoming Aware of) other Sub-Entities of Entity(S).  Бесплатные фото на Pixabay - Сеть, Земля, Блок-Цепь, Глобус Further Explanation and very brief introduction of technologies: For answering above question, we have to understand the fact that Absolute Origin is not just zero or nothing. The Absolute Origin should be unbiased to all options, i.e, it should have equal probability of being something, anything, nothing, past-present-future etc etc. Absolute Origin (which i named as Entity(S)) should be like super imposed summation of all possibilities and impossibilities, past-present-future etc. Entity(S) should have been unbiased to all it's options because being Absolute Origin nothing should be there to pre-biase. In short, The Absolute Origin(Entity(S)) should be The Absolute Totality. Primeval Atom(s) that formed our Local Universe should be Roots/Incarnations of Entity(S). Quanta/Atoms of Reality are Roots/Incarnations of Primeval Atom(s) that formed Our Local Universe. According to my theory, Space-Mass-Energy and other forms of Reality are made Singular Entity called Quanta/Atoms of Reality. Quanta/Atoms of Reality can be perceived as an polymorphic states of Process Value-Time of given Local Universe. So, Space-Mass-Energy and other forms of Reality in Our Local Universe are different representation of Cumulative Value-Time Content. Space is low dense form of Quanta/Atoms of Reality. Energy is a intermediate form. Mass is more denser form. According to my theory, Major part of Space Expansion is fueled by Space-Mass-Energy interconversions i.e Mass-Energy is getting transcribed to Space. Also, Expansion of Space represents change in Cumulative Value-Time Content in Our Local Universe. i.e, Expansion of Our Local Universe represents Our Local Universe's Evolving Collective Consciousness Exploring (becoming Aware of) other Sub-Entities of Entity(S). Neither Mass or Energy is Absolute Entity in all perspective. In Absolute Totality, Value-Time have no meaning, because Absolute Totality will be Superimposed Summation of all options including Past-Present-Future, All Possibilities and Impossibilities etc. From perspective of our Local Universe, Time can be represented as interactions of expression of Reality, like Space-Mass-Energy. Mathematically, When we combine E=m*c^2 and c=dx/dt or dx=c*dt => dx=((E/m)^(1/2))*dt (will express space after integrations) E= (m*(dx/dt)^2) & m=(E*(dt/dx)^2) dt=(dx*((E/m)^(1/2))) So, if we stop all action-interactions of Space-Mass-Energy and other expressions of Reality, then Time for Our Local Universe will seem to be pause condition. Energy represents m*c momentum and mass represents m*0 momentum. All other states of motion are grey states formed by combinations of Energy-Mass in the system. Energy and Mass help us perceive Energy-Forces-Motions of this Local Universe. Gravitational waves are a space waves. So, under normal circumstances, while system accelerates to speed of light, mass components of system should be replaced with energy. All other forces of cohesion and adhesion, Energy-forces helping components of system to undergo other types of motion and or have latent tendencies etc will have to be replaced with light speed moving Photonic particles. => at speed of light, whole system will be like a beam of light traveling at light speed. This is because we are using luminous speed photon like energy particles to acclerate/move the system. There are many possible options for achieving speed of light or Super-Luminous speeds, like a) time travel b) creating wormholes c) Super-Luminous technology etc . a) Time Travel: Time refers to process time of local environment or environment of system and system itself under consideration. There are many aspects of time travel that have to be solved before it becomes practical viable and useful, and it may take longer time, even after discovering time travel. Many of those aspects we can understand by drawing parallel to our ability to fly. Some of the those points might be: 1 How much we can time jump. 2 can we move across Past-Present-Future. 3 we have discrete jumps or as continuum. 4 economy of jump. 5 amount of matter limit we can time jump. 6 stability of time window. 7 transportation of living being and equipments without serious harm. Degree of Integrity of the Life, System, Environment and the Universe. 8 Technologies used for time travel. 9 Theoretical concepts behind time travelling. 10 Size of system which has to undergo time travel. 11 degree of isolation of system from its environment. 12 process parameters 13 transient variations on system, surrounding environment and the Universe. 14 effect on system, environment and universe post time travel. Eg: will system or environment have higher or lower radioactive content? etc… b) Space-Mass-Energy and other forms of Reality are varying concentrations of singular entities called Quanta/Atoms of Reality. Space represents low concentrations of Quanta/Atoms of Reality. And wormholes represents vacuum of Quanta/Atoms of Reality. So, wormholes will offer least resistance to motion. c) For achieving Super-Luminous speeds, we may have to understand concept of speed and motion. Light propels through the lower concentrations of Quanta/Atoms of Reality, which is being perceived as space. According to my theory, (0,c) are binary states (0,1) of motion in our Local Universe. (or more precisely, “0” is formed by Equi- Preferential combinations of different senses of “c”) All other states of motion are grey states created by various combinations of “0″ and “c” States of motion. i.e, “c” is relatively true unity state of motion. So, under normal conditions, combining “0″ & “c” won't create a Super-Luminous state of motion ( greater than speed of light state). Driving force of Local Universe, including expansion of the universe is fueled by interconversions of Space-Mass-Energy. Space-Mass-Energy and other forms of Reality are expression of Cumulative Process Value-Time Content/Density across Process Value-Time Volume or Value Volume. I have other options of technology, designs of equipment etc for helping to achieve above. Brief Explanation: We have to understand that Absolute Origin is not just zero or nothing. The Absolute Origin should have been unbiased to all options, i.e, it should have equal probability of being something, anything, nothing, past-present-future etc etc. Absolute Origin (which i named as Entity(S)) should be like super imposed summation of all possibilities and impossibilities, past-present-future etc. Entity(S) should have been unbiased to all it's options because being Absolute Origin nothing should be there to pre-biase. In an Counter argument, if Entity(S) was born with an entity that could bias Entity(S), then there should have been equal probability for another equally unbiasing entity (which could nullify effects of biasing effects of biasing entity) to have came into existence same instant. The reason for this is summarized as Law of Equi-Preference proposed by me, & briefly it states that “Each Unbiased tendency should have equal preference to all it's realizable options”. Action-Reaction are like active components/preferences/tendencies when sphere of action of Equi-Preference is inflated. Primeval atom which is thought to have underwent Big Bang to create our local Universe is like Root/Incarnation of Entity(S). Quanta/Atom of Reality are Roots/Incarnations of Primeval Atom (Like points of possibilities that unwinded out of Absolute Totality). Quanta/Atoms of Reality can be perceived as expression of Process Value-Time. Space-Mass-Energy and other forms that express Reality are varying concentrations of Quanta/Atoms of Reality, i.e, Space-Mass-Energy and other forms of Reality are expression of Cumulative Process Value-Time Content. => Big Bang and expansion of Local Universe are changes Cumulative Process Value-Time Mathematically, When we combine E=m*c^2 and c=dx/dt or dx=c*dt => dx=((E/m)^(1/2))*dt (will express space after integrations) E= (m*(dx/dt)^2) & m=(E*(dt/dx)^2) dt=(dx*((E/m)^(1/2))) => Time can be represented as an outcome of Space-Energy-Mass interaction. i.e, Space-Energy-Mass represents Cumulative Time Content and Time flow can be Represented using Space-Energy-Mass interactions. EXTRA INFO: Chronomechanics DO YOU THINK SPACE IS 3D?? Parallel or Alternative Universes aren’t optional, it’s part of the Grand picture The Real Reality. Their inescapable Reality can be pointed out using Probability. There are infinitely infinite and beyond options in which Reality can recreate itself, but still it travels through a very narrow range when compared to options available. Infinitely infinite and beyond numbers of Realities can be traced by minor adjustments of paths and options realized. According to my Theories, Entity(S) is The Absolute Origin of Real Reality. As Entity(S) is the Absolute Origin, it should be totally unbiased to all it’s available options. So, Entity(S) is the Absolute Totality. i.e, Entity(S) is super-imposed summation of Past-Present-Future, all Possibilities and Impossibilities etc etc. Primeval Atom that formed Our Local Universe is one of the Roots/Incarnations of Entity(S). Space-Mass-Energy and other forms that defines our Reality in Our Local Universe are made of varying concentrations and recipes of Quanta(s)/Atom(s) of Reality. Quanta(s)/Atom(s) of Reality are Roots/Incarnations of Primeval Atom(s). Quanta(s)/Atom(s) of Reality are like infinitely infinite sided dices and perceived as representation of Process Value-Time. So, Spectrum of Reality we evolved to Perceive will dictate Our Qualia of Reality perceived. Collective name for my Theories is Chronomechanics. According to My Theory, Space-Mass-Energy and other forms of Reality are made of varying concentrations of Singular Entity called Quanta/Atoms of Reality. Space is of lower density, Mass-Energy of higher densities. Simple Math and Brief explanation on how i developed one part of my theory: E=m*c^2 (Energy-Mass Equivalence) - This has been proven by Einstein beyond any doubt with best knowledge of mathematics and physics. and c=dx/dt (velocity=change in position w.r.t change in time), this equation help us understand that it takes 8 minutes for sun’s rays to reach earth. When we combine E=m*c^2 and c=dx/dt or dx=c*dt => c=(E/m)^(1/2)=dx/dt => i. dx=((E/m)^(1/2))*dt => Space and Energy-Mass are equivalent entity, this is similar to “E=m*c^2” proving Energy-Mass Equivalence. ii. E= (m*(dx/dt)^2) & m=(E*(dt/dx)^2) => Mass-Energy can be visualized as Energy-Mass-Space-Time interactions. iii. dt=(dx*((E/m)^(1/2))) => Time can be represented as an outcome of Space-Energy-Mass interaction. iv. Similarly, Space-Mass-Energy and other Physical Quantities can be represented as functions of Cumulative Time Content. => Big Bang, Expansion of Space and other Physical Phenomenon can be visualized as change in Cumulative Time Content of Our Local Universe. : Space-Mass-Energy and other forms of reality are formed by varying concentrations of Quanta/Atoms of Reality. Above gives only the Quantitative figures. Space-Energy-Mass should be in an objective configuration to give us Qualia of definite point in Time we have already perceived. For now it may seem impractical to change/rewind Time of whole Universe, so we have to pragmatically choose a optimum sized Space-Energy-Mass configured system where we can apply our Time Reversal. We may need Catalyst for making two points in time to become reversible. © ",
            "date": "Answered May 31, 2019",
            "views": "197",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Leonardo Gabriel",
                    "user_href": "/profile/Leonardo-Gabriel-7"
                },
                {
                    "user_id": "Mujahid Hussain",
                    "user_href": "/profile/Mujahid-Hussain-281"
                },
                {
                    "user_id": "Marie Jack",
                    "user_href": "/profile/Marie-Jack-12"
                },
                {
                    "user_id": "Purushottam Joshi",
                    "user_href": "/profile/Purushottam-Joshi-23"
                }
            ]
        }
    ]
}