{
    "title": "Why is it easier to cross eyes but not looking away from each other? - Quora",
    "tags": [
        "Medical Sciences",
        "Anatomy",
        "Eye Health",
        "Eyes",
        "Human Body",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Megan Church McGill",
                "href": "/profile/Megan-Church-McGill"
            },
            "answer_text": "Your eyes are naturally pointed toward each other a tiny bit due to focusing on objects close and far. However, it is an oddity and also possibly harmful to use the outer muscles of your eyes to go the opposing direction as that is not the natural way they move. Once you do this, you are forming greater strength in the outer muscles and your eyes may become difficult to remain in good position after you train them to do other than what they naturally do. Unless this is a medical need, trying to look “wall-eyed” is not only difficult but could manage to change the natural musculature of your eyes to focus. Don’t try this for fun. The problems in later life, if done to perfection, far outweigh any short term amusements. Good luck. ",
            "date": "Answered June 19, 2016",
            "views": "967",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sandy Snyder",
                    "user_href": "/profile/Sandy-Snyder-8"
                },
                {
                    "user_id": "Babanpreet Singh",
                    "user_href": "/profile/Babanpreet-Singh-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "George Corrent",
                "href": "/profile/George-Corrent"
            },
            "answer_text": "Our eyes have to move in that way naturally (convergence; esodeviation, eyes turning inward) when focusing on things that are closer to us. So for reading, or looking at anything closer than 3–4 feet, our eyes have to turn inward to keep both eyes focused on the near object. That's not true for the eyes turning out (exodeviation, “wall eye”, exotropia). So pretty much only pathological conditions cause they eyes to exodeviate; it's not a natural condition like convergence. ",
            "date": "Answered June 19, 2016",
            "views": "253",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sandy Snyder",
                    "user_href": "/profile/Sandy-Snyder-8"
                },
                {
                    "user_id": "Mansoor M",
                    "user_href": "/profile/Mansoor-M-17"
                }
            ]
        }
    ]
}