{
    "title": "Why negativity is as important as positivity? - Quora",
    "tags": [
        "Negative Thoughts",
        "Positive Psychology",
        "Negativity (personality trait)",
        "Optimism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sanjay Goel",
                "href": "/profile/Sanjay-Goel-86"
            },
            "answer_text": "Negativity and positivity are two sides of the same coin. In any specific situation, you can be positive or negative. It depends on how you see it. For example, a person meets unfortunate accident and loses his right hand. He can be sad and depressed about losing is hand or thank God for another life. He can ask why me? And get into whole lot of negative incidents or ask? What next and get into action mode. He can make full use of second chance that God has given him. Negative thinking is necessary for our survival. That makes us cautious, careful, analytical, calculative and makes us value safety. Imagine we are crossing the road even when the signal is red for pedestrian and beleiving nothing is going to happen to me. So we cannot always be negative or positive. We have to use our analysis and decide where we need to be negative and where we need to be positive. For example, we need to work towards our goals as if there is no tomorrow and plan and save as if we are never going to die. ",
            "date": "Answered September 15, 2019",
            "views": "154",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gautam Rashmi",
                "href": "/profile/Gautam-Rashmi"
            },
            "answer_text": "As coin has 2 faces and both having equal importance similarly goes with negativity and positivity. If we don’t understand negativity and positivity veywell then we cant able to make fair decision on things , for example: If a person eating too much and think positive that he will not get fatty then one day he will be in danger and that day he will have to do 100times more efforts to become fit. If he is in starting only think that eating too much is having some side effects so be in control. That’s why negativity is is also important. Note: Always keep your negativity in control they are useful but in limit.  Thanks and Regards Gautam Rashmi I believe in your feedback ",
            "date": "Answered December 9, 2018",
            "views": "246",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Prashant",
                    "user_href": "/profile/Prashant-1002"
                },
                {
                    "user_id": "Aditya Yadav",
                    "user_href": "/profile/Aditya-Yadav-112"
                },
                {
                    "user_id": "Sasi Ad",
                    "user_href": "/profile/Sasi-Ad"
                }
            ]
        }
    ]
}