{
    "title": "Why did Einstein call 'everybody a genius'? - Quora",
    "tags": [
        "Albert Einstein (physicist)",
        "Physicists",
        "Genius and Geniuses",
        "Smart People",
        "Intelligence",
        "Psychology of Everyday Life",
        "Philosophy of Everyday Life",
        "Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Genius Turner",
                "href": "/profile/Genius-Turner"
            },
            "answer_text": "Einstein was asked about “genius.” Most expected a reply long & sour, but he kept is short & sweet: “Everybody is a genius! But if you judge a fish by its ability to climb a tree, it’ll live its whole life believing that it is stupid.”  EVERYBODY IS BORN WITH GENIUS-POTENTIAL  I. The TRUE MEANING of “GENIUS”  “All the world’s a stage,” wrote Shakespeare, and each man, woman and child is but an actor! From the very moment your future papa and mama “consummated” their love, the stage was set for your genius-potential. After all, chew on this: in the exact moment your father-to-be released his love, 100,000,000 sperm cells raced to the finish line! Ahhh, but there can only be ONE winner in the Game of Life:  Bingo! From the very moment the ONE sperm fertilizes ONE egg, the genetic script is in effect written for the ONE person. … And given that the ONE zygote contains ALL the genetic instructions that will one day result in everyone’s face, height, eye color and so forth, it is apparent:  “The beginning of wisdom,” said Socrates, “is the definition of terms.” And so, look up the word “individual” and its wisdom abruptly unveils itself:  Bingo! When we turn the Socratic Method onto the notion of “genius,” it becomes apparent that —like most things—the term’s original meaning has been distorted. After all, the original meaning of genius is Latin: “attendant spirit PREsent from one's birth, innate ability or inclination.” Bingo! According to the ancient Romans, then, each person comes into the world stamped with a genius! In the Vedic tradition, this ancient wisdom is known as one’s dharma (धर्म). To put it simply: so far as each man, woman and child is an individual—which simply means UNIQUE—as a consequence each individual has the capacity to do ONE thing in a special way.   II. In CLOSING  My uncle Mike was/is one of the most talented artists I’ve ever seen! According to relatives, his natural gift (genius-potential) was apparent from the start.  Ahhh, but for some reason: Uncle Mike traded in his paint brush to brush up on his skills as a car salesman. … My grandma naturally sings so beautifully that birds halt chirps to eavesdrop when she hums in the shower. As a child, my grandma’s nickname was “Baby Aretha.”  Sure, Granny enjoyed being a nurse for 40 years, yet, on occasion—her buried genius-potential cries out from the grave: “ I wish you would’ve at least given that singing thing a shot!” Granny in effect answered Langston’s classic question:  For the above reasons, I’m left to conclude: most of us place a price tag on our genius-potential. In other words, we all know deep down there’s a yearning to express a special talent or skill of some sort. Yet, that “desire to be great” is usually for sell . . . and usually placed on sale. Pay us just the “right amount” and you’ll instantly hear “my dream sold to the highest bidder!”  Pay us a fat enough check to afford that dream house or fancy car or whatever amount suffices to “kick back and kick our feet up”—and out goes that “childish dream!” Why else do you suppose at Career Day the main pitch is “you’ll get paid X amount of dollars if you—ahem—sell your dream?” Ahhh, but for some reason those Career Day “salesmen” always seem to catch convenient amnesia when the time comes for revealing the world’s oldest little secret:  Here lies the true reason Einstein said, “Everybody is born a genius.” After all,     DOG fo DNIM ehT ",
            "date": "Answered May 1, 2019",
            "views": "155",
            "upvotes": " View 138 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Wence Matthew Maynes",
                    "user_href": "/profile/Wence-Matthew-Maynes-1"
                },
                {
                    "user_id": "K. Yuan",
                    "user_href": "/profile/K-Yuan-2"
                },
                {
                    "user_id": "Richlue King",
                    "user_href": "/profile/Richlue-King"
                },
                {
                    "user_id": "E Z",
                    "user_href": "/profile/E-Z-160"
                },
                {
                    "user_id": "Peyton Terry",
                    "user_href": "/profile/Peyton-Terry-4"
                },
                {
                    "user_id": "Jeff Cunningham",
                    "user_href": "/profile/Jeff-Cunningham-76"
                },
                {
                    "user_id": "Divora Yosief",
                    "user_href": "/profile/Divora-Yosief"
                },
                {
                    "user_id": "Vinay Srivastava",
                    "user_href": "/profile/Vinay-Srivastava-3"
                },
                {
                    "user_id": "Jayesh Rathod",
                    "user_href": "/profile/Jayesh-Rathod-5"
                },
                {
                    "user_id": "Daniel Stanislous",
                    "user_href": "/profile/Daniel-Stanislous-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adriaan de Lange",
                "href": "/profile/Adriaan-de-Lange-3"
            },
            "answer_text": "Greetings to all I have read many things which Einstein wrote, including and rereading his four famous papers in one year. I never saw this claim, although i have not read all his writings because i could not get hold of them. (1) Einstein read a mountain of books, far more than most university professors. (2) Einstein thought that formal schooling needs improvement and that self-“schooling” should be encouraged. (3) People should focus more on the positive & creative things in live than the negative & destructive (4) Einstein was very impressed with Jan C Smuts (JCS) book (1925) “Holism and Evolution”. He realized that JCS formulated his own way of thinking. He studied what JCS wrote on his theory of relativity and wrote an exclamation in a notebook that of the 11 people at that time, JCS understood it best. JCS was educated (he hated the word trained) as a lawyer and was one of their best student in all. He thought that the worst thing in Switzerland and also Europe is disciplinary rather than holistic education. (5) I visited Smuts home (where his books are) 3 times to learn more of him. The first time i was a fool because one day was not enough to study a huge stack of boxes in a huge shed. I complained to the lady looking after them that storing books in a shed is a crime. The second time a new lady worked there and workers moved books to the house and his beautiful furniture for his wife Issie to the store. They were crazy about each other like young lovers in spring. I worked for three days and devoured 10% books mentally. The third time i had to take a week’s leave without pay because the some office personnel at the university thought visiting someone’s HOME to study was a stupid excuse for another reason! The new elderly lady there have be told about me, was surprised at me wanting to study more, made some tee or coffee for us in the morning and afternoon and snacks. That Friday afternoon she have me a hug like a bear (i was surprised with her spontaneity and strength) and said — “I now know why students fail at school, college and university ||| they are not crazy about books”. She did not know that for almost 30 years i have never had one learner at school, college and university crazy about books. (6) I cannot plead and beg enough by encouraging and helping learner to eat mentally books. I am now wheel chaired and can walk with difficulty with two crutches. When someone takes me occasionally to a shopping center, i see young and old people staring robot-like at their hand cell phones. They get so hypnotised that i can walk to their side and look what they explore. They get mentally drugged by the worst things which young minds want to explore. I will not describe HELL. You can do it yourself (7) Do you gave the spirit and guts to tackle this flood of hell unleashed to people. Remember that external control never worked. Only internal self-control works. Save our kids by beginning the last reformation — Reform Education it its Learning. With care and best wishes — At (Adriaan) — {i am still very ill - “i” am not an “I”} ",
            "date": "Answered May 2, 2019",
            "views": "296",
            "upvotes": " Answer requested by Genius Turner"
        }
    ]
}