{
    "title": "Why am I so depressed during daytime? - Quora",
    "tags": [
        "Daytime",
        "Coping and Living with Depression",
        "Depression",
        "Mental Health"
    ],
    "response": [
        {
            "author_info": {
                "name": "Danielle Hall",
                "href": "/profile/Danielle-Hall-21"
            },
            "answer_text": "I have bi-polar disorder, but most of my life has been lived on the depressed side, which seems to be my baseline or normal level of functioning. I have more severe episodes of depression, with the severe anxiety and suicidal ideations, but we won't talk about that now. My typical day is much like yours. I have low energy and irritability until sunset, then I start to come alive. Before I go on, I like to add that this is not a mere inconvenience, it's a torture. I have my darkest, most morbid suicidal thoughts during morning hours, and the hotter and brighter it is outside, the worse I feel. Does Sundowning in Alzheimer's patients provide a clue? Have you heard of Alzheimer's disease? Alzheimers Well, these patients experience something called sundowning. Their mood and behavior changes dramatically just before early evening, and the fading daylight is thought to be the trigger. No, I'm not suggesting you have Alzheimer's, but sundowning or sundowners syndrome sounds like what you're describing in reverse--They feel better during the day and worse at night. Alzheimers patients also come alive after sunset, but not in a positive way. Their symptoms may be manageable throughout the day, but then evening comes and they become more confused, angry and agitated. What's fascinating is that this behavior subsides about one hour before daylight. Also interesting is that some patients experience these symptom--depression, irritability, acting out--during the early morning hours. What is common to all patients is that the mood and behavior is effected by the transition from light to darkness or darkness to light.[1] Although researchers don't understand the exact causes, “scientists think that changes in the brain of someone with dementia might affect their inner “body clock.” The area of the brain that signals when you’re awake or asleep breaks down in people with Alzheimer’s. That could cause sundowning.”[2] I have no right to believe this because I am not a doctor or researcher, but I think a very similar thing is occurring in depression -- breakdown in the internal body clock that signals the body when to sleep and when to awaken. Morning depression. Your internal body clock or circadian rhythms affects energy, thinking, alertness and mood. “When these rhythms are disrupted, your body starts to make hormones at the wrong time of day. This can have a negative effect on your physical health and emotional well-being. For instance, when your body makes melatonin during the day, you may feel very tired and irritable”.[3] From personal experience, I can tell you that maintaining nocturnal hours aggravates my bi-polar condition. I have worked three jobs that were graveyard shifts and all three times I had a manic episode. I also have problems with depression when my work schedule is erratic-- working mornings for two days, then suddenly switching to nights, for example. My mood is most manageable when I go to bed before midnight and awaken by eight am. If I sleep later than eight am, I will feel depressed and sluggish until evening. Keeping a regular routine, eating at the same time , waking and sleeping at the same time, and avoiding things that interfere with sleep is also recommend for alzheimers patients prone to sundowning. It goes without saying that any treatment of depression begins with your doctor. If you are having trouble sleeping during the night, you should discuss this with your doctor. Footnotes[1] Sundowners Syndrome: Triggers & Management[2] Sundowning: Causes, Symptoms, and Treatment[3] Morning Depression: What It Is and How to Treat It ",
            "date": "Answered July 12, 2017",
            "views": "12",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Muhammad Bilal Ameer",
                    "user_href": "/profile/Muhammad-Bilal-Ameer"
                },
                {
                    "user_id": "Jim Oliver",
                    "user_href": "/profile/Jim-Oliver-70"
                },
                {
                    "user_id": "Seho Moon",
                    "user_href": "/profile/Seho-Moon-1"
                },
                {
                    "user_id": "Suzanne Baker",
                    "user_href": "/profile/Suzanne-Baker-10"
                },
                {
                    "user_id": "Drunkwhale E",
                    "user_href": "/profile/Drunkwhale-E"
                },
                {
                    "user_id": "Reena Venkataraman",
                    "user_href": "/profile/Reena-Venkataraman"
                },
                {
                    "user_id": "Jack Sparrow",
                    "user_href": "/profile/Jack-Sparrow-558"
                }
            ]
        },
        {
            "author_info": {
                "name": "David St Michael",
                "href": "/profile/David-St-Michael-1"
            },
            "answer_text": "An interesting question. Thank you for the Q2A. Before, I offer some suggestions, it would have definitely helped, if there was more information about you, such as: Your Age?Type of Diet? Exercise schedule?How long has this situation being going on for?Was there any specific event that triggered this condition?Some suggestions to entertain - - First you need to go and get a check-up with your Primary Care Doc, so to rule/out any “underlying” condition. This could be an Endocrine (thyroid, E3/P2, etc) disorder or Cardio, orThis may also be “masking” as a form of Depression, due to brain chemical imbalance, or from previous brain trauma, or other notable events, or even seasonal.Circadian Rhythm disorder - If this condition is Fairly New, then your 24-hour natural clock has been disrupted. A Sleep Study would be diagnostic.Sleep apnea, would also be considered. A Sleep Study would be diagnostic.Medications & Type + Recreational drugs history is also crucible.FitBit Alt device - just got a new one as a gift, and it does have a Sleep Cycle Mode, which is totally cool. And you can email or SMS the results to your MD too, via Screen shot. Tip = Wear it on your dominant hand/wrist.Night Hawk or Owl - if all of your testing comes back WNL (within normal limits), then you may very well fall into this category. I’m one of them, although, when necessary, I have no problem rising at 5 or 6 AM, the next morning.For # 5 - I keep a well-researched list of the best Nutriceuticals and/or, sleep supplements, and Where to get them, for my friends, family and clients. Message me if you would like a copy. ",
            "date": "Answered July 11, 2017",
            "views": "579",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Drunkwhale E",
                    "user_href": "/profile/Drunkwhale-E"
                }
            ]
        }
    ]
}