{
    "title": "Why do some people deny climate change? - Quora",
    "tags": [
        "Climate Change Debate",
        "Climate and Climates",
        "Climate Change Skepticism",
        "Climatology",
        "Environmentalism",
        "Climate Change"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Matkin",
                "href": "/profile/James-Matkin"
            },
            "answer_text": "Of course major changes in the climate are real, what is unreal and in dispute is whether human emissions of trace amounts of Co2 is triggering rapid and dangerous warming of the planet. This view is unfounded pseudo-science as explained so well by Nobel Laureate Ivar Giaevar in his acceptance speech. Physics Nobel Laureate; \"Global Warming\" is Pseudoscience Professor Ivar Giaever, the 1973 Nobel Prizewinner for Physics trashes the global warming/climate change/extreme weather pseudoscientific clap-trap and tells Obama he is \"Dead Wrong\". This was the 2012 meeting of Nobel Laureates. The 2015 speech by Prof Giaever is here; https://www.youtube.com/watch?v=TCy_U...  I have enumerated 10 key reasons why climate change redefined is unreal. WEATHER: same old variable seasons and temperatures no obvious change except colder weather overall. There is lots of rain, snow and little evidence of droughts or long term heat waves like the dirty thirties. Record colder winter storms are recurring and deny any climate crisis. DOUBT: too much uncertainty about the radical claim that humans recently (last 100 years) have had a warming effect on the climate to the point of crisis.DECEPTION: major evidence of data tampering of temperature data to make models and graphs show much more warming than in fact is actually happening.FRAUD: Alarmists like Justin Trudeau, Al Gore and Barack Obama are guilty of a scam when they dub carbon dioxide carbon pollution. Co2 is invisible trace gas and non toxlc as it is infact the air we breathe out at 35,000 ppmCONTRADICTIONS: leading alarmist cry coastal cities will drown from sea level rise and then they build extravagant coastal fine waterfront properties for their homes.EVIDENCE: there is no evidence of a climate crisis based on predictions of a too hot climate in the next few decades.HISTORY: climate history shows temperatures are chaotic and constantly swinging between high and low and there is no trend except over long time scales in millions of years.MISREPRESENTATIONS:alarmists make the false claim that 97% of scientist support their views of a climate crisis which is bunk as there is not even 3% support.FOOLED BY RANDOMNESS; The alleged climate crisis is based on too short time scale with the data only covering a couple of decades at most and ignoring the clear evidence of cooling in the sixties.CARBON DIOXIDE: when you think about the postiive aspects of this marvelous gas and that it is the air we breathe and essential by the chemistry of photosynthesis to all plant life it cannot be pollution or the demon of climate.CONSENSUS: is not part of the scientific method and uncertainty and coubt are paths to progress in science.There is no unprecedented warming. The earth is cooling- winters are early and harsh with record cold and massive snowfall. How was the public duped into believing we are heading into a too hot catastrophe? Yes mostly the result of fear mongering with misleading data about dangers of warming becoming an uncritical social movement based more on faith than science. I also think the internet spewing out the fake Al Gore inconvenient truth graphs and videos on the internet played a role. The science blaming trace amounts of Co2 as the control knob of big climate changes is demolished as pseudo-science in the acceptance speech video of Nobel Laureate Dr. Iva Giaever viewed by millions… Physics Nobel Laureate; \"Global Warming\" is Pseudoscience Professor Ivar Giaever, the 1973 Nobel Prizewinner for Physics trashes the global warming/climate change/extreme weather pseudoscientific clap-trap and tells Obama he is \"Dead Wrong\". This was the 2012 meeting of Nobel Laureates. The 2015 speech by Prof Giaever is here; https://www.youtube.com/watch?v=TCy_U...  ‘NEW RELIGION’ climate change has become a social movement based on emotional group thinking just like religious faith. The believers carry in their minds two opposing impossibilities i.e. that we are suffering global warming and global cooling at the same time. The most deceptive lie that continues today is the claim that ‘carbon pollution’ is the evil to be stamped out when the science is crystal clear Co2 is non-toxic and non polluting as it is the air we breathe out and essential to the marvelous photosynthesis process of plant growth. Reducing you carbon footprint is impossible as Co2 is invisible. You will remember the substance of this graph from your high school days.  Oxygen, Carbon Dioxide, and Energy | CK-12 Foundation The grand pollution deception invoked by most politicians and governments and the basis of the PARIS ACCORD is to lead the public on a false mission of pollution reduction by attacking the so called climate effects of Co2. It is a classic bait and switch trick with pollution the bait and climate change the switch. Think about it when you breathe out, the air is full of invisible carbon dioxide at 35,000 ppm do you think you are breathing out pollution? It is no answer to say well if the amount goes higher than 400 ppm it becomes toxic, medical carbon dioxide uses a 20,000 ppm for baby incubators of surgery and commercial greenhouses use as much as 2000 ppm 7/24. Further submarine sailors suffer no health problems at 7000 ppm 7.24. New Italian petition urges governments to abandon the idea of a climate crisis based on fossil fuels. “The scientists argue that a nation’s policies with regard to global warming should not be based on hysterics but should be “consistent with scientific knowledge.” They state flatly that “the anthropogenic origin of global warming is an unproven hypothesis, deduced only from some climate simulation models.” In other words, the entire catastrophic global warming scare rests on very imprecise and almost invariably wrong simulation models, which cannot account for natural variability. “Natural variability,” in fact, “explains a substantial part of global warming observed since 1850.” It is irresponsible and unrealistic to blame warming on human beings, and further, it’s nonsense to believe all the doom and gloom warnings. The climate simulation models “overestimate the anthropogenic contribution and underestimate the natural climatic variability.” The scientists completely blow up the myth that science is in any way based on a show of hands.” A quick insight to all of the above is found in the petition signed by 90 Italian scientists denying there is a climate crisis and that Co2 is a pollution problem. Groups of leading scientists around the world are signing petitions telling governments to back off the attack on fossil fuels as alarmism science is much too uncertain. “90 Leading Italian Scientists Sign Petition: CO2 Impact On Climate “UNJUSTIFIABLY EXAGGERATED” … Catastrophic Predictions “NOT REALISTIC” By P Gosselin on 4. July 2019 NOTE: The English version of the petition that follows below is an unpolished translation of the original Italian version. The English version still needs to be polished up a bit, but it fully and accurately conveys the overall thrust of the original Italian version.  In 1517, a 33-year-old theology professor at Wittenberg University walked over to the Castle Church in Wittenberg and nailed a paper of 95 theses to the door, hoping to spark an academic discussion about their contents. Source. The same is happening today in Italy concerning climate science as dogma. 90 Italian scientists sign petition addressed to Italian leaders To the President of the RepublicTo the President of the SenateTo the President of the Chamber of DeputiesTo the President of the Council PETITION ON GLOBAL ANTHROPGENIC HEATING (Anthropogenic Global Warming, human-caused global warming) The undersigned, citizens and scientists, send a warm invitation to political leaders to adopt environmental protection policies consistent with scientific knowledge. In particular, it is urgent to combat pollution where it occurs, according to the indications of the best science. In this regard, the delay with which the wealth of knowledge made available by the world of research is used to reduce the anthropogenic pollutant emissions widely present in both continental and marine environmental systems is deplorable. But we must be aware that CARBON DIOXIDE IS ITSELF NOT A POLLUTANT. On the contrary, it is indispensable for life on our planet. In recent decades, a thesis has spread that the heating of the Earth’s surface of around 0.9°C observed from 1850 onwards would be anomalous and caused exclusively by human activities, in particular by the emission of CO2 from the use of fossil fuels in the atmosphere. This is the thesis of anthropogenic global warming [Anthropogenic Global Warming] promoted by the Intergovernmental Panel on Climate Change (IPCC) of the United Nations, whose consequences would be environmental changes so serious as to fear enormous damage in an imminent future, unless drastic and costly mitigation measures are immediately adopted. In this regard, many nations of the world have joined programs to reduce carbon dioxide emissions and are pressured by a intense propaganda to adopt increasingly burdensome programs whose implementation involves heavy burdens on the economies of the individual member states and depend on climate control and, therefore, the “rescue” of the planet. However, the anthropogenic origin of global warming IS AN UNPROVEN HYPOTHESIS, deduced only from some climate models, that is complex computer programs, called General Circulation Models . On the contrary, the scientific literature has increasingly highlighted the existence of a natural climatic variability that the models are not able to reproduce. This natural variability explains a substantial part of global warming observed since 1850. The anthropogenic responsibility for climate change observed in the last century is therefore UNJUSTIFIABLY EXAGGERATED and catastrophic predictions ARE NOT REALISTIC. The climate is the most complex system on our planet, so it needs to be addressed with methods that are adequate and consistent with its level of complexity. Climate simulation models do not reproduce the observed natural variability of the climate and, in particular, do not reconstruct the warm periods of the last 10,000 years. These were repeated about every thousand years and include the well-known Medieval Warm Period , the Hot Roman Period, and generally warm periods during the Optimal Holocene period. These PERIODS OF THE PAST HAVE ALSO BEEN WARMER THAN THE PRESENT PERIOD, despite the CO2 concentration being lower than the current, while they are related to the millennial cycles of solar activity. These effects are not reproduced by the models. It should be remembered that the heating observed since 1900 has actually started in the 1700s, i.e. at the minimum of the Little Ice Age , the coldest period of the last 10,000 years (corresponding to the millennial minimum of solar activity that astrophysicists call Maunder Minimal Solar ). Since then, solar activity, following its millennial cycle, has increased by heating the earth’s surface. Furthermore, the models fail to reproduce the known climatic oscillations of about 60 years. These were responsible, for example, for a warming period (1850-1880) followed by a cooling period (1880-1910), a heating (1910-40), a cooling (1940-70) and a a new warming period (1970-2000) similar to that observed 60 years earlier. The following years (2000-2019) saw the increase not predicted by the models of about 0.2 ° C [two one-hundredths of a degree]per decade, but a substantial climatic stability that was sporadically interrupted by the rapid natural oscillations of the equatorial Pacific ocean, known as the El Nino Southern Oscillations , like the one that led to temporary warming between 2015 and 2016. The media also claim that extreme events, such as hurricanes and cyclones, have increased alarmingly. Conversely, these events, like many climate systems, have been modulated since the aforementioned 60-year cycle. For example, if we consider the official data from 1880 on tropical Atlantic cyclones that hit North America, they appear to have a strong 60-year oscillation, correlated with the Atlantic Ocean’s thermal oscillation called Atlantic Multidecadal Oscillation . The peaks observed per decade are compatible with each other in the years 1880-90, 1940-50 and 1995-2005. From 2005 to 2015 the number of cyclones decreased precisely following the aforementioned cycle. Thus, in the period 1880-2015, between number of cyclones (which oscillates) and CO2 (which increases monotonically) there is no correlation. The climate system is not yet sufficiently understood. Although it is true that CO2 is a greenhouse gas, according to the IPCC itself the climate sensitivity to its increase in the atmosphere is still extremely uncertain. It is estimated that a doubling of the concentration of atmospheric CO2, from around 300 ppm pre-industrial to 600 ppm, can raise the average temperature of the planet from a minimum of 1° C to a maximum of 5° C. This uncertainty is enormous. In any case, many recent studies based on experimental data estimate that the climate sensitivity to CO2 is CONSIDERABLY LOWER than that estimated by the IPCC models. Then, it is scientifically unrealistic to attribute to humans the responsibility for warming observed from the past century to today. The advanced alarmist forecasts, therefore, are not credible, since they are based on models whose results contradict the experimental data. All the evidence suggests that these MODELS OVERESTIMATE the anthropogenic contribution and underestimate the natural climatic variability, especially that induced by the sun, the moon, and ocean oscillations. Finally, the media release the message according to which, with regard to the human causeof current climate change, there would be an almost unanimous consensus among scientists that the scientific debate would be closed. However, first of all we must be aware that the scientific method dictates that the facts, and not the number of adherents, make a conjecture a consolidated scientific theory . In any case, the same alleged consensus DOES NOT EXIST. In fact, there is a remarkable variability of opinions among specialists – climatologists, meteorologists, geologists, geophysicists, astrophysicists – many of whom recognize an important natural contribution to global warming observed from the pre-industrial period and even from the post-war period to today. There have also been petitions signed by thousands of scientists who have expressed dissent with the conjecture of anthropogenic global warming. These include the one promoted in 2007 by the physicist F. Seitz, former president of the American National Academy of Sciences, and the one promoted by the Non-governmental International Panel on Climate Change (NIPCC), whose 2009 report concludes that “Nature, not the activity of Man governs the climate”. In conclusion, given the CRUCIAL IMPORTANCE THAT FOSSIL FUELS have for the energy supply of humanity, we suggest that they should not adhere to policies of uncritically reducing carbon dioxide emissions into the atmosphere with THE ILLUSORY PRETENSE OF CONTROLLING THE CLIMATE.” http://www.opinione.it/…/redazione_riscaldamento-globale-…/… “90 Italian scientists reject global warming in petition to Italian leaders By YEN MAKABENTA July 13, 2019  YEN MAKABENTA First word “ONLY two months away from the convening of a climate action summit in New York, the United Nations has been rocked by news of a petition signed by 90 of Italy’s leading scientists that was sent to the highest Italian leaders. It carried the title “Petition on Anthropogenic Global Warming,” and it was addressed to the president of the Republic, the president of the Senate, the president of the Chamber of Deputies, and the president of the Council. The scientists told the leaders that carbon dioxide’s impact on climate was “unjustifiably exaggerated,” and catastrophic predictions were “not realistic.” The story calls to mind that of another Italian, the great Galileo Galilei (1564-1642), who is acknowledged as the father of the scientific method. He was forced to recant his views during the Inquisition, and then was proved overwhelmingly right. Petition on global warming I reproduce below key excerpts from the scientists’ petition: “The undersigned, citizens and scientists, send a warm invitation to political leaders to adopt environmental protection policies consistent with scientific knowledge. “In particular, it is urgent to combat pollution where it occurs, according to the indications of the best science. In this regard, the delay with which the wealth of knowledge made available by the world of research is used to reduce the anthropogenic pollutant emissions widely present in both continental and marine environmental systems is deplorable. “But we must be aware that carbon dioxide is itself not a pollutant. On the contrary, it is indispensable for life on our planet. “In recent decades, a thesis has spread that the heating of the Earth’s surface of around 0.9C observed from 1850 onwards would be anomalous and caused exclusively by human activities, in particular by the emission of CO2 from the use of fossil fuels in the atmosphere. “This is the thesis of anthropogenic global warming promoted by the Intergovernmental Panel on Climate Change (IPCC) of the United Nations, whose consequences would be environmental changes so serious as to fear enormous damage in an imminent future, unless drastic and costly mitigation measures are immediately adopted. “In this regard, many nations of the world have joined programs to reduce carbon dioxide emissions and are pressured by an intense propaganda to adopt increasingly burdensome programs whose implementation involves heavy burdens on the economies of the individual member states and depend on climate control… “However, the anthropogenic origin of global warming is an unproven hypothesis, deduced only from some climate models, that is, complex computer programs called General Circulation Models. “On the contrary, the scientific literature has increasingly highlighted the existence of a natural climatic variability that the models are not able to reproduce. “This natural variability explains a substantial part of global warming observed since 1850. “The anthropogenic responsibility for climate change observed in the last century is therefore unjustifiably exaggerated, and catastrophic predictions are not realistic. “The climate is the most complex system on our planet, so it needs to be addressed with methods that are adequate and consistent with its level of complexity. “Climate simulation models do not reproduce the observed natural variability of the climate and, in particular, do not reconstruct the warm periods of the last 10,000 years. “These periods of the past have also been warmer than the present period, despite the CO2 concentration being lower than the current, while they are related to the millennial cycles of solar activity. These effects are not reproduced by the models. “It is scientifically unrealistic to attribute to humans the responsibility for warming observed from the past century to today. The advanced alarmist forecasts, therefore, are not credible, since they are based on models whose results contradict the experimental data. “All the evidence suggests that these models overestimate the anthropogenic contribution and underestimate the natural climatic variability, especially that induced by the sun, the moon and ocean oscillations. “Finally, the media has released the message of an almost unanimous consensus among scientists. “The alleged consensus does not exist. In fact, there is a remarkable variability of opinions among specialists — climatologists, meteorologists, geologists, geophysicists, astrophysicists — many of whom recognize an important natural contribution to global warming observed from the pre-industrial period and even from the post-war period to today. “There have also been petitions signed by thousands of scientists who have expressed dissent with the conjecture of anthropogenic global warming. “In conclusion, given the crucial importance that fossil fuels have for the energy supply of humanity, we suggest that our leaders should not adhere to policies of uncritically reducing carbon dioxide emissions into the atmosphere with illusory pretense of controlling the climate.” The driving force behind the petition was a “promoting committee” of eight prominent Italian scientists and experts, with 90 more Italian scientists signing the document. What now for global climate catastrophe? The detailed letter to lawmakers challenges the claim that man is causing catastrophic global warming, and that carbon dioxide emissions are the culprit. The scientists argue that a nation’s policies with regard to global warming should not be based on hysterics but should be “consistent with scientific knowledge.” They state flatly that “the anthropogenic origin of global warming is an unproven hypothesis, deduced only from some climate simulation models.” In other words, the entire catastrophic global warming scare rests on very imprecise and almost invariably wrong simulation models, which cannot account for natural variability. “Natural variability,” in fact, “explains a substantial part of global warming observed since 1850.” It is irresponsible and unrealistic to blame warming on human beings, and further, it’s nonsense to believe all the doom and gloom warnings. The climate simulation models “overestimate the anthropogenic contribution and underestimate the natural climatic variability.” The scientists completely blow up the myth that science is in any way based on a show of hands. They are living proof that “the alleged consensus (on global warming) does not exist.” Their petition itself demonstrates clearly the absence of a scientific consensus on the matter. The list of signers includes professors of physics, atmospheric physics, physical chemistry, natural sciences, environmental engineering, astronomy, applied geology, volcanology, meteorology and climatology, oceanography, satellite interferometry, hydrogeology, and probability and mathematical statistics. In other words, they are outstanding and highly credentialed scientists. They know what they are talking about. Will UN Secretary-General Antonio Guterres answer them? What happens now to his forecast of global climate catastrophe? The ship of climate change is sinking. yenmakabenta@yahoo.com Credit belongs to : www.manilatimes.net” Historically the earth is starved at only 400 ppm as on average Co2 has for most of history exceeded 1000 ppm.  Seeing that life flourished at 5000 ppm CO2, and seeing we could never push it that high, it is reasonable to assume we will never be harmed by CO2. We have 40,000 ppm CO2 in our lungs every time we breath, 24/7. The Earth is greening. CO2 is entirely beneficial - #CelebrateCO2! Dr. Patrick MooreWhat is the most iconic image for climate change and Co2? If you google carbon pollution what images? Answer WASHINGTON POST ST0RY IN MARCH 2019 -  \"We Are in Deep Trouble\": Carbon Emissions Break Record in Devastating Global Setback  CHRIS MOONEY & BRADY DENNIS, THE WASHINGTON POST 27 MAR 2019 Global energy experts released grim findings Monday, saying that not only are planet-warming carbon-dioxide emissions still increasing, but the world's growing thirst for energy has led to higher emissions from coal-fired power plants than ever before. What is wrong with this story? Answer: carbon dioxide is invisible - remember when you breathe you do not see lack smoke. The deception of calling Co2 carbon pollution is deliberate and intended to gain support for a broad attack on fossil fuels and blame humans for the weather. Co2 is the air we breathe out at 35,000 ppm and it is non-toxic and entirely beneficial. By high school students knew about photosynthesis. This question exposes a key problem in the climate debates where the lefty political leaders including Justin Trudeau, Al Gore and Barack Obama misused science to mislead the public about the very heart of the alleged climate crisis. They frequently referred to ‘carbon pollution’ when they meant carbon dioxide. Hard to believe that this is just an innocent mistake as from high school days they knew about photosynthesis and Co2 as plant food and that it is the air we breathe. There are many examples of Trudeau, Obama and Gore and others misleading the public by calling Co2 carbon pollution. “Obama says carbon pollution caps will 'protect health of vulnerable' – as it happened EPA unveils proposal to cut carbon emissions at power plantsGore: 'most important step' on climate in US historyPlants to cut pollution 30% from 2005 levels by 2030Critics say plan too costly – or cuts not deep enough…. President Barack Obama will outline new regulations to cut carbon emissions to 30% of 2005 levels by 2030. Photograph: Susan Walsh/APHigher electricity bills and more blackouts: that's what the average American can expect from the proposed new EPA rules, according to one very interested party, the American Coalition for Clean Coal Electricity (ACCCE). Karl Mathiesen (@karlmathiesen) digs into a press release quoting president ACCCE president Mike Duncan: “Sadly, EPA’s proposed regulations put America’s low- and middle-income families most at risk of paying disproportionately more for energy,\" Duncan said. \"More so, the rule threatens the energy reliability and economic promise we enjoy today. Only by recognizing the importance of an energy portfolio rich in fuel source diversity will we preserve America’s access to stable and affordable power. Ref. Obama says carbon pollution caps will 'protect health of vulnerable' – as it happened Carbon pollution does not exist in science - it is an invented boggy man to scare the public. Photosynthesis uses the air we breathe out full of Co2 at 35,000 ppm to complete in the fundamental life giving chemical process converting light into energy for plants.  Co2 is actually green as it feeds plants and helps deserts retain water. Evidence abounds how the earth is greening from recent increase in Co2. “The Earth has been rapidly greening in recent decades, and CO2 fertilization may explain 70% of the trend (Zhu et al., 2016). A new study finds models have significantly underestimated the greening effect of rising CO2.  Image Source: Winkler et al., 2019 CO2 is a pollutant? In recent years, carbon dioxide (CO2), an essential ingredient in plants’ food-making processes (photosynthesis), has been unscientifically cast as a villainous pollutant. This colloquial development has been fomented by climate activists like Dr. Michael Mann, an atmospheric scientist who routinely characterizes rising CO2 concentrations as “global warming pollution.”’ New Study: The Recent CO2 Increase Has Had An Even Greater Earth-Greening Impact Than Previously Thought What do scientists say about the reality of Co2 as a pollutant? Have a quick read at how leading scientists explain the non-toxic reality of Co2. “Carbon Dioxide (CO2) is Not Pollution Carbon dioxide (CO2) is not a pollutant and the global warming debate has nothing to do with pollution. The average person has been misled and is confused about what the current global warming debate is about - greenhouse gases. None of which has anything to do with air pollution. People are confusing smog, carbon monoxide (CO) and the pollutants in car exhaust with the life supporting, essential trace gas in our atmosphere - carbon dioxide (CO2). Real air pollution is already regulated under the 1970's Clean Air Act and regulating carbon dioxide (CO2) will do absolutely nothing to make the air you breath \"cleaner\". They are also misled to believe that CO2 is polluting the oceans through acidification but there is nothing unnatural or unprecedented about current measurements of ocean water pH and a future rise in pCO2 will likely yield growth benefits to corals and other sea life. Thus, regulating carbon dioxide (CO2) emissions through either 'carbon taxes', 'cap and trade' or the EPA will cause all energy prices (e.g. electricity, gasoline, diesel fuel, heating oil) to skyrocket. \"CO2 for different people has different attractions. After all, what is it? - it’s not a pollutant, it’s a product of every living creature’s breathing, it’s the product of all plant respiration, it is essential for plant life and photosynthesis, it’s a product of all industrial burning, it’s a product of driving – I mean, if you ever wanted a leverage point to control everything from exhalation to driving, this would be a dream. So it has a kind of fundamental attractiveness to bureaucratic mentality.\" - Richard S. Lindzen, Ph.D. Professor Emeritus of Atmospheric Science, MIT \"CO2 is not a pollutant. In simple terms, CO2 is plant food. The green world we see around us would disappear if not for atmospheric CO2. These plants largely evolved at a time when the atmospheric CO2 concentration was many times what it is today. Indeed, numerous studies indicate the present biosphere is being invigorated by the human-induced rise of CO2. In and of itself, therefore, the increasing concentration of CO2 does not pose a toxic risk to the planet.\" - John R. Christy, Ph.D. Professor of Atmospheric Sciences, University of Alabama \"Carbon dioxide is not a pollutant but a naturally occurring, beneficial trace gas in the atmosphere. For the past few million years, the Earth has existed in a state of relative carbon dioxide starvation compared with earlier periods. There is no empirical evidence that levels double or even triple those of today will be harmful, climatically or otherwise. As a vital element in plant photosynthesis, carbon dioxide is the basis of the planetary food chain - literally the staff of life. Its increase in the atmosphere leads mainly to the greening of the planet. To label carbon dioxide a \"pollutant\" is an abuse of language, logic and science.\" - Robert M. Carter, Ph.D. Professor Emeritus of Environmental and Earth Sciences, James Cook University \"Carbon dioxide is not a pollutant. On the contrary, it makes crops and forests grow faster. Economic analysis has demonstrated that more CO2 and a warmer climate will raise GNP and therefore average income. It's axiomatic that bureaucracies always want to expand their scope of operations. This is especially true of EPA, which is primarily a regulatory agency. As air and water pollution disappear as prime issues, as acid rain and stratospheric-ozone depletion fade from public view, climate change seems like the best growth area for regulators. It has the additional glamour of being international and therefore appeals to those who favor world governance over national sovereignty. Therefore, labeling carbon dioxide, the product of fossil-fuel burning, as a pollutant has a high priority for EPA as a first step in that direction.\" - S. Fred Singer, Ph.D. Professor Emeritus of Environmental Sciences, University of Virginia \"To state in public that carbon dioxide is a pollutant is a public advertisement of a lack of basic school child science. Pollution kills, carbon dioxide leads to the thriving of life on Earth and increased biodiversity. Carbon dioxide is actually plant food.\" - Ian R. Plimer, Ph.D. Professor Emeritus of Earth Sciences, University of Melbourne \"Carbon and CO2 (carbon dioxide) are fundamental for all life on Earth. CO2 is a colorless, odorless, non-toxic gas. CO2 is product of our breathing, and is used in numerous common applications like fire extinguishers, baking soda, carbonated drinks, life jackets, cooling agent, etc. Plants' photosynthesis consume CO2 from the air when the plants make their carbohydrates, which bring the CO2 back to the air again when the plants rot or are being burned.\" - Tom V. Segalstad, Ph.D. Professor of Environmental Geology, University of Oslo \"To suddenly label CO2 as a \"pollutant\" is a disservice to a gas that has played an enormous role in the development and sustainability of all life on this wonderful Earth. Mother Earth has clearly ruled that CO2 is not a pollutant.\" - Robert C. Balling Jr., Ph.D. Professor of Climatology, Arizona State University \"C02 is not a pollutant as Gore infers. It is, in fact essential to life on the planet. Without it there are no plants, therefore no oxygen and no life. At 385 ppm current levels the plants are undernourished. The geologic evidence shows an average level of 1000 ppm over 600 million years. Research shows plants function most efficiently at 1000-2000 ppm. Commercial greenhouses use the information and are pumping C02 to these levels and achieve four times the yield with educed water use. At 200 ppm, the plants suffer seriously and at 150 ppm, they begin to die. So if Gore achieves his goal of reducing C02 he will destroy the planet.\" - Tim F. Ball, Ph.D. Climatology \"Many chemicals are absolutely necessary for humans to live, for instance oxygen. Just as necessary, human metabolism produces by-products that are exhaled, like carbon dioxide and water vapor. So, the production of carbon dioxide is necessary, on the most basic level, for humans to survive. The carbon dioxide that is emitted as part of a wide variety of natural processes is, in turn, necessary for vegetation to live. It turns out that most vegetation is somewhat 'starved' for carbon dioxide, as experiments have shown that a wide variety of plants grow faster, and are more drought tolerant, in the presence of doubled carbon dioxide concentrations. Fertilization of the global atmosphere with the extra CO2 that mankind's activities have emitted in the last century is believed to have helped increase agricultural productivity. In short, carbon dioxide is a natural part of our environment, necessary for life, both as 'food' and as a by-product.\" - Roy Spencer, Ph.D. Meteorology, Former Senior Scientist for Climate Studies, NASA \"I am at a loss to understand why anyone would regard carbon dioxide as a pollutant. Carbon dioxide, a natural gas produced by human respiration, is a plant nutrient that is beneficial both for people and for the natural environment. It promotes plant growth and reforestation. Faster-growing trees mean lower housing costs for consumers and more habitat for wild species. Higher agricultural yields from carbon dioxide fertilization will result in lower food prices and will facilitate conservation by limiting the need to convert wild areas to arable land.\" - David Deming, Ph.D. Professor of Geology and Geophysics, University of Oklahoma \"Carbon dioxide is not a pollutant. It is a colorless, odorless trace gas that actually sustains life on this planet. Consider the simple dynamics of human energy acquisition, which occurs daily across the globe. We eat plants directly, or we consume animals that have fed upon plants, to obtain the energy we need. But where do plants get their energy? Plants produce their own energy during a process called photosynthesis, which uses sunlight to combine water and carbon dioxide into sugars for supporting overall growth and development. Hence, CO2 is the primary raw material that plants depend upon for their existence. Because plants reside beneath animals (including humans) on the food chain, their healthy existence ultimately determines our own. Carbon dioxide can hardly be labeled a pollutant, for it is the basic substrate that allows life to persist on Earth.\" - Keith E. Idso, Ph.D. Botany \"To classify carbon dioxide as a pollutant is thus nothing short of scientific chicanery, for reasons that have nothing to do with science, but based purely on the pseudo-science so eagerly practiced by academia across the world in order to keep their funding sources open to the governmental decrees, which are in turn based on totally false IPCC dogma (yes, dogma - not science).\" - Hans Schreuder, Analytical Chemist \"Atmospheric CO2 is required for life by both plants and animals. It is the sole source of carbon in all of the protein, carbohydrate, fat, and other organic molecules of which living things are constructed. Plants extract carbon from atmospheric CO2 and are thereby fertilized. Animals obtain their carbon from plants. Without atmospheric CO2, none of the life we see on Earth would exist. Water, oxygen, and carbon dioxide are the three most important substances that make life possible. They are surely not environmental pollutants.\" - Arthur B. Robinson, Ph.D. Professor of Chemistry” http://www.populartechnology.net... BUT SHAKING THE FALSE REALITY OF CO2 WILL BE A DIFFICULT TASK BECAUSE OF THE ‘SOCIAL MOVEMENT.’ What is the most startling fact about climate change? QUORA Alistair Riddoch, studied at York University Answered Dec 25  I have been startled since day one that anybody actually believes humans can cause it. Haven’t we learned from the many times throughout history where some people have claimed to other people that humans can influence weather or climate? All the Gods that have been made up that can cause tidal waves, winds, rain, extreme sea level rise and global flooding. This is at least the 50th instance where humans have been asked to believe. Almost every civilization has had some form of it or another. Chinese, Japanese, Egyption, Greeks, Romans, Native Americans, Aztecs, Incas, Mayans, The Norse, the Celts, The Saxons, the Turks, various African cultures, aboriginal Australians, Philippines, Koreans, Vietnamese. Noah’s Ark. Thanksgiving. Rain Dances. Just look up any of the lists of “Sky Deities”, or “Sea Deities” or “Sun Deities”. Each time, the public have been told by their Elders, or Monarchs, or Emperors, or Pharaohs, or Medicine Men, or priests, preachers, ministers, Popes, etc (authority figures), that modification of human behaviour is the way to control the weather, or the climate. Make this offering or sacrifice. Pray on this schedule. Perform this dance, ritual or ceremony. I am startled people don’t recognize this and say “Wait a minute, you expect us to believe this time, plot re-use #46 or #56 or whichever number the current claims are, this time, the claims are supposedly true, even though we know every single other such claim has been 100% false??” I am startled that people are not universally skeptical. Is it just too strong a trust in authority? Or is it the common belief that rich=bad and poor equals the burdened martyr? Is it that everyone wants an opportunity to be saviours? Is it that everyone wants someone to point a finger at? What is it that drives people to be so easily convinced? That is what startles me. Are we still, now, in the 21st century as easy to fool as the people who have believed in “The Great Flood” and gone looking for the remains of the Ark? Noah's Ark Found in Turkey?  Have we really progressed so little, that all you have to do is say “science” and people believe as though it is gospel truth?” I give the last word on this to Dr. Tim Ball who castigated the UN IPCC for the false the hockey stick graph of past temperatures and won the libel case brought by Michael Mann trying to shut down Ball’s stinging and valid criticisms. “PREFACETO BOOK  “I’ve studied climate both scientifically and academically for over forty years after spending eight years studying meteorology and observing the weather as an air crew and operations officer in the Canadian Air force. When I began the academic portion of my career, global cooling was the concern, but it was not a major social theme. During the 1980s the concern switched to global warming which he became a major political, social and economic issue. I watched my chosen discipline– climatology– get hijacked exploited in service of a political agenda, watched people who knew little or nothing enter the fray and watched scientists become involved for political and funding reasons-willing to corrupt the science , or, at least, ignore what was really going on. The tail is more than a sad story because it set climatology back 30 years and damaged the credibility of science in general. It also undermines the environmental movement by incorrectly claiming massive environmental damage and setting up a classic ‘cry wolf’ scenario. It is the greatest deception in history and the extent of the damage is yet to be exposed and measured. There have been of course, other sad deceptions throughout history, but all of them were regional, or, at most, continental. The Deceptive idea that human– generated Co2 causes global warming or climate change impacts every person in the entire world, thus it reflects Marshall McLuhan’s concept of the global village. This book shows how the deception was designed to be global by involving every nation through the agencies of the United Nations. Historians with the benefit of 20:20 hindsight will wonder how such a small group was able to achieve such a massive deception. There are several reasons why the public was deceived. 1. The objective and therefore the science were meditated. 2. The scientific focus was deliberately narrowed to CO2. 3. From the start unaccountable government agencies were involved and in control. 4. Science and political structures and procedures were put in place to enhance the deception. 5. Actions were taken to block or divert challenges. 6. The people’s natural fears about change and catastrophe were exploited. 7. The public’s lack of scientific understanding, especially with regard to climate science, was exploited. 8. People find it hard to believe a deception on such a grand scale couldn’t occur. 9. Opponents were ruthlessly attacked, causing others to remain silent Some call the human – caused global warming theme a hoax, but that is incorrect: a hoax is defined as a humorous or malicious deception. The Piltdown man was a hoax for perpetrated by one academic to expose the arrogance and pomposity of another. Its impact was in academia but had little relevance in the real world. There is nothing humorous about the corruption of climate science. Further, a political objective need not be malevolent; however the methods used to achieve the goals are assuredly ugly, malicious and wrong. Some have called the corruption of climate science a conspiracy partly because conspiratorial themes are fueled by speculation on the Internet. But a conspiracy is defined as a secret plan to do something unlawful or harmful. There is no doubt what the activists have done is harmful, but pursuing a political goal is lawful. What is unlawful is using deliberate deceptions, misinformation, manipulation of records and misapplying the scientific method and research. Indeed, it is amazing how they deceived the entire world through using existing laws and societal structures; it fits the classic description of daylight robbery. It is more appropriate to identify the group as a cabal: a secret political clique or faction. This book explains their motive and objectives which were political, not scientific. It explains how in order to do this they bypassed and converted the scientific method–the normal and proper method by which science progresses. They effectively silenced scientist who tried to perform the normal roles of critics and skeptics Consider this brave but late admission German physicist meteorologist Klaus-Eckart Plus: Ten years ago, I simply parroted what the IPCC told us. One day I started checking the facts and data… first I started with the sense of doubt, but then I became outraged when I discovered that much of what IPCC and the media had been telling us was sheer nonsense and was not even supported by many scientific facts and measurements. To this day I still feel shame scientist I made presentations of their science without first checking it. … scientifically it is sheer absurdity to Think we can get a nice climate by turning a Co2 adjustment knob. The Role of Extremists …In the moral vacuum created by the defeat of religion by science many sought a new belief system. Environmentalism fits the bill. It harkened back to the worship of nature, known as animism, of non—Christian societies. Ironically, in becoming the new religion, environmentalism became dogmatic like all religions So, in the Western world we moved from the dogmatism of Christianity to the dogmatism of science and then to the dogmatism of environmentalism. It is unsurprising that Sir John Houghton, first co-chair of the Intergovernmental Panel on Climate Change (IPCC) and lead editor of the first three IPCC Reports confronted the dilemmas in an article for The Global Conversation: …At the basis of all scientific work are the ‘laws’ of nature– for instance, the laws of gravity, thermodynamics and electromagnetism and the puzzling concepts in mathematics of quantum mechanics. Where do they come from? Scientist don’t invent; they are there to be discovered. With God as Creator, they are Gods laws and the science we do is God’s science. The earth is the Lords and everything in it (Psalm 24), and Jesus is the agent that Redeemer of all creation ( John 1: 2 ). A special responsibility that God has given to humans, created in His image, is to look after and care for creation (Genesis 2:15) Today the impacts of unsustainable use of resources, rapidly increasing human population and the threat of climate change almost certainly add up to the largest and most urgent challenge the world has ever had to fact—all of us are involved in the challenge, whether as scientists, policy makers, Christians or whoever we are.” The Truth about the past -  There is no carbon pollution, global warming or global cooling. We are living in the interglacial comfort of the Holocene Period of the Quaternary Ice Age. Get used to colder weather as it could get much worse.   Extreme Weather GSM  THE CONTINENTAL U.S. JUST SET IT’S COLDEST-EVER OCTOBER TEMPERATURE, BREAKING THE PREVIOUS RECORD FROM 1917 OCTOBER 29, 2019 CAP ALLON The western U.S. was blasted by a yet ANOTHER brutal Arctic air mass yesterday, Oct 28, with this one delivering the COLDEST TEMPERATURE EVER RECORDED IN THE CONTINENTAL UNITED STATES. Peter Sinks, Utah –east of Logan– broke the Lower-48’s cold temperature record for the month of October on Monday morning with a staggering reading of minus 35 degrees. The area is know for it’s cold temperatures thanks to its high elevation (8,164 ft) as well as its unique topography, said Chicago meteorologist Tom Skilling. “It is a basin a half mile (804.67 meters) in diameter with no outlet, like a large bowl. Cold air collects in the basin on clear, calm nights,” Skilling said. “Very low temperatures can occur there, especially during outbreaks of arctic air in the winter.” The weather station located at the bottom of the sink took the -35F (-37.2C) reading at approximately 6:15AM on Monday morning, Oct 28 — beating-out the previous record low of -33F (-36.1C) set way back in 1917 (just after weak solar cycle 14, which was similar to the cycle we’ve just experienced, 24).  Forgive me but I’d like to type it again, the Lower-48 just broke it’s coldest-ever temperature record for the month of October. And in addition, and perhaps even more astonishingly, the record may not even last that long — another all-time low mark is expected to be reached overnight Wednesday. Brutal Arctic air will continue to be funneled southwards from Canada by a dominant meridional (wavy) jet stream flow, which itself is associated with historically low solar activity. “That dip in the jet stream will slowly migrate eastward late in the week taking the colder air with it,” reports the Weather Channel. In neighboring Colorado, record-breaking cold is forecast Tuesday and Wednesday, with the front expected to expand eastward, hitting the Great Plains on Wednesday, the Mississippi and Ohio River Valleys on Thursday, and the East Coast late Friday and into Saturday, according to the NSW — record cold and snow are predicted throughout the vast region. GFS TEMP ANOMALY (C) OCT 28 to NOV 4 ",
            "date": "Updated November 4, 2019",
            "views": "12",
            "upvotes": " View 38 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Andre Bijkerk",
                    "user_href": "/profile/Andre-Bijkerk"
                },
                {
                    "user_id": "Jill Polinsky Childs",
                    "user_href": "/profile/Jill-Polinsky-Childs"
                },
                {
                    "user_id": "Dean Rojas",
                    "user_href": "/profile/Dean-Rojas-2"
                },
                {
                    "user_id": "Kevin Loughrey",
                    "user_href": "/profile/Kevin-Loughrey"
                },
                {
                    "user_id": "Brad Tittle",
                    "user_href": "/profile/Brad-Tittle"
                },
                {
                    "user_id": "Charles Walker",
                    "user_href": "/profile/Charles-Walker-16"
                },
                {
                    "user_id": "Jonathan LaForce",
                    "user_href": "/profile/Jonathan-LaForce-1"
                },
                {
                    "user_id": "Martin Bekkers",
                    "user_href": "/profile/Martin-Bekkers"
                },
                {
                    "user_id": "George Binns",
                    "user_href": "/profile/George-Binns"
                },
                {
                    "user_id": "Arman Manookian",
                    "user_href": "/profile/Arman-Manookian"
                }
            ]
        },
        {
            "author_info": {
                "name": "TL Winslow",
                "href": "/profile/TL-Winslow"
            },
            "answer_text": " Believe in climate change, yes. Too bad, the science behind the CO2-driven greenhouse warming theory is fake, but the public is mainly composed of non-scientists looking for a new secular religion to replace their old one, so the leftist environmentalist climate Communists at the U.N. and their politician-run IPCC global octopus of kept scientists, academics, journalists, and politicians are selling their fake science hoax like pancakes at a country fair. Which will win in the end: science or mass stupidity? Er, forget I asked. Too bad, classic Communists wanted the workers to seize the means of production. Today’s climate Communists want to destroy the means of production, leaving the world helpless while it burns the capitalist world down to erect their unworkable Marxist utopia. Sen. Mazie Hirono: 'Believe In Climate Change As Though It's A Religion' Educational Deficiencies Lead To Doomsday Projections David Webb: 'Climate change is the religion of the Left...prosperous America is Satan' Climate alarmists use junk science to promote their agenda Harrabin’s Tipping Point Junk Science https://www.academia.edu/41064557/RESEARCH_shows_record_cold_winters_are_winning_the_climate_wars_with_no_connection_to_global_warming?email_work_card=view-paper Why climate skeptics will lose. How they can win. - Fabius Maximus website TL Winslow's answer to Where is the evidence that seems to persuade people that carbon dioxide in the atmosphere is not causing global heating?     ",
            "date": "Updated January 8, 2020",
            "views": "261",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dean Rojas",
                    "user_href": "/profile/Dean-Rojas-2"
                },
                {
                    "user_id": "Brad Tittle",
                    "user_href": "/profile/Brad-Tittle"
                },
                {
                    "user_id": "Torben Mølgaard",
                    "user_href": "/profile/Torben-Mølgaard"
                },
                {
                    "user_id": "John Walker",
                    "user_href": "/profile/John-Walker-922"
                },
                {
                    "user_id": "Ytuser Sumone",
                    "user_href": "/profile/Ytuser-Sumone"
                },
                {
                    "user_id": "Tjaart Lemmer",
                    "user_href": "/profile/Tjaart-Lemmer"
                },
                {
                    "user_id": "Timothy Obrien Wells",
                    "user_href": "/profile/Timothy-Obrien-Wells"
                },
                {
                    "user_id": "James Rothering",
                    "user_href": "/profile/James-Rothering"
                }
            ]
        }
    ]
}