{
    "title": "Why do white dwarf stars not collapse? - Quora",
    "tags": [
        "White Dwarfs",
        "Stars (astronomical objects)",
        "Astrophysics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tim Cole",
                "href": "/profile/Tim-Cole-7"
            },
            "answer_text": "A white dwarf is stable as long as is does not exceed the Chandrasekhar Limit. (There seems to be an exception, which I’ll mention shortly) Electron degeneracy pressure keeps it from collapsing. The linked article is a bit technical, but the basics are fairly straightforward. The atoms in the main bulk of the white dwarf have been compressed to such a great extent that their electrons have been forced into their lowest available energy states. At this point, further compression is impossible — at least without some catastrophic event occurring. If the white dwarf were to accumulate more mass, perhaps by pulling it away from a companion, it could possibly collapse to become a neutron star, or possibly even a black hole. This seems to be extremely unlikely, though from what I can read, analysis of this process is still an active research topic. What is known to happen when a white dwarf accretes enough mass to exceed the Chandrasekhar Limit is the triggering of a Type Ia supernova. This destroys the star completely, and its material is blasted in all directions into interstellar space. There’s one known case of a particularly bizarre Type Ia supernova, known formally as SN 2003fg, but informally as the “Champagne Supernova.” It was discovered in 2003 with the Canada-France-Hawaii Telescope and the Keck Observatory. What was so bizarre was the progenitor star’s mass — about 2 solar masses. That’s considerably above the Chandrasekhar Limit of 1.44 solar masses. Somehow, the star accreted a vast excess of material before exploding. If I understand the published account, it seems the star was rotating very rapidly, and that allowed to it exceed the normal limit. ",
            "date": "Answered May 8, 2018",
            "views": "367",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Keith Robison",
                    "user_href": "/profile/Keith-Robison"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ryan Dean",
                "href": "/profile/Ryan-Dean-31"
            },
            "answer_text": "They don’t have enough mass to have enough gravity to overcome electron degeneracy pressure. Electron degeneracy pressure is a result of the Pauli exclusion principle as the electrons start to all try to occupy the same spaces. Basically, as you collapse matter down you have to give electrons more and more energy in order to occupy a smaller space, and white dwarfs just don’t have enough mass to do so, and so they’re held up just by the fact that the electrons have no where to go. If you increase the mass you eventually overcome it, and at that point the electrons have enough energy to just combine with all the protons and make neutrons and you get a neutron star. ",
            "date": "Answered May 8, 2018",
            "views": "119",
            "upvotes": "0"
        }
    ]
}