{
    "title": "Why does each pure compound in a mixture tend to have lower melting points than if they were not in a mixture? - Quora",
    "tags": [
        "Mixture",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Barr",
                "href": "/profile/Michael-Barr-27"
            },
            "answer_text": "Unlike the answer below.. I completely understand your question. I have routinely used melting point analysis to help determine purity of organic solids. Impurities certainly do reduce the melting point of the solid. The reason we see a depression of the melting point in less pure substances is that the impurities interfere with the intermolecular forces in the bulk substance. Imagine ice. Ice molecules are held together by strong hydrogen bonds. When water freezes a regularly arranged crystal structure naturally forms so that these bond energies are minimised. The result tends to be a hexagonal structure, which can exist over many thousands (or billions) of water molecules. This takes a certain amount of energy to melt. If we introduce an impurity into the water, these bonds can't arrange so regularly, and even a small impuriry will prevent the hexagonal pattern existing over as large a scale as it would otherwise do. Because the molecular arrangement is no longer the most stable possible, it takes less energy to overcome these bonds and melt the impure substance I've used ice because I hope you're familiar with it's structure.. but organic molecules arrange in similar ways. Hope that helps. ",
            "date": "Answered October 8, 2017",
            "views": "930",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Antonio Daniels",
                    "user_href": "/profile/Antonio-Daniels-3-1"
                },
                {
                    "user_id": "Susie An",
                    "user_href": "/profile/Susie-An-1"
                },
                {
                    "user_id": "Dan Tox",
                    "user_href": "/profile/Dan-Tox"
                }
            ]
        }
    ]
}