{
    "title": "Why do I get depressed at work? - Quora",
    "tags": [
        "Coping and Living with Depression",
        "Understanding and Improving Mental Health",
        "Depression",
        "Work",
        "Mental Health"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Fe",
                "href": "/profile/Mark-Fe-1"
            },
            "answer_text": "I have absolutely no idea why you get depressed at work but I can answer why I got depressed in the various jobs I've had and if you are of a similar frame of mind……. The job is crap. This is obvious maybe, but less so if you have a “good” job. It still can be really crap.The people are sh*tes. Obvious again, but sometimes I put up instead of punched up - it was that bad.You're not suited to the job. This one was harder to diagnose because I didn't really know myself and I was depressed anyway so it was a swimming pools more depression in a stormy ocean of it.Too many people work there and socialising was a component I couldn't handle.You are under appreciated, especially when you know you are way above the job and keep proving it by solving stuff that's not even in your job description. Of course as a certain person once said to me ALL OF THE TIME as a child “something is only worth what someone will pay for it”. True. But sometimes you’re only worth what you'll accept as a payment. If someone can get you for £8/hr but you're really worth much more it's a rare business person that will inform you with a fat pay rise. Don’t undervalue yourself, skill set, education, abilities particularly innovative abilities - they are quite rare and valuable - most people work within a given system, but if you can see the system and fix it's bottlenecks (office/factory/farm/software system or interface whatever) that's really worth something. It's efficiency savings the whole day and every day.Know when you're bored with a job because it's time to move on. Boredom is a major major component of depression.8. 9 and 10 The people are sh*tes. Even a crap job can be tolerable if the people there or just a couple of them are worth something to you and you find them interesting.",
            "date": "Answered June 7, 2017",
            "views": "242",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dawn Gregory",
                    "user_href": "/profile/Dawn-Gregory"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saisri Pavithraa Bathrayyan",
                "href": "/profile/Saisri-Pavithraa-Bathrayyan"
            },
            "answer_text": "Hello! People and Stress! Such a wonderful partnership! People get depressed from stress. Stress puts you into lots of emotional roller coasters. At times it may be depression. Unfortunately. Depression is actually a underestimated word for some people because others may not even notice that they are very highly disturbed. And in some other cases, it's so not serious at all but people keep saying about that and that puts them to some other after effect. So, coming to the ‘Why’ part. It's based on many many factors : The person was actually given a lot of work pressureThe person had no exposure to pressure or work stress and sudden exposure makes them get depressed quite easily.The person is actually a bit sensitive. (But they can eventually learn to handle their emotions with someone's support and guidance or they can do it themselves but it takes a lot of concentration).The person is not interested in the job and they can't take the frustration because it has reached the end point of tolerance.The person might be working overtime and they might be doing it for quite a long time only for the pay and that eventually leads them to frustration and that leads to Depression eventually.So, there might even be other factors which may put a person to depression during work. But it is not that serious untill a person can actually remind themselves that they are depressed and that they need a break. We need to care for our people. We need to understand them better. We need to minutely know our family to figure out if a person is depressed and help them immediately and as effectively as possible. ",
            "date": "Answered July 25, 2019",
            "views": "101",
            "upvotes": " Not for Reproduction"
        }
    ]
}