{
    "title": "Why do laws of physics exist? - Quora",
    "tags": [
        "Laws of Physics",
        "Existence"
    ],
    "response": [
        {
            "author_info": {
                "name": "Roger Paul Neyman",
                "href": "/profile/Roger-Paul-Neyman"
            },
            "answer_text": "Q: “Why do the laws of physics exist?” In Cody Reisdorf's interesting and thoughtful answer to this question, he says: I can’t see how a universe could not be effectively modeled by mathematics. We have mathematics to describe probabilistic (also called stochastic) phenomena, we have mathematics to quantify randomness, we have mathematics to describe deterministic (non-random) phenomena. So what else is there? And how would something ever elude our ability to model it? We know of something that can elude our ability to model it, at least to model it in detail: any system in which we play a significant part. In general, I don’t think we know how to model free will. ((OK, you may reply that free will is an illusion, but I think those arguments swallow their own tail.)) Further, I can imagine a world where phenomena generally were probabalistic at times or in certain circumstances, deterministic in others, and seemingly arbitrary in others. It would be nightmarish, but it is possible. So, thank you Cody for helping me to focus where my answer to this question needs to go. I think this is a deep question. We are creatures in the cosmos with a capacity to do deep mathematics and to dredge up abstractions like the laws of physics. We know that we tend to see order when it is not there, or to, at least, exaggerate the order, but there really is a orderliness to phenomena that we are capable of discovering. Either our capacity to make those discoveries or the nature of Nature (such that such discoveries are available) needs explaining. My thesis is that such depth (either in thought or in Nature or both) is a result of an overarching unity to the cosmos that spans both reductionistic and emergent phenomena. And, to the extent that thought and rationality (or the capacity for them) is an emergent phenomenon, it is also intimately tied to that overarching, implicate order. So the ‘laws’ of physics are rational approximations of aspects of transcendental implicate order in the cosmos, and our species has evolved the capacity for culture which includes a progressive discovery of such approximations. ",
            "date": "Answered September 3, 2017",
            "views": "17",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Khalid Nezami",
                    "user_href": "/profile/Khalid-Nezami-6"
                },
                {
                    "user_id": "Wu-Tang Gavin",
                    "user_href": "/profile/Wu-Tang-Gavin"
                },
                {
                    "user_id": "Sharad Paudel",
                    "user_href": "/profile/Sharad-Paudel-4"
                },
                {
                    "user_id": "Alan Wu",
                    "user_href": "/profile/Alan-Wu-13"
                },
                {
                    "user_id": "Robert Popescu",
                    "user_href": "/profile/Robert-Popescu-11"
                },
                {
                    "user_id": "Teddy Sanders",
                    "user_href": "/profile/Teddy-Sanders-4"
                },
                {
                    "user_id": "Thomas Mihai",
                    "user_href": "/profile/Thomas-Mihai"
                },
                {
                    "user_id": "Simo Ch",
                    "user_href": "/profile/Simo-Ch-4"
                },
                {
                    "user_id": "Shakti Prakash Singh",
                    "user_href": "/profile/Shakti-Prakash-Singh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brent Meeker",
                "href": "/profile/Brent-Meeker"
            },
            "answer_text": "Of course they are only metaphorically “laws”. The term is a carry over from Newton’s time when it was assumed that the world was the creation of a law-giving deity. That viewpoint just pushes the question back to an even more mysterious level. People find it more satisfying because a “why” question asks for a reason, a motive, and people (and super-people) presumably have motives. We don’t know where our fundamental motives come from, so we’re used to ignoring the question of why this or that motive. Really it’s easier to say it’s just a fact that there are regularities than to say it’s just a mystery that the gods made the world this way. The motives of gods are unknowable. But then it was found that the so called “laws” weren’t even quite right as Newtonian mechanics was first replaced by Einstein’s relativity and then by quantum mechanics. Now these are more modestly called “theories” or even “models” in recognition that they are our inventions to describe and predict regularities. In part this in recognition that the world is not completely deterministic, not a clockwork universe, as Laplace thought in summarizing the Newtonian world view. Quantum mechanics implies the world is mixture of determinism and symmetry with a certain grain of randomness mixed in a the fundamental level. So the question comes down to why are there regularities? Why isn’t the world entirely random or at least much more random? Could the world be like our dreams in which the “laws of physics” mostly work but are often violated. First, if the world were much more random, intelligent beings that remember things and formulate theories couldn’t exist, or at least their existence would be a miracle, inconsistent with a random world. So, secondly could the world be just a little more random, e.g. could there be an occasional miracle as various religions claim. Yes, that would seem to be possible, although as Anatole France commented observing the cast off items when he visited Lourdes, \"All those canes, braces and crutches, and not a single glass eye, wooden leg, or toupee!\" So while it could be, it isn’t. ",
            "date": "Answered April 14, 2019",
            "views": "737",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Paul McQuesten",
                    "user_href": "/profile/Paul-McQuesten-1"
                }
            ]
        }
    ]
}