{
    "title": "Why do enzymes catalyze a specific reaction? - Quora",
    "tags": [
        "Enzymology",
        "Enzymes",
        "Chemical Reactions",
        "Molecular Biology",
        "Biochemistry",
        "Chemistry of Everyday Life",
        "Biology",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kevin Wilkinson",
                "href": "/profile/Kevin-Wilkinson-81"
            },
            "answer_text": "This is not everywhere true. There are several enzymes that catalyze a specific class of reaction but can use different substrates, so many specific reactions (ie. all the reagents and products are the same molecules) can be carried out by a single enzyme. However, these are variations on a theme. Two examples of these enzymes are the cytochrome P-450 family and penicillinase. The former is a family of enzymes that metabolizes drugs and poisons, but each member of the family metabolizes several different drugs in a similar way. The latter can hydrolyze the beta-lactam ring of a variety of different penicillin-derived drugs. All enzymes work by decreasing the activation energy of a reaction through a number of mechanisms. Often, these mechanisms are dependent on binding and holding the substrates (or a class of substrates) in a specific orientation and configuration to dramatically increase the likelihood of reaction. This requires the enzymes to recognize and bind specifically to the substrates, and this specificity limits the range of reactions and range of substrates possible. ",
            "date": "Answered October 27, 2020",
            "views": "5",
            "upvotes": " Answer requested by D. Hassan"
        },
        {
            "author_info": {
                "name": "Anurag Singh",
                "href": "/profile/Anurag-Singh-3288"
            },
            "answer_text": "As every lock has its key u can assume the same for enzymes. They catalyze specific reactions only. They mechanism of enzyme action can be explained by lock and key hypothesis. Ezymes bind only specific substances and cause catalusation by increasing the kinetics of reaction. Enzyme binds to substrate and form enzyme substrate complex and every substrate has binding site which are specific for enzymes. These specific site can be used for inhibition for enzymes as clinical use. ",
            "date": "Answered October 23, 2020",
            "views": "28",
            "upvotes": "0"
        }
    ]
}