{
    "title": "Why do only some white people have blonde hair but all dark people have black hair? - Quora",
    "tags": [
        "Blond Hair",
        "Hair Color",
        "Hair"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aurora Som",
                "href": "/profile/Aurora-Som-1"
            },
            "answer_text": "That’s very much not true. Lighter hair is merely a human mutation. It’s not only seen in Europeans. It’s seen, well, in humans. It’s merely more common in those of European descent, likely due to sexual selection, whereas other places it may not have been seen as ideal. Example, in Tanzania, as well as other parts of Africa, those with albinism are hunted/killed. Had they been able to procreate there could be many, many more within a few generations. There are Hmongs who have blonde hair. It’s not super uncommon within this group. Before evading China many were killed. Easier to spot blonde hair among a country that has predominately black hair. Some left to Southeast Asia. So, in Eastern Asia blonde hair wasn’t really seen as ideal to the point that plenty were killed off. They didn’t have that same sort of sexual selection like they did in Europe. You can see how they have golden-bronze skin with golden hair    Then there are Solomon Islanders who are within the black grouping yet they also have blonde hair. I don’t think the blondes in this area were exiled or anything so it may be more common that they have the hair color compared to Hmongs. This group has their own “homegrown” gene mutation that causes the blonde hair, so it definitely wasn’t due to European mixture. Many people assume anyone who isn’t white that has blonde or light colored eyes has European genes but that really isn’t the case.    Let's not forget that “white”, at least in the US means “of european descent” I know some people still use “white” to be synonymous with “caucasoid” even though that racial grouping fell out of use in the 60s or 70s. Anywho, there are other non-white groups who can have blonde hair. For example, Arabs, Iranians, Turkish people etc. can have blonde hair as well. ",
            "date": "Updated August 6, 2019",
            "views": "77",
            "upvotes": " View 50 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vasant Nayak",
                    "user_href": "/profile/Vasant-Nayak-1"
                },
                {
                    "user_id": "Nina Jones",
                    "user_href": "/profile/Nina-Jones-147"
                },
                {
                    "user_id": "Asimina Giannikaki",
                    "user_href": "/profile/Asimina-Giannikaki-1"
                },
                {
                    "user_id": "Ma Erna",
                    "user_href": "/profile/Ma-Erna"
                },
                {
                    "user_id": "Bootsy Claire",
                    "user_href": "/profile/Bootsy-Claire"
                },
                {
                    "user_id": "Elbir Javier",
                    "user_href": "/profile/Elbir-Javier"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Kat-Said-1"
                },
                {
                    "user_id": "Marie L Vidler",
                    "user_href": "/profile/Marie-L-Vidler"
                },
                {
                    "user_id": "Luke House",
                    "user_href": "/profile/Luke-House-8"
                },
                {
                    "user_id": "Clay Babin",
                    "user_href": "/profile/Clay-Babin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tridev Rath",
                "href": "/profile/Tridev-Rath"
            },
            "answer_text": "Light hair or blond hair is usually characterized by low levels of a dark pigment known as eumelanin. The shade of yellow for a person varies depending on the lack of the level of eumelanin. Blond hair is found more among white people, because of its inception in Europe(northern Europe). It is believed that light hair developed so as to help in efficient synthesis of vitamin D, whose lower level was caused by lack of sunlight in European countries. This is also the reason for their light skin. While at places where good amount of sunlight was available there was no need for light skin and thus people did not develop either light skin or light hair. ",
            "date": "Answered October 24, 2019",
            "views": "948",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mahabahu Mansingh",
                    "user_href": "/profile/Mahabahu-Mansingh"
                }
            ]
        }
    ]
}