{
    "title": "Why is falsifiability important in science? - Quora",
    "tags": [
        "Falsifiability in Physics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Danielle K Blood",
                "href": "/profile/Danielle-K-Blood"
            },
            "answer_text": "the point of falsifiability is that it gives us an objective standard by which to measure the truth value of a concept. We don't need to rely on your subjective assessment that Martians are unlikely, which is just as well because many people will tell you that it is unlikely that little green men haven't visisted Earth. Whether these things are likely or unlikely depend entirely on your starting assumptions. To paraphrase Popper, the point of falsification is that it prevents us from misleading ourselves, albeit unintentionally or subconsciously. It might be the case that you reject the idea of visitors from Mars because you think that visitors from Mars are unlikely, but what happens if you believe something to be likely that is actually untrue? As Popper notes, followers of all sorts fo nutty ideas like astrology or spirit mediums believe that it is likely that what they accept is true. After all there is no reason why it is unlikley that the stars control our destiny or that the dead can speak. Moreover the followers can point to countless examples of where these things are suported by evidence. What falsifiability does is enable us to reject objectively test these ideas by asking them to make predictions. If the prediction fails then the idea can be rejected regardless of how likely you may personally think it to be. And if it succeeds then the idea can be held to be true regardless fo whether you think it is unlikely. Thatsl why we can say, for example, that there are no major genetic differences between Caucasians and Negroes despite the fact that a few decades ago such an idea was held to be highly unlikely. ",
            "date": "Answered November 30, 2015",
            "views": "979",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lewis Lorton",
                    "user_href": "/profile/Lewis-Lorton"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shawn McCaslin",
                "href": "/profile/Shawn-McCaslin"
            },
            "answer_text": "As a practical matter, falsifiability really is not very important or useful. First, note that falsifiability is very rarely analyzed in formal scientific publications. You can’t expect to find a ‘falsifiability’ section in a typical paper published in any major science journal. Falsifiability, as a topic, is unlikely to be taught in any university science class outside of a philosophy department. You likely can be a successful science practitioner, even if you have never even heard of the concept. Furthermore, falsifiability is more an attribute of a practitioner than of a scientific proposition, per se. A blind person will have a different sense of falsifiability than will someone with eyesight. It is possible that some people have magical, transcendent abilities that allow them to discern truths about reality. Unfortunately, you must have such abilities to judge them. Also, the scope of the natural world for you might not be static; your natural world, and hence, your judgments of falsifiability can potentially change. Your inability, in principle, to falsify any particular proposition may just be due to impatience or laziness on your part. Also note that falsifiability is not a matter of degree; i.e, a proposition is either falsifiable, or it is not. This lack of nuance means that judging closeness, or potential for improvement, is impaired. Most fundamentally, science is not about assessing ‘truth value’; instead, it is a practical tool for creating reliable models for the prediction and control of the natural world. Proposed pseudoscientific models are naturally winnowed out over time by their failure to provide differentiated predictions, not by some pious falsifiability analysis. Falsifiability seems more like a quasi-religious tenet than a practical tool. ",
            "date": "Updated February 4, 2017",
            "views": "944",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vicky Krishnan",
                    "user_href": "/profile/Vicky-Krishnan"
                }
            ]
        }
    ]
}