{
    "title": "Why are some thin blankets warmer than thick ones? - Quora",
    "tags": [
        "Blankets",
        "Skinniness and Thinness",
        "Fabrics and Textiles",
        "Thermodynamics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Parks",
                "href": "/profile/Daniel-Parks-62"
            },
            "answer_text": "Mr. Patel, you’ve probably heard the old expression, “to stay with someone or something through thick and thin” means you persevere through good times as well as bad times. While that usually deals with friendships, it can also deal with inanimate objects like blankets and pillows. So what does that have to do with thick or thin blankets? Haven’t you ever had a favorite blanket that wasn’t particularly warm, but just because you’ve slept under it for a good number of years, it’s become special to you. And in many cases, those old blankets give you a certain warmth that a thick blanket doesn’t offer, even though they aren’t particularly thick or heavy. There’s a lot of things in life that are that way. Maybe your wife or girlfriend, your old hound dog of a fuzzy old cat… there’s many things in life that can be thin and warm. ",
            "date": "Answered October 24, 2020",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Peter Peters",
                "href": "/profile/Peter-Peters-69"
            },
            "answer_text": "Blankets do not physically warm you — they just reduce the loss of body heat, and allow you to raise your skin temperature, hence you perceive warmth when lying under them. The retention of the heat is caused by the insulating value of the blanket. Some blanket materials have finer fibres than others, and so they much reduce heat loss caused by cold air convection within the material, this allows thinner blankets of fine fibres to compete successfully with thicker ones made of thicker fibres. What will physically warm you, of course, is an electric blanket, either under or over. In a cold room at night it’s lovely to snuggle up without the expense of heating the whole room. It is a complete myth that artificial heating makes you soft and unable to tolerate tough conditions. the human body acclimatises rapidly no matter how you live. ",
            "date": "Answered October 23, 2020",
            "views": "31",
            "upvotes": "0"
        }
    ]
}