{
    "title": "Why does Trump think COVID-19 is a hoax? - Quora",
    "tags": [
        "Hoaxes",
        "Viruses (biology)",
        "Virology",
        "COVID-19 (2019-2020)",
        "Donald Trump (politician, business person)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ross Cohen",
                "href": "/profile/Ross-Cohen-1"
            },
            "answer_text": "He doesn’t, that’s just something he says about everything that makes him look bad. 130,000+ Americans dying on his watch? Can’t be, must be a hoax. 3,000,000+ Americans getting infected on his watch? Can’t be, must be a hoax. If he really thought it was a hoax: he wouldn’t require his staffers to be tested before coming near him. If he really thought it was a hoax: he wouldn’t require his supporters to waive their right to sue if they get sick from attending his rally. If he really thought it was a hoax: he wouldn’t suggest his constituents drink bleach, inject themselves with Lysol, or take unproven drugs. We’re almost 6 months since the first US COVID case and 3 months since the peaks of cases and deaths back in April when the nation’s densest, most populous city was getting hit hard, but unlike much of the world, we’ve made no progress. We’re now breaking records day after day in numerous large cities and states around the country, with a repeat of all the same issues from before, as if we learned nothing and gained no advantage in all the time that’s passed. It’s hard to come up with the right analogy to put this in proper perspective, but it’s as if we had the 9/11 attacks, and then a few months later got attacked exactly the same way, again and again. But to be clear, I mean exactly the same way. It wasn’t terrorists adapting, it was terrorists following the exact same plan that worked the first time, with our government utterly failing to learn from experience; no additional screening for people with one way tickets, no hardening of cockpit doors, no banning of box cutters, no increase in air marshals, no intelligence sharing between agencies, no freezing terrorist finances, no attacks on training camps or pursuit of masterminds, no follow-ups on student pilots with no interest in learning how to land…no corrections whatsoever. So we get hit and lose 3,000 people. And then another 3,000. And then another. And another. Again and again and again. Instead of a national approach to a national problem, we get a president telling the states to figure it out themselves, with a patchwork of inconsistent approaches, making them compete with each other for a limited supply of screening technologies. He doesn’t want to be blamed for failure to prevent additional deaths, so he takes no responsibility, but encourages states to weaken airport security and complains about every measure they take. Instead of the public collectively deciding they’d risk sacrificing themselves to overpower the terrorists and re-take the plane so they couldn’t be used as weapons of mass destruction, we have a chunk of one political party saying “who cares if people die?! I’m not going to inconvenience myself to save thousands of lives!” And instead of “see something, say something” campaigns encouraging vigilance from the public, we’re given mixed messages. It’s not at all difficult to imagine Trump immediately and regularly contradicting his own government’s public safety campaign, “Some people say you should say something, but I don’t like saying something. You don’t have to say something, okay? A lot of people don’t want to say something, and that’s okay, too.” We had 9/11 “truthers” calling it a hoax, but at least none of them were President of the United States.  EDIT: Recently released recordings made in February 2020 reveal Trump admitting he knew COVID-19 was extremely deadly and not a hoax.  For more answers like this, follow Political Clarity, Demystifying U.S. Politics. ",
            "date": "Updated September 14, 2020",
            "views": "17",
            "upvotes": " View 89 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alvin Cheung",
                    "user_href": "/profile/Alvin-Cheung-48"
                },
                {
                    "user_id": "Christine Roughton-Stay",
                    "user_href": "/profile/Christine-Roughton-Stay"
                },
                {
                    "user_id": "Leslie Foster",
                    "user_href": "/profile/Leslie-Foster-20"
                },
                {
                    "user_id": "Todd Kort",
                    "user_href": "/profile/Todd-Kort"
                },
                {
                    "user_id": "Theresa Leatherwood",
                    "user_href": "/profile/Theresa-Leatherwood"
                },
                {
                    "user_id": "B. A. Ricucci",
                    "user_href": "/profile/B-A-Ricucci"
                },
                {
                    "user_id": "Lee Walker",
                    "user_href": "/profile/Lee-Walker-77"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Friday-Van-Defoe-1"
                },
                {
                    "user_id": "Hemelton Matlonya",
                    "user_href": "/profile/Hemelton-Matlonya"
                },
                {
                    "user_id": "Mike Schmidt",
                    "user_href": "/profile/Mike-Schmidt-58"
                }
            ]
        },
        {
            "author_info": {
                "name": "Henry R. Greenfield",
                "href": "/profile/Henry-R-Greenfield"
            },
            "answer_text": "It is September, 2020, almost 190,000 dead from the Pandemic CV19. 6 million cases in the USA with an ‘improvement’ of only 45,000 cases a day and most importantly deaths at still over 1,000 per day and a revised estimate of 350,000 dead by the end of the year according to the latest projections. USA Totals 6,211,796 Dead 187,736 Recovered 3,456,263 Active 2,567,797 Total Cases Per 1 mil pop 18,767 Deaths Per 1 mil 567 Total Tests 82,624,841 Tests per 1 Mil 249,620 The USA ranks among the worst in all categories including #1 in deaths, cases, active cases and number 20 in cases per 1mil pop and still about 22% of the global cases and deaths. IN OTHER WORDS, THERE IS A GLOBAL PANDEMIC AND THE USA IS AMONG WORST IN ALL RELEVANT CATEGORIES. And yes, facebook and social media and the right wing fake news sources all say it is: OverA hoaxA conspiracy by Democrats, antifa, socialists, communists, Biden, Harris, Bernie Sanders, the DEEP STATE, the protesters, the looters and onlyTrump the messenger from God can prevent this all from going to hell in a hand basket. Only Trump stands tall in this war against evil.Why do I know this? Because I decided to not delete or defriend the Trumpers because if you do, you will not see what they see. You will not understand that they believe these crazy nonsense things, that Blacks are coming to get them just like they have supposedly been coming to get them since they came on slave ships in 1619. That Mexicans, our service workers, gardeners, helpers, essential workers are somehow going to rape the women of the suburbs. That Dem govs are deliberately letting people die to get Trump, that they are atheist evil things, not hardly human who want the destruction of the great american country that they built with their hands and hard work and sweat. Oh, and yep pass me another beer and whats on tv tonight, how about those Yankees, and when does the Alabama football season start as the SEC home of thousands of cases of CV19 is the only league playing not like those sissies up north like Michigan and Notre Dame. Hey lets go to dinner, I want to catch the game at the sports bar, no way am I wearing a mask and I cannot believe what that damn communist Biden would do if he gets elected. No, no way in hell do they believe there is a pandemic. The numbers at the top are fake, no matter if they are from JOHNS HOPKINS or any other reputable independent source, they are wrong, fake, liars and if a few die, well that’s the way it is gonna be because we are not giving up our way of life and Trump is going to MAKE AMERICA GREAT AGAIN AGAIN and then Ivanka will come in and making it AGAIN AND AGAIN AND AGAIN and we dont need the constitution much and sure if Trump can stay we will just add another term like his buddies Putin and Xi Jin Ping and Little Rocket Man Kim does and we always kind of like a royal approach to things and didn’t they look great on the White House lawn and I loved those Trump fireworks. Pandemic, come on, let’s have some fun and don’t forget to vote our guy in, he is the only thing separating us from exactly what we have today and more for another 4 years. ",
            "date": "Answered August 31, 2020",
            "views": "44",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "Evon Mendelsohn",
                    "user_href": "/profile/Evon-Mendelsohn"
                },
                {
                    "user_id": "Alvin Cheung",
                    "user_href": "/profile/Alvin-Cheung-48"
                },
                {
                    "user_id": "Jill Vice",
                    "user_href": "/profile/Jill-Vice-2"
                },
                {
                    "user_id": "Stephen Wernick",
                    "user_href": "/profile/Stephen-Wernick"
                },
                {
                    "user_id": "Neeraj Varma",
                    "user_href": "/profile/Neeraj-Varma-2"
                },
                {
                    "user_id": "Lois Marshall",
                    "user_href": "/profile/Lois-Marshall-19"
                },
                {
                    "user_id": "Brendan Morgan",
                    "user_href": "/profile/Brendan-Morgan-38"
                },
                {
                    "user_id": "Leslie Foster",
                    "user_href": "/profile/Leslie-Foster-20"
                },
                {
                    "user_id": "Missy Montreal",
                    "user_href": "/profile/Missy-Montreal"
                },
                {
                    "user_id": "MS Li",
                    "user_href": "/profile/MS-Li"
                }
            ]
        }
    ]
}