{
    "title": "Why are there so many different kinds of rocks? - Quora",
    "tags": [
        "History of Earth Science",
        "Rocks and Stones"
    ],
    "response": [
        {
            "author_info": {
                "name": "Patrick Cooper",
                "href": "/profile/Patrick-Cooper-9"
            },
            "answer_text": "Rocks are the result of different mineral assemblages. There are around 5000 mineral series but probably tens of thousands of individual minerals. The amount of minerals in a rock determines what rock type it is. But not only that - things like texture and rock fabric can also contribute to a rock name. Example: basalt is a common rock formed by the cooling of extrusive lava at or near the surface. But it's also possible to get alkali basalt and tholeiitic basalt depending on whether it has erupted on ocean islands or as continental flood basalts. Furthermore, maybe there's an abundance of one particular mineral within the basalt. If it weathers slightly it may become a spilite, or maybe a metabasalt if it's buried and heated a little. Maybe it'll weather completely into a sedimentary rock or get buried into a metamorphic rock and then whole new classification schemes come along. So you can see how rocks are dynamic and can evolve and can't really be painted with the same brush. There are thousands of different types from garnet mica schists to nephaline trachyandesites to coarse-grained subarkosic arenites and all the shades in between. ",
            "date": "Answered August 10, 2014",
            "views": "34",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chelsey Stewart",
                    "user_href": "/profile/Chelsey-Stewart-16"
                },
                {
                    "user_id": "Tony Long",
                    "user_href": "/profile/Tony-Long-36"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Dutch",
                "href": "/profile/Steve-Dutch"
            },
            "answer_text": "We have two interlocked cycles. The Hydrologic Cycle evaporates water from the oceans and drops it on land as rain and snow. The water chemically alters minerals and dissolves elements out of them, and also mechanically transports fragmentary debris. Dissolved materials precipitate or are used biologically to make shells (macroscopic and microscopic). The result is the wide variety of sedimentary rocks that cover the earth’s surface. The other cycle is Plate Tectonics. The earth’s oceanic crust sinks into the earth’s mantle, and as it descends, it heats up. It’s been soaking in sea water for a long time, and as it heats up, it gives off water. Water lowers the melting point of rocks, so molten rock forms above the descending plate and starts to rise. It heats the adjacent crust, creating metamorphic rocks. Molten rock invades the crust and hardens, creating intrusive rocks, or erupts on the surface as volcanic rocks. ",
            "date": "Answered November 8, 2017",
            "views": "852",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mgosha Fabian",
                    "user_href": "/profile/Mgosha-Fabian"
                },
                {
                    "user_id": "Dave Smith",
                    "user_href": "/profile/Dave-Smith-357"
                },
                {
                    "user_id": "Mrinmay Bhattacharjee",
                    "user_href": "/profile/Mrinmay-Bhattacharjee-2"
                }
            ]
        }
    ]
}