{
    "title": "Why is the Earth in a spherical shape, not a cube or any other 3D shape? - Quora",
    "tags": [
        "Shapes",
        "Earth (planet)",
        "Planetary Science",
        "Astronomy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shivansh Singh",
                "href": "/profile/Shivansh-Singh-31"
            },
            "answer_text": "Imagine a civil engineer is working on to construct a building. If he wants to construct a tall building then he needs to build a strong foundation so that the building does not become weak to hold the topmost part. And does not collapse due to its own weight. As if the building goes taller and taller, its mass will increase and hence, the greater it exerts the force of attraction towards the centre of Earth. A planet (say Earth) is formed by Accretion - accumulation of gaseous and lumps of dust particles to form a massive object that attracts more and more particles as it becomes gravitationally stronger. Now, a planet does not build on a strong foundation, so the part of a lump which is farther from the formed accretion disk will be weak to remain in that position and will attract towards the centre of the accretion disk. (*recall from the building intuition; Here, the foundation is not strong so the farther/taller part is weak*) Thus, every lump which is farther from the centre will attract toward it trying to make the overall shape of the accretion disk more and more “compact”. The process will continue when every surficial point is equally distanced from the centre. Hence, forming a Sphere whose every point on its surface is equidistant from its centre.  Also, when the shape of the accretion disk is smaller (when accretion disk is unable to collect lumps of matter), then its gravitational force will not be strong enough to compress matter towards centre. Thus, smaller bodies like Deimos and Phobos are irregular in shape. ",
            "date": "Answered September 4, 2018",
            "views": "618",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rockne Stephenson",
                    "user_href": "/profile/Rockne-Stephenson"
                },
                {
                    "user_id": "Dhruti Bhagora",
                    "user_href": "/profile/Dhruti-Bhagora"
                },
                {
                    "user_id": "Randy Mennie",
                    "user_href": "/profile/Randy-Mennie"
                },
                {
                    "user_id": "Shweta Mehta",
                    "user_href": "/profile/Shweta-Mehta-15"
                },
                {
                    "user_id": "Shashwat Dubey",
                    "user_href": "/profile/Shashwat-Dubey-11"
                },
                {
                    "user_id": "Kamal Luniwal",
                    "user_href": "/profile/Kamal-Luniwal"
                },
                {
                    "user_id": "Ishita Singh",
                    "user_href": "/profile/Ishita-Singh-199"
                },
                {
                    "user_id": "Phil Orion Wesom",
                    "user_href": "/profile/Phil-Orion-Wesom"
                },
                {
                    "user_id": "Soumi Dey",
                    "user_href": "/profile/Soumi-Dey-16"
                }
            ]
        }
    ]
}