{
    "title": "Why do many scientists not believe in God? - Quora",
    "tags": [
        "Atheist Beliefs",
        "Atheism and God",
        "Science and Religion",
        "Christian Beliefs",
        "Religious Beliefs",
        "Scientists",
        "Atheism",
        "Belief and Beliefs",
        "God"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Collins",
                "href": "/profile/James-Collins-33"
            },
            "answer_text": "Originally answered: Why do many scientists not believe in God? Who taught you about God? Your parents? Who taught them about God? And who taught THOSE people? Eventually you go back in a chain that goes for hundreds or thousands of years. You know that some people are incapable of perceiving reality - Schizophrenic, experiencing a psychotic break, drug/alcohol addicted - heck, starvation, thirst, sensory-deprivation, sleep-deprivation, hypnogogic sleep, oxygen depletion (from drowning, suffocation, apnea, exertion, or shock) fear, head trauma, and a dozen other things will cause you to misunderstand what you see, or to see things that are just plain not there. Add to that charlatans, people misremembering and misquoting stories out of context, people misunderstanding hyperbole, the taking of fictional parables as literal histories, the growth of urban legends, and a dozen other ways things get made up, and you see that lots of times people believe things that weren't properly vetted. So, with both of those things - stories that nobody saw and people seeing things that weren't there, how likely is it that someone might end up with a story about flying carpets or multiplying loaves and fishes? I'm not saying it's definite, but you can see how that could happen, right? So. A scientist knows that she can be wrong. A scientist is trained to look for ways she might be wrong. And top of the list is believing something that nobody has looked at. \"Hey, I just wondered; why are boys better at math?\" \"I don't know, let's study it.\" \"It turns out our results say girls AREN'T worse at math; but teachers and parents dissuade them from working at it. Whoops.\" So, which is more likely? that everyone, in an unbroken chain between you and Moses, was sane, sober, and healthy from every moment from him to you, or that somebody had \"a vision\", and then told it to some one who expanded on it... etc? You can see that the odds are that it was a mistake. you could argue that it's POSSIBLE; lotteries have immense odds against, but somebody wins every week. But still, the way to believe is the thing that seems more likely, and more reasonable. Guess what? Faith means \"Don't look too hard at this; it's God's secret, not yours.\" To a scientist, that means you probably either have something to hide, something that hasn't been examined, or something with bad or inconsistent evidence. Religion is all three. God may exist (though probably not), but if so religion is just about the worst POSSIBLE way to find her. ",
            "date": "Updated September 19, 2018",
            "views": "691",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dean Jay Smith",
                    "user_href": "/profile/Dean-Jay-Smith"
                },
                {
                    "user_id": "Osake Vrück",
                    "user_href": "/profile/Osake-Vrück"
                },
                {
                    "user_id": "Francisco Zafra",
                    "user_href": "/profile/Francisco-Zafra-1"
                },
                {
                    "user_id": "Krister Sundelin",
                    "user_href": "/profile/Krister-Sundelin"
                },
                {
                    "user_id": "Walter Forstbauer",
                    "user_href": "/profile/Walter-Forstbauer"
                },
                {
                    "user_id": "Jim Brown",
                    "user_href": "/profile/Jim-Brown-437"
                },
                {
                    "user_id": "William Pascal",
                    "user_href": "/profile/William-Pascal-1"
                },
                {
                    "user_id": "Jerry Christodoulellhs",
                    "user_href": "/profile/Jerry-Christodoulellhs"
                },
                {
                    "user_id": "Vanderlam Filho",
                    "user_href": "/profile/Vanderlam-Filho"
                },
                {
                    "user_id": "Vikrant Vaidya",
                    "user_href": "/profile/Vikrant-Vaidya"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Pech",
                "href": "/profile/Daniel-Pech"
            },
            "answer_text": "The reason why many scientists do not believe in God is partly because they, like all human beings, have a natural, and justified, trust in the physical world as a prime avenue of knowledge. It’s the other part that can get mixed up, though sorting that out can be very tricky.  And part of that trick is that its very trickiness does not determine that there is a God, or isn't. That level of detail is an entirely personal matter. --------- So how it is explained that many scientists do not believe in God? I myself would offer the explanation of a narrowness in favor of two of the three possible worlds: those persons who more-or-less directly study the physical and/or living behavioral worlds can become very narrowly focused on the value of that particular avenue of knowledge. When that happens, such persons may acquire a taste for a ‘knowledge diet’ that consists mainly or entirely of that which they individually feel comes directly from those two worlds. So they would tend to exclude any kind of knowledge that they think has not come from the physical or behavioral worlds, but merely from the mental world. So two general points:  1. All human knowledge is grounded at least partly on human’s knowledge of the physical and behavioral worlds. But it is how we interpret those two worlds that determines  what we believe about God (there is/isn’t any God, there is/isn’t this or that  god, etc.). 2. And what drives our interpretations of the physical and behavioral worlds is our psychology: the combination of our inner motives and our brain functions. --------- But what forms our inner motives is the interactions between our personally unique brain functions and the particular socio-cultural forces within which we live. One may call this the' brain-and-society' equation. Belief in God, or, conversely, lack of belief in God, is just one of many possible results from the possible interactions between brain and society. And I would say that atheism is easy to maintain on its own terms. But, that, in order for atheism to be maintained in face of the physical and psychological worlds, it must, in some sense, be worked at: the active denial of any God. In countries without any normative cultural history of theism, such active denial is as easy as destroying some delicate structure: it smashes easily in face of cultural forces. But this is not quite so easy in cultures that have had the most deep and close history with theism, namely that of the Jews, and that of the Judao-Christian West. ---------  So the combination of our inner motives and our brain functions in no way determines just which of many possible conceptions of God that we end up with. For that, there necessarily exists an additional layer of interactions between our personally unique brain functions and the particular socio-cultural forces within which we live. It’s complicated, but there are social, social-historical, and biogenetic factors involved. --------- But I would say that the basic issue is this:  not all possible conceptions of God are a good match for doing science. The human mind is just too malleable for that. So the issue is not just why many scientists do not 'believe in God'.  The issue necessarily involves just which conceptions of God---and thus which conceptions of science---that these scientists have managed to have. It's kind of a balancing act, similar to that between the self-and-society equation. If a person is missing the conceptions of God that are a good match for doing science, then of course that person is not going to believe in God. Or, if a person's conceptions of God are a poor match prior to their doing much science, then their doing much science shall drive that person toward some disbelief in God. So the details of someone's logic for why they do not believe in God merely follows suit from the particular balance they have struck between a conception of God and a conception of science. And, most importantly, it is those details of a person's logic for not believing in God that acts as a kind of padlock against that person's ability to conceive how God can exist. So 'science' wins in that person's mind, as if there necessarily must be one versus the other.  The same applies to theists. And so there is this conflict between theists and atheists that informs/misinforms each other's conceptions of God and science.  In other words, the devil is in the details. Confirmation Bias 101. --------- But as I said at the start, none of all this determines that there is a God, or isn't. It just shows that atheism is no less problem-riddled than is theism. People are people regardless which they believe. As in, over-simplistic, or flaw-riddled, in their thinking. . ",
            "date": "Answered November 26, 2015",
            "views": "397",
            "upvotes": "0"
        }
    ]
}