{
    "title": "Why do some people intentionally cut themselves? - Quora",
    "tags": [
        "Self-harm",
        "Understanding and Improving Mental Health",
        "Mental Health"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bianca Kistasamy",
                "href": "/profile/Bianca-Kistasamy"
            },
            "answer_text": "So it all started in 2017, when I turned 13, and realised that life sucked, but I kept living and ignored it, then 2018 came, first year of high school, I hated it, every second, but I made two amazing friends who made everything better. At the end of the year my great grand mother died, and she suffered for more than a month. I started cutting my upper arm, but I just grazed my skin, then my grandfather died and I started hurting myself even more, but only grazing my skin. I stopped and then this year February came and everything changed, recap-during the month of December my mom and her brother had a fight and stopped talking to each other,he left from our lives. So my uncle got married in 2014 and i hated his wife so much, but when she got pregnant I started loving her, and when I love someone, I love them with all my heart. She is a two faced asshole, and even though she hurt us so many times, I saw passed it because my love was blind. I started hating her in 2018, because I realized that she was fake and I needed to stop loving her because she started playing with my emotions and hurting me but I didn't realize it and after this whole problem that occurred, I started blaming myself for everything, for being hurt, for trusting, for getting too close. Oh and she took my cousin away from me, so that killed me as well. The worst part is that my uncle left for money, created a scene with his family so he could get his in laws money(messed up, I know) the fact that he just abandoned me, when I use to consider him to be my older brother rather than my uncle and we were so close, and he just left. The other reason was because my actual older brother stabbed me in the back. I can't look at him the same way I used to, now when I'm with him I only think about what he did. This made me blame myself, I thought I wasn't a good enough sister and I deserved all this shit, but I realised that I didn't deserve any of this. In February 2019, I started cutting myself with a needle, I stopped on 4 March and starTed again on 4 may( 2 months later) this time I cut myself deeper and drew blood. I was ready to end it all because clearly I wasn't worth loving or caring for, so I'm not needed since i don't really have anyone I can trust, well I have my best friend, but I feel like she's gonna leave like everyone else, and I'll just end up hurt again. I've been clean for 17 days now, and I'm happy about it. I still feel like I'm not needed and I'm not worth anything because I'm a useless piece of shit, but I don't think I should be hurting myself anymore. I decided that I'm just gonear live life and see where it takes me. There's a quote by Charles Bukowski that I believe in “ you have to die a few times before you can live” this is totally how life works. ",
            "date": "Answered June 20, 2019",
            "views": "18",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anna Brown",
                    "user_href": "/profile/Anna-Brown-721"
                },
                {
                    "user_id": "ツ Zo",
                    "user_href": "/profile/ツ-Zo"
                },
                {
                    "user_id": "Lily Josh",
                    "user_href": "/profile/Lily-Josh-4"
                },
                {
                    "user_id": "Sterling Koo",
                    "user_href": "/profile/Sterling-Koo"
                },
                {
                    "user_id": "Aaralyn Avalos",
                    "user_href": "/profile/Aaralyn-Avalos"
                },
                {
                    "user_id": "Amy Jay",
                    "user_href": "/profile/Amy-Jay-57"
                },
                {
                    "user_id": "No One",
                    "user_href": "/profile/No-One-4746"
                },
                {
                    "user_id": "Esraa Reda",
                    "user_href": "/profile/Esraa-Reda-28"
                },
                {
                    "user_id": "Jonathan Crews",
                    "user_href": "/profile/Jonathan-Crews-2"
                },
                {
                    "user_id": "Gracie Burgess",
                    "user_href": "/profile/Gracie-Burgess-5"
                }
            ]
        }
    ]
}