{
    "title": "Why does acetic acid dissociate in water? - Quora",
    "tags": [
        "Acetic Acid",
        "Acids",
        "Organic Chemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Pohl",
                "href": "/profile/Chris-Pohl-1"
            },
            "answer_text": "Acetic acid dissociates in water because it is a proton donor with a charge stabilized anion. This spreads the resulting negative charge over a relatively large area, making it easier for acidic acid to become ionize. The electronic structure of the ionized form of acetic acid is different from what is normally shown. The central carbon atom has two oxygen atoms that share a partial double bond with the negative charge associated with the ionized form of acetic acid spread over all three atoms. This lessens the ionization energy required when forming the ionized form in water. ",
            "date": "Answered September 29, 2018",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chris Specker",
                "href": "/profile/Chris-Specker"
            },
            "answer_text": "Acetic acid is a carboxylic acid. All carboxyl groups contain an O-H bond capable of dissociation. Unlike water and most alcohols, this results in a structure where the negative charge is not strictly associated with the oxygen that the proton was previously attached to. Instead, the charge is delocalized through a nonbonding pi orbital where the probability density is distributed equally between the two oxygen atoms in the carboxylate anion. This delocalization stabilizes the ion somewhat—not enough to promote complete dissociation (in most circumstances) but does mean that when carboxylic acids are mixed with water or alcohols the carboxyl group will tend to be favored as a proton donor while the other -OH groups in solution will be favored as proton acceptors. ",
            "date": "Answered July 8, 2017",
            "views": "15",
            "upvotes": "0"
        }
    ]
}