{
    "title": "Why is there no gravity in space? - Quora",
    "tags": [
        "Gravity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Akhileshwar Pandit",
                "href": "/profile/Akhileshwar-Pandit"
            },
            "answer_text": "Category: Space There is gravity in space – lots of it. Gravity is everywhere. It is true that as you get farther from the earth, its gravitational pull weakens. But it dies off quite slowly (compared to nuclear forces). And gravity never goes completely away. When you get very close to some other large body; the moon, Mars, or the sun; its gravity dominates over that of the earth. Only then can you neglect earth's gravity. Because gravity is everywhere in space, objects in space are always falling: towards the earth, towards the sun, and towards the galactic center. There are two reasons that objects seem to be floating without gravity in space when they are really falling.  Each galaxy is held together by strong gravitational forces. Even if you managed to get away from our sun, you would still experience the galaxy's gravity. This image is an artisitic rendition of our galaxy. First, space is very large and relatively empty by earth standards. When you jump off a bridge, you know you are falling because you feel the air whooshing up, see the mountains shooting up, see the water fast approaching, and then feel yourself hit the water. Because space is relatively empty, there is little air to feel whooshing past you as you fall and there are no landmarks to indicate you are moving. Because space is so large, it takes you from hours to years of falling through space until you actually hit the surface of a planet (assuming you have aimed properly so that you actually do hit), instead of the seconds it takes jumping off a bridge. The second reason that gravity is not so obvious in space is because objects tend to orbit planets instead of hitting them. Orbiting just means that an object falls towards a planet due to gravity and continually misses it. Because space is so large and planets are so small by comparison, it's actually very hard to hit planets. Space objects typically slingshot in hyperbolic paths around planets, or slip into orbits around them. It takes a team of scientists doing very accurate calculations to make sure a space probe destined for the surface of Mars doesn't miss it. Falling in circles around a planet instead of smashing into it doesn't seem like the gravity we're used to on earth, but it's the exact same kind of falling. Astronauts in orbit around the earth are not experiencing \"no gravity\". They are experiencing almost all of earth's gravity, but with nothing to stop them. This is known as \"free fall\". Free fall looks like floating to a person in the falling frame of reference. Confusingly, scientists refer to an orbiting environment as \"microgravity\". What they really mean is \"micro acceleration\", which is another term for free fall. This unfortunate naming convention arises from the fact the word \"gravity\" is used historically to mean any acceleration, and not just gravity. For example, when an accelerating drag racer experiences four g's, the acceleration is due to the spinning tires and has nothing to do with gravity.  This drawing shows the sun and Mercury with their distance and sizes to scale (the size of Mercury was rounded up to one pixel to make it visible). Considering that Mercury is the closest object to the sun, you can see that space is a very empty place (at least as far as planets go – in terms of particles and fields, space is not empty). For this reason, falling in space looks like floating. ",
            "date": "Answered March 10, 2020",
            "views": "351",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Satvik Srivastava",
                    "user_href": "/profile/Satvik-Srivastava-3"
                },
                {
                    "user_id": "Ralph Sanchez",
                    "user_href": "/profile/Ralph-Sanchez-50"
                },
                {
                    "user_id": "Yuri Shiritori",
                    "user_href": "/profile/Yuri-Shiritori"
                },
                {
                    "user_id": "Alahna Rodriguez",
                    "user_href": "/profile/Alahna-Rodriguez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Skip Morrow",
                "href": "/profile/Skip-Morrow"
            },
            "answer_text": "This is a very common misconception. There is absolutely gravity in space. The ISS is in orbit at about 350 km above the surface of the earth. And they DEPEND on the gravity. The orbit would not work if it weren't for gravity. Let me explain why. Perhaps you have heard the term \"free fall\" associated with something in orbit. That's because the object in orbit (satellite, ISS, space shuttle, etc) is in free fall. If something is resting on something else, it is not in free fall. Everything else is in free fall. If you throw a ball in the air, it is in free fall from the time it leaves your hand. Birds and planes in flight are not weightless because they are \"resting\" or supported by the air that they are flying in. And things that are in free fall are considered weightless. You are not weightless right now because you are sitting in your chair. So, the ISS is falling because it is not being supported by anything. And what makes things fall? Gravity. And since the ISS is falling, and the astronauts are falling along with the ISS, they are also weightless. You might wonder then why doesn't the ISS come crashing down to earth, since it is in free fall after all. The reason why it doesn't hit the earth is because it keeps on missing. You see, it is travelling so fast sideways (17,500 mph) that as it falls, it follows along the curvature of the earth exactly. Let me give you one more thought experiment. Imagine a pole that is big enough for you to stand on, three meters high. You can stand on it, and you don't feel any lighter because you are only ten feet high. If you jump off, you know you will land on the ground. That's gravity at work. Now imagine the pole 350km high. And you are standing on the top of it. Yes, you would be able to stand on it. You'll need a space suit because there is no air up that high. But you would not be weightless. Not by a long shot. You would be a little lighter due to centripetal forces and the fact that you are 350km above the surface of the earth. But you would be able to stand just fine. And if you can stand, that means you can jump. You would fall off and start rapidly accelerating to the earth's surface. And why would you fall? Because of gravity. Even that high. ",
            "date": "Updated January 7, 2015",
            "views": "45",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yasir Kk",
                    "user_href": "/profile/Yasir-Kk"
                },
                {
                    "user_id": "D.S. Mrutunjay Mohanta",
                    "user_href": "/profile/D-S-Mrutunjay-Mohanta"
                },
                {
                    "user_id": "Curtis Quick",
                    "user_href": "/profile/Curtis-Quick"
                },
                {
                    "user_id": "A.Fakir Reddy",
                    "user_href": "/profile/A-Fakir-Reddy"
                },
                {
                    "user_id": "Dawit Solomon",
                    "user_href": "/profile/Dawit-Solomon-47"
                },
                {
                    "user_id": "Sanjidha Hassan",
                    "user_href": "/profile/Sanjidha-Hassan"
                },
                {
                    "user_id": "Mritunjay Sharma",
                    "user_href": "/profile/Mritunjay-Sharma-24"
                },
                {
                    "user_id": "John A. MacKay",
                    "user_href": "/profile/John-A-MacKay"
                },
                {
                    "user_id": "Andrew Lindsey",
                    "user_href": "/profile/Andrew-Lindsey-3"
                },
                {
                    "user_id": "Mark Turner",
                    "user_href": "/profile/Mark-Turner-144"
                }
            ]
        }
    ]
}