{
    "title": "Why are there so many Indians and Bangladesh CS students posting educational CS videos on YouTube? - Quora",
    "tags": [
        "Bangladesh",
        "Computer Science Education",
        "Videos",
        "YouTube Videos",
        "YouTube"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marco Villarreal",
                "href": "/profile/Marco-Villarreal-27"
            },
            "answer_text": "I understand your problem sir. I’m an engineering student and sometimes book topics are hard to comprehend at first so I usually go seek YouTube tutorials to answer all my doubts. Despite some being very helpful the problem is that there are WAY TOO MANY (excuse the expression) videos being posted by either students or teachers from Indian universities and while some of the YouTube videos are helpful (like KhanAcademy for example) others are not. One of the reasons they are not helpful is the accent which for many English speakers (me being a non native English speaker) is very annoying and frustrating because sometimes words are hard to understand, and the worst part is that they even mix words in Hindi with English in a sort of thing called “Hinglish” (which makes videos even harder to comprehend). Plus many of their microphones are very low in quality. Result: very low quality videos. Please friends from India do not feel offended, I know that your intentions are good and I respect it but PLEASE if you want to share knowledge in YouTube at least try not to mix words from different languages since not all of the spectators are familiar with Hindi language and adquire better recording equipment. ",
            "date": "Answered September 21, 2017",
            "views": "35",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amrita Sahu",
                    "user_href": "/profile/Amrita-Sahu-19"
                },
                {
                    "user_id": "Real Gammer",
                    "user_href": "/profile/Real-Gammer-2"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Erian-4"
                },
                {
                    "user_id": "Adrian McDonald",
                    "user_href": "/profile/Adrian-McDonald-1"
                },
                {
                    "user_id": "Karim Selemani",
                    "user_href": "/profile/Karim-Selemani-1"
                },
                {
                    "user_id": "Peter Clark",
                    "user_href": "/profile/Peter-Clark-44"
                },
                {
                    "user_id": "Elvern Eng Hui",
                    "user_href": "/profile/Elvern-Eng-Hui"
                },
                {
                    "user_id": "Chandler Hansen",
                    "user_href": "/profile/Chandler-Hansen-7"
                },
                {
                    "user_id": "Jose Gabriel Olivares",
                    "user_href": "/profile/Jose-Gabriel-Olivares"
                },
                {
                    "user_id": "Masterpiece of Meow",
                    "user_href": "/profile/Masterpiece-of-Meow"
                }
            ]
        }
    ]
}