{
    "title": "Why do magnetic field lines travel north to south outside the magnet and south to north inside the magnet? - Quora",
    "tags": [
        "Magnets",
        "Magnetism",
        "Magnetic Fields"
    ],
    "response": [
        {
            "author_info": {
                "name": "Keith Allpress",
                "href": "/profile/Keith-Allpress"
            },
            "answer_text": "The arrows are the direction of force around an electric current. The lines of force are first generated inside the bar, so your question is slightly wrongly put. Also you have got cause and effect back to front as well. The north is labelled north because the lines point that way inside the bar. And the lines point all that way because the loops of force belong to domains, that align themselves to point the same way. You probably didn't know that metals are crystals with crystal domains. When the domains stay stuck in the aligned orientation we call that a permanent magnet.Here is an image  ​​​From \"Magnetic domain\" on @Wikipedia: https://en.wikipedia.org/wiki/Magnetic_domain?wprov=sfia1 Can you see the microcrystals, with stripy domains on them? As long as enough domains are aligned, they add up to a net force. Here they are in 3D.  ​The metal has a property called permeability (the corresponding electric property is called permittivity) that represents how easily magnetic fields can exist, so the metal itself has a high magnetic permeability compared to air, and the flux tubes appear to \"fan out\". You need to imagine the field you find as the net result of many contributions. For example the magnetic loops around a current add together to make a solenoid field like this  ​​​The field you see is the net result of adding wires together. Likewise you can apply the same kind of additive reasoning to the bar magnet aligned domains. So tiny effects scale up to larger effects, like this:  ​​Imagine my drawing is the bar, end on. Then these are the effective electron currents in the metal. Air doesn't carry such currents. ",
            "date": "Updated February 1, 2019",
            "views": "177",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bisma Joyosumarto",
                    "user_href": "/profile/Bisma-Joyosumarto"
                },
                {
                    "user_id": "Ramawati Singh",
                    "user_href": "/profile/Ramawati-Singh-1"
                },
                {
                    "user_id": "Shreeyansh Rathore",
                    "user_href": "/profile/Shreeyansh-Rathore"
                },
                {
                    "user_id": "YOGESH KHANDAL",
                    "user_href": "/profile/YOGESH-KHANDAL-1"
                },
                {
                    "user_id": "Rik Nag",
                    "user_href": "/profile/Rik-Nag-3"
                },
                {
                    "user_id": "Aditi Pandey",
                    "user_href": "/profile/Aditi-Pandey-149"
                },
                {
                    "user_id": "Anas Hussain Khan",
                    "user_href": "/profile/Anas-Hussain-Khan"
                },
                {
                    "user_id": "Shaik Raqueeb",
                    "user_href": "/profile/Shaik-Raqueeb"
                },
                {
                    "user_id": "Deepjoy Sarkar",
                    "user_href": "/profile/Deepjoy-Sarkar-1"
                },
                {
                    "user_id": "Richard Blezer",
                    "user_href": "/profile/Richard-Blezer-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harsha Takewal",
                "href": "/profile/Harsha-Takewal"
            },
            "answer_text": "because magnetic fields form a closed loop a magnet always has a north and south pole and a north or south pole can never exists alone and mag field lines are emerge from north then merge into south n then to form close loop from south to north ",
            "date": "Answered January 11, 2018",
            "views": "25",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Naive",
                    "user_href": "/profile/Naive-25"
                },
                {
                    "user_id": "Ekamnoor Singh",
                    "user_href": "/profile/Ekamnoor-Singh-7"
                }
            ]
        }
    ]
}