{
    "title": "Why is oxygen more reactive than nitrogen? - Quora",
    "tags": [
        "Nitrogen",
        "Oxygen",
        "Organic Chemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christian Kelley",
                "href": "/profile/Christian-Kelley"
            },
            "answer_text": "I’ll blow through some physical features of oxygen and nitrogen, how that leads to the emergence of their particular electronegativities, and then talk about some examples of their chemical reactivity that are explained in the context of their electronegativity. Well, I can’t really find any numbers for nitrogen, but oxygen’s nucleus has a radius of about 3 femtometers, according to Chegg.com (haha, great source I know, but it sounds about right). Nitrogen’s nuclear radius is probably about the same, different by maybe a fraction of a femtometer. However, Oxygen has an extra proton, this means it has a tendency to attract more electrons. Given the combination of about the same nuclear size and a stronger pull of electrons, you can quite easily make the qualitative conclusion that oxygen will tend to hold electrons better. This is why oxygen is optimized having four localized electrons, and two bonds, while nitrogen is optimized having two localized electrons and three bonds (as exhibited by their position on the periodic table). The atomic radius of oxygen is 60 pm, while the atomic radius of nitrogen is only 65 pm (from Wikipedia lol fight me). These are the results of the near-equal size of nuclear radius but different amount of protons, oxygen holds electrons to itself more tightly. Oxygen has a particular nuclear structure so that it isn’t SOOO reactive (ahem, Fluorine) that it struggles to form stable bonds. But it’s also the second most electronegative element (a result of its small nuclear radius and proton count). Basically this means oxygen is somewhat comfortable holding a lot of electrons (pushing electrons on it in a reaction step, giving it a temporary formal charge of -1, is fairly common), and also has a tendency to pull electrons from other elements that aren’t as good at holding onto electrons. What is the result? Almost always, if oxygen is in a compound, there is a signficant dipole moment. This makes oxygen, and anything nearby, pretty reactive - anything with a lot of electron density (or not a lot of electron density, if you are the oxygen’s neighbor) will tend to react with something with low electron density (or with a lot of electron density). Sure, nitrogen also pulls electron density, but not nearly as good (electronegativity of 3.0 vs 3.5). This is a result of those factors discussed in the beginning - nuclear radius and proton count! This often means that nitrogen-containing compounds don’t have as big of a dipole, and therefore the compounds are less reactive. Although don’t get me wrong, they are still reactive - amines for example are often a pretty good nucleophile. Oxygen is capable of forming stable double bonds, and in fact, it often does this in carbonyl groups or even with other elements like sulfur, as it is favorable for oxygen to have two bonds and four localized electrons. Double bonds are typically reactive because breaking a double bond doesn’t require a lot of energy - the two bonded elements will still be bound by a sigma bond. This is a feature that also makes oxygen pretty reactive. Chemical reactions often push electron density from the pi bonding orbital onto the oxygen atom, and oxygen is fairly comfortable with this as a temporary step. This facilitates many reactions, such as those of carboxylic acid derivatives. Because Oxygen has localized electrons, it can also use these to bond with other atoms (such is the case in the generic acid, H30+). Overall, oxygen and nitrogen both are quite reactive, but the physical features of oxygen make it an element that is quite reactive. It has a tendency to facilitate reactions, as it forms signficant dipole moments and is comfortable bearing extra electrons, or using some of its localized electrons to bond. Nitrogen has similar qualities, but to a lesser extent. This increased reactivity of oxygen makes it capable of facilitating more reactions in different ways. ",
            "date": "Answered December 26, 2016",
            "views": "91",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nick Chan",
                    "user_href": "/profile/Nick-Chan-92"
                },
                {
                    "user_id": "Tapan Kamath",
                    "user_href": "/profile/Tapan-Kamath-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Griepenburg",
                "href": "/profile/Jim-Griepenburg"
            },
            "answer_text": "It depends on the chemical state of each. Atomic nitrogen and atomic oxygen don't exist under \"normal\" conditions because each forms molecules N2 and O2. N2 is less reactive than O2 in most gaseous reactions because there is a strong triple bond between the atoms, all the valence electrons are in bonding orbitals, and more energy is needed to excite them. The O2 molecule has 2 more electrons than N2. Since all the bonding orbitals are filled from the N2 configuration the additional 2 electrons are in higher energy anti bonding orbitals as a diradical [2 unpaired electrons]. these electrons are of higher energy and unpaired therefore O2 is more reactive. O2 retains its double bond character at least in the first steps of reaction mechanisms initially forming hyperoxides and peroxides that continue to react rapidly. This is in contrast to the halogens. F2 has 2 more electrons than O2 filling the antibonding orbitals, therefore F2 has a relatively weak single bond and no radical character and most halogen reactions involve breaking the weak single bond to give halogen radicals[atoms]. ",
            "date": "Answered December 13, 2016",
            "views": "49",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kopila Paudel",
                    "user_href": "/profile/Kopila-Paudel-6"
                },
                {
                    "user_id": "Pramod Dash",
                    "user_href": "/profile/Pramod-Dash-31"
                },
                {
                    "user_id": "Deborah Amoako-Adjei",
                    "user_href": "/profile/Deborah-Amoako-Adjei"
                },
                {
                    "user_id": "Anand Shankar Sahay",
                    "user_href": "/profile/Anand-Shankar-Sahay"
                },
                {
                    "user_id": "Nissim Levy",
                    "user_href": "/profile/Nissim-Levy-2"
                }
            ]
        }
    ]
}