{
    "title": "Why should I choose hydraulics over pneumatics? - Quora",
    "tags": [
        "Hydraulics and Pneumatics",
        "Pneumatics",
        "Hydraulics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mayur Jadhav",
                "href": "/profile/Mayur-Jadhav-45"
            },
            "answer_text": "Probably for the compactness and high power to weigh ratio. But it is not necessary that every time you select system with the the above criteria , depending upon the requirements you should prefer . We are familiar with robotic end effectors (gripper ) ,which actuated by both hydraulic and pneumatically .prior one gives us high power, noise free, compact system still pneumatic grippers dominated over the hydraulics(pneumatic grippers need compressor which makes system a corpulent one), because power and size not everything at all.There are lot of other things to be keep in mind. This is why you should go for hydraulics if it satisfies your requirements. ",
            "date": "Answered January 21, 2017",
            "views": "11",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Suman Kumar",
                    "user_href": "/profile/Suman-Kumar-445"
                },
                {
                    "user_id": "Michael Jow",
                    "user_href": "/profile/Michael-Jow"
                },
                {
                    "user_id": "Prashant Khose",
                    "user_href": "/profile/Prashant-Khose"
                },
                {
                    "user_id": "Anvay Pathak",
                    "user_href": "/profile/Anvay-Pathak"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bruce A McIntyre",
                "href": "/profile/Bruce-A-McIntyre"
            },
            "answer_text": "Air (for a pneumatic system) is much more compressible than a hydraulic fluid system, and so typically the hydraulic system will operate at much higher pressure. Because of this the hydraulic system can be much more precise and can do much harder work. So a pneumatic system is great for moving little shuttles around between offices in a bank, while a hydraulic system may be used in a forklift or elevator. Hydraulic systems are also used a lot in factory automation where positioning is important, while a pneumatic system may be used to knock boxes off of a production conveyor. ",
            "date": "Answered January 18, 2020",
            "views": "574",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cesar Da Silva",
                    "user_href": "/profile/Cesar-Da-Silva"
                },
                {
                    "user_id": "JOhn WAtta",
                    "user_href": "/profile/JOhn-WAtta"
                },
                {
                    "user_id": "Suman Kumar",
                    "user_href": "/profile/Suman-Kumar-445"
                },
                {
                    "user_id": "Michael Jow",
                    "user_href": "/profile/Michael-Jow"
                },
                {
                    "user_id": "Bradford White",
                    "user_href": "/profile/Bradford-White-4"
                },
                {
                    "user_id": "Sohail Ahmed",
                    "user_href": "/profile/Sohail-Ahmed-7"
                }
            ]
        }
    ]
}