{
    "title": "Why does positivity convert to negativity? - Quora",
    "tags": [
        "Positive Psychology",
        "Negativity (personality trait)"
    ],
    "response": [
        {
            "author_info": {
                "name": "M. Cobretti",
                "href": "/profile/M-Cobretti"
            },
            "answer_text": "It does not convert unless you let it. If it converts then you are getting lost in it, you are feeling weak about it. It’s ok. We have all been weak in our lives. Most people born in the previous millenieum are negative all their lives because in those times no one was talking about positivity and it’s power. Now we are seeing changes in the world. New ideas are coming out. People are researching consciousness, metaphysics and positivity. Look at the famous water experiment of positivity by Dr. Masaro Emoto. Positivity actually changed the molecules of water in that experiment. The key to not being dragged along and feel weak by negativity is consciousness. You need to gather and generate more consciousness over what thoughts you chose. Dont give away your power to other people who are negative. They may be older than you, you may think they are wiser than you or they may be your loved ones. But dont get affected by them. Practice meditation , specially mindfulness meditation to raise your power of consciousness. Dont brag and tell negative people about this. They will try to break you down. Keep your power. It is your secret superpower. With enough awareness/consciousnes you will always choose positivilty. It will become a habit, a lifestyle. Good luck! ",
            "date": "Answered September 30, 2020",
            "views": "12",
            "upvotes": " Answer requested by Aman Valecha"
        },
        {
            "author_info": {
                "name": "Harshad K",
                "href": "/profile/Harshad-K-8"
            },
            "answer_text": "Are you the one choosing the negativity over positivity? Is someone else converting positivity to negativity for you? So are you saying someone else is responsible for the negativity in your life - or is it your choices to react to them negatively? Why can't you choose to be positive to that person who is selflessly doing so much for your family - why are you being selfish? (if this paragraph seems out of context then please be specific with your question). ",
            "date": "Answered September 29, 2020",
            "views": "10",
            "upvotes": " View Sharers"
        }
    ]
}