{
    "title": "Why is the reference electrode placed near the working electrode in a three-electrode cell? - Quora",
    "tags": [
        "Electrodes",
        "Electrochemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Erik Johansson",
                "href": "/profile/Erik-Johansson-4"
            },
            "answer_text": "The question is \"Why is the reference electrode placed near the working electrode in a three-electrode cell?\" A typical electrochemical experiment measures current as a function of voltage vs. the reference electrode.  Current is the y-axis, voltage vs. the reference electrode is the x-axis.  Together these data form the points in a typical cyclic voltammogram.      However, whenever there is a current flowing the solution offers a resistance to said current flow.  Just like a copper wire offers a resistance to the flow of electrons, an electrolyte offers a resistance to the flow of ions.  Thus, the voltage drop measured between the working and reference electrode contains a contribution from the voltage drop owing to the solution resistance.   This is a complicating factor in most experiments, not a desired outcome. To minimize the contribution of uncompensated solution resistance, reference and working electrodes are placed as close as possible (without obstructing mass flow to/from the working electrode, etc.,).  The effect of this is understood using the Cu wire analogy.  For some current, the voltage drop across a piece of Cu wire is dependent on the length of Cu wire you are measuring across.  The closer together you bring the probe together, the smaller the measured voltage drop.  It's the same for the electrolyte. ",
            "date": "Answered March 19, 2016",
            "views": "37",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thomas Holm",
                    "user_href": "/profile/Thomas-Holm-16"
                },
                {
                    "user_id": "Sorina Gogoneata",
                    "user_href": "/profile/Sorina-Gogoneata"
                },
                {
                    "user_id": "Vinay",
                    "user_href": "/profile/Vinay-330"
                },
                {
                    "user_id": "John Peterson",
                    "user_href": "/profile/John-Peterson-195"
                },
                {
                    "user_id": "Mainul Akhtar",
                    "user_href": "/profile/Mainul-Akhtar-2"
                },
                {
                    "user_id": "Venkatesh Subramanian",
                    "user_href": "/profile/Venkatesh-Subramanian-23"
                }
            ]
        }
    ]
}