{
    "title": "Will science and religion ever work together? - Quora",
    "tags": [
        "Science and Religion",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Noam Kaiser",
                "href": "/profile/Noam-Kaiser"
            },
            "answer_text": "In separate compartments? Yes.But when you try and mix - No. Let's begin with Father George Coyne, former director of the Vatican Observatory explaining why scriptures have NO science in them to get that load out of the way    Now, as this is a reincarnation of a question asked a million times here,I'll take the liberty to recycle a former answer In explaining why these two don't mix: Science must adhere to the nonreligious principles of re-examination, testing, demand for evidence and replication of a single outcome. (2,500 different religions, 3,700 different gods, a fierce correlation between place of birth and prominent religion... that's definitely not single) Just look at the judeo Christian scriptures:Talking snake, talking donkeys, man walks on water, man resurrects, a sea that parts, earth as center of universe with sun circling it, a cosmos created in 6 days...It's an endless list of folly.Sorry it just is. In a nut shell:Scientific method is NOT compatible with religious faith as it must reject the concept of belief, of faith, in order to avoid bias.It should serve no purpose but knowledge.Science is objective, science is open to challenge and change, science has no dogma. You don't use the word \"believe\" with regards to scientific results.if you \"believe\" in science, you are doing it wrong.Scientific research, and conclusions, are to be learned and understood --Not believed. Scientific method begins with observation, not conclusion.If you use \"god\" as part of an assertion, that is - just as an example - already reaching a conclusion before researching. So - No.There is also no way to compare or reconcile between science and religion, when engaging in science, as the former is methodological and requires testing, examination, peer review, repeating results;and the latter is...well... wishful thinking, faith.The 2 do not mix, and have nothing to do with each other. Important note: Regardless of scientists, most religious people I know have no issues with science as they regard religion as a source for comfort, inspiration, reason, spirituality, and separate it from scientific matters.That's hardly unreasonable, I don't relate to it, but it is a moderate and reasonable approach. The most not politically correct but very correct answer I heard regarding this is by Dr. Neil DeGrasse Tyson, in an interview with Bill Moyers, here an excerpt :  You can find the whole thing easily (http://billmoyers.com/episode/full-show-neil-degrasse-tyson-on-science-religion-and-the-universe/) and I warmly recommend the view. ",
            "date": "Updated April 29, 2015",
            "views": "12",
            "upvotes": " View 34 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bessie Hart",
                    "user_href": "/profile/Bessie-Hart"
                },
                {
                    "user_id": "Zagros Madjd-Sadjadi",
                    "user_href": "/profile/Zagros-Madjd-Sadjadi"
                },
                {
                    "user_id": "Cherish Rybak",
                    "user_href": "/profile/Cherish-Rybak"
                },
                {
                    "user_id": "Seamus Waibel",
                    "user_href": "/profile/Seamus-Waibel"
                },
                {
                    "user_id": "Luka Treska",
                    "user_href": "/profile/Luka-Treska-1"
                },
                {
                    "user_id": "Xukai Liu",
                    "user_href": "/profile/Xukai-Liu"
                },
                {
                    "user_id": "Cathi Mercer",
                    "user_href": "/profile/Cathi-Mercer"
                },
                {
                    "user_id": "Jack Elphinstone",
                    "user_href": "/profile/Jack-Elphinstone"
                },
                {
                    "user_id": "Arjun S Nath",
                    "user_href": "/profile/Arjun-S-Nath"
                },
                {
                    "user_id": "Simon Ward",
                    "user_href": "/profile/Simon-Ward-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Payam Adlparvar",
                "href": "/profile/Payam-Adlparvar"
            },
            "answer_text": "If by religion you mean those leaders and followers of religion that expect a deceased Prophet to literally return on a cloud, or a those that expect an ancient Prophet to literally climb out of a well after hiding in it for several hundred years, or are adamant that the world and its creatures came into being literally as explained in their scripture, or other such scientifically challenged interpretation and understanding of their scripture, then the answer is most likely, 'NO'. If by science you mean the scientists that proclaim there is no God because their calculations or experiments do not show a need for such a being, or because in their experience they see no such influence or affect, then again, the answer is most likely, 'NO'. If however you mean the leaders and followers of religions that try to understand their scripture in the light of logic and reason and try to find a possible meaning that does not defy the basic scientific understanding we have developed, or scientists that feel everything around us is much more organized, with clear patterns in all of nature and the universe that are tell tale signs of the handiwork of a higher intelligence, then the answer is most likely, 'YES'. Science and Religion, will and actually must work together. One is the best of human logic and reason, the other is Divine Guidance. The arrogant cannot see the Guidance, and the blind cannot see the reason. This will change, as religious fanaticism becomes more and more obvious, showing that is has nothing to do with any religion, but is the mindset of mentally deficient individuals who have thrown logic and reason away, and on the other hand, as arrogant scientists show themselves as those have confused their own opinions as facts.  There are many, (thankfully a majority) that realize and recognize that Divine Guidance is necessary for human development and achievement, and also that with our ability to reason, using logical deductions (the scientific method), we can discover the truth of our universe and we have already made an excellent start. Religion can steer us in the right direction and science can help us better understand why that direction is right. Without this needed balance we will destroy ourselves either by the insanity of the fanatics or the mistakes of the arrogant. With the needed balance this world can become a veritable paradise. ",
            "date": "Answered April 2, 2015",
            "views": "13",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Roland Rollerdore Jr.",
                    "user_href": "/profile/Roland-Rollerdore-Jr"
                },
                {
                    "user_id": "Elijah Lees",
                    "user_href": "/profile/Elijah-Lees"
                },
                {
                    "user_id": "Yashaswee Patra",
                    "user_href": "/profile/Yashaswee-Patra"
                }
            ]
        }
    ]
}