{
    "title": "Will we ever be able to break the laws of physics? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Nigel West",
                "href": "/profile/Nigel-West-4"
            },
            "answer_text": "You may have a misunderstanding about the laws of physics, or any other scientific principle for that matter. Science is a process where you observe what happens, create a theory about why it happens, and then conduct experiments to determine if your theory is correct. If you find even one instances where the observations do not support your theory, then you need to revise the theory. Over time, these theories become accepted as facts, as every experiments that people conduct supports the theory. They are often then referred to as laws. Newtons laws of physics are an example of this. As our knowledge increased, it was realised that there were instances were Newtons laws did not accurately predict the observations. Einstein created some new theories that work for all instances, which might suggest that Newtons laws were no longer valid. However to apply Einstein’s laws can be very complex, and for most of us in our daily lives, Newtons laws work perfectly well. So we all use a law that is technically not correct, but close enough for all practical purposes. So to answer your direct question, yes it is possible to break the laws of physics, but not in the way you probably intended with your question. If you can do an experiment that does not fit the laws of physics as we know them, then a new theory or laws has to be created to explain what you observed. So lets look at this in the way that I suspect you intended. A common equation of motion is F=MA, or force equals mass time acceleration. For a given mass, if you apply a given force, you can readily calculate the rate of acceleration. There is no way to change this. It will always happen in this way in the world we live in. If you can find a way to accelerate twice as fast as this equation suggest, you will probably become a millionaire over night. The most common laws that people try to break are the laws of thermodynamics. These are a little harder to understand for non technical people, so they are often used in scams or for fraudulent purposes. A common one is the perpetual motion machine. Another very common one is using water to power an IC engine, or using the alternator to generate hydrogen to run the engine on and increase fuel economy. All of these are counter to the laws of thermodynamics and simply cannot be done. There is always a trick or some sort of scam when people say they have done this. Unfortunately non technical people are taken in all the time and often lose a lot of money before they work out they have been scammed. ",
            "date": "Answered February 28, 2019",
            "views": "252",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Phillip Courtney",
                "href": "/profile/Phillip-Courtney-4"
            },
            "answer_text": "Is breaking the laws of physics possible? Yes - which causes the law to be reevaluated … Let’s be completely clear what the words mean - this is the physics section! The word for a guess or idea or notion is ‘conjecture’ A well informed opinion is an hypothesis A theory is, in science, an idea that is consistent with all observations, that can be tested and falsified, and makes valuable predictions about the universe. In science ‘Just a theory’ is an oxymoron. In ordinary speech the word theory means guess or conjecture. A law of physics is a summary of observations so numerous that it would take extraordinary evidence to accept that it was wrong. And to date, that has very rarely happened. For example one law is that an imaginary line drawn from all planets to the sun will sweep out equal areas in equal time. A law of nature might be that crows are black. But if there was a report of a grey crow? Well, if the grey crow can be produced, that would be compelling evidence that some crows may not be black. But an unrepeatable observation would have limited impact. As a physicist, I never attempt to prove anything and I never claim to have proof. I use that word exclusively for deductive reasoning – that is, maths. Physics cardinates on observations and evidence. Evidence can range from non existent, weak, equivocal, consistent with, good, strong or compelling. Compelling evidence corresponds to the legal ‘satisfied beyond all reasonable doubt’ So when asked about proof from non physicists I answer .. ‘the evidence is’ … So breaking the laws of physics is to make a strong observation that is contrary to numerous previous observations. I recall a couple of times when my results were discordant. Once I hadn’t done the experiment with sufficient care, and the second I’d got my maths wrong. I’d recall the N ray - Wikipedia fiasco is an example of a set of observations that were set aside. ",
            "date": "Answered August 28, 2019",
            "views": "654",
            "upvotes": "0"
        }
    ]
}