{
    "title": "Will Donald Trump apologists ever realise that he is using the COVID-19 crisis for entirely personal and partisan purposes rather than pursuing what is best for America and Americans? - Quora",
    "tags": [
        "Arguments and Argumentation",
        "The Economy of the United States of America",
        "American Ethnicity and People",
        "COVID-19 (2019-2020)",
        "Donald Trump (politician, business person)",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Morris",
                "href": "/profile/John-Morris-691"
            },
            "answer_text": "Your question is not a question, it is a proclamation which presumes as a necessary component, it's conclusion. You might have asked *why* they fail to realise that <fact>. Or what the evidence is, in view of his actual conduct and its rather overt conflict of interest between his social duty as president and his personal interests, that he is acting in the public intetest rather than enriching himself and and merely feeding his megalomaniacal, nefelibatal sociopathy. Just a thought… BTW, while you're thinking about that, you might also contemplate why you beat your wife. What? You don't beat your wife? Well, when did you stop beating your wife? See the problem? Will they ever? Sure. When they realize he's the angry orange self-interested dictator of a rapidly degenerating banana-republic-to-be where the rule of law has been cast aside. Right now they still perceive him as the wrathful avenger banishing their enemies rather than a predatory, compulsively lying con-artist who.has realized thst he can paralyze honest folk and even entire institutions by spewing out a veritable flood of falsehoods whose objective is to divert focus from his actions to the baseless accusations he has made about others. His favorite tactic is to accuse others of what they have accused him of. Have you noticed? The difference, of course, is that his accusations are always baseless and utterly fabricated. ",
            "date": "Updated July 14, 2020",
            "views": "58",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rhys Gethin",
                    "user_href": "/profile/Rhys-Gethin-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jill Barker",
                "href": "/profile/Jill-Barker-14"
            },
            "answer_text": "I doubt it, but pigs might fly. Do you remember those people who think the world is coming to an end on a specific date? When it doesn't they just shift their belief to a different date. People with strong beliefs can blank an awful lot of contrary evidence. ",
            "date": "Answered May 19, 2020",
            "views": "45",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Patrick Khaw",
                    "user_href": "/profile/Patrick-Khaw"
                }
            ]
        }
    ]
}