{
    "title": "Will an object with a density of 1.05g ml sink or float in water? - Quora",
    "tags": [
        "Floating",
        "Density (physics)",
        "Physics of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Wessel",
                "href": "/profile/Robert-Wessel"
            },
            "answer_text": "In pure liquid water, at reasonable temperatures and pressures, and ignoring things like surface tension and relative sizes, the 1.05g/ml object would sink. OTOH, it would handily float in the Dead Sea, where the water density is a somewhat astonishing 1.24g/ml. Water is, contrary to popular belief, slightly compressible. At a pressure of somewhere around 120MPa (about what you’d see at a depth of 12km), water will compress 5%, go to a higher pressure than that, and assuming your object *doesn’t* compress, it’ll float. Incidentally, the deepest spot in the ocean, Challenger Deep, is about 10.9km. The Trieste, which visited Challenger Deep, used a float filled with gasoline (petrol) to provide buoyancy, because gasoline starts as less dense than water (it floats), and is actually slight less compressible than water. As everything compressed due to the ~110MPa of pressure, the float actually compressed (a bit) less than the water it was displacing, thus maintaining buoyancy. ",
            "date": "Answered September 18, 2017",
            "views": "18",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "U. Esther Joshua",
                    "user_href": "/profile/U-Esther-Joshua"
                },
                {
                    "user_id": "Dunc Murf",
                    "user_href": "/profile/Dunc-Murf"
                },
                {
                    "user_id": "David Wilmshurst",
                    "user_href": "/profile/David-Wilmshurst"
                },
                {
                    "user_id": "Muhammad EL-Nashash'ee",
                    "user_href": "/profile/Muhammad-EL-Nashashee"
                },
                {
                    "user_id": "Piotr Szafranski",
                    "user_href": "/profile/Piotr-Szafranski"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Wilmshurst",
                "href": "/profile/David-Wilmshurst"
            },
            "answer_text": "Will an object with a density of 1.05g ml sink or float in water? Depends on the temperature and pressure. If the water is steam, the object will neither sink nor float (at reasonable temperatures and pressures). If the water is a wet liquid, and is reasonably pure, the item will sink (at reasonable temperatures and pressures). If the water is ice, the object will neither sink nor float (at reasonable temperatures and pressures). I’ll leave you to research what other phases would do. Got to earn your marks for your homework somehow. ",
            "date": "Answered September 22, 2017",
            "views": "780",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Felix Chen",
                    "user_href": "/profile/Felix-Chen-6"
                }
            ]
        }
    ]
}