{
    "title": "Would it be possible to decrease the space between an atom's atomic nuclei and the electrons around it? If so, how? If not, why? - Quora",
    "tags": [
        "Electrons",
        "Atoms"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rick McGeer",
                "href": "/profile/Rick-McGeer-1"
            },
            "answer_text": "No and yes…in order. The electron orbitals around an atom are determined by the electron’s energy, angular momentum, and angular momentum vector. Without going into the complexities of the Pauling model of the atom (see Atomic orbital for details), only certain values of angular momentum are possible: integer multiples of [math]h/2\\pi[/math]. Moreover, because of the Pauli exclusion principle, two electrons can’t occupy the same quantum state. What all this amounts to is that there are a set of orbitals or shells about the atom, with an angular momentum of each positive integer multiple of [math]h/2\\pi[/math]; since the electron has a fixed mass, angular momentum tracks distance, and so there is a minimum distance. So that’s the “no” part. The “yes” part is that angular momentum is a linear function of mass. The electron has two much more massive cousins, the Muon and the Tau. The electron has a mass of 0.5 MeV; the muon is an electron with a mass of 105 MeV; the tau has a mass of 1777 MeV. So for the same angular momentum, the muon is 207 times closer to the nucleus than the electron; the tau is 3550 times closer to the nucleus than the electron. This property has been used to demonstrate thermonuclear fusion at room temperatures: Muon-catalyzed fusion. The central effect is that nuclei are 207 times closer to each other when orbited by muons rather than electrons, and thus the probability of fusion is greatly increased (I should hasten to add that a number of practical problems have to date prevented this from being a practical energy source). ",
            "date": "Answered October 29, 2016",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Dynamic-Reflex"
                },
                {
                    "user_id": "Shahid Ali Leghari",
                    "user_href": "/profile/Shahid-Ali-Leghari"
                }
            ]
        },
        {
            "author_info": {
                "name": "Johan Falk",
                "href": "/profile/Johan-Falk-4"
            },
            "answer_text": "If you wanted to shrink the orbitals (describing the electrons’ probability distribution), you’d have to change the electric potential (which determines the orbitals). This is basically what you got if you compare a hydrogen atom with a helium ion with only one electron – you got twice the electric charge in the nucleus, so it will bind the electrons more closely and create identical but smaller orbitals. Same goes for any other nucleus, as long as you only have one electron. So, yeah, you could possible have smaller orbitals, but you wouldn’t be inventing a new kind of matter. You’d only found a way to add protons and neutrons to a nucleus, and a (probably very expensive) way of changing one element to another. Another approach is the one suggested by Takayuki, replacing electrons with another particle (with same charge but larger mass). If you don’t insist on it being electrons. ",
            "date": "Answered October 24, 2016",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Magenta Fuchsia",
                    "user_href": "/profile/Magenta-Fuchsia"
                }
            ]
        }
    ]
}