{
    "title": "'Something is better than nothing.' How far is this saying justified in our lives and careers? - Quora",
    "tags": [
        "Holistic Career Advice",
        "Life and Living",
        "Jobs and Careers",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ritika Jain",
                "href": "/profile/Ritika-Jain-9"
            },
            "answer_text": "Thank you for A2A  Essentially you should have passion and fire within you for the dream you want to acheive regardless of the fact that how long it could take to acheive that. And it shouldn't be forced thing like you don't wish to do job but still you had to do it. If you continue doing it then it will become a burden and one day your shoulders may droop downwards with the load of unworthy burden. Although this line suits here also \"something is better than nothing\" but if your interest is added to this then meaning perhaps changes. If you find that you lose interest in that dream then you should deviate from that path and explore something that suits your interest. Losing interest can be because of varied reasons because dreams are something that are perfectly yours and droping the idea to chase your dream can also be due to obstacles you are facing in acheiving it. So it totally depends on you which way to go !  For me, I daily practice this quote\"Something is better than nothing\". The time period in which I study I feel satisfied and I always think that its better to know something about the subject or topic because our field is so vast that you need to keep learning throughout your life . So for me that \"something\" is very crucial because at the end of the month when I add these daily \"somethings\" it yields a huge profit. ",
            "date": "Answered August 23, 2014",
            "views": "2",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ashish Bhat",
                    "user_href": "/profile/Ashish-Bhat"
                },
                {
                    "user_id": "Sukhomoy Bhattacharjee (সুখময় ভট্টাচার্য)",
                    "user_href": "/profile/Sukhomoy-Bhattacharjee-সুখময়-ভট্টাচার্য"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Barnard",
                "href": "/profile/Michael-Barnard-14"
            },
            "answer_text": "Food is more important than passion. Shelter is more important than fulfilment. Knowing that food and shelter will still be available tomorrow is more important than realizing your dreams. Maslow's Hierarchy of Needs is imperfect and was intended as guidance, not an absolute, but it's still good to consider in these kind of conversations.  His observation was that Esteem and Self-actualization, the categories into which 'chasing your dream' falls, are only possible if you've satisfied the lower parts of the pyramid. And he's right.  There are an awful lot more people chasing their dreams now than even a few decades ago because there are so many more well-off people around. As for chasing one dream, it's much better to understand the four or five major things that motivate you and look for opportunities that satisfy more of them while simultaneously improving your fiscal situation. This isn't perfection, but moving toward better compromises. Reality, not fantasy. ",
            "date": "Answered August 23, 2014",
            "views": "22",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Joaquín Benjamín",
                    "user_href": "/profile/Joaquín-Benjamín"
                },
                {
                    "user_id": "Apoorva",
                    "user_href": "/profile/Apoorva-205"
                },
                {
                    "user_id": "Skanda T Shankarananda",
                    "user_href": "/profile/Skanda-T-Shankarananda"
                },
                {
                    "user_id": "Frank Tsaur",
                    "user_href": "/profile/Frank-Tsaur"
                },
                {
                    "user_id": "Sukhomoy Bhattacharjee (সুখময় ভট্টাচার্য)",
                    "user_href": "/profile/Sukhomoy-Bhattacharjee-সুখময়-ভট্টাচার্য"
                }
            ]
        }
    ]
}