{
    "title": "'Soul' and 'self' are almost exact synonyms, but 'selfless' and 'soulless' are close to antonyms. Are there any explanations? - Quora",
    "tags": [
        "Antonyms",
        "Soul (metaphysical entity)",
        "Synonyms",
        "Vocabulary of the English Language"
    ],
    "response": [
        {
            "author_info": {
                "name": "Barry McGuinness",
                "href": "/profile/Barry-McGuinness-1"
            },
            "answer_text": "Actually, self and soul are not completely synonymous. To be self-aware means putting one’s attention on oneself as an object of awareness, i.e. as an individual person with an identity. But the “soul” is generally understood to be the subject of awareness, the witness, consciousness itself. In other words, “self” generally denotes one’s own perception of oneself as an individual (myself as reflectively observed, perceived or experienced), while “soul” is synonymous with subjectivity (I the observer, the perceiver, the experiencer). By extension, the notion of soul is also related to our sensitive, feeling and empathic capacities. There is a related concept, which is the ego. This is slightly confusing because “ego” literally means “I” but the word has come to mean “my self” as a mental image combined with near-constant mental activity stemming from that image. Because we identify with our own self-image from an early age (we think it's who we are, and not just a mental image of who we are), our natural drives and emotions tend to become entangled with building up and protecting a false image of ourselves. Many people spend much of their lives advancing their own ego rather than expressing who they really are. We refer to such behaviour as egocentric or self-centred. When people learn to overcome this identification with ego, they tend to act more authentically and altruistically. We refer to such behaviour as selfless, meaning “not ego-driven”. When we describe someone as soulless, in contrast, we mean that they appear to be acting without subjective sensitivity, feeling or empathy. ",
            "date": "Answered September 23, 2019",
            "views": "358",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tim Moss",
                    "user_href": "/profile/Tim-Moss-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bruce R. Bain",
                "href": "/profile/Bruce-R-Bain"
            },
            "answer_text": "There is an explanation. Selfless usually has the connotation of a person being unselfish in their thinking and feeling. It is not a denial of self, but it references self-abnegation. It is a denial of “selfishness” or “self-centeredness” or “egocentrism”. Selfless is also referred to as being synonymous with altruism or self-abnegation. ",
            "date": "Answered September 23, 2019",
            "views": "90",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Barry McGuinness",
                    "user_href": "/profile/Barry-McGuinness-1"
                }
            ]
        }
    ]
}