{
    "title": "'The world has enough for everyone's need, but not enough for everyone's greed'; are there any counter-arguments to the previous statement? - Quora",
    "tags": [
        "Greed"
    ],
    "response": [
        {
            "author_info": {
                "name": "Odin Sprouse",
                "href": "/profile/Odin-Sprouse"
            },
            "answer_text": "No not really. The big thing people don't seem to realize it over population of our species. The world does not have enough for every body. So some research on this. Have you ever paid any attention to how destructive this modernization of the world is being to the planet. I live in boiling springs SC there's was nothing here just a few people and farm land was the biggest part of it but because towns around us started getting these big ass factories that made people mostly northerners move down here there's nothing in boiling springs the infrastructure for all of these people. People are parasites they will move to a place after they made where they used to live unliveable the move some where else just to do the same some where else Did you know in 1900 there was one billion people on the planet now there's seven billion and it seems like we waste so much of our resources and not to mention every year some kind of bug or disease that's killing produce. The earth has enough what bull shit. I've said this before until a few years ago I wanted to have a family you know kids but I think me having childern would be the most enhuman, selfish thing I can do tbis world is going to be so messed up in a few years I don't want to bring somebody in to it. It might make my life pointless now because they've built all these schools land and property taxes are going up hell it's going to be hard for me to suport my self see the land I live on has been in my family for three generations. I was going to pass it down to my kids. I hope I can see the end of this stupid ass shit ",
            "date": "Answered December 1, 2018",
            "views": "963",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Juan Cilliers",
                    "user_href": "/profile/Juan-Cilliers-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Yoder",
                "href": "/profile/Brian-Yoder"
            },
            "answer_text": "I don’t think you actually made an argument, but it is an idea associated with a not uncommon idea. It’s not a new one, but it is one with a long and bloody history. The idea you are expressing is that it would perhaps be better to steal the things that you want than to go to the effort of creating the things that you want or trading things with others voluntarily. This is a very old idea and one dear to the hearts of every prehistoric bandit and every modern day burglar and totalitarian. There are some pretty obvious problems behind it. One is that you are ignoring the negative consequences of stealing other people’s stuff (or asking the police to do it for you which is pretty much the same thing). Such a way of life is bad for you directly because it makes you a dependent. You produce nothing but you steal from others and you are therefore helpless if the people you are robbing were to run away or stop producing. Can you claim that this is what the good life looks like? Even if you could just do it yourself (and not make it a universal thing) you might not be stealing enough to chase off or destroy your hosts, your parasitic lifestyle robs you of the ability and experience of living a first-handed existence. Even if we could somehow eliminate the issue of violence and theft, would you want to live your life like a zoo animal or a prisoner, cared for by others as opposed to living a free life of self-supporting and self-chosen goals? I wouldn’t want to live that way even if I didn’t have to be a thug or hire thugs to make it happen for me. Second, in practical terms if you had a whole civilization working like this it would fail (as every socialist society has failed, and generally spectacularly too, with all kinds of blood, madness, and poverty as we can see before our eyes today in places like Venezuela and North Korea). When you make it legal to steal from people who produce more than the norm the will either flee or stop producing. Why wouldn’t they? It takes a lot of risk and work, skill, and dedication to make a lot of money or to build a great company. If someone is just going to come along and steal the results of all of that from you why in the world would you keep on risking and working hard? It makes no sense. Beyond causing productive people to flee or stop being productive, taking away the money and cause of money also means the end of investment in anything new or bigger. So no new land is going to be cleared. No new mines will be dug. No new factories will be built. No new products will be invented. You see this everywhere where the government just scoops up all the money. Now you might just say “No problem, the government can just make the investments itself.” but that never works for several reasons. One is that the government is horribly inefficient, and most new projects end up in failure, so your best bet is to make it cheap to try and fail and weed out the failures early so that the few strong businesses can break through and thrive. Government “investments” never work that way. For one thing, the money at risk is not their own and government people never spend taxpayer money with the care they would take with their own. For another, people in government are generally idiots. They generally know nothing about engineering, science, business, or finance. If they did they would have jobs doing those things instead of getting a job passing out stolen money for a living. Entrepreneurs by contrast are smart, scrappy, passionate about whatever their business idea might be, and they generally spend many years studying whatever it is that they are doing whether it is making a better cow milking machine, figuring out a better way to make ham, creating a new kind of steel, or designing a new piece of software. Government guys know little or nothing about any of that. Government officials are also inclined to hand out the money in such a way as to buy them benefits of one sort or another rather than to make money (which they don’t get to keep), so they have no incentive to do a good job. Lastly, when the government invests in some enterprise it has no way of knowing whether it is a good deal or not. Should it invest even more? Should it seek to block out other competitors from getting more government money or should they double down on their past investment in boondoggle companies? Yeah, they do all of that. Government entities rarely care allowed to evaporate when there’s something better out there. They ask for and get even more money. They are like zombies out there, feeding off the living. Lastly, there’s the impact of this kind of thing on the people in government themselves. It makes them corrupt. People who work for a living have to make their customers happy with their work or else they will eventually stop getting paid. Government people get paid no matter what, short of revolutions and such. The way for a government person to get ahead is not to make more happy customers, it is to pander to politically powerful people regardless of what they want. This means that any big powerful government agency is likely to end up being run by the most powerful and manipulative people around and not by the people who actually do anything that the customers want. Or maybe put another way, the “customers” ARE the politically powerful people in government nd what they gain in their profligate spending of other people’s money is more power for themselves and their “customers”. The general public that has to eat that food, wear those clothes, and drive those cars are all but forgotten because their choices and opinions literally don’t matter. I should point out that just putting the government in charge of something doesn’t somehow magically make greed vanish. If anything it makes greed even worse, and puts the greediest and least worthy people in charge of everything. Who is more greedy, me when I make a dollar and spend it on something I want, or is it you who steals that dollar than I made so you can spend it on something you want? I’d say it’s you hands down. It’s even more greedy when someone steals trillions of dollars from all of the people who earned it so he can spend it all on things he wants. And when people for whatever crazy reason don’t like that, greedy socialists strike back with fines, jails, gas chambers, and bullets to the back of the head in an attempt to greedily hold onto power. You see nothing like that level of greed anywhere in any even mixed economy, let alone rather more capitalist ones. What you are calling for here is the greediest thing that anybody has ever called for…robbing other people as a means of making a living, and doing it “legally” on a nation-wide or even world-wide scale. ",
            "date": "Updated September 27, 2020",
            "views": "997",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Steve Dougherty",
                    "user_href": "/profile/Steve-Dougherty"
                }
            ]
        }
    ]
}