{
    "title": "'We suffer because we desire'. But what is life without a desire? - Quora",
    "tags": [
        "Desires",
        "Psychology of Everyday Life",
        "Philosophy of Everyday Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Renee Wenker",
                "href": "/profile/Renee-Wenker"
            },
            "answer_text": "You are absolutely correct, and maybe you aren’t aware yet of the spiritual Truth of your statement, “We suffer because we desire.” WE, in physical human form, are seeking the desires of the EGO/ID. Most of the world’s population is trapped and suffering because they don’t understand why desiring something should result in suffering. It shouldn’t and it doesn’t, if you just rephrase the statement and the following question, “But what is life without a desire? Life is the brief period(s) experienced in a physical form (human being), created by “The First Cause” (God), for the singular purpose of learning the way back to our True Form and purity before The Great Fall from Grace and Harmony with our Creator. The Earth is the “physical school”, configured with The Divine Omniscience’s “governing laws of physics.” The Laws of Newtonian Physics is actually quite outdated, and will always be a mere guidebook for what WILL manifest as consequence of each soul’s thoughts (desires; what is the Mind focused on), and actions, as well as the intention, attitude, and our level of perceptual awareness. This is where your statement that we suffer only because we desire needs to be defined with specific conditions, for as I said, it is a higher Truth that humans have no concept of. Let me get to the point before I end up writing a Tome. Desires are NOT the cause of suffering; it all depends on what is desired and why, for what purpose and for who’s benefit? Humans are a long way from breaking past this very shallow and self-serving animalistic obsession with FEELING pleasure, be it in mental form, the body’s sensory experience, or even just as a desire to NOT suffer. Enlightenment and Spiritual Awakening is the true desire of the Soul, to free themselves from the ego’s incessant, unrelenting need to have power (aka, to survive). And yet we are all still ignorant of the fact that what we consider as our identity is the ego, forgetting that we are spiritual beings without physical properties or form. We are the Soul who chose the body that we gifted with THE LIFE FORCE that animates the physical development of human life, for OUR Soul’s benefit. We suffer because we are fighting for the desires of the fleshy house (the mortal body) who serves its primary Master - the Id. Jesus Christ taught us the right way to live, think and how to choose what we value. For guess what? God, The First Cause, who created the heavens and the Universe and every single life-form in the Material Sphere as well as every soul. Why did He create souls? Because even God desires, and the one and only thing He desired was companionship. One could deduce from this concept (to me, it is Fact)…that if we desired only harmonious companionships, with others who have purity, and being without Sin, how HEAVENLY can any other desire be? In closing, I must state that my beliefs, opinions, are VERY unique, as should every Soul represent their unique beliefs and values, and my posted words that I shared with you are in no way meant to persuade you to believe what I do. As always, my public commentaries are shared in the hopes that might help someone struggling in the dark to see the light, and reveal the Truths that result in each entity’s Knowing Thyself. ",
            "date": "Answered May 3, 2020",
            "views": "485",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Happy Mkhondwana",
                    "user_href": "/profile/Happy-Mkhondwana"
                },
                {
                    "user_id": "Lee Abrahams",
                    "user_href": "/profile/Lee-Abrahams-1"
                },
                {
                    "user_id": "Rebecca Carpenter",
                    "user_href": "/profile/Rebecca-Carpenter-64"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shalva Quthelia",
                "href": "/profile/Shalva-Quthelia-1"
            },
            "answer_text": "Ok, I’ll try my best to explain, but this is one of those situations where there is no simple answer. In short: all suffering comes from the original sin and it’s not about whether to desire or not, it’s about how to properly. The very instant we chose to separate ourselves from perfection we created doubt. If up until that point we were careless and lived not unlike the way a river flows, in an attempt to be like god, we took upon ourselves more than we could chew. We created suffering and realized that by recognizing we couldn’t do better than what already was, hence no matter what we do we suffer. We suffer because we weren’t supposed to suffer from desire. Even now, all our needs are covered, you personally aren’t hungry and dying, right? You are taken care of even when you think there’s no one out there, you just don’t see it. You are always given as many chances as you need. It’s not so hard to understand that you are not as smart as nature, is it? How can then you expect to be perfect like it? Do you realize that every action has a consequence and that you most likely don’t know what it will be? All that’s expected of you is that you experience life and learn from your mistakes… or you can keep making them, your choice. Look, as with everything, it is a matter of attitude: to not suffer is to trust that everything happens the way it should. But there’s a catch… you are not the only person in the world so even though you might be a saint and do no harm whatsoever there is no knowing what others may do, they might not like what you want and that is why you have to learn how to stand your ground, but be mild about it. My point is this - there is an intrinsic disbalance in this life we chose so now we have to learn to live it. How? We have to work with what we got by taking the Middle Path. Live in moderation, to desire, but not too much. Desire to experience, not possess. Eventually, you will realize that you no longer desire anything because everything is already as it should be and that you have returned to the careless, divine state of being hopefully having had learnt the lesson and acquired some experience too. But until then, do desire, act upon your desires, each over a long period of time because that is the whole point, just be careful.  You suffer because you desire too much ",
            "date": "Updated October 18, 2020",
            "views": "540",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Happy Mkhondwana",
                    "user_href": "/profile/Happy-Mkhondwana"
                },
                {
                    "user_id": "Anand Bhagwat",
                    "user_href": "/profile/Anand-Bhagwat"
                },
                {
                    "user_id": "Mandy Wessen",
                    "user_href": "/profile/Mandy-Wessen"
                }
            ]
        }
    ]
}