{
    "title": "According to Aristotle, what is the highest good? - Quora",
    "tags": [
        "Aristotle"
    ],
    "response": [
        {
            "author_info": {
                "name": "Suraj Rajesh Tiwari",
                "href": "/profile/Suraj-Rajesh-Tiwari"
            },
            "answer_text": "Aristotle and the Highest Good In book one of Aristotle’s Nicomachean Ethics, he claims every action is aimed at some good yet these aims vary between individual and context. For example, the end of the medical art is health, of shipbuilding the vessel, of strategy the victory and so on. Furthermore, as seen above, the concept of good can vary; the good in health is sustenance, in the vessel travel, and in victory honor. Yet, Aristotle is not looking for an in-exhaustive list of what the good could be, instead he is looking for the highest good out of all these goods.  Raphael, “The School of Athens” (1511) This highest good must also fit into three criteria: it is desirable for itself, it is not desirable for the sake of some other good, and all other goods are desirable for its sake. Furthermore, Aristotle later includes that the highest good must be acted upon because if one does not act to achieve any aim then they will never achieve it. In other words, the highest good is a solitary nucleus, which all other goods are acted upon for; for Aristotle this highest good is happiness or eudaimonia (which translates to living well). He argues this by going through the list of what many may consider the highest good of actions; for example pursuing wealth, honor, or wisdom. Yet, these do not fit the criteria he is trying to fill. Instead, he examines all these aims and realizes happiness is the highest good because it is what living well consists in and the latter aims are sought because they promote living well, not because they are what living well consists in.  Van Gogh, “Flower Beds in Holland” (1883) Now Aristotle turns his view to how one achieves happiness, which he claims to be the function of man.Thus, Aristotle finds it crucial that he separates man from all else. He does so by claiming humans share biological and physiological processes with animals or plants, such as motion and perception, but humans differ in their ability to think rationally. Therefore, Aristotle deduces what sets humans apart from other living entities, giving us the potential to live a better life, is our ability to be rational and apply reason in action and context. Therefore, using reason in ones life is what happiness consists in. Yet, anything done well requires virtue or excellence; living well consists in activities caused by rational guidance in accordance with virtue or excellence . That being said, it follows that the highest good, which is happiness, is pursued throughout life in which one utilizes rational guidance in accordance with virtue or excellence. Happiness can only be achieved through action and such a feat is not merely gifted to humans but learnt throughout life; the highest good is a growing process. What Aristotle claims to be the highest good is questionable, but his conception and deduction of the highest good is not only plausible but also realistic. To be more specific, his belief that only action can allow one to achieve this goal and it is a goal achieved through a growing process speaks to the nature of the human condition. For example, if one wants to get a good grade on a test the two major components to achieving such a goal are action and learning. Action in that one actually completes and writes the test and learning in that one does the necessary readings and processes to complete the test with a certain degree of excellence. Furthermore, this belief in action and progress in the attainment of the highest good is a true recognition of human nature. Of course we have been gifted with the power of reason above all other animals but such a power is not polished without constant repetitive use; the utilization of reason in ones life is a progress only achieved through action. For example, Marcus Tullius Cicero believed that justice was a natural component of the human being, void of any action or progression; justice was Cicero’s conception of the highest good. Yet, such a claim disregards the nature of a human being. For example, how can a baby be born with justice when it has neither the understanding of such a concept or the ability to act upon it? A human baby is no different than an animal in that’s its primary functions are survival until they have grown and learned from the environment around them. Thus, Aristotle, and an educated reader, would disagree with such a claim because of Cicero’s disregard for the role of action and progression within human understanding and nature. Yet, as one can see, my praise of Aristotle’s reasoning is with his deduction and conception of the highest good but not with what he believes the highest good is. This is because happiness is not the solitary nucleus Aristotle claims it is. Let us reiterate Aristotle’s criteria for the highest good which are: it is desirable for itself, it is not desirable for the sake of some other good, and all other goods are desirable for its sake. Furthermore, lets keep in mind the highest good is crucial to living well. With that being said, we can then see that if happiness is suppose to be desirable for itself and not some other good then why is it that happiness is crucial to living well? This shows that the pursuit of happiness is actually a component of living well; living well is the nucleus. Aristotle tries to claim happiness and living well are actually one in the same thing but this is illogical.  Cosmic Sisters Artwork Living well is an actual state of being, combining both physical and emotional aspects of the human being together while happiness is merely an idea pursued by the individual human being. Thus, one can claim happiness is a component of the human being, falling under the emotional aspect of a human, yet it is not the driving force of living well. Instead, Aristotle’s whole argument that happiness through rational action exercised with virtue and excellence merely seems more like a strong position for the difference between man and animal but not an argument for the highest good based on his criteria. With that being said, happiness as discussed above is nothing more than a luxury of separation from the state of nature; our ability to reason has separated us from our more primitive roots and thus allowed us to live comfortably. Yet, living well is not plausible without examining the roots that make no distinction between animals and humans; survival.  Theodore Gericault, “Raft of the Medusa” (1819) Thus, it can be argued the highest good is survival, which allows us to access all other luxuries in life. It is not a question of separating human from animal, but a question of living well. For example, who are we to say an animal that does what is necessary to survive does not find happiness in relaxing with its fellow species? Why does rationality need to be the defining factor in happiness? The bare necessities for survival are the highest good because they allow us to access all other goods such as happiness. Without the basic necessities for survival a living thing would become weak or die making it unable to achieve anything. For these reasons, survival fits all of Aristotle’s criteria: it is desirable for itself, it is not desirable for the sake of some other good, and all other goods are desirable for its sake. Happiness as well as many other components of life are by products of the necessities for survival. What do you think? leave comments. ",
            "date": "Answered June 25, 2019",
            "views": "587",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nathan Ketsdever",
                "href": "/profile/Nathan-Ketsdever"
            },
            "answer_text": "Courage. It’s the precondition for all the other. I tend to think Truthfulness and Integrity, alone with Humility and Love perhaps get the short shift on this ranking. And we’re not really animated by courage. And courage is contextual. It seems a bit emptier than Love. I suppose this is a conundrum or a false choice, because virtues get expressed as constellations or integrations. That is virtues are interconnected. It may be in fact almost impossible to just express one of the virtues at once, rather than many. ",
            "date": "Answered August 8, 2019",
            "views": "273",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Earl Wajenberg",
                "href": "/profile/Earl-Wajenberg"
            },
            "answer_text": "Eudaimonia, sometimes translated as “thriving” or “doing and living well,” having a life that is objectively desirable; but he goes on to say this is actually needs to be unpacked further. ",
            "date": "Answered June 15, 2019",
            "views": "161",
            "upvotes": "0"
        }
    ]
}