{
    "title": "After learning the advantages and disadvantages of cultural relativism and ethnocentrism, which perspective do you think everyone needs to adapt? - Quora",
    "tags": [
        "Cultural Relativism",
        "Ethnocentrism",
        "Relativism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joe Andros",
                "href": "/profile/Joe-Andros-1"
            },
            "answer_text": "After learning the advantages and disadvantages of cultural relativism and ethnocentrism, which perspective do you think everyone needs to adapt? Their own. Which they well know the good of in experience and use. Their own perspective, but richly informed by the observation that others find good in their own. And that their own perspectives often have tricks, tips, insights, attitudes and approaches we’d be fools not to examine for our own potential use and adaptation. In any case, letting theirs be theirs. Fine by them. Doesn’t have to be fine by me. I can tell fine from foul for myself, but that’s not something I need to work out for you. That would be, if it’s any problem at all, yours. Another’s perspective is not one’s own problem, unless they lack an understanding of autonomy’s fundamentals and, under the pernicious influence of this defect, try to make our perspective their problem. Such understandings can always be offered. Such persons who refuse them can always be spurned. Subtract ourselves from voluntary association with such ones, who refuse to honor and acknowledge our autonomy (like theirs is so great). Supposing one lives in a free society with rule of law, that’s the only perspective you need. One’s own perspective, within which one acknowledges others have their own to deal with, and it’s not a problem. ",
            "date": "Answered October 1, 2020",
            "views": "76",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Yuris Valpeeteris",
                    "user_href": "/profile/Yuris-Valpeeteris"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rob Jamieson",
                "href": "/profile/Rob-Jamieson-2"
            },
            "answer_text": "I have travelled extensively and lived in a number of different cultures. Each taught me something valuable for which I am extremely grateful. They also forced me to recognize how many of my values were shaped by my own cultural upbringing, ones I wasn’t even aware I had or why I thought in a particular way. With connectivity shrinking the globe, we are well on the way to creating a global culture. Some people resent that and the politics of identity is, sadly, increasingly fostering this resentment as well as a sense of cultural entitlement. Of course, this is not a foregone conclusion. China has spurned the chance to become a co-equal member of the global community and instead is determined to resurrect its perceived role as the world’s ‘Middle Kingdom.’ But even in China, the people are becoming more urbanized and in the process, more like the rest of us. The impacts of climate change are also starting to have a profound affect and this will only increase the anxiety of those least discomforted by it. However, we need to wake and recognize that we are all in this together—and there is no way around that.  ",
            "date": "Answered October 2, 2020",
            "views": "61",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michelle Contreras Ewens",
                    "user_href": "/profile/Michelle-Contreras-Ewens"
                },
                {
                    "user_id": "Alan Armstrong",
                    "user_href": "/profile/Alan-Armstrong-21"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jane Adams",
                "href": "/profile/Jane-Adams-130"
            },
            "answer_text": "Ethnocentrism is highly dangerous. It can, and has, led to xenophobia, racism, ethnic cleansings, genocides, holocausts, and Donald Trump in the White House. Cultural relativism can cut down on people making stupid statements about other cultures and remind us to mind our own business. However, it can also be taken too far. For instance, someone could say that Americans should let immigrants practice female genital mutilation because it is part of their culture. Obviously, that is a very sick and disgusting thing to say. ",
            "date": "Answered October 2, 2020",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Adam Suddit",
                "href": "/profile/David-Adam-Suddit"
            },
            "answer_text": "It would be a better world if everyone could/would think for themselves rather than adopting isms. ",
            "date": "Answered October 1, 2020",
            "views": "25",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Todd Elliot",
                    "user_href": "/profile/Todd-Elliot-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Jones",
                "href": "/profile/Bill-Jones-385"
            },
            "answer_text": "everyone can “adapt\" what they want. i know what they are. i also know that they are used as cudgels for attempts to control. ",
            "date": "Answered October 1, 2020",
            "views": "15",
            "upvotes": "0"
        }
    ]
}