{
    "title": "After studying the full text of Martin Heidegger's The Question Concerning Technology, what three concepts remain unclear or difficult for you to understand? - Quora",
    "tags": [
        "Martin Heidegger (philosopher, author)",
        "Philosophy",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Cook",
                "href": "/profile/David-Cook-679"
            },
            "answer_text": "The QuestionConcerning Technology was a lecture delivered by Heidegger in1953 and then was published as a paper. It seems to me that it could be approached as aplausible starting point for studying Heidegger's later philosophy. I shall attempt a general response to the question asked. Heidegger, as we know, was a deeply flawed individual. He was however an original and penetrating thinker, and TQCT expresses many of his concerns about the modern world in his characteristically obscure and learned manner. There are appeals to Latin and in particular Greek vocabulary, as ways seeing into how far we have become alienated from both the creativity of nature and our own creative capacities through our unexamined and exploitative attitudes. A crucial sentence is 'Thus, what is decisive in technē does not lie at all in making and manipulating nor in the use of means, but rather in revealing (alēutheuein - revealing, truth)'. There is a discussion of Aristotle's four causes, and later the conclusion that in modern physics, causality now displays neither the character of the occasioning that brings forth nor the nature of the causa efficiens, let alone the causa formalis. Human interiority is seen to wither in the modern instrumental stance. Heidegger makes special use of the word Gestell (enframing) both to make a link and emphasise a difference between old pieties and modern pragmatic manipulation of nature. And there is this damning statement: 'Modern physics is not experimental physics because it applies apparatus to the questioning of nature . The reverse is true. Because physics sets itself up to exhibit the coherence of forces in advance, it orders its experiments precisely for the purpose of asking whether and how nature reports itself when set up in this way.' In other words with deterministic spectacles on what is holy in human life departs. At a personal level a technolgical creed might suggest it not unreasonable to treat other people as a means to ones own ends. At a political level whole populations might fall under the harsh exploitation of the State, as happened under Stalin. There is one question which underlies this paper as much of Heidegger's later philosophy. He calls it the question of being. Like a pilgrim, he never answers it but is always on the way. ",
            "date": "Answered September 16, 2020",
            "views": "117",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nathan Coppedge",
                "href": "/profile/Nathan-Coppedge"
            },
            "answer_text": "I thought Heidegger was writing about perpetual motion, although if you push that point in class or in an essay, you will probably get in trouble. I don't know why they assign it except to push perpetual motion machines. I support perpetual motion, but I don't know why it would be a normal part of education if it wasn't invented. I would recommend approaching Heidegger from a classic Greek tragedy perspective alongside Birth of Tragedy by Nietzsche, and/ or from a modern perspective emphasizing Sartre and true modernism and existential anxiety. The text does summarize technology nicely, but there is not much to say about that. The perpetual motion part is an intuition. I believe the writing is normally found in the Major Works. ",
            "date": "Answered September 15, 2020",
            "views": "29",
            "upvotes": " Answer requested by John Michael Yamba"
        },
        {
            "author_info": {
                "name": "Jørgen Pallesen",
                "href": "/profile/Jørgen-Pallesen"
            },
            "answer_text": "why people waste time on himwhy wouldn’t it be self explanatory to see that he’s just a paranoid guy, that waste time defining irrelevant thigns?",
            "date": "Answered September 15, 2020",
            "views": "28",
            "upvotes": " Answer requested by John Michael Yamba"
        },
        {
            "author_info": {
                "name": "Jim Farned",
                "href": "/profile/Jim-Farned"
            },
            "answer_text": "What’s your point exactly? Have you three concepts in mind, or are you just offering your services? ",
            "date": "Answered September 15, 2020",
            "views": "29",
            "upvotes": " Answer requested by John Michael Yamba"
        }
    ]
}