{
    "title": "After a break of 20 years without making a film, why did Terrence Malick come out of semi-retirement to make The Thin Red Line? - Quora",
    "tags": [
        "Terrence Malick (director)",
        "Movie Directors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Miguel Pineda",
                "href": "/profile/Miguel-Pineda-3"
            },
            "answer_text": "From: Hollywood Bigfoot: Terrence Malick and the 20-Year Hiatus That...  \"Shortly after completing Days of Heaven, Malick met an aspiring producer named Bobby Geisler. Geisler had only a few credits to his name (some television and one feature film), but his enthusiasm for Malick’s first two movies led to a working relationship that would continue until The Thin Red Line was eventually completed without his direct involvement. He first offered Malick the opportunity to adapt David Rabe’s play In The Boom Boom Room for the screen, which his new collaborator turned down. The two instead began work on The Elephant Man, a biopic about Joseph Merrick (a human curiosity whose exact ailment is still debated well over a century after his untimely death) for which Malick turned in a spec script, but it fell to the wayside when the pair received word that David Lynch’s film of the same name was already nearing completion. By far the most ambitious of Malick’s unfinished projects, Q — also known in various stages as Qasida and Creation — is also the one about which we know the most today, by virtue of the fact that it was in pre-production for well over a year beginning in 1979 and financed by Paramount. According to Paul Ryan, who shot second unit on Days of Heaven and was hired to the do the same for Q, “Some people had criticized Days of Heaven for not having enough of a story, but Terry would say, ‘I want to go more in that direction.’ He was interested in a non-narrative style, the cinematic equivalent of how, say, Beethoven had structured his symphonies.” The scope of the project quickly expanded, says Los Angeles magazine’s Joe Gillis, and the balance between concept and narrative began leaning further toward the former. “The original concept was a multi-character drama set in the Middle East during World War I, with a prologue set in prehistoric times,” Gillis continues. “But after dispatching an assistant for 10 weeks to scout locations, Malick chucked the Middle East section. By the end of the year, the prehistoric prologue had become the whole script.” These prehistoric elements were eventually integrated into The Tree of Life, and it has been reported that actual canisters of film from Q were unearthed and inserted into the later film. That said, some of the headiest aspects never made the leap — including, perhaps most notably, a “sleeping god” once described as a minotaur “underwater, dreaming of the origins of the universe, starting with the big bang and moving forward as fluorescent fish swim into the deity’s nostrils and out again.” Malick’s refusal to work at anyone’s pace but his own is credited as the primary reason the project never got off the ground; Paramount had spent over $1 million developing the project, not shelving it until Malick failed to deliver an official script after a year, instead turning in as many as 40 pages of poetic descriptions at a time. Another contributing factor, according to Biskind, was the death of Charles Bludhorn, the executive who had originally been working with Malick. The money and creative control given to Malick were, for him, unprecedented. But that sum might ultimately have been a double-edged sword in that it “may have given him too much freedom,” notes Gillis. According to California’s David Handleman, Q was Malick’s “response to Days of Heaven, [to] being hailed as a genius and not knowing if he agreed with the characterization […] he seemed bent on topping himself, wandering close to lunacy to avoid repetition — or failure.” Though speculative, this account is in keeping with descriptions of Malick as a perfectionist who wanted to make a great film or no film at all. In the 1980s, Malick was said to be working on a script for Louis Malle (a process that reportedly involved him spending a few summers at the French filmmaker’s country home), but nothing came of it. Like a great many of his other projects during this period, this venture was screenwriting only. Malick had written scripts for others before, but not since completing Badlands had he ever written a movie for someone else. And, though The Thin Red Line’s source material is a novel, it was Malick himself who penned the adaptation — originally under the impression that he wouldn’t be directing it.  Next came a proposed adaptation of Walker Percy’s novel The Moviegoer, about a man in New Orleans who connects to movies more easily than he does to everyday life. Given that Julia Roberts and Tim Robbins were attached at one point in 1994, it seems fair to assume that Robbins was to play the title role.[11] Projects from this time period apparently had a very high failure rate as it is, but once pre-production on The Thin Red Line began in earnest and The New World followed, Hurricane Katrina apparently dashed any hopes of this Louisiana-set film getting made: “I don’t think the New Orleans of the book exists anymore,” Malick said at an extremely rare question-and-answer session prior to the release of The New World in 2005. Unlike many other aborted projects, it seemed likely at one point that he would have served as both writer and director on The Moviegoer. Another adaptation, Malick’s take on the Larry McMurtry novel Desert Rose, is regarded as having been more financially motivated than some of his other attempts. Malick was approached by Rob Cohen, then the head of Taft-Barish Productions, with plans for Barry Levinson to direct. At roughly the same time in the 1980s, Malick was hired to write a script about Jerry Lee Lewis. Said by Gillis to have been “much darker” than Great Balls of Fire! (1989), the project never got off the ground. Malick has reportedly kept the script, however, and, as recently as the fall of 2011, Brad Pitt (who not only starred in but co-produced Tree of Life) was said to be developing it with Natalie Portman in mind as a potential lead.  Geisler again approached Malick in 1988, 10 years after first attempting to work with him, this time with co-producer John Roberdeau and a $2 million offer (which they didn’t have) to direct the D.M. Thomas novel The White Hotel. Malick, uninterested in the source material, countered with Molière’s Tartuffe; eventually they settled on The Thin Red Line, which Malick began adapting in 1989. Apparently concerned by the manner of Q’s dissolution, Geisler and Roberdeau felt it pertinent to make this a two-picture deal in the hopes that it would keep Malick focused and, indeed, reined in. By not allowing him time to creatively meander, they hoped to maximize his productivity, and nearly 20 years later, the fact that To the Wonder premiered some 15 months after The Tree of Life with at least two other of Malick’s films in one stage of production or another may have retroactively proved their point — perhaps multiple projects really do spur this filmmaker’s creativity. The second part of that proposed deal, perhaps the strangest of Malick’s many failed ventures during this period, was a stage adaptation of Sansho the Bailiff, one of Japan’s best-known pieces of folklore, previously filmed (and rather beautifully at that) by Kenji Mizoguchi. “At heart, it’s a very intimate story,” Geisler told Variety in 1992, “but its ambition has been to shake up Broadway. It’s a work of size and soul.” Completing the script was no easy task. Malick finished a first draft in 1990 and sent it to a number of directors, including Ingmar Bergman, all of whom turned it down. “No script existed for the Mizoguchi film, so [Geisler and Roberdeau] had it transcribed and translated by both a Japanese linguist who spoke English and an American who spoke Japanese.” Eventually Andrzej Wajda (of Ashes and Diamonds) agreed to direct. Malick then flew to Warsaw to meet the Polish auteur, but their meeting did not go well. Wajda is said to have told Malick, “Terry, what you need to do to Sansho the Bailiff is make it more like Shakespeare.” After over a year the play’s price tag had ballooned to $800,000, little of note had come together in any substantive way, and it was shelved. Along with Q and Sansho the Bailiff, The English Speaker completes Malick’s triptych of incomplete passion projects. According to Geisler’s interview with Variety mentioned above, Malick had been interested in the “tale of 19th century psychoanalysis” even before Days of Heaven. The script was so personal to him, in fact, that he would only let Geisler read it; Peter Biskind alluringly describes it as “The Exorcist as written by Dostoevsky.” Given the similarity of the real-life story on which it is based to that of David Cronenberg’s A Dangerous Method, the film is now especially unlikely to ever be released. It is tempting to try and track down a screenplay like this one — and some have tried — but only for the roughest of outlines: Malick is well-known for straying incredibly far from the words he puts down paper and improvising on set. The rest of his rumored projects are all scattershot and perhaps only proposals. In 1991, Malick was attached to produce an adaptation of Graham Greene’s Brighton Rock with a script by Don MacPherson. It never advanced beyond the earliest stages of production. Malick reportedly asked Geisler and Roberdeau to allow him to adapt A Tale of Two Cities for the stage, but nothing ever came of it either; similarly, he penned a reworking of Robert Dillon’s Countryman screenplay which he called Hungry Heart and fashioned as a sort of modern-day Grapes of Wrath. Little is known about it other than the fact that it was never made. Malick did, however, produce a documentary titled Endurance, which Variety reported on in 1997: “Malick and [Leslie] Woodhead are out in Ethiopia at the moment, making a film about why African athletes run so fast.” As for money, Malick made upwards of $100,000 per project as script doctor, was on retainer at Paramount during the production process of Q, and, according to an executive there in 1985, “[Malick and Paramount] have an understanding, that’s all. He’s independently wealthy — oil money. There’s no story.” Says a friend, “he lived austerely.” (That a nature-obsessed filmmaker who uses his own screenplays as the vaguest of outlines sustains himself financially via oil and script-doctoring is an irony that should not go unmentioned.) 1978 to 1998 notwithstanding, the number of years between each of Malick’s successful projects has varied. Five years between Badlands and Days of Heaven, seven between The Thin Red Line and The New World, six between The New World and The Tree of Life, and now one, from the latter to his latest, To the Wonder. At an average of one film as writer-director every six years or so, this means that the completion of only a few of these dozen-odd unrealized projects — the three in which he most involved (Q, Sansho the Bailiff, and The English Speaker), for instance — would account for the entirety of Malick’s absence and then some. His filmmaking style is freewheeling, improvisatory; a look at any one of his scripts reveals just how loosely he interprets them. He’s been described more than once as a butterfly-catcher, a truth-seeker who once halted a day-long setup of a fighter jet taking off in The Thin Red Line in order to film a bird that happened to be flying by.[12] Considering his characteristically slow pace, ornithological/celestial preoccupations, and the fact that he combines an auteur’s sensibility with the resources of major studios (the three films preceding To the Wonder cost between $30–$50 million each), the real marvel here may not be that it took him so long to “return” to filmmaking — it’s that he’s made as many movies as he has. So why does bridging the gap between perceived and actual reality matter? Well, because Malick himself does. He’s one of the most revered filmmakers alive: three Oscar nods, top prizes from the Cannes and Berlin film festivals, and a movie that placed 102nd on Sight and Sound’s most recent list of the best films of all time just a year after it was made. (This includes a ringing endorsement from the dearly departed Roger Ebert, whose final review happened to be on To the Wonder.) Devoted cineastes (including this one) fall over themselves in rapturous excitement each time Malick releases a new film, the first viewing of which is akin to either a drug or a religious experience — maybe both. If we care this much about the six movies he’s managed to finish, it’s worth looking back on the ones that he didn’t in order to see what, if anything, they might reveal about his working methods and thematic underpinnings. Imagine how strange it would be if, for instance, 20 years of Steven Spielberg’s working life were largely unknown to the public and, rather than make a serious attempt to describe that period accurately, most journalists were content to simply relay humorous apocrypha. To think: Malick might one day be referred to as a filmmaker who happened not to complete a film for 20 years rather than as a former hairdresser from Paris.\" Source: Hollywood Bigfoot: Terrence Malick and the 20-Year Hiatus That...   ",
            "date": "Answered March 2, 2016",
            "views": "921",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sameer Ketkar",
                    "user_href": "/profile/Sameer-Ketkar"
                }
            ]
        }
    ]
}