{
    "title": "Among the needs that drive man to philosophize, which is not relevant to you? - Quora",
    "tags": [
        "Philosophers",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Walter Uber",
                "href": "/profile/Walter-Uber"
            },
            "answer_text": "All philosophy is relevant to the the strength of the the idea put forward and that idea being backed by reasoning. Philosophies that don't meet a burden of reasonable consideration by lack of some tangible connection to our reality are not relevant. Phylosophy: The earth could be flat. Not tangible in our reality, not a relevant. Phylosophy: god may exsist. Not tangible in our reality, not a relevant. Phylosophy: Black holes may be the start, finish and re-start of our universe. Tangible in our reality, black holes exsist. Phylosophy: Winnie the pooh ideology. Tangible in our reality, the Pooh existed. Phylosophy is subjective, just a view of what may be or could be and is open to debate. The phylosophy of Pooh has a merit because Pooh did exsist. A phylosophy that has met the merit of objectivity is a statement of fact if verified. We can't verify good or evil, we can't verify love or hate, we can't verify bad or good luck, we can discuss these ideas. Good ideas have a relevant connection to us. Just my thoughts. I hope this helps Wally ",
            "date": "Answered July 2, 2018",
            "views": "42",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "ZERO SUBSCRIBERS",
                    "user_href": "/profile/ZERO-SUBSCRIBERS-2"
                },
                {
                    "user_id": "Denny D Costs",
                    "user_href": "/profile/Denny-D-Costs"
                },
                {
                    "user_id": "Bryan Galamgam",
                    "user_href": "/profile/Bryan-Galamgam"
                },
                {
                    "user_id": "Salahuddin Darries",
                    "user_href": "/profile/Salahuddin-Darries"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Wernick",
                "href": "/profile/Stephen-Wernick"
            },
            "answer_text": "The need to live by someone else's code of honor, whether it be words of wisdom from supposed holy men or the musings of the 'great' minds of the philosophers. I make my own decisions, good and bad, and live with the consequence of my choices. Some have been extremely good (marrying the one woman in the world who could put up with me) and some have been very bad (deciding to try and make a shit load of quick money by driving a pickup truck full of weed and coke from Florida to California and getting busted). ",
            "date": "Answered July 4, 2018",
            "views": "900",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gil Cainglet",
                    "user_href": "/profile/Gil-Cainglet"
                },
                {
                    "user_id": "Joe Zamerica",
                    "user_href": "/profile/Joe-Zamerica"
                }
            ]
        },
        {
            "author_info": {
                "name": "Seowon Kim",
                "href": "/profile/Seowon-Kim-3"
            },
            "answer_text": "Peersonally, I think that anything thhat you do for your own selfish good is irrelevant. Note that I said selfish. It is very mature and completely good to do something in wanting to learn something useful, or to grow and become a better person, etc. Those things are not selfish, they're a necessity in maturing. However, reasons like, philosophizing to earn fame, or money, (I don't know how or why you would philosophize to earn fame or money, but I'm not only talking about philosophizing here) is, indeed, selfish. But don't we all feel that way? That just shows that our true human nature is greedy. There are no people that are selfless, but there are people who strive to be. I think, aside from the reason that we need to fulfill our own selfish desires, that all other reasons are relevant and, sometimes, good. It is always a good choice to decide to learn more, depending on the real reason behind it. ",
            "date": "Answered July 17, 2018",
            "views": "906",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eugene Manalili",
                    "user_href": "/profile/Eugene-Manalili"
                },
                {
                    "user_id": "Julien Caparida",
                    "user_href": "/profile/Julien-Caparida"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ankit Nema",
                "href": "/profile/Ankit-Nema-11"
            },
            "answer_text": "Basically there are not the needs which philosophize a man, it's all about the ideas which come across them and the curiosity to find truth. It's not nessasary to posses some needs, and if talk about which is not relevant, I think it to be the ability to find truth in the nature. It basically not matters that you really revel our the fundamentals of nature, because most important is to find it in yourself. ",
            "date": "Answered June 25, 2018",
            "views": "22",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rich Dean Creayla",
                    "user_href": "/profile/Rich-Dean-Creayla"
                },
                {
                    "user_id": "Ryan Elmquist",
                    "user_href": "/profile/Ryan-Elmquist-1"
                },
                {
                    "user_id": "Mike Almen",
                    "user_href": "/profile/Mike-Almen-1"
                },
                {
                    "user_id": "John Paul Palisoc",
                    "user_href": "/profile/John-Paul-Palisoc"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex O. Cardona",
                "href": "/profile/Alex-O-Cardona"
            },
            "answer_text": "I guess there are many reasons or needs that drive people to philosophize. But if were to pin point something that I don’t find relevant to me, I’d say self importance. I don’t particularly find self importance, as a drive, to be a relevant component to any grounded philosophy. ",
            "date": "Answered July 7, 2018",
            "views": "673",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Janny Mark Nineza",
                    "user_href": "/profile/Janny-Mark-Nineza"
                }
            ]
        },
        {
            "author_info": {
                "name": "Erik Denning",
                "href": "/profile/Erik-Denning"
            },
            "answer_text": "“Why are we here?” Humans need reasons for everything, because we experience everything in the world having a reason. The universe doesn’t need reasons. You weren’t born here with a special purpose. You were just born here. ",
            "date": "Answered July 13, 2018",
            "views": "270",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rongzhang Wang",
                "href": "/profile/Rongzhang-Wang-1"
            },
            "answer_text": "Nothing, because every need that drives me to philosophize is always relevant to me. ",
            "date": "Answered July 3, 2018",
            "views": "102",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mike Janda",
                "href": "/profile/Mike-Janda"
            },
            "answer_text": "the quest for truth. the truth is readily apparent. the trick is accepting it. ",
            "date": "Answered July 3, 2018",
            "views": "92",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Arth Gupta",
                "href": "/profile/Arth-Gupta"
            },
            "answer_text": "The one to get a Ph.D ",
            "date": "Answered June 30, 2018",
            "views": "287",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Hill",
                "href": "/profile/David-Hill-174"
            },
            "answer_text": "War . ",
            "date": "Answered July 4, 2018",
            "views": "84",
            "upvotes": "0"
        }
    ]
}