{
    "title": "Are blessings and curses real? - Quora",
    "tags": [
        "Witchcraft (modern)",
        "Blessings"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ari Davies",
                "href": "/profile/Ari-Davies"
            },
            "answer_text": "Blessings and curses are indeed real. But not necessarily decided upon by a wicked spirit. Or a clean spirit. a curse or blessing can come upon you because of your physical actions or what comes out of your mouth there will be natural results to whatever you do yielding a perceived blessing or a perceived curse. There is also the blessing and the curse that comes about by invoking a third-party be a human beings or wicked spirits or good spirits. The first kind is caused by people you pay or give somebody a gift and that person intercedes on your behalf. the second kind is where you invoke and evil spirit or good spirit by some act of obeisance to induce the spirit to give you a blessing or a curse. there is simply too much evidence from too many people to dismiss the possibility of wicked spirits or kinda spirits that intercede on the behalf of people. ",
            "date": "Answered April 10, 2019",
            "views": "70",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jerry Pitts",
                "href": "/profile/Jerry-Pitts-7"
            },
            "answer_text": "Yes thy are real If you be leave thy are real ! The Be-leaf system of the human mind is a powerful thing and can make changes to the human body, even bring death ! That is how a Placebo works ! ",
            "date": "Answered April 8, 2019",
            "views": "42",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Andrew Sutcliffe",
                "href": "/profile/Andrew-Sutcliffe-18"
            },
            "answer_text": "as i dont believe in them,then no they are not,you can either bang your head and blame it on a curse or the fact you were clumsy,you can either win the lottery and think you were blessed,or that you were just lucky ",
            "date": "Answered April 11, 2019",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Timothy Suen",
                "href": "/profile/Timothy-Suen-1"
            },
            "answer_text": "Yes. ",
            "date": "Answered April 17, 2019",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "India Martinez",
                "href": "/profile/India-Martinez-5"
            },
            "answer_text": "Yes ",
            "date": "Answered April 9, 2019",
            "views": "8",
            "upvotes": "0"
        }
    ]
}