{
    "title": "Are you hopeful or pessimistic about the future? - Quora",
    "tags": [
        "Pessimism",
        "Hope and Hopes",
        "Optimism",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stan Johnson",
                "href": "/profile/Stan-Johnson-4"
            },
            "answer_text": "Short answer: It’s a mix of both, but leaning rather heavily toward optimism. Long answer: I’ll try not to go too “religious nut” here, but yes, I am religious, and, yes, I do subscribe the belief that the final “end game” is utopia. But it’ll be hell to get there. To elaborate, right now, a lot of things look pretty bad across the globe, but I’ve also observed that while at least my society (American) seems to be on a downhill slope, that slope isn’t all inclusive; it seems more polarization, where the bad get worse, and the good get better. I find I agree with the song “I believe most people are good.” Thing is, we’ve got some… not so great… people in positions of considerable power (I can hear the questions now: “You mean, you’re a Christian who didn’t vote for Donald Trump? Heretic!”), and not just in the US. There’s plenty of saber rattling, a growing trade war, military maneuvers all over the place, the whole Syria thing, etc. etc. etc. When bad people take power, they tend to fight tooth and nail to hold onto it, and even if the majority of their constituents are good, moral people, well… it usually makes things bad for everyone anyway. So, yes, I’m convinced that things will get worse (and considerably so) in the near future (hence the “mix of both”), but I do actually trust both ancient and modern prophets who tell us that after it all falls apart, events will transpire to not only patch things up, but to create the kind of society most people have been longing for for millennia. And that is why I lean very heavily toward optimism. All the best. ",
            "date": "Answered August 10, 2018",
            "views": "179",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mikkel Nyhave Andersen",
                    "user_href": "/profile/Mikkel-Nyhave-Andersen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Howard Stroud",
                "href": "/profile/Howard-Stroud"
            },
            "answer_text": "Realistic, humanity has shown it goes up and down like the stock market. Things change and we have adjustment periods. Sometimes it’s for the better and sometimes it’s for the worse. But over the course of humanity we have always progressed and always striven to improve. Till the end of life on earth or maybe our galaxy (if we ever inhabit other planets) I believe humanity will press on. Want more than nice words? While we hear about all the bad crap on our 24/7 news cycle just look at humanity’s history. Living conditions, human rights, and knowledge of the world around us have drastically improved globally. ",
            "date": "Answered August 10, 2018",
            "views": "68",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mikkel Nyhave Andersen",
                    "user_href": "/profile/Mikkel-Nyhave-Andersen"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Kotsch",
                "href": "/profile/John-Kotsch"
            },
            "answer_text": "Trump has cast a pessimistic shadow across my America. I cannot condone the public, racist activities that are occurring on a regular basis. The treasonous acts of Trump allowing Putin credibility goes unchecked. The EPA no longer protects America. HUD is now geared to eliminate tens of thousand's of eligible recipients. The Department of Education is a joke. Energy is being lead by a man who studied animal husbandry and the Department of the Interior is selling off Federal Land to benefit Big Oil and Mining. The deficit will reach record numbers. Our Infrastructure is crumbling and yet nothing has been done. And to top it all off we have experienced noticeable inflation in our purchases from groceries and gas to S.U.V.s and Housing. This is not my America. It is now an America for the 1% ",
            "date": "Answered August 9, 2018",
            "views": "79",
            "upvotes": " Answer requested by Mikkel Nyhave Andersen",
            "upvoters": [
                {
                    "user_id": "Levi Coin",
                    "user_href": "/profile/Levi-Coin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sunanta Mandal",
                "href": "/profile/Sunanta-Mandal"
            },
            "answer_text": "Yes definitely… I am optimistic about my future…. If you can't believe to yourself, you can't take any action in your life… Always be optimistic in your life… if you will be optimistic in your life, you can utilise your present moment better…. Only a present moment create a feature in your life…. if you will utilise your present moment better definitely you will be get good result in future…. Implement air present moment better and create a better life…. Your success is my wishes…. Thank you… ",
            "date": "Answered April 25, 2019",
            "views": "36",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Ed Haas",
                "href": "/profile/Ed-Haas-6"
            },
            "answer_text": "Not really. Just found out all my deductions are gone and the nest egg with it. Waiting for revolution and a return to balanced tax structure that will allow me to reduce debt before I croak. ",
            "date": "Answered April 24, 2019",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pooja Kulshrestha",
                "href": "/profile/Pooja-Kulshrestha-7"
            },
            "answer_text": "I am very optimistic (as always) about the future. Do what you want to do, keep moving forward and look for more to conquer. Try not saying away from winning.:-):-):-) ",
            "date": "Answered August 2, 2018",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Collins",
                "href": "/profile/David-Collins-614"
            },
            "answer_text": "Overall yes but mostly I am accepting of uncertainty and because of this I am open to what happens to possibilities and how things can and will get better. ",
            "date": "Answered April 25, 2019",
            "views": "14",
            "upvotes": " Answer requested by Levi Coin"
        }
    ]
}