{
    "title": "Are there any universal moral standards? - Quora",
    "tags": [
        "Universal Experience",
        "Morals and Morality"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christopher Wood",
                "href": "/profile/Christopher-Wood"
            },
            "answer_text": "Yes, logically there must be. Possibly you can avoid that conclusion if you have a very strange definition of morality, but normally the answer is yes. Morality can be thought of as answering the question: \"What ways of living make us happiest?\" (although there are other definitions that are arguably more important). Regardless of what you think about the source of truth or morality, we human beings have things in common about the way our brains and bodies work. Here's an argument laid out in formal fashion: The human brain is not infinite in size.(following 1): Therefore there is a finite number of ways the human brain (as a system, including chemicals, neurons etc) can be organized.(following 2): Therefore there are some universal truths about the way the human brain works.Humans experience varying levels of happiness / joy / pain / etc.These variations are a result of or connected with something happening in the brain.(3+5): There are some universal truths about what makes a human experience happiness / pain / etc.What humans think or do affects the way the brain is organized.(6+7): There are universal truths about what humans can think or do that create happiness / pain / etc.Moral standards relate to ways of thinking or acting that create greater or lesser happiness / joy / pain etc.(8+9): There exist universal moral standards.Note that this argument works regardless of our level of understanding of the human brain and regardless of whether free will exists. For the sake of simplicity this doesn't deal with collective happiness. This is unnecessary because any definition of collective happiness depends on some calculation of individual happiness, and the argument demonstrates that principles exist that apply to *all* individuals. Note also that this is quite a weak argument in that it says little about what those moral standards are. There are stronger and simpler arguments: those that show the equivalence of universal moral standards and absolute truth. The existence of absolute truth is almost trivial to prove. If truth is worth anything at all - and it must be, so long as language exists - then the recognition of truth is itself a universal moral standard - and indeed the one upon which all other moral standards rest. ",
            "date": "Answered April 25, 2016",
            "views": "16",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Connor Duke",
                    "user_href": "/profile/Connor-Duke-1"
                },
                {
                    "user_id": "Janine Alaba",
                    "user_href": "/profile/Janine-Alaba"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rich Kingsford",
                "href": "/profile/Rich-Kingsford"
            },
            "answer_text": "Yep.  Living in accordance with moral standards brings happiness where violating them brings misery.  For example, showing discipline in school and work brings prosperity and having what you need, whereas being lazy tends to bring poverty. I really like these \"rules of life\": \"the universal need of every human being is to feel that, I am of worth, my feelings matter, and someone really cares about me.\" (Lundberg 93)Treat others as you'd want to be treated.Before you focus on what's wrong with someone's idea, focus on what's right with it.If you can't say something nice, don't say it at all.Clean up your own messes.Rely on yourself for your needs and wants and never shift this responsibility to someone else.In a world where everyone's crazy, but not necessarily in the same way, the challenge is to treat each other with love and respect anyway.When someone offends you, you can either choose to whine about it or treat it as an opportunity to practice patience. (Goddard)Leave everything better than you found it.Choose to light up a room when you enter it by loving othersWhat are the rules of life that people should know before playing the game called life? ",
            "date": "Answered January 11, 2015",
            "views": "1",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ramaswamy Subramanian",
                "href": "/profile/Ramaswamy-Subramanian-5"
            },
            "answer_text": "Morality usually relate to social custom or tradition. Many link morality to national law. National law as well as tradition and custom are different in different countries, as such there is no possibility of any moral standard becoming universal. But certain principles of natural law, can be universal. Hurting others, or cheating etc. are not generally accepted by any country, it can therefore be stated as universal. But here to standards are different. Punishment for simple offences are very serious in some country, but in countries like India, simple offences are treated lightly. Culture and tradition influences moral values, but these are rarely similar between two countries. Standardizing moral values are difficult, and it is much more difficult to universalize moral values.  One should always connect moral values to natural law. Natural laws are not based on, culture, tradition or constitutional laws, it is totally different. A person can only have a partial imagination of natural law. Nobody can fully visualise it. But, it is enough if person acts according to his understanding of it. So, one's knowledge is also linked to it. If, tiger killing a deer for food is justified, then a man killing a deer for his food, should also be justified. Here the natural law approves it, but not law of the land. A child, killing a rabbit for fun, can be justified, because the child is ignorant of the rabbits pain. But if a man kills rabbit for fun, it is against natural law. Here one action is moral, and the other is immoral. Thus, every action has to be analysed in toto, to arrive at a decision. Mankind do have limitations, in the judgement of morality. ",
            "date": "Updated May 8, 2016",
            "views": "589",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Matthew Shearin",
                "href": "/profile/Matthew-Shearin"
            },
            "answer_text": "While I do think there are many morals that are subjective or relative, I believe there are morals that are universal moral defaults for any society to function. Laws against murder, stealing, adultery, and other actions that victimize other people would be viewed as immoral by people across time, and let me explain. If these actions were allowed it would destabilize society because if, for example, we allowed people to murder, or steal, the victim or victim’s family would likely do what they believed was necessary to avenge the act. We can’t have people acting by themselves in such situations; if everyone behaved this way it would cause numerous social problems, which is probably a reason these actions have always been frowned upon to varying degrees. ",
            "date": "Answered February 24, 2017",
            "views": "419",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dan Miller",
                "href": "/profile/Dan-Miller-32"
            },
            "answer_text": "No, morality is subjective. Right and wrong is merely a matter of opinion. Personally, I try to make my moral code generally in line with the society in which I live, for obvious reasons. I also strive to abide by my conscience, since I need to sleep at night. ",
            "date": "Answered April 22, 2016",
            "views": "326",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "You Tube",
                    "user_href": "/profile/You-Tube-1156"
                },
                {
                    "user_id": "Mark Suhonen",
                    "user_href": "/profile/Mark-Suhonen"
                },
                {
                    "user_id": "Ernest Montague",
                    "user_href": "/profile/Ernest-Montague"
                },
                {
                    "user_id": "Jane Botten",
                    "user_href": "/profile/Jane-Botten"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raj Kumar",
                "href": "/profile/Raj-Kumar-855"
            },
            "answer_text": "The German philosopher Immanuel Kant thought so.  He thought that actions that one would at the same time wish to be universally followed and not cause contradictions are \"universal\" laws. Say, you decided to cut-in-line to same time; you would not want this to be universally followed, as the line would cease to exist if everyone cut-in-line -a contradiction.  Kant believed that these universal laws combined with the maxim that people should never be means to an end, but rather the end in itself -basically \"don't use people\" could form the basis for a universal moral standard.   ",
            "date": "Updated May 10, 2016",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Danny Choriki",
                "href": "/profile/Danny-Choriki"
            },
            "answer_text": "Yes, there is one. All other morals are subjective.  That one is, Don't repeat questions on Quora.   Or is that one subjective too? ",
            "date": "Answered June 5, 2016",
            "views": "137",
            "upvotes": "0"
        }
    ]
}