{
    "title": "Are humans naturally greedy? - Quora",
    "tags": [
        "Greed",
        "The Human Race and Condition",
        "Understanding Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Liz Marsh",
                "href": "/profile/Liz-Marsh-1"
            },
            "answer_text": "To find out what behavior comes \"naturally\", look at very young children whose parents have not quite yet civilized them.  Even among that group however there will not be a typical behavior.  Some of the little ones appear greedy, grabbing the other child's toy.  Or, is it simply curiosity?  As they get older, certain undesirable behavior becomes noticed more in one child than another.  I knew a little girl who was the youngest child to parents then middle aged.  They had more money by then and thus gave this child lots of toys and games.  When this little one had her little neice visit, she appeared very greedy and would not share her toys with the visitor.  But then, that could have been motivated by jealousy because now her mother was paying equal, if not more, attention to the little niece who was after all her granddaughter. Fast forward to adults.  Some are greedy and others generous.  Often the greed stems from fear of loss, or from the pain of a deprived childhood. It's a kind of survival mechanism.  Others, who have been treated generously combined with being rewarded as children for their own good behavior regarding generosity grow up \"naturally\" generous. The next category of greedy adults are those who are selfish for whatever reasons.    Most people are selfish (although may hide it well) unless love becomes the greater factor in their lives.  I am not speaking of just eros love, but also philos and agape love.  Even with love operating in their lives, they find that selfishness rears its ugly head a little too often for their refined spirits, so the old sin nature is not entirely gone, just modified by the altruistic intention that they have acquired, whether it be from loving training or a religious conversion. So back to the question, Are Humans Naturally Greedy, my answer is No to the greed, but to Selfishness, I would say Yes. ",
            "date": "Updated January 2, 2016",
            "views": "51",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Devashrut Bharadwaj",
                    "user_href": "/profile/Devashrut-Bharadwaj"
                },
                {
                    "user_id": "Dur E Shahwar",
                    "user_href": "/profile/Dur-E-Shahwar-5"
                },
                {
                    "user_id": "Brian Bauska",
                    "user_href": "/profile/Brian-Bauska"
                },
                {
                    "user_id": "Solomon Antoine",
                    "user_href": "/profile/Solomon-Antoine"
                },
                {
                    "user_id": "You Jun",
                    "user_href": "/profile/You-Jun-1"
                },
                {
                    "user_id": "Hải Trần",
                    "user_href": "/profile/Hải-Trần-75"
                },
                {
                    "user_id": "Bibekanand Mishra",
                    "user_href": "/profile/Bibekanand-Mishra"
                },
                {
                    "user_id": "Rennie Wokpeh",
                    "user_href": "/profile/Rennie-Wokpeh"
                },
                {
                    "user_id": "Bùi Thế Hòa",
                    "user_href": "/profile/Bùi-Thế-Hòa"
                },
                {
                    "user_id": "Andrew Sheldon",
                    "user_href": "/profile/Andrew-Sheldon-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Angela Neik",
                "href": "/profile/Angela-Neik"
            },
            "answer_text": "No. If that was the case, humans would not make it past childhood. Children and naturally charitable, can play together in peace, don't eat more than they can handle, and although they want toys, they can be pretty satisfied with an empty box plating with it for hours on end. The problem starts when they notice their circumstances, and they become envious of others. First their integrity goes: they feel no remorse: keeping stuff left behind by others, claiming it as their own, then their greet goes into a stage that nothing is enough anymore. They want everything for themselves, for one reason: so others won't have any! They hate seeing others being happy, enjoying life, so they try to take that away from them. That's the really sick part. That's when the way they see the world changes.  They never stop that cycle, it actually increases, and a little greed grows into a monster greed. They acquire various new vices along the way: lying, stealing, pretending, snooping, cheating, deceiving.  As adults they are the parasites of society: living off of others in small and large ways. If they can by any means get something for nothing, they'll go at it wholeheartedly. They never give you anything free of ulterior motives, there is always a large pay off for them in any giving action. The larger the \"gift\", the more they can claim you as their \"property\", and you'll be constantly reminded of their \"generosity\".  Greedy people have: no integrity in the workplaceno genuine love for anyone except themselvesno people around them who can be called genuine friendTheir greedy personality is as transparent as a slice of prosciutto, and they are disliked by everyone they meet.   ",
            "date": "Answered April 16, 2016",
            "views": "26",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "News Man",
                    "user_href": "/profile/News-Man-1"
                },
                {
                    "user_id": "Daniel Issaks Rubin",
                    "user_href": "/profile/Daniel-Issaks-Rubin"
                },
                {
                    "user_id": "Devashrut Bharadwaj",
                    "user_href": "/profile/Devashrut-Bharadwaj"
                },
                {
                    "user_id": "Sophia Llanos",
                    "user_href": "/profile/Sophia-Llanos"
                },
                {
                    "user_id": "Pulkit Advani",
                    "user_href": "/profile/Pulkit-Advani-2"
                },
                {
                    "user_id": "Samuel Vela",
                    "user_href": "/profile/Samuel-Vela-2"
                },
                {
                    "user_id": "Noyal David",
                    "user_href": "/profile/Noyal-David"
                },
                {
                    "user_id": "Brian Johnson",
                    "user_href": "/profile/Brian-Johnson-429"
                },
                {
                    "user_id": "Raveena Mathur",
                    "user_href": "/profile/Raveena-Mathur"
                },
                {
                    "user_id": "Nadya Hussein",
                    "user_href": "/profile/Nadya-Hussein"
                },
                {
                    "user_id": "Alejandro Rangel",
                    "user_href": "/profile/Alejandro-Rangel-14"
                },
                {
                    "user_id": "James MacCormick",
                    "user_href": "/profile/James-MacCormick"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roger Van Allen Shelton Jr.",
                "href": "/profile/Roger-Van-Allen-Shelton-Jr"
            },
            "answer_text": "In my opinion yes… Well, sort of. Human nature is to survive. Long ago we had to struggle to get what we needed to survive. If we found something useful we took it and we kept it for ourselves. The ones who were best at this and got the best things not only survived, but flourished. The ones who didn’t… Not so much…. being greedy and not being satisfied is genetically encoded in us because of our survival mechanism. We don’t need to gather and hoard stuff now. But we still do it. greedy is the bad part of this in my opinion. But never being satisfied is a good trait in my opinion. If you’re never satisfied, you always strive to be a better version of you. You need to do better at life in general and you will tend to accomplish great things. The only time it will be harmful is if your drive to be better exceeds your ability to achieve. Then, that turns into disappointment. If you go to Hollywood with the intent to be a mega superstar in less than a year, expect to be disappointed severely. People who do that is very, very rare. However, if your expectation is to do that within ten years, you’re far more likely to achieve that goal. And that goes for everything you set your mind to do. You can be ok in this world if you’re a little greedy and never satisfied as long as you keep your goals realistic in anything you do. ",
            "date": "Answered January 30, 2018",
            "views": "312",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "News Man",
                    "user_href": "/profile/News-Man-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Bruss",
                "href": "/profile/John-Bruss-2"
            },
            "answer_text": "100% No. I want more virtue in my life…..I want to helps others to love and increase in virtue, too. Am I greedy? Both the words “want” and “greed” and potentially pejorative but that is only true if we approach those words with a pejorative attitude (which is never a good thing). So I say, “Skip all the (hate and condemnation based) pejorative BS” and rephrase the question: Is all wanting more “perverse”? Or the opposite: Can wanting more be virtuous? I think the rephrasing I did here almost answers the question. A mother is desparate to feed her hungry children and works day and night to do so…..she wants more, obviously. Is she greedy? Why not just sit at home (in harmony with the universe…ha ha) and suffer with her children and see what the results will be? You must be kidding me!! I use the example above so that most people will “get the point”. But the same pattern can be extrapolated all the way to major corporations like Apple, Microsoft, Exxon and General Motors. Greed is solely in the heart of each of us including you and me. If you think not, you are either naive or a deceiver. Greed is wanting more at the expense of other people. Only individuals can “be greedy” and if there is no intent to harm others, there is no greed. Greed is not me thinking you are greedy. In fact, if I do that, I am the one with perverse intentions: condemning you. So it’s best for me to look in the mirror and see who I really am. A condemner of others or a beautiful display of virtue so that the display draws others to become virtuous themselves, not condemners of others. All condemning is a form of a “tell” (like in poker) where the one condemning is desparate to hide their inner neediness/perversion. So like after eating some bad food, we puke it out of us (even upon others). So it is with condemnation….we puke out our inner condemning spirit (as it eats at us) and try to get it out of us. And almost always, the specific topic we are using condemnation on, is the darkness that is eating us inside as well. A pastor once told me that the best sermons are the ones the pastor themselves needed to hear. It’s the best because they were so motivated by their own neediness on that topic, to really “preach it” (trying to puke it out?). But Yes, wanting more and more can be highly virtuous or highly perverse. And the wanting action itself, is only a “tell” for the virtue or perversity that’s motivating that individual from within. We call the perverse intention of wanting greed but enormous virtuous good has and continues to occur via that same wanting more and more. For sure, Jesus wanted more and more (of what he wanted), enough so he was willing to die for more of it. Hope this helps. ",
            "date": "Answered November 23, 2019",
            "views": "411",
            "upvotes": " Answer requested by Bisan Jabareen",
            "upvoters": [
                {
                    "user_id": "You Jun",
                    "user_href": "/profile/You-Jun-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Klaus Petritsch",
                "href": "/profile/Klaus-Petritsch"
            },
            "answer_text": "In my opinion, blaming greed is a much bigger problem than greed itself. It looks more like we are naturally (=hard to change without significant intervention) ignorant, and tend to delegate important tasks too easily. In other words, we refuse reasoning, questioning, knowing, taking responsibility, and learning. These are all things that may require us to change a belief or even a value that we have treasured for long. This is can be painful. Hence we fear and avoid such things. Deliberate ignorance and delegation of important decision making create problematic symptoms. One such symptom is the trouble-causing type of greed. A related and even more problematic and influential symptom is that we tolerate risky second-rate socio-economic power structures like an indirect/representative democracy and central banking, even on a large scale. Also, the fear of losing our comfy ignorance makes us believe that we, of all species’ on earth, are the only one that needs to be ruled by a few on top of a massive power pyramid. It is so much comfier to distract our awareness by playing ignorant and only look right and left, i.e. whether trade is organized centrally or freely. That way we rarely need to do anything too uncomfortable or risky. We also will not see the far reaching consequences due to loss of personal freedom and privacy, which larger ignorant societies have always been developing into, both on the left and right. Blaming greed, and implying it is an unchangeable human trait, is one of the great comfortable benefits of ignorance: We can feel good doing nothing because nothing can be done. [Good luck explaining this to your teacher :)] Blaming ignorance suggests that there may be a way out, by informing people and giving them the chance to practice inquisitive thinking. But this means effort, discomfort, and lots of trouble in the short (and possibly long) term. Few are ready for that but the numbers are rising. ",
            "date": "Answered August 7, 2016",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Devashrut Bharadwaj",
                    "user_href": "/profile/Devashrut-Bharadwaj"
                },
                {
                    "user_id": "Bhaskar Dutta",
                    "user_href": "/profile/Bhaskar-Dutta-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Marx",
                "href": "/profile/James-Marx-3"
            },
            "answer_text": "I believe that one of our surviving traits that led our society to where it is now is greed. Just like if you are patient then it is likely you are patient because you’re stubborn; qualities we inherit instincts for are always in pairs. One of the pair is a good thing, or a positive and is considered a gain or increase in your chances of being successful in life, in love, or in the eyes of society. The other side of the coin is the negative aspect. If you look for it you’ll find it. It’s always there. Greed is a negatively viewed quality these days of p.c. driven expectations of people. If you look for the positive of greed you might find something like being prepared, or providing for your own. Is a squirrel who picks up more than his share of pecans only to bury them in a flower bed and virtually keep them from other foragers greedy? Or is he just being practical since he knows if he doesn’t hide them a blue jay will come along and nab them? Hoarding is tied closely to greed. Most types of behavior like greed shouldn’t be so quickly demonized. Greed is another word for capitalism. Our economy is surely based on greed. Those who have had bad luck, or been without while others excel and exceed their quotas are usually not trying to victimize you. They’re simply trying to do for themselves. If people hurt others, or take from others, to take for themselves something they already have will need to answer for that to something or someone, someday. ",
            "date": "Updated October 18, 2018",
            "views": "600",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Olukayode Samuel",
                    "user_href": "/profile/Olukayode-Samuel-5"
                },
                {
                    "user_id": "Devashrut Bharadwaj",
                    "user_href": "/profile/Devashrut-Bharadwaj"
                },
                {
                    "user_id": "You Jun",
                    "user_href": "/profile/You-Jun-1"
                },
                {
                    "user_id": "Rennie Wokpeh",
                    "user_href": "/profile/Rennie-Wokpeh"
                },
                {
                    "user_id": "Jim Entwisle",
                    "user_href": "/profile/Jim-Entwisle"
                },
                {
                    "user_id": "Ivan Stanimirovic",
                    "user_href": "/profile/Ivan-Stanimirovic-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Koenig",
                "href": "/profile/Dan-Koenig"
            },
            "answer_text": "Short Answer: Yes. All living things, including humans, have a powerful instinct for self preservation. Long Answer: It can not be denied that some people are more ‘Greedy’ than others. People act in a greedy way for different reasons. Of course there are the megalomaniacs and narcissist who are completely self-obsessed, just as there are the completely selfless martyrs. For every Andrew Carnegie there is a Mother Theresa. But those types are few and far between. Most of us only act greedy in response to our needs not being met. Abraham Maslow studied this phenomenon in great detail and created the Hierarchy of Human Needs.  When a person does not have enough food to survive, they will go to any length to fulfill that need. Physiological needs like the need to breath, eat food, wear clothing and find shelter must be fulfilled. Once they are met, we move onto the need for safety, then the need to be loved or to belong, then esteem needs and finally self-actualization. But people are only desperate and ‘greedy’ toward the bottom of the hierarchy, when their physiological needs, safety needs and the need to be loved are not met. A person who does not feel safe is deficiency motivated. They are desperate because something is missing. When these needs are met and they move toward the top of the hierarchy, they are not deficiency motivated, they are growth motivated. A growth motivated person can afford to be giving and generous without the fear of losing what little they have. That is why kindness is the ultimate demonstration of power. Only those who see themselves as powerful can afford to be kind. ",
            "date": "Answered August 11, 2016",
            "views": "23",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kathy Roff",
                    "user_href": "/profile/Kathy-Roff"
                },
                {
                    "user_id": "Memo Bertha",
                    "user_href": "/profile/Memo-Bertha"
                },
                {
                    "user_id": "Mary Miesem",
                    "user_href": "/profile/Mary-Miesem"
                },
                {
                    "user_id": "Eli Mairovich",
                    "user_href": "/profile/Eli-Mairovich"
                },
                {
                    "user_id": "Ryan G",
                    "user_href": "/profile/Ryan-G-451"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zsolt Hermann",
                "href": "/profile/Zsolt-Hermann"
            },
            "answer_text": "We are both with an interesting self-serving, self-justifying, egocentric nature that wants everything for itself at the expense of others, at the expense of Nature. This is not our fault, we are not evil or sinful, we had no free choice about the “operating software”we are born with. We could say that evolution installed in us a raw, beta software to give us the ability to apply the final upgrade - complementing our original nature with an altruistic, selfless “software patch” copied from Nature - by our open conscious action, using our unique, Human free choice. This special transition from an inherently blind, instinctive, egotistic development towards a conscious, purposeful Human development starts in our generation. It is not that we are recognizing in great masses, that our original nature is cancer-like, self-destructive and we have to change. This conscious change and the unprecedented outlook at reality within the gained contrast - between our original nature and the new, acquired one - gives us our evolutionary Human advantage. Analysis Of The Human Nature | Laitman.com New Life #1087 – Education For A Change In Human Nature | Laitman.com The World Is Weary From Working For The Greedy Pharaoh | Laitman.com ",
            "date": "Answered February 9, 2020",
            "views": "117",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Devashrut Bharadwaj",
                    "user_href": "/profile/Devashrut-Bharadwaj"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alan Kay",
                "href": "/profile/Alan-Kay-8"
            },
            "answer_text": "If you look into the way the Russians all of a sudden became Super rich and buy up football (Soccer) clubs in the UK, and I mean top ones not the little ones and work their way up, straight to the top clubs, and goodness knows what else, as soon as Communism was abolished then you will get an answer. In The UK bankers, financial people, business people, especially the food giants, which include a Lord, are very greedy people. They are making billions, not just millions. The bonuses they get at the public’s expense is outrageous. The amount of Tax we pay is out of hand. Sales Tax 20%, Petrol (gas) is about £6 (8$) a gallon, Cigarettes are nearly £11 ($15) a packet of 20, Is that enough proof of greed??? The Government is killing us with stupid expenses claiming for things like a toilet seat and housing that they let out. Travel and lavish parties etc. is all out of hand. Even the Queen has to pay millions in taxes. So I would say that in the UK greed is rampant. Every one wants the latest phone at over £600 ($750 - 800) the biggest television they can buy, and the amount of cars on the road that cost virtually double of what they cost in Europe and the USA is unbelievable. BMW, Mercedes all around the £45–69,000 mark ($65–85). Terrible prices we have to pay and the amount of people that do pay it is getting more and more. You can check out some of the prices by putting .uk after the name and you will get the prices of things in the UK. Then you make up your own mind if people are greedy. We have very large families that cannot go out to work as the benefits, which would be welfare in the States, is more than they can get working, and all these families have big vehicles, big T.Vs and all the Xbox and Other delightful games and film players you can imagine. Greed is what makes this Country go round, otherwise, if people refused to pay the high prices, there would be a lot of foreign companies pulling out of the UK. Even the Chinese have over $3 trillion gold reserves. So I do not think it makes any difference if you have communism, as it works on paper, but not in action, they are still taking the guts out of the other countries. It is a war without any guns, bombs etc. It is a war of who is the richest. And if that is NOT greed, then tell me what is, Please…. ",
            "date": "Answered June 5, 2016",
            "views": "610",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Devashrut Bharadwaj",
                    "user_href": "/profile/Devashrut-Bharadwaj"
                },
                {
                    "user_id": "Calvin Tam",
                    "user_href": "/profile/Calvin-Tam-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chesty Baxter",
                "href": "/profile/Chesty-Baxter"
            },
            "answer_text": "Sometimes, but too a degree. All organisms could be called “self-interested” in that their main goal is the survival of themselves, even if that means dying so your offspring can live on as is the case with some species. Greed is an evolved form of this self-interest and evolves differently, if at all, according to the physical and social environment in which the organism is a part of. If we define greed as the accumulation of life sustaining things which goes beyond the minimum requirements for the organism to live and propagate then we may have an easier time rationalizing the nature of greed. The person who is TOO greedy often becomes a negative figure in culture. Therefore it is in people’s best interest to be both greedy AND altruistic (even altruism just for show, like a politician reading children stories to students when the cameras are rolling). Greed exists as both a concept and a practice in society but it exists alongside other concepts and practices like sharing which is just as ubiquitous. It is human nature to be greedy, sometimes. ",
            "date": "Updated January 31, 2018",
            "views": "547",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Devashrut Bharadwaj",
                    "user_href": "/profile/Devashrut-Bharadwaj"
                },
                {
                    "user_id": "Carter Barron",
                    "user_href": "/profile/Carter-Barron-5"
                },
                {
                    "user_id": "You Jun",
                    "user_href": "/profile/You-Jun-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daisy Cheng-Milano",
                "href": "/profile/Daisy-Cheng-Milano"
            },
            "answer_text": "I think it depends on the person and what that person's experience is. We all have an instinct to survive and that instinct is a balance between self preservation and altruism. George R. Price mathematically proven that altrusim is beneficial to passing on your genes for our species' survival. That said, a lot can go wrong depending on your life experience. When someone hasn't eaten for a while or dramatically decreases in their caloric intake, their body goes into starvation mode and it hoards fat like your life depends on it. A lot of people with poverty mentality does the same with money and stuff... That's what brings them security. Humans are also prone to addiction and compulsion. Hoarding is definitely a part of that. Greedy is a type of compulsion that stems from insecurity somewhere where they don't trust they will be taken care of. ",
            "date": "Answered August 11, 2016",
            "views": "798",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Morrie Bourne",
                    "user_href": "/profile/Morrie-Bourne"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Johnson",
                "href": "/profile/Brian-Johnson-429"
            },
            "answer_text": "Opponents of socialism have of course always claimed that “human nature” would be a barrier to a socialist society working, but in the past this was manifestly only an unsubstantiated assertion based on popular prejudice and religious dogma. So the identification of the gene came as a godsend to them. They could now give their prejudice a pseudo-scientific appearance by claiming that scientists were in the process of discovering genes for such behaviour traits as aggression, selfishness and domination that would make socialism impossible. If our social arrangements were determined by our biology then there would never have been the great diversity of behaviour patterns, relationships and culture that is the real story of our past and which is evident even in the way we live now. The argument that our behaviour is determined by our physical inheritance may pose as science but in reality it is a socially determined prejudice used as part of crude political ideology. For more: Are We Prisoners of Our Genes? ",
            "date": "Answered September 5, 2016",
            "views": "422",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bill Wallace",
                "href": "/profile/Bill-Wallace-42"
            },
            "answer_text": "Yes, this is built in by genes. Toddlers don’t share. But as they grow up, ME branches out to include US, the family and friends. But US exists as versus THEM, everyone else. The world today is full of problems stemming from US versus THEM - xenophobia for one. What it takes to ameliorate this is cooperation between groups to mutual advantage, and that means trade - trade of things, trade of people (tribes trade people as if they knew all about in-breeding). For a whole lot more on this, read The Rational Optimist, by Matt Ridley and Moral TRibes, by Joshua Greene. Read also about altruism. The greed for oneself never goes entirely away but cooperation builds a more selfless personality on top of it. ",
            "date": "Answered June 23, 2019",
            "views": "128",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Devashrut Bharadwaj",
                    "user_href": "/profile/Devashrut-Bharadwaj"
                },
                {
                    "user_id": "Dyndha Adhiva",
                    "user_href": "/profile/Dyndha-Adhiva"
                },
                {
                    "user_id": "Kevin Bar",
                    "user_href": "/profile/Kevin-Bar"
                },
                {
                    "user_id": "Fredrick Nelson",
                    "user_href": "/profile/Fredrick-Nelson-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mohammed Delowar",
                "href": "/profile/Mohammed-Delowar-2"
            },
            "answer_text": " Give Up On Your Fears “Where fear is, happiness is not.” — Lucius Annaeus Seneca Fear has the ability to take control of your life. It keeps you from doing things that could kill you. It also prevents you from doing things that make you successful. We can all have fears. Some of us have a fear of snakes. Some of us have a fear of heights. I, for one, have a fear of needles. Some of us even have a fear of happiness. It’s true, it’s actually a real fear and it’s called chemophobia. “Aversion to happiness, also called cherophobia or fear of happiness, is an attitude towards happiness in which individuals may deliberately avoid experiences that invoke positive emotions or happiness.” — Wikipedia There are four major reasons why cherophobes fear happiness: They fear that being happy will cause bad things to happen to them They fear that happiness will make them a worse person They fear that expressing happiness is bad for them and others They fear that pursuing happiness is bad for them and others “Some people — in Western and Eastern cultures — are wary of happiness because they believe that bad things, such as unhappiness, suffering, and death, tend to happen to happy people.” Wikipedia Unfortunately, fear and happiness can’t exist at the same time. So, fear becomes a problem if it is keeping you from being happy. To overcome the cherophobia, you need to start by taking small steps to reduce your fear. Let yourself feel happy when you have accomplished a difficult task. Learn to enjoy a beautiful sunrise or sunset. Enjoy being present with your friends and family. Once you start being happy with the little things in life, you will see that you have nothing to fear, and you will allow yourself more happiness. Only then will you be able to break the power of fear in your life and begin to live a happier life. Give Up On Your Negative Self-talk “Positive thinking and negative thinking cannot operate at the same level in your mind, one needs to be the master and the one you feed it more will rule over the other.” ― Oscar Bimpong I am my own worst critic. I have a constant conversation going on in my head telling me that, “I will never be successful.” When I forget things it tells me that, “I am such an idiot.” Lately, it has been telling me that, “I suck at writing” (this one might actually be true). Negative self-talk leads to poor self-confidence, low self-esteem, and a bad attitude. Some of the most common forms of negative self-talk include: Filtering — when you increase the negative and decrease the positive things in your life. Personalizing — when you blame yourself for things that go wrong. Polarizing — when you only see things as black and white (this is my favorite). Catastrophizing — when you expect the worst in every situation. “Never give a negative thought an inch or it will take a mile.” ― Matshona Dhliwayo Negative self-talk will never lead to happiness. If you want to be happy, you need to get rid of your negative self-talk. Pay attention to your negative self-talk and when you hear it…. Stop! Change your thinking and turn your negative thought into a positive. Change… “I will never be successful” to “I will find a way to make this work.” “I can’t do this” to “I can learn how to do this.” “This is impossible” to “I will give it a try.” You get the idea. You can change the way you talk about yourself. It will not happen overnight, and it may take some time, but you can do it. Learn to be kind, gentle, and encouraging to yourself. Start by not saying anything to yourself that you wouldn’t say to your best friend. ",
            "date": "Answered November 23, 2019",
            "views": "104",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ragesh Nair",
                "href": "/profile/Ragesh-Nair-10"
            },
            "answer_text": "Human nature is beyond satisfaction. No man or woman who have continued to satisfy themselves have been satisfied whole of their life. It is like filling emptiness with emptiness. The urge for perfection is the cause of this dissatisfaction. Satisfaction makes one restless which leads to personal disturbance and others suffering. Love can cure a dissatisfied person. Greed is not because of satisfactions, greed is the fear of loosing what one already have. In that fear one continues to accumulate, to show power and grab more power. Greed leads to misery, living a pitiable life. Only experience knowing and understanding can cure greed. ",
            "date": "Updated August 8, 2019",
            "views": "246",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Karl Chwe",
                    "user_href": "/profile/Karl-Chwe-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Werner",
                "href": "/profile/Mark-Werner-4"
            },
            "answer_text": "Assuming you mean “greedy”….. I think it goes back to our evolutionary roots. One of the characteristics of “human nature” is “Acquisitiveness”. This is essentially a survival trait… When our ancestors encountered a rich food source, they tended to exploit it to the maximum extent possible. (Since they often didn’t know where the next source might come along…..) This translates to “more is better”. When agriculture and fixed-place living came along, then ideas of “possessions” (often in the form of foodstuffs) became tied up with status. It’s no secret that many primitive societies had chiefs and leaders who had accumulated more “stuff” than anyone else, and would share this wealth with their favored followers at big “potlatch” feasts. A practice that carries on to the present day…… ",
            "date": "Answered February 9, 2020",
            "views": "61",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mich Chen",
                    "user_href": "/profile/Mich-Chen"
                },
                {
                    "user_id": "Freia Barkou",
                    "user_href": "/profile/Freia-Barkou"
                },
                {
                    "user_id": "Fredrick Nelson",
                    "user_href": "/profile/Fredrick-Nelson-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Faran Bryers",
                "href": "/profile/Faran-Bryers"
            },
            "answer_text": "Yes. Being greedy, to some extent is hugely beneficial to survival for obvious reasons. However, I want to emphasize my previous mention of ‘to some extent’. We are only, generally speaking, greedy to the point where being more so would be self pernicious socially. As I in fact just read the details I would like toad something in addition. Corporate greed, and a general greed for money is widely encouraged, and not frowned upon insofar it is worked for. Therefore with out much fear of social scrutiny, many allow their greed to guide them in the world of business. As the greed doesn’t affect their dearest, but in fact generally brings them benefit, there is little incentive to not be so. ",
            "date": "Answered August 8, 2016",
            "views": "332",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jim Muncy",
                "href": "/profile/Jim-Muncy-3"
            },
            "answer_text": "I think it’s more helpful to consider people to be products of their DNA and environment, so they can be labelled anything, but they can’t change without given cause. This cause could be internal, but if it’s not there, then, of course, it won’t happen. Prisons were once considered reformatories, rehabilitative, or correction facilities. Alas, they are and were mostly confinement centers; Richard Nixon called them “universities for crime.” Nonetheless, if your environment is set-up, consciously or unconsciously, to guide you towards certain behaviors and attitudes, it can work; for example, a Quaker community or a high-crime area will have great influence on its residents. And you never know what’s operating on an individual. A rich kid, for instance, could become a philanthropist or a parricide. His brother, though, could turn out to be his exact opposite: pretty much the same DNA and same environment, but different outcomes. It’s just a convenient shortcut to label one a murderer and one a saint, but neither had a choice about either influencer. ",
            "date": "Answered June 24, 2019",
            "views": "94",
            "upvotes": " Answer requested by Morrie Bourne",
            "upvoters": [
                {
                    "user_id": "Arif Aven Ahmed",
                    "user_href": "/profile/Arif-Aven-Ahmed"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tim Martyn-Jones",
                "href": "/profile/Tim-Martyn-Jones"
            },
            "answer_text": "No, it is human nature to be very greedy & exploit whatever it can for it’s own advantage. In addition, human nature is very short-term in perception and is not concerned about long-term potential consequences resulting from its greediness & exploitation. Only when the consequences are personally immediately catastrophic are they likely to moderate greediness & exploitation - and even then, some members of the human species do not have the capacity to recognise said catastrophic consequences. ",
            "date": "Answered December 21, 2018",
            "views": "72",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "J Brochhausen",
                "href": "/profile/J-Brochhausen"
            },
            "answer_text": "I believe so. Dissatisfaction in status quo is not necessarily a bad thing. That’s why we invent things to make our lives easier. If we had said “Fire is good enough,” we’d never have central heating systems. If we had said “Horse & carriage is good enough,” we’d never have cars or trains. If we had said “Huts are good enough,” we’d never have built skyscrapers. If we had said “Staying on solid land is good enough,” we wouldn’t have airplanes, satellites, nor would we have ever reached out and touched the heavens. Greed for money, is, unfortunately, a by-product of this same desire to improve our status quo, and I think it is an undeniable part of humanity. ",
            "date": "Answered January 27, 2018",
            "views": "229",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Siegfried Braun",
                    "user_href": "/profile/Siegfried-Braun"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Sheldon",
                "href": "/profile/Andrew-Sheldon-3"
            },
            "answer_text": "Humans are raised to believe it's noble to give or consider others. The flip side of this grand gesture that few people live up to is that people have a pretty tragic preconception of humanity. I. E. Original sin in religion or social contract obligation for socialists and even conservatives.It is socially frowned upon to be indifferent to others suffering, and yet people are. I.e.  third world poverty. The flip side is that the selfish market economy is solving poverty in the Third World it's a rapid rate. It's actually falling by 1% per annum. Just 10 years to go, and no one will be living in absolute poverty. That is not the outcome in the West where govt welfare is making people less prepared for life; more reliant on govt and absolute poverty is increasing because of drugs; whilst the costs of living are kept artificially high by govt. ",
            "date": "Answered January 1, 2016",
            "views": "723",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Fredrick Nelson",
                    "user_href": "/profile/Fredrick-Nelson-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anders Wahlberg",
                "href": "/profile/Anders-Wahlberg"
            },
            "answer_text": "We are hunter gatherers - nothing much has changed in us. As gatherers, we spent our time looking for food but never sure how long our food supply would last. Equally, as hunters we were too users from an early time and always looking for a better stone, stick or whatever could be used as a weapon. Men tend to be collectors, women tend to be nest makers. It isn’t always the case but it is in my house! I used to have a great friend in the USA whose sign of in letters and mails was always “I wish you enough”, There is much wisdom in that short sentence. ",
            "date": "Answered November 23, 2019",
            "views": "69",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lourdes M. Cabrera",
                "href": "/profile/Lourdes-M-Cabrera"
            },
            "answer_text": "No, it is not human nature. It acquired. Humans become greedy because his rationality is helping him develop it. Human mind is like a habit. If you want little amount and you get it, the desire expands. The idea that you are getting it always creates desire to overpower human nature. In the end he becomes greedy, unsatisfied. In the long run, it becomes a mental disease unchecked. ",
            "date": "Answered January 31, 2018",
            "views": "77",
            "upvotes": " Answer requested by Fredrick Nelson",
            "upvoters": [
                {
                    "user_id": "Hayden Finch",
                    "user_href": "/profile/Hayden-Finch-2"
                },
                {
                    "user_id": "Judy Parker",
                    "user_href": "/profile/Judy-Parker-61"
                }
            ]
        },
        {
            "author_info": {
                "name": "Noyal David",
                "href": "/profile/Noyal-David"
            },
            "answer_text": "Your teacher has conflated greed with selfishness. The two are not the same. Selfishness is basically thinking about your own self more than others. Greed is the excess of selfishness, where you are willing to harm others for your desires. An animal is selfish because it needs to survive. For eg; Lions hunt deer to keep alive and the deer try their best to escape the lions. But the lions don’t hunt deer once its hunger has been satiated. Ergo, it doesn’t hunt deer for the next day, week, year etc and try o curry favor among its kind this way which would make it greedy. ",
            "date": "Answered November 14, 2016",
            "views": "185",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ben Troyer",
                "href": "/profile/Ben-Troyer"
            },
            "answer_text": "Their is a certain amount of evolutionary precedent for that behavior the one who has it if the others don’t has a large advantage and if they all have it then they all suffer but its still better for the individual to have its what is called a social trap. Tho as you said its a little bit as we are all fine with a little competition when it goes to far we think you are a jackass and we will not include you in more joint opportunities. So essentially its game theory. ",
            "date": "Answered September 13, 2018",
            "views": "40",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Darren Denshaw",
                "href": "/profile/Darren-Denshaw"
            },
            "answer_text": "Don't assume all humans are greedy some of us are not. Some of us are happy with what we have and only take what we need to survive and be comfy. Money can be a real pain in the arse, if I was rich I'd give most of it away helping others that deserved it but I’m not so why worry. ",
            "date": "Answered February 8, 2020",
            "views": "66",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joshua Press",
                "href": "/profile/Joshua-Press-5"
            },
            "answer_text": "Is it greedy for a tree to grow? I see it in terms of potential. We have certain dispositions and interests and many other things that compose who we are. We have a choice to explore that and cultivate it. In doing so, we grow. We express more of who we are and we develop ourself. I believe wanting more is a part of this natural growth. Without wanting more, where is our motivation to grow? I see it more as a tragedy to never cultivate ourselves than a greedy desire. Greed may be selfishness at the expense of others, and concern only for oneself. You can want more without being greedy. ",
            "date": "Answered November 23, 2019",
            "views": "123",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mohammad Gani",
                    "user_href": "/profile/Mohammad-Gani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Monika Da Luz",
                "href": "/profile/Monika-Da-Luz"
            },
            "answer_text": "Not necessarily, but it is our nature to experience. Since we are taught material items are where it’s at, we do not understand what is truly valuable. We settle instead, and as taught, for experiencing “stuff”, fighting for power, and destroying others, along with any chance to really experience that which truly matters. ",
            "date": "Answered January 27, 2018",
            "views": "91",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Devashrut Bharadwaj",
                    "user_href": "/profile/Devashrut-Bharadwaj"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bruce Blay",
                "href": "/profile/Bruce-F-Blay"
            },
            "answer_text": "God does not want you to be poor. You can not help anyone if you are broke. Not even yourself. By being greedy you help fuel the economy and supply jobs that help the poor and advance technology that helps everyone through the free market system. The best way to help the poor is with a job. Then they won’t be poor anymore. The worst way to help the poor is to do it through the government because they steal from everyone making everyone poor to where we can help no one. Government only helps itself. Money is not evil. The love of money is. Never love money. It is a tool and handy to have when you need it. ",
            "date": "Answered November 23, 2019",
            "views": "76",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Emma Skinner",
                    "user_href": "/profile/Emma-Skinner-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dániel Kőszegi",
                "href": "/profile/Dániel-Kőszegi"
            },
            "answer_text": "No. It is greedy to have more at the expense of others. Otherwise it is completely fine and an important part of your evolution. This is how you evolved from sperm to a grown-up. ",
            "date": "Answered November 23, 2019",
            "views": "34",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Azat Ogulmus",
                    "user_href": "/profile/Azat-Ogulmus-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Henry de Graaf",
                "href": "/profile/Henry-de-Graaf-1"
            },
            "answer_text": "Not to me. If we eat more than we should, or drink, or buy a dozen cars or take over a country for its resources, we are being greedy. It is not healthy for the consumer or for the people in need who suffer for the sake of the grabbers. ",
            "date": "Answered November 1, 2016",
            "views": "384",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Raga Manjusha",
                    "user_href": "/profile/Raga-Manjusha"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Haakenson",
                "href": "/profile/Eric-Haakenson"
            },
            "answer_text": "From birth we demand and we receive. It's a training. It starts out of necessity. But parents need to teach responsibility. That effort is required to receive. If that is not taught. The natural selfish nature will continue into adulthood. ",
            "date": "Answered February 11, 2020",
            "views": "21",
            "upvotes": " Answer requested by Aidan Riker",
            "upvoters": [
                {
                    "user_id": "Bruce Blay",
                    "user_href": "/profile/Bruce-F-Blay"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thomas Mattison",
                "href": "/profile/Thomas-Mattison-1"
            },
            "answer_text": "Greedy is a name given to the trait of collecting things above and beyond the actual need of the moment. Collecting things is a normative behavior for the species. Typically the word greedy implies extreme levels of an otherwise normative behavior pattern. So it can be considered a dysfunction of a natural function. ",
            "date": "Answered November 23, 2019",
            "views": "57",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gloria Cole",
                "href": "/profile/Gloria-Cole-1"
            },
            "answer_text": "Maybe its not greed. Maybe its wanting the brass ring - a slice of the pie - just living life to the fullest and insisting that I get my share. I don’t think that’s greed. Its standing up for myself. ",
            "date": "Answered June 23, 2019",
            "views": "42",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Mary Luss",
                "href": "/profile/Mary-Luss"
            },
            "answer_text": "Yes it is, note that human beings just like other animals at our core strive to survive and pass on our genes to our offspring, so being greedy ensures you have resources to survive and to take care of your children there’s nothing odd about being a little greedy as long as you help others whenever you are able ",
            "date": "Answered September 11, 2018",
            "views": "61",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Patrycja Ch",
                "href": "/profile/Patrycja-Ch-1"
            },
            "answer_text": "Greed comes from imbalance. Energetically speaking, if someone is greedy, first chakra might be too active. That is a very common phenomenon. You can also answer that trauma is the cause. Not getting enough love and attenction in the early years. If you start to live with higher vibrations, greed subsides. ",
            "date": "Answered February 8, 2020",
            "views": "40",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William Ranger",
                "href": "/profile/William-Ranger-1"
            },
            "answer_text": "Humans contain all the tendencies. Which one are emphasized, providing there is no organic damage, depends of many factors. Greed can be strong, or can be balanced with wise helping. The emphases are not hardwired. They can be changed. ",
            "date": "Answered May 30, 2016",
            "views": "256",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Marcus Lester",
                "href": "/profile/Marcus-Lester-2"
            },
            "answer_text": "Wanting more, in the sense of being unsatisfied, is the definition of greed. Wanting more, in the sense of, say, another breath or the next meal, the needs of life, this is not greed. ",
            "date": "Answered November 23, 2019",
            "views": "44",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Ned Harrison",
                "href": "/profile/Ned-Harrison-3"
            },
            "answer_text": "Yes. Human evolved in an environment of scarcity; greed is the primate’s way of overcoming that. Social pressures may either encourage or discourage this, depending on group dynamics; but it’s perfectly natural. ",
            "date": "Answered August 11, 2016",
            "views": "152",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Siegfried Braun",
                "href": "/profile/Siegfried-Braun"
            },
            "answer_text": "Would it have been “greedy” to have accumulated a couple million and to find out that you or a family member need millions of dollars worth of life-saving treatment? Or how about a disaster strikes and you have the wherewithal to help because you were “greedy”? ",
            "date": "Answered November 23, 2019",
            "views": "31",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Michael Frazier",
                "href": "/profile/Michael-Frazier-80"
            },
            "answer_text": "We all want more, its part of the survival stradigy that is part of our DNA. TO SAY YOU HAVE ENOUGH IS SPIRITUAL. ",
            "date": "Answered November 23, 2019",
            "views": "37",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bode Bliss",
                "href": "/profile/Bode-Bliss"
            },
            "answer_text": "No, that’s a learned skill! Mother Teresa , Gandhi, Martin Luther King, Soldiers in war in reference to their fellow soldiers are all example of selfless sacrifice! ",
            "date": "Answered January 27, 2018",
            "views": "87",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Larry Walden",
                "href": "/profile/Larry-Walden-3"
            },
            "answer_text": "Human beings are sinners by nature. Greed is one of their many sins. ",
            "date": "Answered June 24, 2019",
            "views": "12",
            "upvotes": " Answer requested by Morrie Bourne"
        },
        {
            "author_info": {
                "name": "Gerald McDonald",
                "href": "/profile/Gerald-McDonald-6"
            },
            "answer_text": "They have not learned to truly love, (they love selfishly). And they do not trust what they can not love. Or can not love what they do not trust. ",
            "date": "Answered February 15, 2020",
            "views": "18",
            "upvotes": " Answer requested by Aidan Riker"
        },
        {
            "author_info": {
                "name": "Jeremy Pitts",
                "href": "/profile/Jeremy-Pitts-2"
            },
            "answer_text": "yes! ",
            "date": "Answered June 9, 2016",
            "views": "22",
            "upvotes": "0"
        }
    ]
}