{
    "title": "Are the philosophies in True Detective self-reflective? - Quora",
    "tags": [
        "Nic Pizzolatto",
        "Thomas Ligotti",
        "David Benatar (Philosopher)",
        "True Detective Season 1",
        "Antinatalism",
        "True Detective (TV series)",
        "Nihilism",
        "Pessimism",
        "Friedrich Nietzsche (philosopher, author)",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Emilio Cecconi",
                "href": "/profile/Emilio-Cecconi"
            },
            "answer_text": "In the first season of True Detective Matthew McConaughey plays the role of Rust Cohle, a man who struggles to find meaning in his life after the death of his young daughter.  He starts the season off as a pessimist who's fully devoted to solving the serial murders of a few women in a small Louisiana town.  If he had any shot of finding meaning in his life, it seems like he lost it when he had a one time tryst with his partner's wife.  Who knows what he was like for years later, he was probably drowning in meaninglessness and drunk as much as possible. For the rest of the season, it seems like Rust is convinced that solving the serial killer mystery is what's going to eventually bring meaning back into his life.  After they catch the serial killer, at the end of the season, what he realizes is what gives his life meaning isn't anything rational or in this world.  It's the belief that one day, he'll be reunited with his daughter after he dies. Beliefs don't have to be justifiable or real for them to give a person meaning in life.  It's this realization that brings him out of the depths of pessimism ready to face the world again. ",
            "date": "Answered October 5, 2015",
            "views": "11",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Andrei Vasilachi",
                    "user_href": "/profile/Andrei-Vasilachi-3"
                },
                {
                    "user_id": "Michael Craig",
                    "user_href": "/profile/Michael-Craig-6"
                },
                {
                    "user_id": "Omelian Levkovych",
                    "user_href": "/profile/Omelian-Levkovych"
                },
                {
                    "user_id": "Simranjit Singh",
                    "user_href": "/profile/Simranjit-Singh-202"
                },
                {
                    "user_id": "Jarret Hendrickson",
                    "user_href": "/profile/Jarret-Hendrickson"
                },
                {
                    "user_id": "Pat Sonti",
                    "user_href": "/profile/Pat-Sonti"
                },
                {
                    "user_id": "Jonathan Brill",
                    "user_href": "/profile/Jonathan-Brill"
                },
                {
                    "user_id": "Elizabeth Wohlauer",
                    "user_href": "/profile/Elizabeth-Wohlauer"
                }
            ]
        }
    ]
}