{
    "title": "Are there an infinite number of multiverses? - Quora",
    "tags": [
        "Parallel Universes",
        "Multiverse",
        "Infinity (mathematics)",
        "The Universe",
        "Cosmology",
        "Hypothetical Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andy Fletcher",
                "href": "/profile/Andy-Fletcher-37"
            },
            "answer_text": "Sure! Why not! They’re all imaginary anyway, so rather than just an infinite number of imaginary universes making up one multiverse, let’s have an infinite number of imaginary multiverses, each made up of an infinite number of imaginary universes! A multiverse of multiverses! And maybe there’s an infinite number of those, too! And of those! That’s why the whole multiverse thing is silly. No compelling evidence for even one single solitary other universe will ever be found, so we’re just making crap up. We can’t even see the overwhelmingly vast majority of this universe, which might be infinite, but we’ll never know that, either. I can’t even see the back of my own head! And besides that, the three theories that suggest other universes might exist aren’t true yet, either, and recent work on each suggests that other universes might not even logically follow from those theories, should they prove to be true. BTW, that’s String Theory (not true yet), Inflation (no evidence yet), and the Many Worlds Hypothesis of QM (which is just wild speculation). So, no. ",
            "date": "Answered December 19, 2018",
            "views": "453",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "János Szűcs",
                    "user_href": "/profile/János-Szűcs-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan B Cooley",
                "href": "/profile/Dan-B-Cooley"
            },
            "answer_text": "Are there an infinite number of multiverses? Thanks for asking. At present, other universes cannot be detected by human science so the multiverse remains a a subject of science fiction. Don’t let that dissuade you though. Science fiction writers have been right many times in the past so it is not unreasonable to think they could be right about other universes. (I’m using “multiverse” in the sense of comprising numerous universes such as ours. I think there could be an infinite number of universes in the multiverse but I don’t know about infinite multiverses). Here are a few science fiction writers who deal with the multiverse: 1 The Eternal Champion series By Michael Moorcock. 2 In War Times By Kathleen Goonan. 3 Brasyl By Ian McDonald. 4 The man in the High Castle By Philip K. Dick. 5 Keeping It Real By Justina Robson. 6 Cascade Point By Timothy Zahn. 7 The Coming of the Quantum Cats By Frederik Pohl 8 His Dark Materials By Philip Pullman 9 The Number of the Beast By Robert A. Heinlein 10 Alternities By Michael P. Kube-McDowell 11 Amber series By Roger Zelazny 12 The Dark Tower By Stephen King ",
            "date": "Updated September 9, 2020",
            "views": "184",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "János Szűcs",
                    "user_href": "/profile/János-Szűcs-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Colbourne",
                "href": "/profile/Stephen-Colbourne"
            },
            "answer_text": "The reason for the concept of the multiverse is to explain why the rules and constants of this universe are so suited to intelligent life. If they were not , there would be no one to ask this question. There could be just one universe and we were really lucky. Alternatively the assumption is that every possible universe exists (conceptually at least) and can be defined mathematically. (This must be true) Now the magical part is that somehow just by having the definition it would be possible to extrapolate out, to the point that life can be created. (Also true) The part we do not understand is how consciousness came about, and someone living in the universe can experience it. If consciousness can be defined mathematically, it means that we are all just the result of an equation, which could be repeated many times independently of space and time if desired. There is no limit to how many universes can be defined, so there will be an infinite number of “universes”, but only a small percentage will have rules that allow life. ",
            "date": "Answered December 26, 2018",
            "views": "126",
            "upvotes": " Answer requested by Denise Hodgden"
        },
        {
            "author_info": {
                "name": "Charles A. Veilleux",
                "href": "/profile/Charles-A-Veilleux"
            },
            "answer_text": "Many different parts of the universes bears different universe names, they are not parallel but all circling around paradise There is Havona in the center then further out and including Havona there is the central universe, If you extend further out you find the grand universe comprising the Milky Way as well as 6 other similar aggregations of matter circling around Paradise. Further out and including all of the above there is the master universe comprising 4 outer spaces zones where untold number of galaxies are being initiated and developed and one day will be stabilized before establishing new life. I could greatly help. ",
            "date": "Answered December 20, 2018",
            "views": "119",
            "upvotes": " Answer requested by Denise Hodgden"
        },
        {
            "author_info": {
                "name": "János Szűcs",
                "href": "/profile/János-Szűcs-1"
            },
            "answer_text": "It is just a theory which cannot be proven or disproven. Think of it: if You wanted to prove it, You should travel infinite number of multiverses or find an experimental result which could be explain only by accepting the existence of infinite number of multiverses. There is no such experimental fact, nor we know about a single other universe than ours. So why should we believe, would it solve any current problem? I don’t think so. ",
            "date": "Answered December 20, 2018",
            "views": "95",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brian Downey",
                "href": "/profile/Brian-Downey-8"
            },
            "answer_text": "At this point its mere speculation there is even one other than ours…let alone an infinite number. I let others speculate. ",
            "date": "Answered December 20, 2018",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Fred Gray",
                "href": "/profile/Fred-Gray-14"
            },
            "answer_text": "NO ",
            "date": "Answered August 30, 2019",
            "views": "46",
            "upvotes": " Answer requested by Denise Hodgden"
        }
    ]
}