{
    "title": "Are there instances when truth does not benefit those who learn it? - Quora",
    "tags": [
        "Harsh Truth",
        "Truth",
        "Learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jack Raymond Borden",
                "href": "/profile/Jack-Raymond-Borden-1"
            },
            "answer_text": "When it came to the subject of the truth, Friedrich Nietzsche had this to say on it: “The strength of a person's spirit would then be measured by how much 'truth' he could tolerate, or more precisely, to what extent he needs to have it diluted, disguised, sweetened, muted, falsified.” What Nietzsche is correctly pointing out here is that people aren’t equal in strength, and that some people are better able to handle the truth more than others as a consequence of that. This is an important insight since it reveals to us that if you feed a weak person too much of the truth in its purest form, it will destroy them. Now that we’ve covered Nietzsche’s correct insight on this question, I want you to hold that insight in the back of your head as I bring up another insight from the field of psychology. Since Psychology was founded in the 19th century, many different fields of therapy have arisen to combat psychological illness. While the techniques and the focus of these therapies differ from one another, they are all similar in the sense that they are all variations of the phrase, “Know the truth, and the truth will set you free”. This insight from the field of psychology is important because it reveals to us that most psychological and mental issues can be cured by bringing your thinking, emotions, perceptions, beliefs, and values into a greater alignment with the truth. Since humans are so different from one another, the way in which we heal from the truth varies from person to person. Therefore it is important that people are exposed to the right expression of the truth that will help them grow. So to answer your question the truth is always more beneficial than a lie, but not all ways of speaking the truth to somebody is beneficial. ",
            "date": "Answered October 29, 2020",
            "views": "49",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Margaret Weiss",
                "href": "/profile/Margo-Weiss-1"
            },
            "answer_text": "Truth is truth - it’s the way things are, and just like everything else, it only makes a difference from one’s point of view about it. Sun is shining, whether it’s good or bad is irrelevant, it’s the truth and it exists regardless of how we think about it (unless it’s that joke about a politician recommending to land on the Sun at night, when it’s not that hot). Truth is a fact, and it will either benefit or hurt someone depending on what that person imagined the reality to be and how well that imaginary reality is aligned with the fact: if they match, that’s perfect, if they don’t match but the person is able to adjust to it, then they can still make it work. And if those realities don’t match and the person is unable to adjust (unable or outright refusing), then chances are that the truth will hurt them. There are also instances where people either know or suspect the truth, yet due to the immense pain (emotional, physical, or financial) they believe they are better off pretending that truth does not exist - that’s their choice (akin conditions such as selective hearing). Any one of us can be handed a life-changing event tomorrow - what we do with that event and how we react to it will determine whether we will be impacted by it in a positive or a negative way. It’s really a choice. ",
            "date": "Answered September 14, 2018",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nguyen Phi Yen",
                    "user_href": "/profile/Nguyen-Phi-Yen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Morton Kurzweil",
                "href": "/profile/Morton-Kurzweil"
            },
            "answer_text": "Truth has nothing to do with learning. Truth is truth whether we learn it or believe it or deny it. Reality is the truth that will benefit our survival. We learn from our mistakes or we fail by ignoring the results. We accept bad habits because we find patterns of behavior more efficient until they cause pain or damage. Good or bad, right or wrong, true or false; either answer can be true. ",
            "date": "Answered September 9, 2018",
            "views": "360",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Blake Senftner",
                    "user_href": "/profile/Blake-Senftner"
                }
            ]
        },
        {
            "author_info": {
                "name": "Blake Senftner",
                "href": "/profile/Blake-Senftner"
            },
            "answer_text": "Of course! Hypothetical situation: captive person learns they are to be executed. Hypothetical situation: criminal learns they are betrayed, learns they are compromised, or otherwise learns their criminal livelihood has been exposed to the authorities. Hypothetical situation: politician learns they have lost their election. Hypothetical situation: boyfriend/girlfriend learns their significant other wants to break up, but not why. Hypothetical situation: watching TV you learn about the mating habits of penguins. The possible situations are endless. ",
            "date": "Answered September 9, 2018",
            "views": "563",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard O. Colestock",
                "href": "/profile/Richard-O-Dick-Colestock"
            },
            "answer_text": "Yes, of course. Any true expert in any field you care to mention can spend hours telling me chapter and verse about their specialty - an experience of no benefit and of no interest to me whatsoever. Too much truth is as bad as too little truth. See the Goldilock’s Zone when handling truth. ",
            "date": "Answered September 9, 2018",
            "views": "363",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                },
                {
                    "user_id": "Angele Roy",
                    "user_href": "/profile/Angele-Roy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Elliott Churchman",
                "href": "/profile/Mark-Elliott-Churchman"
            },
            "answer_text": "Certainly, when those that are profiting from the demise of others has realization they may feel some amount of guilt. In that case an overhaul of their protocol could be worthy of their invention. This will be best performed when the moment of epiphany is gracing them with appropriate desire and self indignation allowing an about face…. ",
            "date": "Answered August 5, 2018",
            "views": "366",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jeanewt",
                    "user_href": "/profile/Jeanewt"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dominic Novielli",
                "href": "/profile/Dominic-Novielli"
            },
            "answer_text": "Anyone who really “learns it “ benefits. Always. It is the fundament of Common Reality. This definition is holistic - learning entails incorporation into one’s life. For someone who merely “learns ‘about it ‘ “, there is rarely any value whatsoever. ",
            "date": "Answered September 9, 2018",
            "views": "298",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Celso Pereira Neto",
                    "user_href": "/profile/Celso-Pereira-Neto"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jacques Frinchaboy",
                "href": "/profile/Jacques-Frinchaboy"
            },
            "answer_text": "Yes. For example in any case where the recipient is not prepared to accept it , the truth, or when the truth may negatively affect a fragile mind. ",
            "date": "Answered September 13, 2018",
            "views": "151",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Glen Mick",
                "href": "/profile/Glen-Mick"
            },
            "answer_text": "It happens repeatedly when not to ones advantage. Mick ",
            "date": "Answered August 5, 2018",
            "views": "184",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tommy Seeker",
                "href": "/profile/Tommy-Seeker"
            },
            "answer_text": "Only those who will not or cannot accept it. ",
            "date": "Answered August 7, 2018",
            "views": "128",
            "upvotes": "0"
        }
    ]
}