{
    "title": "Are we getting closer to the end of the human species? - Quora",
    "tags": [
        "Human Species",
        "Human Extinction"
    ],
    "response": [
        {
            "author_info": {
                "name": "Doug Stevenson",
                "href": "/profile/Doug-Stevenson-30"
            },
            "answer_text": "No challenge to the good heart, but a challenge to the MOTHER parent with a child. No parent truly desires to outlive their own children or child. Some invoke the call of the WOLF, saying this is breeding season. Caring for the care of the child seems an idea most would gladly walk away from. Single parent is becoming a normality. YET the truth remains . Adoption is considered NEVER. Abandoned children litter this Earth worse than garbage bags. The killing squads still exist in places like Brazil, and yes they thrive even in these dull years. Can you call your own self human, when children are being hunted, and then you DARE to say is humanity safe.. AT THIS Time humanity is being adjusted. Covid19. Kill off the old and the weak. This shall amplify for years to come. Noticed over 40 years ago when HIV/AIDS arrived. This virus brings death to a select few. When invented (by nature) . Too much sex and too much population and too much free love. The list could expand. Tammy Fay Baker and her religious husband in Florida, (place of oranges anyway) were content. “god has come down to this earth to smite all gays.” The end result was they died and then so did god. From helping god to god the destroyer. Removing god the mythical has become easy. Even the church has gotten into the act. Here in Canada over 400 priests were sent to jail for raping children in orphanages and in boarding schools. They took that charge from Canada and threw that into the face of the then Pope. Actual crocodile tears from the pope of rome. What respect is the servant of god if destruction of children is the desire of god. From the time of the 1950s. The suburban wife changed. They read one book. “The valley of the dolls”. ON mass the world found families divorcing. This is a HIGHER THAN HIGH MASS over and above what any church could consider. To led us to this question , end of the species. Many nations then did a thing. Stop the birth of females. Entire nations took this platitude as truth. Then only men were born, but instead of just not birthing, the males became insane with no one to play with. Males indignant even took to mass scale rape of woman and yes even some weak man would also suffer. Arrogance thrived and war and war and war became the choice. As if by a drum beating out a chant of ownership of men and mankind. (actual was to send them all to war just to die). War and war and war. That country is too small, but kill them anyway. You have reached mental aberration of a human species. Roll the dice and try again. I am 69 and i have the mental record of my own reality which was the unglossy photo report. Can’t believe this or that so find out. The Seattle dock when the ships arrived and the hold of those ships opened and black bags covered wharf after dock and non stop the trucks arrive to take the black corpse bags away. I turned away . “THIS IS SICK and these people are sick, and even this entire country is sick. Take me now home to Canada”. To see that entire site would truly overwhelm your own mind ; and for decades to come. I am psychic so the idea held on until we reached Canada again. This is how your civilization deals with over population. Butcher each other for no reasonable need. Vietnam and Hanoi SMASHED and defeated the United States. horror of horror. The Meylai Massacre Why was the my Lai massacre significant to history? The My Lai massacre was one of the most horrific incidents of violence committed against unarmed civilians during the Vietnam War. A company of American soldiers brutally killed most of the people—women, children and old men—in the village of My Lai on March 16, 1968. My Lai Massacre - Definition, Facts & Causes - HISTORY My Lai Massacre   you asked about humanity and this iswhat humanitycaan do when allowed to war.  the resspect of a world is lost forever.  ",
            "date": "Answered August 17, 2020",
            "views": "453",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vinay Kumar",
                    "user_href": "/profile/Vinay-Kumar-107"
                },
                {
                    "user_id": "Alexandru Andercou",
                    "user_href": "/profile/Alexandru-Andercou-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kenechi Okoli",
                "href": "/profile/Kenechi-Okoli"
            },
            "answer_text": "Maybe. But your bigger concern should be the end of you as an individual, not the species. Different people believe different things in regards to death of course. Muslims believe one way, Hindus another, etc. Atheists believe you die and there’s probably nothing else. Physicists say the universe ends in a heat death or big rip. The big bounce hypothesis is generally not seen as tenable. Don’t worry about the end of the human species. Ask yourself the hard questions concerning your own soon-to-be demise. JON STEWART: So where do we go when we die? DAWKINS: Bertrand Russell—well— STEWART: So you don’t know? DAWKINS: Well, we either get buried or cremated. Or we give our bodies to science. Bertrand Russell said— STEWART: But you actually don’t know what happens to us? DAWKINS: I don’t know what happens to us, but I know that our consciousness is wrapped up in our brains. I know that our brains rot. Exclusive - Richard Dawkins Extended Interview Pt. 3 - The Daily Show with Jon Stewart (Video Clip) | Comedy Central Dawkins doesn’t believe in a Creator/God, he doesn’t believe there’s objective morality, and doesn’t believe there’s any such thing as judgment or life after death. I encourage you to not jump on the Dawkins bandwagon. We don’t have much time here. Seek to know who God is and why we’re here, while you still can. Today may be your last on the planet (or mine), while the human species continues as if nothing happened. ",
            "date": "Answered August 29, 2020",
            "views": "618",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Steve Martin",
                    "user_href": "/profile/Steve-Martin-325"
                },
                {
                    "user_id": "Cheryl Barnes",
                    "user_href": "/profile/Cheryl-Barnes-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Arjuna",
                "href": "/profile/James-Arjuna-1"
            },
            "answer_text": "Yes. According to the extremely rapid rise of genetic diseases in the last 110 years from infected sex, causing massive germ line mutations, we have less than 100 years before extinction. The only thing that would stop this is for people to stop spreading STD’s like insane morons. Viral STD’s have this thing where they enter the cells of human zygotes and change the DNA at the most permanent level. The statistics on the rise of genetic diseases is so clear on this. 30,000% rise in childhood cancer is one of the most disturbing statistics in less than 110 years. From obscure to the number one cause of death by disease. Second is genetic deformity of organs, third is congenital heart disease and that is up by 200% in less than 34 years. All of these statistics are available to anyone who wants to know. The fastest rising cancer in the USA is unborn babies with spinal and brain cancerous tumors. Can’t even get born without cancer in the womb. It used to be that cancer was an old age disease and NEVER was found in children. Autoimmune diseases are rampant now. Diabetes is up 600% in less than 40 years. 1 in 9 babies are born now with serious genetic diseases requiring life long treatments and their lives are shorter and more miserable. It is not good. All we have to do is stop infecting our zygotes with mutagenic pathogens. ",
            "date": "Answered October 28, 2020",
            "views": "10",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Tammie Jo Clifford",
                    "user_href": "/profile/Tammie-Jo-Clifford"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Abrams",
                "href": "/profile/John-Abrams-6"
            },
            "answer_text": "Are we getting closer to the end of the human species? Absolutely. 1 Corinthians 15 35 But someone will ask, “How are the dead raised? With what kind of body do they come?” 36 You foolish person! What you sow does not come to life unless it dies. 37 And what you sow is not the body that is to be, but a bare kernel, perhaps of wheat or of some other grain. 38 But God gives it a body as he has chosen, and to each kind of seed its own body. 39 For not all flesh is the same, but there is one kind for humans, another for animals, another for birds, and another for fish. 40 There are heavenly bodies and earthly bodies, but the glory of the heavenly is of one kind, and the glory of the earthly is of another. 41 There is one glory of the sun, and another glory of the moon, and another glory of the stars; for star differs from star in glory. 42 So is it with the resurrection of the dead. What is sown is perishable; what is raised is imperishable. 43 It is sown in dishonor; it is raised in glory. It is sown in weakness; it is raised in power. 44 It is sown a natural body; it is raised a spiritual body. If there is a natural body, there is also a spiritual body. 45 Thus it is written, “The first man Adam became a living being”;[e] the last Adam became a life-giving spirit. 46 But it is not the spiritual that is first but the natural, and then the spiritual. 47 The first man was from the earth, a man of dust; the second man is from heaven. 48 As was the man of dust, so also are those who are of the dust, and as is the man of heaven, so also are those who are of heaven. 49 Just as we have borne the image of the man of dust, we shall[f] also bear the image of the man of heaven. Mystery and Victory 50 I tell you this, brothers: flesh and blood cannot inherit the kingdom of God, nor does the perishable inherit the imperishable. 51 Behold! I tell you a mystery. We shall not all sleep, but we shall all be changed, 52 in a moment, in the twinkling of an eye, at the last trumpet. For the trumpet will sound, and the dead will be raised imperishable, and we shall be changed. 53 For this perishable body must put on the imperishable, and this mortal body must put on immortality. 54 When the perishable puts on the imperishable, and the mortal puts on immortality, then shall come to pass the saying that is written: “Death is swallowed up in victory.” 55 “O death, where is your victory? O death, where is your sting?” 56 The sting of death is sin, and the power of sin is the law. 57 But thanks be to God, who gives us the victory through our Lord Jesus Christ. 58 Therefore, my beloved brothers, be steadfast, immovable, always abounding in the work of the Lord, knowing that in the Lord your labor is not in vain. When Jesus Christ come with all the armies of Heaven to rule the Earth as King from Jerusalem all of the resurrected and living saints will be changed into immortal children of God. And later after the Millennium all the saved will likewise be changed while the rest - the unrepentant human mortals/sinners - will be burned to ashes and cease to exist. So yes, every day we are getting closer to the end of the human species and closer to the God species. ",
            "date": "Answered September 30, 2020",
            "views": "13",
            "upvotes": " Answer requested by Sandeep Patil",
            "upvoters": [
                {
                    "user_id": "Alexandru Andercou",
                    "user_href": "/profile/Alexandru-Andercou-1"
                },
                {
                    "user_id": "Doug Stevenson",
                    "user_href": "/profile/Doug-Stevenson-30"
                },
                {
                    "user_id": "Vlado Zadrapa",
                    "user_href": "/profile/Vlado-Zadrapa"
                },
                {
                    "user_id": "Dave Amordë",
                    "user_href": "/profile/Dave-Amordë"
                },
                {
                    "user_id": "David Dennis",
                    "user_href": "/profile/David-Dennis-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Rommel",
                "href": "/profile/Mike-Rommel"
            },
            "answer_text": "A2A Are we getting closer to the end of the human species? No, in fact there we will not wipe ourselves out on this planet. The Bible tells us how it will all play out in the end. Part of this will be a 1000 year reign by Christ to show us how we could have done much better with the resources here on this earth. A big factor in that is Satan himself will be chained up during that time and not able to influence corruption as he is doing now. Revelation 20:1-7 ESV Then I saw an angel coming down from heaven, holding in his hand the key to the bottomless pit and a great chain. And he seized the dragon, that ancient serpent, who is the devil and Satan, and bound him for a thousand years, and threw him into the pit, and shut it and sealed it over him, so that he might not deceive the nations any longer, until the thousand years were ended. After that he must be released for a little while. Then I saw thrones, and seated on them were those to whom the authority to judge was committed. Also I saw the souls of those who had been beheaded for the testimony of Jesus and for the word of God, and those who had not worshiped the beast or its image and had not received its mark on their foreheads or their hands. They came to life and reigned with Christ for a thousand years. The rest of the dead did not come to life until the thousand years were ended. This is the first resurrection. ... ",
            "date": "Answered September 28, 2020",
            "views": "13",
            "upvotes": " Answer requested by Sandeep Patil",
            "upvoters": [
                {
                    "user_id": "Lennart Regebro",
                    "user_href": "/profile/Lennart-Regebro-1"
                },
                {
                    "user_id": "Steve Martin",
                    "user_href": "/profile/Steve-Martin-325"
                },
                {
                    "user_id": "Alexandru Andercou",
                    "user_href": "/profile/Alexandru-Andercou-1"
                },
                {
                    "user_id": "Ken Eatherly",
                    "user_href": "/profile/Ken-Eatherly-1"
                },
                {
                    "user_id": "Vinay Kumar",
                    "user_href": "/profile/Vinay-Kumar-107"
                },
                {
                    "user_id": "Randy Radcliff",
                    "user_href": "/profile/Randy-Radcliff"
                },
                {
                    "user_id": "Edwin Trinh",
                    "user_href": "/profile/Edwin-Trinh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Julian Farrington",
                "href": "/profile/Julian-Farrington"
            },
            "answer_text": "I don’t think we’re getting close to the end of the human species… though it may depend on what you mean by ‘close’. I’m a Christian, and I understand that there will be a 1000 year reign of Christ on earth when he comes back, and there will still be humans reproducing on the earth (not in New Jerusalem because there will be no marriage in heaven). So I think the human species will be around for about that long at least. The Bible says that when Jesus returns we will be given new bodies. I don’t know if we’d still classify ourselves as ‘human beings’ at that point… who knows? Ultimately, we’re a spirit and we will be given new spiritual bodies (whatever that means!) Of course, before Jesus returns there is going to be widespread destruction and persecution of people of faith all over the world. Jesus said it would be the worst time in all of human history. The population of the human race will be greatly diminished. If you’re interested in learning more about what will come on a prophetic level before Jesus returns, I’d recommend this video which I have found personally helpful: What Needs to Happen Before the End of the World? ",
            "date": "Answered September 28, 2020",
            "views": "18",
            "upvotes": " Answer requested by Sandeep Patil",
            "upvoters": [
                {
                    "user_id": "Sullivan Ouellette",
                    "user_href": "/profile/Sullivan-Ouellette"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Brunfeldt",
                "href": "/profile/Dave-Brunfeldt"
            },
            "answer_text": "The assumption is that the human species is finite in its existence. At some time in the future, humans will no longer be around. So yes, we are nearing the end of humanity. 20 years or 20 million years, who knows? Time parameterizes everything. And nothing ever stays the same, either. So, in some future period of time, humans will be different. At what point will humans be so different that they are no longer humans? Extrapolating into the future is fraught with error. Just 200 years ago, people might have predicted this pandemic we are in today, but they wouldn’t have predicted this communication device I am using right now. 1820 prediction of online learning? I don’t think so. How about the alternative to the end of humanity? Your question would be: Will humanity never end? The answer is that “never” is a long time and eventually, humans will not be the same as today, or even exist at all. I think the answer to your question is that there is no evidence that anything will last forever. So of course, humanity will end. That will happen in the future, and we are getting closer to that time. ",
            "date": "Answered September 12, 2020",
            "views": "58",
            "upvotes": " Answer requested by Sandeep Patil",
            "upvoters": [
                {
                    "user_id": "Steve Martin",
                    "user_href": "/profile/Steve-Martin-325"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leta Rosetree",
                "href": "/profile/Leta-Rosetree-1"
            },
            "answer_text": "We in the middle of what is being called the ‘sixth extinction.’ When I was a climate protestor in the 1970s, we were ridiculed, assaulted, and scorned. What more evidence do you need than what is happening in the natural world around us? Species going extinct, global warming, weather catastrophes, and pandemics….WAKE UP, people. According to <yale.edu>global extinction rates, “In June 2019 one million species of plants and animals were at risk of extinction. At least 571 species are lost since 1750 but likely many more. The main cause of the extinctions is the destruction of natural habitats by human activities, such as cutting down forests and converting land into fields for farming.” An ominous indication is the destruction of the Amazon rainforest, environmentally recognised as a major part of planet’s lungs. ",
            "date": "Updated August 8, 2020",
            "views": "220",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeff Collings",
                    "user_href": "/profile/Jeff-Collings"
                },
                {
                    "user_id": "Veronique Helmridge-Marsillian",
                    "user_href": "/profile/Veronique-Helmridge-Marsillian"
                }
            ]
        },
        {
            "author_info": {
                "name": "Walter Smyth",
                "href": "/profile/Walter-Smyth"
            },
            "answer_text": "Yes. Because of destructive human activities towards the environment, it is very likely humans will be gone in the next 100 years. Many scientists have been warning humanity their activities are destroying the environment, but they really don’t care: Paul Ehrlich: 'Collapse of civilisation is a near certainty within decades' Humans just 0.01% of all life but have destroyed 83% of wild mammals – study Every month animal species become extinct because of humans: Animals are going extinct 'at fastest rate since death of the dinosaurs' The rain forests are disappearing at a rapid rate:  Rubbish increasing:  Air pollution:  Animals becoming extinct: Heading for extinction like all large mammals:  And then it will be the turn of humanity:  ",
            "date": "Answered August 6, 2020",
            "views": "354",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lennart Regebro",
                    "user_href": "/profile/Lennart-Regebro-1"
                },
                {
                    "user_id": "Ted Roberson",
                    "user_href": "/profile/Ted-Roberson"
                },
                {
                    "user_id": "Alexandru Andercou",
                    "user_href": "/profile/Alexandru-Andercou-1"
                },
                {
                    "user_id": "Howard Brazee",
                    "user_href": "/profile/Howard-Brazee"
                },
                {
                    "user_id": "Angel Vasilev",
                    "user_href": "/profile/Angel-Vasilev-4"
                },
                {
                    "user_id": "Roy Wilson",
                    "user_href": "/profile/Roy-Wilson-186"
                },
                {
                    "user_id": "Amer El-Hage",
                    "user_href": "/profile/Amer-El-Hage"
                },
                {
                    "user_id": "Cutter-John C. Williams",
                    "user_href": "/profile/Cutter-John-C-Williams"
                },
                {
                    "user_id": "Deah Mcneill",
                    "user_href": "/profile/Deah-Mcneill-3"
                },
                {
                    "user_id": "Kazi Rahman",
                    "user_href": "/profile/Kazi-Rahman-65"
                },
                {
                    "user_id": "Ilya Taytslin",
                    "user_href": "/profile/Ilya-Taytslin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Gatten",
                "href": "/profile/Bill-Gatten"
            },
            "answer_text": "No. Because we are members of two realities, the implicate and the explicate. And although we will one day be abletocoscioulys alternate between them at will, we are currently bound to our material reality and only enter the spiritual aspect of our “beingness” when we give-up our mortality at the time of death. In other words, humans don’t die, and could not do so even if we wanted to. Only our physical forms wear out and become useless to us in our material state of existence, at which point our undying spiritual essence is physicality imbued in another forming human life form. The real essence of whom we truly are continues to serially re-occupy one mortal form after another (reincarnating) until such time as our local persona has experienced all of its mortal obligations and the intellectual and social evolution of humanity is at last able to experience total and eternal Bliss (‘a state referred to as “Moksha” by Hindis, Buddhists and Jains). “Moksha” is a reference to freedom from samsara (i.e., liberation from ignorance, self-realization and the rigors of continuing data accumulation). [From the Sanskrit word, “muk”] ",
            "date": "Answered October 6, 2020",
            "views": "6",
            "upvotes": " Answer requested by Sandeep Patil",
            "upvoters": [
                {
                    "user_id": "Lennart Regebro",
                    "user_href": "/profile/Lennart-Regebro-1"
                },
                {
                    "user_id": "Sylvie Keller",
                    "user_href": "/profile/Sylvie-Keller-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Trejo",
                "href": "/profile/Paul-Trejo-1"
            },
            "answer_text": "No, actually we’re only beginning. Here’s why: Humanity can survive the most horrendous, Apocalyptic scenariosOur sun will last another five billion years (and so will Earth)Written history is only 5,000 years long.Therefore — we have one million more 5,000 year periods for Humanity to flourish, to evolve, to improve and to praise God.For the previous 5,000 years of human history, chattel slavery was legal in every nation on Earth. In the past two centuries, chattel slavery has become illegal in every nation on Earth. This is good evidence of genuine Progress.We’re just getting started.No matter what happens — good or bad — I believe that Humanity will survive to witness the first effects of the implosion of our Sun.Therefore, Humanity is nowhere near the end. In fact, we’re only beginning. ",
            "date": "Answered September 12, 2020",
            "views": "63",
            "upvotes": " Answer requested by Sandeep Patil",
            "upvoters": [
                {
                    "user_id": "Titi Celina",
                    "user_href": "/profile/Titi-Celina"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vernon Huffman",
                "href": "/profile/Vernon-Huffman-2"
            },
            "answer_text": "That possibility looms large, Sandeep, but the future depends upon our actions in the present. I’m not willing to write us off just yet. We’ve made a rough bed for ourselves to lie in by burning within a couple centuries fossil fuels created over millions of years. We now will have to face the consequences of the most rapid climate change earth has ever experienced, but we may be able to mitigate the effects if we act together now. Humans are a tropical species that thrived with the receding of continental glaciers. We’ve adapted to nearly every habitat on the planet and even circumvented the plagues that accompanied urbanization as our population exceeded balance. Our aggressive exploitation has altered the landscape and reduced habitat for other species, driving the sixth Great Extinction. It is conceivable that we could learn to collaborate with nature, rather than dominate and destroy that upon which we depend. Using a permaculture approach, we could create natural paradises across the planet and, if we can learn to keep our own population at sustainable levels, we could thrive again. ",
            "date": "Answered September 12, 2020",
            "views": "40",
            "upvotes": " Answer requested by Sandeep Patil",
            "upvoters": [
                {
                    "user_id": "Lennart Regebro",
                    "user_href": "/profile/Lennart-Regebro-1"
                },
                {
                    "user_id": "Ted Roberson",
                    "user_href": "/profile/Ted-Roberson"
                },
                {
                    "user_id": "Alexandru Andercou",
                    "user_href": "/profile/Alexandru-Andercou-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cal Blanchard",
                "href": "/profile/Cal-Blanchard-3"
            },
            "answer_text": "Yup, we sure are. Have you not noticed that our women are already on the edge of extinction? What is left of womanhood are females so confused about their gender that men don’t know whether to leave the toilet seat up, put it down, or just unlock the doggy door so she can get out to the woods? When she says she’s going to slip into something more comfortable, we don’t know if she’ll come out wearing nothing or burlap boxer shorts. We should be concerned when our females have more hair on their legs and chest than their male companions. We should be concerned when we go to open a door for our females and they ignore us and just yank it off of the hinges. Yup, we’ve already passed the point of return and the last gas station on the way to extinction. ",
            "date": "Answered August 10, 2020",
            "views": "133",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hilary Donovan",
                    "user_href": "/profile/Hilary-Donovan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alan Birchall",
                "href": "/profile/Alan-Birchall"
            },
            "answer_text": "Answer is well yes and no. First , yes, because the human genome is degrading. This is a scientific fact. We each inherit over 100 mutations from our parents and experience a similar amount which we pass on to our offspring. Most in themselves are not serious and as such are not seen by natural selection so are not culled out. Nevertheless they accumulate and as such in time are deleterious to the genome. So we are in fact devolving i.e. our genome is becoming less ordered a process of increasing genetic entropy. Read Professor John Sandfords book ““Genetic Entropy and the mystery of the human genome” john Sandford was For many years Professor and researcher of genetics at Cornell University. the common held view that nature is evolving from simple structures to more complex is a myth and is not backed up by TRUE scientific enquiry. Now secondly no we are not coming to the end of human existence. Why? Because as you can see from the above facts we were created complex by a creative intelligence we call God. According to the bible, Gods word, we were created for a purpose to have a relationship with Him and each other and glorify God. How and why this appears to have gone wrong is revealed in the bible too along with Gods plan for eternal existence of humans in a perfect creation in the future. Read John’s gospel And the first 12 chapters of Genesis. If you examine the observable scientific evidence we have today with the biblical world view you will find that science backs up the biblical account, and as more scientific discoveries are made increasingly so. ",
            "date": "Answered September 7, 2020",
            "views": "68",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sandeep Patil",
                    "user_href": "/profile/Sandeep-Patil-311"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Dennis",
                "href": "/profile/David-Dennis-12"
            },
            "answer_text": "The Earth seems to be undergoing a significant extinction event currently. How extensive it turns out to be remains to be seen. Human survival isn’t threatened, but I expect something of a population crash from famine, wars, and pandemics as the environment we depend on collapses around our ears. Humanity wont be eliminated though because the environmental crisis is an artifact of over population. Catastrophic population crashes from over population are are not uncommon among other species and the population crash is self correcting. The population drops. Pressure on the environment decreases. The environment recovers. The remnant population flourishes again. If the cause was exogenous and severe, for example flood volcanism or asteroid strike or increased solar radiation, then it wouldn’t be ameliorated by lowering the human population and would more likely be terminal for apex creatures like humans. ",
            "date": "Answered August 19, 2020",
            "views": "399",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sally Alter",
                    "user_href": "/profile/Sally-Alter"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anton Carver",
                "href": "/profile/Anton-Carver"
            },
            "answer_text": "Roughly one day closer per day. If you meant the end of the human species by extinction then my thinking is that if humans make it through the next 500 years they will probably make it to 1 million years (at which point speciation is a genetic inevitability). The reasoning is that the current civilization is highly unstable and humans haven’t collectively learned to cooperate and work together on large scale problem-solving. I think that if they make it through 500 years without civilization collapse then that is good evidence that they have collectively gained this ability and that will greatly diminish the risks going forward. In short just 500 years to cure stupidity or we are bust. ",
            "date": "Answered August 6, 2020",
            "views": "290",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Hilary Donovan",
                    "user_href": "/profile/Hilary-Donovan-1"
                },
                {
                    "user_id": "Steve Martin",
                    "user_href": "/profile/Steve-Martin-325"
                },
                {
                    "user_id": "Ted Roberson",
                    "user_href": "/profile/Ted-Roberson"
                },
                {
                    "user_id": "Howard Brazee",
                    "user_href": "/profile/Howard-Brazee"
                },
                {
                    "user_id": "Sam Boyle",
                    "user_href": "/profile/Sam-Boyle-25"
                },
                {
                    "user_id": "Pavel Kvasil",
                    "user_href": "/profile/Pavel-Kvasil"
                },
                {
                    "user_id": "Ilya Taytslin",
                    "user_href": "/profile/Ilya-Taytslin"
                },
                {
                    "user_id": "Kristian Xavier LaVey",
                    "user_href": "/profile/Kristian-Xavier-LaVey"
                },
                {
                    "user_id": "Jason Whyte",
                    "user_href": "/profile/Jason-Whyte"
                },
                {
                    "user_id": "Richard Anthony Scales",
                    "user_href": "/profile/Richard-Anthony-Scales"
                },
                {
                    "user_id": "Samuel Cabrera",
                    "user_href": "/profile/Samuel-Cabrera-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tamara Wilhite",
                "href": "/profile/Tamara-Wilhite"
            },
            "answer_text": "Compared to two or three nearly nuclear World War 3’s with the Soviet Union? No. Are you afraid of the hysterical, apocalyptic climate hysteria? First, environmentalists have done that for decades to try to scare people into submission, though the supposed disaster has always changed. (Ocean acidification, acid rain, global cooling, global warming, generic “change”). They've cried wolf - \"12 years til the end of the world\" - for decades. U.N. predicts disaster (by 2000) if global warming not checked - June 29 1989, Peter Spielman U.N. Predicts Disaster if Global Warming Not Checked UNITED NATIONS (AP) _ A senior U.N. environmental official says entire nations could be wiped off the face of the Earth by rising sea levels if the global warming trend is not reversed by the year 2000. ",
            "date": "Answered September 24, 2020",
            "views": "16",
            "upvotes": " Answer requested by Sandeep Patil",
            "upvoters": [
                {
                    "user_id": "Hilary Donovan",
                    "user_href": "/profile/Hilary-Donovan-1"
                },
                {
                    "user_id": "Ted Roberson",
                    "user_href": "/profile/Ted-Roberson"
                },
                {
                    "user_id": "Peter Guy Lucien Gilmore",
                    "user_href": "/profile/Peter-Guy-Lucien-Gilmore"
                }
            ]
        },
        {
            "author_info": {
                "name": "Terry Stroot",
                "href": "/profile/Terry-Stroot-1"
            },
            "answer_text": "NO ! We are getting closer the the end of the world. This means this worlds system run by Satan. His rule will end. God as Jesus Christ will come down and conquer Satan and all evil persons but believers will continue living on earth for 1000 more years being taught by Jesus and He will make His kingdom on earth and everything will change for the best. After the 1000 years all here on earth will be tested in their heart to show people it is a true heart they have. Then some will be tossed into hell with others from the beginning. Then the spiritual earth in heaven will join with the physical earth and become one again like the Garden of Eden this will be a new earth that will have no end. ",
            "date": "Answered October 17, 2020",
            "views": "4",
            "upvotes": " Answer requested by Sandeep Patil",
            "upvoters": [
                {
                    "user_id": "Hilary Donovan",
                    "user_href": "/profile/Hilary-Donovan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tim Plunkett",
                "href": "/profile/Tim-Plunkett-4"
            },
            "answer_text": "Of course we are. I say that because we can’t get farther away from the end of the human species. My understanding of time is the it is linear in our experiences. So I’m getting closer to the end of my time. I’m not getting younger, so that’s the only option. However, there’s no indication that the end of the human species is going to happen anytime soon. Sure, 2020 has sucked. But so did 1968. And so did 1918, I’m told. There’s a whole bunch of years that have sucked. Some more than others. But that doesn’t in anyway suggest that 7 billion people will disappear. ",
            "date": "Answered September 22, 2020",
            "views": "77",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Doug Stevenson",
                    "user_href": "/profile/Doug-Stevenson-30"
                },
                {
                    "user_id": "Cutter-John C. Williams",
                    "user_href": "/profile/Cutter-John-C-Williams"
                },
                {
                    "user_id": "Deah Mcneill",
                    "user_href": "/profile/Deah-Mcneill-3"
                },
                {
                    "user_id": "Jennie Balfour",
                    "user_href": "/profile/Jennie-Balfour-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Taylor",
                "href": "/profile/John-Taylor-640"
            },
            "answer_text": "Humans will live on forever, but maybe not in the bodies we have now. This heaven and earth will end and be replaced by a better world. 2 Peter 3:10 \"But the day of the Lord will come like a thief, in which the heavens will pass away with a roar and the elements will be destroyed with intense heat, and the earth and its works will be burned up.\" Revelation 20:11 \"Then I saw a large white throne. I saw the one who was sitting on the throne. Earth and sky ran away from him and disappeared.\" 2Pe 3:13 \"But according to his promise we are waiting for new heavens and a new earth in which righteousness dwells.\" The good news is that anyone who wants to can have eternal life. John 3:16 For God so loved the world that He gave His only begotten Son that whosoever believes on Him should not perish but have eternal life. Romans 10:9 “If you declare with your mouth, 'Jesus is Lord,' and believe in your heart that God raised him from the dead, you will be saved.” ",
            "date": "Answered October 2, 2020",
            "views": "5",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Hilary Donovan",
                    "user_href": "/profile/Hilary-Donovan-1"
                },
                {
                    "user_id": "Al De Wachter",
                    "user_href": "/profile/Al-De-Wachter"
                }
            ]
        },
        {
            "author_info": {
                "name": "Janis Tribble",
                "href": "/profile/Janis-Tribble"
            },
            "answer_text": "No. Only a world wide event could take us all out. Like a Mt. Everest size asteroid.We can’t do it to ourselves. It can’t be done by us. I’ve often thought that intelligence was a bit of an accident. Wasn’t supposed to be in the cards for any living creatures. Why didn’t the cave bear ancestor become the beginning of intelligence? Surely being stronger should have an advantage before intelligence came along. But I digress. No, we are not even close to the end. ",
            "date": "Answered September 23, 2020",
            "views": "12",
            "upvotes": " Answer requested by Sandeep Patil",
            "upvoters": [
                {
                    "user_id": "Karen McKearn",
                    "user_href": "/profile/Karen-McKearn"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Liberman",
                "href": "/profile/Daniel-Liberman"
            },
            "answer_text": "Thanks for the A2A, Sandeep. Q: Are we getting closer to the end of the human species? A: Of course we are. All species end. All things end. The longer we go, the closer we are to the end, whenever it is. But you meant are we really close. That is really up to us, my friend. We either get ourselves under control as a complete society, start working together to prevent catastrophes like global warming, or we follow in the footsteps of T-Rex and leave a few fossils behind. ",
            "date": "Updated August 24, 2020",
            "views": "46",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Hilary Donovan",
                    "user_href": "/profile/Hilary-Donovan-1"
                },
                {
                    "user_id": "Ted Roberson",
                    "user_href": "/profile/Ted-Roberson"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Bruyn",
                "href": "/profile/John-Bruyn"
            },
            "answer_text": "Absolutely not. There are 7.8 billion of us which increases our chances of survival if something drastic happens such as an asteroid impact. Even though we only use about 1% of the global surface, we are widely distributed. We appear to be the smartest species to live on this planet and we have an amazing capacity to survive. Watching too many end-of-the-world movies can make you think that we are very vulnerable but in reality we are very resilient. The medical profession has managed to increase our average life expectancy dramatically. ",
            "date": "Answered September 20, 2020",
            "views": "41",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Hilary Donovan",
                    "user_href": "/profile/Hilary-Donovan-1"
                },
                {
                    "user_id": "Steve Martin",
                    "user_href": "/profile/Steve-Martin-325"
                },
                {
                    "user_id": "Ted Roberson",
                    "user_href": "/profile/Ted-Roberson"
                },
                {
                    "user_id": "Sandeep Patil",
                    "user_href": "/profile/Sandeep-Patil-311"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Jermey",
                "href": "/profile/Jon-Jermey"
            },
            "answer_text": "There are two ways the ‘human species’ could end: Complete exterminationEvolving into one or more different species that could no longer breed with humans as we know them.There is no indication that the first event is imminent; on the contrary, there are more people on earth now than there ever have been, and they are generally living longer. As for the second, presumably it is happening very slowly over time, but if and when it will be significant enough to warrant naming us as a new species is very much a subjective judgment. ",
            "date": "Answered October 3, 2020",
            "views": "23",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Steve Martin",
                    "user_href": "/profile/Steve-Martin-325"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hilary Donovan",
                "href": "/profile/Hilary-Donovan-1"
            },
            "answer_text": "You ask, “Are we getting closer to the end of the human species?” The simple answer is that of course we’re getting closer to the end of the human species. We’ve always been getting closer. But I think you mean, “Are we getting close to the end of the human species?” which is an entirely different question. Yes, we’re getting closer, but I wouldn’t consider us “close” yet. I think we could be here for eons. ",
            "date": "Answered September 21, 2020",
            "views": "33",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ted Roberson",
                    "user_href": "/profile/Ted-Roberson"
                },
                {
                    "user_id": "Andrew Paul",
                    "user_href": "/profile/Andrew-Paul-53"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vinay Kumar",
                "href": "/profile/Vinay-Kumar-107"
            },
            "answer_text": "We CERTAINLY are getting closer - I can PROVE it! The human species will end at some point in time - either due to involuntary extinction, evolving beyond what we are now, or because the universe ends.As time passes, we are getting closer to that point - whenever that might be.So we are getting closer to the end of the human species.",
            "date": "Answered August 6, 2020",
            "views": "257",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Hilary Donovan",
                    "user_href": "/profile/Hilary-Donovan-1"
                },
                {
                    "user_id": "Ted Roberson",
                    "user_href": "/profile/Ted-Roberson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Smith",
                "href": "/profile/Tom-Smith-891"
            },
            "answer_text": "Yes, of course. The human species cannot last forever - eventually, when black holes have swallowed all matter in the universe (or whatever other fate awaits us), the human species MUST end. And it’s overwhelmingly likely that we’ll be a distant memory long before that. So yes, every day that passes, we’re getting closer to the end of the human species. Similarly, every day that passes, you personally are closer to death. That doesn’t necessarily mean you’re doing anything wrong, or that you should change your lifestyle - it’s just recognition of a basic biological fact. ",
            "date": "Answered August 12, 2020",
            "views": "59",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Murphy",
                    "user_href": "/profile/John-Murphy-199"
                },
                {
                    "user_id": "John Jones",
                    "user_href": "/profile/John-Jones-2108"
                },
                {
                    "user_id": "Charles Tips",
                    "user_href": "/profile/Charles-Tips"
                }
            ]
        },
        {
            "author_info": {
                "name": "Melanie Procopio",
                "href": "/profile/Melanie-Procopio"
            },
            "answer_text": "Yes. Like a child who is born, each day is travel along the continuum taking them toward the inevitable. Dinosaurs lived on 165 million years on earth, man, just 300 thousand so far. The sad part in all of this is that it is likely that we will be the first species to cause our own extinction not to mention the extinction of most other vertebrates along with us. ",
            "date": "Answered September 23, 2020",
            "views": "6",
            "upvotes": " Answer requested by Sandeep Patil",
            "upvoters": [
                {
                    "user_id": "Ted Roberson",
                    "user_href": "/profile/Ted-Roberson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hugo De Jong",
                "href": "/profile/Hugo-De-Jong-9"
            },
            "answer_text": "Yes, we are doing that already for many thousands of years. Every day we are getting closer to the end of our own life, step by step, and humanity gets ever closer to the end of the human species alltogether. Humans change along that way, that’s called “evolution”, but somewhere in the future everything will completely vanish, diasappear, including our species. Let’s have some fun untill then: have a nice and fruitful day! ",
            "date": "Answered September 15, 2020",
            "views": "41",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Hilary Donovan",
                    "user_href": "/profile/Hilary-Donovan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bernard Peek",
                "href": "/profile/Bernard-Peek"
            },
            "answer_text": "If there is going to be an end then we are approaching it at a rate of one second per second. Perhaps we should start working on a way of mitigating the heat-death of the universe. Short of a mass-extinction event there is no evidence that the human race is likely to come to an end soon. But as mass-extinction event is inevitable. Hence if we don’t have a future in space we don’t have a future. ",
            "date": "Answered September 7, 2020",
            "views": "62",
            "upvotes": " Answer requested by Sandeep Patil",
            "upvoters": [
                {
                    "user_id": "Hilary Donovan",
                    "user_href": "/profile/Hilary-Donovan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gloria Cole",
                "href": "/profile/Gloria-Cole-1"
            },
            "answer_text": "At 7.9 billion? Population size is a measure of success. Now just fix the over-population. F. sapiens is only 200,000 years old - young by any measure of species. Why would you think a young healthy fed population is getting “closer to the end”? Looks like you are trying to end the game before it even starts. ",
            "date": "Answered August 6, 2020",
            "views": "105",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Serhant-Hedkins"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charles Jack",
                "href": "/profile/Charles-Jack-3"
            },
            "answer_text": "Are we getting closer to the end of the human species? Yes. As far as we know, all species end. They either go extinct, or evolve into new species. So, some time in the future, our species will end. Hopefully, that will be a very distant future. But it will be in the future. And as we are marching forward into the future, we are getting closer to the end. ",
            "date": "Answered September 7, 2020",
            "views": "45",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ted Roberson",
                    "user_href": "/profile/Ted-Roberson"
                },
                {
                    "user_id": "Nino Casio",
                    "user_href": "/profile/Nino-Casio"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Coomber",
                "href": "/profile/Paul-Coomber-1"
            },
            "answer_text": "Your question brings to mind the words at Revelation 11:18 which concludes with the words “. . .the appointed time came for the dead to be judged and to reward your slaves the prophets and the holy ones and those fearing your name, the small and the great, and to bring to ruin those ruining the earth.” Left to our own devices we will ultimately destroy ourselves, but as this Divine promise reminds us before that stage is reached our Creator, Jehovah, will remove all the problems plaguing the human race and restore the earth to paradise conditions. This is why He is going to bring the great war of Armageddon. It is a cleansing war that will mark the start of a new earth filled only with righteous people. (Psalm 37: 9 & 10) ",
            "date": "Answered October 5, 2020",
            "views": "6",
            "upvotes": " Answer requested by Sandeep Patil",
            "upvoters": [
                {
                    "user_id": "David Thomas",
                    "user_href": "/profile/David-Thomas-508"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Kenyon",
                "href": "/profile/David-Kenyon-48"
            },
            "answer_text": "The land shall be utterly emptied, and utterly spoiled: for the Lord hath spoken this word. The earth mourneth and fadeth away, the world languisheth and fadeth away, the haughty people of the earth do languish. The earth also is defiled under the inhabitants thereof; because they have transgressed the laws, changed the ordinance, broken the everlasting covenant. Therefore hath the curse devoured the earth, and they that dwell therein are desolate: therefore the inhabitants of the earth are burned, and few men left. Isaiah 24:3-‬6 KJV Comment: The end is coming soon! ",
            "date": "Answered October 8, 2020",
            "views": "5",
            "upvotes": " Answer requested by Sandeep Patil",
            "upvoters": [
                {
                    "user_id": "Paul Forshaw",
                    "user_href": "/profile/Paul-Forshaw-1"
                },
                {
                    "user_id": "Mike Webster",
                    "user_href": "/profile/Mike-Webster-22"
                }
            ]
        },
        {
            "author_info": {
                "name": "Louise Sackville",
                "href": "/profile/Louise-Sackville"
            },
            "answer_text": "I personally don’t think so right at the moment, but we could get perilously close to self-extinction if we don’t figure out better ways of managing available resources, keeping the planet cleaner (via cleaner sources of power other than oil, coal and other petroleum, products, such as geothermal energy) and stabilizing population growth. Unchecked, rapid population growth could be our undoing. ",
            "date": "Answered October 12, 2020",
            "views": "5",
            "upvotes": " Answer requested by Sandeep Patil",
            "upvoters": [
                {
                    "user_id": "Hilary Donovan",
                    "user_href": "/profile/Hilary-Donovan-1"
                },
                {
                    "user_id": "Ted Roberson",
                    "user_href": "/profile/Ted-Roberson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Flora Haughey",
                "href": "/profile/Flora-Haughey"
            },
            "answer_text": "Always. We may survive this latest catastrophe, we may survive the next, and the one after that, but we cannot do so forever. If we do so, we will likely evolve into new forms of life, leaving our human species behind. This probably will not happen. And if we beat the laws of probability and keep going, the prevailing science says that our universe is finite, and will end, taking us with it. But that’s probably quite a ways in the future. Best not to worry about it. ",
            "date": "Answered September 22, 2020",
            "views": "4",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William Boernke",
                "href": "/profile/William-Boernke"
            },
            "answer_text": "If by end of the human species, you mean will humans go extinct, this is unknowable because “prediction is very difficult especially about the future” (Neils Bohr). We do know that extinction happens when a species’ death rate exceeds its birth rate. The human birth rate is far greater than its death rate (in third world counties; some developed nations have negative growth rates). When the human death rate exceeds the birth rate, then we can talk about humans going extinct. ",
            "date": "Answered August 7, 2020",
            "views": "71",
            "upvotes": " Answer requested by Sandeep Patil",
            "upvoters": [
                {
                    "user_id": "Hilary Donovan",
                    "user_href": "/profile/Hilary-Donovan-1"
                },
                {
                    "user_id": "Ted Roberson",
                    "user_href": "/profile/Ted-Roberson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roger Hayes",
                "href": "/profile/Roger-Hayes-18"
            },
            "answer_text": "Are without doubt on the precipice of a cataclysm. But, whatever happens, even worst case scenario is unlikely to be the end of our species. The sacred scriptures talk of a time when the living will envy the dead. But, that need not necessarily be now. But, humanity seriously needs to get a grip & I fear it will take a catastrophy for that to happen. But who knows, maybe it will not? ",
            "date": "Answered October 7, 2020",
            "views": "12",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Pat McCormack",
                    "user_href": "/profile/Pat-McCormack"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yon Gardner",
                "href": "/profile/Yon-Gardner"
            },
            "answer_text": "Yes we are and we refuse to acknowledge any hint of what we are doing to ourselves. shortage of water, food and toxic polutants, dirty air and a president who believes raping and pillaging the earth is a good thing as if three isn’t any end to natural resourses. The Abyss is coming closer ",
            "date": "Answered August 13, 2020",
            "views": "43",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jerry Crespi",
                "href": "/profile/Jerry-Crespi"
            },
            "answer_text": "Sure we are. The whole world will end when our sun dies in about 5 billion years.. So everyday we get closer to THE END. Of course none of the people living today or for quite a few centuries will need to worry about THE END, because it can be 5 billion years before it happens, but every day that passes gets us closer. Don’t lose any sleep over it. ",
            "date": "Answered August 14, 2020",
            "views": "42",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ted Roberson",
                    "user_href": "/profile/Ted-Roberson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sharon Jones Smith",
                "href": "/profile/Sharon-Jones-Smith-1"
            },
            "answer_text": "The Bubonic Plague killed 50 -70% people in England 🏴󠁧󠁢󠁥󠁮󠁧󠁿 & Europe. The 1918 flu pandemic killed 50–100 million people worldwide. Under one million deaths have occurred in this pandemic. We are not even close to the end of humanity. Humanity will be over when fires 🔥 can’t be put out around the world 🌍. Not before. ",
            "date": "Answered September 24, 2020",
            "views": "7",
            "upvotes": " Answer requested by Sandeep Patil",
            "upvoters": [
                {
                    "user_id": "Hilary Donovan",
                    "user_href": "/profile/Hilary-Donovan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matt Trafton",
                "href": "/profile/Matt-Trafton-1"
            },
            "answer_text": "No. Death of billions, possibly. Extinction, no. Even survival underground would ensure our continued existence. Frozen sperm and eggs would ensure outr later existence. In the future, our downloaded consciousness would ensure our continued existence. Even if life IS a simulation we would probably be stored away if our sim. was terminated for slme reason. Though, why worry about something you can not change. Enjoy your life experience. ",
            "date": "Answered August 10, 2020",
            "views": "60",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ben Bacon",
                "href": "/profile/Ben-Bacon-11"
            },
            "answer_text": "Yes, during every increment of time, by definition. Presuming the human species does not have an infinite life span, and that time proceeds in only one direction (into the future), then we are always proceeding from the beginning towards the end. ",
            "date": "Answered August 9, 2020",
            "views": "49",
            "upvotes": " View 4 Upvoters"
        },
        {
            "author_info": {
                "name": "Greg Seller",
                "href": "/profile/Greg-Seller"
            },
            "answer_text": "Yes, just as you are getting closer to your demise with each new day. But, you still don't know how soon or how long before you'll die, & no one should be so presumptuous as to pretend to know how long we as a species will survive. Possibly we will have evolved into many other species by then. ",
            "date": "Answered October 18, 2020",
            "views": "5",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Walter A Duda",
                "href": "/profile/Walter-A-Duda"
            },
            "answer_text": "If we don’t get a handle on ouir environment, we will be eventually be a memory, I predicted years ago with the warming it is just amatter of time, we will have 200 mile winds, 50to to go. As this continues and more energy is available, we haven’t seen anything yet. I would suggest future homes be of ferrous cement consrtuction that is waterproof, resistant to fire and domed to resist wind damage. Any sharp outcropping will present a barrier for high winds with resultant damage. Sound rididculous, look at a current newsreel. ",
            "date": "Answered September 10, 2020",
            "views": "41",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Jay Jokhan",
                "href": "/profile/Jay-Jokhan-1"
            },
            "answer_text": "Let’s face it SANDEEP, We are the most aggressive greedy self centred creature that ever existed and yet we think that the creator loves us more than any other . How wrong we are . We are now the VIRUS / SORE / INFLAMATION / DISEASE on her body for which MOTHER EARTH - DHARRTIE MAA , GAIA , is now using one of her more powerful potions to CULL some among us . If it fails she may use the really big curative - NATURAL STERILIZATION ! - See the film CHILDREN OF MEN ! ",
            "date": "Answered October 6, 2020",
            "views": "22",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Wayne Boyd",
                "href": "/profile/Wayne-Boyd-2"
            },
            "answer_text": "Day by day we get closer to the end of the human species. Of course, it won’t happen today or tomorrow or even next week. We might even be around to the end in about 100 to 200 million years when all the oceans, lakes and rivers on Earth evaporate due to the sun gradually getting hotter as it gets older. ",
            "date": "Answered September 22, 2020",
            "views": "3",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Mehmet Ramadan",
                "href": "/profile/Mehmet-Ramadan-1"
            },
            "answer_text": "Every species has a lifespan. We are not living in harmony with our planet so in geological terms we are on a rapid downhill path . The problem with humans is they don’t have a very long lifespan so they have difficulty thinking on a geological scale. If we don’t change our ways our planet and or race will be gone in about a thousand years time in my opinion ",
            "date": "Answered September 25, 2020",
            "views": "2",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Paul Clifford",
                "href": "/profile/Paul-Clifford-27"
            },
            "answer_text": "Are we getting closer to the end of the human species? No! The world population is some where around 7 billion, and projected to grow to about 10 billion until declining as standards of living & education levels rise around the world. So, humans are projected to be around for several millions of years yet! ",
            "date": "Answered September 10, 2020",
            "views": "61",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "John Clerk",
                "href": "/profile/John-Clerk-1"
            },
            "answer_text": "Probably, in thesame sense that you are getting closer to the inevitable end of your own life. As we continue to stress the planet with human overpopulation leading to habitat destruction and the extinction of thousands of other species, we make the “doom” of our own demise more and more certain AND also sooner and sooner. ",
            "date": "Answered September 4, 2020",
            "views": "37",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Marc Lambert",
                "href": "/profile/Marc-Lambert-9"
            },
            "answer_text": "I hope so, EGMi plans to allow humans to self evolve into a new species we call it homo-left- brainicus lol, humans stop and evolve out of using their faulty right anxious/negative brains that drive all human made suffering. EGMi maximises use of the left logical/positive brain our goodness/oneness/inner happiness, in time faulty right brain structures will shrink and eventually stop working. ",
            "date": "Answered August 17, 2020",
            "views": "214",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Nick Lilavois",
                "href": "/profile/Nick-Lilavois-1"
            },
            "answer_text": "Are we getting closer to the end of the human species? Well, considering two fundamental truths: Everything ends eventually.Time keeps moving forward.Then yes. We keep moving closer to our eventual extinction. It could be millions of years from now, it could be tomorrow, but we are moving towards it. ",
            "date": "Answered August 6, 2020",
            "views": "87",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Alan Cox",
                "href": "/profile/Alan-Cox-64"
            },
            "answer_text": "the only way we would get to the end is from a mass extinction that would wipe out the majority of life on earth(be it grey goo, meteor or zombies) , or we get a super predator born from the survivors of our wraith. either way the chances of these happening are low but always kinda possible. ",
            "date": "Answered September 2, 2020",
            "views": "22",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Sid Up",
                "href": "/profile/Sid-Up"
            },
            "answer_text": "I don't think so.. but it is not that impossible if we are connecting this much outward us… what you say what is important water or money.. do we really think the original value… if we are seeing more value in what we are making then what actually is, then we are getting closer… We need to review this and we will surely be closer to life.. ",
            "date": "Answered September 1, 2020",
            "views": "115",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "David Lutness",
                "href": "/profile/David-Lutness-1"
            },
            "answer_text": "If you believe, as I do, that all species must someday come to an end and that time moves in only one direction, then, yes, we are getting closer to ‘the end of the human species.’ Could be tomorrow could be in ten million years. Whenever, it is closer today than it was yesterday. ‘So it goes.’ ",
            "date": "Answered August 14, 2020",
            "views": "33",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Ralph Lake",
                "href": "/profile/Ralph-Lake"
            },
            "answer_text": "Every year we get one year closer to the last human (Homo Sapient Sapient) dying. I would guess that in a few hundreds of years a new species that evolved from us and is no longer biologically compatible with us will take over and we will die out. Just like Homo Erectus and Cro-Magnon are gone so too shall we be. 9Homo ",
            "date": "Answered August 13, 2020",
            "views": "36",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Harv Tepfer",
                "href": "/profile/Harv-Tepfer"
            },
            "answer_text": "To which end are you referring? On a more serious note, the human race has shown a remarkable facility to adapt to changing conditions. It has overcome its wars, its plagues, many of its own idiocies, to survive, some even to prosper. Scientific advances may even help us to improve the ecology we have so badly damaged. ",
            "date": "Answered October 3, 2020",
            "views": "3",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Steph Groom",
                "href": "/profile/Steph-Groom-2"
            },
            "answer_text": "My studies over the years of many topics concerning humans tells me that the humans will go extinct in the future due to either human caused events (Climate Change, a nuclear WW III, or a very serious pandemic far greater that our current one) or by a collision of a massive Asteriod with Earth (high probability occurrence) or an ET invasion of Earth (low probability occurrence) ! ",
            "date": "Answered September 13, 2020",
            "views": "29",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Jedidiah Bell",
                "href": "/profile/Jedidiah-Bell-2"
            },
            "answer_text": "Hi. No. Not anytime soon. Not in the next 1000 years. We are not entering the next mass extinction. That is a lie. Socialism is a very real threat to life on Earth. Needless wars. Energy theft. Personal liberty theft. Slavery in China, Africa, and middle east. These are very real threats. ",
            "date": "Answered September 10, 2020",
            "views": "50",
            "upvotes": " View 3 Upvoters "
        },
        {
            "author_info": {
                "name": "Cliff Gale",
                "href": "/profile/Cliff-Gale"
            },
            "answer_text": "Well, if eventually humans will be gone, then of course, every day we are closer. Just like our own deaths as individuals. Time passes. Most likely humans will be around for many more hundreds or even thousands of years. ",
            "date": "Answered August 13, 2020",
            "views": "20",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Karen Keil",
                "href": "/profile/Karen-Keil-4"
            },
            "answer_text": "Yes, but that doesn’t mean we’re there. If you are going from Washington, DC to Los Angeles, and you take one step, you’re closer to Los Angeles - but you still have 2649 miles to go. ",
            "date": "Answered September 18, 2020",
            "views": "21",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Preman Tilson",
                "href": "/profile/Preman-Tilson"
            },
            "answer_text": "We are always by definition closer to the end of the human species than any people who have ever lived before. Assuming the human species will end at some point in the future, we are constantly getting closer to that point. ",
            "date": "Answered September 20, 2020",
            "views": "25",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Else Byskov",
                "href": "/profile/Else-Byskov"
            },
            "answer_text": "No, we are not. There are human populations on innumerable planets of the universe, and they will not be extinguished. Not on this planet either. I invite you to read two blog-post from my website that explain this. I am linking to the posts in the comment box below. ",
            "date": "Answered September 25, 2020",
            "views": "6",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "James Hough",
                "href": "/profile/James-Hough-1"
            },
            "answer_text": "+JMJ+ Every day, but we cannot know when the end will come, and for all we know, it might be 20,000 years in the future. But Our Blessed Lord Himself told us that we cannot know: Matthew 24:36 Revised Standard Version Catholic Edition The Necessity for Watchfulness 36 “But of that day and hour no one knows, not even the angels of heaven, nor the Son,[a] but the Father only. ",
            "date": "Answered October 1, 2020",
            "views": "43",
            "upvotes": " View Sharers "
        },
        {
            "author_info": {
                "name": "Michael Priv",
                "href": "/profile/Michael-Priv"
            },
            "answer_text": "No. The human specie is at least 200,000 years old and up to 300,000 according to some sources. I personally think that we’ve been through it all before. We build civilizations, we destroy civilizations and start from the beginning. ",
            "date": "Answered September 23, 2020",
            "views": "3",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Justice Långvall",
                "href": "/profile/Justice-Långvall"
            },
            "answer_text": "Yes, of course! There is no way to get further from it. At some point in time, humans will die out, whether that’s soon or at the end of the universe itself, and every second that passes brings us closer to that point, no matter what. ",
            "date": "Answered August 12, 2020",
            "views": "27",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Craig Kulat",
                "href": "/profile/Craig-Kulat"
            },
            "answer_text": "Once we give up & abandon all things spiritual then yes. We will become a totally hedonistic & crude creature. Totally self involved, logically cruel with machine like inefficiency.For we will become part machine. We keep expanding what we call knowledge & borders because we can, never pondering if we SHOULD! Just sayin ",
            "date": "Answered September 7, 2020",
            "views": "25",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Barry Taylor",
                "href": "/profile/Barry-Taylor-7"
            },
            "answer_text": "I think it is quite possible that we are getting close to our species’ extinction. If and when it happens, it will be because we have abused the planet so much that it can no longer support us. Once we are gone, the planet will recover and life will go on without us. ",
            "date": "Answered August 17, 2020",
            "views": "43",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Irving Prentice",
                "href": "/profile/Irving-Prentice"
            },
            "answer_text": "No. Why do you think so? This covid is not as bad as other things we went through. There’s no big war and none on the horizon. The population will decline after reaching about 10 billion. Look it up on the net. We’ll be around for millions of years. ",
            "date": "Answered August 7, 2020",
            "views": "58",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Carol Madden",
                "href": "/profile/Carol-Madden-27"
            },
            "answer_text": "While we humans are pushing the buttons, only God can answer that question. Instead of becoming paranoid or frightened, perhaps it might be better if we asked ourselves: What can we do collectively to make a better universe? Our universe is our Earth—we need to clean it up; after all, we made the mess. ",
            "date": "Answered October 14, 2020",
            "views": "8",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Carlos Gutierrez",
                "href": "/profile/Carlos-Gutierrez-155"
            },
            "answer_text": "Sort of it, but that is why we need to develop AI and brain computer interface. To shred our weak biological bodies for a digital and mechanical existence. That would make us independent of earth biosphere and we could live pretty much everywhere, even in the vacuum of space. ",
            "date": "Answered August 12, 2020",
            "views": "44",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Martin Dennett",
                "href": "/profile/Martin-Dennett"
            },
            "answer_text": "Yes. We’re a day closer to the end of the human species than we were yesterday, but not as close as we will be tomorrow. ",
            "date": "Answered September 25, 2020",
            "views": "17",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Larry Rafey",
                "href": "/profile/Larry-Rafey"
            },
            "answer_text": "The currently progressing Climate Crisis is, indeed, bringing Humans toward the end of their time on Earth. Thirty years ago, I had hopes that it could be turned around but now … not likely. ",
            "date": "Answered September 28, 2020",
            "views": "4",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "James McInnes",
                "href": "/profile/James-McInnes-1"
            },
            "answer_text": "Clearly. The species will either evolve into something else, or it will go extinct, as all species do. That’s in the future. As long as time moves forward, we are marching towards those potential eventualities. ",
            "date": "Answered October 5, 2020",
            "views": "3",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Mabozza Richie",
                "href": "/profile/Mabozza-Richie"
            },
            "answer_text": "Are we getting closer to the end of the human species? You humans have 21 years left.. What will you do with that information?? Precisely nothing, thats what. Just remember, October of 2041. Party is over. ",
            "date": "Answered August 6, 2020",
            "views": "82",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ilan Elron",
                "href": "/profile/Ilan-Elron"
            },
            "answer_text": "Yes and no. Yes, in the very very long run, Homo Sapiens will eventually evolve into Homo Somethingelse. No, in the future that might interest us as parents and grandparents, no we’re nowhere near the end. ",
            "date": "Answered August 6, 2020",
            "views": "82",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Johnson",
                "href": "/profile/David-Johnson-57"
            },
            "answer_text": "Ummm, we always have been - just like you have always been getting closer to your death. That's how time works. ",
            "date": "Answered August 9, 2020",
            "views": "22",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Gary Ansorge",
                "href": "/profile/Gary-Ansorge"
            },
            "answer_text": "Which “human” species? Neanderthal/Denisovan genes continue w/in homo sapiens,,,homo sapiens genes will continue to exist w/in those new species we create from our knowledge of genetics,,,I expect what we call homo sapiens will drizzle away, rather than abruptly cease to exist,,,ending with a whimper, not a catastrophe…but it’s offspring could continue,,,indefinitely… ",
            "date": "Answered August 6, 2020",
            "views": "78",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Leslie Dellow",
                "href": "/profile/Leslie-Dellow"
            },
            "answer_text": "By definition, we are today one day closer to the extinction of the last homo sapien than we were yesterday. ",
            "date": "Answered August 6, 2020",
            "views": "64",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Asaad Hutchinson",
                "href": "/profile/Asaad-Hutchinson"
            },
            "answer_text": "Of humanity continues on it's current part, yep. But Muslims around the world are waiting for divine intervention. Namely, the Mahdi, the one who will insure the success of the human race. With his arrival, we'll have a good 1500 years(at least) to look forward to. Note the word “good\" ",
            "date": "Answered August 10, 2020",
            "views": "35",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Gert Britz",
                "href": "/profile/Gert-Britz"
            },
            "answer_text": "We are getting closer to the end of the world not only the human species. If i look at all the signs, the end of the world as we know it cannot be very far off! ",
            "date": "Answered October 20, 2020",
            "views": "7",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Jim Underwood",
                "href": "/profile/Jim-Underwood-14"
            },
            "answer_text": "Yes. When the aliens come back after us we will be transfigured into a different body and all flesh on earth will die. Will take 1000 years for all dead flesh to disappear. We will then continue living here but in a non flesh body. ",
            "date": "Answered October 15, 2020",
            "views": "3",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Eric Marsh",
                "href": "/profile/Eric-Marsh-17"
            },
            "answer_text": "Yes. The human species will not last forever. Therefore every day is closer to the end of the human species. ",
            "date": "Answered September 27, 2020",
            "views": "13",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Mike Zarowitz",
                "href": "/profile/Mike-Zarowitz"
            },
            "answer_text": "It is an interesting question. If indeed there is a span of time in the future in which the human species will end, then yes, we are getting closer to it. ",
            "date": "Answered September 22, 2020",
            "views": "9",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Colin Wright",
                "href": "/profile/Colin-Wright-58"
            },
            "answer_text": "Well clearly we aren’t getting closer to the beginning and our species like every other will end at some point, so we must be getting closer to the end be that in 10 years or 100,000,000 years. ",
            "date": "Answered August 7, 2020",
            "views": "53",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Shaun Mootoo",
                "href": "/profile/Brian-Shaun-Mootoo"
            },
            "answer_text": "Yes. That’s how the space-time continuum works. We’re also getting closer to the death of our Sun, and the end of the Universe. Yay, Entropy! ",
            "date": "Answered September 29, 2020",
            "views": "2",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Paul Forshaw",
                "href": "/profile/Paul-Forshaw-1"
            },
            "answer_text": "Are we getting closer to the end of the human species? Inevitably, but there’s no reason to suspect that it will come soon. ",
            "date": "Answered September 23, 2020",
            "views": "5",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Tish Linn Mirtoch",
                "href": "/profile/Tish-Linn-Mirtoch"
            },
            "answer_text": "Could be. Seems like ominous portends at times. May be tomorrow, or ten thousand years.. Microbes or asteroid? God only knows. Just enjoy each and every day. ",
            "date": "Answered September 10, 2020",
            "views": "5",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Francisco Bustamente",
                "href": "/profile/Francisco-Bustamente"
            },
            "answer_text": "Certainly! Just think: We are always getting further from the beggining and closer to the end. :-) ",
            "date": "Answered August 13, 2020",
            "views": "13",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Gerard Ferguson",
                "href": "/profile/Gerard-Ferguson"
            },
            "answer_text": "As all species come to an end so too will the human race And logically ever day that passes is a day closer to that inevitable end Make of that what you will ",
            "date": "Answered September 6, 2020",
            "views": "9",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Mason Kelsey",
                "href": "/profile/Mason-Kelsey-4"
            },
            "answer_text": "Sure. Eventually the human species will be replaced by several irreversible genetic changes into multiple new intelligent species designed to survive in radically different environments. ",
            "date": "Answered October 5, 2020",
            "views": "5",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Aspen Howler",
                "href": "/profile/Aspen-Howler"
            },
            "answer_text": "Technically yes. Cuz every step in time gets you further away from the start and closer to the end. Lol but seriously, yeah we're screwed. ",
            "date": "Answered October 6, 2020",
            "views": "4",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Randy Radcliff",
                "href": "/profile/Randy-Radcliff"
            },
            "answer_text": "I think so, because humanity grows ever more powerful, but not a mote wiser; in fact, our stupidity and irresponsibility are growing even more rapidly than our technology. ",
            "date": "Answered August 7, 2020",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Suzy McKee Charnas",
                "href": "/profile/Suzy-McKee-Charnas"
            },
            "answer_text": "Sure; all species have their expiration date, so the more time passes, the closer we come to our sell-by date. ",
            "date": "Answered October 2, 2020",
            "views": "15",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Cindy Leonard",
                "href": "/profile/Cindy-Leonard-49"
            },
            "answer_text": "How about you read the Bible and find ALL that is to happen before we end up destroying all? How much has not happened yet? Most have. Even 9/11 is predicted in the Bible. ",
            "date": "Answered September 12, 2020",
            "views": "7",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Tim Muston",
                "href": "/profile/Tim-Muston"
            },
            "answer_text": "Logically, ice accept the idea that the human species has a finite time span, any point in time is getting closer to the end. ",
            "date": "Answered August 11, 2020",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Mendez",
                "href": "/profile/Robert-Mendez-7"
            },
            "answer_text": "Are you kidding we're over 7 billion and counting. I see nothing stopping (short of an asteroid 1/4 size of the earth hitting us) population increasing. ",
            "date": "Answered September 10, 2020",
            "views": "27",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Robert Bates Graber",
                "href": "/profile/Robert-Bates-Graber"
            },
            "answer_text": "Despite the threats posed by climate change and nuclear arsenals, I don’t think so. I prefer to be an optimist: things are bad enough already! ",
            "date": "Answered August 6, 2020",
            "views": "47",
            "upvotes": " View Sharers "
        },
        {
            "author_info": {
                "name": "Charles A. Veilleux",
                "href": "/profile/Charles-A-Veilleux"
            },
            "answer_text": "I do not think so ,unless higher authority decide so. Our sun is still good at its present efficiency for 25,000,000,000 years, ",
            "date": "Answered September 27, 2020",
            "views": "14",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Al Klein",
                "href": "/profile/Al-Klein"
            },
            "answer_text": "Every day, every minute. Even if that end is 200 million years from now. Are we getting close to it? I doubt it. ",
            "date": "Answered October 7, 2020",
            "views": "15",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Chris Hirst",
                "href": "/profile/Chris-Hirst-21"
            },
            "answer_text": "Are we getting closer to the end of the human species? Yep, it gets closer with every passing million years. ",
            "date": "Answered September 27, 2020",
            "views": "4",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Ratnasabapathy Thillairajan",
                "href": "/profile/Ratnasabapathy-Thillairajan"
            },
            "answer_text": "No way. We are getting closer to human perfection in Love. Love nature, love people, love the family and love God. ",
            "date": "Answered September 23, 2020",
            "views": "4",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Joseph Kranski, II",
                "href": "/profile/Joseph-Kranski-II"
            },
            "answer_text": "-Of Course ! The further we get from the “beginning” of ANY-Thing, brings us closer to the End of it. :) ",
            "date": "Answered September 29, 2020",
            "views": "2",
            "upvotes": " Answer requested by Sandeep Patil"
        },
        {
            "author_info": {
                "name": "Thomas Ewing",
                "href": "/profile/Thomas-Ewing-14"
            },
            "answer_text": "Not the end, but a severe abbreviation. Within 150 years we’ll know. Please don’t have kids, so there will be less to suffer. ",
            "date": "Answered August 6, 2020",
            "views": "42",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chen Ye Xue",
                "href": "/profile/Chen-Ye-Xue"
            },
            "answer_text": "No, but we are nearing to our human physical limit such as stronger bodies, eyesight, speed and strength but we are not finish advancing civilization. ",
            "date": "Answered August 6, 2020",
            "views": "77",
            "upvotes": "0"
        }
    ]
}