{
    "title": "Are we aware of anything outside of the universe, or is the universe everything and nothing outside exists? - Quora",
    "tags": [
        "Existence",
        "The Universe",
        "Cosmology",
        "Philosophy",
        "Astrophysics",
        "Astronomy",
        "Science",
        "Physics",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ben McAdam",
                "href": "/profile/Ben-McAdam-3"
            },
            "answer_text": "This is a difficult one to get your head around. But once you do, a lot of how the Universe works will start making a little more sense. The Universe as we know it was infinitesimally small at one point around 13.8 billion years ago. It would have been infinitesimally hot too, all energy packed into this minuscule point we naively call a ‘‘singularity’ because we simply don’t understand physics at these infinite levels. Our laws of physics today break down at such a point so we say ‘singularity’ to tag what we don’t know. Anyhow, a state of cosmic expansion looks to have occurred in the trillionths upon trillionths of a second into existence. The Cosmic Microwave Background (CMB) gives us some insight into how matter was distributed in the very-early eons of our Universe: Cosmic microwave background - Wikipedia At this point the Universe was bigger, cooler and modern-day classical physics was in full flow. Now you ask, Where was the epicentre? What is the Universe expanding into? All valid questions until you realise one thing…it’s EVERYWHERE. We only know existence of life here on Earth. So we look out at the Universe that appears spherical around us. We see roughly the same in all directions and thus it appears to us, and those great-thinkers of the classical antiquity times, that we are the centre of the Universe. They weren’t too far wrong, they got the fact the Sun and other planets orbiting Earth wrong, but wherever you are you are the centre of the Universe; read on for an interesting insight into this: Where is the centre of the universe? So, you could magically transport to a distant Earth mark II planet let’s say 10 billion light years away. Guess what, would you be 3.8 billion light years from the *edge* of the Universe…No! You would look out to the Universe in all directions and see pretty much the same as you do now. The Universe expanded everywhere at once. *Wherever you are in the Universe, you are the centre. The Sun is the centre; Earth is the centre. A floating piece of dirty icy rock in the Oort Cloud is the centre, hell a black hole billions of light years away is the centre. So there is no “outside”, there was no “before” as time and space were born together all those years ago and whilst galaxies continue to fly apart due to the effects of dark energy, everywhere remains the centre of this Universe so outside and before become moot points in our physical understanding of the Cosmos. **Also, always remember that this Universe is under no obligation to reveal its’ secrets. Understanding it is a very complex field, but a wonderfully rewarding study nonetheless! ",
            "date": "Answered July 15, 2020",
            "views": "139",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Steven Hood",
                    "user_href": "/profile/Steven-Hood-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alan Appleby",
                "href": "/profile/Alan-Appleby-4"
            },
            "answer_text": "Are we aware of anything outside of the universe, or is the universe everything and nothing outside exists? We are not even aware of everything IN the Universe! We can only possibly see the OBSERVABLE UNIVERSE, where the light travelling to Earth has been travelling for up to the age of the universe. We can’t actually see all of that, due to the limitations of the present technology of telescopes. We can only infer the existence of continuing groups of galaxies from what we can see within the observable universe. Anyone who tells you something different is speculating. Alan Appleby's answer to Visualize space. It goes on and on forever. If, in your mind's eye, you retreat trillions of miles from the earth and draw a huge sphere with earth as the center and say this indeed is all of space, what, then, is on the other side of your sphere? Beyond the Milky Way is our local group of galaxies.Beyond that is the rest of the “Observable Universe”.Observable universe - Simple English Wikipedia, the free encyclopedia The best estimate of the age of the universe as of 2013 is 13.798 ± 0.037 billion years.[3] Due to the expansion of the universe humans are observing objects that were originally much closer but are now considerably farther away (as defined in terms of cosmological proper distance, which is equal to the comoving distance at the present time) than a static 13.8 billion light-years distance.[4] The diameter of the observable universe is estimated at about 28 billion parsecs (93 billion light-years),[5] putting the edge of the observable universe at about 46–47 billion light-years away.  By Andrew Z. Colvin - Own work, CC BY-SA 3.0, File:Observable Universe with Measurements 01.png Visualization of the 93 billion light year – or 28 billion parsec – three-dimensional observable universe. The scale is such that the fine grains represent collections of large numbers of superclusters. The Virgo Supercluster – home of Milky Way – is marked at the centre, but is too small to be seen in the image Of course this does not mean that the Earth and the Solar System are at “the centre” of the Universe.It only means, that the distance the observable light we see, has been travelling towards us for the same amount of time from all directions. Any light from stars beyond this circle, has not yet had enough time to reach us!",
            "date": "Answered July 15, 2020",
            "views": "107",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Clif Williams",
                "href": "/profile/Clif-Williams-2"
            },
            "answer_text": "Yes there is the immaterial Spirit heaven mentioned below is outside of the physical material Universe. The immaterial Spirit heaven the great Jehovah’s and his immaterial angelic sons job 38:7 dwelling place 1 kings 8:30 the 3rd heaven of the heavens is independent of and beyond the two physical material heavens mentioned below Deuteronomy 10:14 Neheniah 9:6 The outer space physical material heaven # 2 Isaiah 13:10 was Created sometime after the Spirit immaterial heaven was Created by God. And physical material Earth ’s Heaven #1 Genesis 1:10 ,from the viewpoint of mans looking upwards from the surface of the Earth containing its 5 Atmospheric layers was Created last of the physical material heavens. So the great Jehovah Created a total of three heavens one a Spirit heaven independent of and beyond the two physical material heavens . The Spirit immaterial heaven is even beyond the never ending Outer Space heaven ,mankind asks how can the spirit heaven be beyond the never ending Outer Space heaven? Gods son Jesus answers this question at Mattherdw 19:26 backed by Job 42:2 So now you have an idea whats outside physical material Universe according to God’s word the Bible see Titus 1:2 ",
            "date": "Answered July 20, 2020",
            "views": "108",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Izzy Luggs",
                "href": "/profile/Izzy-Luggs"
            },
            "answer_text": "The quantum world seemingly spirals downward into a bottomless barrel. Things appear to break down into smaller and smaller subatomic components with no end in sight. The macro world behaves in a similar, albeit opposite, fashion. Larger and larger entities are discovered within the universe on a regular basis. Given these observable universal traits of both the infinite infinitesimal and astronomical, might it be a bit shortsighted to declare the universe not a component of something larger similar to a cell being a component of the larger entity? Lacking the ability to see below or beyond a certain level of totality doesn’t mean it doesn’t exist. It simply means we lack the ability to perceive it. In that light, it might prove useful to remember perception is not reality, nor is reality subject to sentient convention or interpretation. Reality exists independent of any sentient mind’s perceptual template and its extremely limited ability to define it. It simply is. ",
            "date": "Answered July 15, 2020",
            "views": "56",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Miguel Chappell Portela",
                "href": "/profile/Miguel-Chappell-Portela"
            },
            "answer_text": "How could ‘nothing’ exist outside ? Don’t you see this is a logical fallacy? There cannot be existence and non-existence together right? So basically you are right to question because it is not made very clear in the mainstream. The truth is stuff obviously exists outside the universe namely more universes, imagine a sea of bubbles. Reality is infinite.  ",
            "date": "Answered July 16, 2020",
            "views": "517",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lbd970",
                    "user_href": "/profile/Lbd970"
                },
                {
                    "user_id": "Jeff Knight",
                    "user_href": "/profile/Jeff-Knight-29"
                },
                {
                    "user_id": "Tom Ranson",
                    "user_href": "/profile/Tom-Ranson-2"
                },
                {
                    "user_id": "Kanji Banji",
                    "user_href": "/profile/Kanji-Banji"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Koch",
                "href": "/profile/Jeff-Koch-30"
            },
            "answer_text": "I wouldn't say that there is nothing outside of the universe. The universe has no outside. Don't picture it as empty space outside the universe. Think of it as going north of the north pole. No such place exists. It is not a land with nothing in it. It just by definition doesn't exist. ",
            "date": "Answered July 16, 2020",
            "views": "51",
            "upvotes": " Answer requested by Ainaan Qureshi"
        },
        {
            "author_info": {
                "name": "Bob Everton",
                "href": "/profile/Bob-Everton-1"
            },
            "answer_text": "We cannot see anything outside the universe. The edge of the universe is 50 billion light years away. There are most likely many universes. If there is one, than the probability that there is more is very good. ",
            "date": "Answered July 15, 2020",
            "views": "35",
            "upvotes": " Answer requested by Ainaan Qureshi"
        },
        {
            "author_info": {
                "name": "Zbigniew Dzwonkowski",
                "href": "/profile/Zbigniew-Dzwonkowski"
            },
            "answer_text": "Every human could be aware of anything outside of the universe with its fully developed human consciousness… no matter, no energy, no mind, no time-space exists beyond the universe-creation… except the Pure Consciousness… all the best. ",
            "date": "Answered July 15, 2020",
            "views": "56",
            "upvotes": " Answer requested by Ainaan Qureshi"
        },
        {
            "author_info": {
                "name": "Bruce Bell",
                "href": "/profile/Bruce-Bell-5"
            },
            "answer_text": "Nobody knows for sure, but based on what I’ve read, it’s most likely there is NOTHING outside the universe. There is not even an outside. ",
            "date": "Answered July 15, 2020",
            "views": "39",
            "upvotes": "0"
        }
    ]
}