{
    "title": "Are narcissists materialistic? - Quora",
    "tags": [
        "Materialism (economic)",
        "Materialism (philosophy)",
        "Narcissistic Personality Disorder"
    ],
    "response": [
        {
            "author_info": {
                "name": "Louisa Jetta",
                "href": "/profile/Louisa-Jetta"
            },
            "answer_text": "Oh yes! Narcissist love status, prestige and lots of material possessions. Narcissists want to be people to envy them so owning amazing stuff is a top priority. Narcissist want attention. Narcissists love shopping. It is not uncommon for narcissist to have a lot of credit card debt. Better yet, they try to get other people to bankroll their lifestyle. Narcissist are users. They emotionally and financially try to suck dry all those who become close to them They make promises to pay the person back, but that never happens. The narcissist will make up phony reasons why the person does not deserve to be paid back. Narcissist lie to others and themselves. Once a narcissists realizes that they can no longer use a person, they look for someone new. Question: How to get out of a relationship with a narcissist? Answer: Stop giving them attention or money. ",
            "date": "Answered July 21, 2017",
            "views": "942",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Iris Guevarez",
                    "user_href": "/profile/Iris-Guevarez"
                },
                {
                    "user_id": "Iram Ghulam Ahmad Khan",
                    "user_href": "/profile/Iram-Ghulam-Ahmad-Khan"
                },
                {
                    "user_id": "Thomas Mezei",
                    "user_href": "/profile/Thomas-Mezei"
                },
                {
                    "user_id": "Milly Stuchinski",
                    "user_href": "/profile/Milly-Stuchinski"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frida Schiess",
                "href": "/profile/Frida-Schiess"
            },
            "answer_text": "Yes, they envy whoever has things better than them, even if the person worked hard to have these things and the narc just lied on the couch all day sleeping and watching TV. My narc father actually rambled whenever he saw someone with an expensive car on the street and my mother hated all the relatives who were well off because they dressed better and spent hours talking about how they dared to dress this way. Yet she just lied on the couch all day (I mean morning, afternoon and evening) and believed that working was too much effort and that she should not be expected to do so. Not only they are materialistic, they also believe that they are entitled to the life of a Maharajah without ever doing anything to deserve it, just because they exist. ",
            "date": "Answered June 29, 2018",
            "views": "400",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jane Doe",
                    "user_href": "/profile/Jane-Doe-520"
                }
            ]
        },
        {
            "author_info": {
                "name": "Danielle Dinap",
                "href": "/profile/Danielle-Dinap"
            },
            "answer_text": "I'm answering this from being married to one. Oddly, he himself didn't need a fancy car etc…but what was funny was that he would show off my car…the car he made sure he bought his wife bc ‘she deserved the world’ the house- that was completely renovated with the finest…by me, his crafty, artistic wife…or the neighborhood we lived in- how safe and neighborly it was… So, in essence, was he really materialistic? I think in a big, huge, gigantic way…BUT…who did he blame for being needy and wanty and materialistic? Yours truly… (which, btw…I worked my whole life to attain nice things and can afford what I have without him bc of putting myself through school- I appreciate good things and give plenty…actually, more than plenty…) In short…YES!!! Way YES! ",
            "date": "Answered July 21, 2017",
            "views": "15",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Iris Guevarez",
                    "user_href": "/profile/Iris-Guevarez"
                },
                {
                    "user_id": "Milly Stuchinski",
                    "user_href": "/profile/Milly-Stuchinski"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andres Argutti",
                "href": "/profile/Andres-Argutti"
            },
            "answer_text": "In my experience, a big YES. She was always wanting for more in that sense too (although I was the only one who brought an income to our home). A better house. Better furniture. A better car. Of course the “best” was impossible to reach. If I earned 50 she would ask for 80 and spend for 90. If I earned 80 she would ask for 100 and spend for 120. If I earned 100 she would claim 200 and spend for 300 - and every time she would devalue, insult and mistreat me for not measuring up to her expectations. There was always a point to compare me - higher and better than me invariably. No matter if 99 people in a hundred earned less money than me, she would always compare me with the only one who earned more - and there’s always somebody that earns more than you. Also, she used to envy other people, even close friends of us, for the good or expensive things they had. ",
            "date": "Answered June 22, 2018",
            "views": "908",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Iram Ghulam Ahmad Khan",
                    "user_href": "/profile/Iram-Ghulam-Ahmad-Khan"
                },
                {
                    "user_id": "Frida Schiess",
                    "user_href": "/profile/Frida-Schiess"
                },
                {
                    "user_id": "Cristine Dean",
                    "user_href": "/profile/Cristine-Dean"
                },
                {
                    "user_id": "Eric Nicholson",
                    "user_href": "/profile/Eric-Nicholson-23"
                }
            ]
        }
    ]
}