{
    "title": "Are there any recent classical theories of consciousness that supports the mind is a product of brain 'monism' and falsifies 'Orch OR' theory of quantum mind and dualism? - Quora",
    "tags": [
        "Theory of Mind",
        "Philosophy of Quantum Mechanics",
        "Dualism",
        "Neuropsychology",
        "Philosophy of Mind",
        "Cognitive Neuroscience",
        "Cognitive Science",
        "Consciousness",
        "Theory and Theories",
        "Quantum Mechanics",
        "The Mind",
        "Human Brain",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Valdis Klētnieks",
                "href": "/profile/Valdis-Klētnieks"
            },
            "answer_text": "Are there any recent classical theories of consciousness that supports the mind is a product of brain 'monism' and falsifies 'Orch OR' theory of quantum mind and dualism? Theories don’t support or falsify things like that - theories make predictions, which can then falsify something. So - if a theory makes a prediction different than what “mind is a product of brain monism” predicts, then testing that will support one prediction and falsify the other prediction (unless of course some *other* result is found, falsifying both of them). At that point, people supporting the theory whose prediction just got falsified get to either fix their theory so it predicts the now-established result, or toss it in the dumpster and follow it with a Molotov cocktail. For the record, at the current time, nobody reputable thinks “quantum mind” is anything other than “quantum woo” - we’re quite sure that consciousness is an emergent phenomenon having to do with the number of neurons and their interconnections, not quantum mechanics. ",
            "date": "Answered October 3, 2020",
            "views": "353",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Seb Smith",
                    "user_href": "/profile/Seb-Smith-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "B. A. Rehl",
                "href": "/profile/B-A-Rehl"
            },
            "answer_text": "It isn’t really necessary to falsify Orch OR theory since there is no supporting evidence. It exists as a rather fanciful conjecture and little else. And dualism as a theory is even worse than Orch OR. All of the evidence supports the idea that consciousness is created by the operation of a brain. ",
            "date": "Answered October 4, 2020",
            "views": "314",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Abdel Fudadin",
                    "user_href": "/profile/Abdel-Fudadin"
                }
            ]
        }
    ]
}