{
    "title": "Are habits good or bad? - Quora",
    "tags": [
        "Bad Habits",
        "Habits",
        "Understanding Self-Improvement",
        "Self-Improvement",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rabi Kant Bharti",
                "href": "/profile/Rabi-Kant-Bharti"
            },
            "answer_text": "Habits are always  bad, do not depends on anything whether they are good habits or bad habits. Habits means you are not aware that is why Buddha said get rid of habits and be aware of every moment.  Let me give a practical examples: A guy has good habit of worshiping with incense sticks and another guy has bad habit of smoking. if you hide the matchbox of the guy who is going to fire  incense sticks. He will search if does not get. He gets angry. If you hide the matchbox of a smoker before smoking. He also gets angry.  Anger itself is bad. It results in Heart problem and several diseases.  Habits are bad...This story will make you also clear that how habits are bad: There is a story that when the great library of Alexandria was burned, one book was saved. But it was not a valuable book, and so a poor man, who could read a little, bought it for a few coppers. It was not very interesting, yet there was a most interesting thing in it. It was a thin strip of vellum on which was written the secret of the “touchstone”. The touchstone was a small pebble that could turn any common metal into pure gold The writing explained that it was on the shores of the Black Sea lying among thousands and thousands of other pebbles which looked exactly like it. But the secret was this: the real stone would feel warm, while ordinary pebbles are cold. So the man sold his few belongings, bought some simple supplies, camped on the seashore, and began testing the pebbles. This was his plan: he knew that if he picked up ordinary pebbles and threw them down again because they were cold, he might pick up the same pebbles hundreds of times. So when he felt one that was cold he threw it into the sea. He spent a whole day doing this, and they were none of them the touchstone. Then he spent a week, a month, a year, three years… but he did not find the touchstone. Yet he went on and on this way: pick up a pebble, it’s cold, throw it into the sea… and so on and so on. Just visualize the man doing it for years and years and years — pick up a pebble, it is cold, throw it into the sea… from morning to evening, for years and years. But one morning he picked up a pebble and it was WARM — and he threw it into the sea. He had formed the habit of throwing them into the sea, you understand, and habit made him do it when at last he found the touchstone, poor fellow. That’s how mind functions. Trust is a touchstone. Very rarely do you find a man in whom you can trust. Very rarely do you find a heart who is warm, loving, in whom you can trust. Ordinarily you find pebbles which look like the touchstone, almost alike, but all are cold. year in, year out, from the very childhood: you pick up a pebble, you feel it, it is cold, you throw it into the ocean.  ",
            "date": "Answered March 21, 2016",
            "views": "18",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jerry Mao",
                    "user_href": "/profile/Jerry-Mao-4"
                },
                {
                    "user_id": "Mrityunjay Shukla",
                    "user_href": "/profile/Mrityunjay-Shukla-7"
                },
                {
                    "user_id": "Mahesh Maurya",
                    "user_href": "/profile/Mahesh-Maurya-10"
                },
                {
                    "user_id": "Fåisål Yúsùfzåi",
                    "user_href": "/profile/Fåisål-Yúsùfzåi"
                },
                {
                    "user_id": "Priya Singh",
                    "user_href": "/profile/Priya-Singh-611"
                },
                {
                    "user_id": "Shree Kant Pandey",
                    "user_href": "/profile/Shree-Kant-Pandey"
                },
                {
                    "user_id": "Prasant Dubey",
                    "user_href": "/profile/Prasant-Dubey-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Asa Sherrill",
                "href": "/profile/Asa-Sherrill"
            },
            "answer_text": "Don't discard the psychologist on the Amazon review, he/she is correct. Habits aren't good or bad; habits are how the human mind operates. I'll briefly explain.  Evolutionarily speaking, thinking is bad. Thinking is where mistakes are made, where guesswork comes into play, and in general, requires us to focus our resources on dreaming up novel solutions rather than following tried and true methods. From a survival perspective, we want to take in an observation from the environment and act on that without considering all the alternatives. Picking the wrong alternative in a life and death situation could lead to, well, death.  From this standpoint, habit forming is a mechanism for creating behavior that requires minimal thinking. In a very simplified view, this is not entirely unlike how a stream of water forms and flows down a hill.  At first, the water goes everywhere, splattering over the rocks, flooding. It doesn't know exactly where to go. But, over time, the water carves out a nice, neat little valley. The decisions are all made, the water will follow the predetermined path. In a sense, this is exactly what a habituated behavior is; a carved out predetermined series of steps. It has a beginning and an end. When, if the water wanders out of its predetermined steps, it doesn't know what to do anymore (unless there's another habit/behavior there, waiting to guide it). Now, the brain struggles to form a new path, drawing on its own information (intuition), on external information, or social information to begin constructing a new neural path to its ultimate destination.   The problem of good or bad habits comes into play when we look at the pathways that are created. Let's consider a more mundane habit: driving to work. When you wake up in the morning and its a weekday, that's a trigger that kicks in your \"going to work\" habit. The distinctions that make this a good or bad habit happen in the nuance of the pathway. I could: Take a taxi, costing me $30 a dayRide my bike, exercising on the wayDrive my caretc… Which habits are good and which are bad? When you make a decision, the water begins to flow down the hill. Over time, as we make this decision more and more regularly, the channel gets deeper and deeper until there's no more decisions to make. Leaving the channel requires a more drastic trigger. These habits could cause: (Taxi) hundreds of dollars a month in fees, but i can do other things during my commute.(Bike) better health, but a longer commute.(Car) reasonable vehicle and gas expensesSo, with that understanding, what is a good habit and what is a bad habit? A good habit is a behavior that engenders good results, and a bad habit is one that engenders bad results.  Ultimately, the question needs to flip on itself a bit. We are habit forming creatures, for better or for worse. When we understand this about ourselves, we can look at our anecdotal decisions as being much more damning. Smoking that one cigarette may feel good right now, but you may be doing yourself a disservice by starting to etch out a bad behavior.  We have no choice in whether or not we develop habits, they will simply develop - whether or not we allow them to lead us to misfortune is entirely up to you. ",
            "date": "Answered December 12, 2013",
            "views": "24",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dolores Kuhnle",
                    "user_href": "/profile/Dolores-Kuhnle"
                },
                {
                    "user_id": "Jesse Pifko",
                    "user_href": "/profile/Jesse-Pifko-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frank Robertson",
                "href": "/profile/Frank-Robertson-27"
            },
            "answer_text": "Your question: Are habits good or bad? As a kid, I was very creative. I had this huge imagination. I spent a lot of time daydreaming. On top of that my older sisters would always accuse me of copying them. So, there was this huge pressure to do things differently. Everything always had to be original. I could not stand things being repetitive, boring. In a way it worked for me. But, as such I developed an abhorrence of habits.  A good friend of mine at that time used to say: “In life one must try everything!” He then left to make a long trip into the jungle. He later became a physicist. I also remember that for one summer he was a salesperson in a porn shop!  Skip forward to today. This abhorrence of habits has worn off. I have many habits. They allow me to do things without having to think too much. I can do things faster, and they can become a lot easier. It gives order. And it also gives rhythm. It is easy to plan going from point A to B, because you know the route perfectly. And sometimes it is nice to be in a familiar environment.  And yet, if possible, I often still look for new things to do. And for new ways to do things. I would like to think that habits are only 10% of my current life. But that would be a lie. If you want an honest answer, I am afraid it is the other way round. All the best ! ",
            "date": "Updated April 8, 2019",
            "views": "319",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Hildebrandt",
                "href": "/profile/Michael-Hildebrandt-11"
            },
            "answer_text": "To keep it super simple here. 95% of our daily actions are performed unconsciously. This works kind of like and autopilot. That way you can e.g. run and talk at the same time. Listening to this can help you to get a better understanding of habits: #006 - habits - sleeptrust - If the autopilot is performing in your favor (you are getting the results in life that you want to have & you feel the way you want to) we are speaking about good habits. - Often the autopilot is ‘programmed’ in a way that prevents us from getting the results we want to have or to feel the way we would prefer to. In this case we are talking about bad habits. - Habit creation requires some effort but you can imagine how valuable it is to have that 95% working in your favor. Put in the effort and thrive. To create a new habit can take up to over a year but it gets easier every day and is well worth putting in the effort. ",
            "date": "Answered December 21, 2018",
            "views": "239",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Frank Robertson",
                    "user_href": "/profile/Frank-Robertson-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Conroy",
                "href": "/profile/Chris-Conroy-3"
            },
            "answer_text": "To answer your question, one must first understand the meaning of a habit which is simply an action taken on impulse due to the repetition of this action in similar situations, and this impulse is done without thought.  One may choose to create either good or bad habits. A bad habit would be to smoke cigarettes. You smoke cigarettes everyday and eventually you are smoking after every meal without thought.  A good habit would be to brush your teeth after ever meal. You have brushed your teeth after every meal for years and so you do so without thinking about it. So in conclusion habits are not necessarily bad, habits can be very healthy and help some keep their daily routine in order. Having a bad habit however can be very detrimental to ones mental or physical health. ",
            "date": "Answered December 12, 2013",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Nolan",
                "href": "/profile/Robert-Nolan-5"
            },
            "answer_text": "Habits are good or bad *dependent upon context*. Out of context, they just are. Better than good/bad would be True and Out of True. That which is True keeps results aligned with intent. That which is Out of True leads to misaligned results. For an example of how true is already used this way:If a shooter's aim is true, he hits his target. If it's out of true, he misses. (I have a distaste for False. False implies wrongness, when whatever appears False may well be True in another context. Thus my preference for Out of True.) ",
            "date": "Answered December 12, 2013",
            "views": "434",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Leonardo Juan",
                    "user_href": "/profile/Leonardo-Juan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pat Nolan",
                "href": "/profile/Pat-Nolan-17"
            },
            "answer_text": "No. The good and bad habit are both the same in structure. They both have a trigger, a routine, and a reward. Certainly, how they affect us is good or bad, but that’s the net result and not what the habit is about. Habits are shortcuts. They allow us to recognize and respond to situations that we encounter on a regular basis. Before you attempt to change a habit, it’s a good idea to make sure that you understand what you’re working with. Some apparently bad habits have good results. ",
            "date": "Answered January 25, 2019",
            "views": "161",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Frank Robertson",
                    "user_href": "/profile/Frank-Robertson-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Hu",
                "href": "/profile/James-Hu-2"
            },
            "answer_text": "Habits are just a “non-thinking” action of reminding your sense of self in what to do next. Neither good nor bad. Some are considered “beneficial” and “healthy.” Some are not. If you feel comfortable with your habits, then so be it. That is who you desire to be. That is your story. If you feel repetitiveness gets stagnant, then try something refreshing. You create another story. ",
            "date": "Answered January 12, 2019",
            "views": "144",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Frank Robertson",
                    "user_href": "/profile/Frank-Robertson-27"
                }
            ]
        }
    ]
}