{
    "title": "Are most major philosophers now irrelevant? - Quora",
    "tags": [
        "Irrelevance"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Butler",
                "href": "/profile/Tom-Butler-79"
            },
            "answer_text": "Ideally, philosophers help us sort out what we know and think we know about ourselves and the world we live in. Few of us are able to take the time to contemplate the more abstract aspects of our daily experiences. Thinking about the same sort of subject for a long time tends to give the thinker insight about the subject the average person will not see without help. Our philosopher’s job is to help us think. A person who can be considered a philosopher is one who has taken the time to contemplate concepts, has developed a discerning point of view and has become informed about many subjects related to his or her focus. A person we would consider a wise elder of the community is often such a person. By “major philosophers,” I guess you are thinking of the ancient philosophers of Greece and Rome. It is true that much of their work concerned timeless questions that are still relevant today. But, consider this. Wisdom must be anchored in contemporary experience, else it is of little use. A 2000-year dead philosopher did have important insight about our nature, the nature of the world and our relationship with the world. The problem I see with ancient philosophy is that it has to be explained to us for us to see the point. That is a red flag indicating there is a problem of relevance, and therefore, usefulness. The underlying themes are universal. For instance, the Allegory of the Cave illustrates that we cannot trust our senses alone to understand our nature and ourselves. Plato turned to deductive reasoning to complete the required understanding. Today, we have thinkers who have evolved that deductive reasoning while adding contemporary understanding of psychology, biology, physics and emerging understanding about how we process information for perception and expression. By comparison, our contemporary philosophers make Plato’s work seem primitive. Which is more relevant to you? ",
            "date": "Answered November 22, 2018",
            "views": "154",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Keith Clark",
                    "user_href": "/profile/Keith-Clark-147"
                }
            ]
        },
        {
            "author_info": {
                "name": "Philip Pillari",
                "href": "/profile/Philip-Pillari"
            },
            "answer_text": "Are most major philosophers now irrelevant? No. Many would argue that the words of philosophers like Confucius and Aristotle are more relevant now as they were when these men walked the earth. Think about all of the traditions you do just for the sale of doing them. You know who taught us that? Confucius. Think about all the times you had to find the right balance for an activity. You know who taught us that? Aristotle. Just because someone died 2000 years ago doesn't mean that they are irrelevant to our society. ",
            "date": "Answered November 22, 2018",
            "views": "77",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rick Capezza",
                    "user_href": "/profile/Rick-Capezza"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aleksandar Katanovic",
                "href": "/profile/Aleksandar-Katanovic"
            },
            "answer_text": "Philosophy is mostly about conceptual investigations concerning the questions that cannot be easily resolved through (scientific) empirical observations. Questions that are of interest in a philosophical enquiry are many and broad, such as the question of the nature of being and knowledge; questions concerning the the foundation of logic, or the nature of meaning in philosophy of language; questions about morality or our sense of beauty; and many more. Philosophy, understood as rigorous conceptual investigations, cannot be obsolete by new scientific theories and discoveries. Philosophical writings from ancient times (such as we find it in hellenistic philosophy of Greek and Rome, or as we find it in ancient schools of wisdom in Persia, India, China, etc.) are still relevant because they deal with questions that are still asked by modern (and/or postmodern) philosophers, questions that have not been resolved throughout the long history of philosophy. ",
            "date": "Answered November 22, 2018",
            "views": "103",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sheldon Rokeach",
                    "user_href": "/profile/Sheldon-Rokeach"
                }
            ]
        }
    ]
}