{
    "title": "Are philosophers closer to reality? - Quora",
    "tags": [
        "Continental Philosophy",
        "Analytic Philosophy",
        "Ontology (philosophy)",
        "Metaphysics",
        "Philosophers",
        "Reality",
        "Truth",
        "Philosophy",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bala Pillai",
                "href": "/profile/Bala-Pillai"
            },
            "answer_text": "Not at all. The world would be in as good a shape as #mango_seed_AI and the #Computational_Dog (Common Sense) if they were. Barring exceptions, the world is not even 1% of them. In particular on the most-important aspects such as:- Readiness to self-start (Not “I have to get instructions from X”)DecisivenessReadiness to make tons of mistakes early and learn by mistakes (My last mis-take is my best teacher)Correcting the norm and norming the correct.Not being petty. Not missing the forest for the trees.Connecting the dots that matter.Zero excuses.Zero artificial abstract bogeymen (eg the utterance “God-Willing/Insha Allah”)Huge blindspots of philosophers are:- Pedagogy eg 1) criticality of spontaneity and trusted channels and 2) Diffusion Theory 3) Countering Nasty Win-Lose Religion 3) Nyeting like the rambutan seed does#Current_CurrencyUndoing #False_DichotomiesUndoing Mindset Barriers. Via Mindset Graphs.Undoing Post-Modernism eg countering frogwarming and anti-generalisation cliche responsesUndoing #under_the_radar nastiesNot cognisant of “Some people make the world happen, more watch, most wonder.”Not missing the forest for the trees. (Tamil paanai within paanai or Russian babushka doll is essential metaphor)Stepped-up questions to clarity of thought thus willAddressing meaning to lesser sensibility humans. They get meaning via Semiotics Not SemanticsEssential Epistemology Notions & Slogans eg “Fish Does Not Know Water”, “Missing The Forest For The Trees Has Consequences” and about 50 more.UnMatrixing dialogue templatesValue of Cuss Words As Middle-Path between Passive-Aggressiveness & Violence/#under_the_radar terror",
            "date": "Updated October 18, 2019",
            "views": "333",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Robert K. Russell",
                    "user_href": "/profile/Robert-K-Russell-1"
                },
                {
                    "user_id": "Vrinda Arora",
                    "user_href": "/profile/Vrinda-Arora-55"
                },
                {
                    "user_id": "Robet Schall",
                    "user_href": "/profile/Robet-Schall"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vern Wall",
                "href": "/profile/Vern-Wall-1"
            },
            "answer_text": "Philosophy is the study of wisdom. You can not point to wisdom or measure it, so it may or may not relate to reality. Practical knowledge is left to servants and tradesmen. This difference leads to sharp distinctions in schooling methods. Lower classes have always been educated to perform a job. That system produces servants, technicians, and soldiers. Upper classes have always had a very different education in a system that produces generals, philosophers, and entrepreneurs. Here are a book and an essay to help you understand: The Lost Tools of Learning The Lost Tools of Learning The Underground History Of Public Education Full text of \"John Taylor Gatto The Underground History Of American Education Book\" ",
            "date": "Answered September 5, 2019",
            "views": "66",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Robet Schall",
                    "user_href": "/profile/Robet-Schall"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martin Cosentino",
                "href": "/profile/Martin-Cosentino-1"
            },
            "answer_text": "Mr. Schall, with due respect, you must FIRST define what you mean by ‘reality’ and THEN, describe the parameters that recognize who comes the closest to satisfying these parameters. There are a plethora of ‘realities’ - physical, mental, spiritual, emotional, and there is a professional out there who is practicing defining more precisely these realities as expressions of our diversity as a species of living beings. The quantum physicists, to date, do NOT admit that there is a non-material component to the wave/particle duality found in light, and the probabilities involved in a particle ‘being’ - and NOT being, at the SAME time. How can a particle be a mass, and a force of energy, SIMULTANEOUSLY???? Because their thinking is unfortunately embedded in materialism, they cannot step outside to see the forest for the trees. They need to have a visible object to measure in order for them to say ‘ this is ‘real’ thing. Philosophers, theologians, social professionals, they are accustomed to dealing in non-tangible entities - namely WORDS that describe intelligible concepts which we us to describe ‘reality.’ AND to determine if that reality has to be ‘adjusted’ to suit current demands and needs. ’ You can obviously see a vast gap between the physical and the ‘spiritual’ here, and I DON’T mean religious. It is the philosophers and theologians who WILL explain the complexities of reality, because they are using a vocabulary we can comprehend, and it is only when that comprehension becomes more credible and acceptable than the scientists equations, formulas and theories, that it is advisable the scientists start looking for other occupations. ",
            "date": "Answered September 14, 2019",
            "views": "45",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Robet Schall",
                    "user_href": "/profile/Robet-Schall"
                }
            ]
        },
        {
            "author_info": {
                "name": "Donald Russell",
                "href": "/profile/Donald-Russell-51"
            },
            "answer_text": "No. They are not. Before what was and where has rearranged, they cannot find the words to implement a final imposition. A lasting benchmark can not be devised for the what will be, to wonder about. Its not an insult, I mean who is thinking like dust right now? I mean come on, you weren't thinking like dust,how could you? With that being said, we are as close to reality as the time it takes to return it. Philosophers that is…. ",
            "date": "Answered September 5, 2019",
            "views": "92",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Robet Schall",
                    "user_href": "/profile/Robet-Schall"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gilbert Duy Doan",
                "href": "/profile/Gilbert-Duy-Doan"
            },
            "answer_text": "Philosophy people can be normal enough to talk in common parlance and ordinary words of conversation. Their subject matter already deals with reality as a term in metaphysics, which is the study of reality in the nature or structure of reality. How much that study is applicable, relevant, or true to the common lives of people as citizens in public and society, is a different issue that is about academic or scholarship transfer to ordinary living. Though in another sense, philosophy people study what the structure and nature of society, social groups and contracts, and political systems are as well in social and political philosophy. That branch again, is subject to how applicable and realistic to the world of people and common dialogue. ",
            "date": "Answered September 5, 2019",
            "views": "106",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Robet Schall",
                    "user_href": "/profile/Robet-Schall"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Horton",
                "href": "/profile/David-Horton-67"
            },
            "answer_text": "Are philosophers closer to reality? Certainly to their own reality ? But the trouble is, … last time I checked there were no true ultimate arbiters of reality to officiate who is closer and who is not … however, if you are a philosopher don't let that little inconvenient truth get in your way Unfortunately, physicists might also have a thing or two to say about this reality 'thing' ",
            "date": "Answered September 5, 2019",
            "views": "50",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Philip Hendricks",
                    "user_href": "/profile/Philip-Hendricks-8"
                },
                {
                    "user_id": "Robet Schall",
                    "user_href": "/profile/Robet-Schall"
                }
            ]
        },
        {
            "author_info": {
                "name": "Al Klein",
                "href": "/profile/Al-Klein"
            },
            "answer_text": "Closer than what - homicidal schizophrenics? Probably. Than most sane and rational people? Probably not. They’re closer to their distorted view of reality than most, but that view isn’t reality. ",
            "date": "Answered September 5, 2019",
            "views": "54",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jim Rahn",
                    "user_href": "/profile/Jim-Rahn"
                },
                {
                    "user_id": "Robet Schall",
                    "user_href": "/profile/Robet-Schall"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Kunkle",
                "href": "/profile/Daniel-Kunkle"
            },
            "answer_text": "Not necessarily. Every human being lives in the reality that is. Socrates does have a point though when he says that the unexamined life is not worth living. I think all people would do well to be more reflective about the big questions of life. ",
            "date": "Answered September 7, 2019",
            "views": "20",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Robet Schall",
                    "user_href": "/profile/Robet-Schall"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nikolas Mavros",
                "href": "/profile/Nikolas-Mavros"
            },
            "answer_text": "We are all close to reality. Some philosophers just happen to understand some of its most fundamental (not most specific!) aspects with more clarity, breadth and detail. ",
            "date": "Answered December 1, 2019",
            "views": "17",
            "upvotes": "0"
        }
    ]
}