{
    "title": "Are paradoxes real? - Quora",
    "tags": [
        "Paradoxes",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Terry Rankin",
                "href": "/profile/Terry-Rankin"
            },
            "answer_text": "The definitions of the two key words — “paradox” and “real” — determine the answer. Since those definitions can vary, so can the answer. Basically, a ‘paradox’ is a logical contradiction, as in a proposition that is both true and false at the same time, of the form ‘p & not-p.’ But the broader notion is more complicated. Probabilistic logic can assign probable truth and probable falsity to the same proposition at the same time without thus creating paradox. For one toss of a six-sided die, for instance, the probably of rolling a 3 is 1 in 6 (about 16.67%) and the probability of not rolling a 3 is 5 in 6 (about 83.33%). In quantum mechanics, the notion of paradox is very problematic, moreso than can be adequately explained here. Whether or not paradoxes and logical contradictions are ‘real’ depends largely on what we think the ontological status of language is. The expression of a paradox is a function of language, after all, so those expressions are exactly as real as the language used to form them. Whether or not those expressions refer to manifest physical reality is the underlying issue of semantics (of a language) and the ontic form, structure, and contents of the cosmos — and whether and how semantics reliably maps the language onto that reality, or not. Semiotically, the issue is whether or not signs in human experience actually stand for things in the real world. When we observe a straight rod partially submerged in a clear liquid, for example, it appears bent or angled … which is the reality? We know it was straight before we immersed it partially in that liquid, but the perceptual signs we experience say it’s no longer straight. Once we take into consideration the refraction properties of light, however, the answer is that both observations are real properties of the actual world, despite the apparent contradiction: the rod is no less straight in or out of the liquid — light refraction simply alters the observer’s perception of that straightness. The bottom line is that paradoxes are as real — or not — as the perspective and belief system of the observer say they are (or aren’t). The causal reality of paradox and contradiction independent of human cognition is another very complex problem, however, and one’s beliefs about this determine their views as being (some version of) realism or idealism. ",
            "date": "Answered September 22, 2017",
            "views": "817",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ronnie Aspbäck",
                    "user_href": "/profile/Ronnie-Aspbäck"
                },
                {
                    "user_id": "Anirudh Swaminathan",
                    "user_href": "/profile/Anirudh-Swaminathan-3"
                },
                {
                    "user_id": "Mills Baker",
                    "user_href": "/profile/Mills-Baker"
                },
                {
                    "user_id": "Moea Cabral",
                    "user_href": "/profile/Moea-Cabral"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marcus Lester",
                "href": "/profile/Marcus-Lester-2"
            },
            "answer_text": "Paradoxes arise in many fields. In medicine, for example, a paradox is two doctors. In the abstract sense, two logically correct statements lead to an absurd or contradictory conclusion. Even so, many paradoxes lead us to a deeper understanding of ourselves and what we conveniently call the world or the universe. For example, Heraclitus of Ephesus famously said, “We both step and do not step in the same river.” Look at the river today, which was also there yesterday. It is the same river. And yet, everything has changed. Water is gone and replaced by new water, rocks have been moved, sand is removed, other sand is deposited. As a geographer, I am profoundly interested in scale, how coarsely or finely I observe the world. The problem of the river, is a problem of scale. At different scales, different things are simultaneously true. For another more contemporary example, Albert Einstein said, “Concerning matter, we have been all wrong. What we have called matter is energy, whose vibration has been so lowered as to be perceptible to the senses. There is no matter.”\u009d He said this almost a hundred years ago, but we still overlook this scientific reality. Therefore, each thing we know is actually a local condensation of energy in a vast and interconnected, dancing field of energy. A rock is not a rock. And yet, a rock is a rock, and if it falls on me, I shall surely be injured. So, a rock is and is not a rock. Therefore, again, if I am a geologist or a hiker, it is a good thing to know about rocks. On the other hand, if I were to search for God, I need to know a more fundamental truth about rocks and people. And finally, if I were to find God, I would still need to sweep the rocks from my floor to clean it. This understanding leads to the greatest paradox: We are and we are not God. And lastly another one: You are not the person who started to read my confusing discussion of paradox. ",
            "date": "Answered September 22, 2017",
            "views": "365",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Calvin Odom",
                    "user_href": "/profile/Calvin-Odom"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joshua Huntington",
                "href": "/profile/Joshua-Huntington-1"
            },
            "answer_text": "None of the other answers attempt a serious intellectual assessment of your question on a purely philosophical level. Here is my attempt. Consider the following sentence: “This sentence would undoubtedly meet the definition of paradoxical, if it were true that paradoxes were not real.” Or you may prefer: “If paradoxes were not real, then this sentence would surely present a paradox!” The above statements are undeniably true. Since the above statements are certainly true, then it necessarily follows that if paradoxes were not real, then the above sentences would certainly be paradoxes. Therefore, unless you are willing to throw out modus ponens, or perhaps all of Boolean algebra (in which case why bother assess if *anything* is real), then you must necessarily conclude that even if paradoxes did not exist, they still would. So… my answer is: Yes! Paradoxes are real. Enjoy. ",
            "date": "Answered September 23, 2017",
            "views": "200",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Tearne",
                    "user_href": "/profile/John-Tearne-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sheila Davis",
                "href": "/profile/Sheila-Davis-36"
            },
            "answer_text": "Definition of the word paradox: a statement that contradicts is unbelievable, absurd, which in fact may actually be true. I would say yes, look at just what man does and says, contradictory, unreal, absurd, unbelievable, yet true. And there's the flood of Noah, is always said that couldn't happen. ABC News #1788453, report says there is evidence found that supports the biblical flood of Noah actually happened around 12,000 years ago. There is The Parting of the Red Sea, now is being said could have happened, written in the Washington Post 12/8/20 14 by Chris Mooney #477820050684, strong winds (maybe tornado like). ",
            "date": "Answered September 22, 2017",
            "views": "104",
            "upvotes": " Answer requested by Allan Zhou",
            "upvoters": [
                {
                    "user_id": "Pierre Bougrat",
                    "user_href": "/profile/Pierre-Bougrat"
                },
                {
                    "user_id": "Wycliffe Musasio",
                    "user_href": "/profile/Wycliffe-Musasio"
                },
                {
                    "user_id": "Calvin Odom",
                    "user_href": "/profile/Calvin-Odom"
                },
                {
                    "user_id": "Eric Vincent",
                    "user_href": "/profile/Eric-Vincent-13"
                },
                {
                    "user_id": "Mark Hancock",
                    "user_href": "/profile/Mark-Hancock-13"
                },
                {
                    "user_id": "David Moore",
                    "user_href": "/profile/David-Moore-408"
                },
                {
                    "user_id": "Lesley-Anne Weir",
                    "user_href": "/profile/Lesley-Anne-Weir-1"
                },
                {
                    "user_id": "Jenny Hawkins",
                    "user_href": "/profile/Jenny-Hawkins-4"
                },
                {
                    "user_id": "Andi Alexander",
                    "user_href": "/profile/Andi-Alexander"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Sibbald",
                "href": "/profile/Stephen-Sibbald-1"
            },
            "answer_text": "My favorite paradox is very real: the wave–particle duality of light. When light passes through two holes in a screen, light emerging from one hole interferes with light from the other hole. The light behaves as a pure wave, much like water or sound; butWhen light strikes a metal, it will dislodge electrons only if each photon in the light has sufficient energy. The light behaves as a stream of energized particles.So is light waves or particles? Einstein said, It seems as though we must use sometimes the one theory and sometimes the other, while at times we may use either. We are faced with a new kind of difficulty. We have two contradictory pictures of reality; separately neither of them fully explains the phenomena of light, but together they do. Is this paradoxical enough and real enough for you? ",
            "date": "Answered September 22, 2017",
            "views": "13",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "NandKishor Bodhak",
                    "user_href": "/profile/नंदकिशोर-बोधक-NandKishor-Bodhak"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Tearne",
                "href": "/profile/John-Tearne-1"
            },
            "answer_text": "The Banach-Tarski paradox is very real. Banach–Tarski paradox - Wikipedia The paradoxical result comes from including the Axiom of choice in mathematics. So we can get rid of the paradox by dispensing with Choice. Unfortunately mathematicians in general like Choice so we have a sort of meta-paradox. Accept the axiom of choice and live with a paradoxical result or get rid of choice and live with a counterintuitive mathematics. In the end when discussing paradoxes we should keep in mind the words of Robert Heinlein — “There is no paradox that can't be paradoctored.” ",
            "date": "Answered September 23, 2017",
            "views": "166",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Min Khin Kyaw",
                "href": "/profile/Min-Khin-Kyaw"
            },
            "answer_text": "If dealing with theory or hypothesis, a paradox can’t be real. But if dealing with real things, it can be real. For example, one famous paradox is ‘could the almighty create a stone he cannot lift?’ Here it is the paradox that deals with two real conflicting statements. The conflict is of omnipotence - God can do everything, then God must be able to do anything, including ‘creating a stone he cannot lift’ but ‘he can lift it’. ",
            "date": "Answered September 23, 2017",
            "views": "139",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Chin Yeh",
                    "user_href": "/profile/Chin-Yeh-1"
                },
                {
                    "user_id": "Jan Fargo",
                    "user_href": "/profile/Jan-Fargo-1"
                },
                {
                    "user_id": "Brian Tremback",
                    "user_href": "/profile/Brian-Tremback-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Jermey",
                "href": "/profile/Jon-Jermey"
            },
            "answer_text": "Paradoxes are purely verbal phenomena. They point out difficulties and problems with the way our language works. It can be useful to know at times that our language occasionally fails us, but it’s usually not particularly important. We generally manage to communicate what we need to. And paradoxes and other ‘philosophical’ problems have no bearing on the real world at all. ",
            "date": "Answered September 23, 2017",
            "views": "217",
            "upvotes": " View 3 Upvoters "
        }
    ]
}