{
    "title": "As an atheist, have you ever met a theist who treated you badly because you’re an atheist? - Quora",
    "tags": [
        "Atheism vs. Theism",
        "Religion and Atheism",
        "Atheists",
        "Atheism",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tony Castaldo",
                "href": "/profile/Tony-Castaldo-3"
            },
            "answer_text": "Q: As an atheist, have you ever met a theist who treated you badly because you’re an atheist? Absolutely. The most grievous example, in my mid-20’s I took a technical coding contract at a company, working on a new hardware product. It was a six month contract with a private company, one owner. It was interesting, the pay was great, I was highly qualified. For a month I did well, I was weeks ahead of schedule already, my supervisor was enthusiastic about how well we were doing. I was working in-house and getting along with my other coworkers. At lunch, the subject of religion came up, and I casually mentioned the fact that I was an atheist. A week later, my supervisor, seeming dejected, called me into a meeting with the company owner, and an attorney. The owner said there was a rumor going around that I was an atheist. I said I was, but how was that a problem? He told me he thought it was bad for morale, thanked me for my service, but they were exercising their rights within the terms of my contract to terminate my services effective immediately. My supervisor escorted me to my desk, to collect anything I had there. I said “Well, I hope I gave you guys a good start, at least.” He apologized, and told me he wasn’t allowed to use any of the work I did. He had to scrap it and start over. Turns out, the owner was a rabid literalist Christian. No severance, no notice, pick up your things, don’t touch the computer, let’s go. Nothing illegal about this, I was an hourly contractor, like most contractors in the late 1970’s I could be terminated at will for any reason whatsoever. But it was shocking, this guy abandoning thousands of dollars worth of work and setting his project back a month because he found out the code was being written by an atheist. And even though I’m pretty frugal with my finances, it was a financial setback for me, too.  In less impactful cases, I have had girls at school (high school and college) refuse to be in a group with me, because I was an atheist. I wasn’t a jerk, I grew up with sisters and had some inkling of what was offensive. I never touched any girls or made any sexual comments. In other words, I don’t think my atheism was an excuse to avoid me, I think it was sincere. On the flip side, in my 30’s I married a church-going Christian, that knew I was an atheist, and 31 years later we are still happily married, though life becomes more difficult with age and physical degeneration, for both of us. ",
            "date": "Answered October 18, 2020",
            "views": "152",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alan Carlson",
                    "user_href": "/profile/Alan-Carlson-2"
                },
                {
                    "user_id": "Robert Larson Jr",
                    "user_href": "/profile/Robert-Larson-Jr"
                },
                {
                    "user_id": "Frank Dauenhauer",
                    "user_href": "/profile/Frank-Dauenhauer"
                },
                {
                    "user_id": "Phil Kaminsky",
                    "user_href": "/profile/Phil-Kaminsky-2"
                },
                {
                    "user_id": "Jim Brown",
                    "user_href": "/profile/Jim-Brown-437"
                },
                {
                    "user_id": "Wes Browning",
                    "user_href": "/profile/Wes-Browning"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Metivier",
                "href": "/profile/Daniel-Metivier"
            },
            "answer_text": "Question: As an atheist, have you ever met a theist who treated you badly because you’re an atheist? Answer: A few years back I lived in a small town in Southeast Texas. I was raising my children as a single Dad. I do not hide the fact that I am an atheist but neither do I go around waving an flag and carrying a megaphone proclaiming that I am. As a result the majority of people who know me are not aware of this fact. There was a small, independent Baptist Church in this town and it had a fire which caused some major damage. Being small they had limited insurance. When they started rebuilding I took a week vacations and me and my children volunteered in the rebuilding project. The Pastor was aware that I was an atheist but no one else in this congregation was. There were 2 older ladies (late 70’s-early 80’s in age) who thought my kids were awesome and that I was such a good Christian Dad. They were so nice and sweet and made sure the kids were safe when I was busy. Every lunch break the Pastor would lead the group in prayer. I did not partake in the prayer but I took off my hat and remained silent out of respect for their beliefs. Then one afternoon midweek the Pastor and I were talking and he was thanking me for taking my vacation time and noted that many of the male congregation were not helping in rebuilding their own church and said something along the lines of “they should be embarrassed that and atheist was doing more then they were” and one of the ladies heard. Within minutes the news had spread and the gossiping became very loud. I noticed that the children my kids had been playing with had been pulled away by their parents. The two ladies were glaring at me and actually walked away from my son when he walked towards them to get a drink. The men I had been working next to for a couple days had also created some space between us and had stopped talking to me. It continued until the Pastor called a stop to the work and addressed the group. He apologized to me and my kids for the behavior of his congregation and severely chastised them for their actions. He pointed out that for the previous 3 days everyone thought I was awesome for taking a week’s vacation time to help when I was not a member of the Church and suddenly I and my children were some kind of threat that need to be avoided. He pointed out that most of the men in the congregation were absent and I had been there from day one. Many of those present actually took his words to heart and came up to apologize to me and my kids. The 2 ladies however would go out of their way to avoid any contact with me or my kids. A minor mistreatment but one that had a big impact on my kids and how they view theists, especially Christians. ",
            "date": "Answered October 17, 2020",
            "views": "826",
            "upvotes": " View 34 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richard Becker",
                    "user_href": "/profile/Richard-Becker-19"
                },
                {
                    "user_id": "Lee Greenberg",
                    "user_href": "/profile/Lee-Greenberg-3"
                },
                {
                    "user_id": "Elin Valle",
                    "user_href": "/profile/Elin-Valle"
                },
                {
                    "user_id": "Samuel Warshaw",
                    "user_href": "/profile/Samuel-Warshaw"
                },
                {
                    "user_id": "Caleb Marsh",
                    "user_href": "/profile/Caleb-Marsh-2"
                },
                {
                    "user_id": "James Grimes",
                    "user_href": "/profile/James-Grimes-1"
                },
                {
                    "user_id": "Andrew Forrest",
                    "user_href": "/profile/Andrew-Forrest-40"
                },
                {
                    "user_id": "Leonardo Rothe Tagliafico",
                    "user_href": "/profile/Leonardo-Rothe-Tagliafico-1"
                },
                {
                    "user_id": "Alan Carlson",
                    "user_href": "/profile/Alan-Carlson-2"
                },
                {
                    "user_id": "Jase Zimmerman",
                    "user_href": "/profile/Jase-Zimmerman"
                },
                {
                    "user_id": "Neil Marshall",
                    "user_href": "/profile/Neil-Marshall-24"
                },
                {
                    "user_id": "Simon Musto",
                    "user_href": "/profile/Simon-Musto-1"
                },
                {
                    "user_id": "Robert Larson Jr",
                    "user_href": "/profile/Robert-Larson-Jr"
                },
                {
                    "user_id": "Gene Buettner",
                    "user_href": "/profile/Gene-Buettner-1"
                },
                {
                    "user_id": "Tarif Wasi",
                    "user_href": "/profile/Tarif-Wasi"
                },
                {
                    "user_id": "João Pargana",
                    "user_href": "/profile/João-Pargana-1"
                },
                {
                    "user_id": "Ivan Ishtar",
                    "user_href": "/profile/Ivan-Ishtar"
                },
                {
                    "user_id": "Phil Kaminsky",
                    "user_href": "/profile/Phil-Kaminsky-2"
                },
                {
                    "user_id": "Richard Stratford",
                    "user_href": "/profile/Richard-Stratford-2"
                },
                {
                    "user_id": "Atharva Jadhav",
                    "user_href": "/profile/Atharva-Jadhav-47"
                },
                {
                    "user_id": "Paul Conrad",
                    "user_href": "/profile/Paul-Conrad-36"
                },
                {
                    "user_id": "Warin Mal",
                    "user_href": "/profile/Warin-Mal"
                },
                {
                    "user_id": "Jim Ashton",
                    "user_href": "/profile/Jim-Ashton-3"
                },
                {
                    "user_id": "Marc Hartley",
                    "user_href": "/profile/Marc-Hartley"
                },
                {
                    "user_id": "Stephen Kuhn",
                    "user_href": "/profile/Stephen-Kuhn-2"
                },
                {
                    "user_id": "James Barton",
                    "user_href": "/profile/James-Barton-129"
                },
                {
                    "user_id": "Ralph King",
                    "user_href": "/profile/Ralph-King-8"
                },
                {
                    "user_id": "Suresh Rao",
                    "user_href": "/profile/Suresh-Rao-200"
                },
                {
                    "user_id": "Louise Sackville",
                    "user_href": "/profile/Louise-Sackville"
                },
                {
                    "user_id": "Riccardo Zanardi",
                    "user_href": "/profile/Riccardo-Zanardi-2"
                },
                {
                    "user_id": "James Baird",
                    "user_href": "/profile/James-Baird-60"
                },
                {
                    "user_id": "Aadhavan",
                    "user_href": "/profile/Aadhavan-4"
                },
                {
                    "user_id": "Chloe Lyde-Stad",
                    "user_href": "/profile/Chloe-Lyde-Stad"
                },
                {
                    "user_id": "Derek Louden",
                    "user_href": "/profile/Derek-Louden-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Catherine Celice",
                "href": "/profile/Catherine-Celice"
            },
            "answer_text": "Yes. I won’t discuss those times, but I will discuss the incident that made me start being open about my atheism. It was only after 9/11 that I decided to be open about my atheism. I kept quiet before because I knew how upsetting it is to so many people when they find out someone is an atheist. In Fall of 2001 I was still working toward my graduate degree in Mathematics and I was in a program that was putting graduate students in sciences and mathematics into middle school classes to help and to explain various concepts. The point was to try to increase the children’s interest in going into sciences and mathematics. I was paired with another graduate math student. She seemed like a lovely lady. She had worked in the program already and both of us were sent to work with a teacher with whom she had worked before, so they were already friends. The teacher also seemed like a lovely lady. It wasn’t long before I realized they were both very religious, Christian, and both read and discussed religious books. Of course, since the attack on the Twin Towers happened early in the term, it was also a topic of conversation. About a month after the terrorist attack I was helping one of the students when the two other ladies stood together on the other side of the classroom to talk, well within earshot of the 7th graders. When I was done I walked over to join them. They were discussing 9/11 and what could be done to stop such things from happening again. One said “all atheists should be killed” and the other agreed. They both truly meant it and they saw THAT as a solution to avoid attacks by religious extremists! I learned then that they thought that all bad things in the world are due to atheists. Obviously I was shocked and I didn’t tell them that I am an atheist, but it started me thinking and paying attention more to what religious people said about atheism. I started to see how much hatred and fear of atheists some religious people feel and I heard many religious people say things that would be outright dangerous to atheists. It scared me because I saw that if these people ended up in control, atheists would be in mortal danger. Remember, these two seeming nice ladies were saying such things in front of children. I realized that the children could easily pick up on these comments and think badly of atheists, too. That was when I decided to start being open about my atheism and stop worrying about how my atheism would upset other people. If I can deal with their religiosity, then they should be able to deal with my atheism. I really do think that people who have bad ideas about atheists have to see that people they know who are perfectly normal can be atheists. I also feel that I have to counteract the negative narrative about atheism being taught to the young. The way I can do that is by letting people know I am an atheist. This is a shock to lots of religious people because I’ve always been considered a “good girl” with high morals so some who think that atheists are immoral and hedonistic cannot get their heads around that. Maybe they’ll start opening their eyes. ",
            "date": "Answered October 16, 2020",
            "views": "287",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Derek Louden",
                    "user_href": "/profile/Derek-Louden-1"
                },
                {
                    "user_id": "Daniel Metivier",
                    "user_href": "/profile/Daniel-Metivier"
                },
                {
                    "user_id": "Crystal Gillis",
                    "user_href": "/profile/Crystal-Gillis"
                },
                {
                    "user_id": "Elizabird Deluna",
                    "user_href": "/profile/Elizabird-Deluna"
                },
                {
                    "user_id": "Abigail Freeman",
                    "user_href": "/profile/Abigail-Freeman-12"
                },
                {
                    "user_id": "Morgan Stewart",
                    "user_href": "/profile/Morgan-Stewart-3"
                },
                {
                    "user_id": "Richard Simons",
                    "user_href": "/profile/Richard-Simons-33"
                },
                {
                    "user_id": "Stephen Kuhn",
                    "user_href": "/profile/Stephen-Kuhn-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Murphy Barrett",
                "href": "/profile/Murphy-Barrett"
            },
            "answer_text": "A theist who treated me badly? No. I’ve been treated badly by many theists. I don’t care to recall the myriad incidents just now, as they are numerous and range from namecalling to assault and battery, but mistreatement for being an atheist isn’t something I find surprising. It made me quite bitter about religion for a long time. I was activly anti-theist for a while. I’ve calmed down a bit, and I can now recognize that religion can do a lot of good for a lot of people. But if you take the spiritual aspect out (going to heaven or what have you), there is no benefit religion provides that you can’t also get without religion, but there are a number of ills that are hard to get without it. I still dislike religion, but I did learn to take a more nuanced view of it, as well as theists, after meeting enough of them who were good people and didn’t act like their more hateful bretheren. Now I view it as kind of a two edged sword. Religion has done a lot of evil in the world, and I’ve been on the recieving end of some of it. But it has also inspired some people to do an awful lot of good.  Original question-As an atheist, have you ever met a theist who treated you badly because you’re an atheist? ",
            "date": "Answered October 21, 2020",
            "views": "65",
            "upvotes": " View 425 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shawna RR Nixon",
                    "user_href": "/profile/Shawna-RR-Nixon"
                },
                {
                    "user_id": "Mate Pavić",
                    "user_href": "/profile/Mate-Pavić-2"
                },
                {
                    "user_id": "Michael Villamonte",
                    "user_href": "/profile/Michael-Villamonte"
                },
                {
                    "user_id": "Patrick Gunn",
                    "user_href": "/profile/Patrick-Gunn-17"
                },
                {
                    "user_id": "Alina Kurian",
                    "user_href": "/profile/Alina-Kurian"
                },
                {
                    "user_id": "Stephen Kowalkowski",
                    "user_href": "/profile/Stephen-Kowalkowski"
                },
                {
                    "user_id": "Dean Walsmith",
                    "user_href": "/profile/Dean-Walsmith"
                },
                {
                    "user_id": "Gary Schukar",
                    "user_href": "/profile/Gary-Schukar"
                },
                {
                    "user_id": "Kent Dahl",
                    "user_href": "/profile/Kent-Dahl-1"
                },
                {
                    "user_id": "Wade Spencer",
                    "user_href": "/profile/Wade-Spencer"
                },
                {
                    "user_id": "Vivekanandan Sharan",
                    "user_href": "/profile/Vivekanandan-Sharan"
                },
                {
                    "user_id": "Alexander Sawatzky",
                    "user_href": "/profile/Alexander-Sawatzky"
                },
                {
                    "user_id": "Clare Speirs",
                    "user_href": "/profile/Clare-Speirs-1"
                },
                {
                    "user_id": "Brian Diedrich",
                    "user_href": "/profile/Brian-Diedrich"
                },
                {
                    "user_id": "Curtis Lewis",
                    "user_href": "/profile/Curtis-Lewis-7"
                },
                {
                    "user_id": "Elliott Curtis-Young",
                    "user_href": "/profile/Elliott-Curtis-Young"
                },
                {
                    "user_id": "Mike Hodorowicz",
                    "user_href": "/profile/Mike-Hodorowicz"
                },
                {
                    "user_id": "Saurav Samantaray",
                    "user_href": "/profile/Saurav-Samantaray"
                },
                {
                    "user_id": "Daniel Mahan",
                    "user_href": "/profile/Daniel-Mahan-12"
                },
                {
                    "user_id": "Dan Sunderland",
                    "user_href": "/profile/Dan-Sunderland-10"
                },
                {
                    "user_id": "Adrienne Delia",
                    "user_href": "/profile/Adrienne-Delia"
                },
                {
                    "user_id": "Jean Marcel Lemos Ribeiro",
                    "user_href": "/profile/Jean-Marcel-Lemos-Ribeiro"
                },
                {
                    "user_id": "Jacob Lucas",
                    "user_href": "/profile/Jacob-Lucas-3"
                },
                {
                    "user_id": "Hunter Cyrus",
                    "user_href": "/profile/Hunter-Cyrus"
                },
                {
                    "user_id": "Arjen van der Weijden",
                    "user_href": "/profile/Arjen-van-der-Weijden"
                },
                {
                    "user_id": "Josh Garcia",
                    "user_href": "/profile/Josh-Garcia-65"
                },
                {
                    "user_id": "Rory LunBeck",
                    "user_href": "/profile/Rory-LunBeck"
                },
                {
                    "user_id": "Manav Krishna",
                    "user_href": "/profile/Manav-Krishna-2"
                },
                {
                    "user_id": "K L",
                    "user_href": "/profile/K-L-1354"
                },
                {
                    "user_id": "Peter Wheeler",
                    "user_href": "/profile/Peter-Wheeler"
                },
                {
                    "user_id": "Tyler Savage",
                    "user_href": "/profile/Tyler-Savage"
                },
                {
                    "user_id": "Sarah Scarborough",
                    "user_href": "/profile/Sarah-Scarborough-18"
                },
                {
                    "user_id": "Jason Sarasti",
                    "user_href": "/profile/Jason-Sarasti"
                },
                {
                    "user_id": "Avi Zeff",
                    "user_href": "/profile/Avi-Zeff-1"
                },
                {
                    "user_id": "Andrew Forrest",
                    "user_href": "/profile/Andrew-Forrest-40"
                },
                {
                    "user_id": "Garryck Osborne",
                    "user_href": "/profile/Garryck-Osborne"
                },
                {
                    "user_id": "Mike Reno",
                    "user_href": "/profile/Mike-Reno-18"
                },
                {
                    "user_id": "Vanessa Edhere",
                    "user_href": "/profile/Vanessa-Edhere"
                },
                {
                    "user_id": "Joshua Ogunsanya",
                    "user_href": "/profile/Joshua-Ogunsanya-1"
                },
                {
                    "user_id": "Erik Bergland",
                    "user_href": "/profile/Erik-Bergland"
                },
                {
                    "user_id": "Neil Jordan",
                    "user_href": "/profile/Neil-Jordan-1"
                },
                {
                    "user_id": "Soumendu Majee",
                    "user_href": "/profile/সৌমেন্দু-মাজী-Soumendu-Majee"
                },
                {
                    "user_id": "Jud Ranger",
                    "user_href": "/profile/Jud-Ranger"
                },
                {
                    "user_id": "Jonathan Furse",
                    "user_href": "/profile/Jonathan-Furse"
                },
                {
                    "user_id": "Gautam Hegde",
                    "user_href": "/profile/Gautam-Hegde-5"
                },
                {
                    "user_id": "Amir Shah",
                    "user_href": "/profile/Amir-Shah-202"
                },
                {
                    "user_id": "Arvind Menon",
                    "user_href": "/profile/Arvind-Menon-9"
                },
                {
                    "user_id": "Max Zhao",
                    "user_href": "/profile/Max-Zhao-16"
                },
                {
                    "user_id": "Jack Goff",
                    "user_href": "/profile/Jack-Goff-45"
                },
                {
                    "user_id": "Maya Inal",
                    "user_href": "/profile/Maya-Inal"
                },
                {
                    "user_id": "Sterling Schneider",
                    "user_href": "/profile/Sterling-Schneider"
                },
                {
                    "user_id": "Pat Neill",
                    "user_href": "/profile/Pat-Neill-4"
                },
                {
                    "user_id": "Markus Simmet",
                    "user_href": "/profile/Markus-Simmet"
                },
                {
                    "user_id": "Zachary Harris",
                    "user_href": "/profile/Zachary-Harris-137"
                },
                {
                    "user_id": "Timothy Taylor",
                    "user_href": "/profile/Timothy-Taylor-8"
                },
                {
                    "user_id": "Juan Diego Celemín Mojica",
                    "user_href": "/profile/Juan-Diego-Celemín-Mojica"
                },
                {
                    "user_id": "Nick William",
                    "user_href": "/profile/Nick-William-21"
                },
                {
                    "user_id": "Paul Reijbroek",
                    "user_href": "/profile/Paul-Reijbroek"
                },
                {
                    "user_id": "Hugo Jiménez",
                    "user_href": "/profile/Hugo-Jiménez"
                },
                {
                    "user_id": "Owen Chapman",
                    "user_href": "/profile/Owen-Chapman-13"
                },
                {
                    "user_id": "Joshua Wheaton",
                    "user_href": "/profile/Joshua-Wheaton-2"
                },
                {
                    "user_id": "Nik McIntosh",
                    "user_href": "/profile/Nik-McIntosh"
                },
                {
                    "user_id": "Bradley Gao",
                    "user_href": "/profile/Bradley-Gao"
                },
                {
                    "user_id": "Prakhar Kumar",
                    "user_href": "/profile/Prakhar-Kumar-198"
                },
                {
                    "user_id": "Quan Nguyen",
                    "user_href": "/profile/Quan-Nguyen-143"
                },
                {
                    "user_id": "Audri Metz",
                    "user_href": "/profile/Audri-Metz"
                },
                {
                    "user_id": "Atharva Pansare",
                    "user_href": "/profile/Atharva-Pansare"
                },
                {
                    "user_id": "Jacob Sagers",
                    "user_href": "/profile/Jacob-Sagers-2"
                },
                {
                    "user_id": "Joseph Mack",
                    "user_href": "/profile/Joseph-Mack-16"
                },
                {
                    "user_id": "Annabelle Johnson",
                    "user_href": "/profile/Annabelle-Johnson-32"
                },
                {
                    "user_id": "Mike Meinert",
                    "user_href": "/profile/Mike-Meinert"
                },
                {
                    "user_id": "William A. Brett",
                    "user_href": "/profile/William-A-Brett"
                },
                {
                    "user_id": "Jonathan Koczkodan",
                    "user_href": "/profile/Jonathan-Koczkodan"
                },
                {
                    "user_id": "Zach Bell",
                    "user_href": "/profile/Zach-Bell-19"
                },
                {
                    "user_id": "Molemo Kgoele",
                    "user_href": "/profile/Molemo-Kgoele"
                },
                {
                    "user_id": "Florian Haydn",
                    "user_href": "/profile/Florian-Haydn"
                },
                {
                    "user_id": "Anoop Sinha",
                    "user_href": "/profile/Anoop-Sinha-5"
                },
                {
                    "user_id": "Malik Martin",
                    "user_href": "/profile/Malik-Martin-18"
                },
                {
                    "user_id": "Andrei Kovacs",
                    "user_href": "/profile/Andrei-Kovacs-7"
                },
                {
                    "user_id": "Lily John",
                    "user_href": "/profile/Lily-John-34"
                },
                {
                    "user_id": "William Reich",
                    "user_href": "/profile/William-Reich-13"
                },
                {
                    "user_id": "Vasanth Jayaram",
                    "user_href": "/profile/Vasanth-Jayaram-2"
                },
                {
                    "user_id": "Emily Erickson",
                    "user_href": "/profile/Emily-Erickson-11"
                },
                {
                    "user_id": "Tim McClennen",
                    "user_href": "/profile/Tim-McClennen"
                },
                {
                    "user_id": "Aaron Brodney",
                    "user_href": "/profile/Aaron-Brodney-1"
                },
                {
                    "user_id": "Mark Bean",
                    "user_href": "/profile/Mark-Bean-23"
                },
                {
                    "user_id": "Vlad Tepes",
                    "user_href": "/profile/Vlad-Tepes-83"
                },
                {
                    "user_id": "J. B. Kelleher",
                    "user_href": "/profile/J-B-Kelleher"
                },
                {
                    "user_id": "Cathy Xue",
                    "user_href": "/profile/Cathy-Xue-1"
                },
                {
                    "user_id": "Nick Kraieski",
                    "user_href": "/profile/Nick-Kraieski"
                },
                {
                    "user_id": "Iris Bliss",
                    "user_href": "/profile/Iris-Bliss-1"
                },
                {
                    "user_id": "Adam Romano-Critchley",
                    "user_href": "/profile/Adam-Romano-Critchley"
                },
                {
                    "user_id": "Ben Tennyson",
                    "user_href": "/profile/Ben-Tennyson-127"
                },
                {
                    "user_id": "Andy Richards",
                    "user_href": "/profile/Andy-Richards-19"
                },
                {
                    "user_id": "Nico Burris",
                    "user_href": "/profile/Nico-Burris"
                },
                {
                    "user_id": "Klaade Draco",
                    "user_href": "/profile/Klaade-Draco"
                },
                {
                    "user_id": "Harit Kohli",
                    "user_href": "/profile/Harit-Kohli-2"
                },
                {
                    "user_id": "Parth Trivedi",
                    "user_href": "/profile/Parth-Trivedi-123"
                },
                {
                    "user_id": "Saul Agar Ward",
                    "user_href": "/profile/Saul-Agar-Ward"
                },
                {
                    "user_id": "Austin Pan",
                    "user_href": "/profile/Austin-Pan-8"
                },
                {
                    "user_id": "Dipayan Nandi",
                    "user_href": "/profile/Dipayan-Nandi-2"
                },
                {
                    "user_id": "Matthew Beasley",
                    "user_href": "/profile/Matthew-Beasley-5"
                },
                {
                    "user_id": "Avyay Rao",
                    "user_href": "/profile/Avyay-Rao"
                },
                {
                    "user_id": "Matt Priora",
                    "user_href": "/profile/Matt-Priora"
                },
                {
                    "user_id": "Ilgaz Er",
                    "user_href": "/profile/Ilgaz-Er"
                },
                {
                    "user_id": "Matt Williams",
                    "user_href": "/profile/Matt-Williams-431"
                },
                {
                    "user_id": "Kanji Banji",
                    "user_href": "/profile/Kanji-Banji"
                },
                {
                    "user_id": "Kasper Emil Feld",
                    "user_href": "/profile/Kasper-Emil-Feld"
                },
                {
                    "user_id": "Oscar Meadows",
                    "user_href": "/profile/Oscar-Meadows-2"
                },
                {
                    "user_id": "Oliver Ashmore",
                    "user_href": "/profile/Oliver-Ashmore-2"
                },
                {
                    "user_id": "Adakin Allums",
                    "user_href": "/profile/Adakin-Allums"
                },
                {
                    "user_id": "Rishi Chatterjee",
                    "user_href": "/profile/Rishi-Chatterjee-4"
                },
                {
                    "user_id": "Jonathan Galliher",
                    "user_href": "/profile/Jonathan-Galliher"
                },
                {
                    "user_id": "David Nicolucci",
                    "user_href": "/profile/David-Nicolucci"
                },
                {
                    "user_id": "Sam Stanko",
                    "user_href": "/profile/Sam-Stanko"
                },
                {
                    "user_id": "Philip Boncer",
                    "user_href": "/profile/Philip-Boncer-1"
                },
                {
                    "user_id": "Lila Hughes",
                    "user_href": "/profile/Lila-Hughes-6"
                },
                {
                    "user_id": "Maxtan Huynh",
                    "user_href": "/profile/Maxtan-Huynh"
                },
                {
                    "user_id": "Milan Zenka",
                    "user_href": "/profile/Milan-Zenka-1"
                },
                {
                    "user_id": "Carrie Tan",
                    "user_href": "/profile/Carrie-Tan-22"
                },
                {
                    "user_id": "Jaejin Choi",
                    "user_href": "/profile/Jaejin-Choi-2"
                },
                {
                    "user_id": "Ahmed Ali Ibrahim Muhammad Ghazalawy",
                    "user_href": "/profile/Ahmed-Ali-Ibrahim-Muhammad-Ghazalawy"
                },
                {
                    "user_id": "Anuk Kariyawasam",
                    "user_href": "/profile/Anuk-Kariyawasam-1"
                },
                {
                    "user_id": "Shlomo Graber",
                    "user_href": "/profile/Shlomo-Graber"
                },
                {
                    "user_id": "Edward Phillips",
                    "user_href": "/profile/Edward-Phillips-98"
                },
                {
                    "user_id": "Dylan Cooper",
                    "user_href": "/profile/Dylan-Cooper-21"
                },
                {
                    "user_id": "David Akers",
                    "user_href": "/profile/David-Akers-15"
                },
                {
                    "user_id": "Heather Crawford",
                    "user_href": "/profile/Heather-Crawford-15"
                },
                {
                    "user_id": "Sol Cotter",
                    "user_href": "/profile/Sol-Cotter"
                },
                {
                    "user_id": "Sunil Veeramuthu",
                    "user_href": "/profile/Sunil-Veeramuthu"
                },
                {
                    "user_id": "William Hembree",
                    "user_href": "/profile/William-Hembree-3"
                },
                {
                    "user_id": "Elizabeth James",
                    "user_href": "/profile/Elizabeth-James-90"
                },
                {
                    "user_id": "Jonathan Sullivan",
                    "user_href": "/profile/Jonathan-Sullivan-10"
                },
                {
                    "user_id": "Ethan Stedman",
                    "user_href": "/profile/Ethan-Stedman"
                },
                {
                    "user_id": "Dirk Reiners",
                    "user_href": "/profile/Dirk-Reiners"
                },
                {
                    "user_id": "Coach Santos",
                    "user_href": "/profile/Coach-Santos"
                },
                {
                    "user_id": "Alexander Rochford",
                    "user_href": "/profile/Alexander-Rochford-1"
                },
                {
                    "user_id": "Henry Zephyr",
                    "user_href": "/profile/Henry-Zephyr"
                },
                {
                    "user_id": "Michael Li",
                    "user_href": "/profile/Michael-Li-381"
                },
                {
                    "user_id": "Paolo Strusi",
                    "user_href": "/profile/Paolo-Strusi"
                },
                {
                    "user_id": "Ed Han",
                    "user_href": "/profile/Ed-Han-1"
                },
                {
                    "user_id": "Amelia Klinger",
                    "user_href": "/profile/Amelia-Klinger"
                },
                {
                    "user_id": "Ben Clare",
                    "user_href": "/profile/Ben-Clare-4"
                },
                {
                    "user_id": "Laszlo Weber",
                    "user_href": "/profile/Laszlo-Weber"
                },
                {
                    "user_id": "Patrick Wu",
                    "user_href": "/profile/Patrick-Wu-35"
                },
                {
                    "user_id": "Caitlan Yap",
                    "user_href": "/profile/Caitlan-Yap"
                },
                {
                    "user_id": "Harshit Ravish",
                    "user_href": "/profile/Harshit-Ravish-10"
                },
                {
                    "user_id": "Alex Hoare",
                    "user_href": "/profile/Alex-Hoare-5"
                },
                {
                    "user_id": "Brian R. Sanderson",
                    "user_href": "/profile/Brian-R-Sanderson"
                },
                {
                    "user_id": "John Johnson",
                    "user_href": "/profile/John-Johnson-4863"
                },
                {
                    "user_id": "Jamie Mansel",
                    "user_href": "/profile/Jamie-Mansel"
                },
                {
                    "user_id": "John Tait",
                    "user_href": "/profile/John-Tait-12"
                },
                {
                    "user_id": "Robert Chien",
                    "user_href": "/profile/Robert-Chien-5"
                },
                {
                    "user_id": "Tim Ward",
                    "user_href": "/profile/Tim-Ward-15"
                },
                {
                    "user_id": "Heather Schacht",
                    "user_href": "/profile/Heather-Schacht"
                },
                {
                    "user_id": "Kelly Schweighsr",
                    "user_href": "/profile/Kelly-Schweighsr"
                },
                {
                    "user_id": "Melissa York",
                    "user_href": "/profile/Melissa-York-10"
                },
                {
                    "user_id": "Elkan Choo",
                    "user_href": "/profile/Elkan-Choo"
                },
                {
                    "user_id": "Tharein Potuhera",
                    "user_href": "/profile/Tharein-Potuhera"
                },
                {
                    "user_id": "Declan Brick",
                    "user_href": "/profile/Declan-Brick-1"
                },
                {
                    "user_id": "Genevieve Lee",
                    "user_href": "/profile/Genevieve-Lee-32"
                },
                {
                    "user_id": "Charles Morgan",
                    "user_href": "/profile/Charles-Morgan-26"
                },
                {
                    "user_id": "Zack Walter",
                    "user_href": "/profile/Zack-Walter-4"
                },
                {
                    "user_id": "Brendan Shaw",
                    "user_href": "/profile/Brendan-Shaw-1"
                },
                {
                    "user_id": "Gabriel Vicuña",
                    "user_href": "/profile/Gabriel-Vicuña"
                },
                {
                    "user_id": "Charlie Wass",
                    "user_href": "/profile/Charlie-Wass-1"
                },
                {
                    "user_id": "Emmett Cauchon",
                    "user_href": "/profile/Emmett-Cauchon"
                },
                {
                    "user_id": "Mohit Aggarwal",
                    "user_href": "/profile/Mohit-Aggarwal-526"
                },
                {
                    "user_id": "Joey Hensley",
                    "user_href": "/profile/Joey-Hensley-4"
                },
                {
                    "user_id": "Will Pasto",
                    "user_href": "/profile/Will-Pasto"
                },
                {
                    "user_id": "Caleb Thompson",
                    "user_href": "/profile/Caleb-Thompson-47"
                },
                {
                    "user_id": "Ralph Crawford",
                    "user_href": "/profile/Ralph-Crawford"
                },
                {
                    "user_id": "Joshua Davis",
                    "user_href": "/profile/Joshua-Davis-49"
                },
                {
                    "user_id": "Daphne Crimes",
                    "user_href": "/profile/Daphne-Crimes"
                },
                {
                    "user_id": "Emmanuel Esparza",
                    "user_href": "/profile/Emmanuel-Esparza"
                },
                {
                    "user_id": "Michael Light",
                    "user_href": "/profile/Michael-Light-41"
                },
                {
                    "user_id": "Mason Pencil",
                    "user_href": "/profile/Mason-Pencil-2"
                },
                {
                    "user_id": "Elli Sutton",
                    "user_href": "/profile/Elli-Sutton-1"
                },
                {
                    "user_id": "Ted Östgärde",
                    "user_href": "/profile/Ted-Östgärde-1"
                },
                {
                    "user_id": "Dawei He",
                    "user_href": "/profile/Dawei-He-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dale Thomas",
                "href": "/profile/トーマス-デール-Dale-Thomas"
            },
            "answer_text": "Yes. When I was an undergrad, I shared a house with three other guys. We were all nerds on the same course, and it was really fun living with them. One of the guys, let’s call him Toby, was a Christian. His faith never really came up. He was exceptionally hard working and always let me borrow his notes. We would often watch Star Trek or Blackadder together. Great guy. Or so I thought. One day, we were having a beer together and the discussion turned to religion and hell. I casually said something like, “but you don’t really believe I’m going to hell though” and to my utter astonishment, Toby said “um, actually I do.” “I’m sorry, what did you just say?” It turned out that he did in fact hold the belief that he was going to heaven and I, as a non-believer, would be going to hell. Flabbergasted, I asked why on earth he wasn’t trying to convert me, and his response was “none of my business, we all have free will.” I cannot think of a more evil or immoral mentality. My housemate was literally saying that he believed that I, and many of our mutual friends, would literally be tortured for infinity. If I believed for one second that another person was headed for infinite torture, I would do everything in my power to stop it from happening. I’ll say it again in case you don’t quite grasp what we are talking about. He believed that I would suffer infinite torture because of my wrongthink. And he simply didn’t care. He didn’t try to get me to go to church with him. He didn’t try to have discussions about God, hoping to save me from that fate. He was quite content to go about his business, happy in the belief that he would be going to heaven someday. And trying to save me from eternal torture just wasn’t worth the awkward conversations. However, I give my old housemate the benefit of the doubt and conclude that he doesn’t really believe what he claims to believe. I think he is trying to satisfy his cognitive dissonance by believing in a kind of “virtual machine” in his brain. I don’t believe anyone with even the tiniest level of empathy could stand the thought of another person being tortured for infinity. Not really. For me, that solidified my atheism and planted a seed of anti-theism. While I acknowledge and respect that religion can bring comfort and cohesion through its lies, it is extremely good at making people override their innate empathy and hold quite atrocious beliefs while feeling smug and righteous at the same time. Needless to say, our friendship wasn’t quite the same after that. — Edit: I feel like I’m living in the Twilight zZone. I am saying “INFINITE TORTURE” and everyone around me is raising their eyebrows calmly and saying, “well, whatcha gonna do?” ETERNAL FUCKING TORTURE!!!!!!!!!! It is clear to me that my friend, like many other Christians, either do not believe in hell, even though they claim to, or have ZERO empathy for other people. One or the other. I don’t believe thay have ever, for one second, actually thought of what eternal torture is? Not torture for 5 minutes (which would be immoral), not torture for a year, which would be horrific, not torture for a billion years, which would be unfathomable. ETERNAL TORTURE! Never ending, ever. How the fuck can they sleep at night thinking that ANY human (or even an animal) will suffer that? Why the fuck aren't they out there every waking moment screaming with anguish, pleading, begging, bribing, doing ANYTHING to save people from that. THAT is what I am angry about. Moderate Christians (who believe in hell) are either deceitful in not believing what they claim to believe, or are complete and utter psychopaths. ",
            "date": "Updated October 21, 2020",
            "views": "6",
            "upvotes": " View 279 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bosley Plourde",
                    "user_href": "/profile/D-B-Oswald"
                },
                {
                    "user_id": "Serena Smith",
                    "user_href": "/profile/Serena-Smith-158"
                },
                {
                    "user_id": "Curtis Lewis",
                    "user_href": "/profile/Curtis-Lewis-7"
                },
                {
                    "user_id": "James Thomson",
                    "user_href": "/profile/James-Thomson-152"
                },
                {
                    "user_id": "Joe Djoremy",
                    "user_href": "/profile/Joe-Djoremy"
                },
                {
                    "user_id": "C M Barlow",
                    "user_href": "/profile/C-M-Barlow"
                },
                {
                    "user_id": "Emily Collier",
                    "user_href": "/profile/Emily-Collier-52"
                },
                {
                    "user_id": "Valerie Thompson",
                    "user_href": "/profile/Valerie-Thompson-134"
                },
                {
                    "user_id": "Liora Wilkins",
                    "user_href": "/profile/Liora-Wilkins-1"
                },
                {
                    "user_id": "Martin Thatcher",
                    "user_href": "/profile/Martin-Thatcher"
                },
                {
                    "user_id": "Matthew Parr",
                    "user_href": "/profile/Matthew-Parr-22"
                },
                {
                    "user_id": "Nick Kraieski",
                    "user_href": "/profile/Nick-Kraieski"
                },
                {
                    "user_id": "Mattia Rastelli",
                    "user_href": "/profile/Mattia-Rastelli"
                },
                {
                    "user_id": "Vincent Tran",
                    "user_href": "/profile/Vincent-Tran-115"
                },
                {
                    "user_id": "Jackie Starling",
                    "user_href": "/profile/Jackie-Starling-1"
                },
                {
                    "user_id": "Jay Rock",
                    "user_href": "/profile/Jay-Rock-176"
                },
                {
                    "user_id": "David Mazor",
                    "user_href": "/profile/David-Mazor"
                },
                {
                    "user_id": "Leo Tom",
                    "user_href": "/profile/Leo-Tom-16"
                },
                {
                    "user_id": "Ark Abhyudaya",
                    "user_href": "/profile/Ark-Abhyudaya"
                },
                {
                    "user_id": "Kevin Chen",
                    "user_href": "/profile/Kevin-Chen-1253"
                },
                {
                    "user_id": "Yamilex Gonzalez",
                    "user_href": "/profile/Yamilex-Gonzalez-5"
                },
                {
                    "user_id": "Christian Hofer",
                    "user_href": "/profile/Christian-Hofer-12"
                },
                {
                    "user_id": "Terence A. Godwin",
                    "user_href": "/profile/Terence-A-Godwin"
                },
                {
                    "user_id": "William A. Brett",
                    "user_href": "/profile/William-A-Brett"
                },
                {
                    "user_id": "Cameron Cowan",
                    "user_href": "/profile/Cameron-Cowan-26"
                },
                {
                    "user_id": "Robert A. Mendell",
                    "user_href": "/profile/Robert-A-Mendell-Sr"
                },
                {
                    "user_id": "Stephen Fretz",
                    "user_href": "/profile/Stephen-Fretz"
                },
                {
                    "user_id": "Zachary Tucker",
                    "user_href": "/profile/Zachary-Tucker"
                },
                {
                    "user_id": "Shivram Swaminathan",
                    "user_href": "/profile/Shivram-Swaminathan"
                },
                {
                    "user_id": "Maya Inal",
                    "user_href": "/profile/Maya-Inal"
                },
                {
                    "user_id": "Caleb Marsh",
                    "user_href": "/profile/Caleb-Marsh-2"
                },
                {
                    "user_id": "Samuel Soohoo",
                    "user_href": "/profile/Samuel-Soohoo"
                },
                {
                    "user_id": "Daniel D'Sa",
                    "user_href": "/profile/Daniel-DSa-7"
                },
                {
                    "user_id": "Kirby Cho",
                    "user_href": "/profile/Kirby-Cho-2"
                },
                {
                    "user_id": "Judith Purcell",
                    "user_href": "/profile/Judith-Purcell"
                },
                {
                    "user_id": "Lin Campbell Lindsay",
                    "user_href": "/profile/Lin-Campbell-Lindsay"
                },
                {
                    "user_id": "Dustin Powell",
                    "user_href": "/profile/Dustin-Powell-6"
                },
                {
                    "user_id": "Yuyi Chan",
                    "user_href": "/profile/Yuyi-Chan"
                },
                {
                    "user_id": "Michael Wattam",
                    "user_href": "/profile/Michael-Wattam"
                },
                {
                    "user_id": "Katharina Müller",
                    "user_href": "/profile/Katharina-Müller-4"
                },
                {
                    "user_id": "Adam Ahmad",
                    "user_href": "/profile/Adam-Ahmad-32"
                },
                {
                    "user_id": "Gabriel Våge Barstad",
                    "user_href": "/profile/Gabriel-Våge-Barstad"
                },
                {
                    "user_id": "Ian Lam",
                    "user_href": "/profile/Ian-Lam-42"
                },
                {
                    "user_id": "Joseph Tan",
                    "user_href": "/profile/Joseph-Tan-123"
                },
                {
                    "user_id": "Bosca Fabian",
                    "user_href": "/profile/Bosca-Fabian"
                },
                {
                    "user_id": "Sreekar Sai",
                    "user_href": "/profile/Sreekar-Sai-9"
                },
                {
                    "user_id": "Adam Serafini",
                    "user_href": "/profile/Adam-Serafini-4"
                },
                {
                    "user_id": "Roshini Balaji",
                    "user_href": "/profile/Roshini-Balaji"
                },
                {
                    "user_id": "Akshit Anand",
                    "user_href": "/profile/Akshit-Anand-31"
                },
                {
                    "user_id": "Gerry Holford",
                    "user_href": "/profile/Gerry-Holford-1"
                },
                {
                    "user_id": "Devon Loehr",
                    "user_href": "/profile/Devon-Loehr"
                },
                {
                    "user_id": "Elkan Choo",
                    "user_href": "/profile/Elkan-Choo"
                },
                {
                    "user_id": "Cassandra Lipton",
                    "user_href": "/profile/Cassandra-Lipton"
                },
                {
                    "user_id": "Trey Saunders",
                    "user_href": "/profile/Trey-Saunders-4"
                },
                {
                    "user_id": "Dylan Chester",
                    "user_href": "/profile/Dylan-Chester"
                },
                {
                    "user_id": "Elli Sutton",
                    "user_href": "/profile/Elli-Sutton-1"
                },
                {
                    "user_id": "Andrés Rangel",
                    "user_href": "/profile/Andrés-Rangel-2"
                },
                {
                    "user_id": "Magnus Ekstrom",
                    "user_href": "/profile/Magnus-Ekstrom"
                },
                {
                    "user_id": "Kieran Elrod",
                    "user_href": "/profile/Kieran-Elrod"
                },
                {
                    "user_id": "Brandon Cheng",
                    "user_href": "/profile/Brandon-Cheng-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Beau Mitchell",
                "href": "/profile/Beau-Mitchell-4"
            },
            "answer_text": "Yes I lost my job for it. The trouble was, even though I was told straight to my face by my employer that this was the reason I was being fired he changed his mind and denied this was the reason. I spent $500 on a lawyer and found out that my country’s unfair dismissal laws cover discrimination for religious beliefs but not “lack of beliefs\". So had he have said “I'm sacking you for being a Muslim” I would have gotten an unfair dismissal case and sued the crap out of them. To make matters worse, even though I was a good worker and getting 40–50 hours work a week I was called “casual” and the boss simply said “there is not enough hours for you and that's why we let you go” and then hired 2 new people to take my job. How did they find out I was an Atheist? I had a collgue ask me in the lunch room if I was busy on Sunday? I replied “no” he then asked if I would like to come to his church on Sunday, he said I am more than welcome to bring my family? I politely said “thank you for the offer, but my family and I are Atheist” (exact words). Holy shit! Time just stopped and about 30 sets of eyes within earshot, stared at me. The colleges face looked like I was telling him I had just murdered his entire family, total shock. The next week at work was really uncomfortable, it seemed to spread like a virus that I was Athiest, no one spoke to me at lunch, before or after work with the exception of work related conversation in the office during work hours. There was just over 1000 people in the buildings of the compound I was in and everyone from payroll to the mechanics knew I was Athiest. Right up until Friday afternoon when I was called into the bosses office at 4:00 pm and told that “your religious views are causing a great deal of issues amongst the staff”. Then told to pack up my desk. I was humiliated beyond belief as the security stood there and watched me pack up a box to make sure I didn't steal anything that was not my property. On the way out whilst being escorted to my car I overheard two now ex-cowokers say “I feel so bad for his daughter, raising her like that is terrable” I turned to face them but the security blocked my path and told me to leave immediately because he was going to call the police in 5 minutes. My story is not unique either, I have met others who have been fired or working in an environment that is toxic as a result of people finding out they are Atheist. They are not always found out in the same manner as me, they are often found via social media that has nothing to do with the company. Across the world Atheists are discriminated against in this 2014 study of the 196 recognised countries on Earth 193 of them discriminate against Athiests in some way or another. Everything from discrimination laws that protect religious people but not Atheists to the death penalty in 13 countries, for being Atheist. The law in Australia is still not changed reguarding “lack of belief” and unfair dismissal but we have excepted things such as “gender identity” as a value reason now. People's opinions are unbelievably low of Athiests also. In a 2011 Gallup poll, people hate Athiests more than most groups on the list. The list includes gay men, Muslims, Feminists, Jews, transgender people, African Americans, Mexicans, rapists and pedophiles. All scored significantly higher than the Athiests with the exception of the rapists who were only .5% hated more than Atheists, and the pedophiles which scored bottom of nearly every list. That is pretty depressing to see that we are nearly as hated as rapists. Who would you rather as your next door neighbour, a rapist or Athiest, I would love to chat to some of the participants that like rapists more than Atheists. Discrimination against atheists Sorry about this link, the study can be downloaded free at the bottom in PDF format. Every other link cost money to use. Study of the Day: Religious People Distrust Atheists as Much as Rapists ",
            "date": "Updated October 24, 2020",
            "views": "1",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nigel Macaulay",
                    "user_href": "/profile/Nigel-Macaulay-1"
                },
                {
                    "user_id": "Hải Huỳnh",
                    "user_href": "/profile/Hải-Huỳnh-6"
                },
                {
                    "user_id": "Arif Bey",
                    "user_href": "/profile/Arif-Bey-4"
                },
                {
                    "user_id": "James Seale",
                    "user_href": "/profile/James-Seale-12"
                },
                {
                    "user_id": "Elin Valle",
                    "user_href": "/profile/Elin-Valle"
                },
                {
                    "user_id": "Marc Sutter",
                    "user_href": "/profile/Marc-Sutter-2"
                },
                {
                    "user_id": "Markus Simmet",
                    "user_href": "/profile/Markus-Simmet"
                },
                {
                    "user_id": "Tim Wang",
                    "user_href": "/profile/Tim-Wang-165"
                },
                {
                    "user_id": "Christian Herzig",
                    "user_href": "/profile/Christian-Herzig"
                },
                {
                    "user_id": "Vonn Russell",
                    "user_href": "/profile/Vonn-Russell-1"
                },
                {
                    "user_id": "Carmen Dominguez",
                    "user_href": "/profile/Carmen-Dominguez-56"
                },
                {
                    "user_id": "Jon Bill",
                    "user_href": "/profile/Jon-Bill-19"
                },
                {
                    "user_id": "Pradyuman Singh",
                    "user_href": "/profile/Pradyuman-Singh-17"
                },
                {
                    "user_id": "Paul Conrad",
                    "user_href": "/profile/Paul-Conrad-36"
                },
                {
                    "user_id": "Warin Mal",
                    "user_href": "/profile/Warin-Mal"
                },
                {
                    "user_id": "David Forsey",
                    "user_href": "/profile/David-Forsey"
                },
                {
                    "user_id": "Vishal Thakur",
                    "user_href": "/profile/Vishal-Thakur-34"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rob Kay",
                "href": "/profile/Rob-Kay-21"
            },
            "answer_text": "I went through an atheist phase (it was a phase for me) several years ago. While I wasn’t terribly outspoken, some theists I confided in about my doubts treated me poorly. My experience has been with Christianity, and I can say we’re really, really, really…  …really bad about treating people like projects. Most don’t even realize that’s what they’re doing, and a lot of churches don’t realize that’s what they’re teaching their congregants. As a (now former) Southern Baptist, I was taught the total sum of my relationship with non-Christians was to share my faith with them. That was the whole reason to get to know them, and every interaction I had with them was to serve that purpose. Like I said, a lot of Christians don’t realize that’s what the endgame is, or that they’re being indoctrinated that way. It wasn’t until I saw things “from the other side” that I was able to empathize with non-Christians who complain about theist—specifically Christian—behavior. I get it, and I’m sorry. They piss me off, too. ",
            "date": "Answered October 21, 2020",
            "views": "132",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Markus Simmet",
                    "user_href": "/profile/Markus-Simmet"
                },
                {
                    "user_id": "Eric Schumaker",
                    "user_href": "/profile/Eric-Schumaker"
                },
                {
                    "user_id": "Dusty McGarry",
                    "user_href": "/profile/Dusty-McGarry"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jake Dickerman",
                "href": "/profile/Jake-Dickerman"
            },
            "answer_text": "I don't notice it much, but that may be because I spent my life before I called an atheist calling myself a Jew. Which I still do, btw, I just add another adjective to it. But I think that's also because - having already been a religious minority and having never really been in a situation where I felt forced into religion, being an atheist has never really felt like a big deal to me. I have gotten into it with people over things like ghosts and acupuncture - those have quickly turned casual conversation (and once a date… “my father's a chiropractor.” “Not everyone! There are chiropractors who work on bones and stuff, they're doing something. It's just the woo stuff, you know, the energy medicine and when they include stuff like acupuncture.” “My father uses acupuncture in his practice.” “Um………”), but with atheism I've never really cared that much. And again, that might just be the communities I have associated with or my status before that. I remember being chearfully told I was going to hell as a middle schooler by a friend, that stuck. I remember having weird conversations with christians on a school band trip. I remember being treated like an oddity in my college in Texas (“you're the first Jewish friend I've ever met!”) or being convinced to go out with the campus crusade for Christ people after asking multiple times if this was a campus crusade for Christ thing and being told “no.” So by the time I was convinced that calling myself an agnostic was because of a poor definition of atheist and then referring to myself as an atheist afterward, I was pretty hardened against feeling pushed by other people's religion. Hell, you try growing up Jewish at Christmas. You figure out pretty quick that you are not in the mainstream of the country. I feel a lot of the time like people who go from mildly christian to atheist tend to be uncomfortable with suddenly being in a religious minority. I guess that feels weird for them because they didn't spend 6–18 living in a town with three churches and zero synagogues. I get that those coming out of families where religion was more inflicted on the kids may provoke a stronger reaction. That's true with Jews too, btw. I think that a person who escaped a Hasidic community is going to have a much more visceral reaction to losing faith than me - a kid who identified as a Jew, went to temple for high holidays, went to shabbat morning services every here and there, and then just had religion slowly atrophy throughout high school and college. For me, being Jewish still feels important, even if the idea of God does not. And luckily for me, atheist Jews have a long tradition in the culture. The orthodox may not be big fans of us, but conservative and reform? They're all good with us. So again, being an atheist for me has been fine. But I don't know how much that is because growing up Jewish had already prepped me for it. ",
            "date": "Answered October 16, 2020",
            "views": "193",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Warin Mal",
                    "user_href": "/profile/Warin-Mal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arthur Pearson",
                "href": "/profile/Arthur-Pearson-1"
            },
            "answer_text": "Yes. The problem is, it was my fault. Before 2005, I didn’t realize that I was basically asking to be treated badly just by calling myself “atheist.” That “bad behavior” came in the form of “them not understanding my position” and really I have no one to blame but myself. Most people are theists, so it’s them that decide what words mean. Dictionaries are descriptive, not prescriptive. Skeptics are in the minority, and just because a lot of skeptics re-defined “atheism” on wikipedia doesn’t mean it also got magically changed in the minds of believers and in the 1950’s dictionaries they inherited from their grandparents. Most people are theists, and most theists define “atheism” as “claims God is not real” not “does not believe in God or gods” as many skeptics might foolisly want. So, when I told people I was an “atheist” they treated me like the straw man parody of skepticism I allowed them to think of me as. ",
            "date": "Answered October 23, 2020",
            "views": "90",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Newcomb",
                "href": "/profile/James-Newcomb"
            },
            "answer_text": "As an atheist, have you ever met a theist who treated you badly because you’re an atheist? Face to face…no. Online…yes. Years ago when I was but the age of 17–19 I had a conversation with a Christian woman and when she asked me what church do I attend and I answered I don't attend church because I am an atheist she flipped 180 degree. Upon hearing the news that I was a godless atheist she started to say she wished me pain of an agonizing degree. This is a woman who had at least 2–3 kids as seen on her profile. Theists can be some of the worst kinds of people you could ever meet. I know becuase I have talked to them. Nice so long as you agree with their baseless ideas. Downright inhuman when you don’t. ",
            "date": "Answered October 16, 2020",
            "views": "116",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Warin Mal",
                    "user_href": "/profile/Warin-Mal"
                },
                {
                    "user_id": "Derek Louden",
                    "user_href": "/profile/Derek-Louden-1"
                },
                {
                    "user_id": "Crystal Gillis",
                    "user_href": "/profile/Crystal-Gillis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Warin Mal",
                "href": "/profile/Warin-Mal"
            },
            "answer_text": "Well… to be honest YES I've had a few experiences online where I've been called names Told that I never truly had a relationship with Jesus otherwise I wouldn't have “given up\" Its incredible how people are so quick to dismiss everything you say once you're an atheist and you were once a Christian Thier ability to not even listen is astonishing They gish gallop all over the place about why you're an atheist or how you fall into the prophecy of the end times “How many will turn away from jesus\" So it gives them justification to pass judgement upon you and why they're on the right side of the fence This way of thinking…. It makes me frustrated because it shouldn't be this way You shouldn't call someone out or change the way you see them because they're something completely different to you This level of prejudice is intolerable from my side I don't think there's an afterlife What's wrong with that? Is it wrong that I see life as infinitely far more worthwhile than any fictional promise of an afterlife that is clearly the product of human arrogance What's wrong with living the life you have now with contentment because this is all we have until proven otherwise Savoring every moment with family because I don't know if I'll ever get the chance to do it again I don't think Hell exists at all and yet I continously receive backlash from those who “know” better and try to use methods to get me believe and if I don't conform to thier thinking They quote a bible verse about how I'm so foolish Anyway That's a nutshell of my experiences thus far ",
            "date": "Answered October 18, 2020",
            "views": "126",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Phil Kaminsky",
                    "user_href": "/profile/Phil-Kaminsky-2"
                },
                {
                    "user_id": "Krishna Rowter",
                    "user_href": "/profile/Krishna-Rowter"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Jones",
                "href": "/profile/Bill-Jones-385"
            },
            "answer_text": "as a guy who can look like a big charles manson if i put my mind to it i get precious few offers from troublemakers even at 66. i like it this way. as an atheist, i did get tried one time. the teaching assistant for advanced lab had his wife call my wife and invite us to dinner. she went. i didnt because of a schedule conflict i couldnt fix. apparently a fire and brimstone sermon with the intensity of the ones given by uncle reuben in alabama ensued. i wasnt amused. telling josh, a jewish fellow grad student about it revealed that he had been pestered as well. this guy would try to get a conversation going with us in the lab, a thing we were a little too busy for. so we hatched a deviously clever plan, which was to march up to the good offices of the professor who liked us the most and bitch like hell. that worked, dare i say, miraculously. we returned to our normal unpestered business without sermons and my wife returned to her unpestered whatever she did during the day stuff. all without detriment to our lab grades. ",
            "date": "Answered October 18, 2020",
            "views": "98",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Herb Silverman",
                "href": "/profile/Herb-Silverman-3"
            },
            "answer_text": "My entire state treated me badly because I’m an atheist. When I learned that our South Carolina Constitution prohibited atheists from holding public office, I challenged this provision by running for governor, and eventually won a state supreme court victory. You can read about it in my autobiography, A Candidate Without a Prayer. See Candidate Without A Prayer: An Autobiography of a Jewish Atheist in the Bible Belt: Silverman, Herb, Dawkins, Richard: 9780984493289: Amazon.com: Books ",
            "date": "Answered October 17, 2020",
            "views": "117",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brennan Herring",
                    "user_href": "/profile/Brennan-Herring-3"
                },
                {
                    "user_id": "Warin Mal",
                    "user_href": "/profile/Warin-Mal"
                },
                {
                    "user_id": "Dean Jay Smith",
                    "user_href": "/profile/Dean-Jay-Smith"
                },
                {
                    "user_id": "Miya Lin",
                    "user_href": "/profile/Miya-Lin-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ralph Brew",
                "href": "/profile/Ralph-Brew"
            },
            "answer_text": "No. But I once was trying to comfort a woman who had lost her daughter to some horrible disease, as she showed me her crumpled photocopy of the various macabre photos of her daughter during the disease’s progression. After I made appropriate noises of empathy, and ”that must have been so awful\" etc etc, as she described the nature and cause, she said, “but at least I know she is in heaven in the company of Jesus\". I said, “that is lovely, and I am sure we will all be there eventually\", naively thinking that this was something she would take comfort from. But no, she completely changed her tune. She looked at me directly and said “oh no, not everyone will end up going there\". Now her words were general, but her tone was actually personal, the implication being that I would not be getting to heaven and would in fact be going somewhere very different. The poisonous old cow! So I stared her down and just said, “I don't believe in God anyway\". To which she replied, “I pity you\" to which I retorted, “I don't want your pity.” That is the last we have spoken. Turns out her own sister in law also does not speak to her. ",
            "date": "Answered October 16, 2020",
            "views": "124",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Warin Mal",
                    "user_href": "/profile/Warin-Mal"
                },
                {
                    "user_id": "Crystal Gillis",
                    "user_href": "/profile/Crystal-Gillis"
                },
                {
                    "user_id": "Abigail Freeman",
                    "user_href": "/profile/Abigail-Freeman-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Henry Blum",
                "href": "/profile/Henry-Blum"
            },
            "answer_text": "Yes. I worked for a construction company during the summer when I was 18 years old. The crew I was assigned had about 7 guys. There was another guy about my age and the rest were in their 30’s or older. One afternoon I was talking to the guy my age during our lunch break (we ate at the site) about Star Wars. This would have been about 1985. Anyway, the conversation turned into how The Force was kin to being a religion and the conversation was pretty much centered around that. I don’t even think we ever mentioned Christianity or other religions. Just how The Force might be considered a religion based on the the characters actions in the movies. There was this one burly guy and he finally came over and told us to shut the hell up or he would kick both of our asses. I can only conclude he was offended in some way or believed we were attacking his own religion by talking about another religion. ",
            "date": "Answered October 24, 2020",
            "views": "88",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jennifer Larson",
                    "user_href": "/profile/Jennifer-Larson-84"
                },
                {
                    "user_id": "Sean Coleman",
                    "user_href": "/profile/Sean-Coleman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Brocklehurst",
                "href": "/profile/Paul-Brocklehurst-2"
            },
            "answer_text": "As an atheist, have you ever met a theist who treated you badly because you’re an atheist? Not in actions but in words. I’ve had a theist react very negatively to me pointing out a fallacy in their claim that atheism is like saying Africa isn’t nice (I said it’s more like saying there’s no good reason to believe Africa is real). I also had a death threat from some Muslim Fundamentalists, but I was incognito so the threat wasn’t too worrying. ",
            "date": "Answered October 16, 2020",
            "views": "125",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Warin Mal",
                    "user_href": "/profile/Warin-Mal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Ashton",
                "href": "/profile/Jim-Ashton-3"
            },
            "answer_text": "Oh hell yes. Too many times to recall all of them. In grade school a teacher spanked me in front of the class, several times, telling me she wasn’t having a heathen bastard in her class. Because I would not pray on command like the other kids. Or my wife of 23 years saying her pastor told her we were unequally yoked and not married in the eyes of God. So she was single and could date. They are now married. Or being made to work weekends and holidays because atheists don’t like to spend time with their families. Or being told I had to buy gifts for family members (in laws) but not to expect anything back as it wasn’t my holiday (Christmas). ",
            "date": "Answered October 16, 2020",
            "views": "188",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Crystal Gillis",
                    "user_href": "/profile/Crystal-Gillis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bud Vieira",
                "href": "/profile/Bud-Vieira-2"
            },
            "answer_text": "No, but in the places where I live, it's not likely to come up in casual conversation anyway. Most people aren't itching to have a fight about this, in my experience. At least in the real world - I only find myself debating religion here on Quora or other online venues. I've also never seen an atheist treating a believer poorly because of their beliefs. ",
            "date": "Answered October 20, 2020",
            "views": "64",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Warin Mal",
                    "user_href": "/profile/Warin-Mal"
                },
                {
                    "user_id": "Crystal Gillis",
                    "user_href": "/profile/Crystal-Gillis"
                },
                {
                    "user_id": "Abigail Freeman",
                    "user_href": "/profile/Abigail-Freeman-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wouter Van der Schagt",
                "href": "/profile/Wouter-Van-der-Schagt"
            },
            "answer_text": "Yes, and it still happens sometimes, although the professional theists are generally very respectful. It doesn't matter to me. You can try to convert me, you can tell me the grass is pink. But it is hard for me to get angry. It is green to me and nothing will change it. ",
            "date": "Answered October 18, 2020",
            "views": "72",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dusty McGarry",
                    "user_href": "/profile/Dusty-McGarry"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Kamm",
                "href": "/profile/Daniel-Kamm"
            },
            "answer_text": "To me, a question like this shows how ignorant some people are about most atheist. At least for me, I don’t allow them to treat me badly because I don’t care about others’ religious beliefs or concerns, UNLESS they attempt to force their religious beliefs upon me. ",
            "date": "Answered October 17, 2020",
            "views": "63",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dusty McGarry",
                "href": "/profile/Dusty-McGarry"
            },
            "answer_text": "Yes. My family was targeted in numerous ways while I grew up 2 decades next door to a Methodist Church. As a small child I was repeating “The end justifies the means, and the means justifies the Methodist.” I’ve carried on at length in other posts. Ask and I can try to hunt down a link. ",
            "date": "Answered October 20, 2020",
            "views": "85",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Surya Van De Merwe",
                "href": "/profile/Surya-Van-De-Merwe"
            },
            "answer_text": "As an atheist, have you ever met a theist who treated you badly because you’re an atheist? Well, it depends on what you call ‘badly’ I met a guy at a convention and we spent half a day together having a good time. After he found out I was an atheist he made an excuse and he actively avoided me for the rest of the convention. His choice, not mine. ",
            "date": "Answered October 19, 2020",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard Simons",
                "href": "/profile/Richard-Simons-33"
            },
            "answer_text": "Only on the internet. There’re a few reasons for this. Firstly, I live on the Northeast coast in the U.S.. People here tend to keep their religiosity to themselves, or at least don’t try to impose it on others. From what I’ve heard, that may not be the case in the bible belt. I also don’t announce my lack of faith nor my opinions on religion unless I’m asked. Since I avoid anyone who doesn’t reciprocate the favor I’m always around amicable people. ",
            "date": "Answered October 16, 2020",
            "views": "60",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Warin Mal",
                    "user_href": "/profile/Warin-Mal"
                },
                {
                    "user_id": "Riccardo Zanardi",
                    "user_href": "/profile/Riccardo-Zanardi-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Mullich",
                "href": "/profile/David-Mullich"
            },
            "answer_text": "I have never been treated badly by a theist because I’m an atheist. All the theists I’ve known have been quite nice to me. ",
            "date": "Answered October 16, 2020",
            "views": "62",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abigail Freeman",
                    "user_href": "/profile/Abigail-Freeman-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Colin Wright",
                "href": "/profile/Colin-Wright-58"
            },
            "answer_text": "Only on the internet, most theists I know in real life are perfectly pleasant regardless of if they know I’m an atheist or not I’ve never been treated differently after they found out. ",
            "date": "Answered October 19, 2020",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michiel Lombaers",
                "href": "/profile/Michiel-Lombaers"
            },
            "answer_text": "Yup, varying from the pastor whom I told that I was leaving the Catholic Church to various street preachers (3 in the USA, one in the Netherlands) who were threatening me with fire and brimstone when I told them I didn’t believe in their stories. ",
            "date": "Answered October 16, 2020",
            "views": "73",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Filip Koza",
                    "user_href": "/profile/Filip-Koza"
                },
                {
                    "user_id": "Kong Thao",
                    "user_href": "/profile/Kong-Thao-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Ferry",
                "href": "/profile/James-Ferry-25"
            },
            "answer_text": "I believe in Jesus and am Christian. No one has the right to treat you badly no matter what you believe. I hope you don’t mind but I will pray for you ",
            "date": "Answered October 16, 2020",
            "views": "68",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Crystal Gillis",
                    "user_href": "/profile/Crystal-Gillis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hollis Geary",
                "href": "/profile/Hollis-Geary"
            },
            "answer_text": "Not overtly but they have gone after my sons when they were young. One of the offenders was a public school teacher. We had to go to the administration but they were spineless and did nothing about it. ",
            "date": "Answered October 21, 2020",
            "views": "75",
            "upvotes": "0"
        }
    ]
}