{
    "title": "As a theist, what do you think are the worst arguments made by atheists and antitheists? - Quora",
    "tags": [
        "Theism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Warren Kramer",
                "href": "/profile/Warren-Kramer"
            },
            "answer_text": "As a theist, what do you think is the worst arguments made by atheists and antitheists? Thanks for the A2A. I can't just pick one, here are several candidates for top spot.  1) Aliens will prove there is no god! This has to be silliest if not the worst. In what universe will the discovery of extra-terrestrial life prove there is no god, or \"be the end of religions\" or whatever phrase this multi-asked question uses?   2)Lots of religions prove there is no god! Because there are so many religions and so many different views of gods, this means none of them are right. If you really want to use that math, atheism would end up the least likely outcome.  3)God is a meanie, so proves there's no God! So the Bible (in which atheists do not believe) is used to prove that God is a big meanie, so that means the Bible (in which they don't believe) proves he isn't real! Brilliant. 4)Theists do naughty things, so that proves there's no God! So let me get this straight. The Christian doctrine says all humans are flawed (okay, \"sinful\"). So when some who claim this belief do (or in come cases DID 800 years ago) something bad (proving the doctrine is right), this proves there is no God and all religion is wrong! Got it. What does it prove when atheists do bad things? Like Mao or the Kims? Nothing? 5)Oh yeah? Well who designed God? Something can't come out of nothing, so God couldn't have come out of nothing! Ha, gotcha, you deluded theist! So something can come out of nothing, except not God. Got it.  6)God is the same as the Tooth Fairy, Santa Claus, and the Flying Spaghetti Monster. This serves to demonstrate how vastly different belief in God is to these myths, which show no testimony, no martyrs, no historical or geographical corroboration we find in biblical events. Only myths created intentionally for children. Strawman argumentation at its worst. Theists believe God created the universe. Virtually every human agrees that if Santa doesn't exist, the universe still could, and (see #7)... 7)Religion is \"brainwashing!\" And \"child abuse!\" Finally, if these things are the same, why do some never grow out of the \"brainwashing\" by theist parents, but do grow out of Santa? Don't all good parents teach what they believe is true? So this is only \"brainwashing\" if YOU get to define some things as \"religious?\" Must be because they're all deluded, but you've somehow escaped this mass hypnosis. You must be very smart and independent. Or perhaps just wrong. 8)Atheism is not a religion! But this answer is sure to draw complaints and insults from people so offended that you'd think someone was criticizing their religion or something.  ",
            "date": "Answered March 21, 2016",
            "views": "673",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Charlotte Henson",
                    "user_href": "/profile/Charlotte-Henson-10"
                },
                {
                    "user_id": "Alex Anderson",
                    "user_href": "/profile/Alex-Anderson-292"
                },
                {
                    "user_id": "Jo Cahill",
                    "user_href": "/profile/Jo-Cahill"
                },
                {
                    "user_id": "Jack Doxey",
                    "user_href": "/profile/Jack-Doxey"
                },
                {
                    "user_id": "Aaron Araujo",
                    "user_href": "/profile/Aaron-Araujo-3"
                },
                {
                    "user_id": "Otho Fernandes Damasceno",
                    "user_href": "/profile/Otho-Fernandes-Damasceno"
                },
                {
                    "user_id": "Emilio Srougo",
                    "user_href": "/profile/Emilio-Srougo"
                },
                {
                    "user_id": "Jason Brunson",
                    "user_href": "/profile/Jason-Brunson"
                },
                {
                    "user_id": "Nathan Ketsdever",
                    "user_href": "/profile/Nathan-Ketsdever"
                },
                {
                    "user_id": "Josh Franks",
                    "user_href": "/profile/Josh-Franks-2"
                },
                {
                    "user_id": "Ronald Kimmons",
                    "user_href": "/profile/Ronald-Kimmons"
                },
                {
                    "user_id": "Liam Xavier Arduino",
                    "user_href": "/profile/Liam-Xavier-Arduino"
                },
                {
                    "user_id": "Jared Busby",
                    "user_href": "/profile/Jared-Busby-1"
                },
                {
                    "user_id": "Linnea Andersson",
                    "user_href": "/profile/Linnea-Andersson-8"
                },
                {
                    "user_id": "Konstantine Karavasilis",
                    "user_href": "/profile/Konstantine-Karavasilis"
                },
                {
                    "user_id": "Matthew Russell",
                    "user_href": "/profile/Matthew-Russell-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathan Ketsdever",
                "href": "/profile/Nathan-Ketsdever"
            },
            "answer_text": "Flawed Argument #1: Saying that science is the only legitimate form of proof, evidence, or data.  That is to say that science is the only form of valid knowledge.  Or contrasting science with non-science in a way that totally denies the legitimacy of knowledge forms that fall outside of science. Why is it flawed?   Because that is a statement of philosophy, not of science.  So the statement is self-refuting.History, philosophy, literature, and the arts all have value and insight.  Psychology and the social sciences do as well.Because other branches of human knowledge have provided us with massive amounts of knowledge.Because human survival is dependent on non-science in our lives in the form of empiricism and experience.Because no one lives their life by eliminating everything non-science from their life.Because love, relationships, ethics, beauty, wonder, and decisions of meaning and purpose all fall outside the realm of science.  Again, survival would be impossible if this dictum was actually followed.It closely resembles the Humean assertion to burn all non-science books, because they are useless.  This is the logical extension of the zealotry of scientism.  Again, no one follows this principle, because everyone goes to the movies, consumes music, watches the news, and presumably doesn't just limit their reading to physics, biology, and chemistry.All forms of intuition and inference are non-scientific.  They are hunches of various levels of credibility.Also most all knowledge is data plus inference.Not to mention trust, human relationships, and wisdom would all fall outside this realm and be crushed, silenced, and ignored.If you are a non-science graduate....or learned anything from any of your non-science classes--you know this statement to not be true.  Its one of the most fallacious statements in common parlance that receives far more than it could possibly deserves.  Its ultimately a dead end for relationships, communities, and civilization.  Its a dead end certainly for justice, innovation, and leadership.  (all of which fall outside of biology, physics, and chemistry) This goes a step further in the logical problems with scientism (both the text and the video): Nathan Ketsdever's answer to What is scientism? Once you read that, this is should be helpful in thinking about other errors in reasoning: Nathan Ketsdever's answer to What are common logical fallacies used against religion? ",
            "date": "Answered March 21, 2016",
            "views": "241",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lee Rowlands",
                    "user_href": "/profile/Lee-Rowlands-6"
                },
                {
                    "user_id": "Donald Roe",
                    "user_href": "/profile/Donald-Roe-2"
                },
                {
                    "user_id": "Nicolás Cuervo",
                    "user_href": "/profile/Nicolás-Cuervo-1"
                },
                {
                    "user_id": "Gustavo Tintaya Tito",
                    "user_href": "/profile/Gustavo-Tintaya-Tito"
                },
                {
                    "user_id": "Jo Cahill",
                    "user_href": "/profile/Jo-Cahill"
                },
                {
                    "user_id": "Otho Fernandes Damasceno",
                    "user_href": "/profile/Otho-Fernandes-Damasceno"
                },
                {
                    "user_id": "Jane Hawkins",
                    "user_href": "/profile/Jane-Hawkins"
                },
                {
                    "user_id": "Andy Kaminski",
                    "user_href": "/profile/Andy-Kaminski-1"
                },
                {
                    "user_id": "Matthew Russell",
                    "user_href": "/profile/Matthew-Russell-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martin Reyto",
                "href": "/profile/Martin-Reyto"
            },
            "answer_text": "All arguments by atheists and theists turn really bad as soon as they try to persuade others that what's right and true for them is also right and true for everyone else. But to give them their due, my observation has been that arguments by atheists are mostly advanced to persuade certain of the faithful to just be faithful and shut the fuck up about it, instead of relentlessly trying to change the country into a religious state governed by biblical law. So while I'm not an atheist, atheists win in my book. ",
            "date": "Answered March 21, 2016",
            "views": "203",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Holder",
                    "user_href": "/profile/John-Holder-66"
                },
                {
                    "user_id": "Adam Sivachev",
                    "user_href": "/profile/Adam-Sivachev"
                },
                {
                    "user_id": "Mar Moo",
                    "user_href": "/profile/Mar-Moo"
                },
                {
                    "user_id": "Alex Anderson",
                    "user_href": "/profile/Alex-Anderson-292"
                },
                {
                    "user_id": "Charles Cornelius",
                    "user_href": "/profile/Charles-Cornelius"
                },
                {
                    "user_id": "Pedro Mason",
                    "user_href": "/profile/Pedro-Mason"
                },
                {
                    "user_id": "Kevin Wright",
                    "user_href": "/profile/Kevin-Wright"
                },
                {
                    "user_id": "John Gardner",
                    "user_href": "/profile/John-Gardner-63"
                },
                {
                    "user_id": "Josh Franks",
                    "user_href": "/profile/Josh-Franks-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ken Taylor",
                "href": "/profile/Ken-Taylor-32"
            },
            "answer_text": "The worst argument made by a theist is that the Bible says that the earth is only about 12, 000 years old.  The Bible doesn't say that.  The worst argument made by an atheist is that you cannot prove that God exists. ",
            "date": "Answered March 21, 2016",
            "views": "40",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aaron Araujo",
                    "user_href": "/profile/Aaron-Araujo-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Darion James",
                "href": "/profile/Darion-James-1"
            },
            "answer_text": "Definitely the “if God exist then why does he allow (insert bad thing here) to happen?” We don't fully understand the why of most things (both scientific and theological) so to use something like that as proof God isn't real has no logic to it at all. I don't know why bad things happen, but I do know a lot of those people who use that argument spend more time complaining about things than they do working to make this world a better place. ",
            "date": "Answered June 12, 2017",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aaron Araujo",
                "href": "/profile/Aaron-Araujo-3"
            },
            "answer_text": "That “if God was real there would be no suffering, no crime or hate…” This was what an atheist told me. So I asked him, “So if there is no God, why is there suffering, crime, and hate?” Silence. I’ve yet to have this question answered. ",
            "date": "Answered February 3, 2017",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William John Muzzarelli Vann",
                "href": "/profile/William-John-Muzzarelli-Vann"
            },
            "answer_text": "That everything happened as a series of convenient coincidental accidents. Especially human consciousness, intelligence and intelligibility in general. It's pure malarkey. ",
            "date": "Answered March 21, 2016",
            "views": "62",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aaron Araujo",
                    "user_href": "/profile/Aaron-Araujo-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nestor Ordonez",
                "href": "/profile/Nestor-Ordonez"
            },
            "answer_text": "That we come from monkeys. That's just pain stupid. Why haven't any monkeys become humans in history? They really need to stop teaching this nonsense at schools. ",
            "date": "Answered October 27, 2016",
            "views": "33",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Will Linden",
                "href": "/profile/Will-Linden"
            },
            "answer_text": "All Christians are nefarious ________. If you aren’t ________, then you aren’t a real Christian! Oh? And who elected YOU Pope? Sort of a reverse No True Scotsman. ",
            "date": "Updated July 24, 2020",
            "views": "37",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jason Holloway",
                "href": "/profile/Jason-Holloway-10"
            },
            "answer_text": "That god dont exist and they dont believe while they celbrate all religious holdays also that science is right when their answers are on the  same paper and words just like the bible but god got a universe and man just got a verse  ",
            "date": "Answered March 21, 2016",
            "views": "22",
            "upvotes": "0"
        }
    ]
}