{
    "title": "At what age do you find who you are? - Quora",
    "tags": [
        "Advice About Aging",
        "Identities",
        "Aging",
        "Age",
        "Life and Living",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Angie Falzarano",
                "href": "/profile/Angie-Falzarano"
            },
            "answer_text": "At 58 im still learning who i am. I know everybodys thinking by that age i should know but let me explain. At 6, i was molested by my uncle. At 7 i was diagnosed as add/adhd. At 15 i damaged both knees in a fall. So at 15 i became a person who has to be careful every day to stay put out of pain. Slso at that age i felt suicidal. My relationship with my parents was bad, but thank you God i met my best friend and he snd his mom got me thru it. Moving out right after high school at 19. I could barely keep a job. At 27 i went back to college at a technical school, so now im sn older student then the majority. Also met my future husband there. Graduated at 29. Got married at 31. I was still trying to figure life out. My depression was bad and was put on anti depressants. Happily divorced at 35. But had been kinda isolated during my marrizge from a lot of my friends. So at 36 trying to develop more friendship. I was still having a hard time keeping a job. Then 2001, 9/11 occured and like everyones else my world was turned upside down. At 44, i became a TSA officer. It was hard but i was good at it. At 51 i was diagnosed eith hip dysplasia. Now i have to be careful specially sitting and standing too long. Now i should say at this point i hsve been bullied all my life from other students, teachers (yes teachers), bosses and coworkers. At the beginning of 2013, i was 53, i began having problem with my meds. So the docs stas rted trying to figure out a good combination again. Two different meds caised severe side effects with 1 ending me up in the emergency room. So i had to be taken off everyyhing. Everything had been going half decent, but a new coworker started bullying me despite me assuming id gotten away from it. I kept reporting it and she was talked to but it made it worse and then she got another coworker to start bullying me too. Breaking into tears one night talking to management, they felt i needed to take a day off. And the next mrnong i had a complete meltdown. Everybody thought i was suicidal. My parents picked me and then it to h### in handbasket. My mom became even more controlling trying dictate what was going on. Mu life wasnt perfect but this time i hit rock bottom. So at 53, there was nowhere i could away from pain. A friend took me to the emergemcy pysch waiting to be seen for 8 hrs. I was not in good shape. Finally i was seen. Not only did i have severe stress and anxiety, i was bipolar. Thats when my world turned updide down again. You would think at 53 i would have some idea we ho i was but no. Now i find out ive been living with an undiagnosed mental illness (mental illness runs in the family). I tried to continue working but finally had to retire on disability. At 54, i became gluten intolerant. I kept thinking when will i finally get to a good place in my life. Fast forward 4 years, ive had to deal in this past year z manager who lied about me, threatened me if i didnt leave id be physically thrown out. He refused to get the correct till i left. Went into s full blown anxiety attack. Within 10 mins it was found that the mgr had misidentified me. Didnt help the attack tho. Moved to another branch of the company (it was a theater, i just moved to a different one). A month later a customer told a bunch of lies about me that were so ludicris i cant believe they took her serious. The cameras showed nothing of what she accused me of but corporate decided i had stepped out of bounds asking her what she had hidden in her pockets so they fired me. 4 months later i had a supervisor at a different jib kept tellong me everyday how bad of a job i was doing and threatened me everyday with my job. I made such a difference in the department that day shift coworkers, who never went in the dept because it was so bad, would tell me how excited that the dept would look so good they actually went in and would find exactly what they needed. I had proof of the day people iin my dept were hiding things instead of folding them. Or taking product i put out and hiding it in other boxes. Despite having pictures, i was the one who caught h### for the dept. I quit. 3 months later went back to work for a temp job i had had the year before and loved it. Now this job was h### because they hored a bunch of hogh schoolers who wouldnt do their work. We all had radios with ear plugs. And one 17 yr old told a manager that i called a family fat and smelly and she found it offensive and racists (they were hispanic, just a note my second fsmily is hispanic im considered one of their children). So the manager confronted me about not saying anything like that on the radio. I had not said anything like that, i had said the family was upset because we didnt have what the wanted and just giving a heads up. Left after my shift ended up with another anxiety attack. Now i have no job, barely making it and too scared to try and find a job again. Sorry this is so long. But i wanted to explain at almost 59 yrs old i still dont know who i am. Because everytime i think i know, another brick is thrown at me and i have to start over. Maybe one day ill know, but for now i just keep trying to figure out who i sm supposed to be. ",
            "date": "Answered December 3, 2018",
            "views": "17",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Riley Miller",
                    "user_href": "/profile/Riley-Miller-75"
                },
                {
                    "user_id": "Ana Oop-",
                    "user_href": "/profile/Ana-Oop-7"
                },
                {
                    "user_id": "Kaitlyn Brewer",
                    "user_href": "/profile/Kaitlyn-Brewer-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kari Autero",
                "href": "/profile/Kari-Autero"
            },
            "answer_text": "I don’t know exactly when I found my identity. I’m 59 now and I know that I’ve known who I am for quite a some time. Or that’s atleast what I think now. This is not my invention, but I think that a human’s task is to grow to be him(her)self. I think I’ve originally picked this up from Tony Dunderfelt, a Finnish psycologist who has written about the “lifespan psychology” (I don’t know the proper English translation). (Iloiseksi.fi in Finnish) He discusses the lifespan and how the beginning of it consists of socializing of a human: parents, family, school etc all tell you how to be a proper human. You learn the rules. The outside world tells you who you are and you fit in the society. These lessons are wrapped around your true self like the layers in an onion. When youre “ready” you’re like an onion: layer after layer and in the innermost core, there is your true self. In the teenage and young adulthood you learn that you’ve been indoctrinated and you rebel against that. That’s what you’re supposed to do. The rest of your life you spend peeling those cultural norms from you, once you’ve found that a large part of your identity has been built by someone else. The expectations of your family, your friends, your children, your boss, your peers. Once you’ve peeled the last layer, you can see your true self. For some, that happens decades before they die and they can spend their late yeasrs as free. For some, that work won’t be finished during their lives. Dunderfelt - and I - see that as sort of a misfortune, like an unfinished work. This is not to critisize that indoctrination. That has to happen: we must know how to be huimans in a society. It just buries our true self along the way. And to know who we really are, we must use the rest of our lives to see through those layers. So, I’m now 59 and I feel that I know who I am. But I have, if I’m luvky, some 20 years left. I’m eager to know whether I still have some peeling to do. ",
            "date": "Answered February 23, 2019",
            "views": "581",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kristi McNair",
                    "user_href": "/profile/Kristi-McNair"
                },
                {
                    "user_id": "Cara Mars",
                    "user_href": "/profile/Cara-Mars"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeno M. Vann",
                "href": "/profile/Jeno-M-Vann"
            },
            "answer_text": "I must have been in my thirties when I had what I call a midlife crisis. That’s the time when my son was born and I was confused about religions and salvation. Like, basically what's real and what's religious dogma. I guess having a child is when knowing the truth about myself and everything else became important. This is when the moment of clarity came when I lost my family to infidelity by my son's mother. I was forced into only visitation of my only child where the 2008 housing crisis left me unable to even have 50% custody with no home to bring my son too or even visit. Right after baptism and devotion to God I saw my life and identity as a father crumble before my eyes. This wasn't suppose to happen after I had given my life to Christ. I realized what I lost I could never have back. Just in knowing I will not wake up in the same house as my son and see him every day throught his childhood, gone. Given the responsibility to a stepfather in my absence. I also realized then that you save yourself no one can save you. This is how I learned the true meaning of ‘awakened' ",
            "date": "Updated October 6, 2020",
            "views": "97",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Human Being",
                    "user_href": "/profile/Human-Being-468"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robin Johnson",
                "href": "/profile/Robin-Johnson-251"
            },
            "answer_text": "Thanks for the A2A. I have always known that I was female. I have never questioned it; I am confused with all this gender-queer stuff. It is stupid and lame.. and just plain disastrous! The mental health of our society is deteriorating fast, and it will continue to do so unless we fight back this useless fight. I believe this candidate for US Senate in CA is correct: http://www.fight-the-power.org/2018/04/17/they-are-attacking-the-children/ http://www.fight-the-power.org/ban-the-mutilation-of-children-an-attack-on-boys/ ‘A campaign for Sanity. There is no such thing as ‘transgender.’ It does not exist. What does exist are broken people who pretend to be the opposite sex and even mutilate themselves in the attempt. In our constitutional Republic, we are free to be psychotic as long as we do not hurt ourselves or others but we have no right to lie to children and teach them that this mental, emotional, and spiritual pathology/sickness is normal, natural, or healthy in the slightest possible way. To do so is a very sick attack upon children and is a form of child molestation… So-called ‘transgender’ children are being used as weapons to attack and destroy normal/healthy children…objective is to warp and then break the moral foundations…will be manufactured into psychotics and then destroyed.’ ~~from the Voter Information Guide (CA) ",
            "date": "Answered June 9, 2018",
            "views": "183",
            "upvotes": " Answer requested by Colten Krauter",
            "upvoters": [
                {
                    "user_id": "Sap Moroky",
                    "user_href": "/profile/Sap-Moroky"
                },
                {
                    "user_id": "Ryan Bronson",
                    "user_href": "/profile/Ryan-Bronson-6"
                },
                {
                    "user_id": "Amir Fasrul",
                    "user_href": "/profile/Amir-Fasrul"
                }
            ]
        },
        {
            "author_info": {
                "name": "Patricia Lontoc",
                "href": "/profile/Patricia-Lontoc"
            },
            "answer_text": "I was 5 years old when I began to know myself and learned to write a daily diary about my encounters with people and my relationships with my mom and dad. This diary became an illustrated one when I learned to sketch and paint at 6 years old. When Manila became flooded and the first floor of our house was flooded, I lost the ink on my diary and the watercolor of many of mymixed media paintings. I had to restart but could not really recall what i had written, so I just moved on in my writing. Most of my paintings and paint materials (paints and brushes, cardinell paper and canvas) were also destroyed by the floods. All that was harder to take. I couldn’t get myself to paint beyond using crayola, but later discovered Pentel and Grumbacher oils. The art exhibit I had when I was 7 years old was followed up only 5 years later, when I was 12 years old. I contributed only three paintings , with three matching poems in English which I wrote, to a group exhibition with named Filipino artists, JDalena and Ocampo (who became National Artist). They said that was the first team up of artists of three generations. And then there was a long wait again for me. It was hard to see paintings destroyed randomly by mud and rain, during another flood rather than to just lose them and not see them again. It was hard for me to paint again. I was already 25 when I had a Hallway Exhibit of my 25 paintings at the Asian Institute of Tourism, and sold 10 out of 25 for just a 10-day Hallway Exhibit. I realized then that it was heart wrenching to part with my paintings, even if, at that time, I was raising funds for a small barangay library in the barangay where I was the topnotcher councilor. My last paintings wre those painted for that exhibit. I have not touched my brushes,my oils, my easel and my canvas since then. Doyou think this year, I will paint again? ",
            "date": "Answered February 5, 2018",
            "views": "843",
            "upvotes": " Answer requested by Chipper Kingston",
            "upvoters": [
                {
                    "user_id": "Mark Cayton",
                    "user_href": "/profile/Mark-Cayton-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emerald Sings",
                "href": "/profile/Emerald-Sings"
            },
            "answer_text": "It is a good question but I don't think your age really defines anything. I think its more like life experiences and the way you choose to react to it. I think that experiencing death through family members really helped shape my way of thinking and prioritizes my attitude on life. Then watching friends and family suffer drug and alcohol addictions, abuse and poverty makes me more grateful for even the smallest things. It also keeps me humble. And sober. And helps me be more understanding and empathetic of others and less prejudice. Its not always easy dealing with those less fortunate I'll admit that. And living among them sometimes is almost impossible. There are a lot of people with mental illnesses and they try to make trouble and pick fights but it is part of my life and I deal with it and do what I have to do. Someday I hope to make a lot of money so I can build good homes and permanant jobs and be able to help many people get back on their feet and make a good life for themselves. But anyway right now they are just dreams. But when it comes to maturity, I guess it really just depends on the person. ",
            "date": "Answered February 2, 2018",
            "views": "12",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Human Being",
                    "user_href": "/profile/Human-Being-468"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lukholo Molose",
                "href": "/profile/Lukholo-Molose"
            },
            "answer_text": "You’ll find out who you are when your time is almost up…cliché right? Now, this question can be interpreted in multiple ways, but let me go with personality. I am an INTJ personality type…you can literally read about the traits and characteristics associated with this personality. (Keep in mind that this happened when I was 16 at the time) Now did I really know who I was just by taking that test from both a psychologist and 16personlities? Nope, at that age, I still did not know who I am let alone what I wanted to do with the rest of my life. There is no age at which you know who you really are because you keep learning new things about yourself However, when you are in a near-death experience, and/or your life is threatened…you will know who you are and what you stand for once you survive. The thing is…it will happen at any age and when one doesn’t expect it.  ",
            "date": "Updated August 22, 2020",
            "views": "486",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Amir Ali",
                    "user_href": "/profile/Amir-Ali-306"
                }
            ]
        },
        {
            "author_info": {
                "name": "Conni Jurmo",
                "href": "/profile/Conni-Jurmo"
            },
            "answer_text": "I don’t think there is any specific age where you know all about yourself. I think it is a learning process that we go through our entire life. As you grow older, you may learn about your interests and dislikes, people you like and those who you don’t, the type of humor you enjoy or whether you enjoy any type of humor at all. You will learn why you like someone or something or why you don’t but there is no time when you know it all. You are a work in progress. ",
            "date": "Answered February 3, 2018",
            "views": "225",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Human Being",
                    "user_href": "/profile/Human-Being-468"
                },
                {
                    "user_id": "Ange Calm Campbell",
                    "user_href": "/profile/Ange-Calm-Campbell"
                },
                {
                    "user_id": "Michael J. McFadden",
                    "user_href": "/profile/Michael-J-McFadden"
                },
                {
                    "user_id": "Linda Culp",
                    "user_href": "/profile/Linda-Culp-1"
                },
                {
                    "user_id": "Sherry Thompson",
                    "user_href": "/profile/Sherry-Thompson-125"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eugéne Du Plessis",
                "href": "/profile/Eugéne-Du-Plessis-1"
            },
            "answer_text": "I’ve always felt like my true self. There was never a time that I didn’t feel like I’m in my own skin, so to speak. However to be perfectly honest in my 30’s I feel most like my true self. Your teens your still under your parents rule & influence. Your 20’s is experiment time! Finding out what you like or dislike, pushing boundaries & setting boundaries, things you will accept & things you won’t accept. By late 20’s you start enforcing the things you learned & applying them. ",
            "date": "Answered August 24, 2018",
            "views": "138",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Khushi Verma",
                "href": "/profile/Khushi-Verma-409"
            },
            "answer_text": "I do not know about others but I started to identify myself as I am today more or less from the age of 13 not very clearly but quite close to my personality. I believe that in your entire life you cannot define your accurately for you cannot come to the exact notion that this is me and this only is me , not possible. So, whatever we asses about ourselves is the closest to our real personality because we grow in age and personality all our life. Basically I am a feminist so my most of the personality revolves around me being feminist, secular and a writer. I started my writing at the age of 11 so I am a dreamer most of the time. So I hope I am able to answer your question and I am thankful for your question. ",
            "date": "Answered July 24, 2020",
            "views": "119",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ange Calm Campbell",
                    "user_href": "/profile/Ange-Calm-Campbell"
                },
                {
                    "user_id": "Steven Ussery",
                    "user_href": "/profile/Steven-Ussery"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathanial Lee Vigder",
                "href": "/profile/Nathanial-Lee-Vigder"
            },
            "answer_text": "It's still happening, as we speak. Er…type. You never stop changing, or “becoming you\". Who you are isn't really a static thing, or an ultimate goal. It is a lifelong event. Mainly because who you really are, always changes. The only time who you are stops changing, is when you're dead and buried. One day, the real you may be a plumber, who likes plain toast. But the next day? You might be a plumber who likes toast with nutella. The next month? You might decide to become a ballerina who likes quiche. We never really stop becoming someone different. As we age, and learn, and discover, we change who we are. Outside influences change us. Internal forces change us. We never stop. ",
            "date": "Answered August 18, 2019",
            "views": "121",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Malini Rajendra",
                    "user_href": "/profile/Malini-Rajendra"
                },
                {
                    "user_id": "Emerald Sings",
                    "user_href": "/profile/Emerald-Sings"
                },
                {
                    "user_id": "Chipper Kingston",
                    "user_href": "/profile/Chipper-Kingston"
                }
            ]
        },
        {
            "author_info": {
                "name": "Helen Spencer",
                "href": "/profile/Helen-Spencer-30"
            },
            "answer_text": "Probably around 22. I became comfortable with who I am and what I do. I endeavour to always put people first, but take comfort that I can't be all things to all people these days. I was inspired by Martha Beck[1]and attempted to find me, “my north” this year, very inspiring and warm and fuzzy with a little help from my friends. Take a peep if you fancy: Me, Myself & I » Parenting Fails and Pigtails It can only happen to me H x Footnotes[1] Martha Beck",
            "date": "Answered August 19, 2019",
            "views": "55",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vick Ell",
                "href": "/profile/Vick-Ell"
            },
            "answer_text": "I think it's different for everyone. I’m 15 I pretty sure I know who I am, but I'm not who I am, if that makes any since. I have this strong feeling of who I am and I can just imagine it, but that's not me.. yet… I'm battling a few mental illnesses that are preventing me from becoming, and yet are part of, who I am. I believe once I've figured out how to overcome my illnesses I'll truly become who I am. I know who I am but I'm not who I am. This is just how it is for me though. Everyone is different. ",
            "date": "Answered September 8, 2019",
            "views": "128",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Peter Ratcliffe",
                "href": "/profile/Peter-Ratcliffe-2"
            },
            "answer_text": "I’m almost 65 years old and still learn new things about myself almost every day. A good life includes constant change, constant learning. So we’re never fully defined until we die. I hope to understand myself and who I am fully a few moments before my inevitable death some time long into the future. The days I’ve learned the most about myself are the worst days of my life so far. The Universe randomly distributes great and horrible, all we can choose sometimes is how to respond and survive. Those days we dig deepest really define us more than the days we face no challenges. ",
            "date": "Answered August 3, 2018",
            "views": "290",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ange Calm Campbell",
                    "user_href": "/profile/Ange-Calm-Campbell"
                },
                {
                    "user_id": "Raushan Entertainment",
                    "user_href": "/profile/Raushan-Entertainment"
                },
                {
                    "user_id": "Mahesh Mundel",
                    "user_href": "/profile/Mahesh-Mundel-1"
                },
                {
                    "user_id": "Prashanth Valangan",
                    "user_href": "/profile/Prashanth-Valangan"
                },
                {
                    "user_id": "Chandini R",
                    "user_href": "/profile/Chandini-R-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sohail Ahmed",
                "href": "/profile/Sohail-Ahmed-7"
            },
            "answer_text": "Thanks Kyle for a2a. I knew myself quite early. I knew I had a liking for writing. I started writing Urdu articles. I knew I was very good in science subjects. I knew I could do good if I changed my educational plans. It all happened favorably and I ended up as an engineer. I had a long career in a government department and I gained experience through working in other organizations on deputations. Now I am happy to spend my days as a pensioner. I do have some preoccupations. Quora is one of them. I am indeed happy to be able to exert as per my capacity. ",
            "date": "Answered February 2, 2018",
            "views": "846",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Human Being",
                    "user_href": "/profile/Human-Being-468"
                },
                {
                    "user_id": "Ange Calm Campbell",
                    "user_href": "/profile/Ange-Calm-Campbell"
                },
                {
                    "user_id": "Pranav Prabhu",
                    "user_href": "/profile/Pranav-Prabhu-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jaismine Singh",
                "href": "/profile/Jaismine-Singh"
            },
            "answer_text": "I don't know about others but for me this age is not one. When I was 15 years old I thought I know exactly what I am and what I want, after that it was 17 I thought but today I say its NOW when I am 18 years old. May be 18 is that age only because today i know more, but my principle of life is to always keep learning. So, may be for me it will keep changing because it seems easy but it's really very hard to know yourself, to understand yourself, to be your best friend and as we grow up we learn more and realise more. But honestly i think my present age i.e 18 years is that age when I got to know more exactly about myself​. Thanks for reading JS :) ",
            "date": "Updated June 7, 2018",
            "views": "187",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Human Being",
                    "user_href": "/profile/Human-Being-468"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Francis",
                "href": "/profile/Mark-Francis-187"
            },
            "answer_text": "I’ll be 60 this fall and I think I am just beginning to get the hang of this. The Founding Fathers of America thought 35 was an absolute minimum age to be president, and I think there is something to that. My guess is that I’m a slow learner and most people probably get to the point of self-knowledge by about age 40. ",
            "date": "Answered February 2, 2018",
            "views": "147",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paul Byerly",
                "href": "/profile/Paul-Byerly"
            },
            "answer_text": "It’s a process, not an event. Some people never start the process, living their whole life as who others want them to be. Some start the process but stop because they can’t deal with the pushback they get from others. I’d say the process generally doesn’t start till past the mid 20’s. There are exceptions, but they are rare. A major life event (marriage, death, moving to someplace where you know no one) can start or advance this process. It's a difficult journey, but it’s so worth it. Being yourself feels better than being who others want you to be, and it sets you free to do great things! ",
            "date": "Updated December 4, 2018",
            "views": "304",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Human Being",
                    "user_href": "/profile/Human-Being-468"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tammy Gregg",
                "href": "/profile/Tammy-Gregg-1"
            },
            "answer_text": "There is no age. Sadly some people don't even know themselves when they're on their natural death bed. It takes experimentation and a lot of exiting what you consider your comfort zone. Not everyone can do this. Plus - rarely - people change, so who you were and were familiar with, may not be who you are. Depending on how recently you changed /decided to change, you may not know every new aspect of yourself perfectly. ",
            "date": "Answered February 3, 2018",
            "views": "243",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Julie Hendricks",
                    "user_href": "/profile/Julie-Hendricks-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bekah Jimenez",
                "href": "/profile/Bekah-Jimenez"
            },
            "answer_text": "“The person you are” is a plastic concept. I knew who I was when I was 15, but I changed who that was in college. Then I got married and moved to another country, which changed a lot of my perspectives on life and made a difference in my fabric again. Being a mother and divorcing have also changed me in profound ways. Not all changes have been for the better, I can honestly say, but I hope to never stop changing, learning, and growing. ",
            "date": "Answered January 8, 2019",
            "views": "72",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "NKM Dony",
                    "user_href": "/profile/NKM-Dony"
                }
            ]
        },
        {
            "author_info": {
                "name": "Handy",
                "href": "/profile/Handy-8"
            },
            "answer_text": "I’m very young, but I think that there is no “true self”, but rather core values. The point is to grow and change, adapt to new things. However, I think we all have core values that rarely shift, unless some type of major catalyst forces a new perspective. Being true to yourself and your core values has no age. ",
            "date": "Answered August 24, 2018",
            "views": "44",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tim ODonnell",
                "href": "/profile/Tim-ODonnell-33"
            },
            "answer_text": "A2A - At what age do you really know yourself and what you’re all about? At approximately 18 months we become self-aware. (Babies recognize themselves in a mirror.) However, there is no designated age where one comes to know themselves. Many go their whole lives with little understanding of self. ",
            "date": "Answered February 5, 2018",
            "views": "128",
            "upvotes": " Answer requested by Chipper Kingston",
            "upvoters": [
                {
                    "user_id": "Nicholas Kris",
                    "user_href": "/profile/Nicholas-Kris-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aaron Bierwirth",
                "href": "/profile/Aaron-Bierwirth"
            },
            "answer_text": "The sooner the better, i mean, i understand myself very well, i only need to apply my extensive knowledge to my lack of experience and once i gain the experience i am set for facing life’s many intriguing challenges. ",
            "date": "Answered August 4, 2018",
            "views": "52",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ron Leighman",
                "href": "/profile/Ron-Leighman"
            },
            "answer_text": "The first time an adult said: “Because I said so.” I had to be 7 at the time. It was some teacher, and her words sparked the rebel inside me. ",
            "date": "Answered July 2, 2020",
            "views": "22",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bridget Swain",
                "href": "/profile/Bridget-Swain"
            },
            "answer_text": "It’s different for every person. For me, it was 35 - 45. For the next person it might be mid 20′s or late 80′s. You never will know til you get there. ",
            "date": "Answered August 24, 2018",
            "views": "59",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Jackie Harpold",
                "href": "/profile/Jackie-Harpold"
            },
            "answer_text": "I am not sure I know the person I am now . ",
            "date": "Answered January 10, 2019",
            "views": "50",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Lorna Hanen",
                "href": "/profile/Lorna-Hanen-1"
            },
            "answer_text": "8 ",
            "date": "Answered September 11, 2019",
            "views": "45",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Melanie Sin",
                "href": "/profile/Melanie-Sin-1"
            },
            "answer_text": "I don’t know. I’ve always just been “me”. ",
            "date": "Answered June 10, 2018",
            "views": "34",
            "upvotes": " Answer requested by Colten Krauter"
        }
    ]
}