{
    "title": "At what moment did you realize how serious Covid-19 was? - Quora",
    "tags": [
        "Self Realization",
        "Realization",
        "Moments",
        "Important Life Lessons",
        "COVID-19 (2019-2020)",
        "Experiences in Life",
        "Philosophy of Everyday Life",
        "Life and Living",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Evan Willow",
                "href": "/profile/Evan-Willow-1"
            },
            "answer_text": "When my school started mentioning a “digital plan.”  [1] When I first heard about the virus, I thought it was fake. Who wouldn’t? It’s literally called the corona virus, it has the same name as a common beer brand, how real can this thing be? About a month ago, I had this exact conversation with a friend of mine. I think it was in the food court sometime after school, and we both were just in awe that some people would believe such a ridiculous internet meme. With impeccable timing, that was when we received an email from the school mentioning the possible transfer of offline to online school, using a “digital learning plan”. It was all up in the air of course, considering we didn’t know a ton about this virus and it could be dying down but the email essentially said that the faculty and staff were prepared for whatever was to head our way. That’s when it became real for me. It was terrifying to think that this new, mysterious virus was spreading worldwide without a vaccine, meanwhile this whole time I was just laughing at the memes people were making about it. Looking back I feel a little bad for doing so, but I was unaware of the seriousness of the situation, so I don’t beat myself up for that too much. Today is actually my school’s two week Quarantiniversary, although it feels like it’s been way longer. I miss going out to eat and seeing my friends, especially since my school’s planning on finishing out the school year like this (oof). I am definitely not looking forward to that. N'oubliez pas de vous laver les mains, -Evan Footnotes[1] https://r.search.yahoo.com/_ylt=AwrEzNRVFH5eLVcA4IOjzbkF;_ylu=X3oDMTBtdXBkbHJyBHNlYwNmcC1hdHRyaWIEc2xrA3J1cmw-/RV=2/RE=1585349845/RO=11/RU=https%3a%2f%2fwww.theyucatantimes.com%2f2020%2f01%2fmillions-of-people-think-coronavirus-is-related-to-corona-beer%2f/RK=2/RS=havqJwuP6lsyLpoaYRN0Gn.WNbw-",
            "date": "Answered March 27, 2020",
            "views": "125",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Markee Jackson",
                    "user_href": "/profile/Markee-Jackson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Randy Almond",
                "href": "/profile/Randy-Almond-3"
            },
            "answer_text": "Strangely enough, I was so busy with my 2 jobs working almost 60 hours per week that I missed many of Covid-19’s developments … until … the spread became exponential. Just last Sunday - March 22 - I slowed down long enough to read of all the impacts internationally … all the infections, all the DEATHS … I felt like I had been hit in the head with a sledgehammer. NOW that I am paying more attention DAILY, I am overwhelmed DAILY!!! ",
            "date": "Answered March 27, 2020",
            "views": "28",
            "upvotes": " Answer requested by Markee Jackson",
            "upvoters": [
                {
                    "user_id": "Markee Jackson",
                    "user_href": "/profile/Markee-Jackson"
                }
            ]
        },
        {
            "author_info": {
                "name": "AnneMarie Greenfield",
                "href": "/profile/AnneMarie-Greenfield"
            },
            "answer_text": "As soon as I read that China has quarantined Wuhan. I have to pay attention to things like that because I'm immunocompromised. I also knew we were not prepared for it since Trump had been dismantling many of the pandemic teams and recalling them from around the world. China's team was one of those recalled. So it's going to be bad. ",
            "date": "Answered March 29, 2020",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Emma Wats",
                "href": "/profile/Emma-Wats"
            },
            "answer_text": "I did from the beginning while my family didn’t take it seriously. Oh, it’s just another flu. Or, it’s killed less than the flu. I told them how serious this was and they rolled their eyes at me. I think now, after weeks of people getting very sick, they know. ",
            "date": "Answered March 28, 2020",
            "views": "67",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ikenna Stanley",
                "href": "/profile/Ikenna-Stanley-4"
            },
            "answer_text": "The moment I woke up and everything around me was so irritating. I wasn’t able to travel back home because of the lockdown. My mind was racing uncontrollably. Wasn’t able to concentrate on anything. My panic level was above the roof. ",
            "date": "Answered April 20, 2020",
            "views": "93",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Emilio Tommasi",
                "href": "/profile/Emilio-Tommasi"
            },
            "answer_text": "On Monday March 9 all members of my Golf Club received an email informing us that the Club was going to be closed indefinitely due to Covid-19 That made me realize how very serious the situation was ",
            "date": "Answered March 27, 2020",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vasiliki Tzalachani",
                "href": "/profile/Vasiliki-Tzalachani"
            },
            "answer_text": "The moment that it was told that the symptoms of the virus are just like the flu's and there is no way to distinguish them or there is a cure and people are dying within hours of getting it. That isolating the Chinese province didn't stop it and it spread. ",
            "date": "Answered March 27, 2020",
            "views": "33",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Jack Nordby",
                "href": "/profile/Jack-Nordby"
            },
            "answer_text": "My knowledge of math and statistics told me by early January that this would probably be very serious. ",
            "date": "Answered April 20, 2020",
            "views": "6",
            "upvotes": "0"
        }
    ]
}