{
    "title": "At what point does money become irrelevant? - Quora",
    "tags": [
        "Greed",
        "Money"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sue Sanders",
                "href": "/profile/Sue-Sanders-3"
            },
            "answer_text": "You present a lot of variables in that one question. For one, are you discussing someone who is wealthy and doesn’t need to worry about gaining any more money? That answer would be never. People never stop worrying, at some level, about finances because at any time they could lose what they have. No matter how unreasonable it may seem to them and the rest of the world, the stuff could dwindle, or disappear all at once, along with everything it bought. Being penniless must be a horrible, mental, if not subconscious state of mind for those who seem to have it all. For another, are you asking - when is enough, enough? Depends on the person, what they want to do if they have more, because - as everyone knows - there’s always more to acquire even if you don’t need whatever it is. Kind of like a George Carlin routine where he tells how you need a bigger house to hold all your stuff, and then that house also becomes too small because you got more stuff, and so on and so on. Great lesson, George. To me, the question of when is enough is irrelevant. Even if a wealthy person learns not to grasp for himself/herself, there’s also the rest of the world, a huge percentage living in poverty, starvation, suffering, including all living things. “Enough” then stops being a personal problem, even if you realize you really do have enough for yourself and family alone; the entire world is a family, all sentient beings struggling toward the same goal - to be happy and not suffer. Your “extra” money could help them or their organizations toward that goal. You could even begin foundations of your own, such as Bill Gates did, and countless other rich people. Therefore, there is never enough if you realize the world as one being; but there could be enough if you learn not to grasp for or desire material objects, experiences, and so on that go beyond your means. At that point, enough is food, shelter, and love. That’s enough. ",
            "date": "Answered August 10, 2016",
            "views": "913",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Caio Braga",
                    "user_href": "/profile/Caio-Braga-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Hilderbrand",
                "href": "/profile/Jon-Hilderbrand"
            },
            "answer_text": "Someone once asked John Rockefeller how much money was enough. His reply? \"Just a little bit more.\"You're on a fool's errand. If you're truly greedy, no amount of money will ever satisfy you. I would urge you to please reconsider your priorities: \"Beware, and be on your guard against every form of greed; for not even when one has an abundance does his life consist of his possessions.\" And (Jesus) told them a parable, saying, \"The land of a rich man was very productive. And he began reasoning to himself, saying, 'What shall I do, since I have no place to store my crops?'\"Then he said, 'This is what I will do: I will tear down my barns and build larger ones, and there I will store all my grain and my goods. And I will say to my soul, \"Soul, you have many goods laid up for many years to come; take your ease, eat, drink and be merry.\" \"But God said to him, 'You fool! This very night your soul is required of you; and now who will own what you have prepared?'…\"So is the man who stores up treasure for himself, and is not rich toward God.\"\"For what does it profit a man to gain the whole world, and forfeit his soul? For what will a man give in exchange for his soul?\" ",
            "date": "Answered March 27, 2015",
            "views": "439",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ilana Halupovich",
                    "user_href": "/profile/Ilana-Halupovich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter J Beierle",
                "href": "/profile/Peter-J-Beierle"
            },
            "answer_text": "Its not just how much is in your bank account it is also the rate that money is flowing in that matters at least to me.I would say that it depends on your lifestyle and your desires.When I was a teenager (about 10 years ago) I was content with about 5 thousand dollars in my bank account, while making about 300 dollars a month (not sure if that is comfortable for teens nowadays)currenltly I make less than minimum wage (I work about 70 hours a week, but my salary is a dollar above minimum wage only for 20 hours a week and I don't get overtime, so I am considered below the poverty line) and I don't get any welfare checks or things like that.But since I am in a very chep state in the US, I am living quite comfortably with my current lifestyle living with a roomate who pays for half of the rent (the total cost is only $500/month, I can afford whatever I want to buy (and I would say I'm also pretty greedy)...That is, until I want a kid, then I will be screwed ",
            "date": "Updated May 6, 2015",
            "views": "467",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ilana Halupovich",
                    "user_href": "/profile/Ilana-Halupovich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Blumenkranz",
                "href": "/profile/Steve-Blumenkranz"
            },
            "answer_text": "I will assume you mean in the subjective sense. Then it is when you run out of ideas of what you want to do with it for yourself, for philanthropic good or for research on something that seems worthwhile. Hopefully you will discover the satisfactions of the latter 2 before you find out the limits of satisfaction in spending it on yourself. ",
            "date": "Answered March 27, 2015",
            "views": "229",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tomas Yono",
                "href": "/profile/Tomas-Yono"
            },
            "answer_text": "When you develop some personal effectivity level that you can restart earning from scratch anytime and achieve enoug money fast enough. There were some studies, that optimum amount of money (happy number) for average person is approximately $2900 a month. If he earns much less or much more - he gets trouble. ",
            "date": "Updated March 29, 2015",
            "views": "553",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jay Mathews",
                    "user_href": "/profile/Jay-Mathews-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ilana Halupovich",
                "href": "/profile/Ilana-Halupovich"
            },
            "answer_text": "Money becomes irrelevant when you are on the deserted island by yourself. Humans invented money to exchange valuables. It's either that or gun. ",
            "date": "Answered March 27, 2015",
            "views": "104",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bennett W. Nelson",
                    "user_href": "/profile/Bennett-W-Nelson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Scott Young",
                "href": "/profile/Scott-Young-5"
            },
            "answer_text": "Greed is not satisfied, ever.  If you are truly greedy, when you have $100,000 you will want $200,000.  When you have $1,000,000 you will want $2,000,000.   Figure out what you really need and control your greed - don't let it control you. ",
            "date": "Answered March 26, 2015",
            "views": "236",
            "upvotes": "0"
        }
    ]
}