{
    "title": "Atheists, what do you think of this argument against an infinite regress? - Quora",
    "tags": [
        "Atheists",
        "Arguments and Argumentation",
        "Atheism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Luke Anderson",
                "href": "/profile/Luke-Anderson-87"
            },
            "answer_text": "Ugh I hate those empty headed \"arguments\". Not only a waste of time to watch, but that nice-seeming, poor young man is wasting his brain, investing in that claptrap. First, his primary argument is, \"no you can't have that\". He just says it so therefore it's true? There's a difference between saying something and showing something. And like ALL creationists he's doing a lot of saying and zero showing. Second, philosophical and logical arguments never prove anything. Sure they are useful for thinking about a problem, or for designing an experiment. But as evidence? Not at all. So what experiment is that fellow proposing? How is he going to get evidence to demonstrate his thesis? What, he isn't? Then what's your point?? But that's the entire creationist MO: silly word games dressed up in cartoonish, sciency words. That's it. No research, no data, no collaboration, no evidence, no publication - just silly word games. Really, if I wasn't an atheist already but had a minimum knowledge of science and logic, I'd be going \"so THIS is their best argument??\" and likely become an atheist soon after watching. ",
            "date": "Answered June 8, 2020",
            "views": "56",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richard Reynolds",
                    "user_href": "/profile/Richard-Reynolds-73"
                },
                {
                    "user_id": "Rich Clark",
                    "user_href": "/profile/Rich-Clark-57"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frank Langben",
                "href": "/profile/Frank-Langben-1"
            },
            "answer_text": "I really don’t see any connection to atheism with the statement that every belief is supported by another belief, but not to infinity, because at some point you will reach a self-evident statement (hopefully). Believers sometimes argue the “cosmological argument,” that everything has a cause, “therefore God.” If that is true, then every cause has a cause, to infinity — my choice of sock color having been determined from the formation of the Earth. Believers are thus arguing that criminals are not responsible for their acts, because their acts were caused by something else beyond their control. Atheism is simply the lack of belief in God. There are no beliefs involved. ",
            "date": "Answered June 8, 2020",
            "views": "86",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rich Clark",
                    "user_href": "/profile/Rich-Clark-57"
                },
                {
                    "user_id": "Shelli King",
                    "user_href": "/profile/Shelli-King"
                },
                {
                    "user_id": "Jacque Scott",
                    "user_href": "/profile/Jacque-Scott"
                },
                {
                    "user_id": "Russell Child",
                    "user_href": "/profile/Russell-Child-1"
                },
                {
                    "user_id": "Dean Jay Smith",
                    "user_href": "/profile/Dean-Jay-Smith"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Thatcher",
                "href": "/profile/Bob-Thatcher-2"
            },
            "answer_text": "that was a fascinating line of thought. not normally what we’re referring to when we say infinite regress. normally we’re talking about an infinite regress of and what caused that going back before the big bang/god. he hasnt demonstrated the existence of an infinite regress of evident claims. he hasnt discussed axioms. or cognito ergo sum (i think therefore i am/because i know that something has to be happening when i’m thinking the entity (I) experiencing the thoughts exists) ",
            "date": "Answered June 9, 2020",
            "views": "9",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Dohan",
                "href": "/profile/John-Dohan-1"
            },
            "answer_text": "Q: Atheists, what do you think of this argument against an infinite regress? YouTube / watch?v=N6UW3Imn5b8 Well, yeah, logical systems are grounded in necessary truths, axioms, not in an infinite chain of conclusions. Just like with the cosmos, where we have to accept a quantum mechanical ground state as the basis for our universe. But I’m not sure why this is addressed to atheists. Atheism doesn’t require belief in infinite regresses. ",
            "date": "Answered June 9, 2020",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bruce Doran",
                "href": "/profile/Bruce-Doran-1"
            },
            "answer_text": "I think it’s a good argument. But atheists don’t argue for infinite regress. It is generally agreed that the universe started only a few billion years ago. Actually, by postulating that God is eternal, theists claim for God precisely the truth value that the presenter of your talk demonstrates must be held by any chain of infinite regress; namely, zero. ",
            "date": "Answered June 9, 2020",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Howard Aitchison",
                "href": "/profile/Howard-Aitchison"
            },
            "answer_text": "Atheists, what do you think of this argument against an infinite regress? Prove to me that there is any self-evident truth. Theism bases all of its conclusions on, Premise A is true because God. It then completely fails to understand that what it is really saying (to use the language of the video) is that Premise A is only true if God exists. Theism then fails to prove that God exists. Atheists (in general) do not claim access to ultimate truths. ",
            "date": "Answered June 8, 2020",
            "views": "55",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jacque Scott",
                    "user_href": "/profile/Jacque-Scott"
                },
                {
                    "user_id": "Dean Jay Smith",
                    "user_href": "/profile/Dean-Jay-Smith"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bernard Peter Gore",
                "href": "/profile/Bernard-Peter-Gore"
            },
            "answer_text": "It’s poorly expressed and a dumbed-down explanation, as it only covers the concept of absolute truth, simple logic, which there is no reason to think is relevant to real life, just an artificial construct of logic. And of course it has NO RELEVANCE to atheism. Nothing in atheism relies on an infinite regress any more than all of existence does. ",
            "date": "Answered June 8, 2020",
            "views": "56",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richard Reynolds",
                    "user_href": "/profile/Richard-Reynolds-73"
                },
                {
                    "user_id": "Rich Clark",
                    "user_href": "/profile/Rich-Clark-57"
                },
                {
                    "user_id": "Shelli King",
                    "user_href": "/profile/Shelli-King"
                }
            ]
        },
        {
            "author_info": {
                "name": "Colin Wright",
                "href": "/profile/Colin-Wright-58"
            },
            "answer_text": "I cant even be bothered to watch that I'm afraid I've seen dozens of theists argue against it. There is always a ton of waffle that amounts to because I want to terminate the regress there and not with the universe. ",
            "date": "Answered June 8, 2020",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shelli King",
                    "user_href": "/profile/Shelli-King"
                }
            ]
        },
        {
            "author_info": {
                "name": "Seth Minkoff",
                "href": "/profile/Seth-Minkoff"
            },
            "answer_text": "Atheists, what do you think of this argument against an infinite regress? The speaker details the impossibility, familiar to philosophers and logicians, of proving any conclusion by means of appeal to an infinite regress. But what of it? Anyone who understands the rudiments of logic, be she atheist or not, is aware of this problem. ",
            "date": "Answered June 8, 2020",
            "views": "48",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dean Jay Smith",
                    "user_href": "/profile/Dean-Jay-Smith"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Edwards",
                "href": "/profile/John-Edwards-784"
            },
            "answer_text": "I think he was arguing for an infinite regress. This would mean that existence has always existed. I’m an atheist and I agree with this, albeit not because I’m an atheist. ",
            "date": "Answered June 8, 2020",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shelli King",
                    "user_href": "/profile/Shelli-King"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Kelly",
                "href": "/profile/Paul-Kelly-479"
            },
            "answer_text": "As you’ve asked this question of atheists I will assume that you have somehow interpreted this video as logical proof of your God. Sorry it doesn’t. all it says is that there must be a self evident point in the chain of logic, a known fact to base your claim on. There is no evidence for your God or any other. ",
            "date": "Answered June 9, 2020",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rasmus Wagner",
                "href": "/profile/Rasmus-Wagner-1"
            },
            "answer_text": "I think that any argument made in good faith is better made in writing. Writing is the medium for cogent arguments. Video is for obfuscation and emotional manipulation. ",
            "date": "Answered June 10, 2020",
            "views": "13",
            "upvotes": "0"
        }
    ]
}