{
    "title": "Can we live without making perceptions? - Quora",
    "tags": [
        "Perception",
        "Neuroscience",
        "Psychology",
        "Psychology of Everyday Life",
        "Philosophy of Everyday Life",
        "Human Behavior",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aniket",
                "href": "/profile/Aniket-435"
            },
            "answer_text": "I was recently reading Mark Manson’s book ‘Everything is Fu*ked’. In initial chapters, he recites the story of Elliot. He is a successful man, having a good family and a nice job. But one day he gets to know that he is having a brain tumour. Doctors removed his tumour through surgeries. But after the surgeries, Elliot was not the old Elliot. He starts acting weird. He is still the same person with the same intelligence, but he finds it difficult to make proper decisions. Like he decides to buy stationary instead of attending an important meeting. The same is reflected in his personal life. His wife divorces him due to his poor decision making and all. He becomes no-one, literally ‘no-one’. Doctors and psychologists find it fascinating. This guy is having the same intellect but why is he acting so weird. They did many experiments and understood that Elliot does not have any emotions any more. The surgery went wrong and Elliot stopped feeling any emotions due to which he is not able to make proper decisions.  Emotions and perceptions are not just feelings and understanding which are useless. They help us in making decisions, they help us understand situations, they help us understand how other people think, they help us decided what is important and what is not. So, to answer your question, I can say, ‘Yes we can live without perceptions, but cannot really live like a human’. ",
            "date": "Answered September 14, 2020",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Miteiya Boddhisatva",
                "href": "/profile/Miteiya-Boddhisatva"
            },
            "answer_text": "That would be a dream come true. But i think you are talking about being judgmental and not a perception creator. Being Judgmental is slightly different. When you judge someone you ignore his potential to improve or perform. But you label him or her as per the past. ",
            "date": "Answered June 19, 2020",
            "views": "99",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sp Pal",
                    "user_href": "/profile/Sp-Pal-14"
                },
                {
                    "user_id": "Chetan Bhai",
                    "user_href": "/profile/Chetan-Bhai-10"
                },
                {
                    "user_id": "Rup Patel",
                    "user_href": "/profile/Rup-Patel-4"
                },
                {
                    "user_id": "Janvi Patel",
                    "user_href": "/profile/Janvi-Patel-437"
                },
                {
                    "user_id": "Devu Patel",
                    "user_href": "/profile/Devu-Patel-21"
                },
                {
                    "user_id": "Sanjay Patel",
                    "user_href": "/profile/Sanjay-Patel-2640"
                },
                {
                    "user_id": "Naresh Patel",
                    "user_href": "/profile/Naresh-Patel-701"
                },
                {
                    "user_id": "Krish Patel",
                    "user_href": "/profile/Krish-Patel-726"
                },
                {
                    "user_id": "Raj Patel",
                    "user_href": "/profile/Raj-Patel-3596"
                },
                {
                    "user_id": "Sanaja Kumar",
                    "user_href": "/profile/Sanaja-Kumar"
                },
                {
                    "user_id": "Ananya Balakrishnan",
                    "user_href": "/profile/Ananya-Balakrishnan-2"
                }
            ]
        }
    ]
}