{
    "title": "Can the dead answer your questions? - Quora",
    "tags": [
        "Questions and Answers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Scott Korek",
                "href": "/profile/Scott-Korek"
            },
            "answer_text": "I know from experience, the answer is an unequivocal ‘yes’; though that’s not a good thing. My Mom unwittingly bought me a Ouija board when I was around five years old. My brother and myself asked it many questions and I swear the planchette moved by itself and answered the questions. That was a huge mistake as for the next ten years I was tormented and our house was haunted. I would hear knocking on the walls and actually saw items fall off of my dresser. The activity seemed to be attached to my room where the Ouija board was used. I am not certain it was a dead person but rather a demon posing as a person. Had our house, myself and especially my room blessed by a man of God, and the activity disappeared. I believe this is a cautionary tale to never summon the dead as you will likely regret it. ",
            "date": "Answered August 1, 2017",
            "views": "181",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Clarice Anderson",
                "href": "/profile/Clarice-Anderson"
            },
            "answer_text": "It's not so much as to whether or not they are capable of answering questions, but how can you be sure that you are getting the answer from the person/spirit that you want it from? According to what I've read in the Bible, spirits or demons can present themselves as different people, giving you false advice. That is why it is said that you should “not put your faith in noble men”. Now whether or not that's true, is a topic for another day. ",
            "date": "Answered August 1, 2017",
            "views": "151",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ted Jones",
                "href": "/profile/Ted-Jones-20"
            },
            "answer_text": "You might easily test your hypothesis by visiting a near by grave yard since they are pretentious, and directing your question to one or more of the interred. Or contact a local mortuary and submit your inquiry to one or more of those employed by the mortuary. I suspect by you doing either of those suggestions you will be able to obtain a reasonable answer. ",
            "date": "Answered August 1, 2017",
            "views": "62",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Woodhams",
                "href": "/profile/Michael-Woodhams-1"
            },
            "answer_text": "NO A particular dead person like a relative NO A very great friend NO Somebody in love with you NO Are you starting to see a pattern? ",
            "date": "Answered August 1, 2017",
            "views": "20",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Syed Umar",
                "href": "/profile/Syed-Umar-21"
            },
            "answer_text": "No because they cannot login and sigh…FORGOT PASSWORD..hehe  ",
            "date": "Answered August 1, 2017",
            "views": "62",
            "upvotes": "0"
        }
    ]
}