{
    "title": "Can the Bible or the Quran be supported by science? - Quora",
    "tags": [
        "The Quran",
        "The Bible",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Veysel Karani Ece",
                "href": "/profile/Veysel-Karani-Ece"
            },
            "answer_text": "When Does Science Interfere in the Field of Religion? In the quest of religion for what is good, true, nice and real, the point where it rejects the methodology and concepts of science became the area of conflict. In this age, people try to find answers to all kinds of pragmatic questions that are asked by preserving intellectual integrity. Questions like the following have started to be on the agenda more frequently compared to the past: “I want to know the existence of God through evidence. Why do I have to worship? Is there life after death? What are the attributes of God?” In the previous centuries, these questions originated from ignorance; today they are asked in the name of positive science. If today’s belief systems accept the existence of God as undebatable and the necessity of worship unquestionable, they can be rejected by positive science. If a clergyman accepts the data of religion to be tested through the methodology of positive science and is ready to change his views that are refuted, he may be widely accepted by people. If a person who deals with positive science applies scientific methods on religious values, accepts the proven knowledge and adopts the most reasonable explanation, he may prevent the border violation between religion and science. If science, which is interested in how the universe was created, and religion, which answers why the universe was created, stay in those boundaries, conflict between them will be prevented and they will help each other to complement each other. For instance, science is interested in what the codes in DNA are like and what is written in them. Religion examines why the codes in DNA were created. If science says, “codes came together without any aim”, it will have transgressed the boundaries. If religion says, “it is unnecessary to deal with the codes in DNA”, it will have interfered in the field of science. To oppose dealing with the codes in DNA will make religion move away from science. When science remains neutral regarding the issues that it cannot prove, it will not harm the religious viewpoint. However, to defend unproven knowledge may transform science into religion. There are different numbers of religions and different numbers of science methodologies in the world. This mental discussion will cause the agreement on the strongest thoughts. Thus, positive science can be prevented from becoming the world religion. Science has not been able to form its own ethical system. When it changes the system that it has borrowed from religion, he will have used its own data against humanity. For instance, to intervene in the sequences in the nucleus of atom and to produce energy was an achievement of science. However, when the ethical standard corrupted, to produce atomic bomb harmed humanity. The same danger threatens DNA today. Radical changes are being made by intervening the DNA chain today; and production is increased this way. If they change the human gene, creatures between humans and animals can appear. Or it is possible to produce creatures the resemble man but acts like a monkey by changing the money gene. Those who oppose evolution radically should not do it on behalf of religion because it has been observed that DNA can be changed. First man was created out of soil. DNA is the array of inorganic and organic materials that are present in soil. It is not contrary to science to state in the Quran that Adam was created out of soil in order to discriminate man from radiant beings. Allah’s absolute power is not in need of the DNA of the monkey. If it is possible to transform human DNA to monkey DNA in the laboratory, how will religion interpret it? The view of religion on developments will be as follows: innovations should not be used to harm humanity; and definitions should be made correctly. (For instance, monkeys in the form of human beings should not be called humans…) If religion and positive science approach evolution, which is a controversial issue, like this, the two disciplines will complement each other. Positive science is pragmatic Positive science produces hypotheses related to natural world and formulates them. Scientific answers cannot be obtained from the questions that cannot be refuted. Science does not reject supernatural causes completely but it thinks that these causes are inefficient. Positive science measures the paranormal and abnormal phenomena, mysticism and abstract reality through the high standards of science. The high standards of science stopped reducing reality to material and concrete reality in recent years. Abstract reality can be likened to art reality. One cannot act with the exactness of the material world there. Even if what is produced is objective, its standard is virtual and indicates a scientific reality. This reductive view of materialist approach, which says, “I do not believe in the things that I do not see” and reduces the mind to visuality, is in the waste bin of history now. Religion Based on Evidence Positive science cannot act conceitedly and superiorly in the presence of the realities in the universe. It is not dominant over nature. The claim to be dominant over nature is the superiority delusion. For science, it is a sign of world theism in the disguise of science not to be able to define its place in the world correctly. Science does not act depending on authority or a supernatural power. Its reference point is evidence. However, supernatural reality is always present among the alternatives as a scientific phenomenon. A scientific method that does not accept religious views as a phenomenon is a prejudiced method. If religion objects to its knowledge being questioned, it will come into conflict with the mind and science. The religions that do not accept their teachings to be questioned like the trinity belief of Christianity or the spirit belief of Buddhism are bound to be viewed with doubt. The belief systems that avoid being questioned cannot survive. The relationship between religion and science that will maintain their boundaries will illuminate the future of humanity. Science needs the property of religion that adds meaning to life, its power of consoling and its capacity to explain what happens after death. A religion that guides people with true teachings will not avoid being tested by positive science. On the other hand, the possibility that the realities that will occur will restrict the freedom area of science will not bother real scientists. In fact, such a view will bring about the coordination of religion and positive science. If the aim is to attain the truth and universal realities, every individual that has an objective viewpoint will approve that this is the easiest, most efficient and ideal method. Source: SCIENCE, RELIGION AND BELIEF SYSTEMS ",
            "date": "Answered November 3, 2017",
            "views": "612",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Veysel Baba",
                    "user_href": "/profile/Veysel-Baba"
                },
                {
                    "user_id": "Veysel Karani Ece",
                    "user_href": "/profile/Veysel-Karani-Ece-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Triez",
                "href": "/profile/Bob-Triez"
            },
            "answer_text": "There is absolutely no scientific reason to reject the Bible. None at all. People reject it because they don't like what it says about them and it requires some lifestyle changes if you accept its truth. But there is nothing unscientific about the Bible. And it certainly is more accurate than what the religion of evolution wants you to believe. That life just appeared one day after it rained on the rocks for millions of years? There is no proof of that at all. It is a belief. It takes faith to believe that happened because no one has seen it happen. Accepting that abiogenesis is impossible is a fundamental tenent in biology. Life can not come from non-life; rather life must come from life. Yet somehow you make an exception because it was supposedly billions of years ago? Why could rocks do something back then that they can't do now? It takes faith to believe one species came from a different species. We have never seen that happen. A cow gives birth to a cow. A chicken reproduces other chickens. An oak tree produces more oak trees. We have never seen a banana produce a hampster. That concept takes faith to believe in. An evolutionist’s faith is given the term “science” however and a Christian's faith is termed “religion.” But fundamentally, they are the same…they are both a series of beliefs that require a belief and a faith that it happened. Evolution does not fit the definition of “science.” It is not observable, it is not testable and it is not repeatable. Evolutionists put faith in their text books, a Christian puts faith in the Bible. When it all boils down to it, it all comes back to faith. Believing in something that you cannot see for yourself. Faith that someone else got it right. Evolution, the big bang and anthing else that rejects God as the Creator is a belief, and you are free to believe anything you want, but don't go calling it science. You may want to think it's science so you have some type of “proof” over creation, but that doesn't make it so. You can no more prove that we all came from a big bang 15 billion years ago without referencing someone elses work than I can prove creation without referencing God and the Bible. Yet I'm called a fool for trusting in a book when you do the exact same thing. You have your faith, I have mine. So start calling it what it really is- a religion. If someone wants a debate, and I can't use the Bible as my proof, then you must do the same. You can only use proof that you personally discovered, not something someone else claims and you simply were taught it or read about it. No riding the coattails of someone else. If I am expected to prove creation is true with zero references, you are to be held to the same thing and must prove evolution is true with zero references. What’s good for one is good for both. All this being said, all this has been beaten to death already on Quora and no one is ever willing to take on a debate without them citing someone else's work and proving their belief solely on what they discovered on their own. It is clear where I stand and I know where the atheists stand. So I'm not going to humour anybody by replying to any comments that you make. If you want to make a snarky comment about how stupid this Christian is, you go for it. But you will not get a reply from me and you'll be wasting your time if you try. Until you have your own evidence you found completely on your own to support your belief in evolution, there is nothing more to be said unless I am allowed to use the Bible as proof as well…it is only fair. And FWIW - no one has ever taken me up on this. I am always forced to be at a disadvantage so the evolutionists can “win.” ",
            "date": "Answered November 2, 2017",
            "views": "68",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Toni Armstrong",
                "href": "/profile/Toni-Armstrong-2"
            },
            "answer_text": "The Bible isn't a science book. However through out the scriptures God revealed certain facts that can now be proven scientifically correct The Bible specifies the perfect dimensions for a stable water vessel (Genesis 6:15). Ship builders today are well aware that the ideal dimension for ship stability is a length six times that of the width. Keep in mind, God told Noah the ideal dimensions for the ark 4,500 years ago When dealing with disease, clothes and body should be washed under running water (Leviticus 15:13). For centuries people naively washed in standing water. Today we recognize the need to wash away germs with fresh wate Sanitation industry birthed (Deuteronomy 23:12-13). Some 3,500 years ago God commanded His people to have a place outside the camp where they could relieve themselves. They were to each carry a shovel so that they could dig a hole (latrine) and cover their waste. Up until World War I, more soldiers died from disease than war because they did not isolate human waste. Oceans contain springs (Job 38:16). The ocean is very deep. Almost all the ocean floor is in total darkness and the pressure there is enormous. It would have been impossible for Job to have explored the \"springs of the sea.\" Until recently, it was thought that oceans were fed only by rivers and rain. Yet in the 1970s, with the help of deep diving research submarines that were constructed to withstand 6,000 pounds-per-square-inch pressure, oceanographers discovered springs on the ocean floors! There are mountains on the bottom of the ocean floor (Jonah 2:5-6). Only in the last century have we discovered that there are towering mountains and deep trenches in the depths of the sea Joy and gladness understood (Acts 14:17). Evolution cannot explain emotions. Matter and energy do not feel. Scripture explains that God places gladness in our hearts (Psalm 4:7), and ultimate joy is found only in our Creator’s presence – “in Your presence is fullness of joy” (Psalm 16:11). Blood is the source of life and health (Leviticus 17:11; 14). Up until 120 years ago, sick people were “bled” and many died as a result (e.g. George Washington). Today we know that healthy blood is necessary to bring life-giving nutrients to every cell in the body. God declared that “the life of the flesh is in the blood” long before science understood its function. The Bible states that God created life according to kinds (Genesis 1:24). The fact that God distinguishes kinds, agrees with what scientists observe – namely that there are horizontal genetic boundaries beyond which life cannot vary. Life produces after its own kind. Dogs produce dogs, cats produce cats, roses produce roses. Never have we witnessed one kind changing into another kind as evolution supposes. There are truly natural limits to biological change. Noble behavior understood (John 15:13; Romans 5:7-8). The Bible and history reveal that countless people have endangered or even sacrificed their lives for another. This reality is completely at odds with Darwin’s theory of the survival of the fittest. Chicken or egg dilemma solved (Genesis 1:20-22). Which came first, the chicken or the egg? This question has plagued philosophers for centuries. The Bible states that God created birds with the ability to reproduce after their kind. Therefore the chicken was created first with the ability to make eggs! Yet, evolution has no solution for this dilemma. Which came first, proteins or DNA (Revelation 4:11)? For evolutionists, the chicken or egg dilemma goes even deeper. Chickens consist of proteins. The code for each protein is contained in the DNA/RNA system. However, proteins are required in order to manufacture DNA. So which came first: proteins or DNA? The ONLY explanation is that they were created together. Our bodies are made from the dust of the ground (Genesis 2:7; 3:19). Scientists have discovered that the human body is comprised of some 28 base and trace elements – all of which are found in the earth. The First Law of Thermodynamics established (Genesis 2:1-2). The First Law states that the total quantity of energy and matter in the universe is a constant. One form of energy or matter may be converted into another, but the total quantity always remains the same. Therefore the creation is finished, exactly as God said way back in Genesis. The first three verses of Genesis accurately express all known aspects of the creation (Genesis 1:1-3). Science expresses the universe in terms of: time, space, matter, and energy. In Genesis chapter one we read: “In the beginning (time) God created the heavens (space) and the earth (matter)…Then God said, “Let there be light (energy).” No other creation account agrees with the observable evidence. The universe had a beginning (Genesis 1:1; Hebrews 1:10-12). Starting with the studies of Albert Einstein in the early 1900s and continuing today, science has confirmed the biblical view that the universe had a beginning. When the Bible was written most people believed the universe was eternal. Science has proven them wrong, but the Bible correct. The earth is a sphere (Isaiah 40:22). At a time when many thought the earth was flat, the Bible told us that the earth is spherical. Scripture assumes a revolving (spherical) earth (Luke 17:34-36). Jesus said that at His return some would be asleep at night while others would be working at day time activities in the field. This is a clear indication of a revolving earth, with day and night occurring simultaneously. Origin of the rainbow explained (Genesis 9:13-16). Prior to the Flood there was a different environment on the earth (Genesis 2:5-6). After the Flood, God set His rainbow “in the cloud” as a sign that He would never again judge the earth by water. Meteorologists now understand that a rainbow is formed when the sun shines through water droplets – which act as a prism – separating white light into its color spectrum. Light can be divided (Job 38:24). Sir Isaac Newton studied light and discovered that white light is made of seven colors, which can be “parted” and then recombined. Science confirmed this four centuries ago – God declared this four millennia ago! Ocean currents anticipated (Psalm 8:8). Three thousand years ago the Bible described the “paths of the seas.” In the 19th century Matthew Maury – the father of oceanography – after reading Psalm 8, researched and discovered ocean currents that follow specific paths through the seas! Utilizing Maury’s data, marine navigators have since reduced by many days the time required to traverse the seas. Sexual promiscuity is dangerous to your health (1 Corinthians 6:18; Romans 1:27). The Bible warns that “he who commits sexual immorality sins against his own body,” and that those who commit homosexual sin would “receive in themselves” the penalty of their error. Much data now confirms that any sexual relationship outside of holy matrimony is unsafe. Reproduction explained (Genesis 1:27-28; 2:24; Mark 10:6-8). While evolution has no mechanism to explain how male and female reproductive organs evolved at the same time, the Bible says that from the beginning God made them male and female in order to propagate the human race and animal kinds. Incalculable number of stars (Jeremiah 33:22). At a time when less than 5,000 stars were visible to the human eye, God stated that the stars of heaven were innumerable. Not until the 17th century did Galileo glimpse the immensity of our universe with his new telescope. Today, astronomers estimate that there are ten thousand billion trillion stars – that’s a 1 followed by 25 zeros! Yet, as the Bible states, scientists admit this number may be woefully inadequate. The number of stars, though vast, are finite (Isaiah 40:26). Although man is unable to calculate the exact number of stars, we now know their number is finite. Of course God knew this all along – “He counts the number of the stars; He calls them all by name” (Psalm 147:4). What an awesome God The Bible compares the number of stars with the number of grains of sand on the seashore (Genesis 22:17; Hebrews 11:12). Amazingly, gross estimates of the number of sand grains are comparable to the estimated number of stars in the universe. Rejecting the Creator results in moral depravity (Romans 1:20-32). The Bible warns that when mankind rejects the overwhelming evidence for a Creator, lawlessness will result. Since the theory of evolution has swept the globe, abortion, pornography, genocide, etc., have all risen sharply. The fact that God once flooded the earth (the Noahic Flood) would be denied (2 Peter 3:5-6). There is a mass of fossil evidence to prove this fact, yet it is flatly ignored by most of the scientific world because it was God’s judgment on man’s wickedness. Vast fossil deposits anticipated (Genesis 7). When plants and animals die they decompose rapidly. Yet billions of life forms around the globe have been preserved as fossils. Geologists now know that fossils only form if there is rapid deposition of life buried away from scavengers and bacteria. This agrees exactly with what the Bible says occurred during the global Flood. The continents were created as one large land mass (Genesis 1:9-10). Many geologists agree there is strong evidence that the earth was originally one super continent – just as the Bible said way back in Genesis. Continental drift inferred (Genesis 7:11). Today the study of the ocean floor indicates that the landmasses have been ripped apart. Scripture states that during the global Flood the “fountains of the great deep were broken up.” This cataclysmic event apparently resulted in the continental plates breaking and shifting. Ice Age inferred (Job 38:29-30). Prior to the global Flood the earth was apparently subtropical. However shortly after the Flood, the Bible mentions ice often – “By the breath of God ice is given, and the broad waters are frozen” (Job 37:10). Evidently the Ice Age occurred in the centuries following the Flood. Life begins at fertilization (Jeremiah 1:5). God declares that He knew us before we were born. The biblical penalty for murdering an unborn child was death (Exodus 21:22-23). Today, it is an irrefutable biological fact that the fertilized egg is truly an entire human being. Nothing will be added to the first cell except nutrition and oxygen. God fashions and knits us together in the womb (Job 10:8-12; 31:15). Science was ignorant concerning embryonic development until recently. Yet many centuries ago, the Bible accurately described God making us an “intricate unity” in the womb. DNA anticipated (Psalm 139:13-16). During the 1950s, Watson and Crick discovered the genetic blueprint for life. Three thousand years ago the Bible seems to reference this written digital code in Psalm 139 – “Thine eyes did see my substance, yet being unperfect [unformed]; and in Thy book all my members were written, which in continuance were fashioned, when as yet there was none of them.” God has created all mankind from one blood (Acts 17:26; Genesis 5). Today researchers have discovered that we have all descended from one gene pool. For example, a 1995 study of a section of Y chromosomes from 38 men from different ethnic groups around the world was consistent with the biblical teaching that we all come from one man (Adam) Origin of the major language groups explained (Genesis 11). After the rebellion at Babel, God scattered the people by confounding the one language into many languages. Evolution teaches that we all evolved from a common ancestor, yet offers no mechanism to explain the origin of the thousands of diverse languages in existence today. Origin of the different “races” explained (Genesis 11). As Noah’s descendants migrated around the world after Babel, each language group developed distinct features based on environment and genetic variation. Those with a genetic makeup suitable to their new environment survived to reproduce. Over time, certain traits (such as dark skin color for those closer to the equator) dominated. Genesis alone offers a reasonable answer to the origin of the races and languages. God has given us the leaves of the trees as medicine (Ezekiel 47:12; Revelation 22:2). Ancient cultures utilized many herbal remedies. Today, modern medicine has rediscovered what the Bible has said all along – there are healing compounds found in plants. Healthy dietary laws (Leviticus 11:9-12). Scripture states that we should avoid those sea creatures which do not have fins or scales. We now know that bottom-feeders (those with no scales or fins) tend to consume waste and are likely to carry disease. The Bible warns against eating birds of prey (Leviticus 11:13-19). Scientists now recognize that those birds which eat carrion (putrefying flesh), often spread disease. Avoid swine (Deuteronomy 14:8). Not so long ago, science learned that eating undercooked pork causes an infection of parasites called trichinosis. Now consider this: the Bible forbid the eating of swine more than 3,000 years before we learned how to cook pork safely. Radical environmentalism foreseen (Romans 1:25). Two thousand years ago, God’s Word stated that many would worship and serve creation rather than the Creator. Today, nature is revered as “Mother” and naturalism is enshrined. Black holes and dark matter anticipated (Matthew 25:30; Jude 1:13; Isaiah 50:3). Cosmologists now speculate that over 98% of the known universe is comprised of dark matter, with dark energy and black holes. A black hole’s gravitational field is so strong that nothing, not even light, escapes. Beyond the expanding universe there is no measured radiation and therefore only outer darkness exists. These theories paint a seemingly accurate description of what the Bible calls “outer darkness” or “the blackness of darkness forever.” The Second Law of Thermodynamics (Entropy) explained (Psalm 102:25-26). This law states that everything in the universe is running down, deteriorating, constantly becoming less and less orderly. Entropy (disorder) entered when mankind rebelled against God – resulting in the curse (Genesis 3:17; Romans 8:20-22). Historically most people believed the universe was unchangeable. Yet modern science verifies that the universe is “grow(ing) old like a garment” (Hebrews 1:11). Evolution directly contradicts this law. Incest laws established (Leviticus 18:6). To marry near of kin in the ancient world was common. Yet, beginning about 1500 B.C., God forbid this practice. The reason is simple – the genetic mutations (resulting from the curse) had a cumulative effect. Though Cain could safely marry his sister because the genetic pool was still relatively pure at that time, by Moses’ day the genetic errors had swelled. Today, geneticists confirm that the risk of passing on a genetic abnormality to your child is much greater if you marry a close relative because relatives are more likely to carry the same defective gene. If they procreate, their offspring are more apt to have this defect expressed. Genetic mixing of different seeds forbidden (Leviticus 19:19; Deuteronomy 22:9). The Bible warns against mixing seeds – as this will result in an inferior or dangerous crop. There is now growing evidence that unnatural, genetically engineered crops may be harmful. Hydrological cycle described (Ecclesiastes 1:7; Jeremiah 10:13; Amos 9:6). Four thousand years ago the Bible declared that God “draws up drops of water, which distill as rain from the mist, which the clouds drop down and pour abundantly on man” (Job 36:27-28). The ancients observed mighty rivers flowing into the ocean, but they could not conceive why the sea level never rose. Though they observed rainfall, they had only quaint theories as to its origin. Meteorologists now understand that the hydrological cycle consists of evaporation, atmospheric transportation, distillation, and precipitation. The sun goes in a circuit (Psalm 19:6). Some scientists scoffed at this verse thinking that it taught geocentricity – the theory that the sun revolves around the earth. They insisted the sun was stationary. However, we now know that the sun is traveling through space at approximately 600,000 miles per hour. It is literally moving through space in a huge circuit – just as the Bible stated 3,000 years ago! Circumcision on the eighth day is ideal (Genesis 17:12; Leviticus 12:3; Luke 1:59). Medical science has discovered that the blood clotting chemical prothrombin peaks in a newborn on the eighth day. This is therefore the safest day to circumcise a baby. How did Moses know? God has given us just the right amount of water to sustain life (Isaiah 40:12). We now recognize that if there was significantly more or less water, the earth would not support life as we know it. The earth was designed for biological life (Isaiah 45:18). Scientists have discovered that the most fundamental characteristics of our earth and cosmos are so finely tuned that if just one of them were even slightly different, life as we know it couldn't exist. This is called the Anthropic Principle and it agrees with the Bible which states that God formed the earth to be inhabited. The universe is expanding (Job 9:8; Isaiah 42:5; Jeremiah 51:15; Zechariah 12:1). Repeatedly God declares that He stretches out the heavens. During the early 20th century, most scientists (including Einstein) believed the universe was static. Others believed it should have collapsed due to gravity. Then in 1929, astronomer Edwin Hubble showed that distant galaxies were receding from the earth, and the further away they were, the faster they were moving. This discovery revolutionized the field of astronomy. Eisntein admitted his mistake, and today most astronomers agree with what the Creator told us millennia ago – the universe is expanding! Law of Biogenesis explained (Genesis 1). Scientists observe that life only comes from existing life. This law has never been violated under observation or experimentation (as evolution imagines). Therefore life, God’s life, created all life. Animal and plant extinction explained (Jeremiah 12:4; Hosea 4:3). According to evolution, occasionally we should witness a new kind springing into existence. Yet, this has never been observed. On the contrary, as Scripture explains, since the curse on all creation, we observe death and extinction (Romans 8:20-22). Light travels in a path (Job 38:19). Light is said to have a “way” [Hebrew: derek, literally a traveled path or road]. Until the 17th century it was believed that light was transmitted instantaneously. We now know that light is a form of energy that travels at ~186,000 miles per second in a straight line. Indeed, there is a “way” of light. Air has weight (Job 28:25). It was once thought that air was weightless. Yet 4,000 years ago Job declared that God established “a weight for the wind.” In recent years, meteorologists have calculated that the average thunderstorm holds thousands of tons of rain. To carry this load, air must have mass. Jet stream anticipated (Ecclesiastes 1:6). At a time when it was thought that winds blew straight, the Bible declares “The wind goes toward the south, and turns around to the north; The wind whirls about continually, and comes again on its circuit.” King Solomon wrote this 3,000 years ago. Now consider this: it was not until World War II that airmen discovered the jet stream circuit. Medical quarantine instituted (Leviticus 13:45-46; Numbers 5:1-4). Long before man understood the principles of quarantine, God commanded the Israelites to isolate those with a contagious disease until cured. Each star is unique (1 Corinthians 15:41). Centuries before the advent of the telescope, the Bible declared what only God and the angels knew – each star varies in size and intensity! The Bible says that light can be sent, and then manifest itself in speech (Job 38:35). We now know that radio waves and light waves are two forms of the same thing – electromagnetic waves. Therefore, radio waves are a form of light. Today, using radio transmitters, we can send “lightnings” which indeed speak when they arrive. Laughter promotes physical healing (Proverbs 17:22). Recent studies confirm what King Solomon was inspired to write 3,000 years ago, “A merry heart does good, like medicine.” For instance, laughter reduces levels of certain stress hormones. This brings balance to the immune system, which helps your body fight off disease. Intense sorrow or stress is harmful to your health (Proverbs 18:14; Mark 14:34). Researchers have studied individuals with no prior medical problems who showed symptoms of stress cardiomyopathy including chest pain, difficulty breathing, low blood pressure, and even heart failure – following a stressful incident. Microorganisms anticipated (Exodus 22:31). The Bible warns “Whatever dies naturally or is torn by beasts he shall not eat, to defile himself with it: I am the LORD” (Leviticus 22:8). Today we understand that a decaying carcass is full of disease causing germs. The Bible cautions against consuming fat (Leviticus 7:23). Only in recent decades has the medical community determined that fat clogs arteries and contributes to heart disease. Do not consume blood (Leviticus 17:12). A common ritual in many religions in the ancient world was to drink blood. However, the Creator repeatedly told His people to abstain from blood (Genesis 9:4; Leviticus 3:17; Acts 15:20; 21:25). Of course, modern science reveals that consuming raw blood is dangerous.The Bible describes dinosaurs (Job 40:15-24). In 1842, Sir Richard Owen coined the word dinosaur, meaning “terrible lizard,” after discovering large reptilian-like fossils. However in the Book of Job, written 4,000 years earlier, God describes the behemoth as: the largest of all land creatures, plant eating (herbivore), with great strength in its hips and legs, powerful stomach muscles, a tail like a cedar tree, and bones like bars of iron. This is an accurate description of sauropods – the largest known dinosaur family. Pleasure explained (Psalm 36:8). Evolution cannot explain pleasure – even the most complex chemicals do not experience bliss. However, the Bible states that God “gives us richly all things to enjoy” (1 Timothy 6:17). Pleasure is a gift from God. Life is more than matter and energy (Genesis 2:7; Job 12:7-10). We know that if a creature is denied air it dies. Even though its body may be perfectly intact, and air and energy are reintroduced to spark life, the body remains dead. Scripture agrees with the observable evidence when it states that only God can give the breath of life. Life cannot be explained by raw materials, time, and chance alone – as evolutionists would lead us to believe. Origin of music explained (Psalm 40:3). Evolution cannot explain the origin of music. The Bible says that every good gift comes from God (James 1:17). This includes joyful melodies. God has given both man and angels the gift of music-making (Genesis 4:21; Ezekiel 28:13). Singing is intended to express rejoicing in and worship of the Lord (Job 38:7; Psalm 95:1-2). Our ancestors were not primitive (Genesis 4:20-22; Job 8:8-10; 12:12). Archeologists have discovered that our ancestors mined, had metallurgical factories, created air-conditioned buildings, designed musical instruments, studied the stars, and much more. This evidence directly contradicts the theory of evolution, but agrees completely with God’s Word. Cavemen described in the Bible (Job 30:1-8). Four thousand years ago, Job describes certain “vile men” who were driven from society to forage “among the bushes” for survival and who “live in the clefts of the valleys, (and) in caves of the earth and the rocks.” Therefore “cavemen” were simply outcasts and vagabounds – not our primitive ancestors as evolutionists speculate. Environmental devastation of the planet foreseen (Revelation 11:18). Though evolution imagines that things should be getting better, the Bible foresaw what is really occurring today: pollution, destruction and corrupt dominion. The seed of a plant contains its life (Genesis 1:11; 29). As stated in the Book of Genesis, we now recognize that inside the humble seed is life itself. Within the seed is a tiny factory of amazing complexity. No scientist can build a synthetic seed and no seed is simple! A seed must die to produce new life (1 Corinthians 15:36-38). Jesus said, “unless a grain of wheat falls into the ground and dies, it remains alone; but if it dies, it produces much grain.” (John 12:24). In this verse is remarkable confirmation of two of the fundamental concepts in biology: 1) Cells arise only from existing cells. 2) A grain must die to produce more grain. The fallen seed is surrounded by supporting cells from the old body. These supporting cells “give their lives” to provide nourishment to the inner kernel. Once planted, this inner kernel germinates resulting in much grain. The order of creation agrees with true science (Genesis 1). Plants require sunlight, water, and minerals in order to survive. In the first chapter of Genesis we read that God created light first (v.3), then water (v. 6), then soil (v. 9), and then He created plant life (v. 11). God created “lights” in the heavens “for signs and seasons, and for days and years” (Genesis 1:14-16). We now know that a year is the time required for the earth to travel once around the sun. The seasons are caused by the changing position of the earth in relation to the sun. The moon’s phases follow one another in clock-like precision – constituting the lunar calendar Evolution teaches that the cosmos evolved by random chance, yet the Bible agrees with the observable evidence. The Bible speaks of “heaven and the highest heavens” (Deuteronomy 10:14). Long before the Hubble Space Telescope, Scripture spoke of the “heaven of heavens” and the “third heaven” (1 Kings 8:27; 2 Corinthians 12:2). We now know that the heavens consist of our immediate atmosphere and the vast reaches of outer space – as well as God’s wonderful abode. Olive oil and wine useful on wounds (Luke 10:34). Jesus told of a Samaritan man, who when he came upon a wounded traveler, he bandaged him – pouring upon his wounds olive oil and wine. Today we know that wine contains ethyl alcohol and traces of methyl alcohol. Both are good disinfectants. Olive oil is also a good disinfectant, as well as a skin moisturizer, protector, and soothing lotion. This is common knowledge to us today. However, did you know that during the Middle Ages and right up till the early 20th century, millions died because they did not know to treat and protect open wounds? Man is “fearfully and wonderfully made” (Psalm 139:14). We are only beginning to probe the complexity of the DNA molecule, the eye, the brain, and all the intricate components of life. No human invention compares to the marvelous wonders of God’s creation. Beauty understood (Genesis 1:31; 2:9; Job 40:10; Ecclesiastes 3:11; Matthew 6:28-30). Beauty surrounds us: radiant sunsets, majestic mountains, brightly colored flowers, glowing gems, soothing foliage, brilliantly adorned birds, etc. Beauty is a mystery to the evolutionist. However, Scripture reveals that God creates beautiful things for our benefit and His glory. Strong and weak nuclear force explained (Colossians 1:17; Hebrews 1:3). Physicists do not understand what binds the atom’s nucleus together. Yet, the Bible states that “all things consist” – or are held together by the Creator – Jesus Christ. Atomic fission anticipated (2 Peter 3:10-12). Scripture states that “the elements will melt with fervent heat” when the earth and the heavens are “dissolved” by fire. Today we understand that if the elements of the atom are loosed, there would be an enormous release of heat and energy (radiation). The Pleiades and Orion star clusters described (Job 38:31). The Pleiades star cluster is gravitationally bound, while the Orion star cluster is loose and disintegrating because the gravity of the cluster is not enough to bind the group together. 4,000 years ago God asked Job, \"Can you bind the cluster of the Pleiades, or loose the belt of Orion?\" Yet, it is only recently that we realized that the Pleiades is gravitationally bound, but Orion's stars are flying apart. Safe drinking water (Leviticus 11:33-36). God forbade drinking from vessels or stagnant water that had been contaminated by coming into contact with a dead animal. It is only in the last 100 years that medical science has learned that contaminated water can cause typhoid and cholera. Pest control (Leviticus 25:1-24). Farmers are plagued today with insects. Yet God gave a sure-fire remedy to control pests centuries ago. Moses commanded Israel to set aside one year in seven when no crops were raised. Insects winter in the stalks of last year’s harvest, hatch in the spring, and are perpetuated by laying eggs in the new crop. If the crop is denied one year in seven, the pests have nothing to subsist upon, and are thereby controlled. Soil conservation (Leviticus 23:22). Not only was the land to lay fallow every seventh year, but God also instructed farmers to leave the gleanings when reaping their fields, and not to reap the corners (sides) of their fields. This served several purposes: 1) Vital soil minerals would be maintained. 2) The hedge row would limit wind erosion. 3) The poor could eat the gleanings. Today, approximately four billion metric tons of soil are lost from U.S. crop lands each year. Much of this soil depletion could be avoided if God’s commands were followed. Animal instincts understood (Job 39; Proverbs 30:24-28; Jeremiah 8:7). A newly hatched spider weaves an intricate web without being taught. A recently emerged butterfly somehow knows to navigate a 2,500-mile migration route without a guide. God explains that He has endowed each creature with specific knowledge. Scripture, not evolution, explains animal instincts. Animals do not have a conscience (Psalm 32:9). A parrot can be taught to swear and blaspheme, yet never feel conviction. Many animals steal, but they do not experience guilt. If man evolved from animals, where did our conscience come from? The Bible explains that man alone was created as a moral being in God’s image. Pseudo-science anticipated (1 Timothy 6:20). The theory of evolution contradicts the observable evidence. The Bible warned us in advance that there would be those who would profess: “profane and idle babblings and contradictions of what is falsely called knowledge (science).” True science agrees with the Creator’s Word. Science confirms the Bible (Colossians 2:3). These insights place the Bible far above every manmade theory and all other so-called inspired books. In contrast, the Koran states that the sun sets in a muddy pond (Surah 18:86). The Hadith contains many myths. The Book of Mormon declares that Native Americans descended from Jews – which has been disproven by DNA research. The Eastern writings also contradict true science. ",
            "date": "Answered November 2, 2017",
            "views": "130",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chris Hammond",
                    "user_href": "/profile/Chris-Hammond-54"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ross Doddridge",
                "href": "/profile/Ross-Doddridge"
            },
            "answer_text": "In a word NO If you think you can justify a holy book with science then you don’t understand science! There is no evidence based, peer reviewed proof of any of the history recounted in the holy books - No Moses, No exodus, No Jesus and certainly no flood. These books are books of myths and allegories based on the explanations given to Iron Age man about things beyond there comprehension - many of which are now explained by science e.g lightning is not an angry god flinging bits at the earth it is an electrical discharge produced by local weather conditions. ",
            "date": "Answered November 2, 2017",
            "views": "110",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jack Kasmer",
                    "user_href": "/profile/Jack-Kasmer"
                },
                {
                    "user_id": "Annie Rain",
                    "user_href": "/profile/Annie-Rain-1"
                },
                {
                    "user_id": "Tim Cole",
                    "user_href": "/profile/Tim-Cole-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ari Mermelstein",
                "href": "/profile/Ari-Mermelstein-1"
            },
            "answer_text": "No, but why does it have to be? As far as I know, no religion who follows the Bible as scripture believes that it's scientifically accurate. Everyone is aware that we know a lot more about how the world works now that even a few hundred years ago, let alone 3000 or so years ago. Jews don't believe that the Bible was entirely written by G-d. The first five books were dictated to Moses word for word (mostly). However, the other books of the Bible were either written by people with Divine inspiration (e.g. Psalms) or by prophets writing their visions in their own words (e.g. Ezekiel). When people write books, they wrote according to their knowledge of the world, which by our standards wasn't very sophisticated. This doesn't make the Bible any less true. ",
            "date": "Answered November 2, 2017",
            "views": "124",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Janov",
                    "user_href": "/profile/David-Janov"
                },
                {
                    "user_id": "David Hirst",
                    "user_href": "/profile/David-Hirst-4"
                },
                {
                    "user_id": "Derrin Gottlieb",
                    "user_href": "/profile/Derrin-Gottlieb"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lucha Tijuanera",
                "href": "/profile/Lucha-Tijuanera"
            },
            "answer_text": "Christians never claim the bible is a scientific book even may have somethings that we know are, but the bible has a lot of symbolism, poetry, figured speach and some literal stuff, above it has prophecy, so we do not encourage to read it as a sci book. In some parts of the bible speaks of falling stars when we know is speaking of fallen angels, so better do not try to take it literaly always, it is an spiritual book. ",
            "date": "Answered November 2, 2017",
            "views": "32",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nathan Ketsdever",
                "href": "/profile/Nathan-Ketsdever"
            },
            "answer_text": "The assumption that God can’t do things that transcend science demonstrate a very small and misrepresentative view of God. The notion that God made science and the universe, and can’t temporarily alter a supposed laws of science for his ends demonstrates an overly procrustean and in general just a weak view of God, not one that recognizes the claims God makes and the way He’s demonstrated in history. ",
            "date": "Answered November 2, 2017",
            "views": "98",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sasi Stephen",
                "href": "/profile/Sasi-Stephen-1"
            },
            "answer_text": "Look between the lines in their books. You find details that leads to incredibly advanced science. Al Ashra (Islam). Destruction of Sodom and Gomorrah, which is a timed explosion(OT). The only problem is that our ego will not allow us to agree that much more advanced science was there long back. ",
            "date": "Answered November 2, 2017",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William Travis",
                "href": "/profile/William-Travis-1"
            },
            "answer_text": "No, both are works of fiction with amazingly bad science in each of them. ",
            "date": "Answered November 2, 2017",
            "views": "33",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Innes McLeod",
                    "user_href": "/profile/Innes-McLeod"
                },
                {
                    "user_id": "Sage Kadow",
                    "user_href": "/profile/Sage-Kadow"
                },
                {
                    "user_id": "Fred Bruan",
                    "user_href": "/profile/Fred-Bruan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fred Bruan",
                "href": "/profile/Fred-Bruan"
            },
            "answer_text": "Never The Earth was not flooded 4000 years ago. The Earth is not only 6000 years old. The Earth is not flat, and not covered by a dome. Nobody lived to be 500–900 years old. ",
            "date": "Answered November 2, 2017",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sage Kadow",
                    "user_href": "/profile/Sage-Kadow"
                }
            ]
        }
    ]
}