{
    "title": "Can paradoxes exist in our world, include examples? - Quora",
    "tags": [
        "Paradoxes",
        "Existence"
    ],
    "response": [
        {
            "author_info": {
                "name": "Valdis Klētnieks",
                "href": "/profile/Valdis-Klētnieks"
            },
            "answer_text": "Can paradoxes exist in our world, include examples? No. What *does* exist a lot is “Things that don’t make sense because you didn’t pay attention in your high school science class”. (Hint - any question that starts with “If I travel at the speed of light” is indication that either somebody wasn’t paying attention, or the teacher *totally* dropped the ball.) There’s a much smaller category of apparent paradoxes, such as the information paradox with black holes. General relativity tells us the black hole is completely defined by its mass, spin, and charge, while quantum mechanics tells us that it’s impossible to destroy the quantum-level information of any matter that falls in. But that’s not a paradox either - it’s “We obviously don’t have a full understanding of this yet”. And things like that are what keep scientists employed. ",
            "date": "Answered April 23, 2019",
            "views": "47",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kenneth Armstrong",
                    "user_href": "/profile/Kenneth-Armstrong-9"
                },
                {
                    "user_id": "Gus Gramajo",
                    "user_href": "/profile/Gus-Gramajo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mohammad Gani",
                "href": "/profile/Mohammad-Gani"
            },
            "answer_text": "The Paradox of Hunger M Gani Ajax, ON, Canada 24 Aug 2019 … The most mind-blowing paradox is the paradox of hunger. It is that worldwide more than 92% of the hungry people are food producers themselves. However, more than 96% of the well-fed people are non-producers of food. There are several other paradoxes associated this central one. It is paradox because it is completely the opposite of intuition. Had natural law been successful, then food would be produced and consumed by the same person, so that those who did not produce food would go hungry while those who produced the food would not be hungry. But trade defies the law of nature so that food is produced by those who do not consume it and consumed by those who do not produce it. As natural law fails, intuition based on natural law fails. One elementary law of economics is the law of price flexibility. According to this law, price goes up when demand is more than supply, and price goes down when demand is less than supply. Now, after the onset of the industrial revolution, the technology of agriculture got such a boost that food production increased rapidly, so fast that it was faster than the unprecedented high rate of population growth. The relative price of food (as counted in units of non-food items) has been continuously falling since the onset of industrial revolution (around 1750 of the common era CE). As supply increased faster than demand, the relative price of food was bound to fall. The elementary law of income is that the income of the seller falls when the income elasticity of demand of what he sells is less than unity. In simple terms, if income goes up by one percent, but the demand for food grows up by less than one percent, the food seller gets a smaller and smaller share of the income. Since income is counted by multiplying price by quantity sold, it means that if price falls by 1%, but the demanded quantity does not increase by 1% to earn the same income as before. Simply put, the price fall gives the advantage to the buyer who gets more food for the same money as before. The farmer must give more food for less money than before. An example is that when the price of rice was 40 taka per kg, a farmer sold 25 kg rice to get 1000 taka of income. But as he tries to sell 30 kgs (being 5 kg more than before), the price falls to 30 takas, so that he sells 5 kgs more but his income now is 900 takas rather than 1000 taka. (At constant prices adjusted for inflation). The fact that by producing more food peasants were becoming poorer was known from the beginning. In the 1950’s Raul Prebisch and Jagdish Bhagwati raised quite a hue and cry about this immiserating growth of agriculture, but the world did not pay any attention. Farmers as a rule are mute people who usually are unable to cry out in political ways to get their problems solved. For more than two hundred years, farmers have become poorer and poorer, and more than 95% of them just fled from agriculture to move to towns. In all developed nations, more than 95% of the people live in cities because they know that living in the village is the surest way to remain poor and become ever poorer. At a loss An associated paradox is that more than 90% of the world’s poor are poor precisely because they live in rural areas and produce food. This is beyond intuition. How can peasants continue to produce more food than they can sell profitably? The answer is that peasants do not think about profit. They have the ancestral land, and they just grow the food. It is a big social challenge for anybody to leave the ancestral home with whatever little land they have and move to a town among perfect strangers, without any skills to find enough work to survive in the city. Most peasants live in cottages they or their ancestors built, and they pay no rent at all. When they hear about the sky-high rental rates of urban housing, they just cannot believe it, and just cannot think of going to the cities. Accustomed to work freely on their own land, they cannot even think how they are going to work for other people as their servants. Even the landless peasant who works on the land of others is treated like a relative or a friend, and never treated like a servant. It is next to impossible for a peasant to just leave the village and enter the city for better income. This harsh reality of poverty is almost impossible to grasp if one relies on intuition. Intuition never prepares one to see the fact that poverty is the result of severe under-population reflected in the lack of demand for food. Relying on unthinking intuition, people are more likely to falsely assume that poverty means that there is overpopulation and serious shortage of food and exhaustion of land (natural resource). The biggest enemy of science is intuition. People who rely on intuition simply do not bother to learn that the earth has a land surface of about 14.9 billion hectares. Excluding he ice-cover, there is still 14.3 billion ha of exposed land. There is 3.1 billion ha of perfectly good arable cropland, out of which about 1.4 billion ha is under cultivation. This land has produced more than 2.6 billion tons of food grain in 2018, which could feed 13 billion people, but the actual population was only 7.7 billion. This means more than 40% under-population relative to available food supply. Form the other side, the food requirement was 1.54 billion tons, but supply was 2.6 billion tons, so food supply was 69% larger than required. Relying on false intuition, many people are apt to simply assume that there must be severe shortage of land or natural resource. They just do not understand that 3.1 billion ha of cropland can feed 155 billion people at US farm yield rates, and that the world population is under no circumstances going to be even 10% of 155 billion supportable by the land. There is simply no chance that he world population will surpass 12 billion at most, given the fertility rate trend. The serious victim of the false intuition is the absurd claims made by some people that simply do not care to learn the economic facts of why people use technology, and why they reduce fertility. Paul Erlich, for example, was an entomologist (insect expert) who knew just nothing about economics. He made absurd predictions in 1968 that Indians would starve to death by 1980. His disaster prediction did not come true, and India grew quite well. What Erlich never understood was how the Indians adopted technology to dramatically increase food output. Out of utter ignorance, he took a bet with economist Simon and lost the bet. His ignorant intuition told him that a list of metals and minerals would be exhausted, and their prices would reach the sky in ten years. All the prices fell, because Erlich never understood how technology came around to massively boost the supplies of what he though was exhaustible. Intuition also makes people very silly fools with zero sense of magnitude or proportion. Global warming meant that in 100 years, the sea level rose by 8 inches. Now, how can anybody with any sense of proportion or magnitude predict that in the next ten years, Bangladesh would be entirely drowned under sea water and the people of Bangladesh must flee to India? 1 inch of water in 10 years is enough to do that? He simply does not know that Bangladesh annually receives about 80-84 inches of water in a short monsoon burst over just 2 months, when it seems like whole oceans are downpoured on Bangladesh. Bangladeshi people routinely deal with 80 or more inches of water, and to scare them that 1 more inch will make them country-less is beyond absurd. The utterly ignorant followers of Paul Erlich just never manage to come to grips with the economic rationale of technology. The rationale is that if it is profitable, people will employ the technology to solve a problem. Here are some things that seem simple common sense to normal people, but which no climate expert can ever understand. First, if the ice cap melts owing to global warming, there should be places where the melted water rushes down, where turbines can be placed to capture the water and compel it to rotate turbines to generate electricity. If a lot of ice cap melts, it ought to be profitable to dig billions of miles of canals to direct the water to millions of square kilometers of vast deserts so that some land lost to the encroaching sea are replaced by turning arid deserts into irrigated croplands. Secondly, they should have known about aquaponic technology, which is hundred of years old. It is a very simple method of piling hyacinth upon hyacinth to make a floating raft on which all kinds of crops can be grown with far greater ease than growing them on land. Raft cultivation is not yet prominent because there is not enough wetland to float rafts. If the ice cap would please melt, life would be made that much easier. Do these people know anything about a somewhat recent technology called hydroponics? It is the very silly fact that most fruits and vegetables and crops do not care to grow on soil: they do not mind t grow on water so long as the required nutrients are dissolved in water. People can easily grow crops inside the apartment, and they now do it as amateurs. If there is a need, they can do it as professionals. And it does not matter that a building is 60 stories high: on each floor, it can still support hydroponic agriculture. Thirdly, these people ought to know that for thousands of years, people have built boats as homes. Plastic can be usually a much better option than wood to make boats and rafts of any imaginable size. If there ever was a trillion people to feed, Bangladesh could easily take a contract to feed them all by floating rafts on large parts of the Indian ocean and growing all the food right on top of those floating rafts. Intuition makes people ignorant because they think they know something just because their minds automatically come up with unthinking ideas. This ignorance disables them from learning facts by observation. So, the climate experts have long been falsely predicting water shortage in the world. It is incredible how ignorant that is. Bangladesh is the second largest catchment for rainwater after the Amazon Basin of Brazil. On the Bangladesh territory of 144 thousand square kilometers (144 billion square meters), annually 2 meters of fresh rainwater falls, giving 288 billion cubic meters of rainwater. One cubic meter is 100*100*100 centimeters= 1 million cc= 1 thousand liters. That is, the rainwater directly falling on Bangladesh is about 288 trillion liters. The whole world, with 10 billion people each drinking 2000 liters a year would need less than 20 trillion liters. It is pure absurdity to say that the world is running out of freshwater. Remember that about 1 million square kilometers of neighboring land in India, Nepal, Afghanistan and Tibet send a large volume of rainwater to Bangladesh from upstream too. The foreign water entering Bangladesh is usually more than four times larger than the local rainfall. Go figure. So, the biggest and most incredible paradox is the utter absurdity of sense of magnitude of fear-mongers. How can people fear an eight-inch rise in the sea level? After all the advances in air-conditioning why would anybody be afraid of a few degrees of Fahrenheit of higher temperature? How can anybody believe the disaster predictions that have always been false alarms? It is high time to understand that intuition is our number one enemy that disable us from learning the paradoxical realities. An untrained mind is a dangerous thing to have: it needs to be trained by observed facts and disciplined analysis. ",
            "date": "Answered August 24, 2019",
            "views": "147",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nick Curtis",
                "href": "/profile/Nick-Curtis-42"
            },
            "answer_text": "By can, do you mean is it possible for paradoxes to exist in out world? I’m fairly sure that it may be possible, but it’s highly unlikely. The essence of a paradox is that it is self-contradictory; however, in my limited experience, Nature does not contradict herself. Hence, I doubt you’ll get any examples of real-world paradoxes. ",
            "date": "Answered April 22, 2019",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Zane Scheepers",
                "href": "/profile/Zane-Scheepers-1"
            },
            "answer_text": "Paradoxes only exist in the minds of people who misunderstand theories or believe illogical theories. For example, some people believe that 2 clocks can tick slower than each other. Seriously, WTF? On top of that, they believe they understand some weird concept, that others don't. ",
            "date": "Answered April 23, 2019",
            "views": "54",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kenneth Armstrong",
                    "user_href": "/profile/Kenneth-Armstrong-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Leonard",
                "href": "/profile/Steve-Leonard-67"
            },
            "answer_text": "As far as I know,paradoxes express the impossibility of half baked and poorly thought out theories.the best example I know is to say the infinite universe was created and saying that infinity can be created is an ultimate paradox! ",
            "date": "Answered April 22, 2019",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rick Devon",
                "href": "/profile/Rick-Devon"
            },
            "answer_text": "religion and lunatic idiots around are, more exemples? people who believe in freewill and thinks money is the real answer to solve problems even though them all being slaves to a bad false thinking not knowing it though. ",
            "date": "Answered April 22, 2019",
            "views": "25",
            "upvotes": "0"
        }
    ]
}