{
    "title": "Can God be omniscient without being all knowing? - Quora",
    "tags": [
        "Omniscience",
        "Theology",
        "God",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bramhatanu Banerjee",
                "href": "/profile/Bramhatanu-Banerjee"
            },
            "answer_text": "It may be possible.  After all , what is knowledge ?  A peculiar reaction of neurons in my brain after seeing or hearing something. Note that each single neuron is not aware of the \"abstract representations\". Although more. We have to bring memory into it. Memory ? Is a permanent yet fluid representation. Of our observation of the outer world.        Every observation is a reaction to a stimulus , internal or external. And knowledge comes next.  Every system has a kind of knowledge If I dare say. The boy knows  that his carrier depends on whether he passes the exam. How does he know? The answer is , his so called  knowledge the result of constant hammering by the society , the circumstance , at his every step. And further steps. Finally , take our body. Our reflexes. How we breathe. How we digest things. How our body copes with foreign antigens , no prior knowledge about them . You call them involuntary actions. They don't happen with your knowledge. Roll a ball on the uneven floor. The ball moves in a path , which is ultimately set by the bumps and grooves on the floor.  Not much different I suppose. Only , that the ball doesn't think it knows.  Need I say more ? God is broken up into so many systems , star , Earth , cell , and all . reacting and reacting. ",
            "date": "Answered March 18, 2016",
            "views": "361",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Swarnim Sharma",
                    "user_href": "/profile/Swarnim-Sharma-5"
                },
                {
                    "user_id": "John Gratta",
                    "user_href": "/profile/John-Gratta"
                },
                {
                    "user_id": "Pete Ashly",
                    "user_href": "/profile/Pete-Ashly"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Lance Huget",
                "href": "/profile/William-Lance-Huget"
            },
            "answer_text": "The question is a contradiction. An omniscient being (God) is all-knowing by definition. However, omniscience is qualified by the knowable. There are things an omniscient being cannot know and there are things an omnipotent being cannot do (=omnipotence is the doable, not logical absurdities like making rocks too heavy to lift). God is not ignorant of anything knowable. He knows the past/present exhaustively. Because creation is non-deterministic and the future consists of possibilities, God knows this reality as it is. Exhaustive definite foreknowledge of libertarian future free will contingencies is not logically possible. The potential, anticipatory future becomes the fixed past (memory) through the actual present. ",
            "date": "Answered October 22, 2019",
            "views": "52",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Frank Dauenhauer",
                "href": "/profile/Frank-Dauenhauer"
            },
            "answer_text": "Can God be omniscient without being all knowing? Yes. \"God\" can be anything a believer in this imaginary entity's existence wants \"him\" to be. ",
            "date": "Updated October 22, 2019",
            "views": "21",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Gratta",
                    "user_href": "/profile/John-Gratta"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ken Taylor",
                "href": "/profile/Ken-Taylor-32"
            },
            "answer_text": "The question is, if man had the ability of abstract knowledge, where would he get that ability if the being that made him didn't have it? ",
            "date": "Answered March 18, 2016",
            "views": "58",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Frank Dauenhauer",
                    "user_href": "/profile/Frank-Dauenhauer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Philip Mayor",
                "href": "/profile/Philip-Mayor-1"
            },
            "answer_text": "Perhaps God is a bit like a really good waiter. He's always there, especially when you really need him, but there's a lot of stuff he has to pretend he didn't see or hear.  ",
            "date": "Updated March 22, 2016",
            "views": "72",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Talat Zahra",
                "href": "/profile/Talat-Zahra-2"
            },
            "answer_text": "No. How ever Nicholas Everitt in his book Non Existence of God did try to present a definition in which a Nescient Being may be called Omniscient. But based on this is self contradicting definition Nicholas try to disprove God. So be aware of such fallacious definitions. ",
            "date": "Answered March 3, 2017",
            "views": "45",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bernhard Sengstock III",
                "href": "/profile/Bernhard-Sengstock-III"
            },
            "answer_text": "Through quantum superposition, yes. https://en.wikipedia.org/wiki/Quantum_superposition ",
            "date": "Answered March 26, 2019",
            "views": "35",
            "upvotes": "0"
        }
    ]
}