{
    "title": "Can The Tao be understood or only experienced? - Quora",
    "tags": [
        "Dao De Jing (道德經)",
        "Tao (Chinese philosophy)",
        "Taoism (道教)",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tiger Soune",
                "href": "/profile/Tiger-Soune"
            },
            "answer_text": "The Tao can be understood and experienced. And we can understand and experience the Tao through various kinds of activities, which include but are not limited to meditation, contemplation, observation, reading, thinking, working, playing, and behaving. These activities can be mutually reinforcing and confirm one another in terms of understanding and experiencing the Tao. That is why the Tao Te Ching not only tells us what is the Tao, how it works, why we should follow it, but also inform us how to know it and how to follow it in our self-cultivation practices and social activities. For example, chapter one not only tells us what is the Tao (Being and Non-Being), how it works (Being and Non-Being transform into each other constantly and form the gateways to guide beings to be born and to return), but also tells us how to experience it directly (by following the guidance of Being and Non-Being and observing how they work together): The Tao is teachable, yet understanding my words is not the same as following the Tao. The guidance is describable, yet knowing the description is not the same as following the guidance. Non-Being guides to the origin of Heaven and Earth. Being guides to the mother of all particular things. Thus, through the guidance of Non-Being, you can observe the beginning; through the guidance of Being, you can observe the returning. Non-Being and Being come out concurrently, but point to different directions; both together can be called the mysterious transforming power. They constantly transform into each other, and form the gateways for all wonderful things. . And chapter thirty-Seven not only tells us how the Tao works (wu wei 無為 and ziran 自然) and why we should follow it (wu wei er wu bu wei 無為而無不為), but also tells us how to be a great leader (by following Tao’s way of action): The Tao never coerces anyone to do anything, yet nothing is left undone. If lords or kings could realize this, the people would develop spontaneously. When the desires are about to explode during development, we shall let Non-Being guide us back to the state of simplicity. Following the guidance of Non-Being, there will be no greed. Without greed there is tranquility. Hence the world will settle into peace naturally. . This answer is based on the translations and explanations of the following book: Tao Te Ching: The New English Version That Makes Good Sense ",
            "date": "Answered April 13, 2019",
            "views": "171",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mandy Wessen",
                    "user_href": "/profile/Mandy-Wessen"
                },
                {
                    "user_id": "Holly Van Gorden",
                    "user_href": "/profile/Holly-Van-Gorden"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karolos Gikas",
                "href": "/profile/Karolos-Gikas"
            },
            "answer_text": "Allthough I am a novice in Daoism, let me tell you what I believe: I think it can be both understood and experienced, but understood and experienced in a different way. We cannot understand it in the same way we understand something in our common sense. Understanding implies recognising causal factors, how something is caused, what comes first and what follows. Recognize similarities and differences, and so on. Dao contains all causes and all results, it is before everything but seems it is following everything. It works by reversion as Lao Zi wrote. It is understood when it is not understood. “The name that can be named, is not the real name”. Can it be sensed? Maybe everything we sense is a glimpse of Dao. But everything we not sense must be equally part of Dao. Since what we sense is a small fraction of what there is… not sensing brings us closer to Dao. ",
            "date": "Answered April 23, 2019",
            "views": "46",
            "upvotes": " Answer requested by Steve Kelly",
            "upvoters": [
                {
                    "user_id": "Marius Matishek",
                    "user_href": "/profile/Marius-Matishek"
                },
                {
                    "user_id": "Mandy Wessen",
                    "user_href": "/profile/Mandy-Wessen"
                },
                {
                    "user_id": "Bunny Ramjee",
                    "user_href": "/profile/Bunny-Ramjee"
                },
                {
                    "user_id": "Holly Van Gorden",
                    "user_href": "/profile/Holly-Van-Gorden"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yoshikuni Atsushi",
                "href": "/profile/Yoshikuni-Atsushi"
            },
            "answer_text": "The Tao (I prefer Dao, sounds more accurate compared to real pronunciation) can be understood as a standard of benevolence at the highest degree in the universe. The Tao can be understood, but not through reading books regarding this field. In order to understand Tao, the only way is to go according to the way of it. It is the experience that you gained that is hard to explain to people. For example, a billionaire wears only a casual t shirt and shorts to attend events. Its about putting yourself to the lowest even though you are extraordinary, its about doing charity that do not get you fame, its about heping people and do not want any return, its about staying as humble and low as possible, its about sheltering people by sacrificing yourself. If you can do this, the experience you gained shall fill your soul, you no longer need anything to excite your life. This is Tao. The blissful experience you get is hard for people to understand. ",
            "date": "Answered April 13, 2019",
            "views": "171",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Diane Freeman Goss",
                    "user_href": "/profile/Diane-Freeman-Goss"
                },
                {
                    "user_id": "Tom Graves",
                    "user_href": "/profile/Tom-Graves"
                }
            ]
        },
        {
            "author_info": {
                "name": "Don Kim",
                "href": "/profile/Don-Kim-49"
            },
            "answer_text": "To answer in the “spirit” of the Tao: To experience the Tao, requires you to understand it. To understand the Tao, requires you to experienced it. Your either/or dichotomy with respect to understanding and experience is a very Western-Aristotelian “law-of-the-excluded-middle” type of categorization of two mental and physical states of conscious experience that in the Tao, is One and the same. Experience drives understanding and understanding drives experience. Free yourself from such a constraint and you will find the Tao/Way and the Tao/Way will find you. It’s a matter of daily practice and letting go of the practice… ",
            "date": "Answered June 17, 2019",
            "views": "88",
            "upvotes": " Answer requested by Steve Kelly",
            "upvoters": [
                {
                    "user_id": "Bunny Ramjee",
                    "user_href": "/profile/Bunny-Ramjee"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Goss",
                "href": "/profile/John-Goss-16"
            },
            "answer_text": "The chinese word tao is used in an attempt to identify by name that nameless energy-substance we call physical and non-physical reality in all of its manifestations, both known and unknown. The tao exists with or without our perception, affirmation or negation of it. Separated mentally from it, we call it the tao or the way, and when reunited there is no need to identify it. The way to be at one with the tao can be known, but the tao itself can only be experienced. The way for the mind to be one again with the tao is not difficult. Only our lack of desire for the truth concerning the cause of human suffering and conflict and how to eliminate that cause from the mind, keeps us from it. ",
            "date": "Answered April 19, 2019",
            "views": "76",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mandy Wessen",
                    "user_href": "/profile/Mandy-Wessen"
                },
                {
                    "user_id": "Daniel Kirby",
                    "user_href": "/profile/Daniel-Kirby-34"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Hulet",
                "href": "/profile/Bill-Hulet"
            },
            "answer_text": "The Dao can be understood to a greater or a lesser degree. But the problem is that in order to understand it, you have to transform your understanding and relationship with the world around you. This is why you can’t just learn it from reading a book, you have to undertake a spiritual practice—a “kung fu”, or, diligent thoughtful practice leading to great ability. It’s also why a “realized man” (someone who has achieved great understanding of the Dao) is able to recognize other people of similar attainment, even though the general public cannot. ",
            "date": "Answered April 12, 2019",
            "views": "81",
            "upvotes": " Answer requested by Steve Kelly",
            "upvoters": [
                {
                    "user_id": "George Heuston",
                    "user_href": "/profile/George-Heuston-1"
                },
                {
                    "user_id": "Rigopoula Tsambou Talarantas",
                    "user_href": "/profile/Rigopoula-Tsambou-Talarantas"
                },
                {
                    "user_id": "Karen Marie Shelton",
                    "user_href": "/profile/Karen-Marie-Shelton"
                },
                {
                    "user_id": "Emma Skinner",
                    "user_href": "/profile/Emma-Skinner-5"
                },
                {
                    "user_id": "Freeway",
                    "user_href": "/profile/Freeway-2"
                },
                {
                    "user_id": "Holly Van Gorden",
                    "user_href": "/profile/Holly-Van-Gorden"
                },
                {
                    "user_id": "Robin Harville",
                    "user_href": "/profile/Robin-Harville"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stefan Fognini",
                "href": "/profile/Stefan-Fognini-1"
            },
            "answer_text": "Experienced for me . It requires intellectuality as well for one’s springboard into Tao . The key for me was to have a thirst and not desire. Need not want was key . That’s tricky itself to absorb as a concept at times. Describing something that’s takes a middle path is very abstract as “ nothing” as a concept to live by . How can one understand a universal formless essence of unity ? Other than feel and experience . ",
            "date": "Answered April 30, 2019",
            "views": "25",
            "upvotes": " Answer requested by Steve Kelly"
        },
        {
            "author_info": {
                "name": "Liat Lim",
                "href": "/profile/Liat-Lim"
            },
            "answer_text": "Knowing in the mind and knowing with personal experience should go hand-in-hand. One is enlightened only when one experiences what he knows in theory. Confucius says, “Learning and practicing it often, are they not a joy?” Chinese describe moral or ethics with two linked word 道德 DaoDe. Dao/Tao 道 is the right way of heaven. 德 is the gain or achievement. A person is morally mature only if he has gained or internalized the Dao. Knowing the Dao and not practicing the Dao is not knowing. ",
            "date": "Answered April 17, 2019",
            "views": "56",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Colin Hankin",
                "href": "/profile/Colin-Hankin"
            },
            "answer_text": "Understanding it facilitates experiencing it. On page 158 of his “Chinese philosophy in Classical Times”, E.R.Hughes quotes the Tao te Ching: “The business of learning is one of day by day acquiring more, The business of the Tao, one of day by day dealing with less. Yes, dealing with less and less, Until you arrive at inaction.” ",
            "date": "Answered April 18, 2019",
            "views": "43",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Keith Randall",
                "href": "/profile/Keith-Randall-2"
            },
            "answer_text": "Read it. Read it again. See the two as one that is not the one but a three? Sounds silly, but do this and see if you don’t find the same? Good luck and best wishes. ",
            "date": "Answered April 30, 2019",
            "views": "51",
            "upvotes": " View 7 Upvoters "
        },
        {
            "author_info": {
                "name": "Stephen Brown",
                "href": "/profile/Stephen-Brown-393"
            },
            "answer_text": "These are stories, from those gone. You have to Meditate and the tao will show itself as a path to enlightenment. Its just words so others can comunicate. It’s all well and good talking about the Tao but it is a one dimentional thing without Experience that comes from meditation. ",
            "date": "Answered April 18, 2019",
            "views": "11",
            "upvotes": " Answer requested by Steve Kelly"
        },
        {
            "author_info": {
                "name": "Ng Cheok Heong",
                "href": "/profile/Ng-Cheok-Heong"
            },
            "answer_text": "The Tao that can be talk is not true. Can you talk about ‘sweet, sour, bitter’? To experience Tao we need to have the mind of the higher beings. Humans are lower beings because we are not pure. To achieve the higher mind we can purify ourselves. ",
            "date": "Answered April 23, 2019",
            "views": "26",
            "upvotes": " Answer requested by Steve Kelly"
        },
        {
            "author_info": {
                "name": "Khalid Nezami",
                "href": "/profile/Khalid-Nezami-3"
            },
            "answer_text": "The Tao, the absolute, can only be understood negatively, the Tao Teh Ching only Speaks about it as being formless, soundless, changeless, without beginning, and all these attributes and more are negative, the only positive attribute given to the Tao is existence, It just is. ",
            "date": "Answered April 30, 2019",
            "views": "20",
            "upvotes": " Answer requested by Steve Kelly"
        },
        {
            "author_info": {
                "name": "Nelson Yu",
                "href": "/profile/Nelson-Yu-9"
            },
            "answer_text": "“Tao” or The Way should be both. You cannot fully understand what you didn't fully experience. You cannot fully experience if didn't fully understand. It cannot be half baked. ",
            "date": "Answered April 23, 2019",
            "views": "10",
            "upvotes": " Answer requested by Steve Kelly"
        }
    ]
}