{
    "title": "Can money make a person look better? - Quora",
    "tags": [
        "Advice About Wanting and Making Money",
        "Self-Improvement Advice",
        "Personal Finance Advice",
        "Physical Appearances of People",
        "Wanting and Making Money",
        "Self-Improvement",
        "Money"
    ],
    "response": [
        {
            "author_info": {
                "name": "Monica",
                "href": "/profile/Monica-396"
            },
            "answer_text": "Does money really makes you look attractive ? The answer is both yes and no . lemme explain this by an example . When you see a total stranger you make a general opinion ( NOT JUDGING ) about that person . There s generally two phases Materialistic stuffs - lets face it , yes materialistic things are pretty attractive one can pretend to be a saint but well we all know the truth . You can t deny the fact .Non-materialistic stuffs - u know there are other stuffs which are equally important like -- If you are wearing gucci heels and walking like a drunk penguin then buddy idk about you but i really dont find it attractive lol. ( how you carry yourself) -If your drive is Audi ( for ex) and as soon as you walk out of it you are treating your subordinates like shit and acting like a stupid brat , trust me buddy its a serious no no . ( how you treat others ) -Being a snob is never attractive . -Money is okay , but as soon as you open your mouth the only thing you talk is bullshit then umm , i dont think so your money is gonna make you look “attractive” . ( shitty perspective) You see my point , money is a necessity and it makes you look attractive but if you dont have general etiquettes or are not a nice person then all the money in this world is not gonna make you look attractive or the only thing thats gonna attract is fake people which is , i guess a loss in long terms . ",
            "date": "Answered April 27, 2017",
            "views": "43",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Utkarsh Mehta",
                    "user_href": "/profile/Utkarsh-Mehta-4"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Thinker-29"
                }
            ]
        },
        {
            "author_info": {
                "name": "PREETI SINGH",
                "href": "/profile/PREETI-SINGH-924"
            },
            "answer_text": "Yes , money it can make us more attractive if you are spending it right . When a persons personality shines through speech, confidence , kindness, friendliness it can attract people . Money makes us financially stable . Money can be used buy gifts for others to make them happy. It can be used to buy fashionable dresses and beauty and skin care products which will help you look confident . Money will attract both good and fake people . Without money nothing can be done in today’s world. Poor people are living lives of slaves these days and nobody is ready to help them . Good personality + Money makes us attractive  ",
            "date": "Answered August 13, 2017",
            "views": "37",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bhavneet Grewal",
                    "user_href": "/profile/Bhavneet-Grewal-1"
                },
                {
                    "user_id": "Selvi",
                    "user_href": "/profile/Selvi-11"
                },
                {
                    "user_id": "Prashanth D",
                    "user_href": "/profile/Prashanth-D-25"
                },
                {
                    "user_id": "Nipul Patel",
                    "user_href": "/profile/Nipul-Patel-16"
                },
                {
                    "user_id": "Shaukat Ali",
                    "user_href": "/profile/Shaukat-Ali-110"
                },
                {
                    "user_id": "Bharat William",
                    "user_href": "/profile/Bharat-William-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mohnish Patra",
                "href": "/profile/Mohnish-Patra-1"
            },
            "answer_text": "Yes it can make a person look better for various of reasons like :- The power and the status just shines through their face.They use better products, thereby making their skin glow and shine.The Financial stability makes the person much more calmer and ready to face the world with ultimate confidence. This makes them look attractive.The process of gaining that money requires a lot of hard work and by finally achieving it gives them the successful look which is really attractive.",
            "date": "Answered May 25, 2020",
            "views": "462",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "DURGA PRASAD",
                    "user_href": "/profile/DURGA-PRASAD-2755"
                }
            ]
        },
        {
            "author_info": {
                "name": "Terry Hoiness Jr",
                "href": "/profile/Terry-Hoiness-Jr"
            },
            "answer_text": "Only if the individuals viewing you *know* you have money. This goes back to how brains are wired to find a suitable, or the best possible provider, in the dominant individual. The individual with the largest amount of money will have the most potential to support a family adequately, or comfortably. Our primordial instincts still force us to believe that the most physically fit is the most attractive as a potential mate, but in modern society, this is not usually the case. ",
            "date": "Answered August 11, 2017",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Emma Browne",
                "href": "/profile/Emma-Browne-10"
            },
            "answer_text": "I don’t think having money itself makes you attractive but I remember a friend of mine telling another friend “honey, you’re not ugly. You’re just poor.” after the friend broke down crying (having spent three days looking through the instagrams of professional athletes wives and girlfriends). What she meant is that because these women have money, they can spend it on looking that good, which essentially could be interpreted as money making you more attractive. ",
            "date": "Answered August 13, 2017",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "James Muller",
                    "user_href": "/profile/James-Muller-34"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mason Bannister",
                "href": "/profile/Mason-Bannister-1"
            },
            "answer_text": "For me wealth does make you more attractive it shows that you're stable and can support yourself and future partner. For some it can directly control how one feels for another if they're looking for a marriage with that partner as they'd look to have a mortgage, cars and children. Being married to a partner who has a significant lower wage than you can limit you're success in life due to the lack of opportunities in which you can gain, such as owning two cars or your own house, which is a good reason why some may seek a relationship with a partner because they see a strong and reliable future in which they can more freely pick their choices in life and earn for their wants. ",
            "date": "Answered August 11, 2017",
            "views": "23",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Johnathan Wong",
                    "user_href": "/profile/Johnathan-Wong"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gokul Narasimhan (கோகுல் நரசிம்மன்)",
                "href": "/profile/Gokul-Narasimhan-கோகுல்-நரசிம்மன்"
            },
            "answer_text": "Thanks for A2A. Yes money attracts people. But not thinking you are beautiful, but your money is beautiful. Through money you can attract people, they will do what ever you wish but everything will be the fake one. You will realize their real face only when your money vanishes Does Money Make You More Attractive? The forbes article came into my mind when I read this question. So it is how you use the money to make yourself attractive. ",
            "date": "Answered April 26, 2017",
            "views": "15",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Diaa Waheb",
                    "user_href": "/profile/Diaa-Waheb"
                },
                {
                    "user_id": "Mahinderpal Singh",
                    "user_href": "/profile/Mahinderpal-Singh-5"
                },
                {
                    "user_id": "Utkarsh Mehta",
                    "user_href": "/profile/Utkarsh-Mehta-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ansh Goel",
                "href": "/profile/Ansh-Goel-11"
            },
            "answer_text": "Well,it provides you various ways to be desirable 1)you could get some good fitness instructors,work out and get ripped,flaunt your body in well fitted clothes and be attractive. 2)You could purchase a high end car The thing is,it helps in making you desirable. But unless you are in a strip club,it is just a means to an end. You can use it to be attractive,but just money won't get you anywhere. ",
            "date": "Answered April 26, 2017",
            "views": "12",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Utkarsh Mehta",
                    "user_href": "/profile/Utkarsh-Mehta-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jose Elias Enriquez Hernandez",
                "href": "/profile/Jose-Elias-Enriquez-Hernandez"
            },
            "answer_text": "Yes and no. Money can make you look attractive because with money you can buy things like hair conditioner, hair wax, makeup, body lotions, etc. But the fact of having a big bank account doesn't make you attractive. Also you don't need a lot of money to buy the things I just mentioned. It's just about knowing what to buy. I could help you if you want. ",
            "date": "Answered September 25, 2019",
            "views": "214",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Najam Mahmood",
                "href": "/profile/Najam-Mahmood-1"
            },
            "answer_text": "Money only makes you bigger of who you already are. If you an asshole, you will be a bigger asshole. If you are very loving, caring, passionate person, you will be a bigger loving, caring and passionate person. When you have money, you dress well and take good care of yourself. It does add lots to your personality ",
            "date": "Answered August 12, 2017",
            "views": "604",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ion Bara",
                    "user_href": "/profile/Ion-Bara"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Agarwal",
                "href": "/profile/Chris-Agarwal-1"
            },
            "answer_text": "People who are attracted to you for your money will be fakesYes people will be jealous looking at your life style etc as they want a part of it too.Money makes you look good as in you can stay well groomed, afford high end cars, keep servants, live in a big house, party every night etc.Money makes you look attractive as the basic human notion of a good life is to be rich..Cheers.. ",
            "date": "Answered April 27, 2017",
            "views": "11",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Thuy Thu",
                    "user_href": "/profile/Thuy-Thu-20"
                },
                {
                    "user_id": "Utkarsh Mehta",
                    "user_href": "/profile/Utkarsh-Mehta-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aashish",
                "href": "/profile/Aashish-33"
            },
            "answer_text": "yes it does, guess whos this guy,  ",
            "date": "Answered June 27, 2016",
            "views": "464",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "DURGA PRASAD",
                    "user_href": "/profile/DURGA-PRASAD-2755"
                },
                {
                    "user_id": "Tony Martial",
                    "user_href": "/profile/Tony-Martial-3"
                },
                {
                    "user_id": "Abhinay Yadav",
                    "user_href": "/profile/Abhinay-Yadav-93"
                },
                {
                    "user_id": "Mayank Kumar",
                    "user_href": "/profile/Mayank-Kumar-1427"
                }
            ]
        },
        {
            "author_info": {
                "name": "Padmavati Mhatre",
                "href": "/profile/Padmavati-Mhatre"
            },
            "answer_text": "By money one can buy beauty products which make them look beautiful temporary that also to some extent only. But one's inner qualities make one look look more beautiful and it is permanent too. It is true, healthy food, mental and physical health keep one all time beauty. ",
            "date": "Answered February 7, 2020",
            "views": "120",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ramanuj Chattopahyay",
                "href": "/profile/Ramanuj-Chattopahyay"
            },
            "answer_text": "If only he invests his money in self grooming. And this not only includes his appearance but also his way of speaking, grasp over matters and so on... ",
            "date": "Answered July 6, 2016",
            "views": "554",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Karthick josh",
                    "user_href": "/profile/Karthick-josh-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ronak Kabra",
                "href": "/profile/Ronak-Kabra-6"
            },
            "answer_text": "Of course. Money changes a lot of things. Maybe you have a golden heart but nobody will take you seriously if you're broke. Even if you have the greatest philosophy. So, remember to earn well. ",
            "date": "Answered March 4, 2018",
            "views": "356",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Luke Singson",
                "href": "/profile/Luke-Singson"
            },
            "answer_text": "Imagine a girl with breast implants and thick hips. Does that woman entice you? Well that woman is made entirely out of money. So well hope that answers your question. ",
            "date": "Answered May 19, 2017",
            "views": "134",
            "upvotes": " Answer requested by Utkarsh Mehta"
        },
        {
            "author_info": {
                "name": "S.Vijay Kumar",
                "href": "/profile/S-Vijay-Kumar-12"
            },
            "answer_text": "https://3.bp.blogspot.com/-i66XruwyTrE/VxY2Ql43nvI/AAAAAAAAAoc/A-ondLPhZB8F66JwVRYWXHUAPBStbxqmwCLcB/s320/Bison%2BYes.gif ",
            "date": "Answered August 12, 2017",
            "views": "742",
            "upvotes": "0"
        }
    ]
}