{
    "title": "Can you be extremely politically centrist? - Quora",
    "tags": [
        "Centrist Politics",
        "Extremism",
        "Democratic Party vs. Republican Party",
        "Republican Party (US politics)",
        "Democratic Party (US politics)",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stefan Cuevas",
                "href": "/profile/Stefan-Cuevas"
            },
            "answer_text": "Most definitely. Argument to moderation is an informal fallacy. For example, lets try a thought experiment. Lets say that one group believes that the state should enslave all people with the letter “c” in their name. Another group believes that nobody should be enslaved. A position in the center would be that we should enslave some number of people with the letter “c” in their name, but not all. Is that an ethical position for one to have? Sometimes moderation/centrism is necessary, but we must determine that on a case to case basis. Often a good position is somewhere in between two contrary positions, but there are cases where an explicit binary does exist. Another thing to consider is that often the good position is not exactly fair to both sides. It can be biased toward one or the other, while making a few (rather than equal) concessions. ",
            "date": "Answered August 16, 2016",
            "views": "430",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sam Pines",
                    "user_href": "/profile/Sam-Pines"
                },
                {
                    "user_id": "Yaw Ap",
                    "user_href": "/profile/Yaw-Ap"
                }
            ]
        },
        {
            "author_info": {
                "name": "Francis Dickinson",
                "href": "/profile/Francis-Dickinson"
            },
            "answer_text": "Yes - much of the press is. Rather than try to work out what reality is you just listen to the politicians and say they both lie as much as each other and the truth is in the middle. ",
            "date": "Answered August 16, 2016",
            "views": "140",
            "upvotes": "0"
        }
    ]
}