{
    "title": "Can science operate effectively outside of academia? - Quora",
    "tags": [
        "Academia"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kip Wheeler",
                "href": "/profile/Kip-Wheeler-1"
            },
            "answer_text": "Do you mean “science” in the sense of the scientific method? If so, definitely. Anyone with training can set up experiments to prove or disprove a hypothesis, though building your own CERN reactor or HADRON collider in your backyard might be a challenge. Do you mean “science” in the sense of a bureaucracy of researchers cooperating to run laboratories? Yes, but with some problems and redundancies. Businesses often pay for various types of research, but it’s usually research specifically on product development rather than general advancement of knowledge. Businesses pay for practical application of science. They usually don’t want to pay for knowledge that has abstract or theoretical value, so they aren’t likely to spend much time helping biologists study the mating behavior of cichlids in the Amazon, even if those studies are invaluable for figuring out the aquatic ecosystem there. The other problem is businesses (such as tobacco companies in the 1950s and 1960s) may have financial conflict of interest if researchers dig up findings that show their products are dangerous. Another possibility for science outside of academia might be nation-states. Governments also can provide grants for research, but again, political pressures can end up distorting, eliding, or erasing scientific knowledge if politicians with an ax to grind were to pull stunts such as in North Carolina, where the state government passed a law a few years back making it illegal to consult climatologists about rising ocean levels affecting property values on its coastal regions or to fund climate change research. Similarly, governmental control of Russia’s science in the 1920s up through 1964 led to the agricultural fooleries of Lysynko (see Lysenkoism - Wikipedia), in which starvation and famine resulted because the Communist party rejected the concept of a gene and heredity in favor of the crackpot idea you could use psychological principles to “train” crops to grow better. So, private businesses and state control both have a spotty record of supporting honest science. Sometimes they do, sometimes they don’t. Right now, academia tends to be the hotbed of science because of certain advantages: Academia can use student tuition (or endowments) as a potential source of funds to support research.Academia an environment conducive to experimentation, and it provides “on the job” training for future researchers on site.It can provide tenure to give professors the independence to pursue knowledge even if that knowledge is unpopular, or impractical, and that tenure can provide the stability for truly long-term, multi-decade projects rather than worrying about investor reactions the next financial quarter.Universities already have multiple international networks set up to encourage cooperation between different institutions, so astronomers in Australia and in Austria (for example) could coordinate use of telescopes in two hemispheres and share data. Because these networks are international, it makes it harder for one government or political group to squash findings it doesn’t like.Universities already have traditions of storing information in publicly available libraries, which makes scientific comparison much easier than it would be in private companies that keep their knowledge as trade secrets rather than share it with competitors.For a scientific bureaucracy to operate effectively outside of academia, it would need to replicate those advantages in some way. For instance, I could imagine consortiums that relied on public donations that then funded research labs, libraries, and so forth. The trick would be getting the average Joe or Jane Citizen to regularly contribute money each year rather than spending that cash on Superbowl tickets. You would also need to come up with a good way to maintain a double-blind peer review system. Right now, academic scholars can run that system because of their long tradition of passing out those editorial tasks among themselves, assuming that the task of reading anonymous submissions and evaluating them is simply an unpaid part of their jobs as professors. You would need to create some equivalent to tenure, so that professors would be less likely to buckle under political pressure or succumb to the lure of filthy lucre to distort their findings. You would need to recreate a multi-national system for various regional labs and libraries to cooperate. (That seems a bit redundant—it took us 600 years to build the current network in academia!) You would need to make some way to force private labs to share their research with their competitors rather than keep it as trade secrets. If you manage all that, science would work just as effectively outside academia as it does within it. ",
            "date": "Updated December 1, 2018",
            "views": "214",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thomas Knowles",
                    "user_href": "/profile/Thomas-Knowles-6"
                },
                {
                    "user_id": "Sonia Fanucchi",
                    "user_href": "/profile/Sonia-Fanucchi"
                },
                {
                    "user_id": "Holly Root-Gutteridge",
                    "user_href": "/profile/Holly-Root-Gutteridge"
                },
                {
                    "user_id": "Stewart Alsop",
                    "user_href": "/profile/Stewart-Alsop-1"
                },
                {
                    "user_id": "Segolene Baraine",
                    "user_href": "/profile/Segolene-Baraine-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marco Fuxa",
                "href": "/profile/Marco-Fuxa-1"
            },
            "answer_text": "When science operates outside of accademia its called technology. Academic science resides by its very nature, somewhere between the philosophical and the abstract. When it becomes infinitesimally transcendental its no longer science but religion. Technology is applied science. In so far as technology appearing nebulous, that is mostly an artifact of IP protection strategies, and the verbal and written illiteracy of those devising the documentation. Industry is mostly the commercial exploitation of military research. Absolutely everything contained in a Smart Phone or PC was born of military research. Science is mostly an incestuous affair. Academia, Military Research and Industry exclusively fornicate in the same circles. And yeah- that’s my story and I am sticking to it. Thanks for the ask, always a pleasure. ",
            "date": "Answered November 19, 2018",
            "views": "214",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Marco Venti",
                    "user_href": "/profile/Marco-Venti"
                },
                {
                    "user_id": "Segolene Baraine",
                    "user_href": "/profile/Segolene-Baraine-2"
                },
                {
                    "user_id": "Stan Hanks",
                    "user_href": "/profile/Stan-Hanks"
                },
                {
                    "user_id": "Amith",
                    "user_href": "/profile/Amith-33"
                },
                {
                    "user_id": "Charles Tips",
                    "user_href": "/profile/Charles-Tips"
                },
                {
                    "user_id": "Stewart Alsop",
                    "user_href": "/profile/Stewart-Alsop-1"
                }
            ]
        }
    ]
}