{
    "title": "Can a person who can predict the future of a person see their own future? - Quora",
    "tags": [
        "Fortune-Telling",
        "Predictions (astrology)",
        "Jyotish (Vedic astrology)",
        "Astrology",
        "Hypothetical Scenarios",
        "Psychology of Everyday Life",
        "Philosophy of Everyday Life",
        "Human Behavior",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bala Krishnan Siva",
                "href": "/profile/Bala-Krishnan-Siva"
            },
            "answer_text": "Not that it is impossible, but generally not possible! Why? Due to metaphysical ignorance, nescience-agnyana-अज्ञान? Why judges do not take up those cases wherein their relations are A1, A2 etc? Why Surgeons refrain from conducting surgery for their own kith and kin? Why Arjun got confused and start trembling in his trousers in the Kurukshetra battlefield on seeing his preceptors and Gurus in the opposite camp? Do not quote exception in political legacy, wherein those who are dead against Varnashrama Dharma, follow strictly the same dharma to see that their sons/daughters/in-laws become their successor as CM/PM, ministers, MLAs, MPs! So to in Astrology too! In analysing a chart, the shadbala, trikona bala, pinda sodana, Budha bala both as benefic and malefic from the perspective of 12 bhavas, the ashtaga varga, graha avastha, dasa bhukti antara in progress, the sub lords, the then current transit, the Sudarsana chakra etc; -all these factors go automatically in the mind of the astrologer once a chart is given to him. So he will grasp the mathematical aspects of the whole chart generating the essence of the chart, say that it is the chemistry of the chart and proceed to interpret on the basis of various texts which are contradictory in nature. What is seemingly contradictory is to cohered and synchronised to bring out the underlying message-what the chart foretells about the future or any given query. In the entire process, the astrologer is not to be influenced by any issue-the one who is consulting him, his background, be it physique, educational,wealth, political, legal, gender, social, geographical, ethnic, religion, caste, language etc; but act like a photographer to see what is reflected in the chart. He may give a photographic touchings, editing, even animating only to deliver with pleasant flavour. Is it possible of a chart of some one so dear to him or himself wherein he stands so detached to analyse objectively without an iota of tinge of emotions? This is the moot issue! When Yogas- subha and asubha are analyses, both can be rationalised in such a way tha they can be interpreted either way-positively and negatively. The plus will look like plus and the minus too are justified as plus in a round about way due to the astrologer’s clouded anxiety ridden mind. Astrologer aster all for all practical purposes is just an astrologer like any other common man led by his hedonistic principle. He is not a nishkamya karma yogi! Again Sahadevan is an exception to prove this rule!! So astrologers are not hypocritical nor suffer from any mathematical illusions. With their own, they tend to become self deceptive, a form of bad faith, a faith of a girl who somehow believes the known boy systematically making calculate advances towards her! ",
            "date": "Answered July 2, 2020",
            "views": "95",
            "upvotes": " Answer requested by Kamal Kishore Pandey",
            "upvoters": [
                {
                    "user_id": "Vajja Sindhuja",
                    "user_href": "/profile/Vajja-Sindhuja"
                },
                {
                    "user_id": "Sridevi Tangirala",
                    "user_href": "/profile/Sridevi-Tangirala-2"
                },
                {
                    "user_id": "Rohit Gupta",
                    "user_href": "/profile/Rohit-Gupta-2645"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tangirala Venkata Satya Kumar",
                "href": "/profile/Tangirala-Venkata-Satya-Kumar"
            },
            "answer_text": "Generally, everyone is keen in knowing their future, and anything that has the promise of revealing the secret, and when one has access to such a promise will surely try. Astrology offers such a promise and the interest to know about the future creates the passion to study Astrology. I learnt Astrology to read my future and also to predict every event in the world. So, as a student anything that was learnt, the first application was on my own chart. And before I began to read others chart, I was very clear about my own chart and what's in store for me in future. So, no more surprises in life, but Astrology is a boon for me. It has helped me in knowing the weaknesses in my nature and the effort now is to improve in such areas. Astrology for me, now, is more of a tool for Self Realisation than a predictive tool and an extraordinary noble study. ",
            "date": "Answered July 2, 2020",
            "views": "245",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Thomas Colligan",
                    "user_href": "/profile/Thomas-Colligan-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Manish Paliwal",
                "href": "/profile/Manish-Paliwal-86"
            },
            "answer_text": "Yes to some extent, but it seems you have a thinking that a person who predicts knows about everything. There is a limit to what a person can predict.No palmist or astrologer are god.Do your research before you take a reading as many will be fakes.Go by your own judgement, browse through blog or youtube channel of people who you want to take the reading from.No body is saying a reading is a must.There is always scope for errors in a reading.Its generally thought a person who can predict once may be right he next time as well. Thats not true.Look for realistic kind of palmist not a boasting type or one who says they have all solutions to your problem.",
            "date": "Answered July 2, 2020",
            "views": "104",
            "upvotes": " Answer requested by Kamal Kishore Pandey",
            "upvoters": [
                {
                    "user_id": "Parccham Kansal (परचम कंसल)",
                    "user_href": "/profile/Parccham-Kansal-परचम-कंसल"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sreeram Srinivas",
                "href": "/profile/Sreeram-Srinivas"
            },
            "answer_text": "No medical doctor performs surgery on himself !!He will seek help from his most trusted colleagues or friends to perform the surgery on himSimilarly no learned astro, while he analyzes his own chart, still seeks his circle of friends to predict all that is bad-baddest-worst as possible.Example: A astro friend was worried for he was runnnig then all negative transits, dasha was also death inflicting possibility, his health also added some fear into his mind, he kept repeating it everytime we discussed a topic. So one day, took time to do full analysis & gave a feedback, he will live for many more years. This was some 10 years ago. He is still fit & fine.He was running: (cannot give more details due to confidentiality)sade-sati (7.5 years of transit saturn over Natal Moon)2nd cyle of sade-satidasha of 8HL & 3HL (both exalted)dasha of 8HL & 3HL (both exalted) - they are perfect marakas (killers - instant death, no hospital visits, no medical expenses, death in few seconds / minutes)unhealthy transits in 6H with LL connectionsAstama Shani (Astama - 8th axis, Shani - Saturn) with respect to Moon i.e. Moon-Saturn in 6–8 axis.Conclusion Learned astros assess the omnious combinations, seek their astro friends to do an independent assessment & discuss the outcome on the strength of the subject. ",
            "date": "Answered July 2, 2020",
            "views": "137",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Suzy McKee Charnas",
                "href": "/profile/Suzy-McKee-Charnas"
            },
            "answer_text": "No, I don’t think so. The future can be modeled (the models are always wrong to one degree or another, a science type friend tells me) or guessed about, but it doesn’t exist yet to be predicted, and a bout of Covid-19 or a miscalculation on a stairway or a tainted chicken salad or an outbreak of fighting can always shift the path ahead. ",
            "date": "Answered July 4, 2020",
            "views": "55",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Sadamarshi",
                "href": "/profile/Sadamarshi"
            },
            "answer_text": "If you ask honestly, he can predict to an extent. why to an extent only means, most of the people(if not all), there is always a element of bias will be there, when they are checking their own horoscope , because of that bias, predictions won’t be accurate most of cases. ",
            "date": "Answered July 2, 2020",
            "views": "33",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Bilal El Amin",
                "href": "/profile/Bilal-El-Amin"
            },
            "answer_text": "Yes Kamal, but what is required in any predictive issue, is the consideration of a multitude of chart factors. Most astrologers would only give that much attention to the charts of others. Where their service is more universal rather than personal. Those who have made a career of the Sacred Science, will have very little time for this self evaluation until some personal matter in the astrologers life needs expression then they will expend the efforts needed to make such prediction. ",
            "date": "Answered July 2, 2020",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anant Dev Asheesh",
                "href": "/profile/Anant-Dev-Asheesh"
            },
            "answer_text": "Ideally, it is told not to see ones own future or future of immediate family members. May be to avoid any stress. But, hardly anyone follows it. ",
            "date": "Answered July 2, 2020",
            "views": "19",
            "upvotes": " Answer requested by Kamal Kishore Pandey"
        },
        {
            "author_info": {
                "name": "Amee ShivRaam",
                "href": "/profile/Amee-ShivRaam"
            },
            "answer_text": "Hi, I will only talk about my experience here. I have been a Tarot card reader for last 10 years and for me I have read my cards in the past and it has worked. But now I do not need to read as I am so well connected that intuitions for myself flow easily. The only catch in reading cards for yourself would be you tend to get a bit biased. But it is not that you cannot read or predict for yourself. Thank you. ",
            "date": "Answered July 4, 2020",
            "views": "51",
            "upvotes": " Answer requested by Kamal Kishore Pandey"
        }
    ]
}