{
    "title": "Can you be an anarchist if you believe in God? - Quora",
    "tags": [
        "Anarchism",
        "Christian Beliefs",
        "Belief and Beliefs",
        "God"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tyler Johns",
                "href": "/profile/Tyler-Johns-4"
            },
            "answer_text": "Can you be an anarchist if you believe in God? I think that this is an interesting question. Anarchism is generally understood to be rooted in the rejection of hierarchical power dynamics. A god figure, as generally understood, implies a hierarchy, with the god being placed above humans. This logically makes theism and anarchism conflict. After all, the slogan is “no gods, no masters”. However, where it gets interesting is that this dynamic could be used as a justification for anarchism. The argument that I have heard theistic anarchists use is that we are all equal in the eyes of God. Therefore, no individual should be able to accumulate power over others. While there is still an internalized hierarchy of god over humanity, a person using this line of reasoning can still reasonably be called an anarchist. There may be the possibility of this person claiming to act on God’s behalf if they begin to impose their will on others, though viewing oneself as simultaneously being equal to others in the eyes of God and as an agent of God’s will seems contradictory. ",
            "date": "Answered July 15, 2020",
            "views": "108",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Storm T. Agora",
                "href": "/profile/Storm-T-Agora"
            },
            "answer_text": "That depends. If you come to anarchy via logic and morality, then clearly not as the god concept is at best absurd, and at worst just logically impossible. However if you come to anarchism via political philosophy, AND you exclude the impossible “god” entity from the set of moral agents (meaning that it would not be morally accountable for its actions) then yes the two are sort of compatible. Also if you limit your view to “this life” or “here on earth” or some other arbitrary limitation, yes you can be an anarchist for “this life” or “here on earth” but then allow for a totalitarian and draconian ruler for the “other realm.” ",
            "date": "Answered June 17, 2017",
            "views": "571",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jona max",
                    "user_href": "/profile/Jona-max"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Puka",
                "href": "/profile/Bill-Puka"
            },
            "answer_text": "Sure. Anarchists shouldn’t be doctrinaire and there have also been actual Christian anarchists for decades, perhaps centuries. Here you have a main choice between saying anarchy for earth monarchy of the cosmos or God’s an anarchist. You can see this by the fact that he doesn’t intervene in human affairs despite theist fantasies of his doing so. Do your thing, suffer your agonies. But do it on your own. I’m here to listen, provide moral support, but that’s about it. This second choice seems more anarchist. Why an all knowing and perfect being would set up a kingdom is passing strange. What, he’s stuck in the middle ages? He’s not powerful enough to avoid bossing people around? ",
            "date": "Answered April 27, 2020",
            "views": "122",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ebru Aydin",
                "href": "/profile/Ebru-Aydin-1"
            },
            "answer_text": "I think so. Anarchism in it’s essence is based on rejecting the abuse of a person by another. Anarchists are characteristically those people who can not bear the fact of a person uses violence on another; this leads anarchists to search for an “arch”less society. As God Almighty is not an human being but the creator of everything I see no reason to not be able to be an anarchist while being a believer. I myself am. ",
            "date": "Answered June 17, 2017",
            "views": "213",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jona max",
                    "user_href": "/profile/Jona-max"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Sheldon",
                "href": "/profile/Andrew-Sheldon-3"
            },
            "answer_text": "Several points: Never underestimate the ability of people to bullshit themselves.Even seemingly honest people can be anarchist with whatever underlying values. Underlying values just need to be left ambivalent, unquestioned or repressed.Anarchism can be ‘fundamentally” as mystically founded as religion. For the left its the ‘unquestioned desire for equality’ and for anarchocapitalists, its the non aggression principle (NAP). Seems sensible, but dogmatically espoused.",
            "date": "Answered June 17, 2017",
            "views": "380",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gustavo Ferreira",
                    "user_href": "/profile/Gustavo-Ferreira-83"
                },
                {
                    "user_id": "Henry Solomon Crampton-Hays",
                    "user_href": "/profile/Henry-Solomon-Crampton-Hays"
                },
                {
                    "user_id": "Jona max",
                    "user_href": "/profile/Jona-max"
                }
            ]
        },
        {
            "author_info": {
                "name": "Timothy Morley",
                "href": "/profile/Timothy-Morley-3"
            },
            "answer_text": "Yes, you can. I am, in fact. The most notable religious anarchism is probably the Christian anarchism of Leo Tolstoy, best summed up in his book The Kingdom of God is Within You. ",
            "date": "Answered June 17, 2017",
            "views": "232",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Donny Price",
                    "user_href": "/profile/Donny-Price-1"
                },
                {
                    "user_id": "Grant Boothe",
                    "user_href": "/profile/Grant-Boothe"
                },
                {
                    "user_id": "Rob Phillipps",
                    "user_href": "/profile/Rob-Phillipps"
                },
                {
                    "user_id": "William Goff",
                    "user_href": "/profile/William-Goff-9"
                },
                {
                    "user_id": "Samuel Vela",
                    "user_href": "/profile/Samuel-Vela-2"
                },
                {
                    "user_id": "Grant Hartlage",
                    "user_href": "/profile/Grant-Hartlage-1"
                },
                {
                    "user_id": "Jona max",
                    "user_href": "/profile/Jona-max"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carter Fortenberry",
                "href": "/profile/Carter-Fortenberry"
            },
            "answer_text": "Of course! Christian anarchism is the most notable form of religious anarchism. Included in most, if not all, other forms anarchism is the freedom to believe as you please. If you believe that no man is fit to rule and that God is the only master, that's perfectly compatible with anarchism. ",
            "date": "Answered June 17, 2017",
            "views": "245",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jona max",
                    "user_href": "/profile/Jona-max"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Kupperberg",
                "href": "/profile/Michael-Kupperberg"
            },
            "answer_text": "Atoms and electrons move in a totally anarchic manner, creating the world, universe, we live in. Thereby creating perfect order. Since perfect order is synonymous with God, total anarchy equals God. If you like the equation the answer is yes, if it does not work for you, then you still have a question that needs a different answer, but the answer remains, at least, possibly, Yes. ",
            "date": "Answered June 17, 2017",
            "views": "305",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jona max",
                    "user_href": "/profile/Jona-max"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jason Byrne",
                "href": "/profile/Jason-Byrne-3"
            },
            "answer_text": "Yes. See Leo Tolstoy and Christian anarchism as two of many examples. ",
            "date": "Answered June 17, 2017",
            "views": "307",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Boris Emeria",
                    "user_href": "/profile/Boris-Emeria"
                },
                {
                    "user_id": "Andrew James",
                    "user_href": "/profile/Andrew-James-249"
                },
                {
                    "user_id": "Grant Hartlage",
                    "user_href": "/profile/Grant-Hartlage-1"
                },
                {
                    "user_id": "Stefan Cuevas",
                    "user_href": "/profile/Stefan-Cuevas"
                },
                {
                    "user_id": "Jona max",
                    "user_href": "/profile/Jona-max"
                }
            ]
        }
    ]
}