{
    "title": "Can you differentiate between belief and beliefs? - Quora",
    "tags": [
        "Belief and Beliefs",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Josh Cresent",
                "href": "/profile/Josh-Cresent-1"
            },
            "answer_text": "Believe is an emotional and moral values judgement based on personalised experience and perception in nature that is uniquely real and true exclusively to the individual, and not so to other people to a certain degree. At home, your parents and caretaker will teach you what is “right\" and “good” according to his or her ways, it might be in an form of personal experience, culture or traditions that represents the Identity of your distinct family unit, it's up to you to from time and time again to adopt that as your personal Belief or decide to discard the belief if you perceive another conflicting idea and beliefs to be superior or preferential to your lifestyle. For example if you are in an democratic country where the Government does not control what you can think or cannot think, what you can say and what you cannot say, then you have the “limited freedom” to believe whatever you want to believe in, however the Government too have the same freedom as you and have more and unequal power to persuade and convince you through social psychology and the media to vote for him, her and whatever party. If you are convinced and believe that XYZ Government and it's ideology is “good” or “right”, then you believe based on trust and limited evidence to vote for XYZ. Similar to an Socialist communist country where what could be thought, teach, write and say are dictatored by the ruling central government, your belief are molded more forcefully then the Democratic Government, ultimately both Government achieve their outcome because your beliefs and thoughts are subservient to whatever the ruling Government (Essentially dictate via the Constitution and Law that contains the belief and thought system) which regulates what is right and wrong in the form of: Education control: What is legally allowed be taught in schools and what is banned contentPublic opinion control: What kind of history, information and content is allowed for public viewership to the benefit of the ruling power.Legal and punitive control: Use the criminal law to punish “unaccredited” and “unlawful” citizens that have ideas, views and practices that does not conform to approved boundaries.E.g. Practice of natural medicine was outlawed in the 1800s and monopolized the pharmaceutical industry Regenerative medicine technology are banned and labelled as pseudoscience for economic control and profit. Cancer research are restricted to carcinogenic treatment of chemotherapy which kills their tumour and cause you to have increase 60% teriary risk of cancer relapse instead of widely available treatments information suppressed for economic control and profit from insurance and pharmaceutical corporations. OPEC collaborate with governments to regulate and inflate oil prices 10–100 times from 6cents/barrel to $1/barrel to profit from the consumer people. 4. Media and expert institutional opinion control: Whatever is not mainstream and allowed to be taught or practiced in the education system is regarded as pseudoscience. When an pseudoscientist or practioners of non-mainstream allowed skill and knowledge have been detected by the government, the Government will resort to legal “seize to desist” measures, lawsuits, secret agent hidden buyover technology contracts or secret agent raids to steal your property and content. The media will spread fake news and start and disinformation campaign to discret your credentials as pseudoscience and block industries from hiring you by destroying your reputation via lies and false reports. Search information on internet SEO platforms will be censored, deleted and hidden secretly to conceal evidence and guide you to belief in whatever they want to present you as truth. Repeat the process throughout your wholelife, and you would believe whatever popular and socially accepted Norms are, which became part of your belief. Some people would coin that as indoctrination and indirect manipulation through the mainstream media, compulsory public education, slavery to 9–5 work under Capitalism system, etc. But beliefs are basically an it's an relationship between individuals to individuals, or individuals to an collective. People want to be socially accepted and validated by others to feel loved and part of the community, so as long as everyone thinks and belief the same, it is true enough to the person and to them. People will then habitually go through self-denial and tell themselves half-truths to stop thinking about the truth and simply belief whatever is fed to them and perceived as beneficially enough to make them feel safe, satisfied and happy. ",
            "date": "Answered April 14, 2020",
            "views": "71",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Maxim Korvatskyy",
                "href": "/profile/Maxim-Korvatskyy"
            },
            "answer_text": "a belief is a noun- a concept in your head, a belief in Santa Claus, GOD etc. is a concept. time is not involved, belief is general and exists as a snapshot When you uphold this concept, when you think about it as real for example is you Believing. an act. a measure of time is involved- you are believing right now You could believe in Santa for many years, but your Belief (concept) would be shattered by seeing one with pink beard, sneakers and paper hat. GOOGLE: Belief- an acceptance that something exists or is true, especially one without proof.\"his belief in extraterrestrial life\"2.trust, faith, or confidence in (someone or something).\"a belief in democratic politics\"Believe- accept that (something) is true, especially without proof.\"the superintendent believed Lancaster's story\"synonyms:be convinced by, trust, have confidence in, consider honest, consider truthful Morehold (something) as an opinion; think.\"I believe we've already met\"",
            "date": "Answered May 23, 2019",
            "views": "427",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Richard Garcia",
                    "user_href": "/profile/Richard-Garcia-57"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sam Sheykhet",
                "href": "/profile/Sam-Sheykhet"
            },
            "answer_text": "I believe that…. Ha, sorry had to make that pun. Anyway, to answer your question, the term believe is used based on one’s conclusions based on facts, opinions and information given to them. Beliefs on the other hand, are rather spiritual and/or faith. ",
            "date": "Answered April 14, 2020",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jessie Masalo McClain",
                "href": "/profile/Jessie-Masalo-McClain"
            },
            "answer_text": "in the in the sense of context believe would be something like I believe this happened while belief is like this is my belief although after saying all these things I'm not sure if I even said anything different but to believe is usually something an individual does well a belief is usually something other people do at least that's the way it sounds to me ",
            "date": "Answered April 30, 2019",
            "views": "29",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hugh Alcorn",
                "href": "/profile/Hugh-Alcorn"
            },
            "answer_text": "One believes in what their belief is. However, this is very different to saving faith in Christ. We can exercise faith in many things and mostly our faith will be misplaced. But those who have a real faith in Christ walk in His conscious presence. No religion can offer this. ",
            "date": "Answered August 2, 2019",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Hawley",
                "href": "/profile/David-Hawley-24"
            },
            "answer_text": "Belief is a noun, e.g. He has the strange belief that there is a wolf hiding in the woods. Believe is a verb e.g. I believe that there is a wolf hiding in the woods. ",
            "date": "Answered August 2, 2019",
            "views": "19",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Brigden",
                    "user_href": "/profile/David-Brigden-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ron Pleece",
                "href": "/profile/Ron-Pleece"
            },
            "answer_text": "be·lief Acceptance that a statement is true or that something exists, trust, faith, or confidence in someone or something. be·lieve Accept (something) as true; feel sure of the truth of, hold (something) as an opinion; think or suppose. ",
            "date": "Answered August 3, 2019",
            "views": "10",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Anderson",
                "href": "/profile/Michael-Anderson-950"
            },
            "answer_text": "Belief. Plural Beliefs noun an acceptance that something exists or is true, especially one without proof.trust, faith, or confidence in (someone or something)Believe. Third person present tense Believes verb accept that (something) is true, especially without proofhold (something) as an opinion; think",
            "date": "Answered May 1, 2019",
            "views": "76",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jo Garten",
                "href": "/profile/Jo-Garten"
            },
            "answer_text": "A belief is a noun, and refers to a constant conviction to a philosophy, thought or religion. Believe is a verb indicating you are convinced of something. ",
            "date": "Answered August 2, 2019",
            "views": "9",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Frank Pepper",
                "href": "/profile/Frank-Pepper-6"
            },
            "answer_text": "the v and the e ",
            "date": "Answered May 23, 2019",
            "views": "43",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Marcos Sheldon Padilla",
                    "user_href": "/profile/Marcos-Sheldon-Padilla"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vincent Reddy",
                "href": "/profile/Vincent-Reddy-2"
            },
            "answer_text": "Believe is a verb that means to accept something as truth. Belief is a noun that means to accept something as true. both words are about faith in other people , things or places the noun accepts true . The verb accepts truth ",
            "date": "Answered August 5, 2019",
            "views": "28",
            "upvotes": " Answer requested by Nelson Vidinha"
        },
        {
            "author_info": {
                "name": "Frank Shearin",
                "href": "/profile/Frank-Shearin"
            },
            "answer_text": "Yes. One is a noun, the other is a verb. ",
            "date": "Answered August 3, 2019",
            "views": "10",
            "upvotes": "0"
        }
    ]
}