{
    "title": "Can society exist without culture? - Quora",
    "tags": [
        "Existence",
        "Society"
    ],
    "response": [
        {
            "author_info": {
                "name": "Fritz Dufour",
                "href": "/profile/Fritz-Dufour"
            },
            "answer_text": "No. Society and Culture aren’t mutually exclusive. They’re linked to each other. Society is the building block or the foundation of culture and culture, the offspring of society, is what guarantees the perennity of society itself. To understand, consider the definition of both culture and society. Culture is a set of ideas, norms, and values that describes or characterizes a society. But how do members of a particular society acquire those? How do they form? The answer lies within the dynamics that prevail in a society. In other words, in the common characteristics shared by all societies: 1) Every society has families of some sort, but in some societies those families are small and in others they are large and multi-generational. Some societies are patriarchal (the male lineage is most important) and some are matriarchal (the female lineage is most important). 2) There are « haves » and « have-nots » in every society, but in some societies, there are vast discrepancies between the fabulously wealthy and the dirt-poor, and in others, the differences are not nearly as great. 3) Food and tools are produced and traded in all societies. 4) Every society has some form of religion. In some cases, this means strict laws enforced by powerful clerics whereas in other cases it means a free sense of spirituality with religious leaders who serve only as helpful guides. Culture is an age-old concept. If you go as far back as Ancient Greece or Ancient Rome, for example, you will learn that the reputation of a person was tethered to his/her city or society of origin, which in many cases, was used squarely as a last name, for example, Augustine of Hippo, Solon, the Athenian Lawmaker, etc. Socrates, for example, was accused by a jury of negatively influencing the youth of Athens (although he wrote nothing in his lifetime, as opposed to Plato or Aristotle). He chose death over exile because the latter would have stripped him of his Athenian citizenship, which he considered as an integral part of his identity and his culture. He wanted posterity to know and remember him as a Greek or an Athenian philosopher, not someone who ended up being assimilated by another culture while in exile. While today, we tend to put the emphasis on the individual, back then the city , society, or culture to which someone belonged was prioritized because it was what helped others to understand and respect him/her. For example, in the ancient Greek city of Sparta, heavy emphasis was placed on honor and military duty seen as the pinnacle of Spartan culture. According to one account, a mother had five sons who were sent to combat the enemy. After a few weeks, a messenger was sent to the city to give an update to the Spartans. The mother, instead of asking about her five sons, asked if Sparta won the war. Culture is what holds a society together. It’s sort of a reference point among the members of society. Without culture a “society” cannot be said to be a society yet. ",
            "date": "Updated September 16, 2019",
            "views": "7",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeizel Faye Aquino",
                    "user_href": "/profile/Jeizel-Faye-Aquino"
                },
                {
                    "user_id": "YRrEm DIVine",
                    "user_href": "/profile/YRrEm-DIVine"
                },
                {
                    "user_id": "RR Vila",
                    "user_href": "/profile/RR-Vila"
                },
                {
                    "user_id": "Mikhaela Joy Malaga",
                    "user_href": "/profile/Mikhaela-Joy-Malaga"
                },
                {
                    "user_id": "Liberty Joy Bautista",
                    "user_href": "/profile/Liberty-Joy-Bautista"
                },
                {
                    "user_id": "Missy Xevrine Reyes",
                    "user_href": "/profile/Missy-Xevrine-Reyes"
                },
                {
                    "user_id": "Jaiko Garcia",
                    "user_href": "/profile/Jaiko-Garcia"
                },
                {
                    "user_id": "Ian George le Fèvre",
                    "user_href": "/profile/Ian-George-le-Fèvre"
                },
                {
                    "user_id": "Johnzel Rexie Nuñez",
                    "user_href": "/profile/Johnzel-Rexie-Nuñez"
                },
                {
                    "user_id": "Vincent Enad",
                    "user_href": "/profile/Vincent-Enad"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jack Davies（デイビースジャック）",
                "href": "/profile/Jack-Davies-デイビースジャック"
            },
            "answer_text": "Not really. Culture describes the behaviours and customs of a society. You can’t anything that it isn’t an inanimate object that doesn’t have any behaviours whatsoever so any traits of a society that show it to “Not have a culture” will, in fact, be it’s culture. So for example, you cannot say that a society without any from of Art is not a culture because the lack of any Art would be part of their culture. for the other part “Customs” You can’t have a society without that either because customs are things that members of a society do. You cannot have a society where nothing happens, so even if a society of robots does everything the most pragmatic way at all times and only does whats needed, then they still have cultural customs, those customs being the pragmatic way of doing what needs to be done. ",
            "date": "Answered June 20, 2019",
            "views": "47",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ian George le Fèvre",
                    "user_href": "/profile/Ian-George-le-Fèvre"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andreas Klein",
                "href": "/profile/Andreas-Klein-4"
            },
            "answer_text": "It depends how one defines society ….. 1. the aggregate of people living together in a more or less ordered community. In this case, society is a by-product of culture and they could (theoretically) eliminate the culture which started it, as they grow wiser. 2. an organization or club formed for a particular purpose or activity. In the second case, the culture could be the by-product of the society. People come together to cooperate on some goal and remain together after they discover they have much more in common (subsequently they’ll call it the local “culture”) There are also many definition to “culture”. Some say it is like “education” some say “instruction” or “heritage” or “tradition” or even “religion”. I’m appaled so many writers are willing to answer this question, without discussing all the ambiguities of these words, let alone the changes these words exibit through history and geography. ",
            "date": "Answered January 11, 2020",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nick Curtis",
                "href": "/profile/Nick-Curtis-42"
            },
            "answer_text": "culture (n.) mid-15c., \"the tilling of land, act of preparing the earth for crops,\" from Latin cultura \"a cultivating, agriculture,\" figuratively \"care, culture, an honoring,\" from past participle stem of colere \"to tend, guard; to till, cultivate\" (see colony). Meaning \"the cultivation or rearing of a crop, act of promoting growth in plants\" (1620s) was transferred to fish, oysters, etc., by 1796, then to \"production of bacteria or other microorganisms in a suitable environment\" (1880), then \"product of such a culture\" (1884). The figurative sense of \"cultivation through education, systematic improvement and refinement of the mind\" is attested by c. 1500; Century Dictionary writes that it was, \"Not common before the nineteenth century, except with strong consciousness of the metaphor involved, though used in Latin by Cicero.\" Meaning \"learning and taste, the intellectual side of civilization\" is by 1805; the closely related sense of \"\" is by 1867. Taking the most recent shading of the word—collective customs and achievements of a people, a particular form of collective intellectual development—a society which exists without a culture has no history nor customs nor laws; in other words, a society without culture is anarchy. ",
            "date": "Answered June 18, 2019",
            "views": "24",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ian George le Fèvre",
                    "user_href": "/profile/Ian-George-le-Fèvre"
                },
                {
                    "user_id": "Saul Carreter",
                    "user_href": "/profile/Saul-Carreter"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Siskind",
                "href": "/profile/Richard-Siskind"
            },
            "answer_text": "Even a society of robots or ants would have a culture. Any member who did not fit in with the general flow of business would be disruptive and naturally excluded/marginalized. The norms would be different between different colonies (unless the participants and environments were inflexible and identical). Otherwise all possible variations of cooperative behavior might eventually emerge organically in different colonies. On the other hand A society could operate with uncoordinated/unstandardized behavior among relatively chaotic individuals if they could proceed about their business without any knowledge or feedback from the other members of the society… or some variation on that. ",
            "date": "Updated October 17, 2020",
            "views": "19",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Uto Tin",
                    "user_href": "/profile/Uto-Tin"
                },
                {
                    "user_id": "Ian George le Fèvre",
                    "user_href": "/profile/Ian-George-le-Fèvre"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jack Raymond Borden",
                "href": "/profile/Jack-Raymond-Borden-1"
            },
            "answer_text": "A culture is a collection of ideas, behaviors, and norms that society practices. It is impossible for a society to exist without a culture because a culture naturally arises from a group of people. The only way for a culture to not exist is for people to not exist, and if people don’t exist then society doesn’t exist. ",
            "date": "Answered July 28, 2019",
            "views": "92",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "John Jay Lord Jara",
                    "user_href": "/profile/John-Jay-Lord-Jara"
                },
                {
                    "user_id": "Amy Khan",
                    "user_href": "/profile/Amy-Khan-56"
                },
                {
                    "user_id": "Ian George le Fèvre",
                    "user_href": "/profile/Ian-George-le-Fèvre"
                },
                {
                    "user_id": "Bojana Vuković",
                    "user_href": "/profile/Bojana-Vuković"
                },
                {
                    "user_id": "Arch Geof",
                    "user_href": "/profile/Arch-Geof"
                },
                {
                    "user_id": "Dwaipayan Sarkar",
                    "user_href": "/profile/Dwaipayan-Sarkar-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Philip Atkinson",
                "href": "/profile/Philip-Atkinson-16"
            },
            "answer_text": "No. A Culture is the personality of the shared understanding that is a society.( see A simple definition of Community(Society) by P Atkinson (11-Mar-19) ) ",
            "date": "Answered October 31, 2019",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ian George le Fèvre",
                    "user_href": "/profile/Ian-George-le-Fèvre"
                }
            ]
        }
    ]
}