{
    "title": "Can anything in life truly be proven? - Quora",
    "tags": [
        "Self-Awareness Advice",
        "Self-Awareness",
        "Physics",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jason Thibodeau",
                "href": "/profile/Jason-Thibodeau-11"
            },
            "answer_text": "No. I think we must have a knowledge of truth in order to prove anything. I think the best we can achieve is a reasonable approximation of truth. We are limited creatures with limited awareness. Our senses and cognition did not evolve to \"prove facts\" but to interpret sensory input to optimally navigate and survive in our environment. We can use observation and testing to circumvent our faulty senses and fuzzy cognition to \"prove\" things within a reasonable range of error. Using scientific method we can build upon reliable results to take actions and construct machines with low risk of failure, such as relying on Newtonian physics to launch an aircraft. We know that there is more to physics than Newton was aware of, and today we have mysteries yet unsolved. This progression gives an impression that we will at some point \"understand it all\" and be able to \"prove everything\", but I believe this is not the case. I think our species has a scope and a limit of understanding that we cannot escape. I think we will face a horizon of knowing that will always recede as we approach it. Maybe we will become different, augmented creatures with the aid of massive computing and artificial intelligence, but even then, our tools are limited by our scope and limit.  It may be fine to say 2+2=4, but there are schemes of mathematics that could be implemented that might bag you 2+2=5. Godel has his incompleteness theorem, I don't claim to follow how he gets there but I get the idea, that there are relations between natural numbers that are true but unprovable. That doesn't \" prove\" that nothing is provable, but I wanted to point out that even mathematics and science are not complete. I think we can reasonably prove many things, but I'm not convinced we can absolutely prove anything at all. ",
            "date": "Answered September 3, 2015",
            "views": "896",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anthony Francia",
                    "user_href": "/profile/Anthony-Francia"
                },
                {
                    "user_id": "John Dalton",
                    "user_href": "/profile/John-Dalton-31"
                }
            ]
        },
        {
            "author_info": {
                "name": "Forrest Macgregor",
                "href": "/profile/Forrest-Macgregor-1"
            },
            "answer_text": "Decartes suggested that the only one he could come up with was \"I think, therefore I am.\" He tried to build a unified knowledge framework based on that.    It seems that the smaller we can see things, the more mysterious they become.   We have to constantly invent words to describe the actions and impacts of the particles and forces that make up the matter and energy in the world.  All of the basic concepts get closer to philosophy than reality the farther down we burrow.    At the other end of the scale, we see enormity that can stop your heart if you consider its magnitude and your own irrelevance.  I mean... you can drive to LA in a week from New York at  70 MPH.  But can you really get your hands around the fact that you would need a 100,000 earth years (5.2 million earth weeks)  to reach the other side of the galaxy where you now live and read this?  Travelling at the speed of light.  Which would make your car trip across America take a few milliseconds.  Faster than you'd know you were dead if I shot you in the face with a cannon.   Faster than your consciousness can operate by a factor of 100.   You'd need a billion earth years to get across many galaxies.  You would need hundreds of lifetimes just to count the stars in this one, at 100s stars a second.   Search your soul for a word large enough to represent this truth.  You don't have it and never will.   Many quantities are defined in relationship to other quantities.  Circular definitions, if you will.  What is A?  A is not B.  What is B?  Not A.   Truth may have to always exist as probability.  It's the conundrum of truth.... you maybe can never find it, but you can draw ever more accurate borders around where it lurks. So is it absolute?  Maybe not. The speed of light in a vacuum seems to be close to absolute.  Beats the hell out of Descartes. Some mathematics seem to contain truth.... truth that's easily proven, but it's in relationship to other math concepts, not actual stuff.  (I got into a minor war with an ex girlfriend once when I told her that there are no straight lines in nature.... only in mental construct. )  A point is a concept you can grasp, but not demonstrate. A line segment is a two dimensional entity in an 13 dimensional universe.  But in mind-land, that line can be bisected.   The point can be imagined. Pi can exist.   That process is truth, even though the line is imaginary. This is the stuff of college sophomores discovering beer.  At some point you have to start constraining your questions better to get anything useful out of pondering them. You have to go through this.  It all seems so important.  It's a good exercise. In retrospect, after a long life, I would have spent more time chasing girls.  And that's the absolute truth. ",
            "date": "Answered April 23, 2015",
            "views": "12",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Doug Bell",
                    "user_href": "/profile/Doug-Bell-14"
                },
                {
                    "user_id": "Owen Lloyd",
                    "user_href": "/profile/Owen-Lloyd-2"
                },
                {
                    "user_id": "Rui Filipe Pedro",
                    "user_href": "/profile/Rui-Filipe-Pedro"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Nord",
                "href": "/profile/Eric-Nord-2"
            },
            "answer_text": "Probably not. I think it makes sense to consider the threshold of proving something absolutely. In this case, the \"absolute\" threshold tasks us with exhausting unknown limits. It would require all possible knowledge related to the question. We would need to prove another question first: Is knowledge exhaustible? But where I think it gets trickiest is in the categorical or binding aspect of the subject. When we talk about something in an \"absolute\" sense, how can we neatly isolate the subject in question? Let's take the classic Cartesian Cogito: How can we be sure what exactly the \"I\" is in \"I think therefore I am?\" The \"I\" part of the Cogito has assumptions behind it. It isn't bulletproof. We must settle for \"near certain\" rather than \"absolute.\" ",
            "date": "Answered April 22, 2015",
            "views": "745",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Danielle Rodgers",
                    "user_href": "/profile/Danielle-Rodgers-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aurora Clawson",
                "href": "/profile/Aurora-Clawson"
            },
            "answer_text": "Put your hand in a fire.  You can be pretty sure to get burned.   Drink water when you're thirsty, it will satisfy your thirst,  Don't breathe long enough and you'll die. Jump up and you'll come back down......There are about a million things you can be sure of.  When you're finished reading this, you will be sure you're at the end.  When you look in the mirror, you will see a reflection.  When you fall off a cliff, you can be sure you'll go down, not up.  When you put a knife in a socket, you can be sure you'll get shocked, ice will melt in heat, etc.  You can be sure of change.  You can be sure that you're not the only human on this planet.  You know for sure you have feelings, thoughts, beliefs, a physical body, a family of some sort, and a need to survive. You cannot be sure of what other sentient beings will do or say, or how your life will progress, or if you are interpreting it correctly.   There are a million things out of our control, mostly having to to with the unknown. These uncertainties are our teachers.  In dealing with them, we learn about ourselves. ",
            "date": "Answered April 17, 2014",
            "views": "12",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ashley Bradbury",
                    "user_href": "/profile/Ashley-Bradbury-1"
                },
                {
                    "user_id": "Deepanjali Khurana",
                    "user_href": "/profile/Deepanjali-Khurana"
                },
                {
                    "user_id": "Jagir Jhaveri",
                    "user_href": "/profile/Jagir-Jhaveri"
                },
                {
                    "user_id": "Anshul Sharma",
                    "user_href": "/profile/Anshul-Sharma-2"
                },
                {
                    "user_id": "Prajwal Gangadhar",
                    "user_href": "/profile/Prajwal-Gangadhar"
                },
                {
                    "user_id": "James Dreamy",
                    "user_href": "/profile/James-Dreamy"
                },
                {
                    "user_id": "Bhavesh Aggarwal",
                    "user_href": "/profile/Bhavesh-Aggarwal"
                },
                {
                    "user_id": "Jubin Katiyar",
                    "user_href": "/profile/Jubin-Katiyar"
                },
                {
                    "user_id": "Lucas Galbier",
                    "user_href": "/profile/Lucas-Galbier"
                },
                {
                    "user_id": "Laveena Bachani",
                    "user_href": "/profile/Laveena-Bachani"
                },
                {
                    "user_id": "Clifford Meyer",
                    "user_href": "/profile/Clifford-Meyer"
                },
                {
                    "user_id": "Pragati Srivastava",
                    "user_href": "/profile/Pragati-Srivastava-4"
                },
                {
                    "user_id": "Grant Golonka",
                    "user_href": "/profile/Grant-Golonka"
                },
                {
                    "user_id": "V E Chaitanya",
                    "user_href": "/profile/V-E-Chaitanya"
                },
                {
                    "user_id": "Joel V Benjamin",
                    "user_href": "/profile/Joel-V-Benjamin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ab",
                "href": "/profile/Ab-296"
            },
            "answer_text": "According to theoretical physics at least (quantum many worlds theory etc), the answer would be no. In a theoretical ten-dimensional omni-verse in which anything has existed, can exist, does exist, and/or will exist whether we've imagined it or not (infinity for eternity), anything could happen.  Doesn't even need to have been observed. True or false does not apply here, especially since it doesn't apply to light.  Light can be both particle and wave for example. Nothing is truly certain, we just keep filtering for the information we want and then put it all together to try and get a picture.  It's the best we can do. Sod's law that just when you find the Higgs Bosun for certain that you smash it and find yet more particles.  Or that you finally develop a means of measuring a planck in real-time and then discover that you can actually measure smaller measures of time.  Or that the the known universe enters entropy stage and energy is distributed completely evenly everywhere, and then a white hole suddenly appears and, oh, look, another one, and another, and then one of them turns into a big bang... ",
            "date": "Answered April 9, 2014",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shalva Quthelia",
                    "user_href": "/profile/Shalva-Quthelia-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Nicky-Nicky-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Justin Richards",
                "href": "/profile/Justin-Richards-10"
            },
            "answer_text": "When you walk down the path of solipsism the only available answer is that we cannot be certain of anything. Lots of answers to this question quote Descartes cogito (I think therefore I am), the cogito has been attacked on several fronts, including that we cannot be sure of the I, there are thoughts, that is it. I contend, however, that we cannot ever be certain that time passes, without assuming that time actually does pass we cannot look to the changes in the world or in our own minds to assure us of the reality of the appearing world. Go ahead, try to prove the passage of time without assuming a priori the passage of time - which means that you cannot appeal to causation. ",
            "date": "Answered April 21, 2014",
            "views": "479",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hadley Parum",
                    "user_href": "/profile/Hadley-Parum"
                },
                {
                    "user_id": "Joel V Benjamin",
                    "user_href": "/profile/Joel-V-Benjamin"
                },
                {
                    "user_id": "Sean Vikoren",
                    "user_href": "/profile/Sean-Vikoren-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Keinosuke Johan Miyanaga / 宮永 ヨハン 計之介",
                "href": "/profile/Keinosuke-Johan-Miyanaga-宮永-ヨハン-計之介"
            },
            "answer_text": "Definitions. Those we can be sure of, and we would be lost without them. There is an important distinction between definitions and descriptions that is often misunderstood. A description is what someone thinks of something. We cannot be certain of descriptions because, by their very nature, they are non-definitive. A definition is precisely what something is. We can be absolutely certain of definitions because, by their very virtue, they are definitive. Now, definitions are decided by humans, so they are man-made. Some are more constrained than others, and some are more refined than others. So definitions themselves can evolve and can be wrong. However, at any given time, we can still be certain of a definition regardless of its integrity or permanence. We can just look them up. Examples: Words and grammar are defined, mathematical axioms are defined, scientific axioms are defined, system specifications are defined, architecture is defined. By definition, what is physical defines what is real. Physics is what we do to hone in and identify physical definitions as defined by nature, not by us. But our representation is still abstract (mathematical symbols, grammar), and can never perfectly equal the natural representation.The natural representation is of course, non other than nature itself. Nature is neither more simple or more complex than it has to be. ",
            "date": "Updated April 19, 2014",
            "views": "769",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gerome Pistre",
                    "user_href": "/profile/Gerome-Pistre"
                },
                {
                    "user_id": "Fajar",
                    "user_href": "/profile/Fajar-3"
                },
                {
                    "user_id": "Kiran Kadav",
                    "user_href": "/profile/Kiran-Kadav"
                },
                {
                    "user_id": "Vivek R Musrif",
                    "user_href": "/profile/Vivek-R-Musrif"
                },
                {
                    "user_id": "Pratik Mundada",
                    "user_href": "/profile/Pratik-Mundada-4"
                },
                {
                    "user_id": "Joel V Benjamin",
                    "user_href": "/profile/Joel-V-Benjamin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Irade Alexi Helligar",
                "href": "/profile/Irade-Alexi-Helligar"
            },
            "answer_text": "You can be sure of your existence. From that first sure thing, the reality you experience emerges as an ever-changing flow of images. This flow is basically random change, and random change is the second sure thing. At certain scales a reliable probabilistic succession of images emerges. We call this reliable succession of images physics. By allowing us to predict the future and match expectations with future experience physics fulfills the predictive role of science. It is important to remember that the laws of science are contingent and only very good estimations. Self-aware people define a set of values and ethics for themselves. They intelligently use physics and ethical actions to reshape probabilities such that future experiences align with their values. As they master this practice, they become more sure of themselves. ",
            "date": "Answered March 18, 2015",
            "views": "786",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abigail Oehlsen",
                    "user_href": "/profile/Abigail-Oehlsen"
                },
                {
                    "user_id": "Aida Karabu",
                    "user_href": "/profile/Aida-Karabu"
                },
                {
                    "user_id": "Jamison Franzen",
                    "user_href": "/profile/Jamison-Franzen"
                },
                {
                    "user_id": "Jang Man",
                    "user_href": "/profile/Jang-Man"
                }
            ]
        },
        {
            "author_info": {
                "name": "Megan Hastings Watkins",
                "href": "/profile/Megan-Hastings-Watkins"
            },
            "answer_text": "After reading all these comments, you can be sure of being confused.  :) Many of the comments say something like, \"You can be sure that you can't be sure of anything,\" But those comments are self-contradictory, so by their own logic they prove themselves wrong.  Most of these comments imply one thing,  that reality is based on what we think reality is.  I, on the other hand, believe there is a true and absolute reality that is not affected by what we see, feel, or think.  I seek that reality everyday. That reality I am sure of. Seek REALITY, and it will reveal itself to you. ",
            "date": "Answered April 18, 2014",
            "views": "882",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Joel V Benjamin",
                    "user_href": "/profile/Joel-V-Benjamin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jamal Pollok",
                "href": "/profile/Jamal-Pollok"
            },
            "answer_text": "No. There is nothing we can be absolutely sure of. Or even remotely sure of. Even in the fields of logic, they're bound by our understanding of the universe. Maybe some kind of distorted reality exists where logic is skewered in a way we can't understand. It's impossible (and boring) to assume that anything we know is an absolute truth, but that doesn't mean that we can't live our lives on the assumptions of facts, simply in pursuit of happiness and understanding.    It's just a humbling thing to keep in mind as you do anything throughout the day, that there is no understandable meaning in the universe, and everything is just perception and linear thinking. ",
            "date": "Answered April 10, 2014",
            "views": "498",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gerhard Adam",
                "href": "/profile/Gerhard-Adam"
            },
            "answer_text": "Of course.  There are thousands of things each day that you're \"sure\" of.  That's what allows you to live in the world.  Even your posting this question was based on your being sure that the internet worked and your question would be seen. Now if your question is really aimed at establishing whether there's some \"objective reality\" that we can collapse down to some factual nugget ... well, that is purely subjective. ",
            "date": "Answered April 17, 2014",
            "views": "519",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Suren Gyana",
                "href": "/profile/Suren-Gyana"
            },
            "answer_text": "Death and Taxes ",
            "date": "Answered April 10, 2014",
            "views": "503",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vivek R Musrif",
                    "user_href": "/profile/Vivek-R-Musrif"
                },
                {
                    "user_id": "Andy Frimpong",
                    "user_href": "/profile/Andy-Frimpong"
                },
                {
                    "user_id": "Anders Erik Bjergvang",
                    "user_href": "/profile/Anders-Erik-Bjergvang"
                },
                {
                    "user_id": "Pouyan Khodabakhsh",
                    "user_href": "/profile/Pouyan-Khodabakhsh"
                },
                {
                    "user_id": "Adrian Ambardy",
                    "user_href": "/profile/Adrian-Ambardy"
                },
                {
                    "user_id": "Callie",
                    "user_href": "/profile/Callie-18"
                },
                {
                    "user_id": "Jamal Pollok",
                    "user_href": "/profile/Jamal-Pollok"
                },
                {
                    "user_id": "Riccardo Sven Risuleo",
                    "user_href": "/profile/Riccardo-Sven-Risuleo"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Nicky-Nicky-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael David Cobb Bowen",
                "href": "/profile/Michael-David-Cobb-Bowen"
            },
            "answer_text": "You can be sure that when you, a normal human being, see something that's blue, then I, a normal human being, am seeing the same blue. The odds against your ability to sense color evolving completely separate and differently from my ability to sense color are astronomical.  This goes for all human senses and perception, as well as mortality. If I smash your head, you will be dead. You will never meet a human being who is 100 feet tall. That thing will not be a human being.  Using this sort of logic about what humans are and can be can give us a great deal of certainty. ",
            "date": "Answered April 16, 2014",
            "views": "355",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Eric Hartmann",
                    "user_href": "/profile/Eric-Hartmann"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jubin Katiyar",
                "href": "/profile/Jubin-Katiyar"
            },
            "answer_text": "1 - we will die one day.2- after 4 million years, the fuel of our sun will no longer be there to produce energy, so sun will also die someday, along with our earth.3- after that supernova sun will turn into white dwarf.4- Lastly, after billions of year, our galaxy milky way will strike andromeda( our nearest galaxy)..etc etc. ",
            "date": "Answered April 22, 2014",
            "views": "222",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jordan Hill",
                    "user_href": "/profile/Jordan-Hill-122"
                },
                {
                    "user_id": "Swati Mishra",
                    "user_href": "/profile/Swati-Mishra-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Robert",
                "href": "/profile/Paul-Robert"
            },
            "answer_text": "\"I think, therefore I am\" seems pretty ironclad to me. I might turn out to be a brain in a jar, but that brain in a jar is still a thing that exists. ",
            "date": "Answered April 22, 2015",
            "views": "274",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chris Ward",
                    "user_href": "/profile/Chris-Ward-76"
                },
                {
                    "user_id": "Clare Celea",
                    "user_href": "/profile/Clare-Celea"
                },
                {
                    "user_id": "Jim Hagerty",
                    "user_href": "/profile/Jim-Hagerty"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Willard",
                "href": "/profile/Mark-Willard-1"
            },
            "answer_text": "'All descriptions of reality are temporary hypotheses.'Buddha ",
            "date": "Answered April 15, 2014",
            "views": "401",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lou Susi",
                    "user_href": "/profile/Lou-Susi"
                },
                {
                    "user_id": "Em Es",
                    "user_href": "/profile/Em-Es-47"
                },
                {
                    "user_id": "Madan Panathula",
                    "user_href": "/profile/Madan-Panathula"
                },
                {
                    "user_id": "Aditya Bhavaraju",
                    "user_href": "/profile/Aditya-Bhavaraju"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tony Miller",
                "href": "/profile/Tony-Miller-4"
            },
            "answer_text": "The Logical Absolutes are good candidates.  To deny them is to refute the very logic you would need to deny them. ",
            "date": "Answered April 9, 2014",
            "views": "538",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alain Leon",
                    "user_href": "/profile/Alain-Leon"
                },
                {
                    "user_id": "Johnnie Lockett",
                    "user_href": "/profile/Johnnie-Lockett"
                },
                {
                    "user_id": "Brett Roberts",
                    "user_href": "/profile/Brett-Roberts-8"
                },
                {
                    "user_id": "Ron Spencer",
                    "user_href": "/profile/Ron-Spencer-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Fischer",
                "href": "/profile/Peter-Fischer-14"
            },
            "answer_text": "Buddha say:Form is Emptiness, Emptiness is Form. Emptiness and Form not separated.  Enter Quantum Mechanic. Still holds true. :-b Other than that: banging your head against a wall. That would relate to another absolute buddhist truth: there is pain! LOL ",
            "date": "Answered April 22, 2015",
            "views": "348",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sarah Nazim",
                    "user_href": "/profile/Sarah-Nazim"
                },
                {
                    "user_id": "Danielle Rodgers",
                    "user_href": "/profile/Danielle-Rodgers-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rob Weir",
                "href": "/profile/Rob-Weir"
            },
            "answer_text": "\"We\" cannot be sure of anything.  I, on the other hand, am sure of many things.  I can't speak for anyone else, however.   With labor \"we\" might talk and assure each other than we are sure of the same things, but there will always be some smidgin of doubt that we are talking about the same thing. Gertude Stein said it better, if you are in to that kind of thing:  Clarity is of no importance because nobody listens and nobody knows what  you mean no matter what you mean, nor how clearly you mean what you  mean. But if you have vitality enough of knowing enough of what you  mean, somebody and sometime and sometimes a great many will have to  realize that you know what you mean and so they will agree that you mean  what you know, what you know you mean, which is as near as anybody can  come to understanding anyone. ",
            "date": "Answered April 18, 2014",
            "views": "401",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Charlie Fortin",
                    "user_href": "/profile/Charlie-Fortin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ziting Wang",
                "href": "/profile/Ziting-Wang"
            },
            "answer_text": "We can be sure that it is impossible to take into account everything, so you cannot be sure of anything. Although it sounds like a paradox, its true, because the lack of control over variable would be the factor that causes us to be unsure of things. Since the phrase \"we understand everything\" is impossible because it encompasses an infinite amount of factors, we can therefore say that it is impossible to be sure of anything. ",
            "date": "Answered April 21, 2014",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Apeksha Kshirsagar",
                "href": "/profile/Apeksha-Kshirsagar-1"
            },
            "answer_text": "Our existence is an absolute truth. ",
            "date": "Answered April 22, 2015",
            "views": "132",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sagar Khatkale",
                    "user_href": "/profile/Sagar-Khatkale"
                },
                {
                    "user_id": "Chris Ward",
                    "user_href": "/profile/Chris-Ward-76"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kenneth Bowien",
                "href": "/profile/Kenneth-Bowien"
            },
            "answer_text": "Taxes,death,confusion,and doubt,which,ironically,are the leading causes of suicide,besides love and divorce,(the later 2 being brought on by alcoholism and stupidity),so my advice is to self medicate.Also it's a sure bet some member of the Republican Party ,(I.e. Mitt Romney), is going to say something really stupid and believes it's true,especially when those comments are directed toward Women, ",
            "date": "Updated April 18, 2014",
            "views": "282",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Quentin Giraux",
                "href": "/profile/Quentin-Giraux"
            },
            "answer_text": "Cogito ergo sum ",
            "date": "Answered April 14, 2014",
            "views": "191",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andriy Skriptnikov",
                    "user_href": "/profile/Andriy-Skriptnikov"
                },
                {
                    "user_id": "Pouyan Khodabakhsh",
                    "user_href": "/profile/Pouyan-Khodabakhsh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Juan Valentín-Pastrana",
                "href": "/profile/Juan-Valentín-Pastrana"
            },
            "answer_text": "Death, taxes & second law of thermodynamics ",
            "date": "Answered April 17, 2014",
            "views": "186",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gregory A. Farrell",
                    "user_href": "/profile/Gregory-A-Farrell"
                },
                {
                    "user_id": "Jason MacDonald",
                    "user_href": "/profile/Jason-MacDonald"
                }
            ]
        },
        {
            "author_info": {
                "name": "Noam Kaiser",
                "href": "/profile/Noam-Kaiser"
            },
            "answer_text": "That THIS  is a bad idea. ",
            "date": "Answered May 6, 2014",
            "views": "230",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Enrique Pareja",
                    "user_href": "/profile/Enrique-Pareja"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joel V Benjamin",
                "href": "/profile/Joel-V-Benjamin"
            },
            "answer_text": "What is is. ",
            "date": "Answered April 17, 2014",
            "views": "402",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hrishikesh Raut",
                    "user_href": "/profile/Hrishikesh-Raut"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Garrett",
                "href": "/profile/Andrew-Garrett-7"
            },
            "answer_text": "No, there is plenty of room to doubt absolutely everything you experience. Absolute knowledge is impossible in a universe of change, duality, and perception and you can't even be sure of that! ",
            "date": "Answered April 11, 2014",
            "views": "289",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dakoit Wuther",
                "href": "/profile/Dakoit-Wuther"
            },
            "answer_text": "only in logic,  things like causationthe nature of a fallacyand some parts of pure mathematicsother wise no ",
            "date": "Answered April 23, 2015",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Cameron Quinn",
                "href": "/profile/Cameron-Quinn-1"
            },
            "answer_text": "In this phenomenal world everything has an opposite.All experiences are neutral and therefore offer both benefits and drawbacks. The key is that our emotions determine whether we see the experience as a plus or minus and therefore as a learning opportunity.Change is inevitable.Truth is direct correspondence with reality. Reality is that which is changeless. ",
            "date": "Answered April 18, 2014",
            "views": "319",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Franz Plochberger",
                "href": "/profile/Franz-Plochberger"
            },
            "answer_text": "Something is true, if it is identical to real nature. In Physics you have to proof every new thesis by a real, physical experiment. ",
            "date": "Answered April 23, 2015",
            "views": "56",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hendalee Wilson",
                "href": "/profile/Hendalee-Wilson"
            },
            "answer_text": "Yes you can be sure that you cant be sure of anything.... ",
            "date": "Answered April 17, 2014",
            "views": "240",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ramon Morales",
                "href": "/profile/Ramon-Morales"
            },
            "answer_text": "No. I can't prove. ",
            "date": "Answered April 22, 2015",
            "views": "40",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Eva Maria Snyder",
                "href": "/profile/Eva-Maria-Snyder"
            },
            "answer_text": "I think that I think therefore I think that I am. ",
            "date": "Answered April 9, 2014",
            "views": "340",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bartolomeu Fonseca",
                "href": "/profile/Bartolomeu-Fonseca"
            },
            "answer_text": "yes,death .It´s only one. ",
            "date": "Answered April 9, 2014",
            "views": "168",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Asher Haven",
                "href": "/profile/Asher-Haven"
            },
            "answer_text": "Happiness is possible, people exist for self-pleasure, and death ",
            "date": "Answered April 18, 2014",
            "views": "625",
            "upvotes": "0"
        }
    ]
}