{
    "title": "Can one prove a negative existential claim? - Quora",
    "tags": [
        "Existentialism",
        "Logic (thinking)",
        "Logic (philosophy)",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gius Bom",
                "href": "/profile/Gius-Bom"
            },
            "answer_text": "A negative existential claim is a statement such as: \"There is no x's in y\". If y is the world and your truth theory is a verificationist one, then it could be hard to prove this kind of statents, because you cannot find a proper truth-maker, since the proposition is true if x does not exist. However, there are other possibilities... First of all, empiricism holds that you can infer a negative existential claim when your experience could not verify the opposite statement. If you say “There is a lion in my fridge” and, when you open the fridge, you find no lions, then you can Infer the sentence “There are no lions in my fridge”. But this is exactly an inference, which is to say that it is a DERIVED negative existential claim. I think you are looking for a different answer. I think you want to kwon whether it is possible to demonstrate a PRIMITIVE negative existential claim. Well, consider, for instance, this mathematical system: 3x+y=-2 -3x-y=3 You can easily prove that \"There are no solutions for this system\", because x and y disappear and you can derive a contradiction, i.e. 2=3 (indeed, with a simple substitution, you find: y+2-y=3). If the system is inconsistent, then the negative existential claim on the value of x and y is automatically proven. In this case, you find out that y does not exist and so that x is nothing as well. ",
            "date": "Answered July 21, 2020",
            "views": "58",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kumarjit Ghoshal",
                "href": "/profile/Kumarjit-Ghoshal"
            },
            "answer_text": "There is no claim! I have no claim! All claim belongs to the mind…. Positive or negative also belongs to the mind… proving its own theory, opinion, understanding bla bla bla is a need of the mind. So, yes… as far as it is a concern of the mind…. Someone can definitely prove a negative existential claim…. And similarly another one will disprove the same (disproving is also proving that the theory is wrong). These are all mental game…. No truth can be obtain from any ammount of exercise of the mind. Bows Atman ",
            "date": "Answered July 21, 2020",
            "views": "67",
            "upvotes": " Answer requested by Mridul Mohta"
        },
        {
            "author_info": {
                "name": "Denis Loubet",
                "href": "/profile/Denis-Loubet"
            },
            "answer_text": "I’m not sure what you mean. Is, “There is no fire-breathing dragon in my garage.” a negative existential claim? If so, then open my garage and look. That will certainly establish that there’s no fire-breathing dragon there. I don’t know if that constitutes the “prove” you’re asking about, but as evidence it’s obviously good enough for all practical purposes. ",
            "date": "Answered July 21, 2020",
            "views": "29",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Ian Uzick",
                "href": "/profile/Mark-Ian-Uzick"
            },
            "answer_text": "Sometimes one can: if the possibility of thing can be shown to be illogical, then one has logically proven it does not exist. Just bear in mind that any particular theory of logic was derived empirically and, as such, it’s subject to falsification upon finding new evidence or a better theory. ",
            "date": "Answered July 21, 2020",
            "views": "36",
            "upvotes": "0"
        }
    ]
}