{
    "title": "Can a Christian lose his or her salvation and end up in hell? - Quora",
    "tags": [
        "Salvation",
        "Hell"
    ],
    "response": [
        {
            "author_info": {
                "name": "Selena Davis",
                "href": "/profile/Selena-Davis-43"
            },
            "answer_text": "As someone stated in a comment below that depends on who does the saving. What God/Christ has accomplished cannot be undone by human efforts or anything in all creation. If we go to hell then we were not truly saved and will be cut off and cast into the fire. If we think that our salvation is dependent upon our works or secured in our abilities then we are denying the power of what was accomplished on the cross. Many people hear the word of God preached, and many call themselves Christians but that doesn’t make one saved. Jesus said “you know the tree by the fruit it bears”. Anyone can “act” like a Christian and appear to be one in the eyes of the world, but they cannot fool God. Their fruit is evidence of whether or not they are saved. Salvation is complete in Christ…by way of sanctification. We are not instantly made like Him…there is a growth process. Those whom He chose will be the ones to avoid His wrath. Think about the wheat and tares…if you’ve ever seen them they look very very similar, almost identical until they’ve matured. Jesus knows who is saved and who is not…those who are will never lose their salvation. Pertaining to the salvation of the truly saved: John 5:24: \"Truly, truly, I say to you, whoever hears my word and believes him who sent me has eternal life. He does not come into judgment, but has passed from death to life.\"John 6:35-37: Jesus said to them, \"I am the bread of life; whoever comes to me shall not hunger, and whoever believes in me shall never thirst. But I said to you that you have seen me and yet do not believe. All that the Father gives me will come to me, and whoever comes to me I will never cast out.\"John 10:27-29: \"My sheep hear my voice, and I know them, and they follow me. I give them eternal life, and they will never perish, and no one will snatch them out of my hand. My Father, who has given them to me, is greater than all, and no one is able to snatch them out of the Father’s hand.\"Romans 5:9: Since, therefore, we have now been justified by his blood, much more shall we be saved by him from the wrath of God.Romans 8:1: There is therefore now no condemnation for those who are in Christ Jesus.Romans 8:35: Who shall separate us from the love of Christ? Shall tribulation, or distress, or persecution, or famine, or nakedness, or danger, or sword?Romans 8:38-39: For I am sure that neither death nor life, nor angels nor rulers, nor things present nor things to come, nor powers, nor height nor depth, nor anything else in all creation, will be able to separate us from the love of God in Christ Jesus our Lord.Romans 11:29: For the gifts and the calling of God are irrevocable.Hebrews 3:14: For we have come to share in Christ, if indeed we hold our original confidence firm to the end.1 John 2:19: They went out from us, but they were not of us; for if they had been of us, they would have continued with us. But they went out, that it might become plain that they all are not of us.Pertaining to the those who may “appear to be saved” but are unfruitful: JOHN 15:2,4,6 2 Every branch in me that beareth not fruit he taketh away: and every branch that beareth fruit, he purgeth it, that it may bring forth more fruit.4 Abide in me, and I in you. As the branch cannot bear fruit of itself, except it abide in the vine; no more can ye, except ye abide in me.6 If a man abide not in me, he is cast forth as a branch, and is withered; and men gather them, and cast them into the fire, and they are burned.“Listen! Behold, a sower went out to sow. And as he sowed, some seed fell along the path, and the birds came and devoured it. Other seed fell on rocky ground, where it did not have much soil, and immediately it sprang up, since it had no depth of soil. And when the sun rose, it was scorched, and since it had no root, it withered away. Other seed fell among thorns, and the thorns grew up and choked it, and it yielded no grain. And other seeds fell into good soil and produced grain, growing up and increasing and yielding thirtyfold and sixtyfold and a hundredfold.” And he said, “He who has ears to hear, let him hear.”Mark 4:3-9 The explanation given by Jesus. And when he was alone, those around him with the twelve asked him about the parables. And he said to them, “To you has been given the secret of the kingdom of God, but for those outside everything is in parable,so that “‘they may indeed see but not perceive, and may indeed hear but not understand, lest they should turn and be forgiven.’” And he said to them, “Do you not understand this parable? How then will you understand all the parables? The sower sows the word. And these are the ones along the path, where the word is sown: when they hear, Satan immediately comes and takes away the word that is sown in them. And these are the ones sown on rocky ground: the ones who, when they hear the word, immediately receive it with joy. And they have no root in themselves, but endure for a while; then, when tribulation or persecution arises on account of the word, immediately they fall away. And others are the ones sown among thorns. They are those who hear the word, but the cares of the world and the deceitfulness of riches and the desires for other things enter in and choke the word, and it proves unfruitful. But those that were sown on the good soil are the ones who hear the word and accept it and bear fruit, thirtyfold and sixtyfold and a hundredfold.”.Mark 4:10-20 Pertaining to the separation of the saved vs unsaved: Another parable put he forth unto them, saying, The kingdom of heaven is likened unto a man which sowed good seed in his field: But while men slept, his enemy came and sowed tares among the wheat, and went away. But when the blade was sprung up, and brought forth fruit, then the tares appeared also. So the servants of the householder came and said unto him, Sir, didn't you sow good seed in thy field? from where did the tares come out from? He said unto them, An enemy hath done this. The servants said unto him, Wilt thou then that we go and gather them up? But he said, Nay; lest while ye gather up the tares, ye root up also the wheat with them. Let both grow together until the harvest: and in the time of harvest I will say to the reapers, Gather ye together first the tares, and bind them in bundles to burn them: but gather the wheat into my barn. Matthew 13:24-30 ",
            "date": "Answered December 18, 2019",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alan C Reynolds",
                "href": "/profile/Alan-C-Reynolds-1"
            },
            "answer_text": "This is a question which cannot be truly answered until after death. There are many discussion. People will quote verses to support their arguments without going to the original language and the intended audiences understanding. Or philosophize on the interpretations. You can read extensively and still come to no conclusion because all arguments are infiltrated by mans limited understanding. There is a speaker, John Piper, who, though a reformist and a Calavanist has an interesting view on this; it almost falls under the TULIP implications. He poses the question: ‘If you lose your salvation, were you ever saved in the first place?’ This is a scary thing to consider and the reason it is possible is because of the iterative drift away from strict doctrine to levels of societal doctrine. We tend to be more about feelings than convictions. More into tangibles that ethereal. This means we can be caught up in the hype and not be saved. Or, still caught up in the hype and actually be saved. (Hence my first sentence.) So, how do you tell. The benchmark is always the example of Christ and the early church - as much as it can be. Almost 90% can be applied to the social setting of today. There are at least two things at play here. The first is the reference in scripture to ‘you will know them by their works’. Be careful not to hear what I am not saying. Salvation is not through works but, if saved, you will perform works driven by Christ at a cost to you. The second which comes to mind is your change in being. According to scripture you are a new creation. All of your sins past, present and future have need washed away. This does not mean you will not stumble, sin, or make mistakes. However, you natural inclination will be to clean up your life - subliminally. You will find you no longer do certain things. Your reading of the Bible will take on a different meaning, it will become clearer - if you are not seeking scripture that could be a negative sign. Your friends will notice a difference and your circle of friends will change. There are others but these are the main ones which come to mind. You will hear arguments from people who claim that who ‘Christ has called to himself not one man can pull away’. Notice ‘has called’ which falls under TULIP, and ‘no man’ - even if this read as ‘no one’ the argument would still stand. That is God can release you. He gave you free will so, even if he called you, it is possible, through free will, to reject your salvation. Be warned though, this is not a status you can change readily. What is more, you will not be aware you are doing it until it is too late. This is one reason to ensure you keeep in the body of Christ. Anyway, enough. I could write a book but I am fairly stupid so accept these comments as someone who has walked on both sides. Alan ",
            "date": "Answered July 8, 2017",
            "views": "201",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Geoff Cutler",
                "href": "/profile/Geoff-Cutler"
            },
            "answer_text": "Can a Christian lose his or her salvation and end up in hell? Good question. But I wonder if you will stay with me on the answer? So what is “salvation”? Its actually becoming Eternal and Divine - rebirth effected by the Holy Spirit. Can you achieve this on Earth? Yes, but I don't know of anyone who did it fully. Jesus could have, at the Baptism, but God asked him to stay on. Because if Jesus had concluded that stage, he would have “died” and his human body would have disappeared in a mini-fusion event as he transitted from time/space (here) directly to the timeless Eternal zone where there is no material. So do you see the problem? Maybe not? But to diggers, has anyone got close? Yes Mother Teresa and St Francis of Assisi, both passed to the Fifth Heaven, but they were neither of them “saved” as of their death. But back to hell. Well hell is a time/space dimension. Its not in the Eternal Zone. Yes that dimension which houses hell also houses several heavens, but none of these are The Kingdom of God. So once you have left time/space, you won’t be going to hell unless you plan on visiting someone there. Now if you currently think you have been “born again” I am sorry to tell you that you have not. Keep working on it. And its almost certain you will pass to the Spirit Spheres and not where you had hoped to be. Here is a page that attempts to clarify the difference between where all of us go after death, and the goal of most (all?) Christians and one which many think they have already reached : The Kingdom of God. The Spirit Heavens and the Christian Kingdom of God Added later. Since I had a query on my answer, its obvious some folks did not get what I was saying here. In short “salvation” as Jesus meant it, has nothing to do with hell. Many who first go to hell, may find “salvation.” And many who avoid hell, may also avoid “salvation.” I will give you a link to a fellow in hell, who while in hell learnt how to “be saved” and it was the means of accelerating his exit from hell, as also taking him on the right path to eventually be reborn of spirit and enter the Kingdom of God. [1] [1] Caesar Gives His Experiences. Vol 3 Pg:143 ",
            "date": "Updated August 20, 2017",
            "views": "147",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Adam Shattock",
                "href": "/profile/Adam-Shattock"
            },
            "answer_text": "This is a modern theology theory commonly known as “osas” or Once Saved Always Saved. It will be true after Christ returns but never before. John 8 (KJV Strong's) 47 He that is of God heareth God's words: ye therefore hear them not, because ye are not of God.Before this can be answered we must effectively establish a time constant for referencing the subject. The When, before the how followed by IF. We need to defeat ignorance through education before wisdom and knowledge can be perfectly understood. What I aim to show you is a step up from Sunday school to Advanced Eschatological Research at masters level. Its not just a little advance in training but a millennial leap in understanding. The underlying basis of advanced study rewrites that personal views be discarded to understand something that would otherwise be coloured or clouded to varying degrees of comprehension opacity. Teaching needs to be transparent, without motive, objectively analysed and tested against supplied evidence and external evidence that not only supports it realistically but has no opinion based pseudo-facts such as continual tradition or popular doctrine not expressly derived from facts and evidence. Here we with go the educated statements: There are 2 issues to address: eternal life and immortality of humanity and secondly, possible existence of hell and its origins in creation. Establish whether hell exists.Either God and his son are real or, pagan Greek and Roman gods are real.Proving Hell does not exist has consequences on beliefs;Afterlife does not existSoul sleep is a lieHades & Pluto are not Satan.Death means complete termination of life both physically and spiritually.Eternal life for believers only, begins after Christ arrives in the clouds.The human soul is mortal and dies, some once and others twice.Mankind can be born twice, with conditions attached.Being born again requires several preconditions to be met.Keeping Commandments of God.Being baptised.Repenting of sin; washing robes of righteousness in blood of the Lamb.Bearing testimony of Jesus Christ.Living exactly as belief is professed, towards being rewarded for righteousness.Let's dive right into the first issue. Does hell exist that a Christian, or anyone for that matter, might end up there? The answer is no. The reasons are encapsulated within 3 issues: The 10 commandments, And specifically the first in which good himself declares there are no other gods before him. This agreement is true of every way you look at it beside he is the first and the last God. Yhwh is the creator of all things which men's any other gods came after Creation; thus invented by mankind or enemies of the Creator.Or first example is the Zeus-Hades-Poseidon unholy trinity. They allegedly murdered their parents as siblings to assume power. [1] Zeus plays the same role as Satan and even had a throne erected in his honour in Pergamum. Hades was his brother and ruled the underworld or afterlife in a kingdom of the same name. Belief in this Greek god system rewrites that all people die physically but their souls are immortal regardless of being righteous or not. This undead immortality is opposite to what Christ taught and what Yhwh declared in old times through the prophets.You either worship and believe IN YHWH or you believe in the Greek gods. They are incompatible belief systems. You cannot serve 2 masters…The gift of eternal life by our returning Christ,made possible by his death and subsequent resurrection to eternal life. Jesus made it clear rusty nobody could go to heaven as he would (did), but he promised to return and dish out eternal life to those whom he resurrects from the grave.Consider the implications of this prophecy.If Yeshua restores life to dead people in their graves, they could not possibly have been anywhere other than their grave to begin with.They had conclusively no consciousness after death and a modern study [2] shows something about the final 3 minutes but not beyond that. News agencies are not the most honest sources as they have agendas and motives towards financial profit.The future life of dead is hidden with Christ, who is the creator of life from dust, in heaven because he holds the keys of death and the grave, being the way to God, the truth about God and the life that comes from God through his living word aka holy spirit.Eternal life, the second life spoken of in Rev 20:4 — 5 (KJV) And I saw thrones, and they sat upon them, and judgment was given unto them: and I saw the souls of them that were beheaded for the witness of Jesus, and for the word of God, and which had not worshipped the beast, neither his image, neither had received his mark upon their foreheads, or in their hands; and they lived and reigned with Christ a thousand years. 5 But the rest of the dead lived not again until the thousand years were finished. This is the first resurrection.Revelation 20:6 (KJV Strong's) Blessed and holy is he that hath part in the first resurrection: on such the second death hath no power, but they shall be priests of God and of Christ, and shall reign with him a thousand years.The fact that hell was never created to begin with.Think about this carefully: if hell existed and was so important why was it not mentioned in the creation account? It was not made then because everything was good.Hell was not required because evil did not exist until after Satan sinned… and plotted to overthrow God by deceiving his final creation in his own image (mankind) into believing good doesn't exist or there are many goods but not a creator… it's actually working very well.Now for the salvation part of your question. Saved from Hell, which doesnt exist? No, the second death which is the lake of fire. Yeshua specifically taught that there is going to be this popular lake that all unbelievers will take a dive into after judgement day just a touch over 1000 years after the resurrect of the saints to eternal life. The same ones who will judge the earth inhabitants and the dead. SUMMARY A Christian cannot lose something they don't have. None are yet saved but all how to be saved when Christ returns, provided they met all the preconditions including keeping the Sabbath commandment. [3]Nobody can go to hell because it doesn't exist.When the lake of fire is created many will be thrown in there. Until that time bodies will remain in the grave. Unless redirected by Christ in the 1st resurrection.The Hebrews called the grave seol and hades by the Greeks. Sheol defined the bottomlessness aspect of the grave which never fills up and is met with the Greek version, tartaroo or tartarus.Jesus only taught about Gehenna of fire which is distinctly different from all other renderings of hell in these ways:Fathers made their sons walk alive through fire in the valley of Hinnom, just as the Father will make unrepentant beings live in an eternal lake of fire.Gehenna actually exists, as will the lake of fire.Both places are cursed and are a death sentence and a grave from which tjere is no resurrection to eternal life with God.The lake of fire will exist as spoken about by Jesus in 11 of the 12 biblical uses of gehenna. The 12th & last use is in James 3:6.Hades is misrepresented by failed interpretation as being hell instead of the grave in 42 times out of 54 uses. If those, the entire old testament only speaks about the grave (Strong's number 7585). The new testament talks about the grave 10 times and is named hell. Footnotes[1] ⚡️Zeus ⚡️• Facts and Information on Greek God of the Sky[2] LIFE AFTER DEATH: Scientists reveal shock findings from groundbreaking study[3] When Does It Start? | Sabbath Truth",
            "date": "Answered June 15, 2018",
            "views": "65",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Walter Wilkins",
                "href": "/profile/Walter-Wilkins-2"
            },
            "answer_text": "This is my personal belief. Yes a Christian can lose their salvation. Remember all sin and fall short of the glory of God. All means everyone even Christians. The only different between a Christian and a regular sinner is that a Christian has accepted Jesus Christ as their Lord and personal savior. When a Christian sins they must sincerely ask God through Jesus for forgiveness and strive to not commit that sin again. To God all sin is the same except for one; Blasphemy Against the Holy Spirit. This is the sin Lucifer and his followers committed, which is the only unforgivable sin. God writes all our sins and good deeds in his Book of Life. When we ask for forgiveness form our sins and God grants us forgiveness, he erases it form the Bool of Life and form his memory as if had never happened. This is how complete God’s forgiveness is. ",
            "date": "Answered July 21, 2017",
            "views": "46",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mike Rommel",
                "href": "/profile/Mike-Rommel"
            },
            "answer_text": "Go to the Bible and see. James 5:19-20 talks about those who wander from the truth, and that if someone brings back that sinner they have saved their soul from death.2 Peter 2:20-22 says that if those who escaped the defilements of the world through the knowledge of Jesus Christ and they go back to that state, then they are worse off than before. It would have been better for them to have not known the way of righteousness.So yes there is some real evidence that those who know God can change their minds about it...I still think that when someone is really saved they would not do this. Yet these passages remain and I can not ignore them. ",
            "date": "Answered July 22, 2017",
            "views": "28",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Brown",
                "href": "/profile/David-Brown-4405"
            },
            "answer_text": "In it’s simplest to be Christian you must accept Jesus, his teachings and his salvation for us through his death and resurrection as fact, reality and truth. You should do everything you can to practice the love and compassion of Jesus in your life and repent in earnest when you sin…we all sin, weakness of the reality of being human. If one turns from the belief and the life of a Christian, the potential of hell may exist. What is hell? How will this “state” exist for us? Unknown. But for anyone that feels the excruciating suffering of guilt and remorse for an extended period of time; that self-inflicted state might as well Be Hell. ",
            "date": "Answered July 9, 2017",
            "views": "41",
            "upvotes": " Answer requested by Robert Ogundiran",
            "upvoters": [
                {
                    "user_id": "Mia Pratt",
                    "user_href": "/profile/Mia-Pratt-2"
                },
                {
                    "user_id": "Mike Rommel",
                    "user_href": "/profile/Mike-Rommel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sarah Chiu",
                "href": "/profile/Sarah-Chiu-14"
            },
            "answer_text": "Devastatingly, yes. But only if he/she chooses to walk away from it, and reject the calls and reminders and convictions from the Holy Spirit to come home to Jesus. Even Judas Iscariot saw Jesus yet was allured by the world and walked away. However, “If we confess our sins, he is faithful and just and will forgive us our sins and purify us from all unrighteousness.”(1 John 1:9) That is why the unforgivable sin is “blasphemy against the Holy Spirit”, because rejecting the Holy Spirit means the refusing to back to God and confessing the sins that the Holy Spirit convicts us of. So the only way to end up in hell is to reject Jesus, and people do that by being convicted of opposing God (by the Holy Spirit) and then refusing to come back to God and accept His forgiveness bought by the ransom of Jesus Christ on the Cross. ",
            "date": "Answered July 8, 2017",
            "views": "65",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Selena Davis",
                    "user_href": "/profile/Selena-Davis-43"
                },
                {
                    "user_id": "Robert Ogundiran",
                    "user_href": "/profile/Robert-Ogundiran"
                },
                {
                    "user_id": "Wendy Clark",
                    "user_href": "/profile/Wendy-Clark-62"
                }
            ]
        },
        {
            "author_info": {
                "name": "Janet Stuart",
                "href": "/profile/Janet-Stuart"
            },
            "answer_text": "I personally don’t think so because in Ephesians it says we are sealed for eternity unto salvation. Also John 3:16 says,(GOD SO LOVED THE WORLD THAT HE GAVE HIS ONLY BEGOTTEN SON,THAT WHOSOEVER SHALL BELIEVITH IN HIM,SHALL NOT PERISH BUT HAVE EVER LASTING LIFE.) He would not give us the gift of His SON and die on the cross just to take the gift back. He died to forgive us of sin and He said “IT IS FINISHED”meaning the debt was paid forever. I do, believe,however, that after tasting the grace of Jesus death and then you deliberatly reject Him then maybe only then could you lose your salvation because you would have willed yourself to. ",
            "date": "Answered July 8, 2017",
            "views": "54",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jack Wheat",
                "href": "/profile/Jack-Wheat"
            },
            "answer_text": "Christendom is split on that question. There is a very strong belief in the once-saved-always-saved doctrine among evangelical/fundamentalist denominations. Often these are churches where a person must have reached the “age of accountability” and have consciously felt God’s call to be baptised as a Christian. In essence, a conscious conversion to Christianity is always required. Other Christian faiths rely on the teaching that by your works you will be known, with the understanding that God’s Grace is overriding. For churches with infant baptism and later confirmation in the faith, the absence of a clear personal decision and declaration may explain the tentativeness. On such questions wars were fought not too many hundred years ago. ",
            "date": "Answered July 8, 2017",
            "views": "58",
            "upvotes": " Answer requested by Robert Ogundiran",
            "upvoters": [
                {
                    "user_id": "Selena Davis",
                    "user_href": "/profile/Selena-Davis-43"
                },
                {
                    "user_id": "Charles Blackwell",
                    "user_href": "/profile/Charles-Blackwell-2"
                },
                {
                    "user_id": "Johny Duke",
                    "user_href": "/profile/Johny-Duke"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dick Hamilton",
                "href": "/profile/Dick-Hamilton-1"
            },
            "answer_text": "Depends upon who saved you. If by your ‘efforts' then, yes, I suppose so. But if your salvation was completed by Jesus then no. In the first place, you are called to God by the Holy Spirit, and granted the faith to accept. Secondly, God's plan of redemption is complete, ‘no assembly required'. The ‘work' of salvation was God planned and God completed. You cannot ‘undo' what you didn't accomplish. ",
            "date": "Answered July 6, 2017",
            "views": "150",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Christian Brown",
                    "user_href": "/profile/Christian-Brown-56"
                }
            ]
        },
        {
            "author_info": {
                "name": "Philip Jones",
                "href": "/profile/Philip-Jones-76"
            },
            "answer_text": "No. God’s grace is irresistible. A fall from grace is not possible. This doctrine is called perseverance of the saints. The five distintive doctrines of Calvinism are: Total depravityUnconditional electionLimited atonementIrresistible gracePerseverance of the saintsThe initial letters of each line spell “TULIP” ",
            "date": "Answered July 8, 2017",
            "views": "72",
            "upvotes": " View 3 Upvoters "
        },
        {
            "author_info": {
                "name": "Kim Walker",
                "href": "/profile/Kim-Walker-379"
            },
            "answer_text": "If someone just says a prayer and doesn’t change to follow the light. Following the light is where someone is saved. Becoming love in a world full of hate that gets attacked by hate willingly in order to save it to for it to know it has the capability to turn into love. If someone says some words and hates other people then they are not saved at all. Jesus wasn’t meant to be idolized but followed. That also means that people from other backgrounds, religions would be saved by being loving, forgiving, merciful following the light of love. ",
            "date": "Answered July 6, 2017",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brian Santoso",
                "href": "/profile/Brian-Santoso"
            },
            "answer_text": "I am not quite sure to answer it… I am not even a god. Salvation is not a gift, it is a grace from God. Imagine you are giving something to someone unworthy. Then, imagine the unworthy keep being unworthy. What would you do? After all, Heaven and hell is place, it is a matter of the judge who is God himself. Now, imagine The One who gives you the salvation is also The One who will judge at the end. ",
            "date": "Answered July 8, 2017",
            "views": "59",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paul Brocklehurst",
                "href": "/profile/Paul-Brocklehurst-2"
            },
            "answer_text": "No one ends up in hell. It’s just a scare story to indoctrinate kids with to frighten them out of questioning religious claims. But don’t take my word for it - listen to Bishop Spong letting the cat out of the bag:  ",
            "date": "Answered July 6, 2017",
            "views": "16",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "James Smith",
                "href": "/profile/James-Smith-2608"
            },
            "answer_text": "“For if after they have escaped the pollution's of the world through the knowledge of the Lord and Savior Jesus Christ, they are again entangled therein, and overcome, the latter end is worse with them than the beginning.” 2 Peter 2:20 ",
            "date": "Answered July 8, 2017",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Calvin Henrick",
                "href": "/profile/Calvin-Henrick"
            },
            "answer_text": "Yes. The are numerous warnings in the Bible telling Christians to remain faithful and stating that one can, to borrow a metaphor from Paul, make shipwreck of ones faith. ",
            "date": "Answered July 6, 2017",
            "views": "6",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Al Lundy",
                "href": "/profile/Al-Lundy"
            },
            "answer_text": "“lose” is the wrong word. A peron can refuse God's offer of salvation offered through the sacrafice of Christ. Scripture calls on us to be obedient to God's commandments and to persevere in our obedience. ",
            "date": "Answered July 6, 2017",
            "views": "5",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chris Virana",
                "href": "/profile/Chris-Virana"
            },
            "answer_text": "Of course! You ain't no guarantee till your There! And if you fuck up you'll be cast down, just look what happened to the Devil! So you'll never be safe, anywhere!! Even the devil can cast you away! Guess ya didn't know that now, did ya?! ;-)) There's always somwhere worse!! ",
            "date": "Answered July 8, 2017",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lucha Tijuanera",
                "href": "/profile/Lucha-Tijuanera"
            },
            "answer_text": "The once saved always save is a falsehood. Read Matthew 25 if you will, it explicitly speaks of christians. ",
            "date": "Answered July 7, 2017",
            "views": "5",
            "upvotes": "0"
        }
    ]
}