{
    "title": "Can anyone ever see the whole of reality? - Quora",
    "tags": [
        "Imagination",
        "Perception",
        "Reality",
        "Philosophy",
        "Experiences in Life",
        "Psychology of Everyday Life",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Adrian Blumberg",
                "href": "/profile/Adrian-Blumberg-1"
            },
            "answer_text": "If we believe that the “Unified Theory Of Everything\" physicists are actively researching is a possibility, then the “whole of reality\" should be able to be “seen\" as a quantifiable algorithmic equation describing a “base/fundamental/foundational process”. I believe it is possible. The next question should be, is it probable? I agree that it is. There is ample documented evidence that describes similar processes between disparate mechanism/devices/items all the way to the largest cosmological object, and down to the smallest. There should be a guiding simplicity to all of it, and I believe it can be found in 1 and 0. ",
            "date": "Answered February 3, 2020",
            "views": "41",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Cole",
                "href": "/profile/John-Cole-93"
            },
            "answer_text": "Without even asking for the mandatory meanings of the words and what will be acceptable evidence to collect for answers, this deserves a resounding “NO”. There are things too small for observation, there are things to large, there are things to far. What do you mean by “see” and do you mean all at one time? Can you even say exactly what’s in the bottom drawer of your dresser? How many particles of dust are under your bed? How much lint in your pocket? How many , and what type of, microorganisms are on the back of your tongue right now? ",
            "date": "Answered February 2, 2020",
            "views": "55",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Labib Muntahi",
                "href": "/profile/Labib-Muntahi"
            },
            "answer_text": "No, from my view the whole reality can't be seen or felt. Because every action has so many sides of it. For example : Something had done by someone and seen by another one. That “something” is different for both of them. To discuss about real life, whenever I get some coins immediately I give the coin to some beggar or someone in need of that. I usually don't keep coins. Maybe for someone who noticed it thinks I am a very kind hearted person who likes to help the poor. But for me its just that I dont like to keep coins with me! Even if someday anyone will ask me about this, maybe I will not open up the real fact! So one cant find the whole reality from what he has seen or felt! ",
            "date": "Answered February 2, 2020",
            "views": "72",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Pete Combes",
                    "user_href": "/profile/Pete-Combes"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeffrey Werbock",
                "href": "/profile/Jeffrey-Werbock"
            },
            "answer_text": "See? No, we cannot see reality. As it is, we only see the light reflected off the surface of objects, and we also see light directly from sources like the Sun or a lamp (lightbulb). But we can feel reality. Our bodies are real and when we feel them, we are feeling reality. The more we can feel our bodies, the more we feel the whole of reality, as our bodies are integral parts of that whole. There is no border between what is “inside” and what is “outside”; it is one contiguous reality, and we can feel that. Not easily, though. It takes special training and years of practice. ",
            "date": "Answered February 3, 2020",
            "views": "39",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "T. Stephen Cornelius",
                "href": "/profile/T-Stephen-Cornelius"
            },
            "answer_text": "Always… its singular not plural. Unless you say the realities. Humm? Do you see the whole Pizza or just a slice? The forest or just the tree? Do you see a thing or the space around it that actually defines it a thing you would have it be? Golly Gee… look in the mirror what do you see but the whole you be. That's the reality. Like it or not. If blind then you are otherwise your senses wholly present always in future posture its reality. ",
            "date": "Answered February 2, 2020",
            "views": "41",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Haluk Berkmen",
                "href": "/profile/Haluk-Berkmen"
            },
            "answer_text": "In order to talk about the ‘whole’, one must know all that is in this whole. The ‘whole’ must be a closed set. But it isn’t. The whole is infimite, so nobody can see the whole. We cannot even see the whole universe. This is because our observations cover only 5 % of the entire universe. This is because 21 % of the universe is Dark Matter and 74 % is Dark Energy. Both are presently unobserved. ",
            "date": "Answered February 3, 2020",
            "views": "20",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ben Burton",
                "href": "/profile/Ben-Burton-35"
            },
            "answer_text": "Can you see the forest or just the tree? This is the same question. If you know how it works then you don't need to see every tree to know the whole of the forest / reality. No matter what tree you come across you can figure it out and use it for your needs. ",
            "date": "Answered February 2, 2020",
            "views": "22",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William Shroyer",
                "href": "/profile/William-Shroyer"
            },
            "answer_text": "Nope. There will always be the part of the eye that’s doing the looking - while it’s looking at everything else, it cannot look at itself. So at the LEAST, it will not be able to perceive that much of reality. ",
            "date": "Answered February 7, 2020",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Adityaa Dayal",
                "href": "/profile/Adityaa-Dayal-1"
            },
            "answer_text": "The realititself consists of multiple interpretation and preferences. if you take ones physical life as a reality. If you delve deep enough you're about to discover eternal truth or the thing that always exists. ",
            "date": "Answered February 5, 2020",
            "views": "7",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "P. Neil Burns",
                "href": "/profile/P-Neil-Burns-1"
            },
            "answer_text": " ",
            "date": "Answered February 2, 2020",
            "views": "49",
            "upvotes": "0"
        }
    ]
}