{
    "title": "Can a fact be true or false, or must it necessarily be true? - Quora",
    "tags": [
        "Epistemology",
        "Facts and Trivia"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shawn McCaslin",
                "href": "/profile/Shawn-McCaslin"
            },
            "answer_text": "Facts about the natural world are not necessarily true or false. Facts about the natural world are just propositions that you think should useful to others, independent of you as an observer. Mathematical facts can be true, with associated proof. A proposition is true if it is free of contradiction in its context. Definitions and axioms define the context. For example, I can state as a definition/axiom, \"all things that are purple are greebles\". If I then say, \"this thing is purple\", it follows logically that it is also a greeble. Unfortunately, I have no means for linking my perceptions to the natural world (i.e., reality). My brain could now be connected to a supercomputer that is feeding me synthesized perceptions--I cannot know otherwise. Thus, I cannot prove as true any proposition regarding the natural world. I can only present models of the natural world that I think are useful. It is possible that some people have Faith; i.e., the magical, transcendent ability to discern truths about reality. Unfortunately, you must have Faith to judge Faith. One apparent oddity about Faith is that for people who claim to have Faith, it appears not to provide any differentiated, useful models for prediction and control of the natural world. In that sense, it does not appear to be scientifically useful. Standard/conventional definitions of 'fact' commonly involve a degenerate, circular reference to 'true' (Definitions of fact - OneLook Dictionary Search Definitions of truth - OneLook Dictionary Search ); i.e., 'facts' are propositions that are true, and 'truth' is propositions that are factual. ",
            "date": "Updated February 1, 2020",
            "views": "54",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ian Wickham",
                    "user_href": "/profile/Ian-Wickham-1"
                },
                {
                    "user_id": "Frank Weyl",
                    "user_href": "/profile/Frank-Weyl"
                },
                {
                    "user_id": "Aaron Melocik",
                    "user_href": "/profile/Aaron-Melocik"
                },
                {
                    "user_id": "Emenz Apps",
                    "user_href": "/profile/Emenz-Apps"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Robb",
                "href": "/profile/Dan-Robb-2"
            },
            "answer_text": "IMO, the professor is playing fast and loose with words, ask them to elaborate. In spite of what some here say, there are facts, and by definition they are true. The problem can be that many rely on faulty perceptions in determining what is a fact; therefore, falsely labeling something as fact. As Alan Bustany indicated, the veracity of fact can be dependent upon unknown or unidentified variables. And, what is a fact now does not necessarily indicate that it will remain a fact. As to past Experience, it can be allowed to give direct and certain information of those precise objects only, and that precise period of time. … Two propositions are far from being the same. … I shall allow, if you please, that the one proposition may justly be inferred from the other: I know, in fact, that it always is inferred. But if you insist that the inference is made by a chain of reasoning, I desire you to produce that reasoning. (Hume, 1910/1739, p. 313)  Hume, D. (1910). English philosophers of the seventeenth and eighteenth centuries: An enquiry concerning human understanding. In C. W. Eliot (Ed.). The Harvard Classics, 37 (pp. 289-407). New York: P. F. Collier & Son. (Originally published in 1739) ",
            "date": "Answered October 31, 2015",
            "views": "27",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ben Bacon",
                    "user_href": "/profile/Ben-Bacon-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Toby Hicks",
                "href": "/profile/Toby-Hicks"
            },
            "answer_text": "Facts can be true or false, and need not be necessarily true. A visualization may help. Imagine a venn diagram of facts and anti-facts. The two circles should not intersect because they describe different things. The question is what is the boundary? Truth seems like a logical boundary... ...but, it's not because truth is absolute while facts are based on our observations. Consider the very common relativity thought experiment of a train being hit by lightning (http://en.wikipedia.org/wiki/Relativity_of_simultaneity). In this example two observers have two time-based facts that are true from their point of view, yet they are false from the other's point of view. Facts about systems that are not man-made are the observers' best guesses at the truth based on observations. There is observer bias by definition. Not all observers are right all the time.   ",
            "date": "Updated July 17, 2012",
            "views": "8",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Elie",
                    "user_href": "/profile/James-Elie"
                },
                {
                    "user_id": "Amin Abed",
                    "user_href": "/profile/Amin-Abed"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alan Bustany",
                "href": "/profile/Alan-Bustany"
            },
            "answer_text": "How can a fact be false? A fact is merely a statement about reality that we believe to be true: Grass is greenBeijing is the capital of ChinaYou cannot turn base metals into GoldFacts may be based on the best available evidence and our best understanding of the underlying theory and mechanisms. Then someone comes along with some new evidence or a new theory that changes how we view the world, or at least some so-called facts about the world. Perhaps: A variety of grass that isn't greenA recent decision of the PolitburoNucleosynthesis in supernovaeAnd the facts change! Science is based upon a provisional understanding of the world. Facts are only facts based upon that provisional understanding. Even the most fundamental facts are subject to revision based on new evidence and new understanding. In science there is no absolute truth and \"we don't know\" is a perfectly acceptable answer. An irrefutable fact that is an absolute truth is a \"red flag\" to any scientist. Anyone claiming such knowledge can usually be safely ignored :-) ",
            "date": "Updated November 4, 2016",
            "views": "99",
            "upvotes": " View 31 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Veelith Gournoz Medova",
                    "user_href": "/profile/Veelith-Gournoz-Medova"
                },
                {
                    "user_id": "Monique Meerveld",
                    "user_href": "/profile/Monique-Meerveld"
                },
                {
                    "user_id": "Seana Lee",
                    "user_href": "/profile/Seana-Lee"
                },
                {
                    "user_id": "Piper Redden",
                    "user_href": "/profile/Piper-Redden"
                },
                {
                    "user_id": "Gregory Kramida",
                    "user_href": "/profile/Gregory-Kramida"
                },
                {
                    "user_id": "James Collier",
                    "user_href": "/profile/James-Collier-30"
                },
                {
                    "user_id": "Indira Indu",
                    "user_href": "/profile/Indira-Indu-10"
                },
                {
                    "user_id": "Bhargav Sai Srinivas",
                    "user_href": "/profile/Bhargav-Sai-Srinivas"
                },
                {
                    "user_id": "James Elie",
                    "user_href": "/profile/James-Elie"
                },
                {
                    "user_id": "Mohit Gupta",
                    "user_href": "/profile/Mohit-Gupta-126"
                },
                {
                    "user_id": "Lê Việt Hùng",
                    "user_href": "/profile/Lê-Việt-Hùng"
                },
                {
                    "user_id": "Ardavan Farahvash",
                    "user_href": "/profile/Ardavan-Farahvash"
                },
                {
                    "user_id": "Janine White",
                    "user_href": "/profile/Janine-White"
                },
                {
                    "user_id": "Leland R. Beaumont",
                    "user_href": "/profile/Leland-R-Beaumont"
                },
                {
                    "user_id": "Bassam Karzeddin",
                    "user_href": "/profile/Bassam-Karzeddin-1"
                },
                {
                    "user_id": "Nicholas Stanek",
                    "user_href": "/profile/Nicholas-Stanek"
                },
                {
                    "user_id": "John Gould",
                    "user_href": "/profile/John-Gould-6"
                },
                {
                    "user_id": "Nelson Ferraz",
                    "user_href": "/profile/Nelson-Ferraz"
                },
                {
                    "user_id": "Valië Débora",
                    "user_href": "/profile/Valië-Débora"
                },
                {
                    "user_id": "Nic Astaire",
                    "user_href": "/profile/Nic-Astaire"
                },
                {
                    "user_id": "Jay Roberts",
                    "user_href": "/profile/Jay-Roberts-34"
                },
                {
                    "user_id": "Listra Y. Ginting",
                    "user_href": "/profile/Listra-Y-Ginting"
                },
                {
                    "user_id": "Chandru Pandian D",
                    "user_href": "/profile/Chandru-Pandian-D"
                },
                {
                    "user_id": "Tom McFarlane",
                    "user_href": "/profile/Tom-McFarlane"
                },
                {
                    "user_id": "Pedro Henrique Bernardinelli",
                    "user_href": "/profile/Pedro-Henrique-Bernardinelli"
                },
                {
                    "user_id": "Caleb Buttenhoff",
                    "user_href": "/profile/Caleb-Buttenhoff"
                },
                {
                    "user_id": "Calvin Chik",
                    "user_href": "/profile/Calvin-Chik"
                },
                {
                    "user_id": "Tim Cole",
                    "user_href": "/profile/Tim-Cole-7"
                },
                {
                    "user_id": "Ben Towne",
                    "user_href": "/profile/Ben-Towne-1"
                },
                {
                    "user_id": "Bennett W. Nelson",
                    "user_href": "/profile/Bennett-W-Nelson"
                },
                {
                    "user_id": "Travis Brauer",
                    "user_href": "/profile/Travis-Brauer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Pardi",
                "href": "/profile/Paul-Pardi"
            },
            "answer_text": "A fact is generally considered to be a proposition that is true. Propositions can be true or false. Consider proposition 1: objects fall to the earth in a vacuum at 9.8 m/s/s. That's generally considered a true proposition and so a fact. Proposition 2: There are no English sentences longer than 3 words. That's false because its self refuting and so wouldn't be considered a fact.  It's also important to distinguish between the truth and falsity of a proposition and an individual's knowledge of that proposition's truth value. Proposition 1 may true but it could have been the case that no one knows it's true. On empiricist and rationalist views, a proposition's truth value is unrelated to whether one knows of that truth value or not. This is not the case on postmodernist theories. ",
            "date": "Answered July 17, 2012",
            "views": "84",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ka'uilani Kim",
                    "user_href": "/profile/Kauilani-Kim"
                },
                {
                    "user_id": "David Vanderschel",
                    "user_href": "/profile/David-Vanderschel"
                },
                {
                    "user_id": "Abhay Bothra",
                    "user_href": "/profile/Abhay-Bothra"
                },
                {
                    "user_id": "Joshua Engel",
                    "user_href": "/profile/Joshua-Engel"
                },
                {
                    "user_id": "Greg Linster",
                    "user_href": "/profile/Greg-Linster"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barthelemy Lature",
                "href": "/profile/Barthelemy-Lature"
            },
            "answer_text": "Theoretically, a fact is true, by definition. Actually, saying \"it is\" is enough, and already an pleonasm, let alone \"a fact is true\". But enough fo rlanguage and logics.  But because it's people that handle what they assume are facts, are not facts. Science and other human-based activities are full of examples where things are considered facts only for some time, even today.If the people who wrote the history books wrote a funny History, is what you have always know a bunch of facts based on that or is it what everyone agrees (consensually assume)  is a fact?For how long was the Earth flat or E=mc^2? There is a great deal of faith, ironically, in the most faith-averse activities of mankind. We are believing machines, that lack the time and wisdom to say just how fragile and short-lived our belief systems are. ",
            "date": "Answered November 1, 2015",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Vanderschel",
                "href": "/profile/David-Vanderschel"
            },
            "answer_text": "I think the issue here is that there are many false propositions which are believed (or have been) by many to be facts.  The problem is that belief does not confer factuality.  Scientists tend to avoid asserting propositions as facts because they are well aware that a more precise and more accurate proposition may come along.  Thus they tend to speak in terms of quantified accuracy and probability of correctness, not in terms of facts.  Folks who do speak of facts tend to do so carelessly and skepticism is normally justified.  It is only in the unearthly realm of mathematics that one can assert facts with absolute confidence. ",
            "date": "Answered January 21, 2016",
            "views": "22",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Frank Weyl",
                    "user_href": "/profile/Frank-Weyl"
                },
                {
                    "user_id": "Neil Hiatt",
                    "user_href": "/profile/Neil-Hiatt"
                },
                {
                    "user_id": "George Zurich",
                    "user_href": "/profile/George-Zurich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dustin Neuman",
                "href": "/profile/Dustin-Neuman"
            },
            "answer_text": "A fact is a true proposition. From this it follows that necessarily all facts are true propositions. What does not follow is that all facts are necessarily true; that's a modal fallacy. To see this, consider the parallel case of bachelors: a bachelor is an unmarried man. From this it follows that necessarily all bachelors are unmarried men. What does not follow from this is that all bachelors are necessarily unmarried. And that's obvious, because my being a bachelor (like most facts) is contingent. ",
            "date": "Answered July 23, 2012",
            "views": "21",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Smith",
                    "user_href": "/profile/James-Smith-3709"
                },
                {
                    "user_id": "Joshua Engel",
                    "user_href": "/profile/Joshua-Engel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neil Hiatt",
                "href": "/profile/Neil-Hiatt"
            },
            "answer_text": "How can a fact be false? In the film, \"Yellowbeard,\" (a farcical comedy by members of the Monty Python troupe, among others) Gilbert (Marty Feldman) tried to smuggle a woman aboard a British warship. Captain Hughes, (James Mason) the commander said, The theory that a woman on board a ship is bad luck, is now a proven scientific fact.\" Seriously, centuries ago much of what was accepted as fact was arrived at not by the scientific method, but by logic- largely uninformed logic at that. These conclusions arrived at by such haphazard methods were considered to be facts, until the scientific method proved most of them to be false. ",
            "date": "Answered October 31, 2015",
            "views": "849",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bud Wood",
                "href": "/profile/Bud-Wood-1"
            },
            "answer_text": "Throughout my life, I have experienced many of my cherished facts being disputed.  Even now, we can experience many things that we accept as facts to become \"non-facts\".  My feeling is that the near further will bring more facts into question because there will be some very major changes on the horizon.  Look out because there will in all probability be big changes in western society. ",
            "date": "Answered August 7, 2012",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sigurd Vojnov",
                "href": "/profile/Sigurd-Vojnov"
            },
            "answer_text": "I think your professor means that facts are true bit not NECESSARILY TRUE ... Facts could have been otherwise ...right?The Germans MIGHT have won world war II ...So its true but not necessarily true that the Germans lost the war... ",
            "date": "Answered October 31, 2015",
            "views": "173",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tim Harding",
                "href": "/profile/Tim-Harding-7"
            },
            "answer_text": "A fact is an item of knowledge, that is, a true belief that we are justified in believing as true. So by definition, a fact cannot be false. If a fact that was thought to be true is later found to be false, it is no longer a fact. ",
            "date": "Answered January 27, 2020",
            "views": "81",
            "upvotes": " View Sharers"
        },
        {
            "author_info": {
                "name": "Acaz Pereira",
                "href": "/profile/Acaz-Pereira"
            },
            "answer_text": "In Math a axiom is a premise so evident as to be accepted as true without controversy. ",
            "date": "Answered July 11, 2012",
            "views": "849",
            "upvotes": "0"
        }
    ]
}