{
    "title": "Can you find meaning in a life full of suffering? - Quora",
    "tags": [
        "Meaning of Life",
        "Philosophy of Everyday Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Sky Amory",
                "href": "/profile/Robert-Sky-Amory"
            },
            "answer_text": "Yes. A life full of suffering is a life that offers a tremendous opportunity for anyone who is happy and full of bliss to share that joy and bliss. I am always interested in sharing my perspective with those who suffer. My perspective is that anyone who suffers is employing language and self talk that does not celebrate the miracle of being alive. Those who suffer don’t know how to appreciate life. They need models who do appreciate life. These models can offer them an example of how to appreciate life. If you are suffering, try to find ppl who are enjoying life and try to emulate their attitude and try to understand their words. Try to feel their life affirming energy. Learn how to look at the positive side of life. Listen to the wisdom of your bliss. This requires that you identify those bliss filled moments in your life, understand them, and seek more of them. Most importantly: FOCUS. Focus on what you want, NOT on what you DON’T want… ",
            "date": "Answered March 7, 2018",
            "views": "269",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kiran TP",
                    "user_href": "/profile/Kiran-TP-3"
                },
                {
                    "user_id": "Bruce Galbreath",
                    "user_href": "/profile/Bruce-Galbreath"
                }
            ]
        },
        {
            "author_info": {
                "name": "Scott Wayne Bryan",
                "href": "/profile/Scott-Wayne-Bryan"
            },
            "answer_text": "Suffering is just a cognitive technology; a tool that minds have evolved to motivate a particular sort of introspective reaction. If you were always happy you’d have no reason to do anything. You’d probably starve to death. The myriad of ways that our minds have of making us unhappy or unsatisfied, or bored, depressed, miserable, etc. are like the pain we experience from being injured—all of these stimulus evolved because they tend to improve our survivability. They focus our attention in ways that tend to inspire us to do something to mitigate the unpleasantness. Emotions are just the best mechanism that evolution has so far stumbled upon to predispose critters to behave in ways that enhance their fitness. Our genes are completely mindless. They are totally incapable of appreciating, caring, or even comprehending how unpleasant their handiwork is capable of making us feel. Their only feedback is our differential reproductive success. If they end up leaving us so emotionally distraught that we kill ourselves then they’re less likely to persist in gene pool. But just shy of that is probably highly effective at motivating us to look for ways to make ourselves feel better. And that’s probably the reason that suffering is so very unpleasant. Because it really does need to be in order to do what it is supposed to do. ",
            "date": "Answered July 23, 2018",
            "views": "641",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kiran TP",
                    "user_href": "/profile/Kiran-TP-3"
                },
                {
                    "user_id": "Kenedia Lalo",
                    "user_href": "/profile/Kenedia-Lalo-1"
                },
                {
                    "user_id": "Roy Edric",
                    "user_href": "/profile/Roy-Edric"
                },
                {
                    "user_id": "Bruce Galbreath",
                    "user_href": "/profile/Bruce-Galbreath"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suzy McKee Charnas",
                "href": "/profile/Suzy-McKee-Charnas"
            },
            "answer_text": "Because your soul incarnates into an animal body, and animal bodies come equipped with senses attuned to both pleasure and pain in order to stand a chance of surviving long enough to fulfill their animal functions: growing up, reproducing, and dying. Your soul, meanwhile, undergoes an experience of separation and isolation because it’s incarnate in an animal body that’s individual. Humans are social, but don’t normally have telepathy or even an extreme empathy that might offset our individuation into discreet bodies and minds. In my opinion, that bundle of limitations is exactly what we incarnate to experience, probably because that’s the only way we *can* experience it, and experiencing it is a crucial part of our spiritual existence (and, presumably, spiritual evolution of some kind). I read a novel recently in which a major character reflects that the goal that draws immortal and invulnerable souls into such perilous and often painful circumstances is exactly the opportunity to achieve something that doesn’t exist for beings in a metaphysical state: the extreme challenge of striving against and overcoming the separation of physical embodiment to achieve, however fleetingly, a true intimacy that’s all the more valuable and significant and rewarding because of the difficulty of achieving it. I think that’s an interesting idea. It doesn’t diminish the pain of suffering and constraint, which is powerful, often overwhelmingly so, in people’s lives. But it’s a reminder that there are also keenly positive aspects of the physical predicament: only if I am I and you are you can we experience loving each other. We can only taste that ripe melon and feel the strength of our youthful limbs if we have the physical senses that provide these sensations. If as a single bare soul I’m little more than a small range of vibrations among a vast sea of similar beings, then can I even distinguish the vibrations of a piece of music? I doubt I can hear it at all in such circumstances. See, I don’t think we, as souls, are forced to incarnate; I think we *want* to incarnate, and that’s why we keep coming back here. In the bare-soul state between lives, with no physical nerves or sensory receptors, I doubt that we can even hold onto any real concept of pain, because there isn’t any where we are at that time. So we make choices there that look absolutely *nuts* when looked at from here, in the middle of the real-world consequences. Like, you book your dream trip — seeing Angkor Wat is something you’ve always wanted to do. And you get there, and the mosquitoes! The humidity is crushing you. The place is swarming with tourists; the noise, the heat, the runs — and then a bit of ancient stone crumbles and you fall down and break your wrist badly, and it takes forever to heal and is never quite right again, and you have to go home early. But you saw a fantastic sunset there. You had an inexplicable moment of extraordinary peace and silence that made you cry, and there was a souvenir seller who seemed so familiar and so welcoming to you forgot the temples for a bit and just enjoyed chatting with her (can’t remember what was said, that was trivial — but the connection was amazing and unforgettable). Next time — polar bears, before they’re gone — and an old friend wants to show up in that life with crucial help. So you book another trip. ",
            "date": "Answered July 23, 2018",
            "views": "230",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kiran TP",
                    "user_href": "/profile/Kiran-TP-3"
                },
                {
                    "user_id": "Kenedia Lalo",
                    "user_href": "/profile/Kenedia-Lalo-1"
                },
                {
                    "user_id": "Jeni Says",
                    "user_href": "/profile/Jeni-Says"
                },
                {
                    "user_id": "Ellen Drager",
                    "user_href": "/profile/Ellen-Drager"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deepak Badlani",
                "href": "/profile/Deepak-Badlani-2"
            },
            "answer_text": "Suffering is an illusion. Generally we either think about the past or future and create problems in our head. Chances of happening such things might be negligible sometimes but still thoughts pops up. Thinking about the past or future all the time is life full of suffering. Solution is very simple & sounds cliche. The solution is to just deep breathe for 2–3 minutes. It calms your nerves and helps you to come back to present. What we all have is present in our hand. Sounds very familiar. I am not telling you to forget your goals or don't be scared. Just think about what can you do best today to reach closer to your goal. Revisit your goals and ideas once in a month. Keep track of it where are you heading. Divide and conquer. P.S. Here goals can refer to your career, Hobbies, personal relationships, emotional relationships,etc. Hope it helps :) ",
            "date": "Answered July 23, 2018",
            "views": "204",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Roy Edric",
                    "user_href": "/profile/Roy-Edric"
                }
            ]
        },
        {
            "author_info": {
                "name": "Angela V. Woodhull",
                "href": "/profile/Angela-V-Woodhull"
            },
            "answer_text": "13-year-old Anne Frank certainly did. Trapped in an attic for many years, hiding out from the Nazis, Anne Frank kept a diary. Here are some of her quotes: “How wonderful it is that nobody need wait a single moment before starting to improve the world.” “It's really a wonder that I haven't dropped all my ideals, because they seem so absurd and impossible to carry out. Yet I keep them, because in spite of everything, I still believe that people are really good at heart.” “Think of all the beauty still left around you and be happy.” “I can shake off everything as I write; my sorrows disappear, my courage is reborn.” “I don't think of all the misery, but of the beauty that still remains.” [Anne Frank was eventually captured and killed by the Nazis. Read the Diary of Anne Frank, or watch the movie.] Anne Frank Quotes (Author of The Diary of a Young Girl)  ",
            "date": "Answered March 7, 2018",
            "views": "18",
            "upvotes": " View 23 Upvoters",
            "upvoters": [
                {
                    "user_id": "Roy Edric",
                    "user_href": "/profile/Roy-Edric"
                },
                {
                    "user_id": "Deexa Raaj Patnaik",
                    "user_href": "/profile/Deexa-Raaj-Patnaik"
                },
                {
                    "user_id": "Carol Stather",
                    "user_href": "/profile/Carol-Stather"
                },
                {
                    "user_id": "Tom Weiss",
                    "user_href": "/profile/Tom-Weiss-14"
                },
                {
                    "user_id": "Soa Firdaus",
                    "user_href": "/profile/Soa-Firdaus"
                },
                {
                    "user_id": "Behrooz booyeh",
                    "user_href": "/profile/Behrooz-booyeh"
                },
                {
                    "user_id": "Nishan Ghimire",
                    "user_href": "/profile/Nishan-Ghimire-6"
                },
                {
                    "user_id": "Brian Ketaren",
                    "user_href": "/profile/Brian-Ketaren"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Micah-Moose"
                },
                {
                    "user_id": "Bryn Grunwald",
                    "user_href": "/profile/Bryn-Grunwald"
                },
                {
                    "user_id": "William Jackson",
                    "user_href": "/profile/William-Jackson-277"
                },
                {
                    "user_id": "Steve Schwer",
                    "user_href": "/profile/Steve-Schwer"
                },
                {
                    "user_id": "Habiba Najwa",
                    "user_href": "/profile/Habiba-Najwa"
                },
                {
                    "user_id": "Florence Hood",
                    "user_href": "/profile/Florence-Hood"
                },
                {
                    "user_id": "André Kuster-Cid",
                    "user_href": "/profile/André-Kuster-Cid"
                },
                {
                    "user_id": "Aman Kumar Parkar",
                    "user_href": "/profile/Aman-Kumar-Parkar"
                },
                {
                    "user_id": "Shannon McRee",
                    "user_href": "/profile/Shannon-McRee-1"
                },
                {
                    "user_id": "Sepideh Nobar",
                    "user_href": "/profile/Sepideh-Nobar"
                },
                {
                    "user_id": "Shell Majumdar",
                    "user_href": "/profile/Shell-Majumdar"
                },
                {
                    "user_id": "Jennifer Feinstein",
                    "user_href": "/profile/Jennifer-Feinstein-2"
                },
                {
                    "user_id": "Advait Ghosh",
                    "user_href": "/profile/Advait-Ghosh-1"
                },
                {
                    "user_id": "Robert E Felker",
                    "user_href": "/profile/Robert-E-Felker"
                },
                {
                    "user_id": "Vlad Miu",
                    "user_href": "/profile/Vlad-Miu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paula Craig",
                "href": "/profile/Paula-Craig-7"
            },
            "answer_text": "From what I have read and learned myself. The more you suffer, the more you are learning. This earth is a negitive planet, a school for our souls to learn, experience and perfect our souls. Can't do this work in a perfect, loving world such as the other side or home. We plan our lives, live the life we planned in hopes that one day we will graduate from these earth lives to become the most perfect soul we can be for God. ",
            "date": "Answered July 27, 2018",
            "views": "71",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bruce Galbreath",
                "href": "/profile/Bruce-Galbreath"
            },
            "answer_text": "Of course a person can find meaning in a life of suffering. Parents sometimes suffer greatly to advance the interests of their offspring, and find doing so to be the most meaningful aspect of their lives. Does your question mean a life full of suffering to no good purpose, just suffering and that’s all? It’s sounds hellish, and if anyone had a justification for seeking to end their life, it would be that person. Even so, a person might live in constant pain and still find meaning in the care and help that other people tried to give, even if it didn’t really help. Finding out that others care about you is something good, even if it doesn’t cure the underlying problem. ",
            "date": "Answered July 23, 2018",
            "views": "147",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ken Mason",
                "href": "/profile/Ken-Mason-7"
            },
            "answer_text": "A life of suffering is not one of God’ requirements to become holy. Yes there is suffering for what you believe in because everyone has a theory of what is right. That’s the problem it’s an unproven theory. If you really want to find the meaning to life then you must meditate and pray to God to give you the answer for it is written in the scriptures “Seek and you shall find, ask and you shall receive, knock and it shall be open unto you”. ",
            "date": "Answered March 8, 2018",
            "views": "75",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Diksha Chilana",
                "href": "/profile/Diksha-Chilana"
            },
            "answer_text": "Life is full of suffering because of our thinking. We never think positive in our life, we want things to happen according to our will. We never accept the thing in the way they happen to us. There is no problem in life who compels us to suffer, it is our mind, our way of thinking that makes us sufferer. It is in your hands how to react to your life. ",
            "date": "Answered July 23, 2018",
            "views": "130",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jeffrey Werbock",
                "href": "/profile/Jeffrey-Werbock"
            },
            "answer_text": "Do you know how an incandescent lamp works? Electricity is sent through a tungsten filament which both conducts and resists that electrical wave. The conduction enables it to pass through; the resistance to that passage through is what heats up the filament. In response, the filament radiates light and heat (mostly heat which is why they are so wasteful as sources of light). Life is like a filament; it both conducts and resists the flow of electric currents passing through. When that current is strong and it flows through our mind, we suffer. We radiate more energy when we suffer. Why? That’s what we do, that’s what we are: we are consumer / transformers / radiators of cosmic energy, didn’t you know that? So our suffering steps up production (hungry cosmos, what can I say). ",
            "date": "Answered July 23, 2018",
            "views": "152",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Roy Edric",
                    "user_href": "/profile/Roy-Edric"
                },
                {
                    "user_id": "Imad Khoury",
                    "user_href": "/profile/Imad-Khoury-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sebastian Mercer",
                "href": "/profile/Sebastian-Mercer"
            },
            "answer_text": "One can certainly frame it that way, “suffering”; it is valid. One can also frame it as “challenging”. I prefer the latter. Life is about problem solving. Every advance humans have made was first framed as a problem to be solved. ",
            "date": "Answered July 23, 2018",
            "views": "82",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tanish Sing",
                "href": "/profile/Tanish-Sing"
            },
            "answer_text": "So that we can grow ",
            "date": "Answered July 23, 2018",
            "views": "29",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jakir Ahmed",
                "href": "/profile/Jakir-Ahmed-24"
            },
            "answer_text": "No ",
            "date": "Answered March 7, 2018",
            "views": "66",
            "upvotes": "0"
        }
    ]
}