{
    "title": "Can anything be absolutely objective? - Quora",
    "tags": [
        "Objectivity",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aalok Singh",
                "href": "/profile/Aalok-Singh-19"
            },
            "answer_text": "Yes & No.....It depends from person to person..... And on the situation and on the subject of the moment.....Being objective means unbiased or uninfluenced, not letting any emotions or personal opinions come into picture while making any decision...SO.... Again Yes & No... Things can be absolutely objective for a person whereas the same thing can be subjective for another person..... Simple example can be a death sentence.... When a judge listens to the both sides of appeal, towards the suspect and against the suspect... He is applying the codes of law to every sentence he listens to, whereas at the same time the close friends and relatives are hoping the judge shows some mercy and lets go of the suspect as they are biased with emotions....In today's life people are becoming more and more rational and objective towards things and relations... While making friends, while employing people even in very close connected relations they find a reasons to be in those relations and most of the reasons they search for are materialistic and not even once while thinking of such bonds do they think subjectively....We are becoming mechanical as fast as the technology is growing.... First in our actions, then in our behavior and now also in our thoughts..... Soon the science fiction movies that showed our world taken over by robots will come true, however the only difference will be there will be no resistance from the mankind..... We will be more than happy to join the brigade as more or less we will become like them only in flesh and blood.... ",
            "date": "Answered November 26, 2015",
            "views": "251",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Andy Zhang",
                "href": "/profile/Andy-Zhang-160"
            },
            "answer_text": "The only almost objective viewpoint I can think of, is a viewpoint that’s been said to be objective by all. If everybody say that it is objective, then it is — it would better be. I don’t think there is a true objective viewpoint — unless we include God — But there is this idea of being objective. However, the idea of being objective, is by itself subjective. So my logic is that some thing could be objective, only when there is someone considers it to be objective. We can find countless examples of being unable to decide war casualty. One country says it was 50 thousand while the other says it was 10 thousand. So when you read a responsible article that particularly studies the war casualty, you find it say something like “The casualty of the war, by the report from Doctor Blabla, which we believe is the most objective and arcurate count, is 35 thousand.” The point is that they have to decide something to be objective. So the objectivity is decided. And that is completely subjective. ",
            "date": "Answered June 9, 2016",
            "views": "555",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ryan Spackman",
                    "user_href": "/profile/Ryan-Spackman"
                }
            ]
        }
    ]
}