{
    "title": "Can something be neither a truth nor a lie? - Quora",
    "tags": [
        "Truth",
        "Lies and Lying"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Marie",
                "href": "/profile/Daniel-Marie"
            },
            "answer_text": "Well well well. I’m scratching my head at this question and the profound answers that have already been given. I am often considering a similar yet contrary question—if something can be both true and false. And for that, yes a premise can be relationally true or false depending on the domain or context. Given the 24 time zones in the world, the statement that it is approximately 5:00 PM on June 21 is true for me in CST in Iowa, U.S.A. but it is utterly false for someone writing an answer in Tokyo, Japan where it is already 7:00 AM on Monday, June 22 (14 hours ahead of my time). While there is a consistent frame of reference to apply the proper time for any location, the maxim that “it is 5 o’clock somewhere” often stated as a form of humor or jesting gives an understanding of the complex nature of Earth time. But for something being neither true nor false, I guess countless things could be this way. A lot of it would also depend on perspective, domain, or frame of reference. I can’t ponder this type of question too long as before I have often taken a few days or weeks to get over the mental abyss I’ve found myself in from similar questions. But one thing I can think of off the bat is some problems in mathematics. The answer to the problem “what is a given number x divided by zero” is always undefined. This is easily understood if you do a simple association(as explained by the Dr. Math FAQ link above): 10 divided by 5 would be 2 as 2 multiplied by 5 is 10. But 10 divided by 0 would be x as x multiplied by 0 would have to equal 10. Since any number multiplied by 0 would be 0, there is no answer that can ever be divided by 0. So, an answer to any number divided by zero would be neither true nor false as there is no answer to this problem. It is undefined. That’s as far as I can go. Others can go much farther and back I know. But my brain is already starting to hurt. Thank you for a very profound question. ",
            "date": "Answered June 21, 2020",
            "views": "252",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Matt Carden",
                    "user_href": "/profile/Matt-Carden-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jonathan Atchley",
                "href": "/profile/Jonathan-Atchley"
            },
            "answer_text": "I’d hazard to say no. Philosophically speaking, truth is agreeing that something one makes a judgment about corresponds with reality. If I say that which is, exists, by definition that statement is true. If one claims donuts help you gain weight, by and large that is true, though some who eat donuts may have metabolisms that aren’t affected as such. This general statement would need to be qualified to be completely true. Simply considering anything, like “pineapple,” isn’t asserting a truth. Something must be predicated about that pineapple for it to be considered a truth or falsehood (“pineapple juice is sweeter than cranberry juice”). It is true that some truths can only be known when all is said and done: “their marriage was, overall, a success.” First of all, what does one mean by success, and then has this marriage met those standards? But things in themselves, like a piece of paper—are not technically speaking, true or false. They just are. For something to be true, one must assert a judgment about it and verify or deny that it represents experience as I and others know it. This aspect of truth means that it must cohere with what is, that in this place at this time people would agree paper is flammable. So, that paper is flammable is true. Paper made with inflammable properties will not burn is also true, but that is a different statement—a different reality. So far, we see that truth must correspond to what is real, and it must be coherent to experience. Even if, for instance, one believes or does not in the existence of God, it is true to say that either God does or does not exist. There is no middle ground here. The reason something cannot be neither true or false is because of the principle of non-contradiction, which asserts that something can not be and be at the same time in the same way. If my reality can be contradicted to what is really real, then I know I’ve made a mistake. If my reality contradicts your reality, one of us is mistaken. Something cannot be true and false, properly speaking. If it can be neither true nor false, what is the point of communicating? What is the point of truth? ",
            "date": "Answered June 22, 2020",
            "views": "104",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Constantin Lungu",
                "href": "/profile/Constantin-Lungu"
            },
            "answer_text": "tl;dr: No, it can’t. It can be so only if you refer to it as a superposition of states, which implies it’s both. So it can be just a truth or a lie, or both. But ultimately, it cannot be neither of them. To explain my reasoning, let’s mix in some quantum theory and spicy things up. In quantum theory, there is a concept named ‘Superposition’. Superposition is a principle of quantum theory that describes a challenging concept about the nature and behavior of matter and forces at the sub-atomic level. The principle of superposition claims that while we do not know what the state of any object is, it is actually in all possible states simultaneously, as long as we don't look to check. It is the measurement itself that causes the object to be limited to a single possibility. [1] Superposition is simply illustrated by the Schrodinger’s cat analogy: In 1935, Erwin Schrodinger proposed an analogy to show how superposition would operate in the every day world: the somewhat cruel analogy of Schrodinger's cat. Here's Schrödinger's (theoretical) experiment: We place a living cat into a steel chamber, along with a device containing a vial of hydrocyanic acid. There is, in the chamber, a very small amount of a radioactive substance. If even a single atom of the substance decays during the test period, a relay mechanism will trip a hammer, which will, in turn, break the vial and kill the cat. The observer cannot know whether or not an atom of the substance has decayed, and consequently, cannot know whether the vial has been broken, the hydrocyanic acid released, and the cat killed. Since we cannot know, the cat is both dead and alive according to quantum law, in a superposition of states. It is only when we break open the box and learn the condition of the cat that the superposition is lost, and the cat becomes one or the other (dead or alive). This situation is sometimes called quantum indeterminacy or the observer's paradox: the observation or measurement itself affects an outcome, so that the outcome as such does not exist unless the measurement is made. (That is, there is no single outcome unless it is observed.) [1] So there you have it. Something is neither a truth or a lie for you unless strong and logical evidence is provided to you, in order for you to decide whether that holds true, or not. Following, as long as you don’t take any decisions, that ‘something’ is both false and true, it’s both unless you choose it to be one of the two. In simple, day-to-day language, you could call something neither a truth or a lie (e.g. I’m not sure if it’ll rain tomorrow, so ‘It will rain tomorrow’ is neither a truth or a lie), while in fancy language stating that it’s a superposition of states. But do not be mistaken: it’s not the universe who does not have an answer for you, it’s you who has yet to decide. References: [1] What is superposition? - Definition from WhatIs.com ",
            "date": "Answered July 24, 2016",
            "views": "392",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Christine Leov-Lealand",
                "href": "/profile/Christine-Leov-Lealand"
            },
            "answer_text": "Everything we perceive simply is: it's neither truth nor lie. Truth or lie is your subjective judgment. It's a horrible treadmill to be on. Buddhism teaches to let all that mental interpretation go and simply be. I like Osho’s ideas I'm simply saying that there is a way to be sane. I'm saying that you can get rid of all this insanity created by the past in you. Just by being a simple witness of your thought processes. It is simply sitting silently, witnessing the thoughts, passing before you. Just witnessing, not interfering not even judging, because the moment you judge you have lost the pure witness. The moment you say “this is good, this is bad,” you have already jumped onto the thought process. It takes a little time to create a gap between the witness and the mind. Once the gap is there, you are in for a great surprise, that you are not the mind, that you are the witness, a watcher. And this process of watching is the very alchemy of real religion. Because as you become more and more deeply rooted in witnessing, thoughts start disappearing. You are, but the mind is utterly empty. That’s the moment of enlightenment. That is the moment that you become for the first time an unconditioned, sane, really free human being. Osho Osho Quotes (Author of Courage) ",
            "date": "Answered July 24, 2016",
            "views": "12",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Magnus Auru'in",
                    "user_href": "/profile/Magnus-Auruin"
                },
                {
                    "user_id": "Robert O'Donnell",
                    "user_href": "/profile/Robert-ODonnell-13"
                },
                {
                    "user_id": "Brian N Tran",
                    "user_href": "/profile/Brian-N-Tran"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nick Picard",
                "href": "/profile/Nick-Picard"
            },
            "answer_text": "Only a tiny, tiny percentage of things are true or false. Almost everything is neither. The following things are neither true nor false, for example: an appleevery dog on earthmy imaginary friend Greg (“real” isn’t the same thing as “true”)seeing your breath when it’s cold outa salsa danceyour favourite song played backwardsthe statement: “wooden vowels stink armature pants”the question: “do you like hot dogs?”So, what things are either true or false? Well-formed propositions. “it is raining out”“my car has four wheels”“zebras are purple”If you counted up all the things in the universe, I bet so few of them would be well-formed propositions, it would round down to zero. ",
            "date": "Answered June 21, 2020",
            "views": "134",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "EVerything NOthing",
                    "user_href": "/profile/EVerything-NOthing-7"
                },
                {
                    "user_id": "Robert Latta",
                    "user_href": "/profile/Robert-Latta-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Hayward",
                "href": "/profile/Matthew-Hayward-11"
            },
            "answer_text": "A lie is an intentional statement of falsehood with intent to deceive - so clearly not all statements are truth or lies - as one can make false statements without knowing they are false, or without intent to deceive. I wonder if you are instead asking about the truth status of any given statement, which is an interesting question about an axiom of classical logic. The traditional laws of thought state that: The law of identity: for any proposition A: A=AThe law of non-contradiction: The statement: “A and not-A” is falseThe law of excluded middle: For all propositions A, either A is true or A is falseOne way to interpret your question is as asking whether the law of the excluded middle is true. To this we can say: it has been taken as an axiom in many logical systems for thousands of years, but by no means are we required, somehow, by nature to accept that it must be. In fact branches of logic and math called intuitionist logic and portions of constructive mathematics do not assume the law of the excluded middle holds, and see where reasoning can take them based on that. So - in this sense whether “every statement is either true or false” can be thought of as a potential axiom for further reasoning, and interesting consequences arise from adopting it, or not. ",
            "date": "Answered July 24, 2016",
            "views": "179",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Peter Townsend",
                "href": "/profile/Peter-Townsend-9"
            },
            "answer_text": "This question is neither true nor false; all questions, commands, admissions of feelings, opinions, aesthetic judgements… are neither. They may be sincere or insincere, honest or not, ridiculous or sensible; but truth is not a standard to be applied. And since these kinds of utterances may be in the majority, that means that we should be wary of using the term. The kinds of statements that can be judged as ‘true’ or not are, broadly, only those that may otherwise be judged ‘false’, ie. lies or errors - deliberate or accidental. These are claims to truth: facts, generalisations (perhaps in the form of theories or doctrines), descriptions. ",
            "date": "Answered June 22, 2020",
            "views": "41",
            "upvotes": " Answer requested by Efrayim Bulka",
            "upvoters": [
                {
                    "user_id": "Mark Horton",
                    "user_href": "/profile/Mark-Horton-8"
                },
                {
                    "user_id": "Kevin Mathison",
                    "user_href": "/profile/Kevin-Mathison"
                },
                {
                    "user_id": "Saif Al-Bahlani",
                    "user_href": "/profile/Saif-Al-Bahlani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Goulding",
                "href": "/profile/Jon-Goulding"
            },
            "answer_text": "Hello. That greeting was neither true nor false since it makes no factual claim. The same goes for your question, for commands and for meaningless utterances. According to some philosophers , certain things we say which appear to be making factual claims actually are not. Emotivists, for example, would argue that to say ‘stealing is wrong’ is to express a feeling (like shouting ‘Boo!’) rather than to make a statement. ",
            "date": "Answered October 23, 2017",
            "views": "587",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brian N Tran",
                    "user_href": "/profile/Brian-N-Tran"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevin Michael McDaniel",
                "href": "/profile/Kevin-Michael-McDaniel"
            },
            "answer_text": "A sentence can be neither a truth nor a lie. If a sentence can not be verified to be true or false by use of our senses and perceptions, then the sentence is neither a truth nor a lie. A story can be neither a truth nor a lie. If a story can not be verified to be true or false by use of our senses and perceptions, then the story is neither a truth nor a lie. ",
            "date": "Answered October 11, 2016",
            "views": "58",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Magnus Auru'in",
                "href": "/profile/Magnus-Auruin"
            },
            "answer_text": "If you believe something is true, repeat it without the slightest means of doubt, and are truly not aware that it is wrong - then it is neither a truth nor a lie. Ta-daaa! A lie is consciously uttered. A willing deception. A logical fallacy, however, is when you think something is true but it isn’t -without any conscious action to state otherwise. ",
            "date": "Answered July 26, 2016",
            "views": "152",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Visako Nakhro",
                    "user_href": "/profile/Visako-Nakhro"
                },
                {
                    "user_id": "Anzan Shaan",
                    "user_href": "/profile/Anzan-Shaan"
                },
                {
                    "user_id": "Brian N Tran",
                    "user_href": "/profile/Brian-N-Tran"
                },
                {
                    "user_id": "Steven J Greenfield",
                    "user_href": "/profile/Steven-J-Greenfield"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suretta Williams",
                "href": "/profile/Suretta-Williams"
            },
            "answer_text": "Thanks for the A2A Sure, facts are facts. They are neither a truth or a lie. Something only becomes a lie, when you use it to misrepresent something. For example: if “trees have green leaves,” by itself is a fact. If you say, “ALL trees have green leaves,” that’s a falsehood (lie), but if you say, “Some trees have green leaves,” that’s the truth. The idea of true or false has to do with how and why something is represented or misrepresented. That’s why there are trick questions on multiple choice tests — they will read, “If all leaves come from trees, and all leaves are green, all green leaves come from trees.” ← that’s truth But, “If all leaves come from trees, and some leaves are green, all trees have green leaves.” ← that’s false. ",
            "date": "Answered July 25, 2016",
            "views": "355",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Marija Djuzic",
                    "user_href": "/profile/Marija-Djuzic"
                },
                {
                    "user_id": "Hadi Nazzal",
                    "user_href": "/profile/Hadi-Nazzal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saif Al-Bahlani",
                "href": "/profile/Saif-Al-Bahlani"
            },
            "answer_text": "In Discrete Math there is an introductory topic about Logic Axomatic: True, False. and in Philosophy it's ‘Reasoning’. If brains can't detect fallacies in sentences or Computers can give us correct Output e.g 1+1 = 2. Then I think the world will be a in a crisis. In addition True & False don't need validation or proof. It's True or False ( 1 or 0) . Neither True or False, I believe in discrete math CANT exist. If you say neither means they must be an answer to the statement with either True or False. Please anyone correct me if am wrong. I only have a minor in math. ",
            "date": "Answered October 23, 2017",
            "views": "338",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Janos Projnow",
                "href": "/profile/Janos-Projnow"
            },
            "answer_text": "The following sentence is neither true nor false at the same time: “Irrational numbers have not an end in any numerical representation.” it is true because they simply have not an end when you try to approach their value (from down to up) , butit is false, because they have a very exact beginning, which is an end, when you approach them from up to down.So they are neither open nor closed, and so the sentence above is neither true nor false. ",
            "date": "Answered June 21, 2020",
            "views": "59",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jeeves Christian Josol",
                "href": "/profile/Jeeves-Christian-Josol"
            },
            "answer_text": "Yes. I am handsome. Is it true or false? Subjectively, it might be true to me. Objectively, it is neither true or false. My face has its form but it is not true that I am handsome or ugly. It is only a description. Subjectively, it is. Objectively, it isn’t. How things are described can also neither be true or false like how morality itself isn’t true but has been invented only to improve the harmony between humans and other humans and humans and other species. ",
            "date": "Answered November 3, 2017",
            "views": "303",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anzan Shaan",
                "href": "/profile/Anzan-Shaan"
            },
            "answer_text": "Yes it can. It is not a lie if you believe it - George Costanza A person is wearing a green shirt. You can see it’s green. But someone else tells you that it is not green but blue and that you are color blind. So you believe him. Now, to you, that person is wearing blue, when he is not. So that person wearing blue is neither the truth nor a lie. ",
            "date": "Answered July 27, 2016",
            "views": "96",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Larry Terrell",
                "href": "/profile/Larry-Terrell-3"
            },
            "answer_text": "Folks have managed to achieve that result, to wit: “This statement is false.” Is the above statement true or false? If it’s true, then what it’s saying — namely, that it’s false — is therefore true, which is a contradiction. If it’s false, then what it’s saying — namely that it’s false — is therefore false, which is also a contradiction. ",
            "date": "Answered June 22, 2020",
            "views": "38",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Suvanssh Mahajan",
                    "user_href": "/profile/Suvanssh-Mahajan"
                },
                {
                    "user_id": "Brian N Tran",
                    "user_href": "/profile/Brian-N-Tran"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Ranger",
                "href": "/profile/William-Ranger-1"
            },
            "answer_text": "Everything is either a truth, or a lie. The viewer makes a decision. In educated viewers, that decision may be couched in language of complexity. In engineers, and mathematicians, probability, or suitability considerations come in. Among politicians, re-electability has a primary role. Among teachers, the impact of the official program on the individual learner may be the biggest factor, outside of not being fired. ",
            "date": "Answered July 24, 2016",
            "views": "151",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Daniel Marie",
                    "user_href": "/profile/Daniel-Marie"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Finney",
                "href": "/profile/Michael-Finney-18"
            },
            "answer_text": "Yes. There are paraconsistent logics that allow that. Some allow and expression to be neither true nor false. Some allow an expression to be both true and false. And some allow both situations. ",
            "date": "Answered June 21, 2020",
            "views": "43",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Saif Al-Bahlani",
                    "user_href": "/profile/Saif-Al-Bahlani"
                },
                {
                    "user_id": "Mara Obelcz",
                    "user_href": "/profile/Mara-Obelcz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Santosh",
                "href": "/profile/Sandy-1788"
            },
            "answer_text": "The center. True and false two opposite direction. The center, the Shiva, the absolute, the constant is the LAST TRUTH. Truth cannot be true or false. Your truth can be different from my truth. But you may be right and I may be wrong. Truth will remain truth for both. It is beyond right and wrong. ",
            "date": "Answered June 21, 2020",
            "views": "67",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gary Cieszynski",
                "href": "/profile/Gary-Cieszynski"
            },
            "answer_text": "theres alot of things.like WHATS THE MEANING OF LIFE… everyone will have a different answer. so i think you got the point ",
            "date": "Answered October 23, 2017",
            "views": "88",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Suvanssh Mahajan",
                    "user_href": "/profile/Suvanssh-Mahajan"
                }
            ]
        },
        {
            "author_info": {
                "name": "A Vaidya",
                "href": "/profile/A-Vaidya-1"
            },
            "answer_text": "If I told you that the Earth revolves around the sun, would that be a truth or a lie? A truth, obviously. So if I told you that the solar system revolves around the center of the milky way, would that be a truth or a lie? Most likely a truth. If I told you the universe was infinite, would that be a truth or a lie? We don’t know the answer, do we? And it’s not a truth or a lie. ",
            "date": "Answered July 24, 2016",
            "views": "115",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ken Adney",
                    "user_href": "/profile/Ken-Adney"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Wetzel",
                "href": "/profile/Tom-Wetzel-4"
            },
            "answer_text": "Sure. The moon is neither true nor false. The sentence “This sentence is false” is neither true nor false. ",
            "date": "Answered June 21, 2020",
            "views": "85",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Tony Lombardo",
                "href": "/profile/Tony-Lombardo-6"
            },
            "answer_text": "Many, many thing are neither true nor false. One such thing is a thesis. Every thesis every student has written throughout history—if written correctly—-is neither true nor false. ",
            "date": "Answered June 21, 2020",
            "views": "45",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Margaret McGill",
                "href": "/profile/Margaret-McGill-4"
            },
            "answer_text": "I don't believe a middle ground is possible here, it has to be true or false, a lie is a lie. Now if it was a choice between fact or fiction there can be a middle ground, until the facts are found. However truths or falsehoods are straightforward.A lie cannot have a middle ground and be true. ",
            "date": "Answered June 21, 2020",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "V. V. Raman",
                "href": "/profile/V-V-Raman-1"
            },
            "answer_text": "Every question. Peace. 22 June 2020 ",
            "date": "Answered June 23, 2020",
            "views": "9",
            "upvotes": " Answer requested by Efrayim Bulka"
        },
        {
            "author_info": {
                "name": "Gary Rocco",
                "href": "/profile/Gary-Rocco"
            },
            "answer_text": "Yes. “or”. ",
            "date": "Answered June 21, 2020",
            "views": "32",
            "upvotes": "0"
        }
    ]
}