{
    "title": "Can things just disappear? - Quora",
    "tags": [
        "Disappearing",
        "Hypothetical Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lucero De'Lucero",
                "href": "/profile/Lucero-DeLucero"
            },
            "answer_text": "The bonds that hold atoms together to form molecules are called covalent bonds. A covalent bond is a chemical bond formed by the sharing of one or more electrons, especially pairs of electrons, between atoms. For instance, most plants take light and use it to make bonds between carbon atoms and molecules of cellulose. I believe that for some reason which is not yet known, something at the atomic level disturbs or misaligns the electrons. These interruptions at the atomic-molecular level, cause the object to temporarily blink out of existence. As the electron (s) realign, the object blinks back into existence, sometimes at a different location. I don’t believe that the universe, god or wormhole is the reason for objects to spontaneously disappear. I don’t believe that it is a cause and effect of any consciousness. I would compare the incident it to the traffic on a highway. All it takes is one car on the highway to carelessly pull into another lane and disrupting the flow of traffic. Generally speaking, the traffic eventually realigns itself, often times several hundred yards down the road, and the flow of traffic returns to normal. ",
            "date": "Answered November 7, 2018",
            "views": "65",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rajkumar Sankhwar",
                    "user_href": "/profile/Rajkumar-Sankhwar"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Vlad-Ivandor"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nikki Ourand Lambert",
                "href": "/profile/Nikki-Ourand-Lambert"
            },
            "answer_text": "Thanks for the A2A, Scott. By the laws of our universe, things can’t just disappear. Here are some ideas where you can look: Is there a trash can near your bathroom counter, and if so, did you look there?How about the toilet? Weighty items that fall into the toilet can actually slide down into the closet bend. You’ll need a snake to get it out. (If you notice your toilet clogging or having difficulty flushing, that’s where it went.) Also, look on the floor between the back of the toilet and the wall.Do you have baseboard heating? It may have fallen on the floor, then slid under the baseboard.Good luck! ",
            "date": "Answered May 21, 2017",
            "views": "49",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Joey Lin",
                    "user_href": "/profile/Joey-Lin-52"
                },
                {
                    "user_id": "Farook Ajose",
                    "user_href": "/profile/Farook-Ajose"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Lyons",
                "href": "/profile/John-Lyons-22"
            },
            "answer_text": "Nope! You’re not crazy, I’ve had the same thought myself. If you empty that room you WILL find it. Whats happening is that you and everybody else are a lot less random than you think. That means that without meaning to you are probably skipping over the spot with the lost item again and again. To get around this search methodically one inch at a time. Pay no attention to how foolish looking in a clearly “empty” space may seem. If you have exhausted the possible, begin on the “impossible”! I assure you the item did not slip into a parallel universe but it may very easily have slipped into a crack you did not think it would fit into. ",
            "date": "Answered May 21, 2017",
            "views": "118",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jack Zander",
                    "user_href": "/profile/Jack-Zander-4"
                },
                {
                    "user_id": "Sakshi Tiwari",
                    "user_href": "/profile/Sakshi-Tiwari-174"
                },
                {
                    "user_id": "Jason Lee",
                    "user_href": "/profile/Jason-Lee-3148"
                },
                {
                    "user_id": "Tomasz Sowa",
                    "user_href": "/profile/Tomasz-Sowa-7"
                },
                {
                    "user_id": "Joey Lin",
                    "user_href": "/profile/Joey-Lin-52"
                },
                {
                    "user_id": "Vivian Yu",
                    "user_href": "/profile/Vivian-Yu-64"
                },
                {
                    "user_id": "Danish Rifqi",
                    "user_href": "/profile/Danish-Rifqi-2"
                },
                {
                    "user_id": "Jesper Affleckt",
                    "user_href": "/profile/Jesper-Affleckt"
                },
                {
                    "user_id": "Tolu Onafowokan",
                    "user_href": "/profile/Tolu-Onafowokan-1"
                },
                {
                    "user_id": "Kai Rune",
                    "user_href": "/profile/Kai-Rune"
                },
                {
                    "user_id": "Kay Gaucho",
                    "user_href": "/profile/Kay-Gaucho"
                },
                {
                    "user_id": "Joanna",
                    "user_href": "/profile/Joanna-5"
                },
                {
                    "user_id": "Farook Ajose",
                    "user_href": "/profile/Farook-Ajose"
                }
            ]
        },
        {
            "author_info": {
                "name": "Skylar Zuniga",
                "href": "/profile/Skylar-Zuniga-2"
            },
            "answer_text": "I contest the unanimous majority, things do phase in and out of existence. Now not disappear but all particles are waves, and they have been known to bounce in and out of what I would say are observable and non observable dimensions. Look up the uncertainty principle, particles are waves, and Schrödinger’s cat paradox. This world we inhabit is full of possibilities and amazing qualities. Enjoy it. ",
            "date": "Answered November 25, 2018",
            "views": "19",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Oliver Jones",
                    "user_href": "/profile/Oliver-Jones-16"
                },
                {
                    "user_id": "Sakshi Tiwari",
                    "user_href": "/profile/Sakshi-Tiwari-174"
                }
            ]
        },
        {
            "author_info": {
                "name": "Calen Riggs",
                "href": "/profile/Calen-Riggs"
            },
            "answer_text": "Maybe, just maybe you've been witness to the Disappearing Object Phenomena (DOP).That would, however, require that you eventually have found the object you've been looking for. Mass cannot simply be destroyed, so it's around. Maybe where you last thought you had it is simply not there. Memory lapses are normal, even in normal people. God speed in finding that watch. ",
            "date": "Answered May 21, 2017",
            "views": "2",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Oliver Jones",
                    "user_href": "/profile/Oliver-Jones-16"
                },
                {
                    "user_id": "Sakshi Tiwari",
                    "user_href": "/profile/Sakshi-Tiwari-174"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Reiss",
                "href": "/profile/Mike-Reiss-2"
            },
            "answer_text": "Yes. I don’t know how or why but it can and does happen. Just recently something I know was in a specific location was not at that location the next day. There is no logical explanation for it. ",
            "date": "Answered March 24, 2020",
            "views": "443",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Samantha Nicole Cash",
                    "user_href": "/profile/Samantha-Nicole-Cash-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rodrigo Leitao",
                "href": "/profile/Rodrigo-Leitao-4"
            },
            "answer_text": "According to quantum mechanics, yes. Thru quantum tunnelling. But the probability of the event is infinitesimal small. So no. It can't happen. ",
            "date": "Answered May 21, 2017",
            "views": "976",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rafique Adzam",
                    "user_href": "/profile/Rafique-Adzam-2"
                }
            ]
        }
    ]
}