{
    "title": "Can something defeat God? - Quora",
    "tags": [
        "Theology",
        "God",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Viraj Kanakia",
                "href": "/profile/Viraj-Kanakia"
            },
            "answer_text": "One of the mysteries of the Christian life is why God didn’t destroy Satan immediately after Satan sinned. We know that God will one day defeat Satan by throwing him into the Lake of Fire where he will be tortured day and night forever (Revelation 20:10), but sometimes we wonder why God has not destroyed Satan already. Perhaps we will never know God’s exact reasoning, but we do know certain things about His nature. First, we know God is absolutely sovereign over all creation, and this includes Satan. Certainly, Satan and his demons wreak havoc in the world, but they are only allowed a certain amount of freedom. We also know that God has planned everything from the beginning of time to the end. Nothing can thwart His plans, and things are proceeding exactly on schedule. “The LORD of hosts has sworn: ‘As I have planned, so shall it be, and as I have purposed, so shall it stand’” (Isaiah 14:24). Second, “we know that all things work together for good to those who love God, to those who are called according to His purpose” (Romans 8:28). Whatever God has planned for Satan, that plan will be the best one possible. God’s perfect wrath and justice will be satisfied, and His perfect righteousness will be glorified. Those who love Him and who wait for His plan to be fulfilled will be thrilled to be part of that plan and will praise and glorify Him as they see it unfold. Third, we know that to question God’s plan and its timing is to question God Himself, His judgment, His character and His very nature. It is not wise to question His right to do exactly as He pleases. The psalmist tells us, “As for God, His way is perfect” (Psalm 18:30). Whatever plan comes from the mind of the Almighty is the best plan possible. It is true that we can’t expect to understand that mind perfectly, as He reminds us, “‘For my thoughts are not your thoughts, neither are your ways my ways,’ says the LORD. ‘For as the heavens are higher than the earth, so are my ways higher than your ways and my thoughts than your thoughts’” (Isaiah 55:8-9). Nevertheless, our responsibility to God is to obey Him, to trust Him, and to submit to His will, whether we understand it or not. In the case of His timing for Satan’s demise, it has to be the best possible plan because it is God’s plan. ",
            "date": "Answered December 30, 2016",
            "views": "935",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Abhilash Unnikrishnan",
                    "user_href": "/profile/Abhilash-Unnikrishnan-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jahnu Das",
                "href": "/profile/Jahnu-Das-7"
            },
            "answer_text": "By default, God is almighty; God is the Supreme Being, so obviously nobody or nothing can defeat Him. In the Gaudiya-vaishnava philosophy, however, which is the oldest and most well-documented religious tradition on the planet, it is explained that God can be defeated by love. Krishna becomes so obliged to His devotees, who offer their pure and unalloyed devotion to Him, that He is defeated by such unconditional love. Shukadeva Gosswami says: O Maharaja Pariksit, this entire universe, with its great, exalted demigods like Lord Siva, Lord Brahma and Lord Indra, is under the control of the Supreme Personality of Godhead. Yet the Supreme Lord has one transcendental attribute: He comes under the control of His devotees. This was now exhibited by Krishna in this pastime. —SB 10.9.19 Srila Prabahupada explains: This pastime of Krishna's is very difficult to understand, but devotees can understand it. It is therefore said, darsayams tad-vidam loka atmano bhakta-vasyatam (SB 10.11.9): the Lord displays the transcendental attribute of coming under the control of His devotees. By His one plenary portion as Paramatma, the Lord controls innumerable universes, with all their demigods; yet He agrees to be controlled by a devotee. In the Upanishads it is said that the Supreme Personality of Godhead can run with more speed than the mind, but here we see that although Krishna wanted to avoid being arrested by His mother, He was finally defeated, and mother Yashoda captured Him. Laksmi-sahasra-sata-sambhrama-sevyamanam: [Bs. 5.29] Krishna is served by hundreds and thousands of goddesses of fortune. Nonetheless, He steals butter like one who is poverty-stricken. Yamaraja, the controller of all living entities, fears the order of Krishna, yet Krishna is afraid of His mother's stick. These contradictions cannot be understood by one who is not a devotee, but a devotee can understand how powerful is unalloyed devotional service to Krishna; it is so powerful that Krishna can be controlled by an unalloyed devotee. This bhrtya-vasyata does not mean that He is under the control of the servant; rather, He is under the control of the servant's pure love. In Bhagavad-gita (1.21) it is said that Krishna became the chariot driver of Arjuna. Arjuna ordered Him, senayor ubhayor madhye ratham sthapaya me 'cyuta: \"My dear Krishna, You have agreed to be my charioteer and to execute my orders. Place my chariot between the two armies of soldiers.\" Krishna immediately executed this order, and therefore one may argue that Krishna also is not independent. But this is one's ajnana, ignorance. Krishna is always fully independent; when He becomes subordinate to His devotees, this is a display of ananda-cinmaya-rasa, the humor of transcendental qualities that increases His transcendental pleasure. Everyone worships Krishna as the Supreme Personality of Godhead, and therefore He sometimes desires to be controlled by someone else. Such a controller can be no one else but a pure devotee.  ",
            "date": "Answered December 6, 2018",
            "views": "576",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Teresa Bonita",
                    "user_href": "/profile/Teresa-Bonita"
                },
                {
                    "user_id": "Akshay Gupta",
                    "user_href": "/profile/Akshay-Gupta-561"
                },
                {
                    "user_id": "Eshwar Naik",
                    "user_href": "/profile/Ne-96"
                },
                {
                    "user_id": "Gopal Datta",
                    "user_href": "/profile/Gopal-Datta-1"
                },
                {
                    "user_id": "Rajkumar N",
                    "user_href": "/profile/Rajkumar-N-2"
                },
                {
                    "user_id": "Arnaw Kumar {अर्णव कुमार}",
                    "user_href": "/profile/Arnaw-Kumar-अर्णव-कुमार"
                },
                {
                    "user_id": "Murari Das",
                    "user_href": "/profile/Murari-Das-1"
                },
                {
                    "user_id": "Aditi Pandey (अदिति पाण्डेय)",
                    "user_href": "/profile/Aditi-Pandey-अदिति-पाण्डेय"
                },
                {
                    "user_id": "Ganapati Govind Das",
                    "user_href": "/profile/Ganapati-Govind-Das"
                },
                {
                    "user_id": "Gaurav Oberoi",
                    "user_href": "/profile/Gaurav-Oberoi-11"
                },
                {
                    "user_id": "Avinash Nkumar",
                    "user_href": "/profile/Avinash-Nkumar"
                },
                {
                    "user_id": "Abhishek",
                    "user_href": "/profile/Abhishek-1423"
                },
                {
                    "user_id": "Kumar Nachiketa",
                    "user_href": "/profile/Kumar-Nachiketa-12"
                },
                {
                    "user_id": "Koushik Prasade",
                    "user_href": "/profile/Koushik-Prasade-1"
                },
                {
                    "user_id": "Gururaj Krishnamurthy",
                    "user_href": "/profile/Gururaj-Krishnamurthy-3"
                },
                {
                    "user_id": "Harshita Sharma",
                    "user_href": "/profile/Harshita-Sharma-254"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vasundha Nahar",
                "href": "/profile/Vasundha-Nahar"
            },
            "answer_text": "Defeat god ???? Why are you fighting him? Also he is not a tangent being so how?? ",
            "date": "Answered December 30, 2016",
            "views": "109",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nandan Choudhury",
                "href": "/profile/Nandan-Choudhury"
            },
            "answer_text": "Disbelief does ",
            "date": "Answered December 30, 2016",
            "views": "109",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anurag Thakur",
                "href": "/profile/Anurag-Thakur-15"
            },
            "answer_text": "your thoughts ",
            "date": "Answered December 30, 2016",
            "views": "89",
            "upvotes": "0"
        }
    ]
}