{
    "title": "Can you explain your estrangement with a family member? - Quora",
    "tags": [
        "Family Estrangement",
        "Interpersonal Interaction with Family Members",
        "Family Relationships and Dynamics",
        "Family"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dawna Lohbihler",
                "href": "/profile/Dawna-Lohbihler"
            },
            "answer_text": "Yes, indeed, I am estranged from my entire family, the family that I was born into. The short answer is because they were physically and emotionally hurting my children. It’s because I’m the family scapegoat and when my children came onto the scene they simply provided my family with another means to attack me. Families are dysfunctional in so many different ways. Tolstoy said it best: “Happy families are all alike; every unhappy family is unhappy in its own way.” It’s hard to break off from one’s family. Especially when they have tragic histories and you feel compassion for them. In my case, my parents survived some of the worst of WWII. I.e., They survived physically but not emotionally. They weren’t able to give me what I needed. They weren’t able to protect me from the harm that resulted from their lack of participation in my life. They concocted stories about me that weren’t true and alienated me from other family members and so on. Because of their history they presented me as just one more problem to deal with. They received a lot of support. I received further rejection and consequent harm. I ran away as a teenager and put myself through university. I discovered self help books. In later years I could afford and sought out psychological feedback and professional insight. Over the decades I attempted to establish a relationship with one or more family members. Nothing ever worked. In fact, I opened the door to further abuse. My husband couldn’t understand why I even attempted a relationship with people that would treat me in the manner that they did. Despite the fact that I’m speaking about parents, siblings, cousins, etc. I had enough insight to finally break contact when my children were placed in jeopardy. The only good thing about this saga is that I can truly look at myself in the mirror and know that I really did do the best that I knew how to do. I don’t have any regrets, just sadness. ",
            "date": "Answered October 13, 2018",
            "views": "837",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sonia Lambajian",
                    "user_href": "/profile/Sonia-Lambajian-1"
                },
                {
                    "user_id": "Janki Singh",
                    "user_href": "/profile/Janki-Singh-2"
                },
                {
                    "user_id": "Glen Rye",
                    "user_href": "/profile/Glen-Rye"
                },
                {
                    "user_id": "Elizabeth Ellis",
                    "user_href": "/profile/Elizabeth-Ellis-103"
                },
                {
                    "user_id": "Ian James",
                    "user_href": "/profile/Ian-James-155"
                },
                {
                    "user_id": "Kelly Freeman",
                    "user_href": "/profile/Kelly-Freeman-34"
                },
                {
                    "user_id": "Tammy Hampton",
                    "user_href": "/profile/Tammy-Hampton-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mary Gordon",
                "href": "/profile/Mary-Gordon-5"
            },
            "answer_text": "I cut contact entirely with a family member. He’d never been a great guy. Selfish, rude, a user. He had angry outbursts. He was controlling. Unreliable. Ungrateful. A chronic liar. A substance abuser. Still, on good days, he could charm the birds out of the trees, and he’d had a challenging childhood. The final straw was when I found out how he was treating his disabled wife and young adult children, and even grandchildren (he’s never met his own beautiful grandkids). It’s a long story, but it was horrendous. Beyond crazy cruelty and abuse, neglect etc. The more I found out, the more appalled I was and I just decided I wanted nothing to do with him any more. I just couldn’t condone the dreadful behaviour. My husband was in full support. By the way, I’m still in contact with his wife and kids. ",
            "date": "Answered October 13, 2018",
            "views": "276",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joseph Malinowski",
                "href": "/profile/Joseph-Malinowski-1"
            },
            "answer_text": "I was falsely accused of something by my sister and found not guilty by the court. Under the letter of the law I never should have been charged. Therefore, my relatives are criminals and the DA of the county where I was charged was just trying to get convictions without regard to public safety. ",
            "date": "Answered October 16, 2018",
            "views": "170",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rigopoula Tsambou Talarantas",
                    "user_href": "/profile/Rigopoula-Tsambou-Talarantas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mayank Sharma",
                "href": "/profile/Mayank-Sharma-1329"
            },
            "answer_text": "read bhagwad geeta you feel enstrangement from this world!! aap kuch nhi ho financially ya well to do sab paraya kar dete hai wo sirf pretend karte hai k they are with you!! par bhagwad padho toh tumhe lagega k unhone tumhe nhi balki tumne unhe paya kar diya hai live a better life bro!! ",
            "date": "Answered October 13, 2018",
            "views": "16",
            "upvotes": "0"
        }
    ]
}