{
    "title": "Can my dog die of sadness? - Quora",
    "tags": [
        "Pit Bulls",
        "Canine Veterinary Medicine",
        "Sadness",
        "Veterinary Medicine",
        "Understanding and Improving Mental Health",
        "Dogs (pets)",
        "Death and Dying",
        "Understanding Emotions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christian Wagner",
                "href": "/profile/Christian-Wagner-14"
            },
            "answer_text": "I just ran into this question and I’m about to tell you something different than the other answers. Scout was a rescued German Shepard, he was about 2-3 years old when my dad found him. I cannot know Scouts early years but I know very well the life he had with my dad. It was fun and free on many wooded acres in Virginia. They took long walks every day un leashed and free. Man - did that dog love to run and tease my dad. Every time he ran he ( Scout) would grin as wide as a child on Christmas morning. Of course dad would worry Scout would run off and I would always remind him that it was just a game and Scout had it so great that he would not leave that place. Their bond was strong and dad took very good care of him. My dad passed in 2005 after several bouts of heart related issues. When he died I was elected to take care of Scout and/or try to find a great home for him. I’ve had several dogs through the years and Scout came home to live with me, my sons and Noah, a boxer/lab mix. Scout was a very healthy 7-8 ish years old. From the start he felt out of place, even with all the love he was shown. His eating was sporadic and his mood would shift from playful to sad. He would still run occasionally and you could see he enjoyed it but it wasn’t the same. Looking back, I feel that he did not experience a “proper “ goodbye” with my dad. (Dad passed in a hospital). I believe Scout never did understand what happened. The whole process took maybe 60 days or so. He would often walk into the woods and just sit or lie with a sad countenance. He never strayed far from the house and one night he went just outside of our eyesight behind a row of bushes and tress, he laid down and let go. Of course one cannot prove the idea that he died of sadness- but I know what I know. Something else I know: Scout is running in the clouds with my dad and he is happy and free. As for the conditions of the original question, about being away from your dog friend - simply talk to them over the phone or computer - they will know you are alright. ",
            "date": "Answered February 21, 2017",
            "views": "124",
            "upvotes": " View 28 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rupayan",
                    "user_href": "/profile/Rupayan-2"
                },
                {
                    "user_id": "Peter Nguyen",
                    "user_href": "/profile/Peter-Nguyen-303"
                },
                {
                    "user_id": "Tanvi Kant",
                    "user_href": "/profile/Tanvi-Kant"
                },
                {
                    "user_id": "Andrea Isaacs",
                    "user_href": "/profile/Andrea-Isaacs-1"
                },
                {
                    "user_id": "Jill King",
                    "user_href": "/profile/Jill-King-34"
                },
                {
                    "user_id": "Cathy Firmin",
                    "user_href": "/profile/Cathy-Firmin"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/A-R-J-CHANNEL"
                },
                {
                    "user_id": "Jessica Silva",
                    "user_href": "/profile/Jessica-Silva-317"
                },
                {
                    "user_id": "Caroline Poole",
                    "user_href": "/profile/Caroline-Poole-1"
                },
                {
                    "user_id": "Donna Brownlee",
                    "user_href": "/profile/Donna-Brownlee-4"
                },
                {
                    "user_id": "Naomi Leah",
                    "user_href": "/profile/Naomi-Leah-2"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/SOURAV-BHATTACHARJEE-119"
                },
                {
                    "user_id": "Patrick Caldryn",
                    "user_href": "/profile/Patrick-Caldryn"
                },
                {
                    "user_id": "Mobile Gamers",
                    "user_href": "/profile/Mobile-Gamers-7"
                },
                {
                    "user_id": "Apostolia Deliotzaki",
                    "user_href": "/profile/Apostolia-Deliotzaki"
                },
                {
                    "user_id": "Craig Cherrington",
                    "user_href": "/profile/Craig-Cherrington"
                },
                {
                    "user_id": "Brandon Hosheit",
                    "user_href": "/profile/Brandon-Hosheit"
                },
                {
                    "user_id": "Jasleen Kaur",
                    "user_href": "/profile/Jasleen-Kaur-649"
                },
                {
                    "user_id": "Tamra Telles",
                    "user_href": "/profile/Tamra-Telles"
                },
                {
                    "user_id": "Rowanne Iris",
                    "user_href": "/profile/Rowanne-Iris-1"
                },
                {
                    "user_id": "Thomas Mason",
                    "user_href": "/profile/Thomas-Mason-4"
                },
                {
                    "user_id": "Emma Rodriguez",
                    "user_href": "/profile/Emma-Rodriguez-32"
                },
                {
                    "user_id": "Sería López Mendito",
                    "user_href": "/profile/Sería-López-Mendito"
                },
                {
                    "user_id": "Mary Boland-Hanley",
                    "user_href": "/profile/Mary-Boland-Hanley"
                },
                {
                    "user_id": "Juno Hex",
                    "user_href": "/profile/Juno-Hex"
                },
                {
                    "user_id": "Daniela Argüello",
                    "user_href": "/profile/Daniela-Argüello-1"
                },
                {
                    "user_id": "Jason Wurz",
                    "user_href": "/profile/Jason-Wurz"
                },
                {
                    "user_id": "Meg Carroll",
                    "user_href": "/profile/Meg-Carroll-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Juanita Agboola",
                "href": "/profile/Juanita-Agboola"
            },
            "answer_text": "When dogs are depressed, they often appear sad, lethargic, and withdrawn. Some dogs will stop eating or eat much less than usual. They may drink only minimal amounts of water and lose interest in play. Eventually, some depressed dogs can lose drastic amounts of weight and develop a variety of physical illnesses. What to Do If Your Dog Is Depressed Slow deterioration and loss of initiative are definite clues that something is bothering your dog. If this is happening to your dog, you need to address it right away and start to make life fun again. Once you have ruled out a health problem, an increase in your dog's activity level is the next step to helping your dog. Exercising with your dog is a wonderful way to begin. t's natural that you will want to pay more attention to your dog when he is depressed. This is not inherently bad, but do try not to coddle or overly comfort your dog. Too much coddling and comforting on your part may actually reinforce the sad behaviour. If the timing is right for your family, you may consider getting another dog. This may be helpful if your dog is depressed because of losing a companion. However, this could make things worse if your current dog does not accept the new dog. Proceed carefully. If none of these activities seem to be helping, your vet may still be able to help. Medications are sometimes thought of as a last resort, but there are cases when they are the best option. Some vets will prescribe a drug like fluoxetine (Prozac) though this is not right for all dogs. You may not think depression is a big problem. While is true that it often resolves on its own after a short time, there are times when it only gets worse. If left too long, it could very well turn into a life-threatening physical condition. Get help with your dog's depression as soon as you can. Remember that the right place to begin is with your veterinarian.  If you found this answer helpful, please leave an upvote. ",
            "date": "Updated May 12, 2020",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Veronika Solo",
                    "user_href": "/profile/Veronika-Solo"
                },
                {
                    "user_id": "Donna Brownlee",
                    "user_href": "/profile/Donna-Brownlee-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marjorie Escaro - Montenegro",
                "href": "/profile/Marjorie-Escaro-Montenegro"
            },
            "answer_text": "YES! A dog can die of sadness. My uncle gave my family two Shih Tzu dogs, one male and one female. They were named Lemon and Apple. Unfortunately, Apple died due to a fatal illness, Canine Parvovirus. Lemon survived but was very sad because he was left alone.  A few months after, my uncle has decided to give us another Shih Tzu dog. It is a female dog named Cherry. Cherry has been staying with my uncle for 6 months already before he gave her to us.  When my dad brought Cherry home, she was very sad. She doesn't know us and is scared of us and she misses her previous family (my uncle’s family) badly. She grew attached to them already. She refuses to eat or even drink water, she won't leave the corner of our house. It has been like that for almost a week. We tried to make her trust us and/or love us but she misses her previous family very bad, so she won't. We were very scared then that she would just die in our house due to starvation or dehydration or extreme sadness. We have decided to return Cherry to my uncle. She went running to their car when they arrived in front of our house. She cuddled with my uncle’s wife as soon as she went down the car. Twas the time, we knew we made a good decision.  Lemon, on the other hand, overcame his sadness. Thanks to our never-ending love and care for him. ❤❤❤ PS. Winter is coming, remember to dress up your dogs to warm them up. ",
            "date": "Updated May 29, 2019",
            "views": "54",
            "upvotes": " View 26 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Peter Nguyen",
                    "user_href": "/profile/Peter-Nguyen-303"
                },
                {
                    "user_id": "Kapil Kumar",
                    "user_href": "/profile/Kapil-Kumar-1120"
                },
                {
                    "user_id": "Cathy Firmin",
                    "user_href": "/profile/Cathy-Firmin"
                },
                {
                    "user_id": "Jessica Silva",
                    "user_href": "/profile/Jessica-Silva-317"
                },
                {
                    "user_id": "Donna Brownlee",
                    "user_href": "/profile/Donna-Brownlee-4"
                },
                {
                    "user_id": "Andrea Isaacs",
                    "user_href": "/profile/Andrea-Isaacs-1"
                },
                {
                    "user_id": "Rodolfo Rojas",
                    "user_href": "/profile/Rodolfo-Rojas-6"
                },
                {
                    "user_id": "Jackie G Yu",
                    "user_href": "/profile/Jackie-G-Yu"
                },
                {
                    "user_id": "Emma Skinner",
                    "user_href": "/profile/Emma-Skinner-5"
                },
                {
                    "user_id": "Marjorie Escaro",
                    "user_href": "/profile/Marjorie-Escaro"
                },
                {
                    "user_id": "Kei Emman",
                    "user_href": "/profile/Kei-Emman"
                },
                {
                    "user_id": "Aiyana Griggs",
                    "user_href": "/profile/Aiyana-Griggs-2"
                },
                {
                    "user_id": "Margie Ocon",
                    "user_href": "/profile/Margie-Ocon"
                },
                {
                    "user_id": "Judelle Art Kelvin Advincula",
                    "user_href": "/profile/Judelle-Art-Kelvin-Advincula"
                },
                {
                    "user_id": "Fay Mahed",
                    "user_href": "/profile/Fay-Mahed"
                },
                {
                    "user_id": "Barbara Klickstein",
                    "user_href": "/profile/Barbara-Klickstein"
                },
                {
                    "user_id": "Aira Lyn Roxas",
                    "user_href": "/profile/Aira-Lyn-Roxas"
                },
                {
                    "user_id": "Emily Ward",
                    "user_href": "/profile/Emily-Ward-49"
                },
                {
                    "user_id": "Su Li",
                    "user_href": "/profile/Su-Li-42"
                },
                {
                    "user_id": "Sue Shanahan",
                    "user_href": "/profile/Sue-Shanahan-2"
                },
                {
                    "user_id": "Erick Aguirre",
                    "user_href": "/profile/Erick-Aguirre-6"
                },
                {
                    "user_id": "Cherry James",
                    "user_href": "/profile/Cherry-James-7"
                },
                {
                    "user_id": "Peter Henry",
                    "user_href": "/profile/Peter-Henry-75"
                },
                {
                    "user_id": "Leslie Flores",
                    "user_href": "/profile/Leslie-Flores-53"
                },
                {
                    "user_id": "Kei Kazuki",
                    "user_href": "/profile/Kei-Kazuki"
                },
                {
                    "user_id": "Joyce Humphries",
                    "user_href": "/profile/Joyce-Humphries-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Demaris",
                "href": "/profile/Eric-Demaris"
            },
            "answer_text": "Mammals usually and more commonly need companionship if a person or mammals that means where an animal where to be with somebody for a certain amount of time be so close to them that when that person loses them they would go in 2 a deeb traumatizing depression state of the Mind handsome the mental emotion not only that person losing them butt off the loneliness they are now suffering the attachment that they did not get to go through to desensitize the emotion or feeling I believe and it may be proven and it may not be proven but if you anomaly utterly sad of losing them whether they left or died or whatever the emotional attachment that you're going through of them not being there will cause you to go into deeper depression quite rapidly if you cause you to commit suicide it could cause you to quit showering cleaning or eating or drinking and if you don't even drink you will die so yeah people animals can die of sadness ",
            "date": "Answered August 4, 2016",
            "views": "21",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anderson Seaman",
                    "user_href": "/profile/Anderson-Seaman"
                },
                {
                    "user_id": "Laurie Camp",
                    "user_href": "/profile/Laurie-Camp-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sandyr Runghen",
                "href": "/profile/Sandyr-Runghen"
            },
            "answer_text": "My neighbors dog died of sadness, it was terrible to see. I remember when the dog owners have gone on vacation for 3 month abroad and left him with the watchman. He refuses to eat., he just stayed at the door and stared at the road waiting for his master to come. It was so so pitying to watch him. I even gone to see him severals times., trying to feed him a bit but he just smell at it and return to the front door. His eyes was full of tears, he began to lose weight and slowly he barely could walk. After about 45 days, one morning I went to see him but the watchman told me he died in the night. I was so sad for him. Me too I have dogs, am a big animals lover/rescuer. I don't want anyone to lose their pets with sadness, because it's a bad way for a dog. Love your pets, give him the happiness he deserve and never leaves your pets alone for too long. A dog or other pets should never have to bear sadness because of us. Peace and Love.. ",
            "date": "Answered May 3, 2017",
            "views": "57",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kara Jiri",
                    "user_href": "/profile/Kara-Jiri"
                },
                {
                    "user_id": "Catherine Macievskaya",
                    "user_href": "/profile/Catherine-Macievskaya"
                },
                {
                    "user_id": "Andrea Isaacs",
                    "user_href": "/profile/Andrea-Isaacs-1"
                },
                {
                    "user_id": "Rodolfo Rojas",
                    "user_href": "/profile/Rodolfo-Rojas-6"
                },
                {
                    "user_id": "Elizabeth Mcauliffe",
                    "user_href": "/profile/Elizabeth-Mcauliffe-1"
                },
                {
                    "user_id": "Precious Woods",
                    "user_href": "/profile/Precious-Woods-5"
                },
                {
                    "user_id": "Barbara Klickstein",
                    "user_href": "/profile/Barbara-Klickstein"
                },
                {
                    "user_id": "Ravi Voleti",
                    "user_href": "/profile/Ravi-Voleti-4"
                },
                {
                    "user_id": "Emily Ward",
                    "user_href": "/profile/Emily-Ward-49"
                },
                {
                    "user_id": "Dianne Pingitore",
                    "user_href": "/profile/Dianne-Pingitore"
                },
                {
                    "user_id": "Tamra Telles",
                    "user_href": "/profile/Tamra-Telles"
                },
                {
                    "user_id": "Aimee Salaun",
                    "user_href": "/profile/Aimee-Salaun"
                },
                {
                    "user_id": "Sería López Mendito",
                    "user_href": "/profile/Sería-López-Mendito"
                },
                {
                    "user_id": "Ansar Ahmed",
                    "user_href": "/profile/Ansar-Ahmed-16"
                },
                {
                    "user_id": "Shaili Seebaluck",
                    "user_href": "/profile/Shaili-Seebaluck"
                },
                {
                    "user_id": "Pam Houdyshell",
                    "user_href": "/profile/Pam-Houdyshell"
                },
                {
                    "user_id": "Mary Boland-Hanley",
                    "user_href": "/profile/Mary-Boland-Hanley"
                },
                {
                    "user_id": "Marier Villarreal",
                    "user_href": "/profile/Marier-Villarreal"
                },
                {
                    "user_id": "Yumi Aguinaldo",
                    "user_href": "/profile/Yumi-Aguinaldo"
                },
                {
                    "user_id": "E Nancy Davenport-Dunlap",
                    "user_href": "/profile/E-Nancy-Davenport-Dunlap"
                },
                {
                    "user_id": "Annette Blankenship",
                    "user_href": "/profile/Annette-Blankenship"
                }
            ]
        },
        {
            "author_info": {
                "name": "Laurie Camp",
                "href": "/profile/Laurie-Camp-1"
            },
            "answer_text": "I agree with the answers to make sure the food,.smells or something isn't affecting your dog. I have heard Skype helps but you can also have your parents put the phone to her to hear your voice. Dogs are pretty resilient but they are sensitive once bonded. My female who I've had since a pup got very depressed when I was stuck in a storm on the other coast. I was 3 hours away and a storm came through and flooded the area I was in. I was gone for a week and when I got home...wow, she was happy I was home and followed me around closely for about a month after. Its been hard to leave her ever since. She's 15 1/2 now and soon she will leave me forever...I don't leave her anymore than I have to now. Like to go to work is the longest I leave for. ",
            "date": "Answered August 4, 2016",
            "views": "44",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Craig Cherrington",
                    "user_href": "/profile/Craig-Cherrington"
                },
                {
                    "user_id": "Ravi Voleti",
                    "user_href": "/profile/Ravi-Voleti-4"
                },
                {
                    "user_id": "Dianne Pingitore",
                    "user_href": "/profile/Dianne-Pingitore"
                },
                {
                    "user_id": "Tamra Telles",
                    "user_href": "/profile/Tamra-Telles"
                },
                {
                    "user_id": "Meg Carroll",
                    "user_href": "/profile/Meg-Carroll-7"
                },
                {
                    "user_id": "Diane Wadley",
                    "user_href": "/profile/Diane-Wadley"
                },
                {
                    "user_id": "Abhishek Gupta",
                    "user_href": "/profile/Abhishek-Gupta-1443"
                },
                {
                    "user_id": "Gwen Rae Snap",
                    "user_href": "/profile/Gwen-Rae-Snap"
                },
                {
                    "user_id": "Kanishka Singh",
                    "user_href": "/profile/Kanishka-Singh-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Gaul",
                "href": "/profile/Steve-Gaul"
            },
            "answer_text": "I agree with Beret Bustos. Your dog will miss you and will be happy when you return but dogs are tough and pragmatic. However, if the dog’s routine has changed drastically or if the feeding routine has changed (type of food or time of day) or if water is not available, that could upset the dog, particularly if the dog is older (more than 8–10 years?). Did the dog go to live at your parents’ home instead of yours? Maybe there is something very different in the environment - too hot or too cold or some chemical in the environment (carpet cleaner?). The point is that there may be many things that could upset a dog but generally they adapt within a few days. ",
            "date": "Answered August 4, 2016",
            "views": "51",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dianne Pingitore",
                    "user_href": "/profile/Dianne-Pingitore"
                },
                {
                    "user_id": "Sería López Mendito",
                    "user_href": "/profile/Sería-López-Mendito"
                },
                {
                    "user_id": "Gerard Marszałek",
                    "user_href": "/profile/Gerard-Marszałek"
                },
                {
                    "user_id": "Stephanie Antonelli",
                    "user_href": "/profile/Stephanie-Antonelli"
                },
                {
                    "user_id": "Susie Downing",
                    "user_href": "/profile/Susie-Downing"
                },
                {
                    "user_id": "Laurie Camp",
                    "user_href": "/profile/Laurie-Camp-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Patricia Shoup",
                "href": "/profile/Patricia-Shoup"
            },
            "answer_text": "No. Dogs do get depressed. Two weeks ago I had to put down the pit bull in my icon. He was suffering and could not get up without my help and lost bladder control. He was always in pain. My other dog respected Tank a lot. He was her hero and mine. She has been sitting around staring off into space. But she is still eating and drinking and enjoying her treats. I have been giving her lots of extra attention. We are working together to get over the loss of Tank . I will eventually get another dog but I am not ready yet. ",
            "date": "Answered August 4, 2016",
            "views": "22",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Donna Brownlee",
                    "user_href": "/profile/Donna-Brownlee-4"
                },
                {
                    "user_id": "Dianne Pingitore",
                    "user_href": "/profile/Dianne-Pingitore"
                },
                {
                    "user_id": "Tamra Telles",
                    "user_href": "/profile/Tamra-Telles"
                },
                {
                    "user_id": "Jesús Quezada",
                    "user_href": "/profile/Jesús-Quezada"
                },
                {
                    "user_id": "Bill Fife",
                    "user_href": "/profile/Bill-Fife-1"
                }
            ]
        }
    ]
}