{
    "title": "Can we use telepathy? What percent of our mind should we use? - Quora",
    "tags": [
        "Telepathy",
        "Supernatural Phenomena"
    ],
    "response": [
        {
            "author_info": {
                "name": "Saravana Kumaarr",
                "href": "/profile/Saravana-Kumaarr"
            },
            "answer_text": "Telepathy means tele - distant and pathy - derived from pathos or patheia meaning feeling, perception, passion, affection, experience. It is generally used to convey our feeling or emotion as a message to a person whom we know. It does not correlated with the intellect to deal with. So, no need to utilize the much like our mind and no need to delve deep and ask like how much percent of mind should we use like that. But, it is a need to ask like how much emotionally I am connected to the person. As you convey a message via telepathy you can send in one to one. One person can send a message to a single person only. Not one to many. And the person to whom you’re about to send a message should be known to you. And, the problem is in most of the case the message will be transmitted and received to the concerned person. But, it receives to the intended person as if like a random thought or an intuition like feel for the person who receives the message not knowing that, it is a telepathic message. That’s a problem. So, whenever you get some message with a random thought of a person there is a high chance that it could be a telepathic message and the probability increases with how those two people are connected with. Like emotional, affection, and care or feeling they both have for each other!! Thanks for reading!! ",
            "date": "Answered July 19, 2020",
            "views": "20",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Blake Dexter",
                    "user_href": "/profile/Blake-Dexter-2"
                }
            ]
        }
    ]
}