{
    "title": "Can Centrists be politically biased? - Quora",
    "tags": [
        "Centrists",
        "Political Bias",
        "Centrism",
        "Centrist Politics",
        "Media Bias",
        "Bias",
        "Left-Wing Politics",
        "Liberalism (politics)",
        "Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Scott Gosnell",
                "href": "/profile/Scott-Gosnell"
            },
            "answer_text": "Centrism, as opposed to moderation or having a mixture of positions, is the biased belief that not only is having half a loaf better than none, but also better than having a whole loaf.  This addiction to being neutral rather than being accurate has poisoned corporate media. Centrism in the media depends on things being matters of opinion rather than fact. For differences of opinion, you just need two lawyers who know how to give a two minute soundbite or deliver a talking point. For differences of fact, you need a scientist to talk for an hour, with diagrams full of data. The fact that there are more lawyers than scientists (or other experts) points to a bias toward controversy. The fact that the controversies are never really resolved, just rehashed, and that the centrist never has to actually decide whether either side, both, or neither has the better proof or even better argument, should point out to you that centrism is a sham. [Centrism] does not feature a spectrum of people with different views on reality: Rather, they frequently give us a face-off between those who see reality and those who have missed it entirely. In the name of objectivity, we are getting fantasyland. ---Molly Ivins, 2007 ",
            "date": "Answered May 17, 2020",
            "views": "210",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dorinda Cosgrove",
                    "user_href": "/profile/Dorinda-Cosgrove"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher Aeneadas",
                "href": "/profile/Christopher-Aeneadas"
            },
            "answer_text": "Damned straight we can. We generally have less respect for the policy suggestions and behavior of Wingnut and Moonbat types than they have for ours. We generally favor the center. I am honest enough with myself to note that this results in blindness to some good ideas. Being in the middle does not mean you are objective or correct. So if course we are biased! ",
            "date": "Answered May 14, 2020",
            "views": "94",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Peter Banos",
                    "user_href": "/profile/Peter-Banos-1"
                },
                {
                    "user_id": "Stan Jetton",
                    "user_href": "/profile/Stan-Jetton"
                },
                {
                    "user_id": "Sergio Mendoza",
                    "user_href": "/profile/Sergio-Mendoza"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tathagat Chawla",
                "href": "/profile/Tathagat-Chawla-1"
            },
            "answer_text": "yes. They may agree few things of Right extreme and may agree most of the Left extreme. Similarly they may agree few things of Left extreme and may agree most things of Right extreme. Centrists are policy driven. So there’s a chance for particular system or policy driven by one end maybe liked by the Centrists. At this point, they may be considered as politically biased. E.g. I think Capitalism is the way forward but for welfare of poorer section of society I believe Socialism is the need of the hour for welfare. Now I am politically biased for the system to be Right but welfare to be Left. Centrists generally leans towards a bit of Right or Left due to their upbringings and the lives they lead. So in short, Yes Centrists are politically biased. ",
            "date": "Answered May 14, 2020",
            "views": "41",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Peter Banos",
                "href": "/profile/Peter-Banos-1"
            },
            "answer_text": "Of course! Centrism is a political position like any other! It is biased against radical, confrontational solutions to problems. Nothing wrong with that; I for one just happen to think that radical, confrontational solutions are sometimes necessary… ",
            "date": "Answered May 20, 2020",
            "views": "6",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "George Tarkanian",
                "href": "/profile/George-Tarkanian"
            },
            "answer_text": "Everyone is politically bias. The question is to what degree they allow the bias to effect their views and respect of opposing opinions. ",
            "date": "Answered May 14, 2020",
            "views": "10",
            "upvotes": "0"
        }
    ]
}