{
    "title": "Can truly born-again believing Christians ever lose their salvation if they stray and get lost? If they die while they are still lost, do they still go to heaven? Is there any way salvation can be lost once it's truly received? - Quora",
    "tags": [
        "Born Again Christians",
        "Salvation",
        "Heaven",
        "Afterlife",
        "Christians",
        "Belief and Beliefs",
        "Christianity",
        "Death and Dying"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Wittenberg",
                "href": "/profile/David-Wittenberg-1"
            },
            "answer_text": "This is one of the most controversial questions in the Christian community. Opinions are held very strongly on both sides. Both sides can point to verses that support their views. I myself have changed my view over time. I will share my conclusions. Perhaps you will even agree with me! The Bible teaches that everyone is either saved or lost. Those who are saved have eternal life. Those who are lost are condemned to an eternal second death. There is only one difference between saved and lost people: Saved people are believers, and lost people are unbelievers. We can see this clearly in John’s gospel, chapter three, verse 18. Those who believe are not condemned. Those who believe not are condemned already. So, what happened when a person became a born-again Christian? He or she believed in Jesus. The person stopped being condemned and was saved, or rescued, from the penalty of sin. The person was passed from death to life, placed into Christ, and seated with Christ in the heavenly places! The person acquired a new man, created after God in righteousness and true holiness. The person became the righteousness of God in him! (You can do a Google search for those phrases if you want to find them in the Bible.) Can such a person ever become lost? Certainly not by straying into sinful behavior! Paul wrote that even if he sins, it is not he who is sinning, but sin living inside him. In other words, along with the new righteous man who is born in us when we are born again, we still have the old, sinful, worthless man living inside us. That old man sins; the new man doesn’t. That old man is as good as dead anyway; he will drop away when we die, and he cannot kill the new man inside. We may find in heaven that we have earned no rewards because we lived the way our old man wanted instead of the way God wanted. But if we are still believers, then we are still saved according to John 3:18. If I believe what John 3:18 says, then the only way a born-again believer can possibly become lost is if he or she changes from a believer into an unbeliever. Nothing else can make a believer into a lost person! Some Christians say that it can’t happen — God prevents a believer from becoming an unbeliever. I disagree, but that’s not important. The important point is that sinning for a Christian does not and cannot make the person unsaved. Any sin in a Christian’s life on earth is due to the fleshly, corrupt, old man and not the righteous, pure, and heavenly new man. We are saved by Christ’s righteousness; we cannot be lost by our fleshly unrighteousness. ",
            "date": "Answered May 4, 2019",
            "views": "173",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Prithvi Diwanji",
                    "user_href": "/profile/Prithvi-Diwanji"
                },
                {
                    "user_id": "Adrian Hicks",
                    "user_href": "/profile/Adrian-Hicks"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lawrence Albertyn",
                "href": "/profile/Lawrence-Albertyn"
            },
            "answer_text": "HOW ON EARTH CAN THEY BE SILLY ENOUGH TO THINK SO IN THE FIRST PLACE? They cannot lose something they have never had in the first place. There is no such thing as being saved unless you believe in Rome more than the properly translated Word like the ISR or Cepher versions. THAT is the whole point of the parables of the ejected Wedding Guest in Mathew 22 and the 10 Virgins in Mathew 25! Read them again please. You will not find this teaching anywhere within context in the Bible! You have to be sanctified and be so until you die! Mathew 24:13 But the one who endures to the end, that one will have eternal life Remember, Father does not even hear your prayers (Proverbs 28:9) if you do not keep His Torah! Check Paul’s words in Roman 3: 31 Do we then nullify the Torah by faith? Far be it. On the contrary, we establish the Torah! Get out of churches - they are all satanically influence and get into the true Word by download a free PDF version such as the ISR or download one of its eSword modules. IF you do not keep Torah, you are NOT His child and are NOT eligible for redemption in the first place! Mathew 22:14 For many are called, but few chosen In fact, Messiah who was a Hebrew who kept and taught Torah until His death, tells us in Mathew 13 verses 37 to 42, that all non-Torah keepers will be plucked up by His cherubs upon His return and burnt up as Tares! This is all because sin is not allowed in Heaven as most of us know. What we typically do not know is WHAT the definition of sin is! Here it is defined in 1John 3: 4 Everyone practicing sin also practices lawlessness, and sin is the breaking of the Torah Once you realise that Messiah, the one some falsely call ‘Jesus’ - Romes’ creation, is the Word as per John Chapter 1 then your whole theology will stand on its head when you realise that He IS the personified Torah, the Word ( the law being only until John). Truly a time to rethink your theology! ",
            "date": "Answered May 4, 2019",
            "views": "71",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joyce Davies Jones",
                "href": "/profile/Joyce-Davies-Jones"
            },
            "answer_text": "When a person truly comes to Christ, they exchange their sin and guilt for Christ’s life and righteousness (II Corinthians 5:21). They are born into God’s family and the Holy Spirit indwells them. Ephesians 1:13–14) (Eph 1:13 And you also were included in Christ when you heard the message of truth, the gospel of your salvation. When you believed, you were marked in him with a seal,the promised Holy Spirit, 14 who is a deposit guaranteeing our inheritance until the redemption of those who are God’s possession—to the praise of his glory.) All these things are brought about by God’s grace, power and volition. Now, can we “lose” our salvation? I think, to say that we can, would be to accuse God of being capricious and a proverbial “Indian giver” (that terms cannot possibly be politically correct). Genuine salvation, in other words, isn’t something we “manage” or control. It is given by Christ, and we don’t have the volition to throw it off once we are truly his child. We might be rebellious for a time, but as his child, we will know his discipline and correction - not his abandonment. ",
            "date": "Answered May 6, 2019",
            "views": "66",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jerry Sorrell",
                    "user_href": "/profile/Jerry-Sorrell"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chan Beng Chin",
                "href": "/profile/Chan-Beng-Chin"
            },
            "answer_text": "In some ways what you're asking is a contradiction in terms. The logic is as follows: election, called by the gospel, baptism of the Holy Spirit, born again, resurrection to eternal life. Therefore the only question is elected or not. If elected, then just consider Israel. Where is Edom? Where are the oppressors of Israel? Egypt, Assyria, Babylon, where are they? Only Israel remains and will remain eternally. That is the meaning of election. For it's not the work nor faith of the elect that saves but God's unchanging faithfulness to and love for his elect. We cannot trust ourselves, surely God is a better assurance. Our confidence is not in ourselves, but like Peter, who denied Christ and sank on the waters, can and will merely cry “Help me, Lord!” ",
            "date": "Answered May 4, 2019",
            "views": "56",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Russell Fletcher",
                "href": "/profile/Russell-Fletcher-1"
            },
            "answer_text": "Q. Can truly born-again believing Christians ever lose their salvation if they stray and get lost? If they die while they are still lost, do they still go to heaven? Is there any way salvation can be lost once it's truly received? A. I was always taught you can never lose your salvation. However since this verse says Liars shall have their part in the Lake of Fire and Christians can be Liars I'm not so sure anymore. *[[Rev 21:8]] KJV* But the fearful, and unbelieving, and the abominable, and murderers, and whoremongers, and sorcerers, and idolaters, and all liars, shall have their part in the lake which burneth with fire and brimstone: which is the second death. ",
            "date": "Answered May 7, 2019",
            "views": "29",
            "upvotes": "0"
        }
    ]
}