{
    "title": "Can you prove Utilitarianism? - Quora",
    "tags": [
        "Utilitarianism",
        "Ethics of Everyday Life",
        "Ethics and Morality",
        "Arguments and Argumentation",
        "Ethics",
        "Morals and Morality"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christopher Faille",
                "href": "/profile/Christopher-Faille"
            },
            "answer_text": "I don’t think you can ever nail down its contentions with enough precision to prove or to disprove it. Better to focus your aim on showing its incoherence. Here is a passage written by a professor at the University of Colorado, Boulder: “Suppose a person (we can call him 'Max the Masochist') suffers from some mental defect that makes him desire pain, failure, illness, humiliation, and early death. Suppose he gets these. [One important form of utilitarianism — which the professor calls DS] implies that his life went well for him. But surely his life was a wreck. He would have been much better off if he had different desires and they had been satisfied. The satisfaction of these desires did him no good. So we have this little argument: Max the Masochist:1. Max the Masochist led a miserable life.2. If Max the Masochist led a miserable life, then DS is false.3. Therefore, DS is false. P1: Look at his life. From early on, he was constantly in pain. He failed at everything he did. He was sick and ill. He was constantly humiliated and ashamed of himself and his failures .... And he died young. This is what happened in Max's life. Now, are we going to say this is not a miserable life? If you were asked to describe a life in which the person was not doing well, could you do a better job than to describe Max's? It seems not. So it seems clear that Max's life did not go well for him -- he led a miserable life.P2: But if Max really did lead a miserable life, then DS can't be true, because DS implies that Max's life went well for him. It implies this because all of these things Max got, he actually wanted! He wanted this misery. He wanted the pain, the humiliation, the illness, the early death.Maybe you're skeptical about P1. Maybe, you say, if Max really did want those things, then his life was fine. Maybe some people are inclined to think Max's life didn't go so well because they wouldn't want those things.But can you really swallow this? Suppose you had a close friend just like Max -- your friend had desires just like Max, and he was getting them satisfied. Would you then just sit back and say, \"Oh wonderful, I'm so glad things are going so well for my friend?\" No -- you'd try to get your friend some help. You'd think things would be better for your friend if he had different desires (say for love, pleasure, friendship, success) and got those things. But if DS is true, what you are saying doesn't even make sense. It doesn't even make sense to say the things he desires are bad for him. ",
            "date": "Answered March 24, 2019",
            "views": "67",
            "upvotes": " Answer requested by Karim Avram",
            "upvoters": [
                {
                    "user_id": "Kevin Nguyen",
                    "user_href": "/profile/Kevin-Nguyen-834"
                },
                {
                    "user_id": "Rafael Maia",
                    "user_href": "/profile/Rafael-Maia-15"
                },
                {
                    "user_id": "Daniel Philippus",
                    "user_href": "/profile/Daniel-Philippus-1"
                },
                {
                    "user_id": "Christopher Anderson",
                    "user_href": "/profile/Christopher-Anderson-125"
                },
                {
                    "user_id": "Wouter van Burik",
                    "user_href": "/profile/Wouter-van-Burik"
                },
                {
                    "user_id": "Erik Bergland",
                    "user_href": "/profile/Erik-Bergland"
                },
                {
                    "user_id": "Andy Isfanuti",
                    "user_href": "/profile/Andy-Isfanuti"
                },
                {
                    "user_id": "Kathy Kang",
                    "user_href": "/profile/Kathy-Kang-9"
                },
                {
                    "user_id": "Suhas S",
                    "user_href": "/profile/Suhas-S-124"
                },
                {
                    "user_id": "Tyler Glisson",
                    "user_href": "/profile/Tyler-Glisson-1"
                },
                {
                    "user_id": "Simo Halme",
                    "user_href": "/profile/Simo-Halme"
                },
                {
                    "user_id": "Karim Avram",
                    "user_href": "/profile/Karim-Avram"
                },
                {
                    "user_id": "Inbar Aran",
                    "user_href": "/profile/Inbar-Aran"
                },
                {
                    "user_id": "Bart Loews",
                    "user_href": "/profile/Bart-Loews"
                },
                {
                    "user_id": "Nicholas Mew",
                    "user_href": "/profile/Nicholas-Mew-1"
                },
                {
                    "user_id": "James Smith",
                    "user_href": "/profile/James-Smith-3709"
                },
                {
                    "user_id": "Logan R. Kearsley",
                    "user_href": "/profile/Logan-R-Kearsley"
                },
                {
                    "user_id": "Petter Häggholm",
                    "user_href": "/profile/Petter-Häggholm"
                },
                {
                    "user_id": "Filip Gonzalez Hermansson",
                    "user_href": "/profile/Filip-Gonzalez-Hermansson"
                },
                {
                    "user_id": "Matthew Gordon",
                    "user_href": "/profile/Matthew-Gordon-7"
                },
                {
                    "user_id": "Jonathan Sullivan",
                    "user_href": "/profile/Jonathan-Sullivan-10"
                },
                {
                    "user_id": "Andrew Li",
                    "user_href": "/profile/Andrew-Li-85"
                },
                {
                    "user_id": "Yuvraj",
                    "user_href": "/profile/Yuvraj-108"
                },
                {
                    "user_id": "Mitch Williams",
                    "user_href": "/profile/Mitch-Williams-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joshua Engel",
                "href": "/profile/Joshua-Engel"
            },
            "answer_text": "You can’t prove any ethical system. It’s called the Is–ought problem. You might be able to dis-prove one: to find a logical contradiction, or to find a case that it purports to cover but does not, or to make a prescription that is “universally” considered reprehensible (for some value of “universal”). I suppose you might be able to take one that is sufficiently rigorous and prove that it’s contradiction-free, but that’s not the same as “proving” in in whatever sense you imagine you mean it. There is no rule of any kind that allows you to conclude what something ought to be from what is. You instead take something as axiomatic. Utilitarianism is one such set of axioms. You don’t prove axioms. You decide whether or not they correspond to how you think the world should work. The merit of the system is judged by how well you can live with those axioms. ",
            "date": "Answered March 21, 2019",
            "views": "681",
            "upvotes": " View 24 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kathy Kang",
                    "user_href": "/profile/Kathy-Kang-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Will Petillo",
                "href": "/profile/Will-Petillo"
            },
            "answer_text": "No, for reasons others have articulated quite well—it’s an ethical system, not a factual claim, and thus not subject to proof/disproof. That said, it is not incoherent to make a claim to the effect of “Even if you have never heard of Utilitarianism—or even if you know a little about it and think you don’t like it—it actually probably describes how you (already) think quite well.” I am not sure I would personally subscribe to such a claim, but I consider it legitimate enough to be arguable. After all, there is something intuitively compelling about the idea that the moral value of an action can be determined by the desirability of its consequences. And attempts to find counter-examples have an interesting tendency to ultimately justify themselves with that very same assumption… ",
            "date": "Answered March 26, 2019",
            "views": "35",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Phil Johnson",
                "href": "/profile/Phil-Johnson-114"
            },
            "answer_text": "Utilitarianism is an ethical philosophy, you can’t prove it. In the same way you can’t prove Buddhism. It is based on the principle that the way people act should always be for the greater good. So basically when you have an option on what to do or how to behave, you should always choose the option that brings the most good to the most people. So you can’t prove it as it is not a thing or a person or a deity or even a scientific concept. It is a philosophy, a way of being and thinking. ",
            "date": "Answered March 21, 2019",
            "views": "35",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Karim Avram",
                    "user_href": "/profile/Karim-Avram"
                }
            ]
        },
        {
            "author_info": {
                "name": "Philip Pillari",
                "href": "/profile/Philip-Pillari"
            },
            "answer_text": "Can you prove Utilitarianism? In what way? Proving an ethical philosophy is impossible. There is no right or wrong when answering a moral question. It is also impossible to prove that someone is truly happy. We are supposed to be judging everyone's happiness equally, but that is hard to quantify. Someone may have different degrees of happiness that we don't know about. ",
            "date": "Answered March 21, 2019",
            "views": "44",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Edward Keefner",
                "href": "/profile/Edward-Keefner-2"
            },
            "answer_text": "Utilitarianism is based upon the teachings of hedonists Arisippus (spelling? or something like that) and Epicurus, who viewed happiness as the only good. But that’s not completely true. Sometimes evil can bring about great good. The story of Joseph. He was sold into slavery by his brothers. (slavery is basically a pedo sex ring in ancient times) And then from there he becomes a Pharoah of Egypt and saves millions of people from starvation. An evil act becomes an act of great good. All I can really do is disprove it. Sorry. ",
            "date": "Answered March 23, 2019",
            "views": "18",
            "upvotes": " Answer requested by Karim Avram"
        },
        {
            "author_info": {
                "name": "Andy Campbell",
                "href": "/profile/Andy-Campbell-21"
            },
            "answer_text": "Try the opposite. See what you think? Selfishness, greed, seeing other as articles to be exploited for personal gain only. Would you enjoy being seen like this by others? There's your proof . More people happy better world.. More people discontent worse world. ",
            "date": "Answered March 23, 2019",
            "views": "11",
            "upvotes": " Answer requested by Karim Avram"
        }
    ]
}