{
    "title": "Can you really do anything? - Quora",
    "tags": [
        "Advice for Everyday Life",
        "Psychology of Everyday Life",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dexter Jameswood",
                "href": "/profile/Dexter-Jameswood"
            },
            "answer_text": "No, you can only do some things. Teachers often say, “You can do anything,” so too do commencement speakers at graduation, but the reality is, most people have one or two talents or skills, and that is the best-case scenario. From this group, an even smaller percentage will be more talented than their competitors are, and distinguish themselves in any given field, and an even smaller group, an elite subgroup, will be able to profit from it and gain recognition from the wider world. Most people live ordinary lives that are difficult, boring, and resemble the fate of Sisyphus. For most people, saying, “you can do anything,” typically just means you can do anything that…anything at all…involving low-skilled work at a low-skilled price. But, if you watched Barney the Dinosaur as I did, remember, “You can always use your imagination!”     ",
            "date": "Answered December 20, 2015",
            "views": "408",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Benjamin Heninger",
                    "user_href": "/profile/Benjamin-Heninger"
                },
                {
                    "user_id": "Jua Vang",
                    "user_href": "/profile/Jua-Vang-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Janet Rose",
                "href": "/profile/Janet-Rose"
            },
            "answer_text": "Of course not. I have always resented that saying. I can’t fly like a bird, I can’t paint like Michaelangelo. I can’t sing like Barbra Streisand. However, there are many goals I can set that I could reach with hard work, if I wanted to. ",
            "date": "Answered May 25, 2016",
            "views": "70",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aditya Kashyap",
                    "user_href": "/profile/Aditya-Kashyap-7"
                },
                {
                    "user_id": "Benjamin Heninger",
                    "user_href": "/profile/Benjamin-Heninger"
                },
                {
                    "user_id": "Jua Vang",
                    "user_href": "/profile/Jua-Vang-1"
                }
            ]
        }
    ]
}