{
    "title": "Can you do evil without being evil? - Quora",
    "tags": [
        "Good and Evil",
        "Evil",
        "Ethics and Morality",
        "Ethics",
        "Morals and Morality",
        "Philosophy",
        "Understanding Human Behavior",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Perry",
                "href": "/profile/Paul-Perry-6"
            },
            "answer_text": "I don’t know if there is such a thing as the quality of being evil and, in any case, it isn’t a very helpful term. Very, very few people deliberately do harm out of ill-intent; most if done through misplaced good intentions, thoughtlessness or ignorance. What we call evil are actions and their effects, not the intent behind them. Helping people, being kind, the usual stuff that makes people’s lives better are good acts; doing things that harm are bad acts. Very few actions are pure in their effect, something marvellously addressed in the TV show The Good Place. What we consider good and evil are culturally determined, within certain parameters. As a rule killing, raping and stealing are considered bad, but throughout history the definitions of these things have varied. A perfect example is the Biblical commandment Thou shalt not kill which, in the original is clearly meant to be read Thou shalt not kill other Jews. Another example. The name Mother Teresa has become literally synonymous with selfless sacrifice and goodness. The acts she performed were, from her point of view, for the purest motives - to help the most disenfranchised people into heaven. What she actually did was cause thousands of desperate people entirely pointless and avoidable pain and suffering. She denied treatment, healthcare and pain relief to those under her “care” in the belief that it “purified” them. Was she “evil”? Her acts were, the effects of her actions demonstrably were, but she thought she was doing good, but effects determine morality. Was dropping the atomic bomb on Hiroshima evil? It caused massive death and suffering amongst civilians, but almost certainly brought the war to a much more rapid conclusion so saved much death and suffering? How about the second bomb on Nagasaki? The same argument can be made for any act of war, or any act of terrorism. Those performing it - or perpetrating it - believe they have good reasons for doing so; a terrorist and a freedom fighter are the same person seen from different angles. Conversely, if someone is a seething mass of hate and envy and bigotry inside but their actions are kind and generous and helpful, are they a good person? Ethics is slippery, full of grey areas and necessary compromises. Lying is wrong, but sometimes essential; the classic extreme example is lying to the SS about the Jews hiding in the attic, but even so-called “white lies” we tell to spare people’s feelings come under this. So, if I must judge people (and, try as we might not to, we all do) I judge them on their actions and their effects in the real world, although I may give leeway for intent, as well as genuine human frailty.  Question: Can you do evil without being evil? ",
            "date": "Answered April 25, 2020",
            "views": "34",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Keisha Jean",
                    "user_href": "/profile/Keisha-Jean"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sabri Shahin",
                "href": "/profile/Sabri-Shahin"
            },
            "answer_text": "Can you do evil without being evil? We are being tempted and God has empowered us to resist temptations. If a person does not want to resist temptations and chooses to sin, then he should not say that God has predestined his sin because God has asked us to obey and to resist temptations. Talking in parables, Jesus taught that God tests us by tribulation, temptation, trials, persecution and promised rewards in heaven for those who pass the tests of persecution, temptation, trials, and tribulations Jesus taught that there will be testing and some will fall away in time of temptation as written in Luke 8:13 and Mark 4:17 James 1:12 teaches that people will be tested by temptations and urges us to endure the temptations If you are a Muslim, you will also find similar teachings in Qur’an verses When we analyze the verses of Qur’an, we find that it is the same message revealed by the same God, we also find in Qur’an that life is a testing period and that people will be rewarded according to their obedience and according to their good deeds We do not have full knowledge about God, we cannot say that he allows temptations, so he is a bad God, we cannot say that since God allows suffering then he is a bad God. God has revealed that we are being tested and there are many things we do not know. That was valid thousands of years ago, those are valid now, and will be valid until the end of that temporary life. Qur’an verse 16:99 teaches that obedient believers can resist devil’s temptations Verse 17:65 teaches that the devil has no authority to mislead people (they can resist temptations) Verse 7:30 teaches that God does not mislead people, but people are misled when they follow the devil’s temptations. That is how God has set-up the testing environment We are here for testing; test environment necessitates struggle between good and evil. Testing missions are not supposed to be easy and comfortable. The test questions are not supposed to be known in advance. The wealthy father has the right to test his sons before distributing the wealth The wise father disciplines his children and prepares them for a better life The obedient son who takes care of others should be rewarded better than the disobedient son who persecutes others. Psalm 66:10 teaches ‘For You, O God, have tested us; You have refined us as silver is refined’ Proverbs 17:3 teaches ‘The refining pot is for silver and the furnace for gold, but God tests the hearts’ Isaiah 48:10 teaches ‘I have refined you, but not as silver is refined. Rather, I have refined you in the furnace of suffering’ Job 23:10 teaches ‘when he has tested me, I will come forth as gold’ Regardless of how successful we are with our personal objectives; we cannot have inner peace without addressing the high-level objective; the purpose of our existence. It is wrong to say ‘let us enjoy the journey and forget about the destination’ If you find yourself in a train, you should not enjoy the beautiful scenes before first ask: why am I here? Where is the destination? We should first ask ‘what is the purpose of life?’ What is the value of life if we do not know the purpose of that life? It is the greatest good for an individual to discuss virtue every day... for the un-examined life is not worth living – Socrates Our life on earth is a very short period compared to the universe time scale; It could be a temporary test period. There are hundreds of verses and teachings about that as mentioned in the following answer: https://www.quora.com/How-do-we-... We have been asked to believe in God and Heaven but we have not seen God or heaven. Our fate will be determined based on that belief and on our good deeds. Why did God make it a difficult test for us? Although God knows what’s in our hearts and what each of us might do, he tests us and wants us to witness our own test results in order to admit that we have been fairly rewarded according to our achievements as recorded in the test results Before the wealthy father distributes his wealth, he may want to record which son is obedient, the records are not for the father who knows, but as a testimony for people who might question the justice of their father Although the wise teacher knows the hard-working student and the lazy student, he prepares regular exams as testimonies so that the students would not say that the teacher had favored some students over the others. Exams also urge students to get prepared in order to succeed The student is not supposed to rejoice and enjoy himself during the exam hours Students should not wonder about the intention of the teacher; they are supposed to focus on what the teacher asked them to do If God wants to set up the testing environment to test people, then we are not supposed to advise God on how to set up the terms and conditions of the testing. The students are not supposed to advise the teacher on how to prepare the exams. God has created us, and he knows how to test us. The testing questions and answers are not supposed to be disclosed before the exam; testing environment necessitates some doubts and enables different choices and different decisions. The test does not depend on the level of education, a child may say ‘I do not see the plane any more, it is going far away, it is still there but my sight does not reach it; God must be there but my sight does not reach him’, but a scientist might conclude that, ‘I do not see God, then there is no God’. The test does not depend on the level of religion education, maybe someone who never heard of the religion teachings could pass the test based on the natural original gifts of conscience and reason ‘What I do not want done to myself, I will not do to others. We may find some scholars who know the religion teachings but they accept to persecute and torture others, those are the bad trees which the prophets have warned us of them and of their bad fruits. The wise teacher sets different evaluation criteria for different grades; the students in the first grade are not evaluated as the students in the advanced degrees. We expect that the fair and wise God would evaluate people according to what they have been provided. The person who never heard of Prophets would have an easier test based on the gift of intelligence and conscience; he might get rewards for his good works and he might not be punished if not wicked. God has empowered each of us to be happy and blessed. God does not predetermine plans for us. God has delegated that task to us, it is up to us to be blessed or to be cursed. The message that God has revealed to all prophets is: ‘Blessings for obedience and curses for disobedience’ All prophets taught that we can earn salvation by obedience, repentance, and good deeds to help others. “In obedience and repentance is your salvation” Isaiah 30:15 Based on the above, the obedient believer should be blessed in this life and should be saved in the afterlife. That is the truth which should set you free. For those who have doubts, they can ask God. All prophets have urged us to ask God and taught that God would answer us. Do not worry about how you will receive and understand the answer; God has created us and he knows how to convey his message to us. The following answers include the details: https://www.quora.com/What-are-Gods-greatest-teachings/answer/Sabri-Shahin https://www.quora.com/How-do-we-know-our-purpose-of-existence-in-this-world/answer/Sabri-Shahin https://www.quora.com/What-makes-us-happy-in-our-lives/answer/Sabri-Shahin https://www.quora.com/What-are-some-life-philosophies-that-cut-across-all-cultures/answer/Sabri-Shahin https://www.quora.com/What-are-the-differences-between-the-Holy-books-of-different-religions-Do-all-of-them-promote-love-humanity/answer/Sabri-Shahin https://www.quora.com/Is-it-true-that-everyone-is-born-innocent/answer/Sabri-Shahin https://www.quora.com/If-God-is-loving-and-caring-why-does-evil-and-suffering-still-exist/answer/Sabri-Shahin ",
            "date": "Answered April 21, 2020",
            "views": "69",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Miguel Malfabon",
                    "user_href": "/profile/Miguel-Malfabon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maarten van den Driest",
                "href": "/profile/Maarten-van-den-Driest"
            },
            "answer_text": "I don’t think the word ‘evil’ is very useful. We tend to think of evilness as a quality that some acts or things or even people have. I very much doubt if it really works that way. If you wanted your question answered within the confines of a certain type of christianity, Sabri Shahin might well have answered very well already. Then again, you didn’t say so. In general, people do things because of reasons and motivations. It is certainly not good if your motivations are negative. If they are, for example, hateful or spiteful or based on jealousy, the results tend to be negative. I do not mean that there exists some sort of instant karma that ‘punishes’ you in a direct sense but you will be pushing negativity into the future and the way you act will be coloured by those intentions. The negavity will earth itself eventually, somehow, somewhere. It is, therefore, very important that you train yourself to have positive, loving thoughts and feelings about basically everything. This is hard work. I know. It is still worthwhile. If your intentions are positive, based on love and compassion and such, you will be pushing positivity into the future. I’ll make a guess and predict you’ll feel more happy as well. In general. Not all your endaevours will succeed but no one garantueed that any way. If you accept the situation here and now as it apparently is and work with a positive mind on working toward positive, loving goals.. you can’t go far wrong. I bet any number of faiths would support this as well. Terms and conditions may apply, they usually do, but your question wasn’t about whether you go to heaven. ",
            "date": "Answered April 21, 2020",
            "views": "62",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Driggs",
                    "user_href": "/profile/David-Driggs-4"
                },
                {
                    "user_id": "Paul Perry",
                    "user_href": "/profile/Paul-Perry-6"
                },
                {
                    "user_id": "Devala Rees",
                    "user_href": "/profile/Devala-Rees"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sakshi Goyal",
                "href": "/profile/Sakshi-Goyal-200"
            },
            "answer_text": "Yes. You don’t have to be evil to do evil. Some people are not bad by heart yet they hurt some peoples, either intentionally or unintentionally. Nobody is born evil, people choose to be good or bad. ",
            "date": "Answered April 21, 2020",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Devala Rees",
                "href": "/profile/Devala-Rees"
            },
            "answer_text": "As a Hindu, I don’t think it’s possible to really ‘be’ evil. The essential being, the Self, cannot be tainted. But you can do acts that cause suffering or knowingly promote ignorance; that can be called ‘doing evil’ if you want to so term it. ",
            "date": "Answered April 22, 2020",
            "views": "43",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Yehuda Dion Setyadi",
                "href": "/profile/Yehuda-Dion-Setyadi"
            },
            "answer_text": "Of course. Not all sins are intentional. Some happen against the sinner’s will, mostly through ignorance. Saint Paul did much evil, yet he did not become evil because he did the evil that he did out of ignorance. ",
            "date": "Answered April 26, 2020",
            "views": "37",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Greig Smith",
                "href": "/profile/Greig-Smith-6"
            },
            "answer_text": "Yes you can go through bad times in your life when you are not yourself and do bad things that are out of character and which you may regret for the rest of your life ",
            "date": "Answered April 26, 2020",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jay Smith",
                "href": "/profile/Carleton-Howard"
            },
            "answer_text": "Yes - just adopt some religion and do as the self-appointed leaders of that religion tell you to do, because God says that you must. Christianity and Islam provide excellent examples. ",
            "date": "Answered April 23, 2020",
            "views": "29",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Desiree Santiago",
                "href": "/profile/Desiree-Santiago-1"
            },
            "answer_text": "Sometimes two goods create an evil ana sometimes two evils create a good its all about intentions. ",
            "date": "Answered April 28, 2020",
            "views": "16",
            "upvotes": "0"
        }
    ]
}