{
    "title": "Can we use general relativity to describe an object that moves in time dimension only assuming that it does not interact with any of the other 3 dimension? - Quora",
    "tags": [
        "Spacetime",
        "Dimensions (physics)",
        "General Relativity",
        "Time (physics)",
        "Relativity (physics)",
        "Astrophysics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vinod Rawal",
                "href": "/profile/Vinod-Rawal-28"
            },
            "answer_text": "No, General Relativity is all about the geometry of space & time which makes a space-time metric in which all the reference frame and observations are taken in respect with space and time both because there aren't different.  The every object which as a mass will bend space-time curvature so there cannot be a some object that move with respect of only time. But psychological you can take a example of sleeping in which you don't moves with regards if space but times will fly off always. But don't take it seriously even this is also wrong😉 because you stills bend the curvature😩, Hehe! ",
            "date": "Answered October 22, 2020",
            "views": "96",
            "upvotes": " Answer requested by Prakhar Rakhya",
            "upvoters": [
                {
                    "user_id": "Anupama H G",
                    "user_href": "/profile/Anupama-H-G"
                },
                {
                    "user_id": "Gurudath Shivadas Kavalu",
                    "user_href": "/profile/Gurudath-Shivadas-Kavalu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prof S.Suresh Kumar",
                "href": "/profile/Prof-S-Suresh-Kumar"
            },
            "answer_text": "Regardless of the properties of the Universe you inhabit, your motion through space and time cannot be treated separately from one another; you need them both, together, to describe your reality. Minkowski took a giant leap forward when he realized, mathematically, that moving through time behaves exactly as moving through space does, except with two additional multiplicative factors: c, the speed of light in a vacuum, and i, the imaginary number √(-1). ",
            "date": "Answered October 22, 2020",
            "views": "74",
            "upvotes": " Answer requested by Prakhar Rakhya"
        },
        {
            "author_info": {
                "name": "Ganesh Subramaniam",
                "href": "/profile/Ganesh-Subramaniam-6"
            },
            "answer_text": "It is not possible. If it is an ‘object’ then it is made of matter, and has mass, and so occupies space. In which case it interacts with the spatial dimensions. Furthermore, moving only in ‘time’ is not possible because everything in the universe is in motion through spacetime. Nothing in the universe is at ‘absolute’ rest. ",
            "date": "Answered October 22, 2020",
            "views": "120",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Rajratna Adsul",
                "href": "/profile/Rajratna-Adsul"
            },
            "answer_text": "General relativity is motion in spacetime, not just time. Space does not exist without time. One cannot formulate Einstein's field equations in just temporal form, where the Einstein tensor G has only the time index, and the energy-momentum tensor T is also temporal. Such equation has no dynamics, since motion involves mass and intersects spatial axes. So, this is not possible. ",
            "date": "Answered October 22, 2020",
            "views": "105",
            "upvotes": " Answer requested by Prakhar Rakhya"
        }
    ]
}