{
    "title": "Can an argument be false? - Quora",
    "tags": [
        "False Beliefs",
        "Logical Fallacies",
        "Reasoning",
        "Logic (philosophy)",
        "Debate",
        "Arguments and Argumentation",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mihir Parekh",
                "href": "/profile/Mihir-Parekh-11"
            },
            "answer_text": "If it weren't, philosophy would not had been a business for past 2000 years. Arguments can be false. We may not always know the error. We may yet not have a way to identify all false arguments. But, that should not be taken to mean that we have absolutely no idea about falsity. If you argue with me that we should leave virgin girls on volcanic mountains to die as offering to Gods, I will know that there's some wrong with your arguments even if I don't wait to hear them before calling psychiatric hospital. ",
            "date": "Answered January 19, 2020",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Chase Walker",
                "href": "/profile/Michael-Chase-Walker-1"
            },
            "answer_text": "Yes, of course, there is a long litany of false, flawed and erroneous arguments described as Logical Fallacies. Dr. Bo's Criteria for Logical Fallacies: It must be an error in reasoning not a factual error.It must be commonly applied to an argument either in the form of the argument or in the interpretation of the argument.It must be deceptive in that it often fools the average adult.",
            "date": "Answered January 19, 2020",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard Nathan",
                "href": "/profile/Richard-Nathan-1"
            },
            "answer_text": "You would not be asking that if you had seen the Monty Python Augment Clinic sketch. Argument Clinic - Monty Python's Flying Circus - video dailymotion If that link stops working, just google “Monty Python argument clinic.” ",
            "date": "Answered January 19, 2020",
            "views": "20",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sheri Weinhart",
                    "user_href": "/profile/Sheri-Weinhart"
                },
                {
                    "user_id": "Selena Palmer",
                    "user_href": "/profile/Selena-Palmer-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Ashley",
                "href": "/profile/Richard-Ashley-36"
            },
            "answer_text": "Of course! Just because it’s an argument does not mean it’s correct or true. An argument that posits that the earth is flat would be a false argument even if it was argued in all sincerity. ",
            "date": "Answered January 20, 2020",
            "views": "6",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "T. Stephen Cornelius",
                "href": "/profile/T-Stephen-Cornelius"
            },
            "answer_text": "You are invited to study the Rhetoric of Logic and you will have your answer it can be false, true or Both by the construct of premise and drawn conclusion. Homework time… eh? ",
            "date": "Answered January 19, 2020",
            "views": "7",
            "upvotes": "0"
        }
    ]
}