{
    "title": "Can stoicism cure depression? - Quora",
    "tags": [
        "Non-Drug Depression Treatments",
        "Stoicism",
        "Medical Treatment for Depression",
        "Coping and Living with Depression",
        "Understanding and Improving Mental Health",
        "Philosophy",
        "Depression",
        "Mental Illness",
        "Mental Health"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marc Lambert",
                "href": "/profile/Marc-Lambert-9"
            },
            "answer_text": "Yes, if one can can change to all left brain logical/positive thought and feeling which is what Stoicism is, those with high left brain use have been telling others to change to it since Adam was a boy it goes under names, like goodness and enlightenment. Buddha, Jesus even Obama have spoken of it, but it has only just become clear that this maximised left brain use and reduced use of the faulty right anxious/negative brain that drives all human made suffering. Depression is now linked to hibernation in lower animals, in humans it is triggered and mixed with right brain anxiety, this is why TMS are using magnets to increase left brain use. It is no good telling human to be good maximising left brain usually use requires a very powerful practice, EGMi is such a practice and one will see that goodness = energy efficiency = evolutional fitness of mind and body. ",
            "date": "Answered May 7, 2019",
            "views": "70",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Klaus Sperger",
                "href": "/profile/Klaus-Sperger"
            },
            "answer_text": "Yes,it may help mild to moderate depression. I doubt it would help major depressive disorder. I think also there is a risk that stoicism could increase depression. I am more of a taoist or epicurean myself which is not too very different from stoicism. That which you seek is causing you to seek. Most people think happiness is getting what you want,but really happiness is about wanting what you’ve got. things are only bad in comparison with something better.and the better is only a picture in your mind. better to have the terrible problems you have than to have both your legs cut off. your life is pretty much about as good as you make your mind up for it to be. ",
            "date": "Answered May 6, 2019",
            "views": "41",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "George Unknown",
                    "user_href": "/profile/George-Unknown-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Philippus",
                "href": "/profile/Daniel-Philippus-1"
            },
            "answer_text": "No. Cognitive Behavioral Therapy, which is quite effective, was partially inspired by and shares some elements with Stoic ethics. However, philosophies are not therapies and Stoicism can no more cure depression than it can cure a broken leg. ",
            "date": "Answered May 6, 2019",
            "views": "65",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ashton Hennessy",
                    "user_href": "/profile/Ashton-Hennessy"
                }
            ]
        },
        {
            "author_info": {
                "name": "John K Hsiao",
                "href": "/profile/John-K-Hsiao"
            },
            "answer_text": "I think a more useful question is whether depression can cure stoicism. ",
            "date": "Answered May 11, 2019",
            "views": "49",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Liz Lobao",
                    "user_href": "/profile/Liz-Lobao"
                },
                {
                    "user_id": "Michael Soso",
                    "user_href": "/profile/Michael-Soso"
                },
                {
                    "user_id": "Dixie Golden",
                    "user_href": "/profile/Dixie-Guill-Golden"
                }
            ]
        }
    ]
}