{
    "title": "Can a real number be both rational and irrational? - Quora",
    "tags": [
        "Real Numbers",
        "Irrational Numbers",
        "Rational Numbers",
        "Rationality",
        "Complex Numbers",
        "Numbers (mathematics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Emerson",
                "href": "/profile/Andrew-Emerson-30"
            },
            "answer_text": "No, and the reason is actually quite beautiful. A rational number is defined as a ratio of two integers. An irrational number is defined as any real number that is not rational. Because the irrationals are defined in this way, it is impossible for these two sets of numbers to share even a single element. Another example of such a relationship between two types of numbers is even and odd numbers. If we define the “even” numbers as all the integers that are “evenly” divided by 2 (i.e. no remainders after the division) and define the “odd” numbers as all the integers that are not even, then there will be no integers that are both even and odd. Not only that, but there are also no integers that are neither even nor odd. Together these two sets include all the integers but do not share any integers in common. Every integer must be either one or the other. And that’s because of the way they are defined. In fact, whenever you define anything as not-something-else (which is called a definition “by negation”), the two “things” will never share even one instance in common, regardless of what the definition of the first “thing” is. And that is what is so beautiful about definitions by negation: they provide a nice clean smooth break between two sets with no ambiguity between them. ",
            "date": "Answered January 9, 2020",
            "views": "17",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Devon Cruiser",
                    "user_href": "/profile/Devon-Cruiser"
                },
                {
                    "user_id": "Chandra Varanasi",
                    "user_href": "/profile/Chandra-Varanasi"
                }
            ]
        },
        {
            "author_info": {
                "name": "William La Chenal",
                "href": "/profile/William-La-Chenal"
            },
            "answer_text": "William La Chenal's answer to Are there any numbers that are both rational and irrational? Here’s a thought: Take some irrational, let’s say ππas a popular example, and divide it by a rational natural number such as nn Rational or irrational ? Irrational. Now let n→n→ something large. People like to say infinity, but they lack a grasp of that. It’s out of reach. πnπncontinues to be irrational But what is the limiting value? It appears to be zero. Which we think of as a ratio. Rational. Although I’m not sure we should. This exposes the dangers of thinking that a limit (“tends to”) is the same as an actual equality. Which is short-hand (short-brained) thinking involving ‘algebraic completion’. Old-school mathematical dinosaurs maintain the distinction. Others are sloppy. Which is irrational. ",
            "date": "Answered August 18, 2019",
            "views": "700",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Peter VanderStoep",
                    "user_href": "/profile/Peter-VanderStoep"
                }
            ]
        },
        {
            "author_info": {
                "name": "Reuven Harmelin",
                "href": "/profile/Reuven-Harmelin"
            },
            "answer_text": "Irrationality of a number is defined as the negation (the opposite) of rationality of a number. Therefore, no (real) number could be simultaneously a rational number and an irrational number, just as no subset A of a non-empty set X could have anything in common with its own complementary set X-A, because, by definition, what is in X-A is not in A, and what is in A is not in X-A. The Pythagoreans believed that if X is the set of all real numbers and A is the set of all rational numbers in X, then X-A is an empty set, that is, there are no irrational numbers (according to their mentor, Pythagoras) but Euclid proved that X-A is a nonempty set by showing that sqrt(2) is not in A (that is, it is impossible to represent sqrt(2) as a quotient of two integers) and therefore sqrt(2) is in X-A, and therefore X-A is non-empty!!! There is a legend that already one of Pythagoras’ students has found a proof that the sqrt(2) is irrational, and he was taken by other students to sail on a boat and he never returned from that trip. ",
            "date": "Answered January 1, 2020",
            "views": "375",
            "upvotes": " Answer requested by Lawson Shepherd",
            "upvoters": [
                {
                    "user_id": "Peter VanderStoep",
                    "user_href": "/profile/Peter-VanderStoep"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevin Simonson",
                "href": "/profile/Kevin-Simonson-2"
            },
            "answer_text": "No. A real number cannot be both rational and irrational. A rational number is defined as a number that can be expressed at a/b where a is an integer and b is a positive integer. An irrational number is defined as a number that cannot be expressed that way. It is impossible to both be able to be expressed that way and to not be able to be expressed that way. Either a number can be expressed that way or it cannot. ",
            "date": "Answered January 1, 2020",
            "views": "222",
            "upvotes": " Answer requested by Lawson Shepherd",
            "upvoters": [
                {
                    "user_id": "Filippo Passante",
                    "user_href": "/profile/Filippo-Passante-1"
                },
                {
                    "user_id": "Brett Schmidt",
                    "user_href": "/profile/Brett-Schmidt-5"
                },
                {
                    "user_id": "Roger Pickering",
                    "user_href": "/profile/Roger-Pickering-3"
                },
                {
                    "user_id": "Claire Germond",
                    "user_href": "/profile/Claire-Germond"
                },
                {
                    "user_id": "Andrea Zelgher",
                    "user_href": "/profile/Andrea-Zelgher"
                },
                {
                    "user_id": "Peter Flom",
                    "user_href": "/profile/Peter-Flom"
                }
            ]
        },
        {
            "author_info": {
                "name": "Glen Cochrane",
                "href": "/profile/Glen-Cochrane-2"
            },
            "answer_text": "A real number is any number set can be written as a measurement along a physical line.A rational number is any number that can be represented by a ratio of two integers. Therefore an irrational number, is the opposite of a rational number, or any number that cannot be represented by a ratio of two integers. Therefore. Therefore, based on he's definitions a real number can be either irrational or rational. ",
            "date": "Answered January 25, 2020",
            "views": "170",
            "upvotes": " Answer requested by Lawson Shepherd",
            "upvoters": [
                {
                    "user_id": "Frank Abbing",
                    "user_href": "/profile/Frank-Abbing-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Duggan",
                "href": "/profile/Steve-Duggan-2"
            },
            "answer_text": "A rational number is a number that can be expressed as a fraction p/q, where p and q are integers. That’s a fact that for a particular number is either true or not. It can’t be both. A number is either rational or it isn’t. It has to be one or the other. It can’t be both. Answer: no. ",
            "date": "Answered January 2, 2020",
            "views": "98",
            "upvotes": " Answer requested by Lawson Shepherd",
            "upvoters": [
                {
                    "user_id": "Brett Schmidt",
                    "user_href": "/profile/Brett-Schmidt-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brett Schmidt",
                "href": "/profile/Brett-Schmidt-5"
            },
            "answer_text": "No. A rational number is a number which is exactly equal to the ratio (quotient) of two integers. An irrational number is a number which is not exactly equal to the ratio of any two integers. So an irrational number is a number which is not rational. Rational numbers and irrational numbers are, by definition, mutually exclusive. ",
            "date": "Answered August 18, 2019",
            "views": "127",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Rankine Gajendra",
                    "user_href": "/profile/Rankine-Gajendra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rhys Thomas",
                "href": "/profile/Rhys-Thomas-127"
            },
            "answer_text": "No, an irrational number, by definition, is NOT RATIONAL! A rational number may be written as an integer-integer fraction; an irrational number cannot be written in this way.  Can an object be both purple and incapable of being purple? ",
            "date": "Answered August 18, 2019",
            "views": "220",
            "upvotes": " View 6 Upvoters"
        },
        {
            "author_info": {
                "name": "James Gere",
                "href": "/profile/James-Gere"
            },
            "answer_text": "No. But, you may not be able to decide which class a number falls into, from the number's definition. Rational numbers are the ratio of two integers. Irrational numbers aren't. The two classes are distinct. Deciding whether Goldbach's number is 0, or even rational, may not be a decidible proposition. ",
            "date": "Answered January 1, 2020",
            "views": "72",
            "upvotes": " Answer requested by Lawson Shepherd"
        },
        {
            "author_info": {
                "name": "Andrew Shan",
                "href": "/profile/Andrew-Shan-1"
            },
            "answer_text": "A rational number is defined as p/q where p and q are real numbers. Irrational numbers cannot be written as p/q where p and q are real numbers. They are complements of each other in the real number system. Therefore, a real number cannot be both rational and irrational. ",
            "date": "Answered January 5, 2020",
            "views": "59",
            "upvotes": " Answer requested by Lawson Shepherd"
        },
        {
            "author_info": {
                "name": "Mike McLaury",
                "href": "/profile/Mike-McLaury-1"
            },
            "answer_text": "No. A rational number is a number that can be expressed as the quotient of two integers. An irrational number is a number that cannot be expressed as a quotient of two integers. So if a number is either rational or irrational, it cannot also be the other. ",
            "date": "Answered January 9, 2020",
            "views": "59",
            "upvotes": " Answer requested by Lawson Shepherd"
        },
        {
            "author_info": {
                "name": "Lai Johnny",
                "href": "/profile/Lai-Johnny"
            },
            "answer_text": "A real number is rational if it a quotient of two integers and irrational if it is not rational. Therefore by definition, a real number cannot both rational and irrational. ",
            "date": "Answered January 7, 2020",
            "views": "40",
            "upvotes": " Answer requested by Lawson Shepherd"
        },
        {
            "author_info": {
                "name": "Bob Carr",
                "href": "/profile/Bob-Carr-16"
            },
            "answer_text": "No. An irrational number is defined as one which is not rational. Consequently a number cannot be both irrational and rational by definition. The only possible exception is a transfinite number, but the questioner stipulated a real number, which excludes transfinite numbers. ",
            "date": "Answered January 9, 2020",
            "views": "30",
            "upvotes": " Answer requested by Lawson Shepherd"
        },
        {
            "author_info": {
                "name": "Merritt Gardner",
                "href": "/profile/Merritt-Gardner-1"
            },
            "answer_text": "Are you an English speaker? In English, in this case, “ir” stands for not. Can a number be both rational and not rational? Not in mathematics. At its foundation, mathematics depends upon a two valued logic. A statement is either true or not true, never both. ",
            "date": "Answered January 1, 2020",
            "views": "35",
            "upvotes": " Answer requested by Lawson Shepherd"
        },
        {
            "author_info": {
                "name": "Charles Holmes",
                "href": "/profile/Charles-Holmes-66"
            },
            "answer_text": "The short answer is of course not. Rational and irrational numbers feign similarity and are in the most optimistic sense only conjugates of each other since they are similar but different. C.H. ",
            "date": "Answered January 4, 2020",
            "views": "52",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Peter VanderStoep",
                "href": "/profile/Peter-VanderStoep"
            },
            "answer_text": "No. some of the answers talk about rational and simple irrational, none has said what makes up the bulk of the real number line TRANSCENDENTAL. only pi and e are used with any frequency, but the decimal representation of these numbers is infinite and non-repeating. ",
            "date": "Answered August 22, 2019",
            "views": "44",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Manny August FitzStephen Bono",
                "href": "/profile/Manny-August-FitzStephen-Bono-1"
            },
            "answer_text": "  All real numbers can be rational or irrational. But the rational ones are not irrational and vice versa. ",
            "date": "Answered August 18, 2019",
            "views": "68",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Wes Browning",
                "href": "/profile/Wes-Browning"
            },
            "answer_text": "No. The definition of “rational” is “expressible as a/b where a and b are integers and b is not zero.” The definition of “irrational” is “not rational.” ",
            "date": "Answered January 1, 2020",
            "views": "30",
            "upvotes": " Answer requested by Lawson Shepherd"
        },
        {
            "author_info": {
                "name": "Tom Boerjan",
                "href": "/profile/Tom-Boerjan-1"
            },
            "answer_text": "No. A real number as a decimal number ends or repeats; an irrational number neither ends or repeats. Rationals 1, 2.5 , .333333repeating, ….. infinity large set Irrationals Pi, square root of 2,3,5,6, ….. infinity large set ",
            "date": "Answered January 29, 2020",
            "views": "29",
            "upvotes": " Answer requested by Lawson Shepherd"
        },
        {
            "author_info": {
                "name": "George Baiev",
                "href": "/profile/George-Baiev"
            },
            "answer_text": "Nope, those are non intersecting sets, by definition irrational numbers are numbers that are represented by infinite non-periodic decimal fractions, thus they cannot be represented in terms of fraction between whole numbers whereas rational numbers are numbers that can be represented in this form ",
            "date": "Answered February 15, 2020",
            "views": "29",
            "upvotes": " Answer requested by Lawson Shepherd"
        },
        {
            "author_info": {
                "name": "Drake Way",
                "href": "/profile/Drake-Way"
            },
            "answer_text": "A rational number is defined as any number that can somehow be expressed as a quotient of two integers. An irrational number is defined as any real number that cannot, in any way, be expressed as a quotient of two integers. These two definitions are mutually exclusive. ",
            "date": "Answered January 13, 2020",
            "views": "46",
            "upvotes": " Answer requested by Lawson Shepherd"
        },
        {
            "author_info": {
                "name": "George Vincenti",
                "href": "/profile/George-Vincenti"
            },
            "answer_text": "irrational numbers are numbers that are not rational. Rational numbers are those you can express as quotient of two integers. So 127/12 is a rational number, while the square root of 27 is not, because no quotient of two integers, squared, can give 27. ",
            "date": "Answered January 25, 2020",
            "views": "26",
            "upvotes": " Answer requested by Lawson Shepherd"
        },
        {
            "author_info": {
                "name": "Jim Rock",
                "href": "/profile/Jim-Rock-16"
            },
            "answer_text": "Can a real number be both rational and irrational? A rational number can be expressed as the ratio of two integers. An irrational number cannot. ",
            "date": "Answered January 25, 2020",
            "views": "22",
            "upvotes": " Answer requested by Lawson Shepherd"
        },
        {
            "author_info": {
                "name": "Ian Asznowicz",
                "href": "/profile/Ian-Asznowicz"
            },
            "answer_text": "No. These are mutually exclusive. Irrational numbers cannot be exactly expressed as fractions but rational numbers can. ",
            "date": "Answered January 2, 2020",
            "views": "21",
            "upvotes": " Answer requested by Lawson Shepherd"
        },
        {
            "author_info": {
                "name": "Michael Drayton",
                "href": "/profile/Michael-Drayton-5"
            },
            "answer_text": "A rational number is a number which can be expressed as a fraction. And irrational number is a number which cannot be expressed as a fraction. Therefore a rational number can never be an irrational number and an irrational number can never be a rational number. ",
            "date": "Answered January 1, 2020",
            "views": "37",
            "upvotes": " Answer requested by Lawson Shepherd"
        },
        {
            "author_info": {
                "name": "John Butcher",
                "href": "/profile/John-Butcher-13"
            },
            "answer_text": "No. An irrational number is defined to be a number which is not rational. ",
            "date": "Answered January 9, 2020",
            "views": "17",
            "upvotes": " Answer requested by Lawson Shepherd"
        },
        {
            "author_info": {
                "name": "Charles Irwin",
                "href": "/profile/Charles-Irwin-6"
            },
            "answer_text": "No. Rational numbers are those that can be expressed as a ratio of two integers. Irrational numbers are those that cannot. ",
            "date": "Answered January 1, 2020",
            "views": "30",
            "upvotes": " Answer requested by Lawson Shepherd"
        },
        {
            "author_info": {
                "name": "Ivan Tsatsarov",
                "href": "/profile/Ivan-Tsatsarov"
            },
            "answer_text": "No one numbers is rational or irrational cannot be both. ",
            "date": "Answered January 29, 2020",
            "views": "10",
            "upvotes": " Answer requested by Lawson Shepherd"
        },
        {
            "author_info": {
                "name": "Suresh Mangalore",
                "href": "/profile/Suresh-Mangalore-1"
            },
            "answer_text": "A rational number is defined as a division of two integers. Any irrational number cannot satisfy the above definition. ",
            "date": "Answered January 25, 2020",
            "views": "14",
            "upvotes": " Answer requested by Lawson Shepherd"
        },
        {
            "author_info": {
                "name": "Bill Fornaro",
                "href": "/profile/Bill-Fornaro"
            },
            "answer_text": "no. it’s one or the other ",
            "date": "Answered January 25, 2020",
            "views": "7",
            "upvotes": " Answer requested by Lawson Shepherd"
        },
        {
            "author_info": {
                "name": "Aadil Khan",
                "href": "/profile/Aadil-Khan-361"
            },
            "answer_text": "Yes ",
            "date": "Answered August 18, 2019",
            "views": "10",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kay James",
                "href": "/profile/Kay-James-51"
            },
            "answer_text": "No. ",
            "date": "Answered January 1, 2020",
            "views": "13",
            "upvotes": " Answer requested by Lawson Shepherd"
        },
        {
            "author_info": {
                "name": "Will Haight",
                "href": "/profile/Will-Haight"
            },
            "answer_text": "No. ",
            "date": "Answered January 2, 2020",
            "views": "18",
            "upvotes": " Answer requested by Lawson Shepherd"
        },
        {
            "author_info": {
                "name": "Um Omar Daher",
                "href": "/profile/Um-Omar-Daher"
            },
            "answer_text": "YES ",
            "date": "Answered January 25, 2020",
            "views": "6",
            "upvotes": " Answer requested by Lawson Shepherd"
        }
    ]
}