{
    "title": "Can I defeat God? - Quora",
    "tags": [
        "Defeat",
        "Theology",
        "God"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marc Van Lohuizen",
                "href": "/profile/Marc-Van-Lohuizen"
            },
            "answer_text": "I'll assume you mean what many mean by God, which means at least the dreadful thing is omniscient (all knowing) and omnipotent (all powerful). Absolutes -- always dangerous and alien and inhuman and ultimately awful and dark! It's perplexing to me how relative, contingent creatures without necessary existence can ever ignore just how starkly horrifying and inherently embedding hopelessness any truly absolute being must always be. It's actually unavoidable: an absolute God is also definitively both perfectly hopeless itself (unable to change or grow or enjoy overcoming genuine challenges or be surprised or truly experience the joy of learning something new) and the greatest possible enemy of hope in all other non-absolute beings. An absolute God can't possess anything like free will, which implies the ability to choose among 2 or more options. For one thing, its omniscience means it knows everything, including its own future actions, so such a God already knew literally eternally each and every single thing it has done, is doing, and will do for all of time, and will never fail to inevitably do everything it does utterly choicelessly; if it could choose to do something different, it would contradict its own omniscience and it would no longer be all knowing because at least that one time it would have been wrong in its foreknowledge. Also, worse yet, an absolute (in this context, perfect is a reasonable synonym an extension) God can never change its mind, can never change at all in even the slightest single way, because perfect is perfect and any change to something perfect will make it necessarily imperfect. But what do you call a thing that has no free will and can't help but do and be exactly what it is? One good word for such a thing is automaton. Hard to understand why so many people bend over backwards to try to love, praise, forgive, worship, admire, and thank a cosmic absolute machine that does all it does without any real say in the matter and always will. This is most likely because, given the fundamentally alien nature of anything absolute, rather than truly understand that any absolute X is *qualitatively* different and incomparable to relative Xs, many people instead blunder into merely imagining that a useful way of thinking about absolute X is to start with their grasp of relative Xs and then keep *quantitatively* increasing that idea until they're satisfied they can at least kind of get the gist of what it looks like as it approaches infinity. But absolute doesn't mean best or most or a lot. It's different. It's a difference not of degree but of kind. This seems plainly true to me about all absolutes. Absolute good or absolute love, because they're the \"absolute\" versions, bear little if any resemblance to normal finite relative good or love. A common mistake atheists make when confronting believers about their god's seeming lack of goodness or love is to forget that the theologians used the word \"absolute\" in both cases, which is used like it's a descriptive adjective but which actually signifies a very different *category* of thing. They say God is love, but who cares? The big logical leap is that *being* love has anything at all to do with *feeling* or even being able to feel it. It doesn't. I've both felt love for others and have experienced what I at least assumed was love from others. Want to know something I've never felt any love or anything from whatsoever? Love. The concept, the abstract idea that we might self-referentially define as being present in all cases we consider to be instantiations of one or more recognized kinds of love, the qualities that every example we'd call love does and by definition must have in common. Love. Nope, never got a single birthday card from Love, never a single \"I love you,\" no hugs, no warmth, no displays of love or anything at all from Love. Why not? Because it can't love. Love can't and doesn't ever love. I don't blame or insult or belittle or judge Love for being incapable of loving. It's a concept, it can't help it, it neither has nor can have feelings, love included. I love Love, am quite glad of its existence. If it didn't exist as a concept, then nothing I or anyone else could ever feel could be love, because Love is necessary for its individual manifestations to exist. But it doesn't love itself. So saying God is love is ultimately mostly void of actual meaning, or at least likely the meaning intended by those who repeat it. And by the way, you don't do people truly committed to faith in the absolute oneness of God any favours by making statements like that. Google, dig a little to see what I mean. You'll read all sorts of mind twisting and logic stretching over desperately defending an absolute oneness in God that I'm fairly certain the overwhelming vast majority of believers would neither require nor think of, and probably would confuse them. Stuff like trying to assert that God either has 1 property or else no properties, and most importantly absolutely (ha) no component parts. For God to be an absolute one, any appearance of multiple anything can only be an illusion. Any properties or qualities we perceive in God must only appear to be distinct from one another and also the whole God, but really be identical and identified with each other and God. So if you want to say God exists, and also that it (1) is good, (2) is loving (or love). (3) is conceivable (at least so anyone can conceive enough to say they believe in something, and that statement of belief has meaning and isn't just an empty mantra that they like to say and imagine stands for something real but is merely sounds put together), (4) is knowable (at least some things about it, like its stated will and also through its interventions in our world), (5) is ineffable, (6) is competent, etc, you have no choice if you take God's oneness seriously but to admit that all those things must be the exact same thing and also one and the same as God. Not touching the Christian Trinity with a ten foot pole, other than to express my deep confusion as to why it's even necessary or believed; it has really no good scriptural support, and seems very much like a \"mystery\" just for the sake of making things more mysterious and confusing. If you're a Christian reading this, ask yourself why it's not okay to believe in one God that is also just one person instead of 3? Why isn't it valid to believe every single word in the Bible, and think of it as God taking on 3 roles, being called Jesus or the Son in his human incarnation (but it's the same guy we also call the Father), and being called the Holy Spirit when... well, honestly, it does make sense that early Christian thought included some groups who recognized 2 persons in one God (Father and Son), but failed to identify the Holy Spirit as its own thing. I may be wrong, but I don't believe that the Holy Spirit ever speaks in the Bible. What do we get out of giving the HS its own personhood too? Does it really deserve this? Can't we lump it in with the Father? In a way, an absolute God is already totally defeated just by being what it is! It quite literally can never be anything else, even if it sincerely wanted to be different (which as a perfect being would be tantamount to wanting imperfection). Yes, you absolutely can defeat such a thing, although you might not like how! I'll tell you at the end, promise. The monster knows everything, so you can't surprise it, can't secretly bide your time and plan against it, can't hide your intentions from it, and certainly can't outsmart it or exploit areas of ignorance. The monster can do anything, without any limits on its power, and in fact can do any and all things regardless of difficulty, complexity, etc instantly and with no effort at all. Effectively, its will can create, alter, shape, destroy, and make anything in reality as well as reality as a whole conform to that will. If such a nightmare existed, it most definitely could effortlessly do anything it wanted to you and you could do nothing to stop it. This includes things like directly altering who you are as a person and your will inside and out. If it pleased it, you might be modified to be exactly the same except now you truly love God no matter what he does, or given the cruelty of the thing it might even change you into a murderous bully despite your prior kindness to others but on top of that you also live in constant guilt and shame for the evils you're doing. In addition, obviously it could just destroy you (again, effortlessly and instantly) -- ranging from simple killing and then whatever it has next in store for you to punish your soul, to full on soul destruction (no eternal soul for you!), to even erasing you from existence so it's like you never existed at all. How could you ever defeat such a God? Sorry, but you can defeat it and even hurt it. Simply make it clear to God through your words and deeds that it can't have you, will never have you, not by your own truly free and unaltered will. Tell him you would always infinitely prefer to go to Hell, no matter how bad it is, because the only way Heaven could ever be acceptable to you is if God was banished in shame and disgrace, and then before permanently going to Hell and actively using its power to produce something as close to suffering in itself and as much as possible forever, it also formally apologizes, & I mean creates hands and knees for itself just so it can beg and prostrate itself before you for a forgiveness it honestly acknowledges it could never hope to deserve or earn. Just to make sure, vow to never forgive it, even if it humbles itself in such a way, and also that you will mock it and spit in its face even if it does all that and even offers to submit itself fully to your will to use its power and knowledge as you see fit as your humble and eager slave. Tell him you want nothing from it, not even its slavery and command of its power, except for it to suffer infinitely forever without hope or next best thing just stop itself from existing ever again. Tell it anything else, no matter how good or pleasant, that it is offering is nothing but worthless garbage, because God itself is absolute garbage and anything from it is thus tainted by its stink and valuelessness. Let it know you will never validate the daily and enormous suffering of the innocent... actually, scratch that. You will never let yourself see value in the undeserved suffering of even one innocent child, even if the child doesn't suffer much and ultimately benefits from it and forgives or thanks God for it, even if that value is as part of a grand design where everyone gets paradise and eternal life in the end, even the child that suffered. To do so would be to approve the use of people and their lives and suffering as a form of manure to fertilize God's garden, even if that garden produced never ending goodness. Because it was all powerful and all knowing and created reality so whatever good plan or end it has, could also have been achieved with no suffering or death at all, which makes its implementation of its plan unforgivably evil. Do all that, make it who you are, and hope if there is an absolute God as described, that it cares enough about either you or its own ego that this will hurt. And remember, God never kills anyone who openly and willfully defies and curses it, not before it breaks your spirit first at least. Christians even freely admit that although it doesn't end well for Satan, he was the very first rebel against God, never had its spirit broken, and remains to this day in the Christian mind as an incredibly powerful being that is even called the god of this world, and implied to rule in Hell too. You never know, piss off God enough on purpose and never repent, the next thing you know you may be titulary ruler of 2 whole dimensions too, even if they're not necessarily the best dimensions. Good luck and peace. See you in Hell! ",
            "date": "Answered October 30, 2018",
            "views": "440",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Adrian Zeros",
                    "user_href": "/profile/Adrian-Zeros"
                }
            ]
        },
        {
            "author_info": {
                "name": "Scott Biggs",
                "href": "/profile/Scott-Biggs-19"
            },
            "answer_text": "God, in my experience with Catholicism, is bound by the criterion of being omniscient, purely benevolent (omnibenevolent), and omnipotent. Hopefully it’s obvious to you that nothing can exist within those criterion, yet that is the domain of God (in my experience with Catholicism). There are very articulate explanations of why nothing can exist that is purely good (omnibenevolent), omniscient, and omnipotent. So, if you’re confused I suggest you turn to them for further detail, a google search should do the trick. Next, what do you mean by defeat? My idea for an answer to this question is anything that can best God. This is easy to do. God is purely benevolent, meaning its impossible, and that ‘He’ never has and never will do anything sinful or wrong. Simply ask him what it feels like to do something wrong, this must be something that you’ve done. You KNOW from experience what that is like, God cannot know that, because ‘He’ has never, and never will have that experience. This is parallel to another philosophical question that goes along the lines of, “Can you explain, to a totally blind person,what it feels like to see red?”. Note that this isn’t covered by hypothetical omniscience, because experience is more than just knowledge. In that way, with those definitions, you can ‘defeat’ God. ",
            "date": "Answered April 28, 2019",
            "views": "195",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Asma Bint Saeed",
                "href": "/profile/Asma-Bint-Saeed"
            },
            "answer_text": "What a stupid question is this in itself?!!! This thinking should be of that mind / person who can defeat life and death forever. And…. and everyone of us all knows that it is never ever possible to command life and death by anyone. No and never… Bcoz the only creator of everything seen / unseen is Almighty Allah. N all affairs have to return to Him. ",
            "date": "Answered October 14, 2018",
            "views": "115",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mudassar Saiyed",
                    "user_href": "/profile/Mudassar-Saiyed"
                }
            ]
        },
        {
            "author_info": {
                "name": "Avadhoot Dandekar",
                "href": "/profile/Avadhoot-Dandekar"
            },
            "answer_text": "When you are, the God is not. And when you are not, the God is. No, you can not defeat God. To win and to defeat is part of duality. And God is a non-duality. Therefore, the question of defeating God is out of question. Thanks :) ",
            "date": "Answered October 14, 2018",
            "views": "80",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Venugopal Siripuram",
                    "user_href": "/profile/Venugopal-Siripuram"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anjali Bijalwan",
                "href": "/profile/Anjali-Bijalwan"
            },
            "answer_text": "unexpected question but still no one can even defeat nature… we made crores of houses on very small land a 10 seconds earthquake destroys everything so how can you think about defeating god … and the question is why do you want to defeat him…. for defeating anyone you will have to know about him very well and we humans still don’t know who God is exactly, where he is, where we can see him…. Bless you!! ",
            "date": "Answered October 16, 2018",
            "views": "108",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Joel John",
                    "user_href": "/profile/Joel-John-200"
                }
            ]
        },
        {
            "author_info": {
                "name": "Muhammad Tariq",
                "href": "/profile/Muhammad-Tariq-517"
            },
            "answer_text": "Either there is no G-d or there is a G-d. In any Case G-d is undefeatable . Since It is Absolutely Impossible for G-d to defeated as undefeatedness is one of the Essential Quality Of G-d. If G-d Does Not Exist then a Being with this Quality does not exist. One that does not Exist cannot be defeated. If such a Being does Exist then with that Quality it is not Relatively Impossible to be defeated but Absolutely Impossible to be defeated. Thanks ",
            "date": "Answered March 15, 2019",
            "views": "87",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Terence Fisher",
                "href": "/profile/Terence-Fisher-1"
            },
            "answer_text": "If you are a believer then no, you can exasperate him, you can infuriate him, but defeat him is not an option, otherwise there would be no God for you. ",
            "date": "Answered April 29, 2019",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sasi Stephen",
                "href": "/profile/Sasi-Stephen-1"
            },
            "answer_text": "The Bible says that Jacob's wrestling match with God turned into a stalemate. ",
            "date": "Answered October 16, 2018",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jim Watterson",
                "href": "/profile/Jim-Watterson-2"
            },
            "answer_text": "No, but I can. ",
            "date": "Answered April 29, 2019",
            "views": "64",
            "upvotes": "0"
        }
    ]
}