{
    "title": "Do you think god exists? If exist have you seen any time? If he is there why cant he stop all crime and punish the culprits? - Quora",
    "tags": [
        "Existence of God Debate",
        "Punishment",
        "Existence",
        "Philosophy of Religion",
        "Atheism",
        "Theology",
        "God",
        "Crime",
        "Religion",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vedant Choubisa",
                "href": "/profile/Vedant-Choubisa"
            },
            "answer_text": "If someone reading this answer believes in god Do not read ahead As well as same goes for an atheist Now going ahead this my own opinion and believe so no need to fire up anything now if someone asks does god exists then the answer will be yes because to create something so complex as well at the same time beautiful with elegance and pious, None other than the existence called The Almighty God can create now coming to the question Here are some pictures : 1.  2.  3.  4.  Now when you look at the first image it explains the existence of God, With the greatest ideology & philosophy at the same time, Though it isn’t concrete proof about the existence of God. But this thought-provoking ideology is interesting. Coming to the second image it depicts the different stages of life, And the way to reach divine. The third image explains how a book(The Holy Bhagwat Gita) teaches different types of people in different ways the way of life. Now have a look at the fourth image what does it depict?, that when God(Lord Rama) was questioned, That did he kill Ravana? so the answer given by him pretty much explains it wasn’t the god himself who killed him it was their own ego that led to his demise. Now did you observed something common in the last three pictures, Think about it……………………………. Its Nothing but karma is which is common in all three images. The sin we do are our form of karma it has nothing to do with god, To reach divine you need to do karma. To preach something i.e is to learn something you need to do karma. And Even the reason for one’s demise is also karma. so what’s the point is simple god doesn’t write fates, It’s us who write their own fates, It’s us who are responsible for our condition, and it’s us who chose the way of life or condition we live. So if a criminal is a criminal it’s due to the karma he has done or the karma of other people affects him so basically god doesn’t intervene in it the only role god plays is to add some factor here and there for someone who is trying to do his karma. so the endpoint is or I like to say the conclusion is god basically can’t stop all the crimes and punish culprits because basically karma will have its the course and it will be the karma who will prevail justice not anybody else nor the police, the advocate, the judge it will be the karma who will have the last laugh. That is why it is said Karma is a bitch. Sorry for the long answer and if you like the answer please follow for such more interesting questions……………………being answered. Kudos…… ",
            "date": "Answered July 31, 2020",
            "views": "272",
            "upvotes": "0"
        }
    ]
}