{
    "title": "Do you know that verse 115 in chapter 23 of the Holy Qur'an is an open challenge to all mankind? Can Science deny such a claim? - Quora",
    "tags": [
        "Science and Religion",
        "The Quran",
        "Islam",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nikita Rogozin",
                "href": "/profile/Nikita-Rogozin-2"
            },
            "answer_text": "The going principle in science is: “That which is asserted without evidence can be rejected without evidence”. Basically, the obligation to prove any assertion immediately falls onto one that makes it. Firstly, I’d like someone to prove to me unambiguously that this specific verse was the literal words of God, but not an invention of some medieval theologian. Of course, that would require one to prove with a properly set up controlled scientific experiment not only that God exists, but this specific God of Qur’an exists. Then one would need to prove via a properly set up controlled scientific experiment that this exact God (and not some other entity) communicated with the Prophet, and that God gave the Prophet these words precisely. Having established the above we can go into analysing the words of that verse on their scientific merit. You don’t get to do this the other way around starting from the verse and then invite science to refute/deny it without having established the proper scientific credibility of the source for the assertion in the first place. Some homework needs to get done before we get to that place of discussing it in a scientific context. If we were to look at the verse in question it makes/implies several important scientific assertions: A. There exists a God; B. That God created the Universe; C. That God created humans; D. There exists a Heaven; E. That God created humans with a purpose in mind; F. A mechanism by which humans may return to God exists; G. That God communicated that purpose to humans. etc. Now, you see there is a hierarchy here. Without having unambiguously proven the assertion A. via a properly set up controlled scientific experiment we can’t even begin to meaningfully discuss the assertion B. It is just pointless/lacks scientific merit without this. That’s because the assertion B is contingent on the assertion A. being (proven) true. Same applies to any downstream assertion above - they lack merit without having proven the upstream ones: you can’t discuss/entertain the assertion E. without having unambiguously proven the assertion C. Simply put, if one can’t properly prove the assertion A. to be true, any downstream assertion from it can be just outright rejected without the need for any further justification/action. That’s the line of thought that science takes in relation to any topic. I mean no disrespect, but Qur’an is a compilation of Middle-Eastern folk lore and oral tradition that was codified several centuries after the death of the Prophet. Meaning, we can’t know for certain what the precise words of the Prophet were and what He meant by them. Or even whether He uttered these words at all to begin with or had they been a later invention by His followers. We can’t go back and ask for clarification and we can’t verify them independently from the Quran. The veracity of the accounts in the Qur’an can’t be established in principle (as with most other Holy Books). So there is nothing for science to study and scrutinise there, maybe apart from the historical/cultural significance of this work. But certainly not from the POV of cosmology or biogenesis the areas that this verse goes into. And we do know the people who were behind the effort of collecting and systematising the folk lore/oral tradition that made Qur’an and their process for doing it. Going around villages recording their folk lore does not meet the definition of scientific discovery in the slightest and can’t amount to evidence of anything. Apart from the fact that this certain folk lore did exist in the region and people went about collecting codifying it. Qur’an seems to contain significant personal input from those who were behind the project of writing it down. Why they used certain words, how they structured the text, what stories they chose to include or not include. That may be an interesting area of study. But trying to reconcile that text with the modern scientific developments, IMHO, is an exercise in futility. Largely because Qur’an was never intended to be a work of science, but rather a work on philosophy. ",
            "date": "Answered April 22, 2019",
            "views": "214",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Indrajyoti Dutt",
                    "user_href": "/profile/Indrajyoti-Dutt"
                },
                {
                    "user_id": "Lac Nospmoht",
                    "user_href": "/profile/Lac-Nospmoht"
                },
                {
                    "user_id": "Jim Brown",
                    "user_href": "/profile/Jim-Brown-437"
                },
                {
                    "user_id": "Ben Delwijnen",
                    "user_href": "/profile/Ben-Delwijnen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shahid Zaidi",
                "href": "/profile/Shahid-Zaidi-3"
            },
            "answer_text": "Do you know that verse 115 in chapter 23 of the Holy Qur’an is an open challenge to all mankind? Can Science deny this claim? Qur’an 23:115. Hush! Do you think We created you in hollow and that you shall not return to us? I believe in Qur’an so I can not deny, the deniers if any should bring proof or have ability to convince me and others, I shall accept if solid reasons given. Without prejudices I am trying to bring awareness of ‘Islam’ - religion required to be followed and comparing to distorted versions (many but now trying to hide under one platform) as started in or around mid nineteenth century at least three version having than patronage of the sole Super Power than the Royal British Empire and now patronage of Trump administration. Patiently wait for Savior to come, firstly His representative - claimant of this verse 115 in chapter 23 of Holy Qur’an, certainly should be living in this World and with Jesus (Isa) as Quran says raised up alive to the heaven for him to be send again to this World at appropriate time, so the time fast approaching.In haste killing the best creation of the Creator, who happen to be no other than human beings and for sure human beings are different than other living beings, wrong understanding of Science, developed.To be noted in both cases, I have covered as a general rule - all mankind. I like most people are sadden, by recent killing of innocent lives in and near Colombo and before also done all over the World, particularly in Quetta of Hazara Muslims, who are the most truthful Muslims and their only crime is remaining steadfast to follow the 1. version, as a matter of fact they belong to Mongol race who by thousands converted to Ithena’Ashari Shia Faith - true follower of religion of Islam, since their features are different to other races living in Pakistan so are easily distinguished and killed by 2. distorted version followers. ",
            "date": "Answered April 22, 2019",
            "views": "147",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Samuel Weber",
                "href": "/profile/Samuel-Weber-3"
            },
            "answer_text": "Q: Do you know that verse 115 in chapter 23 of the Holy Qur'an is an open challenge to all mankind? Can Science deny such a claim? A: first I could easily argue anyone following the Quran Hadith Bible or The Vedas is either mentally unstable or superbly ignorant. But to the verse in question: (23:115) Did you imagine that We created you without any purpose, 102 and that you will not be brought back to Us?\" 102. The Arabic word abathan in the text also means “for the sake of sport”. Then the verse will mean: Did you think that We had created you merely for the sake of sport and there was no purpose behind your creation? Therefore you may eat, drink, be merry and enjoy yourself as you please. Surah Al-Mu'minun 23:93-115 - Towards Understanding the Quran - Quran Translation Commentary - Tafheem ul Quran What challenge? What science? All I see is a claim that an unspecified entity created humans and they had a purpose for doing so. Given the context assuming that it's meant to say Allah created humans. When? how? Given that we already know we have a common ancestor with chimpanzees and share 98% of our DNA with chimpanzees we already know that we evolved from that common ancestor. Humans are part of the ape family and the evolution taking place from the common ancestor around 7 million years ago. Two chromosomes fused allowing humans to have a larger brain and hip shaped differently to allow for easier walking upright. As an atheist I see no reason to believe in anything Supernatural and it found natural causes for humans to exist without any deity. Religion teaches people to accept nonsense as valid answers to the biggest questions ever asked. Believing in imaginary characters with supernatural magic teaches scientific illiteracy dampening curiosity and killing critical thinking causing issues on a global scale. ",
            "date": "Answered April 22, 2019",
            "views": "193",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Indrajyoti Dutt",
                    "user_href": "/profile/Indrajyoti-Dutt"
                },
                {
                    "user_id": "David A Kelly",
                    "user_href": "/profile/David-A-Kelly"
                },
                {
                    "user_id": "Jim Brown",
                    "user_href": "/profile/Jim-Brown-437"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fred Pittenger",
                "href": "/profile/Fred-Pittenger"
            },
            "answer_text": "OK here are seven translations of __ Welcome to the Quranic Arabic Corpus, an annotated linguistic resource for the Holy Quran. This page shows seven parallel translations in English for the 115th verse of chapter 23 (sūrat l-mu'minūn). Click on the Arabic text to below to see word by word details of the verse's morphology. Chapter (23) sūrat l-mu'minūn (The Believers)  Sahih International: Then did you think that We created you uselessly and that to Us you would not be returned?\" Pickthall: Deemed ye then that We had created you for naught, and that ye would not be returned unto Us? Yusuf Ali: \"Did ye then think that We had created you in jest, and that ye would not be brought back to Us (for account)?\" Shakir: What! did you then think that We had created you in vain and that you shall not be returned to Us? Muhammad Sarwar: Did you think that We had created you for a playful purpose and that you were not to return to Us?\" Mohsin Khan: \"Did you think that We had created you in play (without any purpose), and that you would not be brought back to Us?\" Arberry: What, did you think that We created you only for sport, and that you would not be returned to Us?'  Now here is the REAL UNIVERSAL QUESTION, not the subjective Islamic doctrine: What is the “we” that is discussed? I would suggest that, much to the chagrin of a great number of Muslims, that the process that caused the emergence of the human experience sought experience, expression, and evolution, rather than any other purpose. The subjective need for judgement is a human attribute given to God or Allah. Universal Human Truth Universal Human Truth will be defined here as truth that is applicable to all humans who have ever lived on Earth, no matter when they lived, where they lived, what they believed, or what they did. It is inclusive of all hominids who have inhabited Earth over the passage of time or will inhabit this marvelous planet and regions of space beyond it in the future. This baseline is critical to a process driven narrative of humanity and building a constructive view of why we are here. Presence Tradition The irony, brutal as it is, lays in the phrase “ returned to Us”. Wherein those humans who appoint themselves to be the official officers of Allah, can and most assuredly will cast wrath down upon you if at all possible, in Allah’s name. This is not a veiled threat, but a promise of man made retribution. ",
            "date": "Updated April 24, 2019",
            "views": "201",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Indrajyoti Dutt",
                    "user_href": "/profile/Indrajyoti-Dutt"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mar Moo",
                "href": "/profile/Mar-Moo"
            },
            "answer_text": "Q: Do you know that verse 115 in chapter 23 of the Holy Qur'an is an open challenge to all mankind? Can Science deny such a claim? You have it backwards. Nobody has to deny anything. You have to positively demonstrate something. Your citation of that verse demonstrates your ability to connect current scientific facts to random sentences with no scientific intent or content from an ancient book. Such demonstrations of connecting the utterly unrelated are common, very very common. The usual example is Nostradamus and his Les Prophéties. If you’re interested to learn about your quite human error (which I doubt), you should ask and I’ll give you reading materials and a list of topics to look up (which would pleasantly surprise me). And, again, nobody needs to dispute what you’ve not demonstrated. And that verse is not a challenge, merely a Rhetorical device. Or do you believe you can get me the phone number of God who will personally answer my challenge? Or do you expect me to answer it to you and separately to every single Muslim out there? How stupid do you think I am? ",
            "date": "Answered April 22, 2019",
            "views": "92",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Indrajyoti Dutt",
                    "user_href": "/profile/Indrajyoti-Dutt"
                },
                {
                    "user_id": "David A Kelly",
                    "user_href": "/profile/David-A-Kelly"
                },
                {
                    "user_id": "Jim Brown",
                    "user_href": "/profile/Jim-Brown-437"
                },
                {
                    "user_id": "Nikita Rogozin",
                    "user_href": "/profile/Nikita-Rogozin-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Moore",
                "href": "/profile/David-Moore-408"
            },
            "answer_text": "Shahid Zaidi, my friend, although I try not to be totally ignorant of the Islamic scriptures there is much that I am unfamiliar with. When I read these verses, however, I think I see what you mean.  I write a lot about the problem of time. All of what we call ‘science’ is conducted in time, and the mathematical logic used in parts of scientific reasoning is paradoxically independent of time. In this way, all seconds are the same (in that they are identical units) and the only way of telling one second from another is by periodic motion which (by definition) is repetitive. Therefore, there is indeed a problem with our measurement of time, since humans live in the present and every sense in which we can determine our history depends on recollection of symbols (writing and pictures, for example) which are repetitively re-interpreted in a way that revises their relevance in every instant. Thus, well may God say ‘if only you knew!’. The one thing we cannot have is a coherent sense of time. We must separate past, present and future in a way that makes each of them independent of the others. Of course, doing so is erroneous - yet it is what happens every time we nominate ‘Now’. For this reason, one of my heroes (St Augustine) says similarly: What then is time? If no one asks me, I know what it is. If I wish to explain it to him who asks, I do not know. Truthfully, Science is silent regarding the essential nature of time, since every subject of scientia depends upon it a priori. ",
            "date": "Updated May 3, 2019",
            "views": "916",
            "upvotes": " View 19 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Adriaan de Lange",
                    "user_href": "/profile/Adriaan-de-Lange-3"
                },
                {
                    "user_id": "Randy Nino",
                    "user_href": "/profile/Randy-Nino"
                },
                {
                    "user_id": "Fraser MacWilliams",
                    "user_href": "/profile/Fraser-MacWilliams"
                },
                {
                    "user_id": "Andi Alexander",
                    "user_href": "/profile/Andi-Alexander"
                },
                {
                    "user_id": "Mohaimin Riaz",
                    "user_href": "/profile/Mohaimin-Riaz"
                },
                {
                    "user_id": "Bjorn Heijligers",
                    "user_href": "/profile/Bjorn-Heijligers"
                },
                {
                    "user_id": "Andrew Reed",
                    "user_href": "/profile/Andrew-Reed-3"
                },
                {
                    "user_id": "Riju Bhatt",
                    "user_href": "/profile/Riju-Bhatt-1"
                },
                {
                    "user_id": "Bill Sliedrecht",
                    "user_href": "/profile/Bill-Sliedrecht"
                },
                {
                    "user_id": "Lensei Nishizawa",
                    "user_href": "/profile/Lensei-Nishizawa"
                },
                {
                    "user_id": "Babruh Ardana",
                    "user_href": "/profile/Babruh-Ardana"
                },
                {
                    "user_id": "Donald Fehr",
                    "user_href": "/profile/Donald-Fehr-2"
                },
                {
                    "user_id": "Avinash Suresh",
                    "user_href": "/profile/Avinash-Suresh-3"
                },
                {
                    "user_id": "Jaap-Jan de Wit",
                    "user_href": "/profile/Jaap-Jan-de-Wit"
                },
                {
                    "user_id": "James Smith",
                    "user_href": "/profile/James-Smith-3709"
                },
                {
                    "user_id": "Gary Mcnicol",
                    "user_href": "/profile/Gary-Mcnicol"
                },
                {
                    "user_id": "William Ho",
                    "user_href": "/profile/William-Ho-62"
                },
                {
                    "user_id": "Domagoj Cekic",
                    "user_href": "/profile/Domagoj-Cekic"
                },
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anayat Bukhari",
                "href": "/profile/Anayat-Bukhari"
            },
            "answer_text": "No doubt, it’s a challenge but in which sense? This verse of Quran informs mankind that its creation is not just for the sake of creation rather there is great purpose behind it. It’s the duty of mankind to learn about this purpose. You will feel comfortable when returned to your Creator. Here is this verse: أَفَحَسِبْتُمْ أَنَّمَا خَلَقْنَاكُمْ عَبَثًا وَأَنَّكُمْ إِلَيْنَا لَا تُرْجَعُونَ - 23:115 Then did you think that We created you uselessly and that to Us you would not be returned?\" Muminun 23:115 Belief? Belief is something that is directly linked to your heart. You can’t force someone to believe a certain idea. That’s why Quran says: لَا إِكْرَاهَ فِي الدِّينِ ۖ قَد تَّبَيَّنَ الرُّشْدُ مِنَ الْغَيِّ ۚ فَمَن يَكْفُرْ بِالطَّاغُوتِ وَيُؤْمِن بِاللَّهِ فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقَىٰ لَا انفِصَامَ لَهَا ۗ وَاللَّهُ سَمِيعٌ عَلِيمٌ - 2:256 There shall be no compulsion in [acceptance of] the religion. The right course has become clear from the wrong. So whoever disbelieves in Taghut and believes in Allah has grasped the most trustworthy handhold with no break in it. And Allah is Hearing and Knowing. Baqarah 2:256 There is no compulsion in faith. Right and wrong has been made clear so it’s your choice to adopt a way. However, taking the right path will lead you to the right destination. Science and Faith: Faith has nothing to do with Science. It doesn’t mean that Faith doesn’t believe in Science. In fact Science follows Faith, not vice versa. Just ponder upon a small parable. A child was told by his mother when he was playing close to fire place in winter that don’t touch fire , it will hurt you. It was hard for the child to understand. So he decided to test. When his mother went away, he tried to grab a burning coal in his hand and hurt himself. Analysis: Mother had awareness about the burning fact of fire due to her vast knowledge. So she didn’t need an experiment to verify it. Child had lack of awareness due to his short vision and attempted to experiment the law that “fire burns”. He got the answer but at the cost of injury on hand. Choice: Now, it’s our choice to believe in what our Creator tells us or go for an experiment. No one is going to stop such explorer. ",
            "date": "Answered April 23, 2019",
            "views": "67",
            "upvotes": " Answer requested by Shahid Zaidi",
            "upvoters": [
                {
                    "user_id": "Jim Brown",
                    "user_href": "/profile/Jim-Brown-437"
                },
                {
                    "user_id": "John Smithen",
                    "user_href": "/profile/John-Smithen-3"
                },
                {
                    "user_id": "Harry Foundalis",
                    "user_href": "/profile/Harry-Foundalis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lac Nospmoht",
                "href": "/profile/Lac-Nospmoht"
            },
            "answer_text": "“Then did you think that We created you uselessly and that to Us you would not be returned?\" Is this the right verse? I’m confused as to how this is a challenge. But I’ll give it a shot anyway. It’s claiming that “we” created people. What evidence is there to support this? This is a claim that must be substantiated with evidence, and to my knowledge has not met its burden of proof. Science has nothing to do with it. If you make a claim then you have to supply evidence for that claim before people should take it seriously. Until that can be done, quoting from the book making the claim is just a big circle jerk. ",
            "date": "Answered April 22, 2019",
            "views": "95",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jim Brown",
                    "user_href": "/profile/Jim-Brown-437"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ali Hamdar",
                "href": "/profile/Ali-Hamdar-1"
            },
            "answer_text": "I don't know where the challenge is, and what science has to do with this. The verse says: [Then did you think that We created you uselessly] and that [to Us you would not be returned?\"] Part I: Even the very primitive human beings knew that all the creatures die. Yeah, we know that we're gonna die, Buddhists also know this, Pagans also know this fact. And? Part II: We weren't created uselessly, right? Islamicly speaking, we're just useful when we worship ‘’Allah‘’, that's the purpose of our existence in Islam: to Pray and fast and worship. Doesn't make too much sense, does it? ",
            "date": "Answered April 22, 2019",
            "views": "62",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jim Brown",
                    "user_href": "/profile/Jim-Brown-437"
                },
                {
                    "user_id": "Ben Delwijnen",
                    "user_href": "/profile/Ben-Delwijnen"
                },
                {
                    "user_id": "John Smithen",
                    "user_href": "/profile/John-Smithen-3"
                },
                {
                    "user_id": "Harry Foundalis",
                    "user_href": "/profile/Harry-Foundalis"
                },
                {
                    "user_id": "Bud Vieira",
                    "user_href": "/profile/Bud-Vieira-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "George Morris",
                "href": "/profile/George-Morris-109"
            },
            "answer_text": "“Then did you think that We created you uselessly and that to Us you would not be returned?\" This is the quote. What exactly is the challenge? And of course this claim can be denied, just as any other claim without evidence can be. ",
            "date": "Answered April 22, 2019",
            "views": "88",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Indrajyoti Dutt",
                    "user_href": "/profile/Indrajyoti-Dutt"
                },
                {
                    "user_id": "Hal Sherman",
                    "user_href": "/profile/Hal-Sherman"
                },
                {
                    "user_id": "Jim Brown",
                    "user_href": "/profile/Jim-Brown-437"
                },
                {
                    "user_id": "Leinad Renkluaf",
                    "user_href": "/profile/Leinad-Renkluaf"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charles Partrick",
                "href": "/profile/Charles-Partrick"
            },
            "answer_text": "It’s gibberish and science can easily deny it. Who is us and we? There is no us and we. If you say there is - provide the evidence. ",
            "date": "Answered April 22, 2019",
            "views": "34",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Imran Mehdi",
                    "user_href": "/profile/Imran-Mehdi-2"
                },
                {
                    "user_id": "Tom Stratton",
                    "user_href": "/profile/Tom-Stratton-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ian Carmichael",
                "href": "/profile/Ian-Carmichael-10"
            },
            "answer_text": "Science won’t care. Atheists might deny it, but will have probably have dismissed the faith without opening the book. ",
            "date": "Answered April 22, 2019",
            "views": "47",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jim Brown",
                    "user_href": "/profile/Jim-Brown-437"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Anderson",
                "href": "/profile/Michael-Anderson-950"
            },
            "answer_text": "Of course it can. These are just words with no evidence of any kind to back them up ",
            "date": "Answered April 22, 2019",
            "views": "16",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jim Brown",
                    "user_href": "/profile/Jim-Brown-437"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gregg Hammilton",
                "href": "/profile/Gregg-Hammilton"
            },
            "answer_text": "I’d treat it just like anything from the Bible. ",
            "date": "Answered April 22, 2019",
            "views": "18",
            "upvotes": " View 1 Upvoter"
        }
    ]
}