{
    "title": "Do you try to live a deontology life? - Quora",
    "tags": [
        "Deontology",
        "Ethics",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brian Overland",
                "href": "/profile/Brian-Overland-1"
            },
            "answer_text": "You mean, do I try to live by the ethical principles of some deontological (duty-based) approach such as Kant’s categorial imperative? I would say that is not my approach, no, although I have long thought that deontological and consequentialist systems ultimately dove-tail into some common positions. In either case, he point is that you don’t just think of yourself. In my case, I would say the closest principle for me might be “rule based, unselfish utilitarianism.” That idea translates into the following, but applies the idea it should be applied to general rules, not just to individual circumstances: The greatest happiness for the greatest number. That may be close to where I am. But ultimately, I think there is a principle even closer to where I am, and more foundational for both consequentialist and deontological ethics alike. Ready? Here it is: Other minds are real. Therefore I should want for others as much happiness as I want for myself. Is this out of a sense of moral duty? If so, maybe you could call it “deontological.” But I just think of as “morally aware” more than a “duty.” It’s ultimately the only fully logical position, I believe, although it dovetails with such emotions as empathy. Because selfishness is ultimately not logical. I am not the only human alive, any more than I am standing at the center of the universe. Therefore, if I wish for my own happiness more than for any others, am I not being unreasonable? Another person’s pain or pleasure is as real as my own. To acknowledge that is to be a morally aware human being. ",
            "date": "Answered February 22, 2020",
            "views": "66",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mike Payne",
                    "user_href": "/profile/Mike-Payne-91"
                }
            ]
        },
        {
            "author_info": {
                "name": "Seth Harrison",
                "href": "/profile/Seth-Harrison-11"
            },
            "answer_text": "I try to be GODs best friend I work my regular job my whole life like I worked for GOD I ALWAYS KNEW THAT IF I SLACKED GOD COULD AND WOULD KNOW WEATHER OR NOT I WAS SLACKING OFF OR GIVING IT MY BEST .I ALWAYS KNEW ON THE INSIDE ME GOD COULD TELL. PEOPLE WOULD ALWAYS RIDE ME OR MAKE FUN OF ME FOR WORKING SO HARD OR SO FAST .ID SAY I DONT WORK FOR THIS COMPANY I WORK LIKE THAT BECAUSE GID IS WATCHINV ME ALWAYS HAD TO BE THE BEST AT WHATEVER THE JOB OR CONTEST WAS I ALWAYS TORE MYSELF DOWN ON THE INSIDE AND ALWAYS LOOKED. EVERYWHERE I COULD FOR THOSE DOORS WE WERE ALL TOLD TO KNOCK SEEK AND OPEN THELL BE AND FIND YOU SHALL AND STUDY TO SHOW YOUR SELF APPROVED. THE BIBLE DID NOT TELL YOU WHAT TO STUDY SO I STUDIED SO I STUDIED EVERYTHING there IS AND WAS TO STUDY. I THOUGHT I HAD LOVE FROM A WOMAN LOOKED DOWN. BUT WHEN I WAS A LITTLE KID THEIR WAS NOTHING EVIL OR MEAN THAT WAS NOT DONE TO ME FROM ONE END IF THE ABUSE SPECTRUM TO THE OTHER. IT WAS WHAT MADE ME UN ABLE TO REALLY BE HAPPY. AND I JUST KEPT HEARING FROM EVERYONE AROUND I JUST GET OVER IT ITS IN THE PAST. NOT NOT FOR IT IS ALWAYS STARED ME RIGHT IN THE MIRROR SO CLOSE I CAN LAFF AND CRY ATVTHE SAME TIME AND FALL IN TO THE Abyssin a seconds notice. I finally figured out what went wrong it wAs the alchemy that causes all the problems they call mental health it the alchemy that puts the voices in your head or makes you think you being followed because in a sense you are being followed and their is at least half of another person in side. Plush the physical aspect of you fight or flight switch in your brAin being broken because the evil things they would do to me and I could fight or run away so your brain crowds all you emotions forward in the brain so that you really don't remember the act of the abuse but the damage us done now let's put 100eds of times behind that and the pain inside just would not let up. And so I had be that over achiever so no one could make fun of me how could they if I was always the best it smartest. Copeing mechanism. And so I had thought I had love nailed down been with my wife for 26 years and raise 2 kids and at the some how just seemed to be no love and I had always want things to help me cope that she would never give and some times I was mean but mostly I was planning to kill myself for about 15 or16 years as soon as the kids left I Sa swoer Daily that I would be done an I make the pain stop. So they mover out at19 an 23 and at that point every thought was not to just do it bet I was like my mind Turned on me and it would say their a train their a cliff here comes a truck go. It was relentless what it was I was getting close and that ducking vampire I invited in Jesus was trying to get me to die. So I would not figure out like GOD said it was the innocents that pulled GOD BACK BECAUSE EVERYONE ELSE HAS AN IDOLS FOR THEIR gods and I was studying me wife the way women talk and hear and I realized that they break the assumed true of the words they use like shell say in a conversation she don't like I'm cold she never gets cold but she was cold hearted like That that and I realized that the Bible was written the same way like lots wife look back and turned to a killer of salt like it was magic or something but it's not she looked back to the gang bangs the orgies the drugs and all the fun and when she turned out alone with just lot weather lot put his fingers in the hair or rub your toes she was just salty ich from head to toe like a pillar see and the entire book is written that way getting you to assume and lie to yourself after it seemling told you the half truth .abus Re makes you very kean on people and their behaivors. Lots of time I could tell you what you are think ing by the looks of your face or the way your standing. Idk just had to share with you and at the end I was NOTHING nobody and it Dx Complete desperation for love I knew their was Ds something in the way because I know that no body ever looked for GOD AS HARD AS I DID MOST KILL THEM SELVES OF JUST SETTLED FOR WHATBTHEY WERE SELLING I JUST ALWAYS KNEW GOD DID NOTBLIME TO BE IDOLIZED AND. THE CROSS AND THAT DEAD GUY KN A STICK JUST WOUKD NO LEAVE MY HEART ALONE that something was wrong and the wrong eq as the same something that was in the way it was the idols KEEPING GOS IDOL FROM ME.. AND YOU. AND ALL OF THEM. BUT NOW THAT I HAVE FIGURED IT OUT EVERY THING HAS CHANGED FOR ME OK STILL ALL ALON FOR NIW I HOPE SOME ONE ELSE GETS IT BUT EVERYONEBIA SO SURE OF A BOOK AND IDOL gods they know nothing about and plus I was shown and tought like Joseph was as a child and did remember till I was NOTHING nobody the it came back like a flood. And every min if abuse trama losses and pain wAs for reason and every moment in my life make complete sense to me. And GOD HAS Said sorry to me also. But still no love their is no love except me and GOD WE LOVE EACH OTHER BECAUSE WE BOTH KNOW WHAT IT LIKE TO BE LEFT ALL ANONE BY THE PEOPLE WHO YOU LOVED AND THOUGHT THEY LOVED YOU .AND WE HAVE BROUGHT EACH AN OTHER BACK FROM THE ABYSS. AND THEIR WORK TO BE DONE. AND TOGETHER WE ARE GOING TO MOVE WORLDS. THEIR IS NO HALF WAY WITH GOD YOU ARE EITHER IN OR YOUR OUT. AND EVERY DAY IS SUNDAY FOR ALL WE CARE.THE TIME IS NOW THE CHOICE IS YOURS. YOUR DECISIONS LAST FOREVER FOREVER AND EVER… ",
            "date": "Answered March 21, 2020",
            "views": "26",
            "upvotes": " Answer requested by Marcus Reeves",
            "upvoters": [
                {
                    "user_id": "Dave Lossman",
                    "user_href": "/profile/Dave-Lossman"
                },
                {
                    "user_id": "Yohanan Ben Jacob",
                    "user_href": "/profile/Yohanan-Ben-Jacob"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neil Sherman",
                "href": "/profile/Neil-Sherman-6"
            },
            "answer_text": "email sez: “Marcus Reeves requested your answer Do you try to live a deontology life?” now that I’m back up off the floor and stopped choking on snot inhaled during that spit-take, uhnnno, no I don’t, I live a Sloth’s Life, first I look at the luscious tidbit way out there at the end of the limb and then I start to move my hand toward it and then, well, ya know what? That’s an awful lot of calories to spend, let me look at it again and, wait, waitwaitwaitwaitwait, my heart’s beatin like a rabbit, lemme get a smoke and rest a minute, or 20, ok, where was that tidbit again? I’m too Primitive for any of that there O-logical stuff, preferring a strict adherence to Conservation of Energy, never do a damned thing “today” that’s gonna need cleaning up “tomorrow”. ",
            "date": "Answered March 20, 2020",
            "views": "22",
            "upvotes": " Answer requested by Marcus Reeves"
        },
        {
            "author_info": {
                "name": "Rafael Villalta",
                "href": "/profile/Rafael-Villalta"
            },
            "answer_text": "Hi, I'm going to make this quick. First, I had to look that word up. I'm sorry but I don't live that way. I live my life believing in being good to all as much as I can. But I know I'm human and will act at times like I'm a barbarian. Haven't gotten to that level yet. But I'm working on it. Even though I'ma Christian I'm learning of the Buddha and understanding at times Taoism which helps. I hope this helps you in your quest in living your life. Good Luck. Enjoy and God Speed. ",
            "date": "Answered March 22, 2020",
            "views": "33",
            "upvotes": " Answer requested by Marcus Reeves"
        },
        {
            "author_info": {
                "name": "Susan Hanson",
                "href": "/profile/Susan-Hanson-7"
            },
            "answer_text": "No, instead I try to live a healthy life. Duty and obligation and the resultant rules are constraints; they are often one sided and self limiting. I believe in balance. To do only out of duty is unkind, better to do because you chose to do. If you are giving it is important also to receive in some way, even it is just to see and receive a smile. To keep giving without receiving is out of balance. There are no clear cut rules for life yet I sense there is a simple way to be which is hard to find and practice. Deontology : study of the nature of duty and obligation. ",
            "date": "Answered March 22, 2020",
            "views": "18",
            "upvotes": " Answer requested by Marcus Reeves"
        },
        {
            "author_info": {
                "name": "Scott Wayne Bryan",
                "href": "/profile/Scott-Wayne-Bryan"
            },
            "answer_text": "No. Morality seems a lot like law in that you need a specific case, procedures and guidelines governing what can be considered and how to reach a conclusion about what implicit obligations exist in any given situation. For example, there are exceptions to virtually every moral tenet—theft, murder, lying, etc. Any attempt to preemptively deduce the perfect ethic seems sophistic at best to me—although it might be a thought provoking exercise. I try to consider most of the consequences of actions I’m considering, and I try to find efficient heuristics for engineering a fair economy. But no, I don’t seek to live by some reckoned archetype of righteousness. ",
            "date": "Answered February 24, 2020",
            "views": "18",
            "upvotes": " Answer requested by Marcus Reeves"
        },
        {
            "author_info": {
                "name": "Anna Emdenborg",
                "href": "/profile/Anna-Emdenborg"
            },
            "answer_text": "To some extent… because I sometimes think before I do certain things “would I like this to become a general law on how to act?”. I that light I normally do not proceed … :o) ",
            "date": "Answered February 25, 2020",
            "views": "18",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Sigmund Jarle Andersen",
                "href": "/profile/Sigmund-Jarle-Andersen"
            },
            "answer_text": "Sure, but I have my own doctrine. It boils down to a few rules. Here are three: What you do, do it well Only trust what is backed by evidence Treat people better than they treat you ",
            "date": "Answered March 6, 2020",
            "views": "11",
            "upvotes": " Answer requested by Marcus Reeves"
        },
        {
            "author_info": {
                "name": "Karl Broberg",
                "href": "/profile/Karl-Broberg"
            },
            "answer_text": "I realize that I have a duty to God and man and fulfill it in obedience to God and finding His will for my life. Sin and evil do exist and we must overcome them. The only kind of life worth living is the purpose-driven one. ",
            "date": "Answered February 23, 2020",
            "views": "7",
            "upvotes": " Answer requested by Marcus Reeves"
        },
        {
            "author_info": {
                "name": "John Tew",
                "href": "/profile/John-Tew-7"
            },
            "answer_text": "If I spank my son for blatant disrespect and he runs away from home I regret that he ran away but I also know that my correction was proper and would do it again. My answer is yes I do. ",
            "date": "Answered March 6, 2020",
            "views": "9",
            "upvotes": " Answer requested by Marcus Reeves"
        }
    ]
}