{
    "title": "Do you think that when we die, it is just a black void and time continues on until the end of time? When a new universe is created, do we just repeat the cycle of our lives over and over again (this is just speculation)? - Quora",
    "tags": [
        "Time (physics)",
        "The Universe",
        "Cosmology",
        "Death and Dying",
        "Psychology of Everyday Life",
        "Philosophy of Everyday Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Samuel Ranney",
                "href": "/profile/Samuel-Ranney"
            },
            "answer_text": "I don't think there is a “black void\", as you put it; I just think we die. That's it. No void, no underworld, no heaven, no hell, just nothingness. The same as it was before you were born. As we understand it, consciousness comes from the brain. When you die, your brain dies with you, and therefore one wouldn't think there would be consciousness after death. No consciousness would mean no afterlife. When one person dies, time doesn't stop. It just continues on just as it did before. You're so important that the Universe stops existing when you die. And, assuming that other Universes are born after the death of our own, what reason is there to assume the next Universe will be the same as this one? Who's to say that in other Universes you and I will even exist? Perhaps in the next Universe, life never develops on Earth, or maybe Earth doesn't even exist. Maybe the Cretaceous extinction won't happen and the world would continue to be dominated by non-avian dinosaurs. Perhaps in the next Universe the Cuban Missile Crisis results in a thermonuclear third world war and human civilization is obliterated. It is someone silly to assume everything is predestined, and therefore there is infinite possibilities as to what will happen if there are multiple Universes or we live in a Universe which goes through a cycle of Big Crunches and Big Bounces. ",
            "date": "Answered October 21, 2019",
            "views": "140",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Louis Cohen",
                    "user_href": "/profile/Louis-Cohen-1"
                },
                {
                    "user_id": "Dan B Cooley",
                    "user_href": "/profile/Dan-B-Cooley"
                },
                {
                    "user_id": "Rocky Curiel",
                    "user_href": "/profile/Rocky-Curiel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Evan Poole",
                "href": "/profile/Evan-Poole"
            },
            "answer_text": "We just simply die. No more, no less. We ALL died/die/will die into absolutely and complete nothingness forever regardless of ones beliefs and/or nonbelief in “X”, “Y”, “Z” etc. Meaning… No consciousness. No thoughts. No self-awareness or awareness of the environment (spatial awareness). No psychological awareness of the passage of time. No memories. No emotions. No personality. No knowledge. No skills. No intelligence. No suffering. No worries. No “souls”/”spirits”/”ghosts”, afterlife, pastlife. No gods/demigods, no, devils, no demons, no angels. No “salvation”/”eternal reward”. No “eternal punishment”. No “sin”. Etc. Etc. Once the brain dies and decomposes with the rest of the body, everything once held in the brain, including all of the things listed right above, and the beliefs pertaining to those last four listings that people (namely theists) hold in their brains, die with it. This applied, applies, and will apply to every past, present, and future organism.Theists included, despite their delusional and fanciful wishes to the contrary. In other words, being dead is just like not being conceived and born at all in the first place from the “perspective” (or rather lack thereof) of the dead person/people/organism etc. in question. That’s all I got. ",
            "date": "Answered October 21, 2019",
            "views": "335",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Walter Uber",
                    "user_href": "/profile/Walter-Uber"
                },
                {
                    "user_id": "Charles Krueger",
                    "user_href": "/profile/Charles-Krueger-5"
                },
                {
                    "user_id": "Subhranil Ghoshal",
                    "user_href": "/profile/Subhranil-Ghoshal-1"
                },
                {
                    "user_id": "Marya Evin",
                    "user_href": "/profile/Marya-Evin"
                },
                {
                    "user_id": "Tann Salvador",
                    "user_href": "/profile/Tann-Salvador"
                },
                {
                    "user_id": "Jim Brown",
                    "user_href": "/profile/Jim-Brown-437"
                },
                {
                    "user_id": "Carey Cain",
                    "user_href": "/profile/Carey-Cain"
                },
                {
                    "user_id": "David A. Smith",
                    "user_href": "/profile/David-A-Smith-13"
                },
                {
                    "user_id": "Michael Hooper",
                    "user_href": "/profile/Michael-Hooper-16"
                },
                {
                    "user_id": "Michael Baker",
                    "user_href": "/profile/Michael-Baker-457"
                },
                {
                    "user_id": "Giles Omoluabi",
                    "user_href": "/profile/Giles-Omoluabi"
                },
                {
                    "user_id": "Nona Genarian",
                    "user_href": "/profile/Nona-Genarian"
                },
                {
                    "user_id": "Daniel Bezar",
                    "user_href": "/profile/Daniel-Bezar"
                },
                {
                    "user_id": "A.J. Summerhayes",
                    "user_href": "/profile/A-J-Summerhayes"
                },
                {
                    "user_id": "Rocky Curiel",
                    "user_href": "/profile/Rocky-Curiel"
                },
                {
                    "user_id": "Kong Thao",
                    "user_href": "/profile/Kong-Thao-11"
                },
                {
                    "user_id": "Stephen Sywak",
                    "user_href": "/profile/Stephen-Sywak"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alistair Riddoch",
                "href": "/profile/Alistair-Riddoch-1"
            },
            "answer_text": "Q: Do you think that when we die, it is just a black void and time continues on until the end of time? When a new universe is created, do we just repeat the cycle of our lives over and over again (this is just speculation)? Option C. Dead is dead. The dead cease to exist. ",
            "date": "Answered October 21, 2019",
            "views": "70",
            "upvotes": "0"
        }
    ]
}