{
    "title": "Do you feel like me that life is pointless with God in your life? - Quora",
    "tags": [
        "God",
        "Philosophy of Everyday Life",
        "Life and Living",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rose Parise Raintree",
                "href": "/profile/Rose-Parise-Raintree-1"
            },
            "answer_text": "Oh most definitely not, my life was pointless without Him in my life. I became a Christian at 24 and for the next 15 years I saw my life change and become purposeful and so many doors opened that could never have been possible without Him. And you would think seeing HIS hand in my life as strongly as I did that never would I walk away from that. But we can fall badly when we forget that all good things come from God and it is in walking in obedience to HIM that our lives become fruitful and filled with purpose. But I failed and walked away in my self will and pride for 17 years, and my life took a nose dive in ways I never saw coming. Oh in his love and mercy and because of who HE is He continued to provide, but I had no peace and everything I attempted to achieve failed and I lost the love and respect of my family. Only because of the grace and mercy of God He led me out and back to seeing that without HIM I am nothing and my life cannot be what He wants for me. I finally surrendered and asked forgiveness for those 17 years and began walking again with my hearts desire to live out HIS purpose and do so by being obedient to HIS word and direction for my life. And for the past 20 years, again I have seen Him grow my faith and my walk in ways that each day I am so thankful to God that He did not leave me in that situation but because I belonged to HIM continued to discipline me until I returned to living my life according to HIS will and purpose. Today everyday has purpose, whether it is sitting in my home praying, or visiting a neighbor, or me and my little dog walking in the woods and hearing God in every rustling leaf and thanking Him for the beauty He provides. Or showing compassion to a friend in need through prayer and loving embrace. rejoicing in celebration with a friend, holding and listening to my granddaughter tell me about her day, or writing this answer to you and praying God can and will use it to strengthen your own faith. When we discover that God is our purpose we will also discover that there is no better way to live. Each day has promise, I don’t know what my future holds but I do know that as long as I listen for HIS guidance it will hold purpose that nothing I ever do could possibly achieve without him. My thoughts and prayers are that you too will discover a life living in obedience to God is a life full of promise and purpose. It will take the daily mundane things in this life and create blessings that will live long after we are no longer here. I am providing a link to the full article I hope will be of help in your discovering that a life lived for God is far from pointless and here are some tips that might help from this same article But how can we become better attuned to God's presence and calling in our lives? Following are several spiritual disciplines we can practice in order to better discern God's calling: Cultivate a regular and consistent prayer lifeBe open daily to seeking God's influence in our livesRead the Bible regularly and thoughtfullySeek and heed the wise counsel of othersDevelop a genuine desire to be in God's willExperience periods of fasting, not just from food, but from many thingsRepent of any possible hindrances in our life that may distance us from GodPractice biblically-based contemplation and silence, focusing on God and His truthsUnclutter our spiritual lives so God has room to moveAttuning to God's Presence and Calling My thoughts and prayers are with you ",
            "date": "Answered November 28, 2017",
            "views": "550",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ethreal Light",
                    "user_href": "/profile/Ethreal-Light"
                },
                {
                    "user_id": "Chavoux Luyt",
                    "user_href": "/profile/Chavoux-Luyt"
                },
                {
                    "user_id": "Janie Dunn",
                    "user_href": "/profile/Janie-Dunn"
                },
                {
                    "user_id": "Jerry Sorrell",
                    "user_href": "/profile/Jerry-Sorrell"
                },
                {
                    "user_id": "Christina Wilson",
                    "user_href": "/profile/Christina-Wilson-137"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Rosselli",
                "href": "/profile/James-Rosselli"
            },
            "answer_text": "Hi, Janie, Did you mean “without God in your life?” How could life possibly be pointless with God in it? If that’s what you meant, I’d need to know why you feel that way before I could even begin to answer it. If you meant to type, “without,” then, yes, I do most certainly agree with you. Those who elect to live without God have chosen to live in the delusion that there is nothing to life but the relatively short time we have here. They live with the assumption that whatever they accomplish, whatever they gain, ends with them, like the toppled ancient statue of Ozymandias, broken and covered with the sand of the desert, its inscription proclaiming, “See, O rulers of the earth, and tremble!” Self-serving fictions that cater to our vain desire to “do what we want without interference” cannot bring us meaning because they are not true. The truth is that God loves us, and invites us to join Him in the greatest of all adventures: growth in Him, here, and the continuance of our life and growth with and in Him throughout Eternity. ",
            "date": "Answered November 27, 2017",
            "views": "197",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chavoux Luyt",
                    "user_href": "/profile/Chavoux-Luyt"
                },
                {
                    "user_id": "Karen Carmichael",
                    "user_href": "/profile/Karen-Carmichael-7"
                },
                {
                    "user_id": "Janie Dunn",
                    "user_href": "/profile/Janie-Dunn"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lesley-Anne Weir",
                "href": "/profile/Lesley-Anne-Weir-1"
            },
            "answer_text": "On the contrary. I was an atheist for the first thirty five years of my life. Then I converted to Christianity. Now I feel a sense of wholeness, peace and integration I never felt as an atheist. That’s not to say that there are no poor simulacrums of Christianity out there. But when you find the real thing it’s genuinely life changing. And as for pointlessness- what could be more pointless than nihilism? ",
            "date": "Answered November 27, 2017",
            "views": "183",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chavoux Luyt",
                    "user_href": "/profile/Chavoux-Luyt"
                },
                {
                    "user_id": "Steve Sharp",
                    "user_href": "/profile/Steve-Sharp-29"
                },
                {
                    "user_id": "Karen Carmichael",
                    "user_href": "/profile/Karen-Carmichael-7"
                },
                {
                    "user_id": "Anne Benzow",
                    "user_href": "/profile/Anne-Benzow"
                },
                {
                    "user_id": "Norman Sheidlower",
                    "user_href": "/profile/Norman-Sheidlower"
                },
                {
                    "user_id": "Stephen Sibbald",
                    "user_href": "/profile/Stephen-Sibbald-1"
                },
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                },
                {
                    "user_id": "Janie Dunn",
                    "user_href": "/profile/Janie-Dunn"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kamren Lee",
                "href": "/profile/Kamren-Lee-1"
            },
            "answer_text": "With or without God, if a person finds his or her life “pointless” then it is pointless and God has NOTHING to do with it. When good things happen, it is God’s reward. When bad things happen, it is God’s punishment. Poor God. The Almighty can’t win! Set a goal and take baby steps to achieve it. The goal must, however, be realistic otherwise you will be disappointed and feel like a loser/failure and life becomes “pointless” again. ",
            "date": "Answered November 27, 2017",
            "views": "113",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Taylor",
                "href": "/profile/John-Taylor-640"
            },
            "answer_text": "With God in your life, life is never pointless. When I get a little depressed, I memorize bible verses. For example, right now, I am memorizing. \"So do not worry about tomorrow; for tomorrow will care for itself. Each day has enough trouble of its own. Matthew 6:34 ",
            "date": "Answered November 27, 2017",
            "views": "14",
            "upvotes": " Answer requested by Janie Dunn",
            "upvoters": [
                {
                    "user_id": "Norberto Bueno Junior",
                    "user_href": "/profile/Norberto-Bueno-Junior-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Dunn",
                "href": "/profile/John-Dunn-167"
            },
            "answer_text": "The only way life can be pointless, with or without a god, is if you refuse to find a point. As an atheist, I don’t rely on an outdated book to hand a purpose to me. I find my own. Mine is of compassion and improvement. Make of yours what you will. ",
            "date": "Answered November 27, 2017",
            "views": "57",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Roy Lee Wright",
                "href": "/profile/Roy-Lee-Wright"
            },
            "answer_text": "No, but then I am an atheist, so I cannot relate to having some being making my decisions for me. IMO: Life has any meaning you choose to give it. The trick is picking a meaning you cannot ever achieve but you can never quite fail at either. ",
            "date": "Answered November 27, 2017",
            "views": "99",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Emmanuel Oladipo",
                "href": "/profile/Emmanuel-Oladipo"
            },
            "answer_text": "Quite the opposite. So much so that I wonder whether there is a typo in your question. Life would be pointless without God in my life! ",
            "date": "Answered November 27, 2017",
            "views": "11",
            "upvotes": " Answer requested by Janie Dunn"
        }
    ]
}