{
    "title": "Do you realize that since the Universe is itself is an immensely powerful computer, that it must be conscious? - Quora",
    "tags": [
        "Consciousness",
        "The Universe",
        "Neuroscience",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mar Moo",
                "href": "/profile/Mar-Moo"
            },
            "answer_text": "Q: Do you realize that since the Universe is itself is an immensely powerful computer, that it must be conscious? I think I know where you’re coming from, but that’s still a bit of a nonsense on several levels. The universe may or may not be a computer (like the Earth is in Douglas Adam’s book), a device employed for computation. It’s basically a religious claim. Do you have evidence? Until you show some, I’m skeptical of your claim. Yes, all, well, let’s be pedantic and say most, systems with behaviors obeying rules (e.g. natural laws) can be thought of in terms of computation. Rocks falling down obey rules, and can be thought of as computational elements, and under specific circumstances they can actually do computation. But that doesn’t make them a computer. There’s a vague equivalence, and some people promote this to a metaphysical position of algorithmic idealism, but that’s more of an opinion. Not everything that does some computation is a computer. Rain falling down can be viewed as doing addition. But that doesn’t make it a computer. A calculator does computation, but it’s not a computer. The universe can be thought of as a giant heap of calculators. Still not a computer. Nor does computational capacity automatically create consciousness. The sum of all computers on the internet have a computational power far exceeding what’s needed for consciousness, yet it’s not conscious (as far as anyone can tell, you could claim it does, and it would also be merely a claim, less religious, because it’s more testable). On the other hand, considering that a human is considered conscious, even though only a small portion produces consciousness (e.g. you’re equally conscious if your limbs are amputated). With a bit of a stretch it could be said that a single human surviving in the universe would make the entire universe conscious. The stars and galaxies contributing as much as fingernails or hair to the consciousness. With that in mind, the universe may have a multiple personality disorder, and with all the asylums, it’s insane too, and very confused. The idea isn’t new, and if you had not stated it as a fact, it would merely be “not a new idea”. The way you phrased it, it’s religion. Don’t get me wrong, the universe COULD be a computer and whether it is or not, it COULD be conscious, but I doubt you have the data to justify claiming it IS one. Equally, the universe COULD be simulated, or it COULD be thought into existence by an “entity”, or it COULD be a “physical” system. Occam favours the last one. But, it’s not possible to distinguish between those possibilities. They behave identically. What’s worse, well, look at solipsism. ",
            "date": "Answered September 1, 2018",
            "views": "107",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Evan Poole",
                    "user_href": "/profile/Evan-Poole"
                },
                {
                    "user_id": "Sandy Perlmutter",
                    "user_href": "/profile/Sandy-Perlmutter"
                },
                {
                    "user_id": "Larry Crawford",
                    "user_href": "/profile/Larry-Crawford"
                }
            ]
        },
        {
            "author_info": {
                "name": "Larry Crawford",
                "href": "/profile/Larry-Crawford"
            },
            "answer_text": "Do you realize that since the Universe is itself is an immensely powerful computer, that it must be conscious? Hi Adrian. I can see some parallels between the universe and a computer but I am not getting anywhere near a direct equivalency. Thanks for asking but I’m not getting the realization. Must is one of those words that raises a red flag for me. The word must is often traded as a substitute for a reasonable explanation. All the power in the entire universe is a lot of power but not impressive enough to jump to this conclusion. From your profile; “I decided that the quantum computer that is the Universe, while based on consciousness, is actually based on billions of separate consciousness whose humanlike characteristics are distributed along the Normal Curve. Their thoughts, memories, and feelings fill the entire Universe around us the same way Radio and Television waves do. But at the quantum level, an electromagnetic spectrum of extremely high frequencies.We just need the equivalents of antennas and tuners to read them and this is the way the Hindus found their Gods; Greeks found theirs; Siddhartha became the Buddha: Aristotle trained Alexander; Plato wrote the Republic; Zoroaster found Ahura Mazda; Moses found Jehova; Jesus found the Trinity; Mohammad found Allah; Einstein discovered Relativity in 1915; Tesla discovered the modern global electrical system based on alternating current at 60 Hz; Maxwell discovered his equations; Beethoven found his ninth symphony.” I would be interested in hearing more about how humans starting to investigate the quantum scale makes the universe a computer. The humanlike part and the based on consciousness part too. I’m only finding consciousness in living beings. My biggest stumbling block are human thoughts memories and feelings transmitting at what voltage, amperage, and frequencies. I can appreciate your wanting to equate the Vedas, Bible, Koran, Greek mythology, and the Pali Canon in a sociological sense but the sciences of Einstein Tesla and Maxwell don’t really translate as sociology to me. I hope this answer is in any way useful to you. ",
            "date": "Answered September 1, 2018",
            "views": "91",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mitch Williams",
                    "user_href": "/profile/Mitch-Williams-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Niranjan Pandya",
                "href": "/profile/Niranjan-Pandya"
            },
            "answer_text": "Friends, It is ancient saying that what is ablove is below and PINDE SO BRAHMANDE(what is a man is,is universe). If you view a man-microsome-you also begin to view universe-macrosome-and vice a versa. A man is stuffed of different forms of three different forms of energy,namely,physical energy-physical body,psychic energy-psychic body and conscious energy-conscious body. Conscious body is manifested as one's own consciousness,that is,one is conscious to one own self,also called self consciousness only evolved in a man out of all living creatures. Universe as macrosome is nothing but gigantic replica of a man or a man is miniature construct of universe. Outer most of universe is physical body,formed out of all forms of physical energy,known or to be known,which are perceived by senses. Next is psychic body of universe,consists of different forms of psychic energy like thoughts,memories etc.and none of these forms is perceivable by senses and neither fulfill to be tagged as scientific. Inner most is conscious body of universe which is conscious energy and is being manifested as self consciousness,as exactly as,a man is conscious to his own existence. In context to space dimension,inner one,conscious body-consciousness-is omnipresent and it embraces both psychic body and physical body. If you look at order of creation,both in case of universe and embryo in mother womb,you will find excellent and intelligent intrinsic order which can be a good analogy with computer. Thanks Q guru ",
            "date": "Answered September 2, 2018",
            "views": "72",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Don Sagar",
                "href": "/profile/Don-Sagar-1"
            },
            "answer_text": "The mere fact that we exist and tout our intelligence as having arisen from its own non-existence should be the cause for a lot of consternation when assuming anything about that which we are not necessarily the author of. Whether the universe thinks in the same manner as we do, by using words or pictures to demarcate its own unfolding to itself, or whether all of its many possibilities are spread our across what we call time (much like a move, frame by frame of celluloid) who is to know? Definitely not us. We perceive thought to be sequential, but what if it is actually simultaneous in a potential that we are incapable of envisioning except as that which is unknowable. We need to accept our place in this schemata and quit trying to quantify our responsibility to ourselves by conjecture that is not relevant to us. ",
            "date": "Answered September 2, 2018",
            "views": "34",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "John LaFrance",
                    "user_href": "/profile/John-LaFrance-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevill Davies",
                "href": "/profile/Kevill-Davies"
            },
            "answer_text": "Q. Do you realize that since the Universe is itself is an immensely powerful computer, that it must be conscious? Consciousness according to: The DAVIES Hypothesis - YouTube is defined as the state of mind of a ‘brain’ working in the three dimensions of time. These are ‘real’ time, which equates to the present, giving us continuous updates on environment and circumstances. ‘unreal’ time, the past, allows access to the database of our knowledge via memory. and ‘imaginary’ time, the future, collating information from the others to arrive at thoughts or solutions. Human brains (and many creatures) function accordingly but what about computers? Human knowledge, say, passed down through the generations, derives from as far back as our single cell origin. I suggest you can’t build that into a computer. ",
            "date": "Answered September 3, 2018",
            "views": "70",
            "upvotes": " Answer requested by Adrian Pearce Spidle",
            "upvoters": [
                {
                    "user_id": "Alessandro Bottoni",
                    "user_href": "/profile/Alessandro-Bottoni"
                },
                {
                    "user_id": "Dane Clarke",
                    "user_href": "/profile/Dane-Clarke-1"
                },
                {
                    "user_id": "Malcolm Sargeant",
                    "user_href": "/profile/Malcolm-Sargeant"
                },
                {
                    "user_id": "Bruce R. Bain",
                    "user_href": "/profile/Bruce-R-Bain"
                },
                {
                    "user_id": "Michel Renbarre",
                    "user_href": "/profile/Michèle-Renbarre"
                },
                {
                    "user_id": "Sam Fogarty",
                    "user_href": "/profile/Sam-Fogarty-9"
                },
                {
                    "user_id": "Adrian Pearce Spidle",
                    "user_href": "/profile/Adrian-Pearce-Spidle"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marco Pereira",
                "href": "/profile/Marco-Pereira-1"
            },
            "answer_text": "This is a nonsensical statement that can only be derived from not understanding computers nor consciousness. Marco Pereira's answer to Do you realize that the Universe, itself, is a quantum computer? For example. A Banana contains molecules and they are quantum systems. A Banana matures. Does that mean that a Banana is doing Quantum Calculations? Is a Banana a Quantum Supercomputer? If so, ask it what will be next week’s lottery numbers..:) I can only surmise this comes from the same misleading question author, hell bent into imposing a flawed point of view…:) . ",
            "date": "Answered September 1, 2018",
            "views": "109",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adrian Pearce Spidle",
                    "user_href": "/profile/Adrian-Pearce-Spidle"
                }
            ]
        },
        {
            "author_info": {
                "name": "Simon Bridge",
                "href": "/profile/Simon-Bridge-1"
            },
            "answer_text": "The question contains a non-sequitur. It does not follow that an immensely powerful computer must be conscious. It may be that the universe, however powerful a computer it turns out to be, is not the kind of computer that can be sentient. What you need is positive evidence of that sentience before a belief in it is warranted. So no, I do not realise that because there is not sufficient evidence to support the realisation. ",
            "date": "Answered September 1, 2018",
            "views": "69",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Don Sagar",
                    "user_href": "/profile/Don-Sagar-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Regis Chapman",
                "href": "/profile/Regis-Chapman-1"
            },
            "answer_text": "Do you realize the Universe is not a computer? Such oversimplifications are typical of the Western ignorant mindset. Mind and matter arise together. We’ve know this for literally thousands of years. mithyA Dependent Origination: The Twelve Links Explained Dependent Origination Even consciousness is a separation. Even mind and matter are a separation. None of this is happening. It only appears to be happening. Western philosophy is nearly completely ignorant of this. You can read about that here: Studies in Comparative Philosophy by Swami Krishnananda ",
            "date": "Answered September 1, 2018",
            "views": "66",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Bruce Bell",
                    "user_href": "/profile/Bruce-Bell-19"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gonzalo Pelaez",
                "href": "/profile/Gonzalo-Pelaez"
            },
            "answer_text": "“The state of being awake and aware of one's surroundings”…not exactly a definition that fits the Universe. The assertion that the Universe is an immensely powerful computer is absolutely wrong…it is nothing like that, the Universe computes nothing, it is a cause and effect environment binded by the laws of physics, those we know and those we do not know. ",
            "date": "Answered September 1, 2018",
            "views": "51",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mandy Bates",
                    "user_href": "/profile/Mandy-Bates-2"
                },
                {
                    "user_id": "Don Sagar",
                    "user_href": "/profile/Don-Sagar-1"
                },
                {
                    "user_id": "Larry Crawford",
                    "user_href": "/profile/Larry-Crawford"
                },
                {
                    "user_id": "Adrian Pearce Spidle",
                    "user_href": "/profile/Adrian-Pearce-Spidle"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jan-Richard Idland Eriksen",
                "href": "/profile/Jan-Richard-Idland-Eriksen"
            },
            "answer_text": "The universe itself is not conscious. That's impossible. But the human is conscious and is part of the universe. So you can say the universe is conscious because of the human. We humans have the universe inside us. So were part of it. And we are the universe that consciously observes and and sense with itself. ",
            "date": "Answered September 1, 2018",
            "views": "47",
            "upvotes": " View 4 Upvoters"
        },
        {
            "author_info": {
                "name": "David Johnston",
                "href": "/profile/David-Johnston-21"
            },
            "answer_text": "No, I do not. The universe is not after all actually an immensely powerful computer so far as we we know, and even if it was, “immensely powerful computer” does not in any way equate to “conscious”. ",
            "date": "Answered September 1, 2018",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard Werkhoven",
                "href": "/profile/Richard-Werkhoven"
            },
            "answer_text": "Do you realise you’re making a wild guess in hope here? Do you realise that if that is the case your mobile phone must also be conscious? What is consciousness is still an open question though so maybe your phone is conscious. ",
            "date": "Answered September 4, 2018",
            "views": "4",
            "upvotes": " Answer requested by Adrian Pearce Spidle"
        },
        {
            "author_info": {
                "name": "Steve Zara",
                "href": "/profile/Steve-Zara"
            },
            "answer_text": "The universe shows no signs of being a computer - it’s too spread out in space and time, and computing power alone doesn’t lead to consciousness. ",
            "date": "Answered September 10, 2018",
            "views": "15",
            "upvotes": " Answer requested by Adrian Pearce Spidle"
        },
        {
            "author_info": {
                "name": "João Ferreira",
                "href": "/profile/João-Ferreira-39"
            },
            "answer_text": "The universe is no computer. Take a look at João Ferreira's post in Life Philosophy-Abstracts ",
            "date": "Answered September 1, 2018",
            "views": "4",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John LaFrance",
                "href": "/profile/John-LaFrance-2"
            },
            "answer_text": "Don, There is someone else with your name and a different picture. I’m not sure what page that’s on but you better check that out. It’s on the same page for your remark about Intellectual cowardice. Better alert Quora! ",
            "date": "Answered September 5, 2018",
            "views": "17",
            "upvotes": "0"
        }
    ]
}