{
    "title": "Do you think that the existence of the universe is a coincidence? - Quora",
    "tags": [
        "Coincidences",
        "Existence",
        "The Universe",
        "Cosmology",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Schneids",
                "href": "/profile/Mike-Schneids"
            },
            "answer_text": "The universe, no. Earth as we know it, yes. So many things had to happen just right for our earth to form the way it did and allow life to flourish. Some of these things could have gone different while still allowing earth to support life, but not life as we know it. Without the moon evolution may never had taken place. It slowed our rotation down to the 24 hour days we have instead of 5 hour days. It keeps our axis tilted which allows us to experience 4 moderate seasons instead of constant severe weather. It, along with other things, causes tides which allowed the oceans to “mix” and keeps animals moving instead of being isolated. It also protected the earth from incoming objects. Jupiter also plays a huge role in keeping objects from hitting earth, not so much by blocking them but by throwing them off course due to its gravity. That's why when we look for earth like planets, we check to see if the planet has it's own Jupiter. But if something didn't smash earth very early on, at a very particular velocity and angle, the moon wouldn't have come into existence. This is only a couple things, there are plenty more. ",
            "date": "Answered June 13, 2017",
            "views": "439",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Haroon Siddiqui",
                    "user_href": "/profile/Haroon-Siddiqui-8"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/SS-1091"
                }
            ]
        },
        {
            "author_info": {
                "name": "Simon Bridge",
                "href": "/profile/Simon-Bridge-1"
            },
            "answer_text": "No. In order to be a coincidence, it has to coincide with something else. That is what the word means. What else do you imagine the Universe coincides with? There is, by definition, nothing besides the Universe. The Universe is the set of all things that exist. It could be you mean to ask if I think the Universe just happens to be here for no reason other than “it’s here”? That is, the existence of the Universe is intrinsically meaningless … like coincidences? Again: no. My position is a bit more nuanced than that … I think that there is no evidence that the universe has any intrinsic meaning to it’s existence. Therefore I do not believe that it has one even though I cannot absolutely rule it out. ",
            "date": "Answered June 16, 2017",
            "views": "169",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jeffrey Werbock",
                "href": "/profile/Jeffrey-Werbock"
            },
            "answer_text": "I use the word inevitability but even that is misleading because it implies that it “happened” and I don’t think that is possible. The 1st law of TD: energy cannot be created and our universe is composed of energy so it can’t be a creation, it must be causeless. ",
            "date": "Answered May 22, 2018",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mike Collins",
                "href": "/profile/Mike-Collins-65"
            },
            "answer_text": "Do you think non -existence of everything is more likely? Since I am here typing this answer I feel the universe exists but how can it be a coincidence unless there is another identical universe. Your question is flawed. If you’re trying to use this as an argument for the existence of a god do you think that god is a coincidence? ",
            "date": "Answered June 13, 2017",
            "views": "122",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rainn FTW",
                    "user_href": "/profile/Rainn-FTW"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/SS-1091"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rob Heusdens",
                "href": "/profile/Rob-Heusdens"
            },
            "answer_text": "So, you wonder if existence of the universe is coincidental. Just by coincidence the universe appeared from nothing, while it could have not existed? Then, where did the “coincidence” come from, because there should have existed that “coincidence” that either DID or DID NOT form the universe. But how could such a “coincidence” exist, apart from and outside of the universe existing? That is clearly an impossibility, so the answer is NO. ",
            "date": "Answered June 14, 2017",
            "views": "162",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dick Weasle",
                "href": "/profile/Dick-Weasle"
            },
            "answer_text": "No. The fact that we exist in some form means that that form must exist in some context. The universe is that context. If there was no universe, then we would not exist. It’s not that complicated… ",
            "date": "Answered June 15, 2017",
            "views": "46",
            "upvotes": "0"
        }
    ]
}