{
    "title": "Do you have a place where you can go to get away from the world and all that it brings where you can think and find peace? What is that place like? How often do you go there? - Quora",
    "tags": [
        "Peace",
        "Visiting and Travel",
        "Experiences in Life",
        "Psychology of Everyday Life",
        "Philosophy of Everyday Life",
        "Life and Living",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Adrian Crowe",
                "href": "/profile/Adrian-Crowe-1"
            },
            "answer_text": "I was in my late fifties when my wife and I found this house in Crafers in the Adelaide Hills. A big, rambling old house with a checquered history (built as a pub 1855, burned down 1856 rebuilt as three cottages 1885, clubrooms added 1910, modified several times) on half an acre. For six years we have worked on both house and garden. There are several spots where one can be alone in the quiet. And of course I go to one or other of these spots several times per day. Sometime we go together, sometimes separately. ",
            "date": "Answered July 19, 2019",
            "views": "45",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Laura Mohsene",
                    "user_href": "/profile/Laura-Mohsene"
                },
                {
                    "user_id": "Steven Groom",
                    "user_href": "/profile/Steven-Groom-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Justin Chan",
                "href": "/profile/Justin-Chan-31"
            },
            "answer_text": "The feeling of constantly being on edge is in large part due to the constant stream of notifications from our smartphones. We are so conditioned to receiving notifications that it is not uncommon to feel a phantom buzz of a smartphone in our pocket if we haven’t received a notification in a while. I’ve found that if I really need to concentrate on something, I will put my phone into airplane mode, and that aids enormously in my ability to focus on the present, which leads to peace. A quiet work environment also helps a lot in helping me to find peace. However, this is not always possible, and in fact there are often benefits (in the form of peer pressure and exchange of ideas) to working in an open office environment with others. ",
            "date": "Answered July 19, 2019",
            "views": "87",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Laura Mohsene",
                    "user_href": "/profile/Laura-Mohsene"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lia Malik",
                "href": "/profile/Lia-Malik-1"
            },
            "answer_text": "The place is actually inside my house, i live in a huge house and we have a fifth living room that is a bit old school so we mostly have our \"gathering\" in the other four, when you go in the roof is the highest in the house and i just remove the plastic covers from the couch and lay down and watch the chandelier for hours, and it’s so quiet because it’s far from everything else but i just love it so much for some reason, i think it’s because it was my favorite place to hide when I’m playing hide and seek with my friends as a kid or something. ",
            "date": "Answered July 16, 2019",
            "views": "39",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Laura Mohsene",
                    "user_href": "/profile/Laura-Mohsene"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jesse Montgomery",
                "href": "/profile/Jesse-Montgomery-24"
            },
            "answer_text": "I find peace through conflict. I embrace conflict as part of life. I seek out conflict. I challenge my body with the natural world and when I’m exhausted I find someplace to relax. I set and watch the wind blow through the leaves. I set on my balcony and watch the birds fly around. I stand by the ocean and watch the water move. I set by a river and watch the water move. Movement gives me peace. I enjoy watching it. I find peace very often. Well driving or setting on my balcony. I often find peace watching the world move. ",
            "date": "Answered July 16, 2019",
            "views": "24",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Laura Mohsene",
                    "user_href": "/profile/Laura-Mohsene"
                }
            ]
        },
        {
            "author_info": {
                "name": "Najib Warsame",
                "href": "/profile/Najib-Warsame-1"
            },
            "answer_text": "Mosque, is actually one of my favourite place. No one is bothering you, worship the God , have rest, read the Qur'an. Seeing your friends and family There. Is a peaceful place to be . Friday prayer is crowded but. ",
            "date": "Answered July 16, 2019",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Laura Mohsene",
                    "user_href": "/profile/Laura-Mohsene"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frank Pepper",
                "href": "/profile/Frank-Pepper-6"
            },
            "answer_text": "my studio, its in a spider filled dimly lit basement of the store. you would never expect to find such a place within such a place. its still got a lot of work to go on it but its coming along studio ",
            "date": "Answered July 20, 2019",
            "views": "21",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Laura Mohsene",
                    "user_href": "/profile/Laura-Mohsene"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Strowder",
                "href": "/profile/William-Strowder"
            },
            "answer_text": "An indoor speed skating track with exercise equipment surrounded by grassy Woodlands. I would go there at least three times a week. ",
            "date": "Answered July 17, 2019",
            "views": "15",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Laura Mohsene",
                    "user_href": "/profile/Laura-Mohsene"
                }
            ]
        }
    ]
}