{
    "title": "Does lateral thinking make people smarter? - Quora",
    "tags": [
        "Understanding Smart People",
        "Imagination",
        "Smart People",
        "Intelligence"
    ],
    "response": [
        {
            "author_info": {
                "name": "Glen Stafford Williamson",
                "href": "/profile/Glen-Stafford-Williamson"
            },
            "answer_text": "You asked:\"Does lateral thinking make people smarter?\" The short answer is: YES!A short analogy is a person walking across town.A linear thinker thinks in terms of the destination being 4 blocks West and 3 blocks South of his current position.  So he was 7 blocks, 4 West and 3 South to get there.TA lateral thinker would consider that the park that fills most of the blocks between himself and is destination 4 blocks West and 3 blocks South of his current position. Will think (laterally) that the shortest distance between the two places is diagonally across the park.  It therefore take him only 5 blocks of walking to get to the same place as his friend, the linear thinker.If the non-linear thinker chooses to give it any further though he would realize that the two sides his companion walked with were the base and the height of the triangle and that the diagonal that he walked was the hypotenuse, proving that the distances exactly match the classical example of the Pythagorean theorem of triangle. The sums of the two squares on the sides 3 and 4 (amounting to 9 and 16) added together equal the sum of the area of the square on the diagonal hypotenuse of 5 (5 x 5 = 25). The linear thinker only saw the problem in terms of two straight lines of known lengths.  The lateral thinker saw an alternative and deduced that it was both workable and more efficient (and probably smelled nicer too). Sincerely,Stafford \"Doc\" Williamson ",
            "date": "Answered May 22, 2015",
            "views": "11",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aaron Karingo",
                    "user_href": "/profile/Aaron-Karingo"
                },
                {
                    "user_id": "Dian Pink",
                    "user_href": "/profile/Dian-Pink-2"
                },
                {
                    "user_id": "Stasi Pagello",
                    "user_href": "/profile/Stasi-Pagello"
                },
                {
                    "user_id": "Yingjie Hu",
                    "user_href": "/profile/Yingjie-Hu"
                },
                {
                    "user_id": "Lynne Miller",
                    "user_href": "/profile/Lynne-Miller"
                },
                {
                    "user_id": "Mega Mayoy",
                    "user_href": "/profile/Mega-Mayoy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kamia Taylor",
                "href": "/profile/Kamia-Taylor"
            },
            "answer_text": "I don't know that it specifically makes people smarter, or they're already smarter and more creative, so they think laterally when others do not.  In any event, it does allow you to solve problems in ways that many cannot; develop trends before many others will see them; and generally have a more interesting thought life if you are comfortable with the fact that by doing so many other people will simply not \"get\" you. ",
            "date": "Answered May 20, 2015",
            "views": "308",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Britany Hartin",
                    "user_href": "/profile/Britany-Hartin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Larry Crawford",
                "href": "/profile/Larry-Crawford"
            },
            "answer_text": "Deliberately distancing from standard perceptions? Ok.Increasing the number of possible models considered? Good.Free association exercises? Fun.Everything is true exercises? Nice.Everything is false exercises? More nice. Should dialectics be used along side or be replaced by parallel thinking? I would hazard a guess at which were most persuasive, if persuasion were ones objective. The six hats approach looks like a useful methodology for brainstorming a topic. Thanks for asking a question that introduced a new term of interest for me. It may not have made me smarter but it did increase my vocabulary. ",
            "date": "Answered May 20, 2015",
            "views": "326",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sam L Swan",
                "href": "/profile/Sam-L-Swan"
            },
            "answer_text": "Yes. Lateral thinking is \"a way of solving problems by rejecting traditional methods and employing unorthodox and apparently illogical means.\" The term was developed in 1973 by Edward De Bono, with the publication of his book Lateral thinking: creativity step by step. Using lateral thinking approaches promotes creativity and thinking in new ways, breaking standard thinking patterns, which also results in making more intelligent decisions. ",
            "date": "Answered March 21, 2015",
            "views": "438",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ophelia Jones",
                    "user_href": "/profile/Ophelia-Jones-18"
                },
                {
                    "user_id": "Abdelrahman Ihab",
                    "user_href": "/profile/Abdelrahman-Ihab"
                },
                {
                    "user_id": "Michael Cavano",
                    "user_href": "/profile/Michael-Cavano-1"
                },
                {
                    "user_id": "Elizabeth Heston",
                    "user_href": "/profile/Elizabeth-Heston"
                },
                {
                    "user_id": "Mega Mayoy",
                    "user_href": "/profile/Mega-Mayoy"
                },
                {
                    "user_id": "Martin Lubran",
                    "user_href": "/profile/Martin-Lubran"
                }
            ]
        }
    ]
}