{
    "title": "Does existentialism imply moral relativism? - Quora",
    "tags": [
        "Moral Relativism",
        "Existentialism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pranoy Mukherjee",
                "href": "/profile/Pranoy-Mukherjee-4"
            },
            "answer_text": "Imo Yes Existentialism shatters a lot of deeply held beliefs and induces radical open mindedness. From there, you start seeing reality from a much deeper and holistic perspective. While values are internally driven, morals are externally driven. Morals change with every passing century and are constantly rehashed and adjusted to that particular era. The question is: what grounds morality? Collective human belief? (Which is temperory) What is the absolute authority to verify our temperory morals? Existentialism shows how truly subjective reality is. It shatters dogmas and pre existing illusory objective notions of 'how things should be'. It gives you the ability to accept circumstances and not impose your belief systems on reality. This obviously manifests as questioning things which are commonly accepted without self scrutiny. Morality happens to be a major one there. Questions of “right or wrong”, “should or should not” etc are dissolved. They don't matter anymore. Imagine the carpet you are standing upon, being pulled away. Similarly, the ground upon which morality stands (collective human belief of that particular era) cracks. This does not imply that extistentialists are immoral. But they are 'amoral' ie indifferent to morality. So what guides them? Values. Deep and strong values. As I mentioned earlier, morality is externally driven so once that is shattered / seen through, the internal compass gets even more robust and stronger (or values). ",
            "date": "Updated January 18, 2018",
            "views": "11",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Justin Huggins",
                    "user_href": "/profile/Justin-Huggins-4"
                },
                {
                    "user_id": "Arqam Ahmad",
                    "user_href": "/profile/Arqam-Ahmad"
                },
                {
                    "user_id": "Sumit Kain",
                    "user_href": "/profile/Sumit-Kain"
                },
                {
                    "user_id": "Krishna Chaitanya",
                    "user_href": "/profile/Krishna-Chaitanya-404"
                },
                {
                    "user_id": "Harrsh Mishra",
                    "user_href": "/profile/Harrsh-Mishra"
                },
                {
                    "user_id": "Ashutosh Kashyup",
                    "user_href": "/profile/Ashutosh-Kashyup"
                }
            ]
        },
        {
            "author_info": {
                "name": "T. Collins Logan",
                "href": "/profile/T-Collins-Logan"
            },
            "answer_text": "A2A. Not at all. Existentialist thinkers have tended to resist what we might call deference to the “oughts” of normative ethics — or any idea that there is a moral ordering to which humanity is obligated to submit or conform — but at the same time they also tend to elevate certain virtues regarding how a person lives: virtues like authenticity, engagement, follow-through, avoiding self-contradiction and so on. So we could describe the central tenet of existentialist “ethics” as actively choosing a consistent ethical framework with which to engage the world, and then sticking to it. Again, however, this is not done out of social obligation or reflexive conformance, but because an existentialist chooses to do this as a reliable expression of who they are. As a subtler distinction, if an existentialist is committed to being “free,” and resists being subjugated to the impositions of culture, they must nevertheless operate within cultural boundaries towards their chosen outcome, but again will do so by their own choice, and according to their own reasons. So in this sense, an existentialist, a humanist and a Jesuit could conceivably all appear (from the outside) to be operating according to the same moral convictions…but really have quite different interior pathways for arriving at a given decision. My 2 cents. ",
            "date": "Updated March 6, 2018",
            "views": "824",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Martin Witherspoon",
                    "user_href": "/profile/Martin-Witherspoon"
                },
                {
                    "user_id": "Chaoran Wei",
                    "user_href": "/profile/Chaoran-Wei"
                },
                {
                    "user_id": "Justin Huggins",
                    "user_href": "/profile/Justin-Huggins-4"
                },
                {
                    "user_id": "Will Connelly",
                    "user_href": "/profile/Will-Connelly-3"
                },
                {
                    "user_id": "Paul Devlin",
                    "user_href": "/profile/Paul-Devlin-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marco Tolasto",
                "href": "/profile/Marco-Tolasto"
            },
            "answer_text": "Thanks for the A2A. Yes and no. Unfortunately humans built their thinking and language on a very limited process of observation, highly biased and intrinsically reductionist. So their terminology and semantics evolve (quite rapidly in the las 200 years) and cannot be a basis for any relevant conclusion. Especially in philosophy. Relativism is strong with us. ",
            "date": "Answered January 17, 2018",
            "views": "267",
            "upvotes": " Answer requested by Flavio Aquino"
        }
    ]
}