{
    "title": "Does experience equals knowledge? - Quora",
    "tags": [
        "Philosophy of Psychology",
        "Knowledge",
        "Philosophy",
        "Psychology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Isaiah Pablo",
                "href": "/profile/Isaiah-Pablo"
            },
            "answer_text": "No, experience and knowledge are not on the same level. Knowledge always trumps experience. Why? For the following reasons: Experience is not tangible, knowledge is - When i hear people talk about how experience as if it were law, i cringe. How much experience would you require for someone to be qualified? 1–3 years? 5 years? People look for experience as a qualification but tend to give flimsy and inaccurate standards for what they consider “good experience.” You can’t test experience to see if it’s reliable. Knowledge on the other hand relies on facts and specifics. It’s all about methods, discipline, learning, testing, creativity, and all sorts of things. The beauty of science is how it’s true regardless of what people believe or experience. Experience is flawed - Memories and human senses aren’t perfect. We tend to misinterpret many things. We are also prone to biases. That’s why experiences aren’t valid forms of knowledge. Let’s say a white girl had bad experiences with black people then concludes that all blacks are evil. Should she then be justified in her racism because of her experience? If knowledge comes from experience then by that logic, you should agree with her conclusion. Obviously not the case in reality. Knowledge on the other hand seeks to learn using instruments, measurements, evidence, education, etc. It considers all sorts of possibilities but narrows it down to what’s known to be factually true. Experience is subjective, knowledge isn’t - Let’s say you went to one part of Mexico to experience it. That’s great but it’s foolish to conclude that one person’s experience speaks over everyone else’s in the country. Probably worse to think you’re a big shot scholar of the country when you know nothing about it’s history. Knowledge doesn’t play by those rules. Once again, it’s about evidence and getting down to the facts. Everyone can observe and learn about any subject through education. It doesn’t depend on one person experiencing it. In conclusion, you should seek knowledge above experience. Going by experience is a lazy way of thinking. I find people who say that are typically the ones who don’t want to expand their minds. They don’t want to put in the hard work that comes with educating yourself through books and deep thought. They don’t want to consider other viewpoints. They just want to live in the moment and use experience to compensate for lack of knowledge. That’s a dangerous way of thinking. That’s how we get superstitious beliefs and all sorts of ignorance. We as a species thrived on knowledge, not experience. ",
            "date": "Answered February 2, 2018",
            "views": "11",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gabrielle Bragg",
                    "user_href": "/profile/Gabrielle-Bragg"
                },
                {
                    "user_id": "Zayar Nyunt",
                    "user_href": "/profile/Zayar-Nyunt"
                },
                {
                    "user_id": "Igor Topalov",
                    "user_href": "/profile/Igor-Topalov"
                },
                {
                    "user_id": "Harshitha N",
                    "user_href": "/profile/Harshitha-N-41"
                }
            ]
        },
        {
            "author_info": {
                "name": "Satjot Sandhu",
                "href": "/profile/Satjot-Sandhu"
            },
            "answer_text": "Well I guess it will always be a debatable concept. Anyways it won't stop me from giving my opinion on this😁 If we go through the literal meaning of these words, Experience:the knowledge and skill that you have gained through doing something for a period of time; the process of gaining this. Knowledge:information, understanding and skills that you have gained through learning or experience. As we see both of these terms are quite mingled. But the fact remains that you can get knowledge through an experience but you can never be experienced only through knowledge. Putting your skill into practice is very important. Just because you know something, A certain skill or acquired a certain degree, it does not mean this is all you need to be a wise person. Practical approach and experience plays a crucial role. If you know something, you do have a way of doing it. But you would never know what is like without jumping into the technicalities of the matter ( experiencing it) But if you experienced something before, you know what it is like. Therefore you would find more ways of doing that and will end up being successful. At the end I would say, simply acquiring knowledge about something won't get you anywhere. And just an experience would make you walk a long way to achieve something you want. Therefore I would say “acquire the knowledge. Be informative and use that knowledge into your practical life. Experience. Do things differently. And succeed.  Thank you ",
            "date": "Answered June 30, 2020",
            "views": "148",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dhaval Golani",
                    "user_href": "/profile/Dhaval-Golani-1"
                },
                {
                    "user_id": "Sunny Saini",
                    "user_href": "/profile/Sunny-Saini-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amarjeet Kumar Roy",
                "href": "/profile/Amarjeet-Kumar-Roy-2"
            },
            "answer_text": "You can gain knowledge about cricket from a book. But to gain experience you have to play cricket. On an average an umpire have better knowledge of game than players but lesser experience of the game than player. So the answer is no. If experiment and theory are not equal than it is also the same case. ",
            "date": "Answered May 16, 2015",
            "views": "475",
            "upvotes": "0"
        }
    ]
}