{
    "title": "Does enlightenment feel like solipsism? - Quora",
    "tags": [
        "Solipsism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Barry McGuinness",
                "href": "/profile/Barry-McGuinness-1"
            },
            "answer_text": "No, it does not feel like solipsism at all. A moment of satori is the direct experience of the true nature of self, others and life, recognising the formless but vital presence within. It is not a sense that everything and everyone is a lifeless, meaningless illusion. It sounds far more likely that your friend is experiencing a state of derealization or depersonalization, a dissociative disorder of perception, often associated with coming off psychiatric and other psychoactive drugs. “People suffering from derealization have described feeling as if the world external to them were something in a TV show or movie, or as if they were viewing it through a TV screen. This, and other similar feelings attendant to derealization, can cause a sensation of alienation and distance between the person suffering from derealization and others around them. Partial symptoms would also include the feeling of being an \"observer\"/an \"observer effect\" on the planet, with everything happening or being experienced through their own eyes (similar to a first person camera in a game). There are tests (medical and online) to confirm this disorder.” — Wikipedia ",
            "date": "Updated October 1, 2016",
            "views": "629",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lance McDowell",
                    "user_href": "/profile/Lance-McDowell"
                },
                {
                    "user_id": "Scott Paglia",
                    "user_href": "/profile/Scott-Paglia"
                },
                {
                    "user_id": "Ismail Khilath Rasheed",
                    "user_href": "/profile/Ismail-Khilath-Rasheed-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex Zendo",
                "href": "/profile/Alex-Zendo"
            },
            "answer_text": "As User said, we can suddenly experience reality from unusual perspectives. Such experiences are impermanent, just like all the others. Maybe there’s nothing to worry about: it comes, it goes. If someone thinks of his friend as illusion, then mind that this “illusion” is a label that he attaches. In other words, thinking of illusions is another illusion. Real awakening is free from attaching labels. Illusion? OK, just another label, as illusory as anything else. Now look at what really is — try to look without naming, without labeling. If someone has real awakening — or have come close to it, and feels like “nowhere to step” — then let him just acquaint himself with that new perspective. Calmly, learn to live in the new world that happened around. That might be enough. No need to construct new illusions like “essence of Self” or something, because that would be running away from real awakening. In real awakening, there is no ground; so what? Labels dropped? — OK, learn how to live from somehow fresh start. Until that, don’t worry about all these illusions that swarm around, they are transitory. I would usually advise people in such situations to not worry, to not be discouraged; awakening is not far away, don’t worry about it and just practice. The (correct) practice itself should be pretty decent way to live. Edit: Please read comments — the point “thought is illusory” needs to be clarified. ",
            "date": "Answered September 30, 2016",
            "views": "945",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Charita Santana",
                    "user_href": "/profile/Charita-Santana"
                },
                {
                    "user_id": "Edgar Avila",
                    "user_href": "/profile/Edgar-Avila-5"
                },
                {
                    "user_id": "Pete Ashly",
                    "user_href": "/profile/Pete-Ashly"
                },
                {
                    "user_id": "Ismail Khilath Rasheed",
                    "user_href": "/profile/Ismail-Khilath-Rasheed-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bharat Karavadra",
                "href": "/profile/Bharat-Karavadra"
            },
            "answer_text": "Solipsism seems to be a view that the self is all there is. From my experience of the process of spiritual awakening, enlightenment is at the other end of the spectrum to solipsism. When I describe enlightenment when referring to spiritual enlightenment I also refer to the phrase spiritual awakening so that I can clarify my perspective of both phrases. Spiritual awakening is the journey, the process by which spiritual enlightenments happen. Spiritual enlightenments are aha-moments, intuition, knowledge, epiphanies and other such terms for knowings that come to you during the process of awakening, that otherwise perhaps would not come to you. One of the knowings (enlightenments) you will have during the process of awakening is that you are much greater than the individual human self, and this knowing differs greatly from what solipsism seems to be. ",
            "date": "Answered October 5, 2016",
            "views": "482",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lynne Ar",
                    "user_href": "/profile/Lynne-Ar"
                },
                {
                    "user_id": "Ismail Khilath Rasheed",
                    "user_href": "/profile/Ismail-Khilath-Rasheed-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sharan Gala",
                "href": "/profile/Sharan-Gala"
            },
            "answer_text": "As others have mentioned, your friend is disoriented, and more so because he labels it as “satori”. When one becomes awakened, it is to the peace of knowing that everything is taken care of. One stops being a human for they understand how they were never one to begin with. Your friend is remarking upon the illusion as a personality which has a girlfriend. Where it is ‘weird’ how everything is like a dream. As if going through a zoo and pointing at the various animals like a visitor - an outsider. Satori isn’t a visit to the zoo, it is the zoo zooing itself. When the false visitor is destroyed and the zoo catches itself red handed, there is at best a laugh and at worst an “oh well”. Let your friend know this if you want to help him. ",
            "date": "Updated October 22, 2016",
            "views": "439",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ismail Khilath Rasheed",
                    "user_href": "/profile/Ismail-Khilath-Rasheed-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marvin Glover",
                "href": "/profile/Marvin-Glover"
            },
            "answer_text": "Enlightenment is not solipsisitic because it is about becoming the Absolute and the Absolute, while having elements of personhood, is everything possible and so transcends personhood. Personhood arises From infinite possibilities working in concert. This is analogous to personhood growing out of near infinite brain connections working in concert. The personhood that emerges following enlightenment resonates with everything possible. The enlightened person does not see himself as the inventor of the possible. Rather the reverse is true. The enlightened person vibrates with, dances with possibility. ",
            "date": "Answered October 1, 2016",
            "views": "372",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ismail Khilath Rasheed",
                    "user_href": "/profile/Ismail-Khilath-Rasheed-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Guido Beelen",
                "href": "/profile/Guido-Beelen"
            },
            "answer_text": "There is a verse in the Xinxin Ming about this: When the deep meaning of things is not understood the mind's essential peace is disturbed to no avail. The way is perfect like vast space where nothing is lacking and nothing is in excess. Indeed, it is due to our choosing to accept or reject that we do not see the true nature of things. Live neither in the entanglements of outer things, nor in inner feelings of emptiness. Be serene without striving activity in the oneness of things and such erroneous views will disappear by themselves. When you try to stop activity to achieve passivity your very effort fills you with activity. As long as you remain in one extreme or the other you will never know Oneness. Those who do not live in the single Way fail in both activity and passivity, assertion and denial. It’s a pitfall all spiritual seekers encounter at some point: attachment to the unconditioned and formless, rejecting everything. Your friend has no choice but to continue and explore both sides of the truth at the same time. What is needed now is patience and caring, from his side but also from the side of his friends and loved ones. ",
            "date": "Answered September 30, 2016",
            "views": "384",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pete Ashly",
                    "user_href": "/profile/Pete-Ashly"
                },
                {
                    "user_id": "Ismail Khilath Rasheed",
                    "user_href": "/profile/Ismail-Khilath-Rasheed-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pete Ashly",
                "href": "/profile/Pete-Ashly"
            },
            "answer_text": "I'd suggest telling him to “chop wood, carry water”, e.g. Shut up around typical people, keep your day job, fake it until you make it and let time pass. The ego program can kick up a shit storm for a couple years. Wait it out. Go for lots of long walks. Eventually the reverberations will settle down, which will be a better time to make any significant life decisions. Enlightenment's Evil Twin ",
            "date": "Answered September 30, 2016",
            "views": "849",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nenad Despotovic",
                    "user_href": "/profile/Nenad-Despotovic"
                },
                {
                    "user_id": "Joseph Malo",
                    "user_href": "/profile/Joseph-Malo-2"
                },
                {
                    "user_id": "Stellah Ulriksen",
                    "user_href": "/profile/Stellah-Ulriksen"
                },
                {
                    "user_id": "Dan Kaplan",
                    "user_href": "/profile/Dan-Kaplan-23"
                },
                {
                    "user_id": "Andrei Popovici",
                    "user_href": "/profile/Andrei-Popovici-5"
                },
                {
                    "user_id": "Michael Dixon",
                    "user_href": "/profile/Michael-Dixon-29"
                },
                {
                    "user_id": "Jang Man",
                    "user_href": "/profile/Jang-Man"
                },
                {
                    "user_id": "Sam Sara",
                    "user_href": "/profile/Sam-Sara-3"
                },
                {
                    "user_id": "Devin Clary",
                    "user_href": "/profile/Devin-Clary"
                },
                {
                    "user_id": "Toni Alatalo",
                    "user_href": "/profile/Toni-Alatalo-1"
                },
                {
                    "user_id": "Sharan Gala",
                    "user_href": "/profile/Sharan-Gala"
                },
                {
                    "user_id": "Kris Iyer",
                    "user_href": "/profile/Kris-Iyer-1"
                },
                {
                    "user_id": "Ari Ondell",
                    "user_href": "/profile/Ari-Ondell"
                },
                {
                    "user_id": "Ismail Khilath Rasheed",
                    "user_href": "/profile/Ismail-Khilath-Rasheed-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Aarness",
                "href": "/profile/John-Aarness"
            },
            "answer_text": "This is one of the problems associated with becoming physically enlightened without FIRST laying a foundation of priori truths about existential spiritual facts. Just because EVERYTHING physically in existence is an illusion, the converse is not true with the conscience awareness of of the root essence of….ME! His girl friend is an illusion…. but who she is, is not an illusion. ",
            "date": "Answered September 29, 2016",
            "views": "292",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lance McDowell",
                    "user_href": "/profile/Lance-McDowell"
                },
                {
                    "user_id": "Ismail Khilath Rasheed",
                    "user_href": "/profile/Ismail-Khilath-Rasheed-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jos Buurman",
                "href": "/profile/Jos-Buurman"
            },
            "answer_text": "Solipsism: only self is known to exist.The description in the details: someone who’s out of reality. Enlightenment: certainly not the first and also not the second. The answer to “does enlightenment feel like solipsism” is thus: no ",
            "date": "Answered October 4, 2016",
            "views": "293",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ismail Khilath Rasheed",
                    "user_href": "/profile/Ismail-Khilath-Rasheed-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eirene A. Chara",
                "href": "/profile/Eirene-A-Chara"
            },
            "answer_text": "Not at all! Solipsism means \"I\" alone exist.\"I\" is an illusion. To awaken is to awaken to this truth. ",
            "date": "Answered October 25, 2017",
            "views": "38",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Prashanth Hirematada",
                "href": "/profile/Prashanth-Hirematada"
            },
            "answer_text": "Neti, neti and that too, that too. No difference between the two. You carve out Buddha from amstone, and so what was it before? ",
            "date": "Answered November 10, 2016",
            "views": "142",
            "upvotes": "0"
        }
    ]
}