{
    "title": "Does enlightenment brings omniscience and omnipotence? - Quora",
    "tags": [
        "Omniscience",
        "Omnipotence",
        "Enlightenment (spiritual)",
        "Logic (philosophy)",
        "Buddhism",
        "God",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nagarajan Ramachandran",
                "href": "/profile/Nagarajan-Ramachandran-3"
            },
            "answer_text": "NO! BRAHMAN is omniscient and omnipotent. The cosmos that we know is the projection of BRAHMAN. We human beings are a by product of this projection. A by product of this projection cannot possibly comprehend BRAHMAN any more than a painting can comprehend its painter, much less be omniscient or omnipotent. Human beings have the intellect developed enough at this stage in the evolution to recognize that they are very much a spark of BRAHMAN. It is possible for a human being to recognize his true nature as BRAHMAN itself, however, that will merely be an understanding and this understanding can never be translated into omnipotence or omniscience. ",
            "date": "Answered June 26, 2020",
            "views": "78",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sudheer Kumar",
                    "user_href": "/profile/Sudheer-Kumar-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vaishnava Charana Dasa",
                "href": "/profile/Vaishnava-Charana-Dasa"
            },
            "answer_text": "Hare Krishna! Enlightenment means accepting the omniscience and omnipotence of the Supreme Lord, and humbly surrendering to the Lord. That is what Arjuna did after hearing the Bhagavad Gita spoken by the omniscient, omnipresent and omni potent Lord. Arjuna expressed his realization in the following way in Chapter 11 of Gita. Bhagavad Gita Chapter 11, Verse 37 O great one, who stands above even Brahma, You are the original master. Why should they not offer their homage up to You, O limitless one? O refuge of the universe, You are the invincible source, the cause of all causes, transcendental to this material manifestation. Chapter 11, Verse 38 You are the original Personality, the Godhead. You are the only sanctuary of this manifested cosmic world. You know everything, and You are all that is knowable. You are above the material modes. O limitless form! This whole cosmic manifestation is pervaded by You! Chapter 11, Verse 39 You are air, fire, water, and You are the moon! You are the supreme controller and the grandfather. Thus I offer my respectful obeisances unto You a thousand times, and again and yet again! Chapter 11, Verse 40 Obeisances from the front, from behind and from all sides! O unbounded power, You are the master of limitless, might! You are all-pervading, and thus You are everything! Chapter 11, Verse 41-42 I have in the past addressed You as O Krsna, O Yadava, O my friend, without knowing Your glories. Please forgive whatever I may have done in madness or in love. I have dishonored You many times while relaxing or while lying on the same bed or eating together, sometimes alone and sometimes in front of many friends. Please excuse me for all my offenses. Chapter 11, Verse 43 You are the father of this complete cosmic manifestation, the worshipable chief, the spiritual master. No one is equal to You, nor can anyone be one with You. Within the three worlds, You are immeasurable. Chapter 11, Verse 44 You are the Supreme Lord, to be worshiped by every living being. Thus I fall down to offer You my respects and ask Your mercy. Please tolerate the wrongs that I may have done to You and bear with me as a father with his son, or a friend with his friend, or a lover with his beloved. ",
            "date": "Answered June 25, 2020",
            "views": "62",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nitya Siddha Dasa",
                    "user_href": "/profile/Nitya-Siddha-Dasa"
                },
                {
                    "user_id": "Dhru Goswami",
                    "user_href": "/profile/Dhru-Goswami"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gayatri Shiva Puri",
                "href": "/profile/Gayatri-Shiva-Puri"
            },
            "answer_text": "When you get the enlightenment through your sadhana your consciousness will become cosmic and that conciousiness is omnipotent annd you will experience the omniscience as a result. This is availed when you attain optimum prana (vital forces) and the desires cease to exist. Hari om ",
            "date": "Answered June 25, 2020",
            "views": "73",
            "upvotes": "0"
        }
    ]
}