{
    "title": "Does consciousness exist independent of human beings? - Quora",
    "tags": [
        "Philosophy of Mind",
        "Consciousness",
        "Philosophy",
        "Neuroscience",
        "The Human Race and Condition"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dave Crisp",
                "href": "/profile/Dave-Crisp-2"
            },
            "answer_text": "This is still a matter of intense scientific (and philosophical debate), but it clearly depends on what you mean by consciousness. Various ape species (of which we seem to be close relatives) seem fairly provably to share the ability to know they are alive, recognize a ‘self’ and that the self is mortal. But also clearly they see the world quite differently from us in many ways, probably including their vision of ‘self.’ So are they possessors of ‘consciousness’ or not? Depends on what you feel has to be included in the definition of that word. They clearly have some form of it, but not exactly ours. Of course this opens the door to ask whether machines will attain consciousness and what the definition will look like when they are much more like us than at present… in some respects… or in all respects. Again, likely a different, perhaps enhanced form of consciousness and we won’t be able to retain our belief that we’re at the top of the heap. But, even so, will that reduce our feelings of well-being. We will feel humiliated, short-changed, will we try to live up to the new, higher level? All interesting, but unresolvable questions… for now. ",
            "date": "Answered April 18, 2020",
            "views": "134",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alan Moss",
                "href": "/profile/Alan-Moss-12"
            },
            "answer_text": "Yes, it exists without a physical counterpart, there are thousands of cases where the person has returned from behind the curtain commonly known as the afterlife, Russell by Gwen Byrne, gave researchers an ex-directory number for his parents some 17 years after he so-called died. Arthur Findlay his Father spoke with him long after he passed, Arthur was astounded as he had told no one his name, and from that moment on he became a believer in the afterlife he spoke with many people after that, ( on the edge of the Etheric) Findlay. Marie and Pierre Curie interacted with Materialised forms. Sir William Crookes interacted with Materialised forms. Scientists and researchers have interacted with the afterlife some in physical form. Google Victor Zammit updated info. Marcello Bacci for voices. The Scole report scientists from various fields, ““We witnessed the impossible happen I have witnessed Materialised forms in group settings under strict conditions, I have many recordings. I have one of a Father apologising to his Son for ending his life, “ I couldn’t stand the pain any longer” not unless you do plenty of research you will not find any of this out, it took me 30 before I seen my first Materialised form. ",
            "date": "Answered April 19, 2020",
            "views": "99",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alice Roberts",
                    "user_href": "/profile/Alice-Roberts-101"
                }
            ]
        },
        {
            "author_info": {
                "name": "Giri S",
                "href": "/profile/Giri-S-53"
            },
            "answer_text": "A thing or quality comes into existence only after it is discovered by a discoverer. A discovery becomes collective perception when it is accepted by all or most in a class. For instance humans accept that mango is an edible fruit and that's our collective perception or discovery. The question of existence of a thing is not valid for a thing which is not discovered. Both the discoverer and the dicovered object together define the existence of that particular object in terms of a totality of characteristics it is discovered to have. Note the use of phrase 'totality of characteristics'. Humans discover mango to be an edible fruit but tigers do not. Thus consciousness will cease to exist in the totality of characteristics that humans cognise it to have once humans become extinct. I urge you again to underline the phrase 'totality of characteristics'. The question whether consciousness will still exist in a manner humans have not cognised it is an invalid question. ",
            "date": "Answered April 19, 2020",
            "views": "69",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nagarajan Ramachandran",
                "href": "/profile/Nagarajan-Ramachandran-3"
            },
            "answer_text": "Consciousness cannot be separated from perceptions namely seeing, hearing, smelling, tasting, feeling and thinking. Time, space and cosmos and the perceptions of time, space and cosmos arise simultaneously and sink together as well. So Consciousness and perceptions emerge simultaneously from a mysterious source which is the source of this cosmos itself. What is the nature of this source? Science calls this source pure energy. When this energy vibrates, the subject or the perceiver and the cosmos or the perceived appear together in what we understand as wakefulness and both the subject and the object disappear in the unmanifest POTENTIAL in deep sleep, swoon, coma and death. ",
            "date": "Answered April 19, 2020",
            "views": "86",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jeffrey Werbock",
                "href": "/profile/Jeffrey-Werbock"
            },
            "answer_text": "Consciousness is the body’s navigational system; it consists of the act of paying attention to signals for relevance to survival. All animals are conscious of their surroundings. Some animals appear to be conscious of themselves to some extent. Humans too but we have this added layer of thoughts about everything so our little bit of self awareness can be thought about in ways that perhaps no other animal does, and that may be why some think only humans are conscious of themselves. But you asked about consciousness, not self consciousness / self awareness. ",
            "date": "Answered April 18, 2020",
            "views": "131",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Benoit Papineau",
                    "user_href": "/profile/Benoit-Papineau"
                },
                {
                    "user_id": "Terrell Bey",
                    "user_href": "/profile/Terrell-Bey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Grace",
                "href": "/profile/Michael-Grace-53"
            },
            "answer_text": "Although some in the science community may debate this to the end of time, most if not all animals have a degree and form of consciousness. Thus yes, consciousness does exist independant of human beings. ",
            "date": "Answered April 19, 2020",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jay Wheat",
                "href": "/profile/Jay-Wheat-2"
            },
            "answer_text": "I believe you are asking,” can a humans consciousness exist outside the human”? To this I believe it cannot. I believe consciousness is similar to software. Can software exist outside the computer? Of course not. When you unplug a television the image ceases. Without wiring and other components, software, television images, or as I believe, consciousness will cease. ",
            "date": "Answered April 18, 2020",
            "views": "56",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jon Absoul",
                    "user_href": "/profile/Jon-Absoul"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Smit",
                "href": "/profile/Mark-Smit-19"
            },
            "answer_text": "Ok, so human beings invented the concept of consciousness, right? How can it exist without us asking about it? There is no consciousness outside of how we think about it. Are there things that we never think about that exist independent of human beings? If so, what are they? Ha! Cheers ",
            "date": "Answered April 24, 2020",
            "views": "49",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "João Ferreira",
                "href": "/profile/João-Ferreira-39"
            },
            "answer_text": "Does consciousness exist independent of human beings? Consciousness independent of human body is another thing, it is soul. To know more take a look at my post here ",
            "date": "Answered April 19, 2020",
            "views": "32",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gerhard Adam",
                "href": "/profile/Gerhard-Adam"
            },
            "answer_text": "No. The question makes no sense unless you wish to postulate another type of creature and the role that consciousness plays in existence ",
            "date": "Answered April 18, 2020",
            "views": "38",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pamela Mills",
                    "user_href": "/profile/Pamela-Mills-37"
                },
                {
                    "user_id": "Jack Bowie",
                    "user_href": "/profile/Jack-Bowie"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hugo Le Roux Guthrie",
                "href": "/profile/Hugo-Le-Roux-Guthrie"
            },
            "answer_text": "No ",
            "date": "Answered April 19, 2020",
            "views": "23",
            "upvotes": "0"
        }
    ]
}