{
    "title": "Does the term 'begin to exist' really make sense? If it does, can any one give me an example of things that are created out of nothing? - Quora",
    "tags": [
        "Existence"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jos Buurman",
                "href": "/profile/Jos-Buurman"
            },
            "answer_text": "Yes, it does make sense to use “beginning to exist”.But the followup part of the question, give me an example of things created out of nothing, this part is not related to the affirmation of the first part. I can produce curd from milk, and butter from curd. It makes sense to speak of an end of milk and a beginning of curd. But it does not make sense to ask how milk is created out of nothing. I’ll track this question related to “nothing” back quick to it’s core: How did life originate from lifeless matter?How did the universe come to be?These are the fundamental questions related to “nothing”. What if I told you that there was something before life, before the universe. Something that people call Qi.People in China used and use this word to describe many things. Certain herbs contain Qi. When people who are ill eat them they feel better. I don’t know how, but it works: Qi. I have no problem with Qi. It’s a philosophical stance, a claim that there is something prior to the known, but we don’t and perhaps can’t know it.It’s a counter to skepticism which keeps asking an eternal chain of why questions. Qi has one fundamental attribute: it’s not mystic, it’s a confirmation of what’s experienced and not explained.And that makes it completely different from a deity, the religious version of Qi. We might claim that Qi is before existence, that it’s the origin of existence. Why not? It’s just a word to describe something we see working and can’t fully explain. Many previous instances of Qi are known by other names nowadays. Milk - curd - butter. Milk becomes curd because of Qi, curd becomes butter because of Qi. If you say that my reasoning is strange, I have a question for you: describe the precise conditions where milk turn into curd and curd turns into butter. What are the precise conditions when we talk about one of them and not the other. Or perhaps, if that’s too complicated: Take your hair out, one by one. When are you bald? And if you put hairs back on, when do you stop being bald? But to say that milk, curd and butter do not have a beginning, to say that baldness does not have a beginning, that’s odd. The two questions alone can be answered, the combination cannot. ",
            "date": "Answered November 10, 2017",
            "views": "85",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hans Wierenga",
                "href": "/profile/Hans-Wierenga"
            },
            "answer_text": "Our universe appears to not always have existed. The current scientific consensus is that it started with the big bang, and that the initial state of the big bang came into existence out of nothing. This can make sense if we assume that time came into existence together with this initial state. In that case, there was no time before the big bang, and therefore the statement ‘the initial state began to exist’ is true by definition. Note that this answer doesn’t satisfy me. The initial state of the big bang involves an incredibly dense, incredibly massive and incredibly small object that somehow popped into existence and exploded. An explanation in which the initial state of the universe consisted of a single quantum is, on the face of it, much more credible, presuming it can account for the same phenomena as the big bang. A single quantum is infinitely more likely to have arisen out of absolute nothingness than the initial state of the big bang. This option is explored in QO- suppose it all started with a single quantum ... . You could choose to believe that the universe has existed forever. But don’t kid yourself that you’ve got it nailed, because the question “Why has the universe existed forever?” is as unanswerable as the question “How can something arise from nothing?” ",
            "date": "Answered November 7, 2017",
            "views": "109",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Tearne",
                    "user_href": "/profile/John-Tearne-1"
                },
                {
                    "user_id": "Emmanuela Louis",
                    "user_href": "/profile/Emmanuela-Louis"
                },
                {
                    "user_id": "David A. Smith",
                    "user_href": "/profile/David-A-Smith-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marco Pereira",
                "href": "/profile/Marco-Pereira-1"
            },
            "answer_text": "Nothing comes out of Nothing. Even the Whole Universe came out of Fluctuation. For instance, 1 comes out of a fluctuation of 1+ (-1) = 0 If you bypass the fluctuation, you might say that 1 came out of ZERO… but without the Fluctuation (Heisenberg Principle) nothing would ever change. So, Nothing comes out of Nothing. The closer we have of Nothing coming out of Nothing, is the Universe which came out from a Fluctuation of ZERO. Cosmogenesis Fluctuations of Zero how the Universe was set to travel at the speed of light: Was the Creation of the Universe an Entropic Explosion - An Hyperspherical Prince Rupert’s Drop ############################################ New model for matter, based upon the Fundamental Dilator: The-Fundamental-Dilator A little lesson on the Hypergeometrical Standard Model The Fundamental Dilator has been implemented physically and showed to display Quantum Mechanical Properties: Dr. Couder created a macroscopic implementation of the Fundamental Dilator Another remarkable evidence comes from the Strange Synchronization Conundrum discovered by Christiaan Huygens, some 350 years ago. Huygens notice that his Pendulum Clocks would synchronize spontaneously, no matter the initial relative phase they were set in. Marco Pereira's answer to Does the Huygens' Pendulum Synchronicity support the Quantum Lagrangian Principle? It just happens that his Pendulum Conundrum has the same mechanism as the Fundamental Dilator Quantum Lagrangian Principle and that pervades the Whole Universe and is the reason for the Quantum Mechanics Nature of Matter and the reason for Natural Laws. I derived Natural Laws from it and the Lightspeed Expanding Hyperspherical Universe topology. ",
            "date": "Updated November 24, 2019",
            "views": "114",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Abdo Elgendy",
                    "user_href": "/profile/Abdo-Elgendy-2"
                },
                {
                    "user_id": "Sunita Yadav",
                    "user_href": "/profile/Sunita-Yadav-157"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Jermey",
                "href": "/profile/Jon-Jermey"
            },
            "answer_text": "The universe doesn’t recognise ‘things’. It’s merely a vast collection of different types of atoms. Human beings use words to identify certain collections and types of collections of atoms, because they’re important to our survival and comfort, but that’s just because we are the way we are. We use the word ‘car’, for instance, to describe a form of transport that can take us long distances along roads. A car ‘begins to exist’ when its parts are assembled in a functional way. When they’re taken apart again the car no longer exists, but nothing has happened to the atoms; they’re all still there. Some things come into existence slowly, like trees, by accumulating atoms over time. Some things, like adults, come into existence quickly, when a person has their eighteenth (or twenty-first) birthday. But these are not facts about trees or adults; they’re facts about the way we use the word ‘tree’ and the word ‘adult’. The universe may have originated from a state of affairs which, if we encountered it today, we would call ‘nothing’. If and when we come to learn more about it, we might decide that ‘nothing’ is the wrong word for it. But what we choose to call it has got nothing to do with its potential to form universes, or anything else beyond communication between the English-speaking members of our short-lived species. ",
            "date": "Answered November 9, 2017",
            "views": "96",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sam Austin",
                    "user_href": "/profile/Sam-Austin-1"
                },
                {
                    "user_id": "Kate Jansen",
                    "user_href": "/profile/Kate-Jansen-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Lohden",
                "href": "/profile/Matthew-Lohden"
            },
            "answer_text": "It makes sense in reference to arrangements of matter and energy that take form over time. Stars begin to exist by the accumulation of enough matter to ignite stellar fusion. Streams begin to exist when water accumulates and rounds down hill. Automobiles begin to exist when they are assembled. If you are referring to the beginning of all existence that gets more complicated and we really only have conjectures at the moment. For all we know time itself began to exist when there became events that could be distinguished as before and after. As to things being created out of nothing we have a couple of possible examples. Quantum vacuum fluctuations are one. The Big Bang may be another. There is no evidence though of anything natural being created. The natural world and the universe has simply occurred. Humans and some animals create things but we use other stuff in the process and don't create them out of nothing unless you consider the idea of a thing to be a thing itself. We do make those out of our imagination which is about as immaterial as anything gets. ",
            "date": "Answered November 10, 2017",
            "views": "25",
            "upvotes": " Answer requested by Justice Muigai",
            "upvoters": [
                {
                    "user_id": "Jon Jermey",
                    "user_href": "/profile/Jon-Jermey"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Ward",
                "href": "/profile/William-Ward-65"
            },
            "answer_text": "Worth a read, this is an exert “Suppose I created a chair by putting all the pieces together. It would be rightly said that the chair has begun to exist. However, what if I were to take that chair and disassemble it? It seems to me that the chair would now no longer exist. But then, I go ahead and put the chair back together again. Now the chair exists again. Such a case would seem to undermine Dr. Craig's definition of \"begins to exist\". For there was a prior time t* that x (the chair) existed. Yet clearly it's the same chair.” What does it mean to \"begin to exist\"? ",
            "date": "Answered November 7, 2017",
            "views": "20",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Julia MacDonald Ogilvie",
                    "user_href": "/profile/Julia-MacDonald-Ogilvie"
                },
                {
                    "user_id": "Joy Poteet",
                    "user_href": "/profile/Joy-Poteet-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Hough",
                "href": "/profile/James-Hough-1"
            },
            "answer_text": "Of course it does. The entire of Christian philosophy and metaphysics is based on the fact that there is a God, and that He is non-contingent. As EVERYTHING that we can know of that exists in our universe is obviously contingent, clear back to the Big Bang, as everyone of us is clearly contingent, there MUST be a non-contingent Creator who necessarily exists, who essence is EXISTENCE itself - and that all men know as God. God then created everything out of nothing, and is Himself uncreated. ",
            "date": "Answered November 10, 2017",
            "views": "59",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Asad Saleh",
                    "user_href": "/profile/Asad-Saleh-1"
                },
                {
                    "user_id": "Jos Buurman",
                    "user_href": "/profile/Jos-Buurman"
                },
                {
                    "user_id": "Jon Jermey",
                    "user_href": "/profile/Jon-Jermey"
                },
                {
                    "user_id": "Cara Brosky",
                    "user_href": "/profile/Cara-Brosky"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Abacan",
                "href": "/profile/Chris-Abacan"
            },
            "answer_text": "Kind of an odd answer, but imagine a chunk of iron. After a bit of melting/tempering, you get steel. After a bit of moulding and shaping, you get steel beams. Assemble enough of them, and you have a building. The building did not exist before, and the assembly of it’s raw materials caused it to exist. ",
            "date": "Answered November 7, 2017",
            "views": "93",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abdo Elgendy",
                    "user_href": "/profile/Abdo-Elgendy-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Cox",
                "href": "/profile/Richard-Cox-34"
            },
            "answer_text": "Just because we can’t see or experience something does not mean it doesn't exist! We live with 90% of the universe that is nonexistent to our senses but damn sure exists. It’s all around us and we have no idea what it is. What we know is a whole lot about very little. ",
            "date": "Answered November 7, 2017",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stefan Johansson",
                "href": "/profile/Stefan-Johansson-13"
            },
            "answer_text": "Creationism as a scientific theory are created out of nothing (no scientific basis). ",
            "date": "Answered November 7, 2017",
            "views": "25",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "David A. Smith",
                "href": "/profile/David-A-Smith-13"
            },
            "answer_text": "How about spacetime and mass arising from whatever came before the Big Bang event? How about spontaneous pair creation,or “quantum foam”? ",
            "date": "Answered November 7, 2017",
            "views": "10",
            "upvotes": "0"
        }
    ]
}