{
    "title": "Does wisdom go beyond human knowledge and understanding? - Quora",
    "tags": [
        "Wisdom",
        "Understanding and Comprehension",
        "Knowledge"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robin Sayer",
                "href": "/profile/Robin-Sayer"
            },
            "answer_text": "No of course not. Wisdom is a human word, conjured up by humans to describe a particular type of knowledge - probably paraphrased as sage advice. It is only in our non-scientific, supernatural and primitive understanding that we would try to imagine that wisdom is somehow outside of us. There is absolutely zero reason why we would think that is true. However humans are not rational - and we’re often not very good at reigning in our ape like brains which tend to seek patterns where there are none. We like to pretend that objects, animals and rituals have meaning - because for millions of years we had nothing else. We couldn't explain why the animals we hunted appeared seasonally, or why the lightning came - so we gave animals and the lightning an imaginary intent and purpose. That sits better with our ape brains than simply admitting that we don't know the answer to something. So we worship the heavens where the lightning comes from, and paint the animals we hunt on our cave walls. But we now know better. We need to be grown up and evolved enough to admit that we don't know things, but that that doesn't then require us to make stuff up. There is more wisdom to be found, but we find it by our own hard work -and it comes into existence only with the discovery. ",
            "date": "Answered December 20, 2017",
            "views": "154",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Evan Poole",
                    "user_href": "/profile/Evan-Poole"
                }
            ]
        },
        {
            "author_info": {
                "name": "Denis Inengite",
                "href": "/profile/Denis-Inengite"
            },
            "answer_text": "It is knowledge to understand that tomato is a fruit. It is wisdom to know that you cannot use if for fruit salad. Wisdom adds extra dimensions to knowledge. Wisdom is the apex level in the model chain-of-understanding. It goes from Data-Information-Knowledge-Wisdom. Wisdom is nothing mysterious when you call it meta-knowledge. Meta knowledge seems like questioning questions and adding layers and layers of meaning to already existing knowledge. For example, it is knowledge to know how to build a ship but it is wisdom you need to sail without sinking it. In my understanding about this ‘chain of understanding’, wisdom exists in two spheres: wisdom of the ages, and transcending wisdom. Wisdom of the Ages simply exposes the knowledge of mankind that is deemed ‘wise’ at that point in time in history or within a particular place. Chinese wisdom could be wrong in American settings. Thus, wisdom of the ages is bounded by Space and Time. Transcending Wisdom on the other hand endures through the ages and it is unbounded by Time and Space. For one the concept of Love is a perfect description of Transcending Wisdom. This kind of wisdom is ever present in the Judeo-Christian worldview.  ",
            "date": "Answered December 20, 2017",
            "views": "394",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Samantha Winne",
                    "user_href": "/profile/Samantha-Winne"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Robb",
                "href": "/profile/Dan-Robb-2"
            },
            "answer_text": "Wisdom cannot go beyond human knowledge and understanding, or else no one would be wise. I believe wisdom involves the continued collection of knowledge, regardless of the source, and the attempt to understand the significance of accumulated facts; combined with understanding oneself (being self-aware of strengths, weaknesses, and biases). Wisdom also incorporates a moral code that acknowledges the benefits of altruism. One must be aware of the propensity for their own negative behavior and common human faults … https://www.quora.com/What-is-the-foundation-for-wisdom-based-on/answer/Dan-Robb-2 ",
            "date": "Answered December 21, 2017",
            "views": "83",
            "upvotes": " Answer requested by Jim King",
            "upvoters": [
                {
                    "user_id": "Vivekanand Verma",
                    "user_href": "/profile/Vivekanand-Verma-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leland R. Beaumont",
                "href": "/profile/Leland-R-Beaumont"
            },
            "answer_text": "In Book 6 of the Nicomachean Ethics, Aristotle distinguishes between two intellectual virtues which are sometimes translated as \"wisdom\": sophia and phronesis. Sophia is the true conception of the first principles of existence and that which follows from them. This is perfect wisdom, the wisdom of the gods, unattainable by mortal men. This ultimate form of wisdom is sometimes called “Theoretical wisdom” and is often intimately tied to theology. Phronesis, sometimes translated as “practical wisdom” is the highest level of insight attainable by mortals; the wise deliberation about human affairs. See: Wisdom - Wikiversity ",
            "date": "Answered December 20, 2017",
            "views": "128",
            "upvotes": " Answer requested by Jim King"
        },
        {
            "author_info": {
                "name": "Regis Chapman",
                "href": "/profile/Regis-Chapman-1"
            },
            "answer_text": "I believe I already answered an nearly identical question about love. So, to balance this, I will include a deeply paradoxical statement from one of the greatest Direct Path non dual teachers ever, Nisargadatta Maharaj: “Wisdom tells me I am nothing. Love tells me I am everything. And between the two my life flows.” These are the two main ways of thinking: Unified and Divided. There is a shared commonality you might find via self-inquiry between both approaches that show that it is not beyond human understanding. Having said that; contact with these, at the point of grasping the shared paradox at the heart of both will remove your need to remain trapped in the cycle of human births and deaths. ",
            "date": "Answered December 21, 2017",
            "views": "129",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Marc Lambert",
                "href": "/profile/Marc-Lambert-9"
            },
            "answer_text": "Wisdom enhances knowledge and understanding it is basically increased brain energy efficiency, increased left brain logical/positive thought , feeling and action with reduce use of the faulty right brain that generates anxiety and all human made suffering. It is part of goodness/brain energy efficiency increased wisdom, selflessness, unconditional love, inner strength and inner happiness, goodness was recognised in people who did not sin 10 000 years ago now science has explained it and EGMi is the first practice to apply the science. ",
            "date": "Answered December 20, 2017",
            "views": "47",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Avijit Ganguly",
                "href": "/profile/Avijit-Ganguly-13"
            },
            "answer_text": "Wisdom is defined as human knowledge .. Yeah it expands with time as we understand more mysteries of the earth.. But it can never be beyond human knowledge coz its human knowledge itself... ",
            "date": "Answered December 20, 2017",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Akridge",
                "href": "/profile/Robert-Akridge"
            },
            "answer_text": "Human beings, among other things, are information processors. We inherit a systems feed-forward process that guides the organism to attend to selected aspects of the environment and activates perception which interacts with conception, feelings, intentions and actions. Human organisms organize their perceptions, conceptions, feelings, intentions, and actions, or fail to do so. The processing of data into information and the processing of information into knowledge, opens the possibility of processing knowledge into wisdom. ",
            "date": "Answered December 20, 2017",
            "views": "49",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Celeste Writings",
                "href": "/profile/Celeste-Writings"
            },
            "answer_text": "The intellect is both a companion and stumbling block to wisdom. To accept humbly the limitations of human understanding and knowledge , is the beginning of wisdom. ",
            "date": "Answered December 20, 2017",
            "views": "31",
            "upvotes": " Answer requested by Jim King"
        },
        {
            "author_info": {
                "name": "Bruce Barron",
                "href": "/profile/Bruce-Barron-1"
            },
            "answer_text": "The intellectual virtues are science, understanding, and wisdom. Wisdom is the habit of knowing things in their highest causes. It is the organized knowledge of principles and conclusions in the full light of truth. ",
            "date": "Answered December 20, 2017",
            "views": "38",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ryan Allen",
                "href": "/profile/Ryan-Allen-128"
            },
            "answer_text": "No. Wisdom comes from human knowledge and understanding. ",
            "date": "Answered December 20, 2017",
            "views": "6",
            "upvotes": "0"
        }
    ]
}