{
    "title": "Does nature need humans? - Quora",
    "tags": [
        "Nature",
        "Human Evolution",
        "Science of Everyday Life",
        "The Human Race and Condition"
    ],
    "response": [
        {
            "author_info": {
                "name": "Will Turner",
                "href": "/profile/Will-Turner-20"
            },
            "answer_text": "There are at least 3 different questions of interest here: Does Nature, broadly speaking, need people? I assume from your question that we're talking about nature as in \"life on Earth\". So this includes plants, animals, other biodiversity, ecosystems, ecological and evolutionary processes. The answer here is no. Nature writ large has been around for more than 20,000 times longer than humans (life has been around for 3.5 billion years, anatomically modern humans 200,000 or less). And nature would continue without us. Evolution would keep happening, photosynthesis, ecological interactions among species, life would keep interacting with the atmosphere, water, and other abiotic parts of the planet. It's unlikely that any major branch of the tree of life would be in serious trouble without us. 'Major branch', that is, which brings us to question 2: Does any part of Nature need people's presence?Without us, there are plants, animals, and other organisms that couldn't survive. This includes species that existed before us, as well as breeds that we created. For example, in many places there are trees with large seeds that can no longer reproduce without human intervention. Why? Because humans have done a good job of wiping out large animals (large land birds such as dodos and moas, large tortoises on islands, various large mammals), and the dispersal and/or germination of these trees' seeds depended on being eaten and passing through the gut of a large animal. Without humans to keep these trees alive or to introduce other large animals specifically to assist the trees, the trees would not survive. The process whereby one species vanishes because another has been lost is termed 'coextinction'. There are many more examples, particularly with insects, including  coevolved parasite-animal interactions where the animal disappears, or coevolved interactions (plant-pollinator, or insect-host plant) where the insect or host plant disappears.  As for breeds -- or other groups that are 'lower' than the species level -- we created, there are many examples of both animals and plants. Various crop plants that we reproduce artificially would vanish in a single generation. So would dog breeds that we've created that have difficulty giving birth without a caesarian section (our breeding of them has removed the powerful force of natural selection that would have kept head sizes smaller than birth canals over generations). Aside from those 2, are there other ways parts of nature depend on people?A big one here could be summed up as 'Nature needs us to protect it from ourselves'. Many species that certain human actions have driven to the brink of extinction are still here only because of other human actions to keep them around. American bison (buffalo) were once down to extraordinarily small numbers and have recovered slightly with human help. Golden lion tamarins numbered about 100 40 years ago after people cut down 90% of Brazil's Atlantic Forest; without concerted habitat restoration and effort by zoos and others, they would be extinct rather than numbering almost 3000 today. There are hundreds of such stories. There are even more stories where we didn't succeed, and the species are gone. What they needed us for -- either leaving them alone or protecting them from ourselves, or both depending on your perspective -- we didn't give them. Thankfully we still have the opportunity to get that right for many species. Though with thousands of species that we've driven to the brink of extinction (the IUCN Red List of Threatened Species is a great clearinghouse of data on which, where & why), for many of them things are not going the right direction. ",
            "date": "Answered December 8, 2014",
            "views": "81",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adrianne Comia",
                    "user_href": "/profile/Adrianne-Comia"
                },
                {
                    "user_id": "Martin John",
                    "user_href": "/profile/Martin-John-130"
                },
                {
                    "user_id": "Magdolin Muslih",
                    "user_href": "/profile/Magdolin-Muslih"
                },
                {
                    "user_id": "K.P. Keshav",
                    "user_href": "/profile/K-P-Keshav-1"
                },
                {
                    "user_id": "Kango Msinde Chipaila",
                    "user_href": "/profile/Kango-Msinde-Chipaila"
                },
                {
                    "user_id": "Mahadev A",
                    "user_href": "/profile/Mahadev-A"
                },
                {
                    "user_id": "Hakku Gen",
                    "user_href": "/profile/Hakku-Gen"
                },
                {
                    "user_id": "Hyalite Welfa Aniero",
                    "user_href": "/profile/Hyalite-Welfa-Aniero"
                },
                {
                    "user_id": "Nick Chan",
                    "user_href": "/profile/Nick-Chan-92"
                },
                {
                    "user_id": "Ashirwad Sahoo",
                    "user_href": "/profile/Ashirwad-Sahoo"
                },
                {
                    "user_id": "Eugenia Traglia",
                    "user_href": "/profile/Eugenia-Traglia"
                },
                {
                    "user_id": "KeMonte White",
                    "user_href": "/profile/KeMonte-White"
                },
                {
                    "user_id": "Rita Desjardin",
                    "user_href": "/profile/Rita-Desjardin"
                },
                {
                    "user_id": "Katie Chan",
                    "user_href": "/profile/Katie-Chan-29"
                },
                {
                    "user_id": "Shwetha Menon",
                    "user_href": "/profile/Shwetha-Menon-2"
                },
                {
                    "user_id": "Jagriti Gupta",
                    "user_href": "/profile/Jagriti-Gupta-33"
                },
                {
                    "user_id": "James Hollomon",
                    "user_href": "/profile/James-Hollomon"
                },
                {
                    "user_id": "Sanjeev Tiwari",
                    "user_href": "/profile/Sanjeev-Tiwari"
                },
                {
                    "user_id": "Rusdy Simano",
                    "user_href": "/profile/Rusdy-Simano"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ben Okopnik",
                "href": "/profile/Ben-Okopnik"
            },
            "answer_text": "Does the ocean need water? (Or, a bit more precisely, does the ocean need a specific volume of its water?) The question makes very little sense as posed, since humans are part of what the term \"nature\" means in the first place. And, in the second place, there's no way to define what \"nature needs\" - since the term \"need\" presumes agency, or at least the ability to form a desire. In fact, you could even make the argument that since humans are the most expressive part of nature, we represent nature - and are the only ones who can define what it needs. Just for curiosity's sake, though, let's \"spin the cube\" on this question and see what its different facets look like. Does nature \"need\" the deer that girdle (and thus kill) young trees, condemning a barely-surviving forest to a slow death? Does nature \"need\" a population of wolves that hunt down and tear apart the young fawns of those deer? Does nature \"need\" a swarm of locusts so huge that it leaves a swath of death - not one single green, growing thing - where it passes? A red tide that could choke all life in the ocean? A meteorite that could destroy all life on Earth? It would be a really good idea to define - by thinking really, really hard - what you mean by \"nature\", as well as considering how its near-infinity of interdependent parts interact. It's an undeniably difficult task, but it's much more likely to produce informative answers and interesting discussion than just launching a general question based on a false premise. ",
            "date": "Answered June 28, 2015",
            "views": "33",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Niko Miritello",
                    "user_href": "/profile/Niko-Miritello"
                },
                {
                    "user_id": "Lachoneous",
                    "user_href": "/profile/Lachoneous"
                },
                {
                    "user_id": "Katie Chan",
                    "user_href": "/profile/Katie-Chan-29"
                },
                {
                    "user_id": "Muthu Karthik",
                    "user_href": "/profile/Muthu-Karthik-2"
                },
                {
                    "user_id": "Godfrey McDonnell",
                    "user_href": "/profile/Godfrey-McDonnell"
                },
                {
                    "user_id": "Danny Gingerich",
                    "user_href": "/profile/Danny-Gingerich"
                },
                {
                    "user_id": "Anthony Gilbert",
                    "user_href": "/profile/Anthony-Gilbert-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deanna Tratensek",
                "href": "/profile/Deanna-Tratensek"
            },
            "answer_text": "To put it simply, yes and no; it all depends upon the plants/animals you are talking about.  Humans have caused incredible destruction to wild habitats. In this case, I would state that plants/animals in these areas would be better off without humans, as long as the basic habitat has not been disrupted and can still recover (predator-prey relationship still intact, etc). If the chain is broken, say, in the case of no natural predators in a given area, it may still be necessary for humans to assume the role of apex predator in order to keep prey populations in check until predators can be reintroduced (if that is possible).  On the other side of things, domesticated plants and animals need humans to assure their survival. In some instances, humans have altered these species to a point in which they can no longer reproduce without assistance/intervention, or have made it so that they couldn't survive if released \"into the wild\".  Granted, the above is a very simplistic view of how it all works, but at least it may give you a starting point to look further into it.   Hope it helps. ",
            "date": "Answered December 4, 2014",
            "views": "41",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adsen Dias",
                    "user_href": "/profile/Adsen-Dias"
                },
                {
                    "user_id": "Shiv Sham",
                    "user_href": "/profile/Shiv-Sham"
                },
                {
                    "user_id": "Raymond K. Cunningham",
                    "user_href": "/profile/Raymond-K-Cunningham"
                },
                {
                    "user_id": "Rob Hooft",
                    "user_href": "/profile/Rob-Hooft"
                },
                {
                    "user_id": "Jonah Miller",
                    "user_href": "/profile/Jonah-Miller-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gaurav Rautela",
                "href": "/profile/Gaurav-Rautela-7"
            },
            "answer_text": "I don't think so. Humans are new species compared to existence of nature in earth. Nature was still at its best when we were not present. If the asteriod didn't hit the earth and wiped out all the dinosaurs i think we wouldn't have been present today. So nature dont need humans but we really do and we are destroying it. If we continue to neglect our nature we will be facing a apocalyptic situation soon. ",
            "date": "Answered July 11, 2017",
            "views": "314",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Amol Walunjkar",
                    "user_href": "/profile/Amol-Walunjkar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Beauregard Jarvis",
                "href": "/profile/Beauregard-Jarvis"
            },
            "answer_text": "Clearly the answer is yes. Man has been part of the ecosystem for 200,000 years or so and has been a major force in the evolution of many plants and animals during that time. Sure, the case could be made that nature would continue on without us but in real terms the path it would take after our removal would be drastically different. This would work well for some and not for others and yes the system would stabilize but not all would be peachy. Food for thought.... after we are gone what would be the next apex predator? Chimps? Dolphins? Elephants?  We appreciate nature and have found ways to preserve it from ourselves and from other global forces, I am unsure about what the next apex species will value.... I think we should try to understand our place on this earth in relation to what was here before and what might come after. In those terms I think we have done a stellar job as planetary stewards and I think we will continue to do so. ",
            "date": "Answered June 16, 2015",
            "views": "940",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thiyagarajan Dhayalan",
                    "user_href": "/profile/Thiyagarajan-Dhayalan"
                },
                {
                    "user_id": "Grace Lee",
                    "user_href": "/profile/Grace-Lee-829"
                },
                {
                    "user_id": "Dinesh the Ultimate",
                    "user_href": "/profile/Dinesh-the-Ultimate"
                },
                {
                    "user_id": "Anders Kouru",
                    "user_href": "/profile/Anders-Kouru"
                }
            ]
        },
        {
            "author_info": {
                "name": "Árúñ R",
                "href": "/profile/Árúñ-R"
            },
            "answer_text": "Nature doesn't need humans but human beings need nature.Nature provides all the necessary resources that are required for human survival but human beings on the other hand are destroying nature and resources.There might come a time when nature tries to destroy human beings due to over population and large scale destruction. ",
            "date": "Answered July 20, 2018",
            "views": "367",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mish Mandry",
                "href": "/profile/Mish-Mandry"
            },
            "answer_text": "Nature doesn’t need humans. Some species have become dependent on humans through domestication and breeding: if humans ceased to exist they would either adapt or become extinct. With humans out of the picture, nature would recolonise our cities, farmland, industrial landscapes, and infrastructure. Nature wouldn’t end on our last day. It would carry on regardless! ",
            "date": "Answered November 28, 2016",
            "views": "456",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Hollomon",
                "href": "/profile/James-Hollomon"
            },
            "answer_text": "No more so now than nature needed us before we came along. We're causing a new mass extinction right now. Aside from domesticated plants and animals, all life on Earth would be happy to see our profligate, destructive sort gone. The rest of the plant and animal kingdom would flourish without us whereas they are dying off thanks to our shortsighted use of natural resources.  ",
            "date": "Answered June 16, 2015",
            "views": "1",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "KeMonte White",
                    "user_href": "/profile/KeMonte-White"
                },
                {
                    "user_id": "Rita Desjardin",
                    "user_href": "/profile/Rita-Desjardin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leland R. Beaumont",
                "href": "/profile/Leland-R-Beaumont"
            },
            "answer_text": "It is doubtful that nature needs humans.They play no significant role as producers in the food web, they perform no environmental services. It can be argued that certain domesticated animals or farm animals benefit from human activities, but the species are likely to continue without human help. ",
            "date": "Answered June 16, 2015",
            "views": "927",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "KeMonte White",
                    "user_href": "/profile/KeMonte-White"
                },
                {
                    "user_id": "Rita Desjardin",
                    "user_href": "/profile/Rita-Desjardin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bryan Walko",
                "href": "/profile/Bryan-Walko"
            },
            "answer_text": "There is no difference between humans and other animals/plants regarding the natural rules we have when interacting with nature.  What makes us different is our level of success - we're essentially the apex predator in this world's ecosystem. We depend on plants and animals in the same way that a lion would, only with a superiority over them many scales of magnitude greater. Its still a big web though, and there are examples where animals and plants depend on us. We've domesticated plants and animals - and certainly they have an easier time acquiring food and reproducing because of it. Entire breeds of domesticated farm animals might risk extinction if humans disappeared. Seedless varieties of fruits and vegetables could, since they depend on us to help them reproduce. There are animals like pigeons who have fit in to a niche where they thrive in our urban environments due to our behavior. If we go away, I doubt they would go extinct but it would certainly change how they survive. ",
            "date": "Answered December 4, 2014",
            "views": "21",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jonah Miller",
                    "user_href": "/profile/Jonah-Miller-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhinav Trivedi",
                "href": "/profile/Abhinav-Trivedi-26"
            },
            "answer_text": "According to me, answer is no. There's a environmental cycle that actually meant for it's creatures but humans have no role in it. There is Grass ate by Deer ate by Lion dies and finished by Carrion eaters and bacteria. Nature has its own balancing parameters to adjust its ecosystem. Just put yourself out of this ecosystem and find if it really affect the system. ",
            "date": "Answered July 11, 2017",
            "views": "700",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Prabhakar Mishra",
                    "user_href": "/profile/Prabhakar-Mishra-22"
                },
                {
                    "user_id": "KeMonte White",
                    "user_href": "/profile/KeMonte-White"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nandan Choksi",
                "href": "/profile/Nandan-Choksi"
            },
            "answer_text": "If it exists, it is necessary. Therefore we should take care of the human race and also of other species. Each has a function. ",
            "date": "Answered June 16, 2015",
            "views": "99",
            "upvotes": "0"
        }
    ]
}