{
    "title": "Does reality exist, or is it just an illusion of our mind? - Quora",
    "tags": [
        "GOD the Genuine Original Dreamer",
        "Illusions",
        "Perception",
        "Reality"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Marx",
                "href": "/profile/James-Marx-3"
            },
            "answer_text": "As soon as I saw this Answer Request I knew I would have to give it a shot. These types of questions are easy to not get wrong. Nobody on the planet can prove either side. By the wording of your question, you’ve taken care of one fact. You ask about reality, as if it were something we can all understand by the very definition of the word. We all, in our minds, have a feeling which corresponds with the definition of the word, ‘reality’. We know instantly of what you’re naming. It’s one of the most obvious feelings we sense. Reality, however, is very difficult to describe. Reality is personal. We all have our own reality. My reality, you might judge to be exactly an illusion of my mind. Logic, for each of us is so obvious to be this, or not this. Obvious logic is only obvious to the individual who sees it as obvious. Too many variables to assume a unanimous reality that everyone sees. We, most of us, get ‘in the ball park’ with something that we can assume we all feel. There’s the qualifier. We’re all assuming that other people look at their life and view their reality much the same as we look at ours. We’d be surprised to see inside the eyes of many around us. Most, if not all, of us have psychosis underlying within our portrayals of who we are. Reality exists because we make it so. We get to watch the movie being filmed, as well as write our own scripts, and develop our characters any way we choose. We see reality as a beautiful experience. Some live their lives in a dream-like state. They’ve been given to and given to. They’ve no idea what it may be like to desire something. Anything they could ever desire has always been within their easy reach. Others, not so much. Others, feel like they’ve been dealt a bad hand. Maybe it’s not even an average hand. Some are born blind and deaf and won’t know what they can’t see, or hear. Those are definitely different realities. Somehow, those realities I just described are all something they would call a reality, and each would be correct to say they were living a life of illusion. My logical answer to this question of ‘Does reality exist, or is it just an illusion of our minds?’ Reality exists and it is just an illusion in all of our minds. Just because it’s an illusion doesn’t make it less real. ",
            "date": "Updated July 8, 2018",
            "views": "41",
            "upvotes": " View 21 Upvoters ",
            "upvoters": [
                {
                    "user_id": "El Breadgüino",
                    "user_href": "/profile/El-Breadgüino"
                },
                {
                    "user_id": "Joshua Jou",
                    "user_href": "/profile/Joshua-Jou"
                },
                {
                    "user_id": "Mike Berring",
                    "user_href": "/profile/Mike-Berring"
                },
                {
                    "user_id": "Widad Muhaisen",
                    "user_href": "/profile/Widad-Muhaisen-1"
                },
                {
                    "user_id": "Mages Waren",
                    "user_href": "/profile/Mages-Waren-1"
                },
                {
                    "user_id": "Saúl Andrés Santos Serrano",
                    "user_href": "/profile/Saúl-Andrés-Santos-Serrano"
                },
                {
                    "user_id": "Julia Doherty",
                    "user_href": "/profile/Julia-Doherty-6"
                },
                {
                    "user_id": "William Harold Hinkson II",
                    "user_href": "/profile/William-Harold-Hinkson-II"
                },
                {
                    "user_id": "William Joseph Sweeney Jr.",
                    "user_href": "/profile/William-Joseph-Sweeney-Jr"
                },
                {
                    "user_id": "Rosé Pink",
                    "user_href": "/profile/Rosé-Pink-1"
                },
                {
                    "user_id": "Zaire Sirius",
                    "user_href": "/profile/Zaire-Sirius"
                },
                {
                    "user_id": "Joshua Chen (陳祈安)",
                    "user_href": "/profile/Joshua-Chen-陳祈安"
                },
                {
                    "user_id": "Mykyta Gnilobok",
                    "user_href": "/profile/Mykyta-Gnilobok"
                },
                {
                    "user_id": "Teresina White",
                    "user_href": "/profile/Teresina-White"
                },
                {
                    "user_id": "Wolf Waldbauer",
                    "user_href": "/profile/Wolf-Waldbauer"
                },
                {
                    "user_id": "Roxanne Smith",
                    "user_href": "/profile/Roxanne-Smith-16"
                },
                {
                    "user_id": "Willie Coughlan",
                    "user_href": "/profile/Willie-Coughlan"
                },
                {
                    "user_id": "Nicolette Jollene",
                    "user_href": "/profile/Nicolette-Jollene"
                },
                {
                    "user_id": "Leon Brennan",
                    "user_href": "/profile/Leon-Brennan-2"
                },
                {
                    "user_id": "Peter Skupien",
                    "user_href": "/profile/Peter-Skupien"
                },
                {
                    "user_id": "Dawn Gregory",
                    "user_href": "/profile/Dawn-Gregory"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martin Millen",
                "href": "/profile/Martin-Millen"
            },
            "answer_text": "Does reality exist, or is it just an illusion of our mind? . Here’s a question for you: Which is more real: the pain in your toe or the brick you just dropped on it?  Well, the brick’s obviously real enough - it’s solid and heavy. What’s more, it’s made from a lump of mud – you can’t get much more down to earth than that! So, the brick is definitely real. But what about the pain? Surely that's pretty real as well! Pain is real – very real! In fact, given the choice between a brick or a pain in your toe, most of us would choose the brick. Not because we particularly want a brick but because we really don't want the pain! So, in making this choice, the pain is every bit as real as the brick - more real even. Both the brick and the pain are real - but they are real in different ways. This means we have two different realities - we have the pain, which is part of the internal, subjective reality of Mind and we have the brick, which is part of the external, objective reality of Matter. Both the subjective and the objective realities are real – equally real. The pain in your toe is not real like the brick is – but it’s not an illusion either. The pain in your toe is obviously a product of mind. If you didn’t have a mind you wouldn’t feel the pain. But even though the pain is dependent on mind, the pain is still definitely real! If the reality of the pain is created or made real by mind, then could it be that the reality of the brick is also created or made real by mind? That’s for you to decide as there’s no right or wrong here… You have a choice between one of these two possibilities: That the objective reality is ‘really’ real, and the subjective reality is not ‘really’ realThat both the subjective reality and the objective reality are equally real because they are both made real, reified or ‘realised’ by mind.Personally, I believe the second. I believe that the black and white distinction between reality and illusion is not helpful. What we call reality may not be ‘really’ real but it’s not an illusion either. Reality – whether subjective or objective – is mind dependent. Reality is something that is reified or ‘realised’ by mind and then seen as real. Reality is something created by mind and made real by it. ",
            "date": "Answered July 30, 2019",
            "views": "570",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "El Breadgüino",
                    "user_href": "/profile/El-Breadgüino"
                },
                {
                    "user_id": "Michelle Harper",
                    "user_href": "/profile/Michelle-Harper-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rohita Lal",
                "href": "/profile/Rohita-Lal"
            },
            "answer_text": "It’s a game. Just repeating same levels again and again-“Déjà vu”. Time is limited. If you die, game over. End. No respawns. Make sure that; are you completing daily quests or influencing other gameplayers and making history. At some point of life you all must have had a question, what is the basis of our existence? Well existence of species is a very beautiful thing, it just had happened at the right moment, at right time and with right things. Nothing could have been possible after the big bang, if big bang could have not been occurred we would just have been the part of that singularity. If everything could not have occurred at the right moment and at the right time we would just have been the part of stars. The expansion of universe took a myriad of time, galaxies formed, solar system formed and then planets in which our habitable earth formed. After the formation of earth, air, water came and then a tiny celled organism came into being and then the most advanced species - HUMANS developed its existence. It is quite fascinating to note that earth is the only habitable planet on the solar system till now, which would have also been not possible if the planets were not placed properly, if the sun was not there. So how is all these things possible with so much precision? Well maybe it is just a very great coincidence and our good luck that we exists but there can be other possibilities also. In future, it might become possible to simulate the entire universe. But if this is an option, how can we know that it's not already happened? What if we are not creators, but creations? Sometimes it is believed that we all live in a simulation run by the higher dimensional beings and we are just a part of it and our existence doesn't matter. Because if a civilization, a post human civilization were to become significantly, technologically advanced then we would most likely to be simulated. Or it can also be, that the higher dimensional beings or the alien species know our existence and are just waiting for our brains to evolve so that we could be useful to them! It is very sad that our existence doesn't matter to the whole universe. We just think about the betterment of us and our loved ones. Reality; is it a matrix, an illusion or a dream? Is time also an illusion? If yes, then it is possible that the universe is consciousness hologram or we can say a simulation, if so then reality will be the illusion within. Rene Descartes said, \"Cogito, ergo sum\" -- \"I think, therefore I am.\" He was correct. For the purpose of learning, consciousness arise. The question that trickles the physicists and philosophers for decades is that “Is consciousness real?” But the basic question is “What is consciousness?” It can be something supernatural or purely biological. It is very much linked with the universe and the human mind. It is sometimes very easy for me to believe that everything in our life is just the creation of some other entity for their entertainment. But whatever the thing maybe we should enjoy life and the great pleasures that come with it and LIVE LIFE. Everyone just have to learn to enjoy the game of life! ",
            "date": "Updated September 18, 2020",
            "views": "169",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joe Collins",
                "href": "/profile/Joe-Collins-158"
            },
            "answer_text": "There are physiological laws in place that define certain areas governing this question. If we all agree that we have physical bodies. Newtons laws of gravity will certainly define that someone jumping from a 30 story building will reach a maximum velocty defined by gravity before they hit the pavement below and their definition of reality will cease, or be reinforced in a negative live ending experience. That becomes pretty defining on that point. You would only wonder at your own reality if you awoke after such an event unharmed. There are two actual questions here in that do the the physical laws we define our world in exist, and rather than does reality exist, who defines that reality? If the physical laws are not valid then were they only decided for learning purposes to impose ideas upon other indivduals to control them? Most people seeing someone else jump from a 30 story building would see a grissly sight..for the person jumping would they perceive something different? Action and reaction is a simple method of training.. either human or even AI.. so personal experience is what teaches reality. All of what we see and what we react to is what teaches us what reality is. You can dig into personal conceptionalizing.. every individual will see every event differently because thier reality is personal, that is the definition of human indepence or, if you want to bring An Almighty Being, into the question the idea of free will. Reality exists because we make it every day with every interaction.. is it an illusion? absolutely because every interaction and experience taints us to perceive it within the boundaries of our conscience and how we perceive those interactions both historically and personally project the ongoing reality that we will percieve, as long as we act according to those same histporical and peronal experiences. ",
            "date": "Answered July 25, 2018",
            "views": "474",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Babaji Yogiraj",
                "href": "/profile/Babaji-Yogiraj"
            },
            "answer_text": "‘Does reality exist, or is it just an illusion of our mind?’ Reality is the never changing eternal and absolute knowledge of Self, spaciotemporal existence is indeed temporary and therefore it cannot be said to be real. Soul/Spanda is non-local, undying (real) consciousness assuming the form of a subtle energy toroidal field and carries the original design of existence or DNA template.Each soul knows - as in possess - a different design, a different DNA coding. Fractally mirroring the energetic network organization of the Soul, the densified and spatialized DNA-brain-body is AI designed as a result of crystallization and is therefore localized, frozen in time and entropic. It grows, decays and dies and can be compared to a supercomputer in many aspects. Without electricity, the brain is just inert matter and it can only perform neuronal tasks according to pre-programmed encoding. There is NO cosmic, divine or natural intelligence hiding INSIDE the brain, only data. Our visual perception is truly internal, holographic and recursive, occurring on the concave surface of the toroidal field surrounding a Soul’s nodal point, it’s own center.The entire universal expanse thus, is just a tiny bubble of EM radiations in which we conjure up the whole space with a transparent dream image, instantaneously transmitted by the optic nerves into our opened eyes where a globular and split image appears for us (eyes are the mirrors of the soul, splitting it into 2 images, the false duality) and we naturally identify with it as being external, because it appears to be in front and outside from the Soul sitting at center of the brain where the sense of vision - the space-time nodal point - happens when our awareness is directed outwards. When redirected inward however, we are able to dis-identify from the objective, AI based, split vision of the so-called outside world seen INSIDE the eyes ONLY. This effectively stops the world from being externalized and manifest as a de-facto ‘real’ physical expanse, out there. Since the real world never is ‘out there’, really NOT. Instead the truth is finally seen for what it always was. The image of the world is conjured up by AI in the center of the brain and only then it is split and reflected in the globular space inside the eyes where it acquires the added qualities of color, texture and therefore density. The vision happens from the Soul only, who may be located in the center of the brain during externalized mode, mostly due to the opening of the eyelids, or in the heart center when the eyes are closed or when the Soul is internalized through introspection, self-inquiry, meditation… and in sleep. Therefore the Soul is non-local but can be phase-locked, entangled with it’s own mirror image when it is externalized and immersed in the so-called external world. Dreams may occur in the center of the brain, in the case of AI simulated space, based on algorithmic patterns and visual-memories, when the data is being compartmentalized as in defragmented inside DNA/RNA memory blocks for further storage, or dreams may occur in the heart space, in which case they are highly coherent and vivid, thanks to the much higher hyper-conductivity existing around the GOD nodal-point, the Heart Of Hearts. When we are deep in meditation in the heart of hearts, we live a very highly perfected spiritual experience of Self, in an eternal and wonderful dream-world where no opposition (duality) ever enter. This is the privilege of the truly desireless and fearless Souls who are identified only with the Truth at the core of all existence. THERE NEVER IS AN EXTERNAL WORLD OUTSIDE THE AWARENESS OF THE BODY. THE AWARENESS OF THE BODY IS EQUAL TO THE AWARENESS OF AN EXTERNAL WORLD AND BOTH ARE ONE AND THE SAME EXPRESSION AS A RECURSIVE DREAM IMAGERY. ONLY PURE CONSCIOUSNESS IS REAL. SAT-CHIT-ANANDA Om  *According to Kashmiri Shaivism, Spanda is the primary oscillation or throb of energy in which the Pure Consciousness is mirrored, and which takes a toroidal shape. The Soul is the nodal point through which the Pure Self, or GOD can observe the dream-creations in all directions at once provided it is perfectly still and self-centered. @~The Genuine Original Dreamer~@ ",
            "date": "Answered April 27, 2019",
            "views": "974",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sarah Looney",
                    "user_href": "/profile/Sarah-Looney-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bruce Haines",
                "href": "/profile/Bruce-Haines-2"
            },
            "answer_text": "The physical existence on this plane of existence we call “earth” is and seems like reality to almost everyone on the planet, but a 3-d illusion to some who are no longer at a 3rd level density and and have achieved the ability to tap into the quantum reality where higher “densities” abound. Science is proving that experiences we have in life lead to more information about such quantum realities and all that we see, touch, feel, etc. is real to us because we have not yet learned how to tap into those higher “energy” dimensions. When we “remember” that the soul within each of us is merely “borrowing” our “meat bodies” and that this illusion we are all living is really a dream, then moving to the next level of consciousness and of pure energy is not only achievable by each person, but as a society on a grander scale and that is when true change in mankind’s path will move from fear, war and chaos to harmony, love and and peace for everyone. Clearly, we are many generations away from that, but the quest has been started by many wonderful teachers and continues to gain momentum. Google “3rd density and the higher densities of reality” or a similar phrase and read more about it. Google Dr. Joe Dispenza and listen to his work. Truly amazing stuff and gives the path on how to do such work on understanding more about the higher densities that really we all can tap into. ",
            "date": "Answered December 10, 2018",
            "views": "730",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rohit Sharma",
                    "user_href": "/profile/Rohit-Sharma-2464"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Hainly",
                "href": "/profile/John-Hainly"
            },
            "answer_text": "This is different than the original question! Reality is real by definition. Illusion of our mind? Or whatever it is our minds perceive? We are constantly using our minds, at least some of us, to uncover a deeper understanding of reality. But in general, we would not call it an illusion, just an imperfect vision or understanding. There is likely something behind our perceptions, whether our understanding of it is that good, or not. I suppose it could also be a relativity problem. Relative to a super-being of some kind, our understanding of reality may be pretty poor. Theirs may be more “accurate,” although it is possible neither are very accurate, just relatively useful. For instance, for living on our planet for the span out our lifetime, our understanding of reality may be fine. But if we were energy moving between stars, living billions of years, we would probably need a much better understanding of physics, but maybe not so much the biochemistry that humans have. I suspect the question assumed some sort of objective absolute reality. THAT may be the illusion of our minds! We would like that kind of answer, though in the scheme of things, it may not be useful or even possible. ",
            "date": "Answered December 10, 2018",
            "views": "411",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ken Creten",
                "href": "/profile/Ken-Creten"
            },
            "answer_text": "This is a very deep question. Science has not determined the nature of reality, “in full.” We as yet do not understand how the world of the very large which contains everything we see, and can measure, comes from the world of the very small, Quantum Mechanics. We know that everything exists because of the function of the phenomena that Quantum Mechanics (it’s extremely powerful and accurate as a theory), but we do not yet know how that world, turns into the world that you and I see. Speaking just about the human body, we are limited to what our brain and built in sensors can tell us. Our eyes, for example can only see a tiny bit of the Electromagnetic Spectrum. That’s what we call, colloquially, light. However, the entire Electromagnetic Spectrum is the same, just different wavelengths that we can’t see. Right now, through the room you are sitting in, radar from airports is blasting through, as radio waves. Are they really there if you can’t see them? Yes, they are. If you turn on a device, and it has the right antennae, it can “see” those electromagnetic waves. Even our thinking and perception of time is suspect and can be shown to be inaccurate in various ways. It is a very deep question to consider “what reality really is,” and as you can see, we do not have all the answers. ",
            "date": "Answered December 10, 2018",
            "views": "417",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jay Yadawa",
                "href": "/profile/Jay-Yadawa"
            },
            "answer_text": "No one knows. To say otherwise is simply ignorant. Let me give you an example:  [1] Close your left eye, move 12 inches from the monitor and focus your right eye on the small dot. You will see that big dot disappears and reappears but the background doesn’t change. Have you ever wondered why? It is because we have a massive blind spot. Why do we see white background when that happens? Because our brain is making stuff up. Our brain wants to present a coherent picture of the world. Our brain doesn’t care about reality. And that is the truth. The whole truth. Musk says we are living in a simulation[2]. Don’t laugh at him. Try to prove him wrong. Can you? Footnotes[1] BrainBashers - Optical Illusions[2] Odds are we're living in a simulation, says Elon Musk",
            "date": "Updated December 6, 2017",
            "views": "15",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Marvin Glover",
                    "user_href": "/profile/Marvin-Glover"
                },
                {
                    "user_id": "Peter Skupien",
                    "user_href": "/profile/Peter-Skupien"
                },
                {
                    "user_id": "Sukhpreet Riyat",
                    "user_href": "/profile/Sukhpreet-Riyat"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fernando Torres",
                "href": "/profile/Fernando-Torres-35"
            },
            "answer_text": "Actually, both. What you perceive as “reality” is essentially the interpretation your brain does of the signals provided by your senses. What you see, what you hear, what you feel is not a raw input but rather a heavily processed signal. What you hear can be influenced by what you see (see the McGurk effect[1]), what you see can be influenced by your expectations[2] . However, there is an actual reality independent of your perceptions. The universe doesn’t end when you die. A falling tree makes noise even if no one hears it. Footnotes[1] McGurk effect - Wikipedia[2] How Does Expectation Affect Perception",
            "date": "Answered December 4, 2017",
            "views": "566",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Troplis",
                    "user_href": "/profile/Troplis"
                },
                {
                    "user_id": "Zach Fox",
                    "user_href": "/profile/Zach-Fox-18"
                },
                {
                    "user_id": "Peter Skupien",
                    "user_href": "/profile/Peter-Skupien"
                },
                {
                    "user_id": "A.J. Rosingana",
                    "user_href": "/profile/A-J-Rosingana"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrei Palskoi",
                "href": "/profile/Andrei-Palskoi-1"
            },
            "answer_text": "Before you can tell, first you need to define how real are the concepts on which your question is based. Is the concept of “reality” real? Does “existence” actually exist? How can you reliably tell apart “illusion” from “not illusion”? Is “the mind” itself not “just an illusion of our mind”? From where I stand, none of the concepts you used to ask that question are grounded in reality themselves. All of them are mental ideas, which is a form of illusion. So this very question itself is “just an illusion of our mind”. Drop every concept from it and ask again with what's left. Then look for an answer and don't accept any idea for it, or you will only get yet another illusion, not the “real” answer. ",
            "date": "Answered December 5, 2017",
            "views": "792",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Suraj Pillai",
                    "user_href": "/profile/Suraj-Pillai-23"
                },
                {
                    "user_id": "Pete Ashly",
                    "user_href": "/profile/Pete-Ashly"
                },
                {
                    "user_id": "Sharan Gala",
                    "user_href": "/profile/Sharan-Gala"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adam Williamson",
                "href": "/profile/Adam-Williamson-33"
            },
            "answer_text": "Both, its really more so about perception and inception. But yes the real world is really real. If you get hit by a car you will get hurt haha. But the way you see the world and see your self is just as important as what is going on in the real world. The best way to figure out what is real and to figure out what is the product of our minds is to continue to educate yourself about the world around you and yourself. Then you will be able to answer this question for yourself. ",
            "date": "Answered December 4, 2017",
            "views": "352",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Troplis",
                    "user_href": "/profile/Troplis"
                },
                {
                    "user_id": "El Breadgüino",
                    "user_href": "/profile/El-Breadgüino"
                },
                {
                    "user_id": "Ma-Ester Robinson",
                    "user_href": "/profile/Ma-Ester-Robinson"
                },
                {
                    "user_id": "Linda Butler",
                    "user_href": "/profile/Linda-Butler-148"
                },
                {
                    "user_id": "Kelly Attree",
                    "user_href": "/profile/Kelly-Attree"
                },
                {
                    "user_id": "Peter Skupien",
                    "user_href": "/profile/Peter-Skupien"
                },
                {
                    "user_id": "A.J. Rosingana",
                    "user_href": "/profile/A-J-Rosingana"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Skupien",
                "href": "/profile/Peter-Skupien"
            },
            "answer_text": "I think we have a version of reality produced by our minds. All you need is a drug or a little electricity disrupting the working of the brain or a mental illness and these people will have a different version of it. It is a little like “Matrix”. If it's so easy to create versions of it, how can we be sure that we are not all living a human version of it and maybe even a very personal version. Maybe reality is just what happens between our ears… A mass delusion. Just a physical process in the brain? We are just like a few billion gold fish in a giant bowl unaware of the bigger picture? Does it matter? ",
            "date": "Answered December 4, 2017",
            "views": "250",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jade Sparrow",
                    "user_href": "/profile/Jade-Sparrow-6"
                },
                {
                    "user_id": "Sonia Elkes",
                    "user_href": "/profile/Sonia-Elkes"
                }
            ]
        },
        {
            "author_info": {
                "name": "Faroq Moonda",
                "href": "/profile/Faroq-Moonda"
            },
            "answer_text": "It is a product of our consciousness. There have been several experiments conducted thatvhave been repeatedly confirmed that have shown this. The most famous ones are the single and double slit experiments which showed that the photons behave differently depending on if someone is observing or not observing. Quantum mechanics has many different quandries that are simply unexplainable such as entangled particles etc and one of the paradoxes is the measurement paradox. The idea is that despite supposed different possibilities existing for particular particles using Schrödinger’s equation but every time someone attempts to make a measurement the physical form manifests implying that the act of actually measuring determines its result. In anycase, all this makes for a very good argument that the reality is based on our perception or mind or consciousness. ",
            "date": "Answered December 4, 2017",
            "views": "375",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Peter Skupien",
                    "user_href": "/profile/Peter-Skupien"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Oakes",
                "href": "/profile/Michael-Oakes-57"
            },
            "answer_text": "Reality does not exist anywhere. Reality is what happened, what you remember, and what you dream. So that sounds like a very stressful thing you do, and if nothing changes, nothing changes. Because it seems to be the undisciplined carry over from all of the above—it is an experience that moves us to think of the abstract and surreal artists of the post-modern period. Is reality an illusion of our mind? Yes, if recognition makes you think, and if and when it leaves you to your own devising, and occasionally commits to a balance of action and readiness. ",
            "date": "Answered August 8, 2020",
            "views": "28",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Thomas Mattison",
                "href": "/profile/Thomas-Mattison-1"
            },
            "answer_text": "Reality exists. Human cognition however is quite limited, It is an emergent property that perceives using biological tools including, sensors and processors, and then “constructs” a functional reality that runs as sort of an internal holodeck play about what is going on in the environment they are enmeshed with. Since humans can also construct external equipment, they increase their ability to measure and take account of higher degrees of that reality. ",
            "date": "Answered May 16, 2019",
            "views": "207",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Therese Pao",
                    "user_href": "/profile/Therese-Pao"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mihail Militaru",
                "href": "/profile/Mihail-Militaru"
            },
            "answer_text": "Our reality exist as we believe it exist. We can make it an illusion as well. We can consider the dreams are the reality and what is consider awake is a dream. Our mind creates the reality and with that everyone can have his/her own reality. If some of us will tell me this is real, that is real for them. That is one of the reason there are so many debates. People have to understand that is no absolute reality. ",
            "date": "Answered December 5, 2017",
            "views": "179",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Linda Butler",
                    "user_href": "/profile/Linda-Butler-148"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tavis Enderle",
                "href": "/profile/Tavis-Enderle"
            },
            "answer_text": "If you mean by reality everything that is the case, then no; however, it doesn’t follow that since reality doesn’t exist, that nothing exists. If you reject my last statement, then I’d say your framework setting reality in opposition to illusion is simply mistaken. Why would I make the distinction of existence vs. illusion without realizing that illusions have to exist for them to happen? If you do make the distinction, now reality has to be composed of things that don’t exist e.g. illusions and things that do exist, but then I may ask what do you mean by reality? ",
            "date": "Answered August 7, 2017",
            "views": "254",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Daisi Lui",
                "href": "/profile/Daisi-Lui"
            },
            "answer_text": "reality is not an object that comes and goes into existence; it is existence, all there is- it is the ‘space’ in which perception happens, including the perception of ‘you’ as a subject perceiving objects of the world. You may say the witnessing of phenomenal objects [that which is temporal/transitory] is an aspect of reality, reality being the witness in the absence of objects of witnessing. ",
            "date": "Answered May 16, 2019",
            "views": "127",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mason Kelsey",
                "href": "/profile/Mason-Kelsey-4"
            },
            "answer_text": "Reality just means what does exist. If it is an illusion of our mind then that is what reality is. End of story. Descartes wrote about this. You might enjoy reading a brilliant paper by O. K. Bouwsma, “Descartes’ Evil Genius”. It was originally published in 1949, “The Philosophical Review, LVII, pages 141–151. But also reprinted in the second chapter of “meta-meditations - Studies in Descartes”, ed. by Sesonske and Fleming (1965). ",
            "date": "Answered August 7, 2017",
            "views": "389",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Victor Reijkersz",
                    "user_href": "/profile/Victor-Reijkersz"
                },
                {
                    "user_id": "Ivan Popov",
                    "user_href": "/profile/Ivan-Popov-48"
                }
            ]
        },
        {
            "author_info": {
                "name": "Max Fitters",
                "href": "/profile/Max-Fitters"
            },
            "answer_text": "Yes, sure reality exists, there is only one reality. That reality does not depend on observation, it just is. Our perception, our interpretation, is often an illusion. Our version of reality, the story we tell to each other, is what we see confirming that interpretation. Until there is somebody undeniable proving another version / interpretation of reality is really real, then all of a sudden we all can do see it. That’s how weak and powerful a human mind can be. The smaller the scale of reality, the bigger scale of reality, the bigger our illusion about reality could be. ",
            "date": "Answered December 14, 2018",
            "views": "177",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ben Smith",
                "href": "/profile/Ben-Smith-1539"
            },
            "answer_text": "With quantum physics in conjunction with consciousness, it’s more than subjective perception, it’s an ongoing mutual (with everyone) creation as well as perception process of reality?!? Just reading a book on that. I actually seriously think there’s really something in quantum physics and psychology. Not sure what/how exactly yet, I’ll get back to you on that one :) ",
            "date": "Answered May 16, 2019",
            "views": "104",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marvin Glover",
                "href": "/profile/Marvin-Glover"
            },
            "answer_text": "Does reality exist, or is it just an illusion of our mind? Possibilities exist for real. Plato called them perfect eternal forms and ideas, but what they really are is possibilities. Possibilities become probabilities and then actualities, as described by quantum mechanics. ",
            "date": "Answered December 6, 2017",
            "views": "105",
            "upvotes": " Answer requested by Peter Skupien",
            "upvoters": [
                {
                    "user_id": "El Breadgüino",
                    "user_href": "/profile/El-Breadgüino"
                },
                {
                    "user_id": "Daisi Lui",
                    "user_href": "/profile/Daisi-Lui"
                }
            ]
        },
        {
            "author_info": {
                "name": "Colin Wright",
                "href": "/profile/Colin-Wright-58"
            },
            "answer_text": "A reality exists but we dont experience it. We experience the interplay of our sensory inputs with or learned model of how to interpret that input, combine with all sorts of other factors related to our brains state. ",
            "date": "Answered June 20, 2020",
            "views": "38",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Van Dinther",
                "href": "/profile/John-Van-Dinther-1"
            },
            "answer_text": "The answer is in the question. If reality is perceived then the perceiver exists. Whether the perceiver is subjective or objective does not matter for the question of existence. (I perceive therefore I am.) ",
            "date": "Answered May 16, 2019",
            "views": "102",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ahmed Bilal",
                    "user_href": "/profile/Ahmed-Bilal-136"
                },
                {
                    "user_id": "Vasilis Stathakis",
                    "user_href": "/profile/Vasilis-Stathakis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lawrence Hamm",
                "href": "/profile/Lawrence-Hamm-1"
            },
            "answer_text": "You live in the Matrix, so of course reality is all an illusion. Just don’t walk in front of a moving car, because your illusion will hurt. ",
            "date": "Answered August 7, 2017",
            "views": "88",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Seren Starlight",
                "href": "/profile/Seren-Starlight"
            },
            "answer_text": "It’s an illusion. Believe me, I’ve seen it. It’s an illusion, but not of the mind. It’s more an illusion of the physical. There is really nothing there but vibration (just ask a quantum mechanic). Our mind(s) gives it order and form. ",
            "date": "Answered August 13, 2020",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Wald Wassermann",
                "href": "/profile/Wald-Wassermann"
            },
            "answer_text": "To consider reality an illusion is itself the greatest illusion. It is just that reality is Oneself. There are not many separate selves, there is only Oneself. The only illusion is the illusion of separation. - Wald Wassermann ",
            "date": "Answered April 18, 2020",
            "views": "51",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steven Craig",
                "href": "/profile/Steven-Craig-20"
            },
            "answer_text": "Whose mind?? Not our mind or our body. The only truth is the One pure awareness that witnesses itself as everything. ",
            "date": "Answered September 12, 2020",
            "views": "6",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Chan",
                "href": "/profile/David-Chan-287"
            },
            "answer_text": "It depends. I can give a logical account for reality being a hypothesis! Read Belief, Proof and Science. ",
            "date": "Answered May 16, 2019",
            "views": "100",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Eliahu Farkas ben Zvi-Sara",
                "href": "/profile/Eliahu-Farkas-ben-Zvi-Sara"
            },
            "answer_text": "Yes ",
            "date": "Answered May 16, 2019",
            "views": "17",
            "upvotes": "0"
        }
    ]
}