{
    "title": "Does an exprienced teacher practice what they believe in philosophy of education? - Quora",
    "tags": [
        "Philosophy of Education",
        "Teachers",
        "Teaching",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nathan Ketsdever",
                "href": "/profile/Nathan-Ketsdever"
            },
            "answer_text": "I don’t think this is all that different from life philosophy as expressed at work for all careers. The main deterrent for doing so would be lack of time or lack of resources or in the case of an extreme boss (or bureaucracy) they perhaps can’t fully practice their philosophy of education. I would like to think that this doesn’t happen all that often. I think most teachers, particularly experience teachers like the field of teaching much, much more than they are frustrated. That is their passion for kids and learning burns brighter than whatever struggles they might experience at work. ",
            "date": "Answered January 30, 2017",
            "views": "199",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Brown",
                "href": "/profile/Michael-Brown-363"
            },
            "answer_text": "For the most part, yes. I have been teaching many years, and I would like to think that I teach in line with my philosophy. However, as a realist, I can say that I have not always and do not do so completely now. First of all, if your philosophy doesn't match the culture of the school you are in, you need to change. I found my philosophy clashed with the school I'm in currently when I started. Over the past decade, I have move from where the school was back to much closer to my own philosophy because the culture of the school has changed, I have slowly shown that what I do works, and my methods are a known quantity. I am hoping that given more time, the school will continue to develop in a direction that more closely aligns with my philosophy, but I am content with where I am in my lessons at the moment. ",
            "date": "Answered January 29, 2017",
            "views": "540",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sajjad Hussain",
                "href": "/profile/Sajjad-Hussain-45"
            },
            "answer_text": "The answer to this question is relative and depends on one’s own philosophy towards imparting education. If s/he has opted for the teaching profession because of his/her passion, then chances are that s/he will be implementing the philosophy in its true totality. If someone has opted for the profession, because s/he could not get job elsewhere and it was the simplest way out into meeting his/her two ends, then chances are very bleak unless s/he develops his/her obligation towards society for a better future. Yet teaching is a sacred profession, whosoever is opting for it should join it with his/heart and mind. ",
            "date": "Answered January 29, 2017",
            "views": "710",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ahsan Lodhi",
                    "user_href": "/profile/Ahsan-Lodhi-1"
                },
                {
                    "user_id": "Clémence Kitching",
                    "user_href": "/profile/Clémence-Kitching"
                },
                {
                    "user_id": "Michele Cooper",
                    "user_href": "/profile/Michele-Cooper-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jonathan David",
                "href": "/profile/Jonathan-David-60"
            },
            "answer_text": "This is my philosophy of education and I follow it religiously: I will help you as much as you are willing to help yourself. I believe in personal responsibility and taking responsibility for your actions. I will go out of my way to help you succeed as long as you meet me halfway. I will show you respect from the first day of class; it doesn't have to be earned. Everyone will be on a level playing field, meaning, I don't care what you wear, what your sexual orientation is, what color your hair is, or what you have hanging out of your ears and nose, everyone will be treated the same. You will find that the moment you decide to show effort is the moment I become your biggest ally in helping you succeed. Even if you are going through difficulties at home and in your personal life, I will still attempt to teach you and support you, hoping that one day you'll be able to turn things around. I don't hold grudges and forget insults easily. Students all begin at a different level of maturity and need help at whatever stage they might be in their life. Education is as much about life skills as it is about learning. I will try to help you succeed at both. ",
            "date": "Answered January 29, 2017",
            "views": "371",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Stanley",
                "href": "/profile/David-Stanley-14"
            },
            "answer_text": "Good teachers do. Bad teachers do not. After several years in the classroom, you begin to understand your true purpose in that room. You also learn what works, what doesn’t, what makes you feel satisfied, what engages your students. That becomes your philosophy, and since it gives you good strokes, you keep doing it. Bad teachers, I cannot say, because they tend to be so miserable to be around, I avoid interactions with them. ",
            "date": "Answered January 29, 2017",
            "views": "216",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Cristel Loculan",
                    "user_href": "/profile/Cristel-Loculan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Miles",
                "href": "/profile/Bob-Miles-2"
            },
            "answer_text": "YES ",
            "date": "Answered January 29, 2017",
            "views": "12",
            "upvotes": "0"
        }
    ]
}