{
    "title": "Does copying the strategy of a successful person help? - Quora",
    "tags": [
        "Strategy",
        "Success",
        "Successful People",
        "Becoming Successful",
        "Business Strategy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chirag Patel",
                "href": "/profile/Chirag-Patel-133"
            },
            "answer_text": "Yes, It does ! Only when it doesn't ! I have two versions for the question or maybe the answer. Strategy for me as an Entrepreneur has always formed a meaning of, Plan and Execution. Though, there could be many versions of the definitions, probably as many as there are minds, at-least. The answer will still be on the lines of the above definition. Well, strategy on an average, is based on the observation. There are some unknown unknowns which vary in mysterious way, so if one could plan for their variations in the course of success, the journey flows in continuum. Almost all the times, these unknown unknown for a particular field of success get a similar dimension in planning for it. For example, If One would know about the stock exchange and wants to do the technical sampling for the various stocks, MACD of various stocks could be different but if you compare the average deviation of all the differences in MACD for stocks of the same domain, (let's say Life science) it would typically form the shape of domain index, (let's say Life science index) all the time. In conclusion, average of the deviations, even it the variables are unknown unknowns, remains almost same. Why it does follow the pattern ? Answer is simple, for almost all the marketers playing in the same field, though with different opinions, balance the charts. This is a very peculiar case in the stock market. In this type of field, copying a single strategy would make you successful, only if on an average all other players are successful. Magical right ! So, when the copying doesn't change the parameters of success, it does help, ( Yes, It does ! Only when it doesn't !). Now, I'll share some of my experiences about strategy in real-life. I have been engaged in incorporating two of our startups (both failed with huge losses). We had the different insights than to market when it came to the product development part. We actually wanted to be innovative and creative in the product design and features both, since the product was a physical piece of wood for patented design packaging product lines, we had our own freedom. What we thought, if we will be the original, we will create the market pull by genuineness of the design and innovation to which the packaging cost was reducing by almost 35% to 38%. We had our hands on, Creativity, Cost control, Eco-friendliness, Light-weight and Easy manufacturing with FMS (Flexible Manuf. System). Even, we failed to the competitors who still do not have any of the above. Why ? Answer is easy...!! We didn't copy the strategy of market. How the market was planned with what kind/type of demand matrix that, we skipped to innovate. This turned out to be the brutal mistakes both the times.  Yes, copying does help, if you copy the market strategy of need/demand function.  This is simple then, Copy, only when you the parameters of need/demand function and your strategy of copying the strategies flooding the market must not change the parameters of the demand function. It doesn't help any single soul, who doesn't follow the two golden rules.  Now, Plan, here is to plan how to locate, measure and re-iterate the demand function, Execution, here is to execute the planned, in a way which does not differentiate the continuum.  A) Copying helps if you know the demand/need function B) Copying helps if it doesn't change the continuum of the function  1) Plan, is to locate, measure and re-iterate the demand function2) Execute, is to roll-out the planned, in a way which does not differentiate the continuum If you can do this, you're successful. And if you can repeat it, you be the successful function. ( So yes ! Keeping in mind the above aspects, if you could copy the successful functions or people, you could be the same (with some variations of-course)). Cltrl + C !Cltrl + V ! P.S : Almost 5 times I used the Cltrl + C and Cltrl + V while writing ! :) P.P.S : The second version of the answer/question can be found at  Does copying the strategy of a successful person help? ",
            "date": "Answered April 13, 2015",
            "views": "407",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kimron Andreasson",
                    "user_href": "/profile/Kimron-Andreasson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Balasubramanian Jayaraman",
                "href": "/profile/Balasubramanian-Jayaraman"
            },
            "answer_text": "Yes, if you can -  not only copy what all the successful person did and also recreate the exact circumstances that he was in while achieving success. The former may be possible, though not easy, the latter is not possible. Each moment in this Universe is unique. Call it luck or Chance, it is not easy to make the same moment happen exactly the same way again. Even the most successful people have had advantage due to the circumstances they were in, on which they did not have control. On the other hand, you can learn lots of best practices that successful people apply and modify them to your context and work on your ideas.  On the other hand, every typical business is a copy. There are many businesses which are similar and successful. And many fail, following exactly the same model. At a higher level, Industries copy each other and nations copy each other. But the results are mixed. Compared to other living beings, human beings are able to mime each other and take advantage of the knowledge. We copy all the time! So as you cannot control the circumstances, the answer is \"No\"  Success is a combination of natural traits – not just those born with, but developed due to the unique circumstances that person has gone through in life, ability to acquire new skills that are required in the context - call it constant learning, being curious, tenacious, and leverage existing advantages - rather than worrying about what is not available, taking advantage of the emerging circumstances on which you have no control - but use your ingenuity and creativity and making it favorable to you, and ability get support, help from people who can provide the link ( no doubt, everybody is so bullish on social networking), and having the ambition and attitude, and the ability to take risk, which you can manage, and the willingness to fail, if required and stand-up again, and finally enjoying what you do. And the most important thing is, you have to define “what is success as felt by you”. Very often it is not just money, power or status. It may be often, what means valuable to you in your life!   The real enjoyment is in the process! ",
            "date": "Answered September 19, 2014",
            "views": "447",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ganesh Babu",
                    "user_href": "/profile/Ganesh-Babu-27"
                },
                {
                    "user_id": "Marissa Russell",
                    "user_href": "/profile/Marissa-Russell"
                },
                {
                    "user_id": "Gaurav Singhania",
                    "user_href": "/profile/Gaurav-Singhania-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anish Parikh",
                "href": "/profile/Anish-Parikh-3"
            },
            "answer_text": "This is my understanding - that any technique developed by anybody else  cannot make you a real successful. You can borrow it, but it is almost as if  somebody is copying a painting of Picasso. You can copy it - you can copy it perfectly well.  You can be such a perfectionist that even the original may look a little faulty  compared to the carbon copy, but then too the carbon copy is a carbon copy and there is no value in it.  When somebody invents, discovers a technique, in the hands of that man the technique has a magic. The magic comes from the discovery, because the man and his technique are not two things. He has grown up with the method. The method is almost like blood and bones. It is part of him; the method is not separate. The originator has grown, and the method has grown out of so many life situations, observations -- pain and suffering and pleasure. It has grown; it has seasoned through experiences. It is not a hot-house plant. It has really grown in the rains, in the hot sun, in the winter, in the cold, in the snow, it has grown. It has encountered life, and out of that total encounter, it has a conclusion. It was something authentic that was rooted in him. It is true about everything. Now a problem arises. When a method has been successful, any other people will start imitating it, they will start borrowing. It will not be in their being. It will not be connected to their roots. Their own core will remain aloof. Then the magic is lost. This is something very significant to be understood. People are surprised at what has happened and why it used to work. Always remember it. Each person has to develop his own technique, his own methodology, his own philosophy, his own view. Learn from everybody, nothing is wrong in learning but never depend on that learning alone. Otherwise you will always go on missing something.  Thanks For A2A ",
            "date": "Answered September 19, 2014",
            "views": "456",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shobhit Jain",
                    "user_href": "/profile/Shobhit-Jain-92"
                },
                {
                    "user_id": "Hindi Edge",
                    "user_href": "/profile/Hindi-Edge"
                },
                {
                    "user_id": "Adnan Nidal",
                    "user_href": "/profile/Adnan-Nidal"
                },
                {
                    "user_id": "Hardik Mehta",
                    "user_href": "/profile/Hardik-Mehta-61"
                },
                {
                    "user_id": "Gaurav Singhania",
                    "user_href": "/profile/Gaurav-Singhania-2"
                },
                {
                    "user_id": "Rohit Kapoor",
                    "user_href": "/profile/Rohit-Kapoor-49"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gaurav Kumar",
                "href": "/profile/Gaurav-Kumar-194"
            },
            "answer_text": "No, it will never unless you implement with more determination than the person from whom you copied did. Let me explain this out to  you. You determine a person is successful after he/she has achieved what somebody else did not. So, he has done it and its a passe'. There would be number of people who would try to cash in the model he/she followed, because that led to him/her being successful and that is where the problem starts. You would have lots of competition, and outdo all the people who are trying to get a bite at the new successful.Another importation thing is to have the patience, determination and will power to cross the finishing line. Its easy trying to follow someone but its a different thing all together to be a finisher.Hope my answer her and thanks for the A2A! ",
            "date": "Answered September 20, 2014",
            "views": "150",
            "upvotes": " Answer requested by Sunil Somani",
            "upvoters": [
                {
                    "user_id": "Aditya Sisodia",
                    "user_href": "/profile/Aditya-Sisodia-2"
                },
                {
                    "user_id": "Ketan Keshri",
                    "user_href": "/profile/Ketan-Keshri-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rohit Kapoor",
                "href": "/profile/Rohit-Kapoor-49"
            },
            "answer_text": "Success is achieved either by luck or sheer hard work.Luck,as it always have been, is not in your control but you sure do have a wonderful gift of diligence. Combine it with your dexterity and voila! You'll do wonders.So,if copying the strategy means the amount of hard work which will be poured in,yes, it is helpful. Napoleon Hill went as far as calling it idol worship. Do it. If it imbibes certain good qualities to your character,you ought to do it. It is a step towards a better character. Having said that, copying blindly is forbidden. You need to think and improvise it. Add value to it. If needed, revise the strategy. However, don't think it is going to yield the exact same results which it did for the original follower. That's just day-dreaming because you couldn't replicate the exact conditions and wish for same outcome. ",
            "date": "Answered September 19, 2014",
            "views": "283",
            "upvotes": " Answer requested by Sunil Somani",
            "upvoters": [
                {
                    "user_id": "Nandini Khaneja",
                    "user_href": "/profile/Nandini-Khaneja-1"
                },
                {
                    "user_id": "Purva Galphade",
                    "user_href": "/profile/Purva-Galphade"
                },
                {
                    "user_id": "Satya Pasupuleti",
                    "user_href": "/profile/Satya-Pasupuleti-10"
                },
                {
                    "user_id": "Picklerick69",
                    "user_href": "/profile/Picklerick69-1"
                },
                {
                    "user_id": "Kuldeep Ghildiyal",
                    "user_href": "/profile/Kuldeep-Ghildiyal-2"
                },
                {
                    "user_id": "Pankaj Tripathi",
                    "user_href": "/profile/Pankaj-Tripathi-119"
                },
                {
                    "user_id": "Vishal Karhade",
                    "user_href": "/profile/Vishal-Karhade"
                },
                {
                    "user_id": "Cedric Dsouza",
                    "user_href": "/profile/Cedric-Dsouza-8"
                },
                {
                    "user_id": "Soumodeep (सौमोदीप राणा)",
                    "user_href": "/profile/Soumodeep-सौमोदीप-राणा"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aditya Sisodia",
                "href": "/profile/Aditya-Sisodia-2"
            },
            "answer_text": "This is a two sided affair, we generally tend to copy/model successful people around us, for two primary reason. Either out of inspiration or out of desperation. There is nothing wrong in modeling someone, but what we need to remember is, that in the process we do not lose out individuality and uniquiness otherwise, we won't be able to distinguish ourselves in market. Model excellence and remain authentic, we need to offer competitive advantage to end user. So as long as we are able to maintain a healthy level of our standards which helps us to grow and move ahead. It OK to copy/model others as it helps us to reduce our learning curve and get a head start. ",
            "date": "Answered April 14, 2015",
            "views": "119",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gary Brown",
                "href": "/profile/Gary-Brown-59"
            },
            "answer_text": "Does it make sense to learn from someone who is already accomplished?  Of course it does. However, when you ask about \"copying the strategy of a successful person\", I would doubt that you know that person's complete strategy.  For one thing, the path that someone has taken to accomplish whatever goal or outcome that you have observed was likely littered with numerous obstacles that aren't known to you. A strategy  is a plan for getting from 'here to there'.   In order to decide upon the best plan to implement, you will need to consider a host of variables.  These would include such items as your own penchant for risk taking, your ability to influence others to your way of thinking and your ability to recognize customer needs.  These are not items that are copied from someone else. If it was me, I'd consider as many options as I could in order to develop the best strategy for achieving my goal.  During that process, I'd be open to the idea of looking at the elements of another person's strategy to see if they fit my plan.  I would not attempt to simply copy. ",
            "date": "Answered September 22, 2014",
            "views": "128",
            "upvotes": " Answer requested by Sunil Somani",
            "upvoters": [
                {
                    "user_id": "Ravi Mallajosyula",
                    "user_href": "/profile/Ravi-Mallajosyula"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhishek Jain",
                "href": "/profile/Abhishek-Jain-446"
            },
            "answer_text": "Thanks for the A2A Copying the attributes of a successful person will be really more fruitful than copying the strategy. If you look up to a successful person and admire that person, it will be very important to understand the traits that led him to be successful.  However, when it comes to emulating strategy, one such example I know is Louis CK, a stand up comedian. He really looked up to George Carlin and took a cue from him. After that his ability to build on it and make it suitable for his own personality made him successful and not just the copying part.  It is very subjective and would be outrageous to attempt this answer in a yes or no.  So in your particular situation if it seems the strategy of a successful person is innately applicable for your situation. Please go ahead and imitate. But that alone will not assure the success of your endeavor. How you build on it and execute it will be rather critical. ",
            "date": "Answered September 19, 2014",
            "views": "190",
            "upvotes": " Answer requested by Sunil Somani",
            "upvoters": [
                {
                    "user_id": "Fayaz Shah",
                    "user_href": "/profile/Fayaz-Shah"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anunay",
                "href": "/profile/Anunay-4"
            },
            "answer_text": "Does copying the moves of opponent in chess help? I am pretty sure, no. Can you win using the moves Magnus Carlsen played in the last world championship match against Vishy, against any other opponent? No should be the answer.    Why? Because opponent might not copying the exact move Vishy played(If he would have, well, in that case you win). So situation is quite different in your case. Your moves might lead you into the exact trap your opponent was setting up. Now think about this. When you can't win using the strategy of a winner, in chess, where the world is just Black And White, how can you expect to win the match in the real world, which is so gray. Here is a youtube video, that might illustrate what I am trying to say.   You should watch it anyway, its kinda funny! ",
            "date": "Answered October 13, 2014",
            "views": "567",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sunil Somani",
                    "user_href": "/profile/Sunil-Somani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prathmesh Galphade",
                "href": "/profile/Prathmesh-Galphade-4"
            },
            "answer_text": "Yes, very much. In real terms, copying is the best alternative of making money.  Ola copied Uber and made valuation of $6+ Billion. Flipkart copied Amazon and got sold in some $16 Billion. Grabon copied Groupon and have a revenue of $15 million. Say you want to go to A from B and you know someone who actually went from B to A then just copy his path and you will also reach to A, in short span of time than the other. This are just 3 examples but in actually there are more than 100’s of companies which copied each others model and not only got successful but also Billion Dollar. But remember the copy and innovation ratio should be 80–20 and not less that otherwise it may became tough in future to compete with the same counterpart. ",
            "date": "Answered October 6, 2020",
            "views": "14",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gaurav Singhania",
                    "user_href": "/profile/Gaurav-Singhania-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kiran Bulusu",
                "href": "/profile/Kiran-Bulusu"
            },
            "answer_text": "Thanks for the A2A. What you miss when copying is the context, depth, emotional intelligence and decision making abilities of that person , circumstances in which a particular person made that person use a certain strategy . Reading/knowing about all of the strategies etc is good as it expands your mind and will kickstart your thinking process so you can comeup with a strategy on your own that suits the situation you are in or will be in.  If you copy, it might backfire and copying itself is not a good strategy or thought process to begin with. ",
            "date": "Answered September 19, 2014",
            "views": "764",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Aditya Sisodia",
                    "user_href": "/profile/Aditya-Sisodia-2"
                },
                {
                    "user_id": "Tripti Sharma",
                    "user_href": "/profile/Tripti-Sharma-12"
                },
                {
                    "user_id": "Vikram Pawar",
                    "user_href": "/profile/Vikram-Pawar-3"
                },
                {
                    "user_id": "Dimple Jain",
                    "user_href": "/profile/Dimple-Jain-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Reepjyoti Deka",
                "href": "/profile/Reepjyoti-Deka"
            },
            "answer_text": "It sure will at least to some extent. If you are planning on doing so, I would recommend noting down all the strategies one after another and getting it reviewed by a mentor who can guide and let you know following which strategies might not be profitable for you.  Eg. if a successful person wakes up at 3am everyday and goes to sleep at 3pm, he/she might state that working at that time is turning out to be the best thing he/she might have done. But this same strategy might not work out for you. ",
            "date": "Answered September 18, 2014",
            "views": "148",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Amit Yadav",
                "href": "/profile/Amit-Yadav-370"
            },
            "answer_text": "No. We all have different strengths and weaknesses. We have to play on our strengths in life. “Time” is also a vital factor. In this fast changing world, what worked just 2 years before may have become redundant and may not give intended results. Hence, it is advisable to work with a VISION for long-term. However, what you can definitely learn from successful people is: →their hardworking nature →their will-power →their ability to persevere →their ability to withstand stress →their focus, etc. ",
            "date": "Answered August 2, 2018",
            "views": "92",
            "upvotes": " Not for Reproduction",
            "upvoters": [
                {
                    "user_id": "Godfrey McDonnell",
                    "user_href": "/profile/Godfrey-McDonnell"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pranay Sanghavi",
                "href": "/profile/Pranay-Sanghavi"
            },
            "answer_text": "Yes, to some extent, only if relevant.  A wise person's precepts and principles, however, are universally applicable in most situtations across a large swathe of problems. So it would indeed help to study their biography, but at the same time we are all uniquely individual beings -- gotta solve major problems in our own trademark way. If strategies to success were so replicable, they would be successfully churning each and everyone of us out from an assembly manufacturing line (aka universities).  That being said, your time, thoughts and trials spent around a successful leader's thought, word or deed increases your odds of finding your own trademark philisophy. ",
            "date": "Answered September 20, 2014",
            "views": "123",
            "upvotes": " Answer requested by Sunil Somani",
            "upvoters": [
                {
                    "user_id": "Bala Vasudevan",
                    "user_href": "/profile/Bala-Vasudevan-1"
                },
                {
                    "user_id": "Ashok Ram",
                    "user_href": "/profile/Ashok-Ram-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amit Bhardwaj",
                "href": "/profile/Amit-Bhardwaj-32"
            },
            "answer_text": "It seems an easy question but very tough to answer. Copying isn't a dusty task.Many people become famous by copying. Best example is Apple :Xerox is the first company to make computer mouse but Apple copies it.  So You can copy but if you copy then the things dont have value.You have to think how you can innovate your copying skill.If you innovate it,it doesn't called copying. So you can copy but to get success you should innovate idea and yourself. ",
            "date": "Answered October 14, 2014",
            "views": "113",
            "upvotes": " Answer requested by Sunil Somani",
            "upvoters": [
                {
                    "user_id": "Josh Davis",
                    "user_href": "/profile/Josh-Davis-69"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eshwar Narayanan",
                "href": "/profile/Eshwar-Narayanan"
            },
            "answer_text": "Not necessarily. There are times when another person's strategy might just fit you perfectly and times when it might be the worst. However, if I were you, I wouldn't rely on another person's strategy just because he is successful. I am confident that I know myself better than anyone else and hence no one can help me more than myself be it coming up with a strategy or anything else.   Thanks for the A2A request. ",
            "date": "Answered September 19, 2014",
            "views": "366",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Prabhash Kumar Jha",
                "href": "/profile/Prabhash-Kumar-Jha"
            },
            "answer_text": "No it won't. As each person is unique in his own way with different strength and limitations and also the strategy used by the successful person at his/her time would be depended on the circumstances of his/her time which would have changes drastically by now.Though we can learn good things from them and can analyse their thought process. ",
            "date": "Answered September 18, 2014",
            "views": "163",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Senthilkumaran Sridhar",
                "href": "/profile/Senthilkumaran-Sridhar"
            },
            "answer_text": "Yes. definitely. In any field that we want to be successful we can just copy strategy applied by the earlier or current successful person in the same field. There is another advantage on doing it. we get role modal for our self motivation. But there is a challenge. How do we know what is the strategy followed by successful people? even if the successful person reveals it with whole heart. can they really communicate it to others. it is very difficult.  The book \"Think and Grow Rich\" convinced me how & what the Successful people will do for their success. ",
            "date": "Updated November 8, 2014",
            "views": "62",
            "upvotes": " Answer requested by Sunil Somani"
        },
        {
            "author_info": {
                "name": "Gaurav Singhania",
                "href": "/profile/Gaurav-Singhania-2"
            },
            "answer_text": "Yes it will help but will not make you successful enough, brave enough to handle problems and pressure which will come in due course of time. You can copy the stratergies but you can't copy talent and skills. These are the attributes which you have to develop yourself.On the other hand you can watch and learn how they make deals, how they do all the stuff related to it, but copying will not make your inner self happy. Do something different. Take inspiration. Thanks for A2A. ",
            "date": "Answered September 19, 2014",
            "views": "135",
            "upvotes": " Answer requested by Sunil Somani"
        },
        {
            "author_info": {
                "name": "Sandeep Sahu",
                "href": "/profile/Sandeep-Sahu-22"
            },
            "answer_text": "The strategy followed by a successful person will suit him only, and not someone else. strategies are designed and modified to suit a particular individual and his needs . But we can always use those successful strategies by others as a guide and modify it to our liking .\" A wise man learns from the mistake of others\" ",
            "date": "Answered September 19, 2014",
            "views": "107",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Sachin Tripathi",
                "href": "/profile/Sachin-Tripathi-1"
            },
            "answer_text": "It can help you to be a better person. It can help you to tackle certain problems. It can help you to gain friends. It can help you to live a happier life. What it doesn't guarantee is Money, the instrument used to measure success by mediocre people.  It helps..but I prefer not to copy. Try different taste. ",
            "date": "Answered September 19, 2014",
            "views": "206",
            "upvotes": " Answer requested by Sunil Somani"
        },
        {
            "author_info": {
                "name": "Prasanna Jain",
                "href": "/profile/Prasanna-Jain"
            },
            "answer_text": "There are 2 things:  Successful people do not worry about others, they go about their own business.Also, these people, do not know from the start, what they have to do to become successful.Therefore, both these statements imply negation in reply to the question asked. ",
            "date": "Answered September 20, 2014",
            "views": "213",
            "upvotes": " View 4 Upvoters "
        },
        {
            "author_info": {
                "name": "Tripti Sharma",
                "href": "/profile/Tripti-Sharma-12"
            },
            "answer_text": "Works sometimes, sometimes not. Taking inspiration from successful person and knowing what he/she did right to reach such success definitely helps. But copying what he/she did might not give you that satisfaction.  There is no joy and satisfaction in failing certain goal again and again and learning by each of your mistakes and then finally taste success.  Thanks for A2A ",
            "date": "Answered September 21, 2014",
            "views": "272",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Partha Sinha",
                "href": "/profile/Partha-Sinha-6"
            },
            "answer_text": "A2ANo friend you need to come up with your own style your own strategy. Yeah you can just study strategies of successful person but you have to come with your own. ",
            "date": "Answered September 19, 2014",
            "views": "74",
            "upvotes": " Answer requested by Sunil Somani"
        },
        {
            "author_info": {
                "name": "Gautam Singh",
                "href": "/profile/Gautam-Singh-37"
            },
            "answer_text": "It will not help a lot because not every person have the same background and environment, neither everyone gets the same opportunity. Rather than copying the strategy, learn them and use them when condition matches..! ",
            "date": "Answered September 18, 2014",
            "views": "149",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bruce Clark",
                "href": "/profile/Bruce-Clark-8"
            },
            "answer_text": "If what you ;mean by copying is that you adapt the strategy to your abilities and circumstances, by all means, copy it. If you just try to duplicate it, you are likely to have misunderstood it. ",
            "date": "Answered September 19, 2014",
            "views": "252",
            "upvotes": " Answer requested by Sunil Somani"
        },
        {
            "author_info": {
                "name": "Swathi Manjunath",
                "href": "/profile/Swathi-Manjunath-3"
            },
            "answer_text": "I don't think so, everyone have their own way of doing things. What may work with you, may not work with me.... why copy their strategy ?? Plan ur own things, i bet it will work in the right way unless u put in enough dedication and hard work for that plan!!! ",
            "date": "Answered September 20, 2014",
            "views": "140",
            "upvotes": " Answer requested by Sunil Somani"
        },
        {
            "author_info": {
                "name": "Piyush Sharma",
                "href": "/profile/Piyush-Sharma-42"
            },
            "answer_text": "Copying the strategy might not even work for the person who successfully used it beforehand. Its called strategy for a reason. There is a fair amount of uncertainty involved else it would have been called science. ",
            "date": "Answered September 19, 2014",
            "views": "85",
            "upvotes": " Answer requested by Sunil Somani"
        },
        {
            "author_info": {
                "name": "Manmeet Sabharwal",
                "href": "/profile/Manmeet-Sabharwal"
            },
            "answer_text": "Frankly speaking it depends.  For the people it works they would say you should copy.  Rest would say no.  We should take Inspiration but copying blindly is not going to work.  There are many companies and products in one country which are highly inspired from similar product in some other countries.  But would you call it copy  or inspiration? ",
            "date": "Answered September 19, 2014",
            "views": "113",
            "upvotes": " Answer requested by Sunil Somani"
        },
        {
            "author_info": {
                "name": "Harish Shan",
                "href": "/profile/Harish-Shan"
            },
            "answer_text": "It may help, but you won't win the original. Best is always have your own strategy and get lessons from others…. ",
            "date": "Answered February 12, 2017",
            "views": "37",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Veera Sigamani P",
                "href": "/profile/Veera-Sigamani-P"
            },
            "answer_text": "Yes. The development has come through ancient achievers. So it will definitely pave way to achieve a new task, to follow the strategy  of a successful person. ",
            "date": "Answered October 14, 2014",
            "views": "21",
            "upvotes": " Answer requested by Sunil Somani"
        },
        {
            "author_info": {
                "name": "Jay Davis",
                "href": "/profile/Jay-Davis-1"
            },
            "answer_text": "This is one of my favorite quotes and applies perfectly to this question. “Don't be like anybody else. Be different. Then you can make a contribution. Otherwise, you just echo something; you're just a reflection.” - Hugh Nibley ",
            "date": "Answered September 21, 2014",
            "views": "145",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Amar Saurabh",
                "href": "/profile/Amar-Saurabh"
            },
            "answer_text": "Hey There, Blindly copying might not help, but ya learning from successful people, getting to know about their mistakes will help for sure. ",
            "date": "Answered September 27, 2014",
            "views": "63",
            "upvotes": " Answer requested by Sunil Somani"
        },
        {
            "author_info": {
                "name": "Krishnan Kutty Nair",
                "href": "/profile/Krishnan-Kutty-Nair"
            },
            "answer_text": "Strategy depends on the situation. If situation and strategy matches with an earlier situation taken by someone and you adopt the same is nothing wrong. ",
            "date": "Answered September 19, 2014",
            "views": "62",
            "upvotes": " Answer requested by Sunil Somani"
        },
        {
            "author_info": {
                "name": "Spoorthy Moorthy",
                "href": "/profile/Spoorthy-Moorthy"
            },
            "answer_text": "Wish there was something a full proof ready to use completle humane method applicable to all  to be successfull.  However, there ain't and this is a whole lot better than something being there. So be your own SUCCESS GURU!!! ",
            "date": "Answered September 26, 2014",
            "views": "67",
            "upvotes": " Answer requested by Sunil Somani"
        },
        {
            "author_info": {
                "name": "Zeel Patel",
                "href": "/profile/Zeel-Patel-9"
            },
            "answer_text": "Did Bill Gates copied startegy of Steve Jobbs?? Did Dhirubhai Ambani copied strategy of Ratan Tata ?? ",
            "date": "Answered September 19, 2014",
            "views": "67",
            "upvotes": " Answer requested by Sunil Somani"
        }
    ]
}