{
    "title": "Does learning new information make you forget older information? - Quora",
    "tags": [
        "Neurology",
        "Forgetting",
        "Information",
        "Learning",
        "Neuroscience",
        "Psychology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ben Kuebrich",
                "href": "/profile/Ben-Kuebrich"
            },
            "answer_text": "Youji Hajime and Louis Steinberg both have good points. In the short term if you learn something new, and then soon afterwards learn something else, the second thing you learned will interfere with the consolidation of the memory of the first. This phenomena is claled interference as Steinberg mentioned. However, in the long term if you learn new things that build on what you already know, you can elaborate on the original memory. Now when you try to remember the original memory you can either remember it directly, or indirectly deduce it from the new memory. Further the new thing you learned has forced you to recall the old memory which is helpful for memory retention. If you are curious about a bigger question of whether your memory is finite, at some level it probably is, but I think the time you have available to learn and memorize things is far more scarce than the human capacity for memory and the real reason you have to prioritize what you learn! ",
            "date": "Answered July 11, 2016",
            "views": "11",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thomas J. Card",
                    "user_href": "/profile/Thomas-J-Card"
                },
                {
                    "user_id": "Ben Kuebrich",
                    "user_href": "/profile/Ben-Kuebrich-1"
                },
                {
                    "user_id": "Israel Ramirez",
                    "user_href": "/profile/Israel-Ramirez"
                }
            ]
        }
    ]
}