{
    "title": "Does anything need to be first believed in order to exist? - Quora",
    "tags": [
        "Epistemology",
        "Existence",
        "Philosophy of Religion",
        "The Universe",
        "Belief and Beliefs",
        "Philosophy",
        "God",
        "Religion",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hilary Donovan",
                "href": "/profile/Hilary-Donovan-1"
            },
            "answer_text": "Does anything need to be first believed in order to exist? Obviously, whether we believe in something or not has nothing to do with whether it actually exists. I tend to believe that an invisible force probably created the universe with the help of evolution. I rarely, if ever, meet anyone who believes this. It might very well exist, but I don’t believe that any of us will ever know. I don’t think that it will be introducing itself. This doesn’t make it any less real if it does indeed exist. Whether we believe or not matters not. ",
            "date": "Answered February 13, 2019",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lou Savage",
                "href": "/profile/Lou-Savage-1"
            },
            "answer_text": "Marky Mark what kind of question is that ? Because if you mean like chairs then believing in chairs ? but what would that even mean maybe you could say because to me obviously nonsense or a word salad as they say —, do you like salad ? Or maybe you meant like socks where you do first have to believe in the market before you can “see” them ,but honestly I wouldn't know , definitely not be the right person to ask who neither believe in the market nor see any stocks . ",
            "date": "Answered June 26, 2019",
            "views": "32",
            "upvotes": " Answer requested by Mark Thomas Carr",
            "upvoters": [
                {
                    "user_id": "Nritya Gauranga Das",
                    "user_href": "/profile/Nritya-Gauranga-Das"
                },
                {
                    "user_id": "Sunil",
                    "user_href": "/profile/Sunil-906"
                },
                {
                    "user_id": "Anil P",
                    "user_href": "/profile/Anil-P-99"
                },
                {
                    "user_id": "Radhikesh Das",
                    "user_href": "/profile/Radhikesh-Das-1"
                },
                {
                    "user_id": "D Brown",
                    "user_href": "/profile/D-Brown-163"
                },
                {
                    "user_id": "Bala Singh",
                    "user_href": "/profile/Bala-Singh-23"
                },
                {
                    "user_id": "Sita Singh",
                    "user_href": "/profile/Sita-Singh-53"
                },
                {
                    "user_id": "Wendy Peterson",
                    "user_href": "/profile/Wendy-Peterson-62"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Donahue",
                "href": "/profile/Richard-Donahue-13"
            },
            "answer_text": "Some say believing in the God of the Bible is blind faith but its not. We have the His Word, His creation, and best of all His Son Jesus who came to us revealed God in the flesh died for our sins so we can live eternally with Him. But the catch is you won’t know He truly exist personally until the moment you accept by faith Christ as your Savior. He promise to make Himself known to you by giving you the Holy Spirit top live within you. John 14:23 - Jesus answered and said to him, “If anyone loves Me, he will keep My word; and My Father will love him, and We will come to him and make Our home with him ",
            "date": "Answered February 26, 2019",
            "views": "6",
            "upvotes": " Answer requested by Pete Combes",
            "upvoters": [
                {
                    "user_id": "Know",
                    "user_href": "/profile/Know-24"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bikram Singh",
                "href": "/profile/Bikram-Singh-234"
            },
            "answer_text": "No. You are an eternal being in a temporary miserable body, that undergoes birth, disease, distress, old age, and death. You don’t have to believe anything for your existence, but you can ask, if you are an eternal being, why are you in this temporary and miserable body? And the answer is because you were rebellious in the eternal Spiritual world, you have been sent down to this material world where everyone experiences birth, disease, distress, old age, and death, in 8,000,000 species of life forms, until they realize that they are suffering here. So if you are intelligent then you will take steps to get out of this miserable situation by surrendering to the Supreme Lord Krishna. And the easiest and best way is to chant Hare Krishna Hare Krishna Krishna Krishna Hare hare. Hare Rama Hare Rama Rama Rama Hare Hare. Please share. ",
            "date": "Answered February 19, 2019",
            "views": "91",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jim Brown",
                    "user_href": "/profile/Jim-Brown-437"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Spencer",
                "href": "/profile/Paul-Spencer-56"
            },
            "answer_text": "I read about a study where people from a tribe in Africa who had never been in contact with industrialised society were contacted by anthropologists and shown video footage of a western city. The story is that not only could they not describe what they were seeing, they genuinely couldn't perceive the shapes and images on the screen. At some point a chicken came into view and they saw that readily enough. Obviously no-one is claiming that they were blind to the incoming light from the screen, but that a big part of seeing is not just receiving information but interpreting it, meaning that if the signal makes no sense to you, it is hard for your brain to even take it in. ",
            "date": "Answered June 26, 2019",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tom Caballes",
                "href": "/profile/Tom-Caballes"
            },
            "answer_text": "Not at all. There are many things we just recently discover but have existed for many, many years. consider the dinosaurs, the creatures in the deep oceans, and so on - many creatures are still unknown to us but they exist. We will one day discover more of them, but their existence is not dependent on our belief in their existence. ",
            "date": "Answered February 21, 2019",
            "views": "5",
            "upvotes": " Answer requested by Pete Combes"
        },
        {
            "author_info": {
                "name": "Zbigniew Dzwonkowski",
                "href": "/profile/Zbigniew-Dzwonkowski"
            },
            "answer_text": "Yes, as seeing is believing… as old proverb says… and when seeing something beyond personal imagination… process of interpretation begins.. with its basis in science, religion, or personal egos… twisting everything around… as most people believe in what they like to believe, but not seeing reality… all the best. ",
            "date": "Answered June 25, 2019",
            "views": "9",
            "upvotes": " Answer requested by Mark Thomas Carr"
        },
        {
            "author_info": {
                "name": "Reuben Wilder",
                "href": "/profile/Reuben-Wilder"
            },
            "answer_text": "Obviously not. There is much of science phenomena that has existed for millennia before humans realized it existed or began to study and understand it. ",
            "date": "Answered February 13, 2019",
            "views": "11",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Mac McGarry",
                "href": "/profile/Mac-McGarry-1"
            },
            "answer_text": "Probably not, but what's the point in believing in something that doesn't exist? ",
            "date": "Answered February 21, 2019",
            "views": "11",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Dan Pavel",
                "href": "/profile/Dan-Pavel-3"
            },
            "answer_text": "In order to exist any man-made object around you needed someone to imagine it and believe in its possibility to become reality. ",
            "date": "Answered February 14, 2019",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Know",
                "href": "/profile/Know-24"
            },
            "answer_text": "I think no. ",
            "date": "Answered February 14, 2019",
            "views": "39",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Seren Starlight",
                "href": "/profile/Seren-Starlight"
            },
            "answer_text": "No. ",
            "date": "Answered February 15, 2019",
            "views": "8",
            "upvotes": " Answer requested by Pete Combes"
        }
    ]
}