{
    "title": "Does God have a mind or is God a mind? - Quora",
    "tags": [
        "Religious Studies",
        "Christian Theology and Philosophy",
        "Philosophy of Religion",
        "Theology",
        "God",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael DiSibio",
                "href": "/profile/Michael-DiSibio"
            },
            "answer_text": "You've tagged your question as \"Theology\" and \"Christianity\" so I will offer an answer based on those two assumptions. Based on writing from the Peripatetic School (Aristotle essentially), the medieval Scholastics (Albert Magnus, Aquinas, Scotus etc) had very clear definitions around existence, intellect and truth. In very short summary, we observe various degrees of knowledge and intellect, such as a rock that has none,plants that 'know' where the sun is,animals that 'know' what their predator is and where there last meal was found,and man, who ponders 'truths' or 'principles' that have nothing to do with his immediate survival.But man has a hard time figuring things out. Lots of times he only believes what his physical eyes see or his tactile cells touch. The peripatetic school would say, therefore, that there must be a perfect intellect, not bound or constrained by senses to transmit data from which to draw conclusions, but rather one that sees conclusions (truths, principles) immediately, the way a physical eye responds to light. However, that said, they made similar arguments for existence. In super short summary, there must be a perfect existence that was not created and  is not material, an existence that subsists by itself (esse per se subsistens). When they (scholastics) pondered what that would mean, they concluded (using reason and logic, not faith) that such perfect existence cannot have parts (Aristotle was big on 'parts' and 'wholes'). They observed that man's intellect is 'part' of his existence (man is not just an intellect...he has a body and he has volition). So in super, super, super short summary, if the Perfect Existence (God) is absolute simplicity (no parts whatsoever), then it is an existence that holds all other created existence in being, and therefore knows all things (Himself and all created things) immediately without intervention of senses or a thought process. So It's primary definition is that of esse (being) and not intellect, but it is an esse that is, by its essence, the most intimate knowledge of all things. Therefore, (this is my own words) you could call It a perfect intellectual existence. (Much of my answer is a summary in my own words of the scholastic approach to this question. The scholastics were like legal scholars. One question was answered with citation of other philosophers who in turn cited others. However, a good starting point for those interested in citations would be Aquinas' Questiones Disputatae de Veritate(Disputed Questions on Truth) Question 2 Is There Knowledge in God? An english translation can be found here: http://dhspriory.org/thomas/QDdeVer2.htm) ",
            "date": "Answered July 29, 2015",
            "views": "12",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mia Rose",
                    "user_href": "/profile/Mia-Rose-84"
                },
                {
                    "user_id": "Lance White",
                    "user_href": "/profile/Lance-White-19"
                },
                {
                    "user_id": "Aswin Venugopal",
                    "user_href": "/profile/Aswin-Venugopal"
                },
                {
                    "user_id": "Tony Powers",
                    "user_href": "/profile/Tony-Powers"
                },
                {
                    "user_id": "Amanpreet Singh",
                    "user_href": "/profile/Amanpreet-Singh-520"
                },
                {
                    "user_id": "Timothy Takemoto",
                    "user_href": "/profile/Timothy-Takemoto"
                },
                {
                    "user_id": "Marcos Sheldon Padilla",
                    "user_href": "/profile/Marcos-Sheldon-Padilla"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joshua Shoemaker",
                "href": "/profile/Joshua-Shoemaker-1"
            },
            "answer_text": "First, what is a mind? Second, what is a God? Third, what does it mean to say God has a mind? Fourth, what does it mean to say God is a mind?  What is the difference between God having a mind, and God being a mind?  First, mind is defined as the element of a person that enables them to be aware of the world and their experiences, to think, and to feel; the faculty of consciousness and thought.  Second, God is defined as  the creator and ruler of the universe and source of all moral authority; the supreme being.  Third, to say that God has a mind is to say that God is a person, and has all the elements of a person.  Fourth, to say that God is a mind is to say that God is a person, and has all the elements of a person.  The difference between God having a mind, and God being a mind is that to have a mind is to depend on something (God depends on it's mind). To be a mind is to be independent. That is, if you have a mind, you are not a mind, and if you are a mind, you do not have a mind.  How can God have a mind if God is the creator of all things? If God has a mind, then God is not the creator of all things. That is, God did not create itself, and God did not create it's mind. Therefore, the question that has to be asked is, who or what did? To say God had no creator or origin is one thing, to say God and the mind of God had no creator or origin is another thing. ",
            "date": "Answered July 29, 2015",
            "views": "12",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lance White",
                    "user_href": "/profile/Lance-White-19"
                },
                {
                    "user_id": "Mansi Jain",
                    "user_href": "/profile/Mansi-Jain-84"
                },
                {
                    "user_id": "Evan Hobbs",
                    "user_href": "/profile/Evan-Hobbs"
                },
                {
                    "user_id": "Muhammad Qurayshi",
                    "user_href": "/profile/Muhammad-Qurayshi"
                },
                {
                    "user_id": "Kendrick VanZant",
                    "user_href": "/profile/Kendrick-VanZant"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marcos Sheldon Padilla",
                "href": "/profile/Marcos-Sheldon-Padilla"
            },
            "answer_text": "Okay, well, this is of course unanswerable except as philosphy, which I assume is (ahem to some others) why you said it was a philosophy question. My inclination is that the image of God as human-like (arms, legs, mind) is human created, or divinely intended as an image so that we can relate more easily with God. If we imagine we are talking to someone, it feels easier. I actually came up against this in my own spiritual practice recently. My beliefs have evolved so that I am more aware of God everywhere, as opposed to in one direction or location. This I consider a good thing for myself. However, when presented with a certain ritual, directed to God (who I don't call \"God\", but that's not relevant) I had trouble as I didn't know where to look! What direction?!? I know on 19 levels it was a silly problem, but still, I had it. Thus my own experience of the human need to have a 3D being in a certain location. I suppose, obviously, you can tell I believe God is a mind. Or at least, without form or literal substance. ",
            "date": "Answered July 29, 2015",
            "views": "499",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dimitris Zand",
                    "user_href": "/profile/Dimitris-Zand"
                },
                {
                    "user_id": "Rostam Shirazi",
                    "user_href": "/profile/Rostam-Shirazi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joshua Gibbs",
                "href": "/profile/Joshua-Gibbs-3"
            },
            "answer_text": "The same question could be asked of us. Do we have minds or are we our minds? I don’t think we understand what we are or what a mind is enough to even know if the question makes sense. I think it’s fair to say we probably understand less about God and his mind. Until we really understand what we are talking about the question can’t be answered definitively. ",
            "date": "Updated April 12, 2018",
            "views": "69",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ankit Chowdhary",
                "href": "/profile/Ankit-Chowdhary-6"
            },
            "answer_text": "There is nothing like god. In Past some intelligent people created them to keep human desires and there intension in chek. So they make an intuition to whome no one can question. If you see in past u can find that every religion keep updating there god and authority /power and position as per evolving human intellect.Even nobody ever seen god only some person keep claiming  that they experience/have seen which is either their imagination/illusion or their self made proclamation.Any way in this world everyone interprets everything by their own way and those who can't they just choose some one to follow blindly.Note:-These are strictly my view. ",
            "date": "Answered July 29, 2015",
            "views": "197",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Cory Radebaugh",
                "href": "/profile/Cory-Radebaugh"
            },
            "answer_text": "There is absolutely zero evidence for either. Does that mean that I know, for sure, that such a being doesn't exist? Well, not exactly, but by that train of logic I also don't technically know if the Gangrenous Chimera god who resides in Orion's belt has a mind or is a mind. I have no reason to think so, and I am convinced that it would certainly be foolish of me to assume so, let alone devote my entire life to that assumption, but more importantly... what possible purpose could the definitive answer to this question ever serve to anyone? ",
            "date": "Answered July 29, 2015",
            "views": "180",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Yeshua Cohen",
                "href": "/profile/Yeshua-Cohen"
            },
            "answer_text": "What does it mean to say God has a mind?  What does it mean to say God is a mind?  To say that God has a mind is to say that God is one thing, and the mind of God is another thing. That is, something that is different from what God is. This is because the mind is something that God has. The question that needs to be asked is did God create everything except for two things? That is, himself, and  his mind?  To say that God is a mind is to say that there is only one thing. That is, a mind. I think this view seems more likely to me. ",
            "date": "Answered July 29, 2015",
            "views": "368",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joshua Gibbs",
                    "user_href": "/profile/Joshua-Gibbs-3"
                },
                {
                    "user_id": "Jean Venin",
                    "user_href": "/profile/Jean-Venin-1"
                },
                {
                    "user_id": "John Johnson",
                    "user_href": "/profile/John-Johnson-872"
                },
                {
                    "user_id": "Yaroslav Belinskiy",
                    "user_href": "/profile/Yaroslav-Belinskiy"
                },
                {
                    "user_id": "Muhammad Qurayshi",
                    "user_href": "/profile/Muhammad-Qurayshi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deron Overpeck",
                "href": "/profile/Deron-Overpeck"
            },
            "answer_text": "It depends on who you ask. In many religions, God does have a mind; he makes decisions to act and then acts on them, is able to deliberate options, engages in debate with others, et cetera. (This would also be true of the Greek and Roman gods.) Others see the supreme deity as a kind of creative force, unknowable to the human mind entirely. Thus the question of whether the deity has a \"mind\" is irrelevant, because humans couldn't conceive of it in any event. ",
            "date": "Answered July 29, 2015",
            "views": "455",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alex Jeffries",
                    "user_href": "/profile/Alex-Jeffries-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mary Martin",
                "href": "/profile/Mary-Martin-37"
            },
            "answer_text": "God has a mind. Creation was his idea. Salvation was his idea. Love was his idea. A heavenly home for man was his idea. ",
            "date": "Answered July 29, 2015",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Muralidhar Rao",
                "href": "/profile/Muralidhar-Rao-4"
            },
            "answer_text": "God in question does not have mind neither He is mind. Mind is capable of thinking and its human nature only.and the mind is associated with breathing.God does not think ,breath ,is nothing and strangely every thing comes from nothing ",
            "date": "Answered July 29, 2015",
            "views": "211",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Graves-Barakaat",
                "href": "/profile/James-Graves-Barakaat"
            },
            "answer_text": "All there is is mind. \"THE ALL is MIND; The Universe is Mental.\"-- The Kybalion Some may refer to THE ALL as God. ",
            "date": "Answered July 29, 2015",
            "views": "137",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Elric Ebson",
                    "user_href": "/profile/Elric-Ebson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Montano",
                "href": "/profile/Daniel-Montano"
            },
            "answer_text": "It depends on the franchise. In the bible God has a mind and it changes a lot. ",
            "date": "Answered July 29, 2015",
            "views": "146",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Cory Radebaugh",
                    "user_href": "/profile/Cory-Radebaugh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jurate Lehmann",
                "href": "/profile/Jurate-Lehmann"
            },
            "answer_text": "Mind is thought. \"God\" is consciousness. Thought appears in consciousness. ",
            "date": "Answered July 29, 2015",
            "views": "50",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dinesh Babu Rengasamy",
                "href": "/profile/Dinesh-Babu-Rengasamy-1"
            },
            "answer_text": "God is consciousness and everything evolved only from that consciousness, even mind. So mind is a part of him. Everybody's mind in the universe is a part of him. ",
            "date": "Answered July 29, 2015",
            "views": "110",
            "upvotes": "0"
        }
    ]
}