{
    "title": "Does David Hume consider 'mind' as 'self'? - Quora",
    "tags": [
        "David Hume",
        "Epistemology",
        "Philosophy of Mind",
        "Philosophers",
        "The Mind"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lawrence Bloom",
                "href": "/profile/Lawrence-Bloom-2"
            },
            "answer_text": "David Hume did not consider the mind as self. Hume considered the idea of self a fiction. From Sparknotes. “Hume asks us to consider what impression gives us our concept of self. We tend to think of ourselves as selves—stable entities that exist over time. But no matter how closely we examine our own experiences, we never observe anything beyond a series of transient feelings, sensations, and impressions. We cannot observe ourselves, or what we are, in a unified way. There is no impression of the “self” that ties our particular impressions together. In other words, we can never be directly aware of ourselves, only of what we are experiencing at any given moment. Although the relations between our ideas, feelings, and so on, may be traced through time by memory, there is no real evidence of any core that connects them. This argument also applies to the concept of the soul. Hume suggests that the self is just a bundle of perceptions, like links in a chain. To look for a unifying self beyond those perceptions is like looking for a chain apart from the links that constitute it. Hume argues that our concept of the self is a result of our natural habit of attributing unified existence to any collection of associated parts. This belief is natural, but there is no logical support for it.” ",
            "date": "Answered July 10, 2019",
            "views": "1",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Maria-Elisa Giovanardi",
                    "user_href": "/profile/Maria-Elisa-Giovanardi"
                },
                {
                    "user_id": "John Hendrickson",
                    "user_href": "/profile/John-Hendrickson-16"
                },
                {
                    "user_id": "Brad Neil",
                    "user_href": "/profile/Brad-Neil"
                },
                {
                    "user_id": "Amir Salman Borhani",
                    "user_href": "/profile/Amir-Salman-Borhani"
                },
                {
                    "user_id": "Thomaz Rocha",
                    "user_href": "/profile/Thomaz-Rocha"
                },
                {
                    "user_id": "Babruh Ardana",
                    "user_href": "/profile/Babruh-Ardana"
                },
                {
                    "user_id": "Virginia Hanlon",
                    "user_href": "/profile/Virginia-Hanlon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jun Dalisay",
                "href": "/profile/Jun-Dalisay"
            },
            "answer_text": "No. In Book 1 of the Treatise of Human Nature, the self is a collection of perceptions that are resembling and causative, while the mind is a theater or arena where the perceptions live. For example: John-computer can think of Martha-computer, Ruth-computer, and himself in his mind (RAM).When John thinks of himself, he brings up his memories of himself by querying his memory (hard disk) for impressions and ideas (files) that have ‘John’ in them (resembling).When John thinks of Martha, he brings up his memories of Martha by querying his memory (hard disk) for impressions and ideas (files) that have Martha in them, and so on with Ruth and others.The ideas of self is only relevant when it is thought of (in the mind or RAM). A shallower example is if a man did plastic surgery to totally change himself, people will hesitate to assign his old identity to him because the perceptions are different.  This then has implications in morality which is in Book 2 and 3. For example: Imprisonment would be different because a criminal can change his own mentality and therefore his self can change and be a totally different entity and so he can become a different person from the one that committed the crime.The educational system should be more flexible because the you who wanted to study engineering 10 years ago is different and is a totally new self from the you now who wants to study medicine.Racism will not exist because an African person can fully adopt a mentality of a Caucasian and so his identity will be that of a Caucasian even if he looks African. An example is Islam where Indonesian and Pakistani women wear a veil as a sign that they are both under the Islamic mentality, instead of their native Indonesian or Pakistani mentality. That’s why Islam is a brotherhood where racism in theory should not exist and why it spread to poor races quickly but not to rich races, and why a Muslim will proudly say that he or she ‘is a Muslim’ with conviction more than having conviction on their nationality.",
            "date": "Answered February 25, 2020",
            "views": "385",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Randall Williams",
                    "user_href": "/profile/Randall-Williams-21"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bruce R. Bain",
                "href": "/profile/Bruce-R-Bain"
            },
            "answer_text": "Julian Baggini: Hume considers three types of argument for the soul's immortality, and demolishes them all Hume on the immortality of the soul ",
            "date": "Answered March 18, 2019",
            "views": "335",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Anubhav Balodhi",
                    "user_href": "/profile/Anubhav-Balodhi"
                }
            ]
        }
    ]
}