{
    "title": "Does quantum entanglement occur in the brain? - Quora",
    "tags": [
        "Quantum Entanglement",
        "Quantum Mechanics",
        "Human Brain",
        "Neuroscience"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Light",
                "href": "/profile/John-Light-2"
            },
            "answer_text": "“Does quantum entanglement occur in the brain?” While quantum entanglement is an aspect of most low-level physical phenomenon, it is very short range among atoms. BTW, what I’m going to say is about the same thing Ojvind Bernander wrote succinctly in his collapsed answer. The problem with a question like this is that we don’t fully understand entanglement and there is much we don’t understand about how the brain works. So let me walk you through how a scientist might approach a question like this. A scientist balances evidence for and against the idea that quantum entanglement contributes substantially to brain function. For: We know that neurons in the brain are tiny, and we know they have internal structures that are even tinier. One theory of quantum mechanical effects in the brain suggest that microtubules, which are a fundamental component for every cell, might have internal structures small enough to participate in entanglement.That’s it.Against: We have seen no evidence of quantum entanglement occurring in the brain.While a tubule is small enough to hold a quantum state, the distance between neurons is larger than we have seen sustained entanglement at body temperature.We have no theory about how entanglement would contribute to brain function.We don’t have a central mystery that quantum entanglement is necessary to solve.The mysteries we have (memory, cognition, etc.) seem to be adequately explainable with neural networks, even if we don’t yet have those explanations at hand.So we don’t reject the possibility that quantum entanglement contributes to brain function. It’s a possibility that is left in the background as we pursue more likely answers. ",
            "date": "Answered July 15, 2019",
            "views": "241",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kostea Frunza",
                    "user_href": "/profile/Kostea-Frunza"
                },
                {
                    "user_id": "Ronald Künneth",
                    "user_href": "/profile/Ronald-Künneth"
                },
                {
                    "user_id": "Steven J Greenfield",
                    "user_href": "/profile/Steven-J-Greenfield"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bert Willke",
                "href": "/profile/Bert-Willke"
            },
            "answer_text": "Here’s how that entanglement misnomer got started: By 1930 Einstein had noticed information could be found in quantum mechanical systems that could not have been communicated at speeds less than c. Of course communication is not meaningful in solutions in deterministic systems: the entire timespan of the solution is present in the state at any moment.[1] Einstein had discovered that Q.M. was deterministic just like all the rest of physics, but in that unfamiliar context he found it spooky and he said so in 1935. Schrodinger immediately coined ”quantum entanglement” in agreement. The idea that Q.M. is not deterministic stems from a misinterpretation of Max Born’s 1926 method for saying at least something about the effects of electrodynamic interactions not representable in any of the 1910–1928 Q.M. models. Lacking electrodynamics, the 1910–1928 Q.M. models have only stationary fundamental solutions. Substantial agreement with spectrographic data from real atoms shows that real atoms spend a lot of time in quasistationary states that are spectrally well approximated by the stationary states of the models. Born estimated the quasistationary state of a real atom just after an unmodelable electrodynamic interaction in terms of a stationary state modeling the real atom’s quasistationary state just before the interaction, as a linear combination of the stationary states of the models. Of course the stationary states of the models do not jump into linear superpositions of themselves: they are entirely stationary. Born’s estimate doesn’t change that. Q.M. and its solutions are entirely deterministic, just like all the rest of physics. The probabilistic interpretation has been applied to every result in Q.M. since 1926, and even to the evolution of our universe! Nope, the universe itself and all of physics are entirely deterministic: Q.M. is simply incomplete. “Spooky action at a distance” and “quantum entanglement” both describe nothing more than the determinism common to all of physics! [1] A system is called deterministic if the states of its time-dependent solutions at any moment determine the entire timespans of the solutions. Boscovich formulated the physical principle of determinism in his 1758 Theoria philosophiae naturalis, 50 years before Laplace’s brief and more metaphysical statement. ",
            "date": "Answered July 20, 2019",
            "views": "141",
            "upvotes": " Answer requested by Nilay McLaren",
            "upvoters": [
                {
                    "user_id": "Viktor T. Toth",
                    "user_href": "/profile/Viktor-T-Toth-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Stoertz",
                "href": "/profile/William-Stoertz"
            },
            "answer_text": "Well of course it occurs; biomolecules are uniquely equipped for quantum exchange of all kinds (chlorophyll just as a simple example!). But sentient beings have a communication ability many orders of magnitude below the radar of the quantum level: Cats, dogs, humans, horses, dolphins, elephants, et al. can all see ghosts and UFOs for example. And we have the gift of serendipity: The information field pervading the cosmos draws us together so that we can meet our loved ones. Love is in charge in this universe: Love and Destiny, which operate in similar dimensions. It’s like force, power, energy, work, specific impulse, moment of momentum — these are all basically similar concepts with one another, but are expressed using different differentials, derivatives, and integrals. Love, heart, emotion, spirit, soul, shimjung, destiny, han, longing, ennui, deja vu, clairvoyance, etc. — these all operate on the far-subquantum level on the margin between the metaphysical source realm and the physical vacuum. So people are well equipped to interface with a vast range of complexity and differentiation of all sorts of quantum and sub-quantum (information field) phenomena! Here’s just one experiment you’ve probably already done: You look out your window intently at someone walking by on the street below, with their back to you. Chances are they’ll sense someone watching them and turn around. Just another freebie: You’re a guy, setting in a room minding your own business. A very pretty woman enters silently from beyond your peripheral field of vision. You instinctively turn around to see her. How’d that happen? It happens a lot! Third example: You’re at church and everybody’s doing intent unison prayer. You’re supposed to keep your eyes shut. But, human nature being what it is, you open your eyes for just a moment, and, by god, another person in the big hall will have just opened their eyes in that instant and is looking straight at you! Fourth example: You’re reading a book or computer screen, and you read a word, say “역사” (history or providential work). In that same moment another teacher across from you, minding her own business, mutters exactly that word, “역사”, in that moment. It’s quite uncanny. Maybe it’s just me, or maybe it’s just Koreans… but I suspect this is a universal human phenomenon facilitated by the Law of Attraction. Love and destiny rule this world! ",
            "date": "Answered July 22, 2019",
            "views": "127",
            "upvotes": " View Sharers ",
            "upvoters": [
                {
                    "user_id": "Ethan Proulx",
                    "user_href": "/profile/Ethan-Proulx-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Morgan",
                "href": "/profile/Dave-Morgan-14"
            },
            "answer_text": "It probably does occasionally – your brain is made out of quarks and electrons after all – but it has no relevance whatsoever to the functioning of the brain. Consciousness has nothing whatsoever to do with quantum mechanics. At least not in any important or meaningful way. The processes that lead to consciousness are many levels removed from the quantum level. Trying to understand how the brain works by studying QM would be like trying to figure out why traffic jams happen by looking at brake fluid under a microscope. Yes, at some very deep level, a traffic jam is ultimately “caused by” brake fluid, but that’s not an appropriate or interesting level of description to look at. If we are say, a city planner trying to redesign an on-ramp, we need to investigate the emergent phenomenon of a traffic jam many layers of structure higher than brake fluid. Same goes for the brain. If we are interested in how the brain works, we will almost certainly never learn anything interesting or important by applying quantum mechanics. ",
            "date": "Updated July 22, 2019",
            "views": "98",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Charles Michael Turner",
                "href": "/profile/Charles-Michael-Turner"
            },
            "answer_text": "I read John’s answer and wow! Very good answer from a very concrete fundamental understanding of the current pros and cons of entanglement and the brain, I am an outside the box kinda person who thinks a little differently, This is somewhat cheap speculation lol. What about when people feel something shared in different locations? Twins or a mother’s connection to her child etc. or miracles through prayer, instant messaging? Lol statistically significant? Maybe it is how the brain quantum entangled outside or between brains? There was a Padre, Padre Pio, in the 20th century who, it was eye witnessed to give two lectures in two different countries, at the exact same time. I do believe I fully understand the mechanism of quantum entanglement, I even patented a communication system recently and there is a few interesting altercations in our understanding of, not the mathematics, but how the forces actually apply and why by having identified the underlying mechanism of gravity and the speed of light. So, if if is possible to communicate between two distant places at the same exact time, then outside or between brains there may be a way. It might be similar to birds understanding direction slightly similar. ",
            "date": "Answered July 20, 2019",
            "views": "57",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Andrew Church",
                "href": "/profile/Andrew-Church-7"
            },
            "answer_text": "No Nothing in the brain can be isolated long enough. The moment an entangled particle interacts with anything in the universe, the superpositions of the entangled objects collapses To be fair, there is talk of quantum biology, in this TED Talk, he mentions entanglement in bird navigation as an outside possibility How Quantum Biology Might Explain Life’s Biggest Questions | Jim Al-Khalili | TED Talks But chemistry is an emergent property of the quantum world, and biology is an emergent property of chemistry so all of us are ‘built’ upon quantum realities. Despite what many tell you, the quantum world IS deterministic, but it is also probabilistic. Here’s how our strict determinism world emerges from the probabilistic determinism of the quantum world Why isn't the Universe random?  ",
            "date": "Answered July 22, 2019",
            "views": "48",
            "upvotes": " Answer requested by Nilay McLaren"
        },
        {
            "author_info": {
                "name": "Charles Martinson",
                "href": "/profile/Charles-Martinson-2"
            },
            "answer_text": "From my perspective, all quantum fields represent dynamic consequences as derived from an ensembled pattern of associative entanglements which appear to produce many of the effects allied with observations related to the interpretations of quantum mechanics. So, in a very general sense, the wide-spread distributions of those relationships must also mean this structural type of entanglement necessarily exists (at quantum scales) within all the systemic cellular sub-components of the brain. But, critically, this fact alone does not support the idea that an underlying quantum reality inevitably and systemically contributes to the brain’s many specialized biological functions—or, manifestly, to other attributes of consciousness. ",
            "date": "Answered July 31, 2019",
            "views": "18",
            "upvotes": " Answer requested by Nilay McLaren"
        },
        {
            "author_info": {
                "name": "Jon Absoul",
                "href": "/profile/Jon-Absoul"
            },
            "answer_text": "Yes, entanglement occurs whenever two particles interact. Also, entanglement is “contagious”: when A is entangled with B, and B later interacts with C, A and C are now entangled. So you can be that all the atoms in the brain are entangled. Furthermore, the atoms in your brain are, by contagion, entangled with zillions of particles outside the visible universe. As Schollhauer says in his Decoherence book: entanglement is everywhere. Warning: New Age spiritualists will take this to mean all sorts of stuff that it doesn’t. Telepathy. Vibrations. Wishful thinking. We’re all connected… Entanglement is only useful when it can be very, very carefully controlled. As light and air molecules bounce off objects, skulls, brains, neurons… entanglement is not controlled. ",
            "date": "Answered August 1, 2019",
            "views": "63",
            "upvotes": " Answer requested by Nilay McLaren"
        },
        {
            "author_info": {
                "name": "Luparu Dorian",
                "href": "/profile/Luparu-Dorian"
            },
            "answer_text": "The brain is a mass of molecules that interact with no pause, and they exchange energy and information so yes, a complicated form of quantum entanglement called decoherence (information exchange by measurement) accompanied by quantum dissipation (relaxation to the ground state by loss of energy to a heat bath with many degrees of freedom) occurs between brain molecules as well as with the environment because the brain is a measurement device for the environment. Measurement devices are always entangled with the particles they measure. ",
            "date": "Answered July 23, 2019",
            "views": "17",
            "upvotes": " Answer requested by Nilay McLaren"
        },
        {
            "author_info": {
                "name": "Franz Plochberger",
                "href": "/profile/Franz-Plochberger"
            },
            "answer_text": "As Theoretical Physicist say, no. But we can´t explain it till now in our found and proofed systems. I suppose we need a step deeper in Quantum Physics. ",
            "date": "Answered July 31, 2019",
            "views": "6",
            "upvotes": " Answer requested by Nilay McLaren"
        }
    ]
}