{
    "title": "Does omnipotence require omniscience to be effective? - Quora",
    "tags": [
        "Omniscience",
        "Omnipotence"
    ],
    "response": [
        {
            "author_info": {
                "name": "Babatunde Olayinka",
                "href": "/profile/Babatunde-Olayinka"
            },
            "answer_text": "Omnipotence (power over all things) and Omniscient (knowledge of all things) are unique and independent qualities of God Almighty. He (God) does not require one quality to be present for the other quality to be effective. Each of His uncountable qualities and attributes exist independently though in unison. To be powerful, for the mortal being, will certainly require a high degree of knowledge. This is important for strategic reasons. The reverse is also true, because knowledge is power. However, for God, He existed before any knowledge. He has been before any power. All power and knowledge are therefore derived from Him and Him alone just as He created every human being, dead, alive, unborn since the time of the first creation Adam and to the last creation. So, if He created everything and everybody derives their knowledge and power from Him, both qualities of omniscient and omnipotence can exist independently of each other and still be effective. But that is with the Supreme Being. For mere mortals like you and I, we need both knowledge and power to be effective, in which case it will no longer have the term \"omni\" attached to it since it is reliant on one thing for the other to work. ",
            "date": "Answered November 23, 2016",
            "views": "239",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mahbubur Rahman",
                "href": "/profile/Mahbubur-Rahman"
            },
            "answer_text": "People could not fathom tiny things of the universe, want to understand the creator of it. This is the strength of the humankind and weakness simultaneously. Omnipotency is beyond commprehension of human knowledge. Therefore to define its characteristic will be too human. Once Vagaban Rajnish told if horse could think of a God it will be horselike. In Islam Quran says “ There is nothing like Him”. It is like a frog born and living in a well attempting to define the world. ",
            "date": "Answered November 23, 2016",
            "views": "83",
            "upvotes": "0"
        }
    ]
}