{
    "title": "Does intuition draw from a person's knowledge? - Quora",
    "tags": [
        "Intuition",
        "Knowledge",
        "Human Memory",
        "Neuroscience"
    ],
    "response": [
        {
            "author_info": {
                "name": "Frank Heile",
                "href": "/profile/Frank-Heile"
            },
            "answer_text": "The answer is NO if knowledge is defined or considered to be part of the declarative memory system of the brain.  This is a reasonable definition since we commonly say that we know something if we can describe what we know and how we know it to another person. Most people would not say that they know something if they could not use language to describe what they know and how they know it. The Wikipedia description of declarative memory is:   Declarative memory Declarative memory requires conscious recall, in that some conscious process must call back the information. It is sometimes called explicit memory, since it consists of information that is explicitly stored and retrieved. Declarative memory can be further sub-divided into semantic memory, which concerns facts taken independent of context; and episodic memory, which concerns information specific to a particular context, such as a time and place. Semantic memory allows the encoding of abstract knowledge about the world, such as \"Paris is the capital of France\". Episodic memory, on the other hand, is used for more personal memories, such as the sensations, emotions, and personal associations of a particular place or time. Autobiographical memory - memory for particular events within one's own life - is generally viewed as either equivalent to, or a subset of, episodic memory. Visual memory is part of memory preserving some characteristics of our senses pertaining to visual experience. One is able to place in memory information that resembles objects, places, animals or people in sort of a mental image. Visual memory can result in priming and it is assumed some kind of perceptual representational system underlies this phenomenon. Note that declarative memory is either stored as words or can be easily converted into words.  You can define a word (semantic), tell a story from history (episodic) or tell what you did yesterday (autobiographical).  Whereas, intuition usually has no words associated with it's wisdom and therefore intuition comes from procedural memory:  Procedural memory In contrast, procedural memory (or implicit memory) is not based on the conscious recall of information, but on implicit learning. Procedural memory is primarily employed in learning motor skills and should be considered a subset of implicit memory. It is revealed when one does better in a given task due only to repetition - no new explicit memories have been formed, but one is unconsciously accessing aspects of those previous experiences. Procedural memory involved in motor learning depends on the cerebellum and basal ganglia. A characteristic of procedural memory is that the things that are remembered are automatically translated into actions, and thus sometimes difficult to describe. Some examples of procedural memory include the ability to ride a bike or tie shoelaces. Sometimes procedural memory is called muscle memory, which is a name I hate. It is not stored in muscles and it does not ONLY have to do with taking action using muscles. I think of procedural memory as the general pattern matching capability of the brain. Pattern matching certainly is a form of memory, but it is not declarative memory.  With pattern matching  the brain remembers that in the past something similar to the current situation was encountered and it know what happened next and it also knows what could influence the current situation to produce a better outcome. It does all that without being able to explain itself in words. To my understanding, that is the wisdom of intuition. ",
            "date": "Answered April 3, 2013",
            "views": "22",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kim Huynh",
                    "user_href": "/profile/Kim-Huynh-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eva Lane",
                "href": "/profile/Eva-Lane"
            },
            "answer_text": "I think you're talking about two different things. For a baby to be able to read faces and know who to smile at and who not to smile at is instinct. This is in-built and is part of what makes us human. Intuition is developed over the course of someone's life, I believe. In many ways it is trial and error - eg. \"I feel this gut-feeling and act on it, this is the result\" versus not acting on it and the different result you would get from that. I believe that we need to train our instinct and intuition to work together over the course of our lives. It's the classic \"head versus heart\" dilemma.My site is http://www.aura-answers.com if you were interested in learning more about intuition. ",
            "date": "Answered August 24, 2011",
            "views": "119",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ryan Carlyle",
                "href": "/profile/Ryan-Carlyle"
            },
            "answer_text": "Yes, indirectly. Intuition is a form of subconscious pattern recognition. It relies on identifying patterns or conditions that are similar to what you've experienced before, even if you don't realize that you've experienced it before.  At least, that seems to be the best theory. Fairly little about the brain is known for certain. People may even mean different things when they say intuition, so it sometimes comes down to semantics. Is it knowledge if you know it, but don't know you know it? ",
            "date": "Answered April 1, 2013",
            "views": "302",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chaitanya Gaur",
                    "user_href": "/profile/Chaitanya-Gaur"
                },
                {
                    "user_id": "Dave Goff",
                    "user_href": "/profile/Dave-Goff"
                },
                {
                    "user_id": "Andrei Shostka",
                    "user_href": "/profile/Andrei-Shostka"
                },
                {
                    "user_id": "Chick Howardson",
                    "user_href": "/profile/Chick-Howardson"
                },
                {
                    "user_id": "Edward Jackson",
                    "user_href": "/profile/Edward-Jackson-44"
                },
                {
                    "user_id": "Stefan Taal",
                    "user_href": "/profile/Stefan-Taal"
                },
                {
                    "user_id": "Gurpreet Chawla",
                    "user_href": "/profile/Gurpreet-Chawla-1"
                },
                {
                    "user_id": "Judy Elt",
                    "user_href": "/profile/Judy-Elt"
                },
                {
                    "user_id": "Philippos Brugés M",
                    "user_href": "/profile/Philippos-Brugés-M"
                },
                {
                    "user_id": "Ashiquzzaman Kiron",
                    "user_href": "/profile/Ashiquzzaman-Kiron"
                },
                {
                    "user_id": "Aditya Nanda",
                    "user_href": "/profile/Aditya-Nanda"
                },
                {
                    "user_id": "John Matthew (曾鹏文)",
                    "user_href": "/profile/John-Matthew-曾鹏文"
                },
                {
                    "user_id": "Simon Brown",
                    "user_href": "/profile/Simon-Brown-8"
                },
                {
                    "user_id": "Ryan Carlyle",
                    "user_href": "/profile/Ryan-Carlyle"
                },
                {
                    "user_id": "Michael Levis",
                    "user_href": "/profile/Michael-Levis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Griffiths",
                "href": "/profile/Eric-Griffiths"
            },
            "answer_text": "Yes: it is a synergistic leap of everything you know and feel re: a certain subject or situation. Mind, that does not mean intuition is always correct.  For a good \"left brain / right brain\" analogy of this I highly recommend Thought Revolution: How to Unlock Your Inner Genius: William A. Donius. ",
            "date": "Answered April 3, 2013",
            "views": "244",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chick Howardson",
                    "user_href": "/profile/Chick-Howardson"
                },
                {
                    "user_id": "Simon Brown",
                    "user_href": "/profile/Simon-Brown-8"
                }
            ]
        }
    ]
}