{
    "title": "Does competence breed confidence or does confidence breed competence? - Quora",
    "tags": [
        "Competence"
    ],
    "response": [
        {
            "author_info": {
                "name": "Antti Vanhanen",
                "href": "/profile/Antti-Vanhanen"
            },
            "answer_text": "One doesn’t really have that much to do with the other. If competence bred confidence, competent people would never feel insecure. But read a few interviews about whoever you think is confident and you will very quickly realize that they too are insecure from time to time. Does confidence breed competence then? Well sort of, but perhaps not in the way that most people think. A lack of confidence is the result of too much thinking. It’s about focusing on ourselves rather than the task at hand. This is why so many people mix up experience with confidence, because in the beginning of doing something, we have a ton of thinking about it. Am I doing this right? What if I fail? What am I missing? How can I get better? What if I get hurt or disappointed? Instead of naturally and instinctively immersing ourselves with what we are doing (which is the most effective way to learn), we are up in our heads trying to think our way through something that isn’t intellectual in nature. As a result, we second guess ourselves more, we are stiff instead of relaxed and loose, and ultimately we learn more slowly, because we are resisting what is happening the entire time. As we get more experience, our worries, fears and excess thoughts tend to way, and what they reveal is a spacious peace that blurs the boundary between the doer and the doing. This peaceful, spacious feeling is what most people equate with confidence. This space opens up when we stop overthinking and over-trying. Said another way, when we stop resisting and worrying about the outcome and just get on with it. Perhaps you think this means experience is a prerequisite to confidence. That, in my experience, is not the case. Experience does not need to precede confidence. Confidence isn’t something that is created or acquired, but rather something that is uncovered. Confidence is our default state. It’s underneath all our excess thinking, analyzing, strategizing and worrying. It’s always there, we just have the ability to cover it up with our thinking. The more you can relax into what you are doing regardless of what is going on in your head, the quicker you will rediscover that spacious feeling (confidence) and the more effectively you will learn. How do you relax? Stop worrying about how you feel. Stop trying to figure out how it’s all going to play out. All of life is a game. Just play. ",
            "date": "Answered January 14, 2019",
            "views": "11",
            "upvotes": " View 25 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Darlene Gold",
                    "user_href": "/profile/Darlene-Gold"
                },
                {
                    "user_id": "Marnel Altius",
                    "user_href": "/profile/Marnel-Altius"
                },
                {
                    "user_id": "Teri Layne",
                    "user_href": "/profile/Teri-Layne-1"
                },
                {
                    "user_id": "Navin Tiwari",
                    "user_href": "/profile/Navin-Tiwari-7"
                },
                {
                    "user_id": "Brycen Kaina",
                    "user_href": "/profile/Brycen-Kaina"
                },
                {
                    "user_id": "Walaa Said",
                    "user_href": "/profile/Walaa-Said-1"
                },
                {
                    "user_id": "Subbaraman Sankar",
                    "user_href": "/profile/Subbaraman-Sankar"
                },
                {
                    "user_id": "Jay Jennifer Matthews",
                    "user_href": "/profile/Jay-Jennifer-Matthews"
                },
                {
                    "user_id": "Brandon Quellstein",
                    "user_href": "/profile/Brandon-Quellstein-1"
                },
                {
                    "user_id": "Abhishek Rastogi",
                    "user_href": "/profile/Abhishek-Rastogi-7"
                },
                {
                    "user_id": "Ranjan Roy",
                    "user_href": "/profile/Ranjan-Roy-3"
                },
                {
                    "user_id": "Noah Vosen",
                    "user_href": "/profile/Noah-Vosen"
                },
                {
                    "user_id": "Yaro Bril",
                    "user_href": "/profile/Yaro-Bril"
                },
                {
                    "user_id": "Uday Fotedar",
                    "user_href": "/profile/Uday-Fotedar-1"
                },
                {
                    "user_id": "Suzanne Baker",
                    "user_href": "/profile/Suzanne-Baker-10"
                },
                {
                    "user_id": "Dejan Vasilic",
                    "user_href": "/profile/Dejan-Vasilic"
                },
                {
                    "user_id": "Anna Carla Bini",
                    "user_href": "/profile/Anna-Carla-Bini"
                },
                {
                    "user_id": "Janez Kranjski",
                    "user_href": "/profile/Janez-Kranjski-2"
                },
                {
                    "user_id": "Mac Khan",
                    "user_href": "/profile/Mac-Khan-8"
                },
                {
                    "user_id": "Yousef Eissa",
                    "user_href": "/profile/Yousef-Eissa"
                },
                {
                    "user_id": "Asawari Deo",
                    "user_href": "/profile/Asawari-Deo"
                },
                {
                    "user_id": "Ankita Raikwar",
                    "user_href": "/profile/Ankita-Raikwar-1"
                },
                {
                    "user_id": "Majo Yohannan",
                    "user_href": "/profile/Majo-Yohannan"
                },
                {
                    "user_id": "Nikhil Patil",
                    "user_href": "/profile/Nikhil-Patil-136"
                },
                {
                    "user_id": "Abazid Amazama",
                    "user_href": "/profile/Abazid-Amazama"
                }
            ]
        },
        {
            "author_info": {
                "name": "Terry Hickey",
                "href": "/profile/Terry-Hickey-6"
            },
            "answer_text": "There are four ways to describe what you are asking People can have low confidence and low competence. that means they know they don’t know much about the issue and in addition have low confidence about doing anything about the issue.One can have high confidence and low competence. They are willing to do something but without the competence are unlikely to be successful.One can have low confidence but have high competence. They know the subject but low confidence means they are less likely to take action.One can have high confidence and high competence. This means they are likely to take action and be successful.In certain areas, # 2 people by taking action can learn and be successful. The exceptions are in areas where the consequences of not succeeding can result in major problems. Think of sporting endeavors that are potentially dangerous like NASCAR racing or skydiving. # 3 people hold themselves back and don’t contribute as much as they could. # 4 people have positive impacts. Remember also that confidence is a state. Some people set rules for themselves like, I have to do so many times before I can feel confident rather than being able to access the state (resource ability) beforehand. If you are already confident you are likely to be more effective. ",
            "date": "Answered January 10, 2019",
            "views": "91",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Abazid Amazama",
                    "user_href": "/profile/Abazid-Amazama"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michelle Bilton",
                "href": "/profile/Michelle-Bilton-1"
            },
            "answer_text": "I think confidence breeds competence. Think about a day when you’re feeling low. I know on days like that it’s hard for me to do basic tasks like washing my dishes. When I feel great, I not only get more done but the quality of my work is much higher. Forcing ourselves to do work in order to feel competence, or pride or prodcutive is rarely helpful - try it for yourself. Test out the theory. ",
            "date": "Answered January 11, 2019",
            "views": "23",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Abazid Amazama",
                    "user_href": "/profile/Abazid-Amazama"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cynthia Ann Leighton",
                "href": "/profile/Cynthia-Ann-Leighton"
            },
            "answer_text": "Hi. Both! When you do something, you gain confidence from the doing. As your skills improve, you gain and grow. It spills over to doing — more, better. blessings, Cynthia P.S. When you want more competence, learn and do. How to be confident includes simply getting things to happen in ways that connect you with what you’re doing. ",
            "date": "Answered January 11, 2019",
            "views": "32",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Abazid Amazama",
                    "user_href": "/profile/Abazid-Amazama"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vijayraj Kamat",
                "href": "/profile/विजयराज-कामत-Vijayraj-Kamat"
            },
            "answer_text": "Neither. Confidence is not something that you “build”. Competency is. The both are not linked. My TEDx talk should surely help you understand what confidence is truly about, and clear many doubts: TEDx - Why trying to build confidence never works ",
            "date": "Answered March 17, 2019",
            "views": "196",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Kuldeep Ghildiyal",
                    "user_href": "/profile/Kuldeep-Ghildiyal-2"
                }
            ]
        }
    ]
}