{
    "title": "Does everyone have their own philosophy? - Quora",
    "tags": [
        "Philosophy of Life",
        "Philosophers",
        "Philosophy",
        "The Human Race and Condition",
        "Understanding Human Behavior",
        "Psychology of Everyday Life",
        "Philosophy of Everyday Life",
        "Human Behavior",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Davis",
                "href": "/profile/James-Davis-119"
            },
            "answer_text": "Yes, but of course people also identify with the schools of thought that they are guided to by their experiences, circumstance, reasoning, feelings and intuition. So people generally adopt a community and the ideas that associate with it. The degree to which a person also brings highly independent and more or less original thought to their community varies greatly from individual to individual. \"Each set of religious abstractions is related, somehow, characterologically, to the person who made them; or: tell me your religion and you tell me what you are.\" Insights for the Age of Aquarius, Gina Cerminara ",
            "date": "Answered August 15, 2019",
            "views": "271",
            "upvotes": " Answer requested by Matthew Lowe"
        },
        {
            "author_info": {
                "name": "Andrew Bach",
                "href": "/profile/Andrew-Bach-9"
            },
            "answer_text": "Somehow there isn't the truest truth, somehow whatever philosophy you choose to believe in is neither in the white neither in the black, but in the greys, for all philosophies are based upon axioms. Without anyone having a philosophy you can't choose between good and bad, for philosophy (philos meaning to love and Sophia meaning wisdom) is wisdom. ",
            "date": "Answered August 15, 2019",
            "views": "37",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "V. V. Raman",
                "href": "/profile/V-V-Raman-1"
            },
            "answer_text": "Does everyone have their own philosophy? Most thinkine people imagine they have their own philosophy, not always realizing that much of it has grown from what they have read and heard. Most others don’t have a serious and cinsistent philosophy they can formulate. Peace! 15 Aug 2019 ",
            "date": "Answered August 15, 2019",
            "views": "26",
            "upvotes": " Answer requested by Matthew Lowe"
        },
        {
            "author_info": {
                "name": "Chandra K",
                "href": "/profile/Chandra-K-71"
            },
            "answer_text": "The truth is one. It is called as an absolute truth. Most enlightened people agree and understand that absolute truth. However, non-enlightened people cannot understand that truth, so each non-enlightened person understands that truth in a different way, hence, each person has different philosophy. ",
            "date": "Answered August 15, 2019",
            "views": "25",
            "upvotes": " Answer requested by Matthew Lowe"
        },
        {
            "author_info": {
                "name": "Kenyetta Tunne",
                "href": "/profile/Kenyetta-Tunne"
            },
            "answer_text": "Yes. You can think-of a belief-system as ones personal philosophy. Saying everyone has a belief-system is the same thing as saying everyone has a personal philosophy. ",
            "date": "Answered August 15, 2019",
            "views": "16",
            "upvotes": "0"
        }
    ]
}