{
    "title": "Does philosophy still have anything useful to say about science? - Quora",
    "tags": [
        "Philosophy of Science",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eugene Bucamp",
                "href": "/profile/Eugene-Bucamp"
            },
            "answer_text": "Contrary to widespread perception, science can only address relatively simple questions, essentially relative to narrow and basic physical phenomena. You could call that ground-level investigation. That leaves everything else to philosophy. Among that are many questions relative to science itself as an object of investigation. Whether philosophical ideas are useful is a loaded question. How do you measure usefulness in this instance? Philosophy is one of the way human beings try to make sense of the world, and I don’t think we would want to deprive ourselves of this resource, particularly as we are getting into a phase of humanity where the problem becomes increasingly humanity itself. ",
            "date": "Answered October 6, 2019",
            "views": "39",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William Stoertz",
                "href": "/profile/William-Stoertz"
            },
            "answer_text": "Philosophy has a lot to advise science. Philosophy must remind science to get back to where it started from. Plato shared the “Allegory of the Cave.” The story can be used in many ways, but it points to a transcendental reality that people readily deny, including scientists. Also it describes two paths to truth: the ascending path (induction) and the descending path (deduction). Contemporary science is long on experimental data and short on theory. Many scientific descriptions of reality, its relations and mechanics are empirical or statistical in nature. These two approaches need to be balanced. We need a clear working model for what is happening under the surface of the quantum realm. A good course on science should begin with the philosophy of science. Without inner wisdom and scientific intuition, we may be like bad students who see things outwardly but lack inward insight. ",
            "date": "Answered October 6, 2019",
            "views": "72",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "María Luisa Colledge",
                    "user_href": "/profile/María-Luisa-Colledge"
                },
                {
                    "user_id": "Trevor Jardine",
                    "user_href": "/profile/Trevor-Jardine-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel E Hofford",
                "href": "/profile/Daniel-E-Hofford"
            },
            "answer_text": "Of course it does. Science is the process of discovering what ‘is.’ That’s only 1/2 of what we need as sentient creatures. After we know what ‘is,’ we want to know what it ‘means.’ To understand what ‘it’ ‘means’ is to apply creative, intelligent thought and imagination. The more intelligent, the more knowledgeable the mind, the more creative the mind that looks at meaning, the more we find the ‘is’ connected to human life, embedded in the human experience and able to tease out the good and the beautiful, and for that we are all enriched and better off. ",
            "date": "Answered October 6, 2019",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Brown",
                "href": "/profile/John-Brown-2633"
            },
            "answer_text": "This question and variations of it keep showing up on Quora. Science does not explain itself. Science is just applied Common Sense with a lot of experiments. What every you conclude from the data you accept has to have statistics applied to it, so the data does not speak directly to you. The data you have gathered is dependent upon being observed via your senses or machines that extend your senses, there could be all sorts of things going on that we have no notion of their existences. Why do you think the neurons in your brain, my brain and everyone else’s brains are sufficient to understand the “truths” of the Universe, why should that be the case ? So yes, Philosophy is quite beneficial to Science. ",
            "date": "Answered October 6, 2019",
            "views": "46",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Earl Wajenberg",
                "href": "/profile/Earl-Wajenberg"
            },
            "answer_text": "Yes, plenty. For instance, questions about what to do with the findings of science fall under ethical philosophy. So do questions about how to do science ethically, e.g. with testing on human subjects or animal subjects, and which animal subjects. Then there are situations like the current fashion for multiverses. In many cases, the alternate universes are taken to be forever unobservable. In that case, can they properly be part of a scientific theory? Whichever answer you give, the question is one of philosophy of science. Also, the multiverses are, in some cases, proposed a the obvious and economical solutions to one problem or another. But are vast or infinite arrays of (unobservable) universe “economical”? Another philosophical question. And so on. ",
            "date": "Answered October 6, 2019",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Leopold",
                "href": "/profile/Michael-Leopold-3"
            },
            "answer_text": "My experience with philosophy has largely been in taking classes in metaphysics / philosophy of the mind, so I only have a partial perspective on this. But I’d say that there are major implications of this field in neuroscience. Specifically, insights from philosophy are being used to inform neuroscience research on things like free will, the nature of consciousness, and emotions. I’m overly simplifying this a bit, but essentially, armchair philosophers create the hypotheses which scientists can then empirically test. This has led to the emergence of new interdisciplinary fields such as the Philosophy of Neuroscience, Neurophilosophy, and Neuroethics. There is also an increasing number of philosophers and psychologists working side-by-side in academia to better understand human behavior and motivations. You can find a larger discussion here: The Philosophy of Neuroscience ",
            "date": "Answered October 6, 2019",
            "views": "242",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Khuram Rafique",
                "href": "/profile/Khuram-Rafique"
            },
            "answer_text": "Following two hard facts have been recently pointed out by Philosophy and scientists are silent like they did not even listen. Farthest visible galaxies are actually located at (light travel) distance scale of hundreds of billions light years.Dark Matter is there due to simple mistake of scientists who wrongfully applied irrelevant Newton’s Theorem XXXI instead of applying correct relevant Theorem XXXIII.",
            "date": "Answered October 6, 2019",
            "views": "99",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ivica Pesun",
                    "user_href": "/profile/Ivica-Pesun"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tim Harding",
                "href": "/profile/Tim-Harding-7"
            },
            "answer_text": "Yes, there is a whole branch of philosophy called the Philosophy of science. ",
            "date": "Answered October 6, 2019",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Earl Wajenberg",
                    "user_href": "/profile/Earl-Wajenberg"
                }
            ]
        }
    ]
}