{
    "title": "Does the description depend on the properties of the object? If there are no properties, can't we give a description of a thing? - Quora",
    "tags": [
        "Properties",
        "Descriptions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gilbert Duy Doan",
                "href": "/profile/Gilbert-Duy-Doan"
            },
            "answer_text": "You can talk about the object in at least two ways. The first is to focus on the object and deduct how that object is formed, arranged, or made through analyzing its parts and their relationships. Each part should be mostly indivisible and able to stand on its own, with some contextual or background knowledge that may come from other areas, though by itself be quite basic. Then there are relations formed from each part to another, which helps us understand how this object is constituted. Having a part-to-whole analysis should give us a better grasp of how the whole operates or functions, and how we can identify specific parts when given conditions specific to that part. That is isolating problem areas and working on the part separately so we can bring back a functional part to the whole and make it work again. The latter way is to use the object as its own whole, however abstract, generic, or common that is, without analyzing the parts, wherein it may already be obvious what parts constitute this object. We just may not have a firm grasp on the basics of the object, only that we want to establish how this object as a whole relates to other objects. It is recommended these relations and additional objects are within some context, which is utility dependent, showing us what we use these objects for and how they work together. It is again working off the analytical portion, though at a higher level of abstraction because we take the original object as one. This helps us describe the object in relation to other objects, which the person may be familiar with or know much better, and therefore can infer how to use this object. The person wants a description to understand the object better, so relating it to what objects and their relations the person knows, can help them fill in the utility gaps. ",
            "date": "Answered June 22, 2020",
            "views": "55",
            "upvotes": " Answer requested by Shrief Khaled",
            "upvoters": [
                {
                    "user_id": "Stephen Simon",
                    "user_href": "/profile/Stephen-Simon-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Allen Stairs",
                "href": "/profile/Allen-Stairs"
            },
            "answer_text": "I’m assuming that the background issue here is nominalism about properties. If the nominalists are right, then there are no properties. But nominalists certainly think that we can say things like “The car in front of the house is red” or “electrons have a mass of [math]9.11 \\times 10^{-31}[/math]kg.” Roughly, what they think is that there are no independently-existing Platonic properties, and there’s nothing in reality that favors one way of classifying things over another. But we can classify things, and once we have, some descriptions will be correct and others won’t. Whether nominalism is defensible all things considered is another question, of course. ",
            "date": "Answered June 22, 2020",
            "views": "54",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Bruce Barron",
                "href": "/profile/Bruce-Barron-1"
            },
            "answer_text": "The description of a thing or its definition tells us its essential characteristics. The definition is concerned with the nature of the object. Now the nature makes a thing to be what it is and the nature operates in the definition. Man is a rational animal tells us his nature and how he functions~~! in contrast to irrational animals that operate only on the sense level. The aim of science is to define things. Now properties do no enter into the essential definition of a thing but flow from its nature. Laughter is found only in man or carpentry but these do not fit into his definition although they flow from his nature. Water’s definition is it is a liquid composed of 2 parts hydrogen and one part oxygen. This doesn't tell us anything about its properties. But everything that exists has attributes or properties. So the definition does not flow from the properties and we can know the definition without knowing its properties. ",
            "date": "Answered June 28, 2020",
            "views": "18",
            "upvotes": " Answer requested by Shrief Khaled"
        }
    ]
}