{
    "title": "Does phenomenology have any relevance for the modern world? - Quora",
    "tags": [
        "Maurice Merleau-Ponty (philosopher, author)",
        "Edmund Husserl",
        "Martin Heidegger (philosopher, author)",
        "Modern Philosophy",
        "Phenomenology (philosophy)",
        "Worldview",
        "Modern World",
        "Philosophers",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Week",
                "href": "/profile/David-Week-1"
            },
            "answer_text": "Does phenomenology have any relevance for the modern world? I think so. One of phenomenology’s key insights are that the world consists first of experience, and only secondarily of atoms and light waves and other theoretical constructs we use to explain and control that experience. This is the lifeworld. Another, due primarily to Heidegger, is that we are not transcendental, thinking selves observing the world, but fundamentally part of it, enmeshed in it, conditioned by it. Heidegger coined the term Dasein for the condition of being human, which translates as “being there”. It also translates into English as “being-in-the-world.” What’s radical about this concept is, as one writer put it, the “in” in being in the world is not the spatial “in” of the “the water is in the bottle”, but more like the “in” in “being in love.” Sorry if this is an inadequate explanation of a difficult term, but once you “get it”, you’ll see that Heidegger is just describing our ordinary experience of being in the world, which is not as separate being with a distinct boundary, but as (another metaphor) “in-volved” in the world. (They hyphen is intentional.) All of this seems strange until you finally get shaken out of the culturally received idea that we are autonomous minds spatially located in a material world. Heidegger has this idea that—even since Plato, about 2500 years ago—Western civilisation has been suffering for a forgetfulness of being: what it means to “be”. The West has been captured by Platonic Idealism: that we inhabit a shadow world, and behind or elsewhere is a true Realm of Forms (or Ideals) of which the lifeworld is but a bad projection. Platonism was given another form by Descartes, who concieved the world as spike between subjective perception and objective reality. Subjective perception is the shadow world as presented to the sentences. Behind that is the real world, unseen. In order to check that our perceptions are correct, we need to develop a method, which Descartes took from the analogical reasoning of Euclid. Euclid’s geometric proofs often deployed ratios: A is to B as C is to D. It’s from this “thinking by ratios” that we get the term “rationality.” Science is a built on Platonic and Cartesian worldview. Things are not as they seem. Behind them, unseen, is another, more perfect world of invariants or ideals. In science, these the laws of physics, and the often invisible and abstract objects of physics: waves, radiation, particles, quanta, etc. So in the once, much that is good in Western culture is built on this separation of self from world: science, and the idea of progress, that we can arrive at progressively more “accurate” pictures of the world, and thereby control it to human ends. It’s hard to imagine the modern world without these ways of seeing the world. However, each way of seeing the world also has its blindspots: what cannot be seen or done from within that worldview. And in science, we see not only transformational power of the world, but a corresponding difficulties in the relationships between humans (world wars, industrialised killing, mutually assured destruction) and between humans and nature. Being more rational, and more scientific, and more technological, and more controlling, has not so far resolved these difficulties. By providing a fundamental different way of seeing the world, phenomenology provides us with a tool for conceptualising problems and solutions, and even ways of living, which lie outside the Platonic-Cartesian worldview of fundamental human separation from others and from the environment. Some provisos: First, phenomenology was originally conceived by Husserl, who in so doing did not in fact break from the Platonic Cartesian world view. Husserlian phenomenologists today talk as though by close observation of the elements of experience, they are describing some objective reality through what is a “better” scientific method: phenomenological reduction. Husserl did not escape the Platonic-Cartesian worldview. He is in fact sometimes referred to as “the last Cartesian”, and his final work was titled “Cartesian meditations. But those followed—Heidegger, Gadamer, Merleau-Ponty, Rorty, Maturana, Taylor, etc. springboards off Husserl’s work to go beyond Cartesianism. And all their writings incorporate a phenomenological stance. Second, Heidegger, in the way that he tells this story, incorporate a fundamental nativism: first, there was a “natural” or essential understanding of being; then, thanks to Plato et al, and the cultural change they were part of, this natural understanding was lost; finally, it is time to recover it. This kind of idea that there is a natural or essential being to things which has been lost is in my view the kind of thinking that made Heidegger vulnerable to Naziism, which saw the world in terms of an original “Aryan” civilisation which had been lost or corrupted (largely due to Jewish influence) and now had to be recovered. What’s useful is phenomenology that gets past the errors of Husserl and Heidegger. No essences, no transcendental egos, no objectivity of experience, no foundationalism, no divided world. ",
            "date": "Answered March 2, 2020",
            "views": "111",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Fernando Barbosa Barros",
                    "user_href": "/profile/Fernando-Barbosa-Barros"
                },
                {
                    "user_id": "Sean Taylor",
                    "user_href": "/profile/Sean-Taylor-59"
                },
                {
                    "user_id": "Dixie Golden",
                    "user_href": "/profile/Dixie-Guill-Golden"
                },
                {
                    "user_id": "Adam Alonzi",
                    "user_href": "/profile/Adam-Alonzi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ingrid Harris",
                "href": "/profile/Ingrid-Harris-3"
            },
            "answer_text": "Most certainly. “This conception connects to the central, original idea of the book, namely, the view of cognition that we call enaction or the enactive approach (mentioned at the outset of this introduction). In formulating the enactive approach, we drew on multiple sources: the theory of living organisms as self-producing or “autopoietic” systems that bring forth their own cognitive domains; newly emerging work on embodied cognition (how sensorimotor interactions with the world shape cognition); Merleau-Ponty’s phenomenology of the lived body; and the Buddhist philosophical idea of dependent origination, and specifically that cognition and the experienced world co-arise in mutual dependence. The basic idea of the enactive approach is that the living body is a self-producing and self-maintaining system that enacts or brings forth relevance, and that cognitive processes belong to the relational domain of the living body coupled to its environment.28 One implication of this idea is that cognition requires the exercising of capacities for skillful action and that even abstract cognitive processes are grounded on the body’s sensorimotor systems, including the brain systems that, as we would say today, emulate sensorimotor processes in an “offline” way. Today, this idea of cognition as based on modal sensorimotor processes is central to the approach called “grounded cognition,” where “grounded” means based on body states, situated action, and modal perception-action systems.29 From the enactive perspective, mindfulness practices should be viewed as forms of skillful know-how for enacting certain situated mind–body states and behaviors, not as a form of inner observation of a private mental realm. Notice that this contrast—between understanding mindfulness meditation as a kind of enactive cognition versus as a kind of inner mental observation—is a conceptual and phenomenological one. Notice also that each conception has implications for cognitive science. On the one hand, thinking of mindfulness meditation as inner observation of a private mental realm feeds the internalist tendency in cognitive neuroscience to model mindfulness as a kind of mental activity instantiated in neural networks inside the head and visible through brain imaging tools such as electroencephalogram (EEG) and functional magnetic resonance imaging (fMRI). This approach runs the risk of confusing the biological conditions for mindfulness with mindfulness itself, which, as classically described, consists of the integrated exercise of a whole host of cognitive and bodily skills in situated and ethically directed action.30 On the other hand, thinking of meditation as the enactment of situated mind–body states and behaviors requires us to distinguish clearly between the causally enabling conditions for mindfulness, which include neural systems but are not limited to them, and the cognitive processes that constitute mindfulness as a meaningful form of human experience and that cannot be fully understood unless described phenomenologically. This is one way in which thinking through the enactive approach returns us to the phenomenology of lived experience as a necessary complement to scientific investigation.” Cited from:  ",
            "date": "Answered March 8, 2020",
            "views": "284",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nathaniel Spanne",
                    "user_href": "/profile/Nathaniel-Spanne"
                },
                {
                    "user_id": "Rex Styzens",
                    "user_href": "/profile/Rex-Styzens"
                },
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                },
                {
                    "user_id": "Poppy Fielding",
                    "user_href": "/profile/Poppy-Fielding"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Christopher",
                "href": "/profile/Tom-Christopher-5"
            },
            "answer_text": "Good question. When a man is in a public place, (say standing waiting for a train) and catches a glimpse of a particular woman as she passed by, with a particular look about her that absolutely “intoxicates” him, it’s fair to say that experience “affects” him. Especially if she randomly looks at him and smiles. He remembers it. A physiologist can explain the experience one way, from an objective perspective, describing all the various chemical reactions and evolutionary adaptations that occur in the brain that make the experience intoxicating and memorable. However there is someone else about that experience that makes the man “experiencing” it feel more “alive” at that moment than if it never happened and he continued standing there in public, waiting for a train feeling bored. Another example; it is one thing to look at a beautiful sunset and understand the physics and environmental factors that cause it. It is another thing to look at it and feel an experience of “momentarily loosing yourself and your concerns for a moment in enjoying its Beauty.” That is Phenomenology in its simplest definition. Phenomenology is experience and your perception of yourself through the relationship you have with that experience. What else are you, from your emotional, subjective, self perception of you that isn’t a phenomenological experience? For philosophers like Heidegger and Hegel we ARE nothing more than momentary phenomenological experiences. ",
            "date": "Updated August 24, 2020",
            "views": "97",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Anamarija Podrebarac",
                    "user_href": "/profile/Anamarija-Podrebarac-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mathe Molusi",
                "href": "/profile/Mathe-Molusi"
            },
            "answer_text": "The classical phenomenological approach focuses on the world appearing to us through our stream of consciousness as a configuration of meaning. Elements of consciousness, i.e., perceiving, willing, thinking, remembering, anticipating, etc., are our modalities of self-world relationship. They give us access to our world and to that of others by reflecting on the content (i.e., its meaning or the what), which we thus encounter, and also by reflecting on the process (i.e., the how). What makes an experience conscious is a specific awareness one has of the experience while living through or performing it. Specific refers here to a direct investigation and description of phenomena as consciously experienced, “without theories about their causal explanation and as free as possible from unexamined preconceptions and presuppositions” (Spiegelberg, 1975, p. 810). With this orientation, phenomenology refers not only to a philosophical inquiry, but serves also in an adapted way research purposes and methodological pursuits. Being a specific research methodology, it is striving to portray phenomena from the personal and contextual perspectives of those who experience them. Accordingly, classical phenomenology – as initiated by Edmund Husserl (1859 – 1938) – approaches phenomena by studying conscious experience as experienced from the subjective or first person point of view along with relevant conditions and horizons of experience, within the larger sphere of the unified field of a person's consciousness and existence; “the psycho-cosm” (Eckartsberg, 1981). Accordingly it basically represents a philosophy that considers anything appearing to consciousness as a legitimate field of inquiry (Stewart & Mickunas, 1990, p. vii). So yes, it does. ",
            "date": "Answered March 8, 2020",
            "views": "42",
            "upvotes": " Answer requested by Adam Alonzi",
            "upvoters": [
                {
                    "user_id": "Ingrid Harris",
                    "user_href": "/profile/Ingrid-Harris-3"
                },
                {
                    "user_id": "David Week",
                    "user_href": "/profile/David-Week-1"
                },
                {
                    "user_id": "Adam Alonzi",
                    "user_href": "/profile/Adam-Alonzi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kyle Breaux",
                "href": "/profile/Kyle-Breaux-7"
            },
            "answer_text": "Phenomenology would have relevance in any age of the world. It is probably the most effective philosophy ever developed as an alternative to accepting nihilism in lieu of transcendentalism. According to Phenomenologists like Merleau-Ponty, human action can’t help except be meaningful and carry value. Because nothing humans do is outside of some union with other objects. If you are looking at a painting for example- you and the painting are actually joined in a meaningful union at that time. This meaningful, engaged union between two material bodies is what philosophers call a gestalt. If this theory of gestalt is correct- it would solve several current philosophical problems. In the first place, it would soundly defeat Cartesianism, which put forth that we are an independent mind, and mind is actually a substance of some sort. That would allow us to bypass Kant’s observation about qualia as well, which presently restrains many modern philosophers from calling impressions objective. There are a lot of current problems and conundrums in Philosophy that Phenomenology could resolve. It is really a very excellent school of thought, but any philosopher favorable to it will have their work cut out to get others to drop Cartesian and Kantian assumptions about impression forming. ",
            "date": "Answered February 23, 2020",
            "views": "95",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Week",
                    "user_href": "/profile/David-Week-1"
                },
                {
                    "user_id": "Adam Alonzi",
                    "user_href": "/profile/Adam-Alonzi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Lynch",
                "href": "/profile/Robert-Lynch-126"
            },
            "answer_text": "Of course it does. Studying the subject of a person’s experience allows us to delve deeply into the meaning of consciousness. We really don’t know exactly how or why we have consciousness and phenomenology could well be the key to discovering the answer to this mystery. Good question. Thank you for asking it. ",
            "date": "Answered February 21, 2020",
            "views": "74",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Week",
                    "user_href": "/profile/David-Week-1"
                },
                {
                    "user_id": "Adam Alonzi",
                    "user_href": "/profile/Adam-Alonzi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Haluk Berkmen",
                "href": "/profile/Haluk-Berkmen"
            },
            "answer_text": "Phenomenology is based on the observation of phenomena. That is, facts and events. But observing the external world is only part of what we call “reality”. Reality is also affected or stuctured from our preconceptions, our beliefs and our ideologies. Without considering the internal (subconscious) content of reality, there can never be a total understanding of what is real. So, in my opinion, phenomenology has a limited power in explaining the human consciousness. ",
            "date": "Answered February 21, 2020",
            "views": "53",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Doruk Denkel",
                "href": "/profile/Doruk-Denkel"
            },
            "answer_text": "No. But if you strive for being employed as a court intellectual, you might join the ranks to inflate it. ",
            "date": "Answered March 8, 2020",
            "views": "34",
            "upvotes": " Answer requested by Adam Alonzi"
        },
        {
            "author_info": {
                "name": "David Weihe",
                "href": "/profile/David-Weihe"
            },
            "answer_text": "It is absolutely important if you have a senitient bomb (as in Dark Star) that insists on detonating before its time. ",
            "date": "Answered February 21, 2020",
            "views": "32",
            "upvotes": "0"
        }
    ]
}