{
    "title": "Does faith consist in just believing in a holy book? - Quora",
    "tags": [
        "Sacred Books",
        "Faith and Religion",
        "Faith",
        "Religious Beliefs",
        "The Bible",
        "Belief and Beliefs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Douglas Duby",
                "href": "/profile/Douglas-Duby"
            },
            "answer_text": "No, it requires more than just thinking that what is said in a Bronze Age book is the truth. It requires actions as well because to prove you really believe you will need to do something. Faith in JESUS CHRIST, is living by his words, following his examples and believing the the father with the true hearts. What do you think, “I am the way; the truth and the life” means? You think it is just to prove Jesus is God or somehow shouting his name in churches would create some connections between and the father? Absolutely bull crap. That is not how one is expected to believe in Christ. To believe in Christ you don’t just think he is real and is right about everything(you will do that passively if you follow his examples) but you LIVE WITH HIM. LIVE LIKE HIM. This comes down to the debate whether Jesus was God or not, but the answer to that is, there isn’t much to say. Jesus is a man, as we know it, but he is the perfected man, made in the image of God. Men(Adams) were made in the images and likeness of God but God did put some flaws in us, that we may lie and fail, but you see, we don’t see any of that in Christ at all. Who is Christ after all? The SON OF GOD(image of what he expects the rest of us to be)…. Well, there isn’t much to say, really, apart from the fact we know he is equal to the father as being referenced as the husband of Israel multiple times, we know “no distinction” between the two can be made. What is a man if he “and thine eyes shalt be opened and thou shalt be like the Gods”, knowing God made most of us in his pictures? Jesus said, in his name, we can move a mountain. What are we? Complete faith = ascension to Godhood(comets unto the father). Jesus is to perfect us to be like our father, and to prove your faith you need to live by him. Saying “faith” without trying to acknowledge his commandments and do his works to prove your so-called “faith” isn’t going to help you. Believing that he wrote the book but leaving it behind is the same as saying it is not credible, ie you are an unbeliever. In case you are with the people I despise read these words: calling yourself a Christian while marching with BLM and burning down an entire city instead of going to help black children in Africa or shedding some lights on black unemployment doesn’t do Christ any favor; so doesn’t trying to prove you are not racist by allowing immigrants to enter Europe and racially interbreeding(Condemned by God) with them; so doesn’t worshipping jews as Gods; so doesn’t literally going around calling death for innocent Palestinians(yes most of the people you think are terrorists are actually innocents living their lives in a desert); so doesn’t lashing out at any muslim you come across thinking he is a heretic while he might love Jesus more than you ever do; so doesn’t hating on muslim countries in the Middle East for their “false” belief when most of them condemn sodomy(abomination) but you do endorse that in your damn country; so doesn’t dismissing the human rights issues in Saudi Arabia(which I almost dismiss because I want to go with the laws of Yahweh) while condemning more tolerant countries like Russia, Poland, Bulgaria, Iran and many others; so doesn’t wishing deaths for Iranian people simply because they don’t seem to worship ‘The State of Israel’ just because God chose Jacob Israel(a blood line not a country) when, in case you don’t know, MANY OF THOSE MUSLIMS ARE THE TRUE ISRAELITES WHO STAYED THERE SINCE THE FALL OF ASSYRIA AND BABYLON(not saying Israelites don’t settle anywhere else because they do) hence: “and I shall put an end to all the nation to where I have scattered you but I will not make the full end of thee”; and so doesn’t accusing atheists, Catholics, Mormons, Muslims and everyone else of idolatry while you worship Fox News, Trump(a Devil), your own iPhone, the media, your guns, your face masks and all the bs more than you worship Christ. ",
            "date": "Answered September 14, 2020",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kym Palmer",
                "href": "/profile/Kym-Palmer"
            },
            "answer_text": "No, Max. Nothing about faith is that simple. The human writers of the Bible have recorded their reasons for their authorship. It always indicates that they are preserving the revelation of God Himself to humanity so that we can all receive His eternal Life through believing His message. Let’s look at a few together. John 20:30-31 Now Jesus did many other signs in the presence of the disciples, which are not written in this book; but these are written so that you may believe that Jesus is the Christ, the Son of God, and that by believing you may have life in his name. 2 Timothy 3:14-17 But as for you, [Timothy] continue in what you have learned and have firmly believed, knowing from whom you learned it and how from childhood you have been acquainted with the sacred writings, which are able to make you wise for salvation through faith in Christ Jesus. All Scripture is breathed out by God and is profitable for teaching, for reproof, for correction, and for training in righteousness, that the man/woman of God may be complete, equipped for every good work. So, while the book leads us to the message of God, it’s then up to us to take hold of the message and begin a spiritual relationship with the God of the message. Believing the words of the message is only the first step. Believing in the One Who sent the message is the real goal. ",
            "date": "Answered August 28, 2020",
            "views": "16",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Kelly Rabbitt",
                    "user_href": "/profile/Kelly-Rabbitt"
                }
            ]
        },
        {
            "author_info": {
                "name": "Caleb Griffith",
                "href": "/profile/Caleb-Griffith-8"
            },
            "answer_text": "I appreciate one of the other answers, which pointed out that there are many varying definitions of faith. Here’s what I call “faith”. Faith is not just accepting whatever a “holy book” says just because that’s my religion’s holy book. Faith is not just believing something that there’s no evidence for. My faith is based upon evidence- logic, reason, science, observation, history, etc. Here’s a way I like to put it- I believe in God for the same reason I believe the wind is blowing when looking out my window. I cannot see the wind, smell the wind, taste the wind, or hear the wind (unless it’s crazy out there!!). Nor can I feel the wind from inside my house. But I can see the trees shaking, and I can see the leaves flying across the yard. While I cannot scientifically observe the wind itself, I -can- observe the evidences of it: through the effect that it has. While I have never scientifically observed God himself, I have scientifically observed the evidences of God and the effect He has had. That’s why I believe.I also believe in the divine inspiration of the Bible because of the mindblowing evidence to support such. Scientific foreknowledge, prophecies that have historically come true, logical consistency and singular focus even though written by many authors over thousands of years, and more. When it comes to the book itself, faith isn’t just accepting whatever it says. Faith involves belief based upon evidence, logical discernment of truth, and THEN trusting in the things that don’t make as much sense, because of the things which do. Then, faith involves a logical reaction to that belief- what should I do because of this? Here’s how I define “faith”, and it happens to be a definition that fits what the Bible (our “holy book”) describes as faith. Faith is belief, trust, and action, based upon critical thinking in response to logical truth and evidence. To use the words of the Bible itself, “faith is the substance of things hoped for, the evidence of things not seen.” ",
            "date": "Answered August 28, 2020",
            "views": "32",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Hough",
                "href": "/profile/James-Hough-1"
            },
            "answer_text": "+JMJ+ No, not at all! Faith is a gift from God in your baptism. It has nothing to do with a book. from A Catholic Dictionary, edited by Donald Attwater, Second edition, revised 1957 Faith. i. The object of belief; the sum of the truths taught by the Catholic religion. ii. A theological virtue (Virtues, The Theological. Supernatural gifts enabling man to attain his final destiny, so called because they have God—the object of our faith, in whom we hope, whom we love—for their immediate object; three in number: faith, hope, charity.) by which our intellect is disposed to assent firmly to all the truths revealed by God, because of the infinite truth and wisdom of God who can neither deceive or be deceived. The words of St. Paul (Heb. xi, 1), Faith is “that which gives substance to our hopes, which convinces us of things we cannot see” make a convenient definition of faith, and all other definitions are a development of this. “If you would reduce the words to the form of a definition, you might say: Faith is a habit of the mind by which eternal life is begun in us, in that it makes the intellect assent to things which appear not . . . the fact that it is called evidence (argumentum) distinguishes faith from opinion, suspicion, and doubt, in which here is no firm adhesion of the intellect to anything; the fact that it is ‘of things which we cannot see,’ distinguishes it from knowledge and understanding, by which a thing becomes apparent. The fact that it ‘gives substance to our hopes’ distinguishes the virtue of faith from faith in common acceptance, which is not ordained to any hoped-for happiness” (St. Thomas, II-II, iv, 1). “Since faith rests upon infallible truth and the contrary of a truth can never be demonstrated, it is clear that the arguments brought against the faith cannot be strict demonstrations, but the difficulties that can be answered” (St. Thomas I, 1, 8c), or in the words of Cardinal Newman, “Ten thousand difficulties do not make one doubt.” iii. Justifying. Faith is necessary for justification, but it must be true faith and not merely the confidence which Luther depended upon: “If anyone say that justifying faith is nothing else than confidence in the divine mercy which remits sins on account of Christ . . . let him be anathema” (Council of Trent, sess. vi, can 12, de justificatione); “Go out all over the world and preach the gospel to the whole creation. He who believes and is baptized will be saved; he who refuses belief will be condemned” (Mark xvi, 15, 16). And for salivation this faith must be informed by charity. ",
            "date": "Answered August 29, 2020",
            "views": "25",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Marina Teodoro",
                    "user_href": "/profile/Marina-Teodoro"
                },
                {
                    "user_id": "Carolyn Barratt",
                    "user_href": "/profile/Carolyn-Barratt"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karl Broberg",
                "href": "/profile/Karl-Broberg"
            },
            "answer_text": "Faith is trusting in what one has good reason to believe; it’s a choice. The Bible’s definition is that faith is the assurance of things hoped for, the substance of things not seen (cf. Heb. 11:1). We all have faith, even if just in the pilot of a plane or chef in a restaurant. Biblical faith is trusting in God, not just the Bible. “Trust in the LORD thy God with all thine heart, lean not unto thine own understanding, in all thy ways acknowledge Him ….” (cf. Prov. 3:5).. We all believe in something that cannot be proven, even Secularists who believe in science (for example trusting in evolution based on the writings of Darwin’s Origin of Species). Both atheist and Christian are people of faith, therefore, because they both have unproven presuppositions. You cannot prove beyond a shadow of a doubt either is right. To have a religion, you should have a holy book and that’s why Humanism is considered a faith also because they trust in certain high priests of their “religion” and have “holy books’ and it has been declared a religion by the Supreme Court. Every worldview is a faith in this sense; for example, communism trusting in the writings of Marx, especially Communist Manifesto and Das Kapital. You must be willing to turn your faith or creed into deeds to be true to it. Faith without works is dead! We are in turn judged by our works of faith, not our faith per se. We must authenticate our faith with fruit; no fruit equals no faith. We shall know them by their fruits. ",
            "date": "Answered August 28, 2020",
            "views": "31",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Edward Jeffries",
                    "user_href": "/profile/Edward-Jeffries-6"
                },
                {
                    "user_id": "BlueShower Globe",
                    "user_href": "/profile/BlueShower-Globe"
                },
                {
                    "user_id": "Miguel Malfabon",
                    "user_href": "/profile/Miguel-Malfabon"
                },
                {
                    "user_id": "Chidera M. Oziri",
                    "user_href": "/profile/Chidera-M-Oziri"
                },
                {
                    "user_id": "Charles Reeves",
                    "user_href": "/profile/Charles-Reeves-43"
                },
                {
                    "user_id": "Douglas Duby",
                    "user_href": "/profile/Douglas-Duby"
                },
                {
                    "user_id": "Milan Woodson",
                    "user_href": "/profile/Milan-Woodson"
                },
                {
                    "user_id": "Edward Banning",
                    "user_href": "/profile/Edward-Banning"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jason McMahon",
                "href": "/profile/Jason-McMahon-6"
            },
            "answer_text": "Below are some of the answers I have provided regarding faith. They will make abundantly clear that the holy Book is God’s love letter to humanity. And it is faith in that adorable Trinity that holds my allegiance – no the Bible itself. Any more than a letter from my lover would. Since the Bible is from God’s perspective, the covenants He made and we broke are spelled out in great detail. This is for our benefit, so we don’t make the same mistakes His Chosen People did. But as it is, we don’t seem to learn the lessons very well and are forever dropped to our knees when we realize how foolish we have been. * Faith & The Bible * Jason McMahon's answer to What does the Bible say faith is based on? Jason McMahon's answer to Would you rather have grace or faith? Jason McMahon's answer to Is it fair to say that faith gives you a reason and truth is what you believe in? Jason McMahon's answer to How does it feel for you to dwell in the Spirit on a daily basis, the Holy Spirit spoken of in the Bible, and how do you do this? Jason McMahon's answer to Do you agree the Torah (Instructions) of Yah is Spiritual, and we who walk in faith should follow the Torah of Yah as His perfect Son Yahshua Ha'Mashiach provided His followers an example on how to walk in spirit and truth? Jason McMahon's answer to Can you faithfully belong to two churches? Jason McMahon's answer to What has restored your faith in humanity? Jason McMahon's answer to According to Protestants, what is the \"one faith\" of Ephesians 4:5? ",
            "date": "Answered August 29, 2020",
            "views": "1",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Amit Mathews",
                    "user_href": "/profile/Amit-Mathews-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Klara Fortune",
                "href": "/profile/Klara-Fortune"
            },
            "answer_text": "Hello, This is a fantastic question! First, I think that the answer depends on your own definition of ‘faith’. My definition of faith consists of ‘believing in something that cannot be definitively proven by science’. For example, I have faith in myself, and in psychic readings, and in the law of attraction. These things cannot be definitively proven, but yet they also don't come from a holy book. Religions tend to make their own definitions for vocabulary words that oftentimes don’t match up to more secular definitions, so your definition of ‘faith’ can be drastically different from another individual’s definition. Also, many people are spiritual but not religious, so they have faith in a higher power, but do not associate that higher power with any god from any religious belief system. I think what is interesting to explore is the difference between faith and belief. To me, these two terms are roughly synonymous with each other, and I use them more or less interchangeably, although other people may disagree. So, the question you’re asking really becomes, ‘what does faith mean to you?’ I hope this helps! ",
            "date": "Answered August 28, 2020",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "D. Paul Walker",
                "href": "/profile/D-Paul-Walker-1"
            },
            "answer_text": "From the study, “The Faith of Jesus Christ”. God has elected that we must have faith as a determining factor as to whether or not we \"please him\" Few of the disputes and controversies debated within the Church are as important or as consequential as those embroiling faith. It is required of us to be pleasing to God, essential for salvation and its absence in anything constitutes sin. Romans 14:23 ...for whatsoever is not of faith is sin.For these reasons, it would seem that understanding what the Scriptures mean by it would be advisable. The definition of “faith” or rather the perceived definition is itself a stumbling block and has been for centuries. It is often added to and occasionally considered to be a mystical quality beyond man’s ability to have. Faith is a divine virtue that can only occur in the human breast by an act of divine grace Thomas Aquinas 1225-74Faith is the gift of God's grace; it is not merited, earned, nor self-created Emil Brunner—1899~1966But, what do the Scriptures have to say? As this is a word study it would be proper to begin by simply looking at the dictionary definition of faith. Most abridged dictionaries will give the two most common meanings. Faith: Confidence, reliance, trust; BeliefThat which is believed or the object of beliefThe two meanings simply look at faith from opposite ends. I have faith in this — This is my faithI have faith in Jesus Christ — I hold to the faith of Jesus ChristRevelation 14:12 Here is the patience of the saints: here are they that keep the commandments of God, and the faith of Jesus.“That keep...the faith of Jesus.” The fact that faith can be looked at from these two directions will be a very important concept to remember in studying this error. Two examples of it being used for the objects of belief is found in Galatians and 1 Timothy. Galatians 1:23 But they had heard only, That he which persecuted us in times past now preacheth the faith which once he destroyed.1 Timothy 3:9 Holding the mystery of the faith in a pure conscience.“The faith” in these verses stands for the corporate beliefs or objects of belief that Paul once persecuted but now preaches. He persecuted those who held faith in Jesus Christ, he persecuted “the faith of Jesus Christ,” thankfully, he now holds “the faith of Jesus Christ.” The biblical definition of faith is also to believe. Hebrews 11:6 But without faith it is impossible to please him: for he that cometh to God must believe that he is,...“Faith...must believe,” having the faith needed to please God begins with believing he is. Isaiah 43:10 Ye are my witnesses, saith the LORD, and my servant whom I have chosen: that ye may know and believe me, and understand that I am he: before me there was no God formed, neither shall there be after me.The Lord has always been attempting to get men to believe, put their faith, in him. Numbers 14:11 And the LORD said unto Moses, How long will this people provoke me? and how long will it be ere they believe me, for all the signs which I have showed among them?Deuteronomy 32:20 And he said, I will hide my face from them, I will see what their end shall be: for they are a very froward generation, children in whom is no faith.Faith is also defined in Romans as believing. Romans 4:3-5 For what saith the scripture? Abraham believed God, and it was counted unto him for righteousness. 4Now to him that worketh is the reward not reckoned of grace, but of debt. 5But to him that worketh not, but believeth on him that justifieth the ungodly, his faith is counted for righteousness.It is God who justifies the ungodly. Believing on him is defined in the above passage as exercising one’s own faith, “his faith is counted for righteousness.” Take note here that faith/belief is in contrast to works, “to him that worketh not, but believeth.” For greater detail read the whole study, “The Faith of Jesus Christ”. ",
            "date": "Answered August 28, 2020",
            "views": "12",
            "upvotes": " Answer requested by Van Le",
            "upvoters": [
                {
                    "user_id": "Teri Olsen",
                    "user_href": "/profile/Teri-Olsen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rich Olsen",
                "href": "/profile/Rich-Olsen-11"
            },
            "answer_text": "I do not think so. It is an important line of thought. Here is a way you may be able to find out. These are just my ideas, do not take them as any kind of an order or anything weird like that. Read your Bible each day for 40 days, never miss a day. Give some money each day for these same 40 days to a poor person, more than you feel you can afford. Pray all day, short like “thanks for the lunch God” or long hours alone in your room when you can. Give up somethings you love such as watching youtube videos or playing games or eating pizza for the same 40 days. Use the money and time saved to pray, read or help the poor. Stop doing anything you know to be wrong for the 40 days, push away the thought of these things. Go to church, beware there are bad people there too. On the 40th day as it breaks take a shower, put on special clothes that are colorful that you love. Walk outside, stand in a quiet place and say “ God, does faith consist in just believing in a holy book?” ",
            "date": "Answered August 28, 2020",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kal Basin",
                    "user_href": "/profile/Kal-Basin"
                },
                {
                    "user_id": "Scott Hakala",
                    "user_href": "/profile/Scott-Hakala"
                },
                {
                    "user_id": "Erlinda Sialongo",
                    "user_href": "/profile/Erlinda-Sialongo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ewaenruwa Nomaren",
                "href": "/profile/Ewaenruwa-Nomaren-1"
            },
            "answer_text": "I will answer this from the Bible perspective, which has been considered a holy book. Most people read the Bible for entertainment, or for scholarly work, or any other secular thing. The Bible was written, and should be believed in, according to what it was written for: correction, reproof, and instruction in righteousness (2 Timothy 3:16–17). When we believe in the Bible, we use it to get rid of our infirmities, namely the ones mentioned in Galatians 5:19–21, 1 Corinthians 6:9–10, Romans 1:28–32, etc. Having faith in God means to work according to his plan, because you hope and believe that it will to the destiny of all righteous ones: eternal life in a righteous world (Romans 8:24–25). Abraham’s faith wasn’t based on a book; after all, the Bible, or any Jewish writing, for that matter, hadn’t been done at that time. However, he still had faith, because he believed in the plan of God. God plays a role in this happening, as demonstrated in Acts 2:37 and Acts 16:14. God opens the heart to accept the gospel, and believe in it, meaning to live by its principles. It Pays to Fear God ",
            "date": "Answered August 30, 2020",
            "views": "135",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Arthur Gregory",
                "href": "/profile/Arthur-Gregory-9"
            },
            "answer_text": "The guidance offered through the Word of God is to me essential now faith in the Word is necessary to live the life. Also Abdul-Baha has written: By faith is meant, first, conscious knowledge, and second, the practice of good deeds.”1 He describes reason as “the first faculty of man”2 and notes that reasoning power “singles man out from among created beings, and makes of him a creature apart.”3“God has given us rational minds for this purpose, to penetrate all things, to find truth. If one renounce reason, what remains?”4 Faith and reason together make it possible to discover the powers and capacities latent in individuals, and in humanity as a whole, and enable people to work for the realization of these potentialities. What Bahá’ís Believe To live the life is To be no cause of grief to anyone. To be kind to all people and to love them with a pure spirit. Should opposition or injury happen to us, to bear it, to be as kind as ever can be, and through all, to love the people. Should calamity exist in the greatest degree, to rejoice, for these things are the gifts and favors of God. To be silent concerning the faults of others, to pray for them, and to help them, through kindness, to correct their faults. To look always at the good and not at the bad. If a man has ten good qualities and one bad one, look at the ten and forget the one. And if a man has ten bad qualities and one good one, to look at the one and forget the ten. Never to allow ourselves to speak one unkind word about another, even though that other be our enemy. To do all of our deeds in kindness. To cut our hearts from ourselves and from the world. To be humble. To be servants of each other, and to know that we are less than anyone else. To be as one soul in many bodies, for the more we love each other, the nearer we shall be to God; but to know that our love, our unity, our obedience must not be by confession, but of reality. To act with cautiousness and wisdom. To be truthful. To be hospitable. To be reverent. To be the cause of healing for every sick one,a comforter for every sorrowful one,a pleasant water for every thirsty one.a heavenly table for every hungry one,a star to every horizon,a light for every lamp,a herald to everyone who yearns for the kingdom of God. Abdul Baha A quote by Abdul Baha \"… Peace of mind is gained by the centering of the spiritual consciousness on the Prophet of God; therefore you should study the spiritual Teachings, and receive the Water of Life from the Holy Utterances. Then by translating these high ideals into action, your entire character will be changed, and your mind will not only find peace, but your entire being will find joy and enthusiasm.\" (From a letter written on behalf of Shoghi Effendi to an individual believer, October 15, 1952) ",
            "date": "Answered August 28, 2020",
            "views": "12",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                },
                {
                    "user_id": "Arnold Ricktor",
                    "user_href": "/profile/Arnold-Ricktor"
                },
                {
                    "user_id": "Thomas Delash",
                    "user_href": "/profile/Thomas-Delash"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hugh Alcorn",
                "href": "/profile/Hugh-Alcorn"
            },
            "answer_text": "No it doesn’t. That is mere belief. Muslims do it; Jews do it; so do all other religions. Believing in the writings of a book does not constitute faith. Faith to some is trust in the subject of the book. For Muslims it is the supposed writings of Mohamed. Buddhists, Hindus, JW’s, Mormons, and every other religion have similar scenarios. But Christianity stands alone. It takes what the Jews forsook and look at the cause and effect of the purpose of the only true God in man, and through reason they enter the reality of the presence of God through the Holy Spirit, who gives them the assurance that what they exercise faith in is real, and this reality changes their lives from darkness to light. They live with a hope of eternal life confirmed by the real God within them. This marks the difference between true, qualified faith producing eternal life, and belief in religion. Christianity is not a religion, even though many have made it so. It is the reality of living with God by the Holy Spirit, through Jesus Christ. ",
            "date": "Answered August 29, 2020",
            "views": "11",
            "upvotes": " Answer requested by Van Le"
        },
        {
            "author_info": {
                "name": "Joy Holt",
                "href": "/profile/Joy-Holt-11"
            },
            "answer_text": "In Hebrews 11:1 says ““Faith is the assured expectation of what is hoped for, the evident demonstration of realities that are not seen.” We are positive the things spoken of in the bible are going to happen as if they’re already happened. Do you believe that the resurrection will take place? In John 5:28–29 and Acts 24:15 the Bible promises a resurrection of our loved ones to earth in the last day. Are we confident that will happen? That is faith because those things haven’t happened yet. So it take more than just believing the Bible, we have to believe as if these things have already taken place. ",
            "date": "Answered September 4, 2020",
            "views": "117",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marcus Anderson",
                "href": "/profile/Marcus-Anderson-78"
            },
            "answer_text": "Not at all. Hebrews 11:1 states what faith is quite plainly: Now faith is the assurance of things hoped for, the conviction of things not seen.  Faith is not so much believing the Bible, but trusting in God’s promises. For example, Jesus promised eternal life to those who trust and follow him. We read about the promise in the Bible, so yes we need to believe it is true, but we need to move beyond that and actually be convinced that Jesus’ promises themselves are true and look forward to them in joyful expectation. That’s what faith is. ",
            "date": "Answered August 29, 2020",
            "views": "1",
            "upvotes": " Answer requested by Van Le"
        },
        {
            "author_info": {
                "name": "John Taylor",
                "href": "/profile/John-Taylor-640"
            },
            "answer_text": "No. Faith involves being born-again. Joh 3:5 Jesus answered, “Truly, truly, I say to you, unless one is born of water and the Spirit, he cannot enter the kingdom of God. Joh 3:6 That which is born of the flesh is flesh, and that which is born of the Spirit is spirit. Joh 3:7 Do not marvel that I said to you, ‘You must be born again.’ You become born-again by accepting Christ. Romans 10:9 “If you declare with your mouth, 'Jesus is Lord,' and believe in your heart that God raised him from the dead, you will be saved.” John 3:16 For God so loved the world that He gave His only begotten Son that whosoever believes on Him should not perish but have eternal life. ",
            "date": "Answered August 28, 2020",
            "views": "796",
            "upvotes": " Answer requested by Van Le"
        },
        {
            "author_info": {
                "name": "Herman Rhodes",
                "href": "/profile/Herman-Rhodes"
            },
            "answer_text": "The Bible teaches that faith come by hearing, and hearing by the word of God. it’s not “Just believing”, it’s Bible study over the years. After Bible study, thinking about what you have read, then comparing it with past experience and reality, your faith grows stronger because you realize that the Bible is true. This goes on year after year after year. You don’t get faith all at once, it takes years of study. ",
            "date": "Answered August 29, 2020",
            "views": "235",
            "upvotes": " Answer requested by Van Le"
        },
        {
            "author_info": {
                "name": "Stephen Sibbald",
                "href": "/profile/Stephen-Sibbald-1"
            },
            "answer_text": "It’s a good start.  Christian Faith requires four steps: Belief that God exists and communicates through the Bible;Obedience of God's commands as laid out in the Bible;Confession that we often fail to obey; andRepentance = changing our ways from sin to love.Of course, we all fail to varying degrees at each and every one of these steps: we doubt, we sin, we cover up, and we stubbornly refuse to change. And the magnificent thing is that God forgives our failure because he loves us and sees our sincere effort. This loving forgiveness is known as grace, and our sincere effort is faith. ",
            "date": "Answered August 29, 2020",
            "views": "675",
            "upvotes": " View 3 Upvoters "
        },
        {
            "author_info": {
                "name": "Preston Venzant",
                "href": "/profile/Preston-Venzant"
            },
            "answer_text": "No. It is simply a part of it. The thief on the cross probably never read the book but he did believe Jesus was the Son of God. Reading it, being baptized, living by the wisdom found in it are all apart of faith. Even the definition of faith is found therein. ",
            "date": "Answered August 29, 2020",
            "views": "499",
            "upvotes": " Answer requested by Van Le"
        },
        {
            "author_info": {
                "name": "Miguel Aguilar Jr.",
                "href": "/profile/Miguel-Aguilar-Jr"
            },
            "answer_text": "For a True Christian does not only believe in a holy book but to give oneself to God and obey his laws and doctrines. to believe not in the book but to believe of whom the book is talking about. ",
            "date": "Answered August 28, 2020",
            "views": "726",
            "upvotes": " Answer requested by Van Le"
        },
        {
            "author_info": {
                "name": "Christina Williams",
                "href": "/profile/Christina-Williams-38"
            },
            "answer_text": "Yes, faith consists in believing in a holy book (God’s Word). Romans 10:17 (KJV Bible) “So then faith cometh by hearing, and hearing by the word of God. ",
            "date": "Answered August 29, 2020",
            "views": "236",
            "upvotes": " Answer requested by Van Le"
        },
        {
            "author_info": {
                "name": "Paul Brocklehurst",
                "href": "/profile/Paul-Brocklehurst-2"
            },
            "answer_text": "Does faith consist in just believing in a holy book? Not just holy books, anything else which can’t be independently verified. ",
            "date": "Answered August 30, 2020",
            "views": "56",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Cheryl Durham",
                "href": "/profile/Cheryl-Durham-3"
            },
            "answer_text": "Nope. Way more than that. It is having faith that the God represented in the book is interacting with the world He has made. ",
            "date": "Answered September 4, 2020",
            "views": "52",
            "upvotes": " Answer requested by Van Le"
        },
        {
            "author_info": {
                "name": "Brent Meeker",
                "href": "/profile/Brent-Meeker"
            },
            "answer_text": "No, it consists in believing anything in the absence of evidence for it, or in the face of the preponderance of evidence against it. ",
            "date": "Answered August 28, 2020",
            "views": "831",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Eleanora Paz",
                "href": "/profile/Eleanora-Paz"
            },
            "answer_text": "No. Faith is about obedience. If you trust what your holy book says, then you will obey its commands. ",
            "date": "Answered August 28, 2020",
            "views": "841",
            "upvotes": "0"
        }
    ]
}