{
    "title": "Does most knowledge come from authority? - Quora",
    "tags": [
        "Epistemology",
        "Authority",
        "Knowledge",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Regis Chapman",
                "href": "/profile/Regis-Chapman-1"
            },
            "answer_text": "No. Authority cannot give you anything you do not already possess. The only thing teachers can give you is reflected in the idea of 'faith pending understanding'. You can accept them as proxy for your own understanding temporarily.  Now, knowledge comes ONLY from understanding, which has, at it's root, the nature of yourself as the thing you would know. The idea of spiritual investigation is to unite the knowledge/knower and known into a unified grasp of the nature of the world, where the subject/object division no longer exists. It's possible to gain the trust of someone, and to accept as valid what they have said. In fact, it's possible to do this at any time, with anything. Still, one must be careful when doing so, that you DO NOT do so reflexively. People who use authority only can do so with your explicitly given permission. Sadly, much of our culture has taught us in a manner that assumes authority should be IMPLICITLY trusted by virtue of their position. So, we live in a sort of bipolar society in which we distrust ALL authority and have been taught from birth to accept it (that is in any culture that has been colonialized, which is the entire earth at this point).   The end result of this is that we've got no real idea how to recognize wisdom or AUTHENTIC understanding. Understanding is includes knowledge for free. Knowledge itself can be detached book learning, but understanding cannot.  On Teaching  Kahlil Gibran No man can reveal to you aught but that which already lies half asleep in the dawning of your knowledge. The teacher who walks in the shadow of the temple, among his followers, gives not of his wisdom but rather of his faith and his lovingness. If he is indeed wise he does not bid you enter the house of his wisdom, but rather leads you to the threshold of your own mind. The astronomer may speak to you of his understanding of space, but he cannot give you his understanding. The musician may sing to you of the rhythm which is in all space, but he cannot give you the ear which arrests the rhythm nor the voice that echoes it. And he who is versed in the science of numbers can tell of the regions of weight and measure, but he cannot conduct you thither. For the vision of one man lends not its wings to another man. And even as each one of you stands alone in God's knowledge, so must each one of you be alone in his knowledge of God and in his understanding of the earth. ",
            "date": "Answered April 16, 2016",
            "views": "861",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Miquon Jackson",
                    "user_href": "/profile/Miquon-Jackson-1"
                },
                {
                    "user_id": "Bassam Karzeddin",
                    "user_href": "/profile/Bassam-Karzeddin-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tali Rae A",
                "href": "/profile/Tali-Rae-A"
            },
            "answer_text": "I would argue that wisdom comes from experience but progress comes from youth and naivete and that authority is actually the most limited kind of place to come from in thinking because it rests on the presupposition that you already have the answers even though new solutions are constantly being invented and ongoingly evolving as quick or quicker than any previous understandings. Additionally a 15 year old can have more experience than a 89 year old in places of life that actually matter -like traveling, cultural and emotional awareness, business building and technology. In the 1960's the space shuttle was sent to the moon by a bunch of young guys in their 20s who just decided to figure it out. The Wright brothers built an airplane just by fooling around. The rolling Stones and Beatles became popular simply because they gave the middle finger to tradition and authority, both things I will argue we need to torch if we want to evolve as a species. If we can torch Tradition we can torch obligation which is essentially handcuffing us. Authority is the brother of tradition and based in patronization, not pure value or service. So nope :) ",
            "date": "Answered April 16, 2016",
            "views": "348",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Michael Cule",
                "href": "/profile/John-Michael-Cule"
            },
            "answer_text": "Not ultimately.  We are not born into this world knowing things (Plato argues to the contrary but what did he know?) neither were our first human ancestors.  We and they had to find things out.  Authority has two meanings here: The general body of knowledge we have accumulated over the centuries  and The people in charge. (They're just as likely to be wrong as the rest of us so don't get your knowledge from them.) Now, most of the knowledge you will encounter will come from that big pool but it had its origin in people trying things for the first time and learning things for the first time. People are adding to the big pool all the time and refining what we have accumulated. Whether the new stuff or the old stuff is the most significant area... Well, that's tricky and sort of depends on your personal situation. ",
            "date": "Answered April 15, 2016",
            "views": "269",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Miquon Jackson",
                    "user_href": "/profile/Miquon-Jackson-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathan Coppedge",
                "href": "/profile/Nathan-Coppedge"
            },
            "answer_text": "Authority is a logical concept. The only reason authority would be required is some kind of demand for authenticity. For example, social demands create social authenticity, which create social authority: for example, common opinion and commonsense arguments may be like this. On the other hand, logical coherence requires a coherent authority that is logical. This is not necessarily a social authority. Indeed, authorities can differ very much from one another, and they are not generally the same people orchestrating all authorities, unless you think in religious, political, or power-base terms. People can buy into these types of systems by wielding more power, having more popular support, owning more property, money, the press, etc. or by adhering to beliefs (or if you believe in it, magic powers) that register for many people. A logical authority is not necessarily a social authority, and a social authority is not necessarily a logical authority, is one example. One of the reasons we have professionals in many areas is because each area demands considerable attention and deserves the highest authority. Creative people often out-do very intelligent people in small ways, even when the very most intelligent people tend to out-perform everybody else on average. Intelligence is probably the most accurate concept of authority today, unless you include religion or money or social skills or sexuality, which don't necessarily work for all people at all times. Indeed, even the concept of intelligent authority has been often questioned throughout history, for example, by Socrates (\"he is wisest who knows that he knows nothing\") and Erasmus (\"In Praise of Folly\"). Similar concepts have even been adopted as logical motifs, such as Nietzsche's concept of 'philosophizing with a hammer' (in other words, breaking the tablets of truth into meaningful separate pieces), and Protagoras' concept of 'having an equal argument on every subject'. From a philosophical point of view, its not a history of authorities, but a history of figures who question all authority. When authority is imposed, it is for good reason, for example, to prevent the murder of a mother's son. Those who question authority in philosophy do so for reasons that would not be justified outside of philosophy. They serve a cognitive function of opening new perspectives and capacities for criticism. For example, Protagoras' concept of 'an equal argument on every subject' is conscientious, and expects that every argument can also be defeated. Nietzsche's philosophizing with a hammer was done to boost the ego of the individual in the face of modernism and WWI. ",
            "date": "Answered April 15, 2016",
            "views": "408",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Min Khin Kyaw",
                "href": "/profile/Min-Khin-Kyaw"
            },
            "answer_text": "Which knowledge the authorities actually give you to benefit you?  They say history is a lie. They say history is written by victors (for their own generations of course.) If knowledge was to come from authorities only, what type of world would we be living?  They say slavery is still well alive. It's sort of sugarcoated pill too sweet not to swallow.   But what makes you think knowledge cannot come from yourself like \"the sky is blue\"? I don't think it must come from authority.  But we do need something \"official\" in terms of dealing with \"official\" things of the society. In this case, the information (knowledge) must come from the authority that is in charge of social affairs.  UN official decries 'bigotry' in US presidential race (Why doesn't UN directly criticize US for what it is doing but the presidential candidates who support what's US has been doing?)  ",
            "date": "Answered April 16, 2016",
            "views": "340",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bassam Karzeddin",
                    "user_href": "/profile/Bassam-Karzeddin-1"
                },
                {
                    "user_id": "Natalia Popova",
                    "user_href": "/profile/Natalia-Popova"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jh Sayyar",
                "href": "/profile/Jh-Sayyar"
            },
            "answer_text": "Most of the people do not know what is knowledge? Knowledge comes from God first to Prophets then it is converted to their followers and after it comes to human being with the passage of time. For example, as we say, 'intention plays an important role in every action.' It is just information for the readers not knowledge. How does intention works in practical life is called real knowledge. Knowledge is awarded from the above if someone prays to God to award knowledge otherwise not is a law of nature.  But most of the people call bookish information knowledge is lack of knowledge and nothing else.    ",
            "date": "Answered April 16, 2016",
            "views": "110",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tom Buczkowski",
                "href": "/profile/Tom-Buczkowski"
            },
            "answer_text": "Yes. Except for the things we have personally experienced and verified by our own firsthand examination, the rest of what we \"know\" comes from us trusting various sources to which we ascribe authority. Indeed, a large part of our learning should be to examine the nature of these sources to see if they merit the amount of authority we ascribe to them and the amount of trust we put in them. ",
            "date": "Answered April 16, 2016",
            "views": "244",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Barry Rountree",
                    "user_href": "/profile/Barry-Rountree"
                },
                {
                    "user_id": "Jeff Wright",
                    "user_href": "/profile/Jeff-Wright-10"
                },
                {
                    "user_id": "Bassam Karzeddin",
                    "user_href": "/profile/Bassam-Karzeddin-1"
                },
                {
                    "user_id": "Abhishek Shakya",
                    "user_href": "/profile/Abhishek-Shakya-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kirk McDermid",
                "href": "/profile/Kirk-McDermid"
            },
            "answer_text": "Practically speaking, yes most of what you probably want to call \"knowledge\" comes from testimony from people you trust.  (Do you know Paris exists if you haven't been there?  Only if you trust others' accounts of it, including that they haven't been Photoshopping all the pictures they take.) ",
            "date": "Answered April 15, 2016",
            "views": "304",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Diwakar Kumar",
                    "user_href": "/profile/Diwakar-Kumar-दिवाकर-कुमार"
                },
                {
                    "user_id": "Peter Hawkins",
                    "user_href": "/profile/Peter-Hawkins-2"
                },
                {
                    "user_id": "Barry Rountree",
                    "user_href": "/profile/Barry-Rountree"
                },
                {
                    "user_id": "Jeff Wright",
                    "user_href": "/profile/Jeff-Wright-10"
                },
                {
                    "user_id": "Tom Buczkowski",
                    "user_href": "/profile/Tom-Buczkowski"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christophe Cop",
                "href": "/profile/Christophe-Cop"
            },
            "answer_text": "I think it does, though accepting knowledge (as true) because authority is a logical fallacy.  But as a child, you accept (well, more or less) what your parents tell you. It would be evolutionary very disastrous if we needed to verify (through trial and error) everything authority told us.  ",
            "date": "Answered April 18, 2016",
            "views": "215",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bassam Karzeddin",
                    "user_href": "/profile/Bassam-Karzeddin-1"
                }
            ]
        }
    ]
}