{
    "title": "Epicurus argues that when we overcome fear of death we live a happy life. Is he true when he says that and why? - Quora",
    "tags": [
        "Coping with and Overcoming Fear",
        "Fear",
        "Death and Dying"
    ],
    "response": [
        {
            "author_info": {
                "name": "Faye Rocka",
                "href": "/profile/Faye-Rocka"
            },
            "answer_text": "He is quite correct. I thought about that earlier today. There is definately a sense of serenity that comes to people when they accept death and know death is real and is going to happen. I ve recently had a near death experience - before that I thought about it all the time. I ve worked with people who are dying. People who have nearly died are incredibly serene if they had a NDE. If the death was a wrong death - like Heaven forbid a murder - or war the person might get PTSD. I think death is great teacher to a person who seeks knowledge. In Buddism - death - is sort of the first principle - as its a universal truth. Christianity tries to deny death. I dont know if there is anything after death - only that the actual process of death - if peaceful, in your bed with family around you - is peaceful and not scary. I dont think in those final moments you are alone, there are definately family members to meet you, but Im not religious. My Dad was terrified of death and always getting panic attacks - then he witnessed a family member pass over - and he has no fear now. He never talks about it - I think its something ‘sacred’ to him. But he is less afraid now whereas once it was something that he couldnt really even talk about he was that scared. I think people fear, fear itself and pain - not actual death itself which I presume will be better than birth. ",
            "date": "Answered February 23, 2018",
            "views": "96",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dee Davis",
                    "user_href": "/profile/Dee-Davis-66"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/OPAR-HILLARY"
                }
            ]
        },
        {
            "author_info": {
                "name": "Denis Fitzpatrick",
                "href": "/profile/Denis-Fitzpatrick-3"
            },
            "answer_text": "Overcoming the fear of death is no simple endeavour :  There is an old Eastern fable about a traveler who is taken unawares on the steppes by a ferocious wild animal. In order to escape the beast the traveler hides in an empty well, but at the bottom of the well he sees a dragon with its jaws open, ready to devour him. The poor fellow does not dare to climb out because he is afraid of being eaten by the rapacious beast, neither does he dare drop to the bottom of the well for fear of being eaten by the dragon. So he seizes hold of a branch of a bush that is growing in the crevices of the well and clings on to it. His arms grow weak and he knows that he will soon have to resign himself to the death that awaits him on either side. Yet he still clings on, and while he is holding on to the branch he looks around and sees that two mice, one black and one white, are steadily working their way round the bush he is hanging from, gnawing away at it. Sooner or later they will eat through it and the branch will snap, and he will fall into the jaws of the dragon. The traveler sees this and knows that he will inevitably perish. But while he is still hanging there he sees some drops of honey on the leaves of the bush, stretches out his tongue and licks them. ~ a fable quoted by Leo Tolstoy in A Confession ",
            "date": "Answered February 23, 2018",
            "views": "68",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "L.J. Hopper",
                    "user_href": "/profile/L-J-Hopper"
                }
            ]
        },
        {
            "author_info": {
                "name": "Norma Padro",
                "href": "/profile/Norma-Padro"
            },
            "answer_text": "You don’t hear this often while living life that one day will come. We hear about it on the news all the time. We live life and we don’t think of it. When you do think of it it’s a strange dark feeling, but you just never get over the feeling. It’s really part of life. It can happen to anyone. Illness, accidents or even falls. It’s important to live a happy life anyway. Do what makes you happy. Try not to think of what can happen at any time. You just can’t live with fear. It’s draining and it gets boring to be thinking of the same thing all the time. All you can do is keep going forward in life. ",
            "date": "Answered February 23, 2018",
            "views": "35",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William Staub",
                "href": "/profile/William-Staub"
            },
            "answer_text": "I know a lot of teenagers who don't fear death but are not happy. Teens are most likely to believe they are invincible, then blame God when they get hurt or sick. As an older person, I believe I will be ready when my time comes, if I do what is right every day, until then. I am quite happy now. ",
            "date": "Answered February 23, 2018",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "HorsesR Life",
                "href": "/profile/HorsesR-Life"
            },
            "answer_text": "Well when you no longer care if you live or die then you can do more things not fearing the consequences because you don’t care what happens- if that something makes you happy- that’s out of your judgment ",
            "date": "Answered February 23, 2018",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Peter Wilcox",
                "href": "/profile/Peter-Wilcox-10"
            },
            "answer_text": "Do you know anyone who is actually afraid of dying? ",
            "date": "Answered February 23, 2018",
            "views": "5",
            "upvotes": "0"
        }
    ]
}