{
    "title": "Germany and other European countries have managed to keep the contagion curve low and reverse the trend. But by relaxing the containment measures, could a new surge of contagion still be lurking? - Quora",
    "tags": [
        "Epidemiology",
        "Germany",
        "Europe",
        "Medical Conditions and Diseases"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jimmy Yap",
                "href": "/profile/Jimmy-Yap-3"
            },
            "answer_text": "“…could a new surge of contagion still be lurking?” Yes. The only way you can remove the risk is vaccinating everyone but nobody can tell you when we could develop one and when we can have it available for everybody. So after any lock down has been removed, any sane countries would then require everyone to continue the social distancing and/or wearing of the mask for another couple of incubation cycle before determining whether is it still necessary to continue such restriction. Only when there are several incubation cycles of NO infection, would you expect the country to remove the requirement of social distancing or wearing of mask. Very likely they will still monitor the situation in neighboring country as well before making such decision. ",
            "date": "Answered April 22, 2020",
            "views": "40",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alket Cecaj",
                    "user_href": "/profile/Alket-Cecaj"
                }
            ]
        },
        {
            "author_info": {
                "name": "Per Oberg",
                "href": "/profile/Per-Oberg-2"
            },
            "answer_text": "Covind 19: 1. Just now we have no idea whish method is best. We will only know after 2 years. 2. Closing down totally may temporarily break the speed of spread of this virus. But as long as most people has not got immunity the virus will come back when lockdown is stoped and replaced with a more open policy. Only by getting the infection and survive, or by getting a vaccine people may get immunity. Still there are lots we do not know about the behavior of this Covind 19 virus yet. 3. The price of lockdown is also destruction of the economy, many people get bad health hence more likely to get other infections later, more suicides etc. A Swedish expert Johan Giesecke states that in the film Jurassic Park dinosaurs did find a way out of the park because \"Life finds a way\", and in the same way Covind19 will find ways regardless what we do untilled enough many people are immune. 4. Without a lockdown Sweden is still NOT totally open. People follow government recommendations in Sweden, normally anyway. And we have many instructions. 5. Stockholm, the capital of Sweden, is reported to have about 30% of the population infected, most people without any severe problems. And by the summer it is estimated that Stockholm (but not the rest of Sweden) will have herd immunity. In other words so many people will be immune that the spread of the virus stops as when an infected person spread virus it will go to people already immune. ",
            "date": "Answered April 22, 2020",
            "views": "19",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Alket Cecaj",
                    "user_href": "/profile/Alket-Cecaj"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harry Kriewaldt",
                "href": "/profile/Harry-Kriewaldt"
            },
            "answer_text": "It’s a risk, but one countries in that situation are essentially having to take. You’re basically saying “We think we have enough cases isolated and/or in hospital that future outbreaks will be able to be controlled locally.” There’s a statistic called the “symptomatic case detection rate”, which pretty much tries to gauge how well a country’s “caught” all the symptomatic cases. Most countries discussing the relaxation of restrictions seem to be somewhere in the 90%+ range, which is what you’d hope. Obviously, the problem with covid is that it’s possible to be asymptomatic and contagious. So you’re taking the gamble that there aren’t many of those. ",
            "date": "Answered April 22, 2020",
            "views": "113",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alket Cecaj",
                    "user_href": "/profile/Alket-Cecaj"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Mucci",
                "href": "/profile/Robert-Mucci-1"
            },
            "answer_text": "The WHO believe there is one lurking. For when winter comes the problems doubles with the virus and the flu. Remembering that the flu still kills hundreds of thousands of people around this world in a year. The relaxing of some measures have been added to the equation and a slight relaxation is really necessary to ease the economic and social problems. even with the thoughts of a second surge in mind. ",
            "date": "Answered April 22, 2020",
            "views": "20",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Alket Cecaj",
                    "user_href": "/profile/Alket-Cecaj"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bruce Monk",
                "href": "/profile/Bruce-Monk-2"
            },
            "answer_text": "I am not clairvoyant so I don’t know if a new surge is lurking. The U.S mortality rate is less than half of that for the average of UK, Germany, Spain, Italy, and France whose combined population is about the same as ours. However, the answer is the same, relaxing must be staged manner and the most vulnerable must remain protected and those around them closely monitored. ",
            "date": "Answered April 22, 2020",
            "views": "84",
            "upvotes": " Answer requested by Alket Cecaj",
            "upvoters": [
                {
                    "user_id": "Alket Cecaj",
                    "user_href": "/profile/Alket-Cecaj"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aaron Lowe",
                "href": "/profile/Aaron-Lowe-17"
            },
            "answer_text": "Yes, there is that risk. Only 1% of the people have been infected, so that means 99% of the people are still vulnerable. ",
            "date": "Answered April 22, 2020",
            "views": "37",
            "upvotes": " View 1 Upvoter "
        }
    ]
}