{
    "title": "Government Leaders and Politicians: What does a politician do? - Quora",
    "tags": [
        "Public Administration",
        "Politicians and Government Leaders"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mehek Trivedi",
                "href": "/profile/Mehek-Trivedi"
            },
            "answer_text": " Leadership can make or break a nation. Our country needs leaders who can take us ahead and not the ‘politicians’ who are dragging us down. We found thirteen fundamental qualities that differentiate the two. Here they are- 1. A politician divides while a leader unites. Politicians create divisive policies and ‘special’ group favours, which over time, accentuate and lead to complete fractures in societies. Leaders, on the other hand, do things differently.  2. A politicians favourite sport is the blame game while a leader prefers taking full accountability. Remember when we were just kids we used to blame our siblings or even friends when things went wrong? It is just human tendency or rather survival instinct (mostly of the weak) to find an escape route. Looks like several of our politicians still resort to this ‘weak’ survival trick.  3. You are not supposed to mean everything you say to be a politician. Being a leader it is the other way around. You need to have a masters degree in the fine art of ‘deception’ to be a politician. Leaders prefer to mean what they say. A leader keeps his word and does not lie to his people.  4. Politicians are reactive while leaders are proactive Politicians often make problems worse, and at most they come up with a weak reaction when shit hits the fan! Leaders, however, work to ensure that problems don’t arise in the first place.  5. Politicians prefer power while leaders get things done Power corrupts and that’s true especially about politicians. Staying in power is more important than anything else – occasionally a poll promise gets fulfilled. A leader, however, focuses on getting things done and making sure that his community, city, state or country is better off.  6. A politician thinks about short-term goals while a leader is visionary. Soon after coming to power politicians start worrying about the next elections and other monetary gains. A leader sees beyond the next elections and fickle monetary gains. He has a long-term vision for the nation he leads.  7. Politician Earns. Leader Burns A politician aims to earn as much as he can from others. A leader is sacrificing and can even burn for others if the need is so.  8. Politicians avoid taking risks. Leaders dream big for the nation. Politicians are ultimately judged on the results they deliver. Sometimes it can be easy to just tread water, especially when things seem to be going well. Yet in truth, continued creativity and risk-taking on the part of a leader is what defines the success of a nation.  9. Politician prioritizes his party. For a leader, the country always comes first. A leader genuinely identifies with the common man on the street and understands what the country needs on every level. For him, the country and its people always come first.  10. Leaders are reliable while politicians often dodge relevant questions. We are so used to seeing our politicians avoiding important questions in the parliament or otherwise as well that we have forgotten how a true leader handles concerns of the common people.  11. A politician discourages while a leader inspires. When people hold important positions, their words hold immense power which is why it is critical for them to build others up, not tear them down. Their words differentiate them from politicians. They are leaders who encourage.  12. A politician uses people to come into power while a leader uses power to develop people. It is impossible to get power without public support but it is immoral to forget the same people after gaining power. Politicians, sinfully, forget the people who brought him to power. Leaders make sure to develop the people who voted for him.  13. A politician yearns for power while leaders work hard to get respect. Respect is something that does not automatically come with a leadership position. This has to be earned and is one of the most difficult entities for a leader to acquire. A true leader yearns for respect which comes entirely because of the work he does for the betterment of his people.  ",
            "date": "Answered September 14, 2018",
            "views": "12",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Koushik Rajendra",
                    "user_href": "/profile/Koushik-Rajendra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Darshan Kn",
                "href": "/profile/Darshan-Kn-2"
            },
            "answer_text": "  word meaning of politician means 3 things as given above..People want a politician which is as in 1st case,but politicians are just as in case of 3..They just do what the 3rd meaning says ",
            "date": "Answered November 11, 2014",
            "views": "880",
            "upvotes": "0"
        }
    ]
}