{
    "title": "Has anyone ever questioned their existence? - Quora",
    "tags": [
        "Existence",
        "Asking Questions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Manu Singh",
                "href": "/profile/Manu-Singh-3"
            },
            "answer_text": "Yes invariably almost everyone going through the human experience is bound to question their existence, question this mundane survivalistic lifestyle given to us by the society, or let's say anyone beyond a minimum threshold of intelligence is bound to question his/her own existence at some point in life. A minimum threshold of intelligence is needed to have such question, dumb people are always interested, involved, excited full of meaningless hopes from the future, they dont see & they don't question, even that requires a bare minimum intelligence. So the people who've questioned their existence aren't really important, there are many, New ones everyday when faced with some challenges or difficulties in life would have this question arising within themselves. On The other hand ones who've answers to the question of their own existence are important, they're are the very salt of the earth, they're the reason life still exists on this earth & humanity is still alive, they're the enlightened ones, the awakened ones simply known as Buddha's. They've found the answer to their existence, they've experienced themselves one with the entire existence, their boundaries have disappeared, they've realised themselves as limitless, formless consciousness. It's not that they've found some definitive answers because something as arbitrary as life cannot have definitive answers, there are Infact No answers, it's that they've dropped out of all questions because all questions are meaningless & all answers lead to further questions. It's an endless game and Dropping all the questions is the answer. Attaining a questionless state free of mind is the answer. Silence is the answer Becoming a Buddha is the answer, realizing your existence & becoming one with this entire universe or existence as one might call it is the answer. ",
            "date": "Answered April 4, 2018",
            "views": "316",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Arun Babber",
                    "user_href": "/profile/Arun-Babber"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sheshagiri (Shesh) Pai",
                "href": "/profile/Sheshagiri-Shesh-Pai"
            },
            "answer_text": "Most people who are going through a prolonged period of misfortune/pain do question their existence. “Who am I” and “Why am I here” are cathartic questions which most people do not have the time to think about even for 5 minutes. They'd rather watch all the movies all the time and given a choice hire someone to do the thinking for them. Unfortunately, just like steel cannot be tempered without going through fire, the onus is on the individual. These things cannot be forced. Some wake up at 8, some are asleep at 80. ",
            "date": "Answered April 9, 2018",
            "views": "18",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Pooja Shah",
                    "user_href": "/profile/Pooja-Shah-1229"
                }
            ]
        },
        {
            "author_info": {
                "name": "Srinivasa Ramanujam",
                "href": "/profile/Srinivasa-Ramanujam-1"
            },
            "answer_text": "We are existing in the world with some purpose as destined by God. human beings should always put a question to themselves that what for they have been born in this world and what is there ultimate purpose and goals of life.This is how our Great Saints and Mahans questioned themselves and through their daily prayers to God.They got answers and enlightment through which they have lead the human community to the moral path devotion self realisation and made many wonders and Miracles ",
            "date": "Answered April 5, 2018",
            "views": "15",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "M. Sachdev",
                    "user_href": "/profile/M-Sachdev"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shyam Sunder Gupta",
                "href": "/profile/Shyam-Sunder-Gupta-21"
            },
            "answer_text": "There are 8.4 million species . Out of them 0.4 million are human like species . They have been given freedom to design and execute their actions ( which involves thinking and decision making process ) . Accordingly , human beings are only species who question their existence , and no other species . ",
            "date": "Answered April 5, 2018",
            "views": "93",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "M. Sachdev",
                    "user_href": "/profile/M-Sachdev"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shailesh B Sharma",
                "href": "/profile/Shailesh-B-Sharma-1"
            },
            "answer_text": "Thanks for A2A, There are many… When this happens, then the real journey begins.. exploring and realization of self.. as mostly people complete their tenure of life without even looking at themselves in a way to understand what you are, why you are and how you are… ",
            "date": "Answered April 5, 2018",
            "views": "45",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "M. Sachdev",
                    "user_href": "/profile/M-Sachdev"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amrita Ranjan Goswami",
                "href": "/profile/Amrita-Ranjan-Goswami"
            },
            "answer_text": "I think in tough times our SELF CONFIDENCE question their own existence from inside. If we work on it dedicatedly we can make them EXISTENT gradually. Thank U… ",
            "date": "Answered April 5, 2018",
            "views": "19",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "M. Sachdev",
                    "user_href": "/profile/M-Sachdev"
                }
            ]
        }
    ]
}