{
    "title": "Has anyone been to a high school like in 'Mean Girls'? - Quora",
    "tags": [
        "Mean Girls (2004 movie)",
        "The High School Experience"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pearl Mayflower",
                "href": "/profile/Pearl-Mayflower"
            },
            "answer_text": "Yes! i joined the advanced drama class my junior year. beforehand, i was warned by a friend named Lou (who ive known for a while) who was in there about lots of drama, and a social hierarchy. i was worried, because i am a shy person and am usually at the bottom of the social pyramid. I thought this class would finally be my chance to make a solid friend group. Based on what i had seen on social media, i thought everyone was friends!! Boy was i mistaken :/ First month of that class i wanted to drop. it was such a shit show!!!!!! Like omg. “The Mean Girls”, instead were referred to as “Squad”. It only consisted of boys, about 10. They domineered over everyone, excluded others, and blatantly did not care about doing so. However, when one brave soul, call him D, pointed this out to them, they ostracized him and bullied him. D was never apart of squad, but he desperately wanted to be. (To be fair, D was one of those “hate the sin, love the sinner type of guys”. Squad was very liberal). I asked Lou to perhaps chill with insulting D, and he snickered in my face. :/ Lou changed a lot. I remember meeting him freshman year, a complete cinnamon roll, telling me he doesn't enjoy gossip. Fast forward to just the next year, before i knew about all this squad bullshit, and there he was complaining about some irrelevant girl in his history class. Anyway, squad also had an initiation process, so they would vote other people in. A girl was apart of it once upon a time, but got kicked out for no apparent reason. Sometimes (i found this hilarious and ridiculous, i mean all their stupid antics were who am i kidsing) a member would call out “SQUAD MEETING OUTSIDE!” during rehearsal or when ever we had free time. They would all rush out there. The reason for their incredulous attitudes was that they were the only boys in the class who receive leads. (They only got leads because the female to male ratio in that class is very uneven. They are pretty funny and creative, but there are very talented, experienced girl singers who are stuck in ensemble and mediocre guys with leads.) Squad would also complain about their enemies: the senior girls. Those girls were fucking snakes: gossiping all the time (which squad would! But the senior girls sucked too. The type of girls to preach about feminism then go and make up rumors about anyone. Who would vote for Hilary vs Bernie bc shes a girl, despite Hilary's crimes. Lol. They were described to me as \"so bland they have nothing to talk about except others.\" Pretty true.) yet squad would do the same! Except the way they would gossip was \"funny\", so that doesnt count right?! I became friends with 3 ish squad members, but i dont really trust them. Im sorry if you see this. Lou ignored me, and another member bullied me over some petty drama. I tried to tell my squad allies that this was happening, but they brushed it aside. The rest of squad pretty much blocked me from existence. I was nothing. My peak was at one point i did a really good monologue and the day after one of the squad members and one of the senior girls said hi to me? So it's really a matter of talent, i guess. Im proud of that monologue :'). I should have done debate. I never did any monologues after that, and i have pretty dumb scene ideas so i wasnt so popular anymore. Lol. Whatev. Anyway, I did want to be friendly with sqaud, so i tried to add them on social media, but all the three that i requested declined. I guess they didn't have to add me, but that but it just sort of shows what type of people they are. They knew me.., (i did have one of them in my french class for two years and I always admired him for his kindness. he never seemed to exhibit such signs of cockiness or whatever there. It was really sad to see this new side of him. I really looked up to him, but i cant see him the same anymore. Nor can i see Lou the same nor the friends i made in squad. Idk. I enjoy people individually, but not when they're with their friends. They gang up against others. There could be a bad egg in the group who influences others negatively. Yanno. All those technicalities. By the way, everyone is on their own path. I don't hate any of these people. I learned very valuable lessons this year. It was a shitty time, but most of them are graduated now. I only have one year left, and i am planning to keep to myself. I want to be very nice to the newcomers in drama, but i am kinda scarred honestly. Sorry for any spelling or grammar mistakes!!!!!!!! ",
            "date": "Answered July 16, 2017",
            "views": "13",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adryan Rock",
                    "user_href": "/profile/Adryan-Rock"
                },
                {
                    "user_id": "Aditya Chaudhary",
                    "user_href": "/profile/Aditya-Chaudhary-426"
                },
                {
                    "user_id": "Paulina Ruiz",
                    "user_href": "/profile/Paulina-Ruiz-1"
                },
                {
                    "user_id": "Kuldeep Hazarika",
                    "user_href": "/profile/Kuldeep-Hazarika-2"
                },
                {
                    "user_id": "Nico Mor",
                    "user_href": "/profile/Nico-Mor-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Johanna Bell Biswas",
                "href": "/profile/Johanna-Bell-Biswas"
            },
            "answer_text": "Yes. I have! But, in my case I was the mean girl. The most popular, pretty and desirable girl in high school. I was so mean that people actually called me “the new Regina in town”! High school ended, and karma hit me hard in my guts. I was bullied and alienated by my batchmates in college. But, things are back to normal. I learnt the hard way, but I have stopped my mean ways. ",
            "date": "Answered February 16, 2018",
            "views": "789",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anoushka Kumar",
                    "user_href": "/profile/Anoushka-Kumar-21"
                },
                {
                    "user_id": "Paulina Ruiz",
                    "user_href": "/profile/Paulina-Ruiz-1"
                },
                {
                    "user_id": "Anuradha Sivaraman",
                    "user_href": "/profile/Anuradha-Sivaraman"
                },
                {
                    "user_id": "Tashi Sharma",
                    "user_href": "/profile/Tashi-Sharma-9"
                },
                {
                    "user_id": "Mohit Shroff",
                    "user_href": "/profile/Mohit-Shroff-4"
                },
                {
                    "user_id": "Ajey Chahal",
                    "user_href": "/profile/Ajey-Chahal"
                }
            ]
        }
    ]
}