{
    "title": "Has life lost its value? Why? - Quora",
    "tags": [
        "Meaning of Life",
        "Values and Principles"
    ],
    "response": [
        {
            "author_info": {
                "name": "Johnny Gee",
                "href": "/profile/Johnny-Gee-16"
            },
            "answer_text": "Speak for yourself. Nihilism and postmodern gibberish can cause us to feel no meaning to life. That powerful feeling is a lie. But it takes great effort to overcome it, because media and dumb clueless people who think they are awake, speak in these terms. A saint said environment is stronger than willpower. That suggests that the media we live in is poisonous with half truths and lies about Life. Media is anti religion and that is a big mistake, showing a lack of wisdom, Modern world speaks highly and constantly about smart, smart this smart that, smart decision, smart car.. etc… but seldom speaks of WISE. Wisdom is the thing not IQ. IQ has no clue about value of life, Listen to Jordan Peterson as very good man, not perfect, but far superior to most in the public eye. He will help you better understand the mess we are in and how to extricate ourselves from the miasma of media and social media. Be well ",
            "date": "Answered May 6, 2019",
            "views": "65",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Isabel Gehrke",
                "href": "/profile/Isabel-Gehrke"
            },
            "answer_text": "Yes. I see no point in living anymore. The only reason I didn’t kill myself last week (and the reason I’m still alive) is because of my friends. I just can’t be properly happy. It makes me so frustrated. I feel so much pain and I have no clue where it’s coming from and I just want it to go away. ",
            "date": "Answered April 30, 2019",
            "views": "77",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "John Seungjin Oh",
                    "user_href": "/profile/John-Seungjin-Oh"
                }
            ]
        }
    ]
}