{
    "title": "Has the philosophy of epistemology been solved? - Quora",
    "tags": [
        "Epistemology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christopher Paynter",
                "href": "/profile/Christopher-Paynter-1"
            },
            "answer_text": "Let’s do a thought experiment. Suppose there is a philosophy class that meets each day Monday through Friday but not on weekends. One Friday the professor announces that she will give a test next week. She is not going to say which day but insists that it will be a surprise. Immediately, the brightest student in the class raises his hand. “It’s impossible for you to give a surprise test next week,” the student insists. “If you give the test on Friday, everyone will know there will be a test that day since it is the last day of classes for that week and the test had not been given out earlier. Therefore, it would not be a surprise to give the test next Friday, so Friday can be ruled out as a possible date for the test. By extending this reasoning, Thursday can also be ruled out as a possible date. If you choose to give it next Thursday, everyone will know just before the test that you were giving it out, since Monday through Wednesday have already happened and Friday has been conclusively ruled out as a date for a surprise test. Therefore, it is impossible to give a surprise test next Thursday. By extending this reasoning yet again, Wednesday can be ruled out. If you choose to give it next Wednesday, students will know it hasn’t been given out Monday or Tuesday and that Thursday and Friday have been ruled out, so the test would not be a surprise. By similar reasoning Tuesday and Monday can be ruled out. Therefore, it is impossible to give a surprise test next week.” “Interesting logic,” replies the professor. “I’ll see you all in class on Monday.” Monday comes along, and there is no test. The students relax a bit. Tuesday comes along, and there is no test. The students relax a bit more. Wednesday comes along, and all of a sudden there’s a test! “But . . ., I established that a surprise test was impossible next week,” the brightest student says plaintively. The professor smiles. “Yes, and your own logic guaranteed that it would be a surprise,” she says. This is what is known as the surprise test paradox in epistemology. The problem is that the student’s argument was clearly mistaken, but nobody can agree exactly why it was mistaken. It is one of a number of unresolved issues in epistemology today, and its existence shows that epistemology is definitely not “solved.” Come up with an explanation that satisfies everyone, and you will be one step closer to actually solving the problem of knowledge. ",
            "date": "Answered August 9, 2017",
            "views": "203",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nathan Ketsdever",
                "href": "/profile/Nathan-Ketsdever"
            },
            "answer_text": "What would that look like? What are the problems of epistemology? Have they been solved? I would suggest not. People are still doing epistemology work from a philosophical perspective. ",
            "date": "Answered August 7, 2017",
            "views": "61",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bala Pillai",
                    "user_href": "/profile/Bala-Pillai"
                },
                {
                    "user_id": "Elizabeth Penrose",
                    "user_href": "/profile/Elizabeth-Penrose-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jay Pee",
                "href": "/profile/Jay-Pee-10"
            },
            "answer_text": "No ",
            "date": "Answered August 7, 2017",
            "views": "46",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alison Hill",
                    "user_href": "/profile/Alison-Hill-11"
                },
                {
                    "user_id": "James Burson",
                    "user_href": "/profile/James-Burson-2"
                }
            ]
        }
    ]
}