{
    "title": "Has determinism been proven? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Bruce Silverstein",
                "href": "/profile/Bruce-Silverstein-1"
            },
            "answer_text": "Determinism has not be proven, and is incapable of being proven or falsified. Determinism Defined. Determinism posits that all activity in the universe (including human thought) is both (i) the effect of [all] prior activity, and (ii) the only activity that can occur given the prior activity. That is what is meant by saying that everything is “determined” — it is the inexorable consequence of activity that preceded it. In a deterministic universe, everything that has ever occurred, is occurring, and will occur since the universe came into existence (however that might have occurred) can only occur exactly as it has occurred, is occurring, or will occur, and cannot possibly occur in any different manner. This mandated activity necessarily includes all human action, including all human cognition. Determinism Cannot Be Proven. First, if the universe is, in fact, deterministic, it follows by necessity that there can never be proof of that fact. In a truly deterministic universe, human beings lack the ability to think in a manner that is not 100% caused by prior activity that is outside of their control, and human thoughts and ideas are just meaningless noise in the universe. As such, in a true deterministic universe, any claim that something evidences or proves the deterministic nature of the universe is an internally inconsistent and/or self-contradictory claim — because the claimant would have to admit that the assertion of the claim, itself, is nothing more than an (unintentionally) predetermined effect of prior causes going back to the beginning of time (to the extent there is such a thing as time). Stated somewhat differently, in a deterministic universe, anyone who claims to have evidence or proof of the nature of the universe is simply following his or her programming — much like a computer that is programmed one day 1 to spit out a particular assertion in day 100, and to also spit out “reasons” for the assertion, and even to purport to perform “experiments” on days 80 through 99 that the computer is programmed to “find” to support the conclusion that the computer is programmed to assert on day 100. That is not proof of anything. Second, if the universe is not deterministic, there plainly can be no proof that the universe is deterministic because any putative proof would be wrong — for for not other reason that it purports to establish the truth of something that is false. Determinism is Non-Falsifiable. If the universe is, in fact deterministic, there is at least one argument in opposition to any claim of proof that Determinism is false. That argument is as follows: If Determinism were true, any putative proof that Determinism is false would be illusory, as it would be nothing more than the natural effect or consequence of prior activity in the universe, and the only thing that could possibly be believed at this time. As explained above, the proof would just be noise in the universe, devoid of any real meaning. [I readily acknowledge that this is akin to the argument that God in non-falsifiable because a God that exists could always create the proof if God’s non-existence or simply plant the seed of such a belief in human beings. I make no claim that the non-falsifiable nature of Determinism (or God) does anything to advance the establishment of the paradigm as true. I am simply explaining why the paradigm is non-falsifiable.] Additionally, for those who are dissatisfied by the logical argument that Determinism cannot be falsified, and who insist on looking to science (specifically math and physics), there are no less than three additional reasons why science cannot falsify the paradigm of Determinism. First, there is the argument that science, itself, is simply another paradigm that is incapable of being proved or disproved and that may or may not be consistent with the reality of the universe, and that any proof that relies in the principles of science is only as reliable as the paradigm, itself. Second, within science there are the combined limitations of Heisenberg's Indeterminacy Principle, Godel’s Incompleteness Theorems, the observer effect, and other human and inherent limitations of empirical observation, which acknowledge the theoretical impossibility of obtaining a certain, complete, and precise understanding of the universe from within the universe. Third, leaving the larger limitations of science aside, even within the paradigm of science, the “laws” of science are subject to being revisited and even falsified with greater information, better technology, or a new paradigm that is more comprehensive and robust. Thus, it is always possible for something that is thought to be proved to be science to be false today will be proven to be true through science tomorrow. In essence, science can never prove anything, Like any other paradigm, science can only provide a story to explain the universe until a hole in the story is discovered and a new story is written. ",
            "date": "Answered December 5, 2017",
            "views": "19",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eugene Smythe",
                    "user_href": "/profile/Eugene-Smythe-1"
                },
                {
                    "user_id": "Rafael Ferreira",
                    "user_href": "/profile/Rafael-Ferreira-172"
                },
                {
                    "user_id": "Mary Cris",
                    "user_href": "/profile/Mary-Cris-15"
                },
                {
                    "user_id": "Anthony Tepas",
                    "user_href": "/profile/Anthony-Tepas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daisi Lui",
                "href": "/profile/Daisi-Lui"
            },
            "answer_text": "proven to whom?! If it was proven, that which was looking for proof wouldn’t be part of the predetermination of things? You cannot be an outsider to the proof of determination if it is to be proven; on the other hand, all you can do is observe what has been predetermined, including your question of ‘has determinism been proven’, and of yourself asking that question. If you can ‘see’ both as part of a predetermined scenario, it means you are not that which happens inside your observation. What would you then be? You may consider the perspective that you are not what you think you are, all there is, is what happens spontaneously in a predetermined way, with no purpose and no cause. Whatever happens has a beginning and so, it must also have an end, but you must be there to see both. As such, determinism is limited to events that are time bound and therefore irrelevant in contrast with the eternal space within which spontaneity of events manifests. Who else can see all these other than yourself?! You are the space that makes everything possible and without which nothing can come into manifestation. ",
            "date": "Answered June 27, 2020",
            "views": "128",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brian Dee",
                    "user_href": "/profile/Brian-Dee-25"
                },
                {
                    "user_id": "Yashasvi Acharya",
                    "user_href": "/profile/Yashasvi-Acharya"
                },
                {
                    "user_id": "Barbara Hemming",
                    "user_href": "/profile/Barbara-Hemming-1"
                },
                {
                    "user_id": "Alex Barad",
                    "user_href": "/profile/Alex-Barad"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joebet Catilogo",
                "href": "/profile/Joebet-Catilogo"
            },
            "answer_text": "i haven’t tried searching for some articles proving that determinism is true, but there have been attempts to prove that. one example is that of B.F. Skinner smin saying that man is not actually free or man does not actually possess that faculty to choose what we call freedom is actually a natural impulse to the circumstance that is we are actually compelled to do this or that thing because instinct pushes to do us, that is our response to any circumstance that is thrown infront of us. it is the reduction of freedom to a mere stimulus of the body to react on a certain situation. this statement is actually a pretty good attempt in asserting that man is actually determined to do such a thing and that is something that he can’t avoid, he is somehow planned to do that and that is just a reduction of man to a purely material compound disregarding his two essential and spiritual faculties the intellect and the will. ",
            "date": "Answered February 28, 2017",
            "views": "769",
            "upvotes": " Answer requested by Jack Johnson",
            "upvoters": [
                {
                    "user_id": "Eugene Smythe",
                    "user_href": "/profile/Eugene-Smythe-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zane Scheepers",
                "href": "/profile/Zane-Scheepers-1"
            },
            "answer_text": "That depends on whether you're referring to orectic or rational determinism. These are term which I dare say, few of my fellow compatriots are aware of. Rational determinism is both logically plausible and if fully comprehended, an undeniable fact. That being said, what makes evidence into proof is the ability to comprehend the evidence. Unfortunately, not everyone can comprehend a concept. Some concepts require a higher level of intellect. As such, rational determinism can't be proven to everyone. This means, a much larger portion of the population believes that free will exists, while a few people know it doesn't. ",
            "date": "Answered April 17, 2018",
            "views": "668",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bangaru Simhadri",
                    "user_href": "/profile/Bangaru-Simhadri"
                },
                {
                    "user_id": "Pertti Ruismäki",
                    "user_href": "/profile/Pertti-Ruismäki"
                },
                {
                    "user_id": "Matthew Taber",
                    "user_href": "/profile/Matthew-Taber-1"
                },
                {
                    "user_id": "Norbert De Beer",
                    "user_href": "/profile/Norbert-De-Beer"
                },
                {
                    "user_id": "Mary Cris",
                    "user_href": "/profile/Mary-Cris-15"
                },
                {
                    "user_id": "Dolly Kal",
                    "user_href": "/profile/Dolly-Kal"
                },
                {
                    "user_id": "Adriaan de Lange",
                    "user_href": "/profile/Adriaan-de-Lange-3"
                },
                {
                    "user_id": "Aurel Strat",
                    "user_href": "/profile/Aurel-Strat"
                },
                {
                    "user_id": "Sheldon Rokeach",
                    "user_href": "/profile/Sheldon-Rokeach"
                },
                {
                    "user_id": "Clement Bezemer",
                    "user_href": "/profile/Clement-Bezemer"
                },
                {
                    "user_id": "Aaron Green",
                    "user_href": "/profile/Aaron-Green-40"
                },
                {
                    "user_id": "Joe Frost",
                    "user_href": "/profile/Joe-Frost-38"
                },
                {
                    "user_id": "David Barron",
                    "user_href": "/profile/David-Barron-49"
                },
                {
                    "user_id": "Jon Jones",
                    "user_href": "/profile/Jon-Jones-219"
                },
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Moore",
                "href": "/profile/David-Moore-408"
            },
            "answer_text": "If determinism were to be proven we would realise that it could never have been any other way, and therefore the concept of a ‘proof’ would be undermined entirely, since there would be no alternative outcomes and no necessary reasoning involved in a ‘proof’ that consequentially arises from every event preceding it - independent of analysis. Hence, ironically, if determinism could be proven in a cogent fashion then in that instant the proof would be invalidated by virtue of the fact that induction would evaporate as a concept and all erroneous reasoning would be justified since no errors could possibly exist as such.  In short, analyses would be the results of their inputs - thus ‘analysis’ could not occur, because all assessments would be caused by what they were supposedly considering. No choice means no proof. How could anything not be proven? ",
            "date": "Answered June 24, 2019",
            "views": "18",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Denis Loubet",
                    "user_href": "/profile/Denis-Loubet"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maxim Motyshen",
                "href": "/profile/Maxim-Motyshen"
            },
            "answer_text": "Physical determinism has been disproven by discoveries in quantum physics. But, as it has been stated in the other answer, it doesn’t prove that we have free will. In fact, quantum physics means that everything is a matter of chance. So, now your choices are not predetermined but random. Does it change the way we live or should live? From my experience, no. Determinism or indeterminism are just ideas that you can get used to and be happy with. The human brain is very adaptive. ",
            "date": "Answered February 23, 2017",
            "views": "605",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Denis Loubet",
                    "user_href": "/profile/Denis-Loubet"
                },
                {
                    "user_id": "Gengivaldo das Couves",
                    "user_href": "/profile/Gengivaldo-das-Couves"
                },
                {
                    "user_id": "Mary Cris",
                    "user_href": "/profile/Mary-Cris-15"
                },
                {
                    "user_id": "Sergiu Aroneasa",
                    "user_href": "/profile/Sergiu-Aroneasa"
                },
                {
                    "user_id": "Sam Parker",
                    "user_href": "/profile/Sam-Parker-416"
                },
                {
                    "user_id": "Maxim Motyshen",
                    "user_href": "/profile/Maxim-Motyshen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Glyn Williams",
                "href": "/profile/Glyn-Williams"
            },
            "answer_text": "If the question means is the universe deterministic, then no it is no. Quantum mechanics (and specifically Bell’s Theorem) seems to demonstrate that this particular universe is not deterministic. So for any given state of the universe, the following state is not pre-determined. There seems the be ongoing randomness. But just in case you are wondering, this does not restore free will. ",
            "date": "Answered February 23, 2017",
            "views": "911",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bangaru Simhadri",
                    "user_href": "/profile/Bangaru-Simhadri"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andre Rizzo",
                "href": "/profile/Andre-Rizzo-2"
            },
            "answer_text": "Short answer : No. Long answer : No. Determinism is an incoherent and unfalsifiable. There is no way to test it It's a magical idea. Why? It states that all events have prior causes. Well, what created the first event? ",
            "date": "Answered December 18, 2019",
            "views": "172",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Pertti Ruismäki",
                "href": "/profile/Pertti-Ruismäki"
            },
            "answer_text": "No. It would make no sense trying to prove such an outrageously illogical and reality-defying proposition. We have no reason to even ask whether determinism is true or not. ",
            "date": "Answered April 17, 2018",
            "views": "84",
            "upvotes": "0"
        }
    ]
}