{
    "title": "Have you used a spirit box that works? - Quora",
    "tags": [
        "Spirits (ethereal)",
        "Spirit",
        "Ghosts",
        "The Paranormal",
        "Supernatural Phenomena",
        "Spirituality",
        "Personal Experiences",
        "Experiences in Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "John David",
                "href": "/profile/John-David-903"
            },
            "answer_text": "Yes, but I will say the ones that turn your phone into a spirit box are a little sporadic in relation to their results. Most will be a recording of a radio going through channels or a central server that's generating the effect for many people at the same time. It ‘is’ possible to get good results from these versions of the device but they will be working differently to Tesla’s original invention. To get consistent results I would advise you buy an old style radio from a second hand shop or an antique centre and carefully take it apart. If you're unfamiliar with the insides of an old radio take a look at some tutorials on youtube. Basically all you're looking to do is to disconnect the manual tuner (the tuning dial) from the receiver. When you switch the radio on you will then find the stations are rapidly ascended and descended continuously and you will hear the familiar Spirit Box effect. Leave it for a while (a minute or so) and then simply ask a question out loud. Something like “would you like to say a few words?” at first, you really don't need to be more specific than that. Remember that it is the person or persons listening to the radio that also act as a kind of receiver to more clearer messages. The overall effect is altered considerably and enhanced by “sensitive and spiritually open people” being present. Also, remember that you cannot put filters on this type of device (spiritually speaking) and so what you have coming through can be very random and possibly a little disturbing (if you're not used to stronger spiritual contact). Even Tesla himself was a bit freaked out when he was on his own in his lab experimenting with different versions of the device. It's good to use it in a small group of trusted friends. Put the radio on for fifteen minutes or so and see how clear the messages are and whether you warm to this kind of communication. I wouldn't use the spirit box for longer periods of time as it can make you feel a bit disoriented. Bottom line, if it doesn't work straight away (within five minutes) then it probably won't work very well on that particular day. A good tip is, when you have it working well, make a note of the moon phase. And then on the next month at the same time try it again. There is usually a better time of the month and it varies for everyone - it's an energy thing. Hope this helps. Have a great day! God bless, Johnny :-) ",
            "date": "Answered May 14, 2019",
            "views": "292",
            "upvotes": " Answer requested by Britany Morrison",
            "upvoters": [
                {
                    "user_id": "Evan Poole",
                    "user_href": "/profile/Evan-Poole"
                },
                {
                    "user_id": "Jim Brown",
                    "user_href": "/profile/Jim-Brown-437"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mac McGarry",
                "href": "/profile/Mac-McGarry-1"
            },
            "answer_text": "No. I frequently use spirit levels as they work. No superstitious nonsense anywhere therein. There is absolutely NOTHING supernatural. ",
            "date": "Answered May 8, 2020",
            "views": "69",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Britany Morrison",
                    "user_href": "/profile/Britany-Morrison"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martin Bushnell",
                "href": "/profile/Martin-Bushnell-2"
            },
            "answer_text": "The best type of spirit box of which I am aware is the beautifully crafted version which most carefully cradles a fine old Jamaican Rum. But then, only my preferences are showing. ",
            "date": "Answered June 16, 2019",
            "views": "44",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Amy Delagarza",
                "href": "/profile/Amy-Delagarza-1"
            },
            "answer_text": "Oh yes ",
            "date": "Answered December 28, 2019",
            "views": "63",
            "upvotes": " Answer requested by Britany Morrison"
        }
    ]
}