{
    "title": "Have you ever had an encounter with a wild animal and interacted? - Quora",
    "tags": [
        "Wild Animals"
    ],
    "response": [
        {
            "author_info": {
                "name": "Denise Lemmel",
                "href": "/profile/Denise-Lemmel"
            },
            "answer_text": "No, not a wild animal, but I've been bit by Man's Best Friend!. The funny part is I actually have petted a cougar! This was before I studied animal behaviors. I lived in an apartment by myself and under the steps one day, there was a large cat. I thought it wasn't very pretty and quite large, but I petted it, and it purred so loud I couldn't believe it! Well, everyday for a week she was waiting for me after work, so I would pet it and didn't think much about it. One of my neighbors came over one day and told me to be careful because they spotted a cougar around here. The next day, I went to pet my cat and realized that was the cougar! I never told anyone there, but they did catch it. It was an adolescent, but it NEVER did anything to make me feel afraid. But, I don't advise anyone to ever get close to any wild animal! I was lucky, wild animals are unpredictable and that makes them extremely dangerous! I believe she probably didn't feel threatened and since I showed no fear, I was very fortunate. ",
            "date": "Answered October 16, 2019",
            "views": "64",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ted Timmermans",
                    "user_href": "/profile/Ted-Timmermans"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tiffany Gabriel",
                "href": "/profile/Tiffany-Gabriel-3"
            },
            "answer_text": "I interact with wild animals all the time. I frequently forget to roll my window up when I get home so I’m always having to chase a raccoon out of my car. I had to shoo a deer away tonight when I got home because it was blocking my path to the door. During the winter I have to get up every few hours when I’m expecting ice to chase deer away to keep them from licking the salt off of my porch. To be honest I interact with wild animals more often than people. ",
            "date": "Answered July 29, 2019",
            "views": "60",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nick Nicholas",
                "href": "/profile/Nick-Nicholas-20"
            },
            "answer_text": "Yes. When in the UK I saw a fox caught in some barbed wire. As I moved closer it started struggling. I sat on the ground and waited and started talking softly to it. A very loose trust was built up. I phoned a friend of mine who came out with some dog food and wire cutters. Dog food reinforced the trust and we moved closer. We cut the wire at one end, more talking, more dog food and then I cut the wire at the other end, keeping hold of it. Between us we could lift the wire without getting too close and causing it to panic. The Fox bolted although it did briefly look back. Many reading this will no doubt say I should have called a vet but without doubt the fox would have been put down as they were considered vermin. ",
            "date": "Answered June 19, 2019",
            "views": "152",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Don Herbert",
                    "user_href": "/profile/Don-Herbert-5"
                },
                {
                    "user_id": "Simon Janevic",
                    "user_href": "/profile/Simon-Janevic"
                },
                {
                    "user_id": "Rishi Chatterjee",
                    "user_href": "/profile/Rishi-Chatterjee-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sandy Pister",
                "href": "/profile/Sandy-Pister"
            },
            "answer_text": "I was walking my three little ShihTzus and we came face to face with a coyote in my neighborhood. I have a whistle around my neck for this very reason and I kept blowing it at it in between yelling. It finally turned up s driveway and on to the golf course. I never let my dogs out in the backyard by themselves because of coyotes or off the leash even if I’m right there. Coyotes hide behind bushes and can jump fences. NEVER ever let your dogs off the leash even if you’re right there. Coyotes can grab them and carry them off very quickly. ",
            "date": "Answered September 20, 2019",
            "views": "30",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ted Timmermans",
                    "user_href": "/profile/Ted-Timmermans"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mikaela Johnson",
                "href": "/profile/Mikaela-Johnson-35"
            },
            "answer_text": "Yes I've caught many snakes I have a wild caught spider only only don't release her because she's awful at catching food I've come very close just a foot or two from a deer I've caught lizards and my most accomplished catch was a chipmunk I superisingly didn't get bitten or scratched so no risk of rabies I've seen “cooler” wildlife but I didn't get close ",
            "date": "Answered June 19, 2019",
            "views": "27",
            "upvotes": " Answer requested by Seanna Whitt"
        },
        {
            "author_info": {
                "name": "Roger Still",
                "href": "/profile/Roger-Still-1"
            },
            "answer_text": "Just little rodents, like chipmunks and squirrels. Some birds, too. ",
            "date": "Answered June 19, 2019",
            "views": "4",
            "upvotes": "0"
        }
    ]
}