{
    "title": "Have you ever wondered about your own thoughts? - Quora",
    "tags": [
        "Deep Thoughts",
        "Self-Awareness",
        "Philosophy",
        "Psychology of Everyday Life",
        "Philosophy of Everyday Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eric Davis",
                "href": "/profile/Eric-Davis-244"
            },
            "answer_text": "*The king steps out and examins his own thoughts*  *I look at all my answers against hitting kids* I did all this? *I look at the a hundreds of arguments for hitting kids I crushed* How do you argue with this? How does anyone argue against this? Did somewhere along the line I just stopped carring about peoples emotions? I tried being nice it seems I tried acting weak I even stooped lower then low I even used the basic arguments I suppressed myself and from the looks of it I regreted it….…. and that regret had a tole on me. *I twist my head to the right* How many people did I use just to collect data……. just to test tools on them and tricks……… I'm feeding off of there rage yet I'm immune hehe if only they knew the toughts that went through my head. How could someone hate the idea of “Spanking\" kings this much why do I call myself “King\"………. is that a reference to the 6 kings that…… nvm. People follow how can they follow my madness?how can they see through it. *a spark flies in my head*my other personalities why am I surprssing them? Tho I did all this with just my power alone………  Why is this working so well, I introduced darkness and insanity against the idea of hitting children what did I do right? What am I doing right? Is it because it gives me freedom to not care about others emotions and opinions is it because I don't have to hold back, if I myself believed in hitting kids and have for years how……… how would I go against this I created all this they tried to just ignore me they tried to run that just made me more powerful do they not realize it…….. you'd think im joking about insanity vs hitting children but after the first 3 answers the joke stops being funny. *there's pools and puddles of blood on the ground* how do people react when they meet arguments they can't beat, when usual tricks and techniques dont work, the usual arguments for hitting kids don't work there all dead……… *I walk through my own castle a man with no fears almost scared of what hes done* all this without even using “That damn sword\" Ragnaratosis………… is this truly what I've became. *You hear the constant screams of the arguments I've killed dying over and over again* What's that *You see a special argument that lives in my mind rent free* I knew I hated when people say they only spank as a last resort but……. *I look up the mouth is leaking blood the eyes are glued open the stomach constantly pecked at my vulters with razar sharp teeth and claws* I know I hate corporal punishment and I know I have the ability to make constructs and people out of abstracts and ideas but still……… who dservers this kind of pain the rest of the arguments at least get to die for a little before dying again this one lives in a constant split between life and death. *The man hanged up spits blood onto the ground*…………… *The past king looks with tears in his eyes as he hears rhe king now laugh at the pain he's caused* *The past king looks up at him* what did I do to you…………  *A barrage of insults and hate flows thought the his ears the past king can see them unable to change what's already been done* Your just some child who got hit to hard. Me: Stop. If a lot of people said it it must be true. Me: Stop you fools I don't wanna argue with some kid I bet you don't even have children Don't have kids idiot Me: What are you people doing stop insulting him. Do you have any idea! There's a huge difference between spanking and abuse retard. Your filled with delusions of grandeur. Ha you can't even spell correctly learn to tpe (they usually make a grammar mistake themselves). 7 years……… 7 years from now your telling me NONE OF THE INSULTS WORK AGAINST ME I can never be free of this curse? No sob story comes up good enough in 7 YEARS what happend to the story of the girl who almost set her house on fire. *the present king lands* I killed that one years ago, *The king lifts the chin of his past self with 1 finger* you'll never encounter a argument or insult strong enough to break this curse you'll forever be stuck in perpetual agony and with each failure the next becomes weaker and weaker. *The past king throws up on the ground and the smell of blood puss and and melted tears everywhere*  I remeber when I was you because I am you, I believed there was some story out there that could prove my dad wasn't a abuser or abuse believer, that there was insult that would show me how “Foolish\" or stupid I was for not believing in the idea of hitting kids, and no matter what I held on to that teddy bear again and again until. *The past me echos* Until I broke it's neck. *The current me smiles* you'll never be free of this, you'll just hear the constant screams of children everyday, the constant begging and plearing even of yourself and no matter how many arguments you kill how big you get how strong your title is you'll never be satisfied, no matter how many times you try and use other arguments to drown out the screams of kids yourself and others, tell me would you want to get rid of all arguments beliefs and defense for hitting kids at the cost of your own sanity? *The past king looks around startled and confused* I…… I…… I………… *He hears the screams of the last resort argument the screams so low his mind doesn't know what to do to protect him from the pain* The present: you can transfer all that pain all that suffering into real life arguments *the current king *I manifest my sword and pull off it's entire toe nail leaving nothing but pure blood* I we were taught by a demon in the ways of torture embrace it………  Just give into the maddness it's not that hard. You get immunity you get power you get everything you want to, that's all they care about right? “Results” when all else fails….. we'll all else has failed there's “No other way\" Me from the past:the 6 royal brain waves I made I master them all that was the reverse brain wave…. The “King\" Ahhh I see you can tell you have absolute freedom absolute reign you can do what you want here. *The seperate screams of crying children and the arguments used to abused them ring through the past kings head” They'll only grow LOUDER AND LOUDER AND LOUDER AND LOUDER AND LOUDER AND LOUDER AND LOUDER AND LOUDER AND LOUDER AND LOUDER AND LOUDER trust you'll try and stop them, you'll try to “Accept\" the insults and so called criticism none of it works no matter how much you get that fix of killing 1 argument for hitting kids it'll never be enough. *The king drips 1 drop of blood into the mouth of his past self* *Despite all the pain hes seen all the destruction all the chaos he smiles* you want more don't you? I have pools of it, it'll never satisfy you. *He looks into the pool sees all the insults thrown at him all the people who have tried to stop him all the sob stories he begins to drink furiously he drinks and drinks and drinks and drinks and drinks and drinks and drinks and drinks it never being enough him needing more and more*  Most people want to become fire fighters, to work at McDonald's or become a astronaut, you want to destroy the idea of “Spanking\" kids belts hands switches all of it, does that word still bother you “Spanking\" trust me it loses its meaning after a while and is no longer this embarrassing safe little word afraid to be said, “the current king dips his past selfs head into the pool of blood” this is what you want isn't it? *the thoughts rush through his head with each desperate swallow* Your getting closer don't you want that 1 argument that can convince you hitting kids isn't abuse don't you want that 1 sob story to change your entire view, JUST SHUT THE FUCK UP AND DRINK…..… The past king: Nothing is working so why can't I stop drinking NOTHING IS WORKING NOTHING IS WORKING *I remove the past mes head from the pool* Past me:Stop stop I want more I need more there has to be something in there that can free me of this curse before I become you there has to be THERE HAS TO THERE HAS TO. You want so badly to believe in the idea of hitting children don't you, trust nothing you do will work. Here you go have a glass lf the blood before you leave. Isn't this a strange thing to “hate\" who would give up there entire sanity to kill something as “Silly\" as unimportant as spanking when there are other more “serious\" things going on in the world? Why does that sentence no longer feel strange coming out of my mouth, WHAT HAPPENED TO MY MIND who did this to me. *past me tries to leave the castle feeling sick to his stomach* here take dry not to drink it in 1 day *Its a cup of the blood filled with all the arguments for hitting children he's killed\" try not to drink it all in 1 day. *As soon as he leaves the door he chugs it down then throws the cup to the ground and curels himself into a ba rocking back and forth*it's not enough it's not enough it's not enough its not enough.  I use to worry about my thoughts, about how I could hate something as silly as “Spanking\" so much as something so “Irrelevant\" and “unimportant” and “Not that bad\" I use to wonder about my thoughts…………. . . .  Until I fucking didn't………….. ",
            "date": "Updated July 17, 2020",
            "views": "411",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Achyuthan Sanal",
                    "user_href": "/profile/Achyuthan-Sanal"
                },
                {
                    "user_id": "Brooke Davis",
                    "user_href": "/profile/Brooke-Davis-421"
                },
                {
                    "user_id": "Pratishruti Garnaik",
                    "user_href": "/profile/Pratishruti-Garnaik"
                },
                {
                    "user_id": "Zandia Moses",
                    "user_href": "/profile/Zandia-Moses"
                },
                {
                    "user_id": "Kong Thao",
                    "user_href": "/profile/Kong-Thao-11"
                }
            ]
        }
    ]
}