{
    "title": "Have face masks failed in the battle against Covid-19? - Quora",
    "tags": [
        "Masks",
        "Failure"
    ],
    "response": [
        {
            "author_info": {
                "name": "James T. Bawden",
                "href": "/profile/James-T-Bawden"
            },
            "answer_text": "Thank you, my friend, for asking me to reply to your question. The failure to prevent the widespread contagion of the coronavirus isn’t nearly as much due to the failure of the masks to prevent the dissemination of the virus, as it is a failure of people to wear the masks. A Gallup poll, released July 6th, 2020 reported 11% of Americans steadfastly refuse to wear a mask. Short of herd immunity, accomplished naturally, or by inoculation with a vaccine, about the only things we can do to slow the spread of a virus, is to social distance, wear masks, wash our hands frequently, use hand sanitizer when we are unable to wash, and self-quarantine if we become ill. A study performed by the Clark County Board of Health revealed if an infected person weren’t wearing a mask, and a healthy person was wearing a mask, the healthy person stood a 70% chance of becoming infected. Yet, if both people were wearing a mask, the healthy person stood only a 2% chance of contracting the viral contagion. While observing every health precaution issued by the CDC and the NIH is not 100% effective…observing the health precautions does slow the spread of the virus, and it does save lives. Included in those health precautions was the advise to wear the N 95 or the KN 95 masks. Anything less effective would be unsuccessful I hope you remain healthy, my friend, and enjoy a wonderful Morning. ",
            "date": "Answered October 22, 2020",
            "views": "88",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Julie Grenier",
                    "user_href": "/profile/Julie-Grenier-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Julie Grenier",
                "href": "/profile/Julie-Grenier-8"
            },
            "answer_text": "No, face masks succeeded in many countries. The purpose of the mask was to slow the spread of Corona virus. Many countries were able to flatten the curve on their first wave. Canada was one of those countries. Unfortunately, we relaxed too much over the summer and now we are in a deadly second wave that is threatening to overwhelm our hospitals in some parts of the country. Even the Maritimes, which had done extremely well at keeping the virus out are now having increasing cases. BC, Manitoba and other provinces had very low case rates and now we are having spreader events. Yesterday BC had over 200 new cases in a 24 hour period, the highest so far. I am very concerned that people are not reverting to good health practices fast enough. Please for everyone’s sake, wear your mask, social distance, wash your hands frequently and restrict your activities with others to small groups. Good luck to us all ",
            "date": "Answered October 22, 2020",
            "views": "23",
            "upvotes": " Answer requested by T Michael Lutas",
            "upvoters": [
                {
                    "user_id": "Dalton Bentley",
                    "user_href": "/profile/Dalton-Bentley-6"
                },
                {
                    "user_id": "Jude Bennett",
                    "user_href": "/profile/Jude-Bennett-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "BIll Hemstock",
                "href": "/profile/BIll-Hemstock"
            },
            "answer_text": "As I answered elsewhere here: BIll Hemstock's answer to In Canada, we do not want the border re-opened. Why are Trump and Pompeo lying about Canada wanting the border open? (including elaborating in the comments), C19 has ‘caused’ a mass hysteria. Or as the doctor in the following explains, C19 has caused mass psychosis… https://www.americanthinker.com/blog/2020/10/delusional_psychosis_drives_americans_to_enforce_fearbased_covid_restrictions.html. The only thing I disagree with though, is what the doctor describes is not limited to the US. It most definitely afflicts masses of people throughout the world; Face masks have become symbolic, the badges, the markers, the shibboleths. Oh, and just to be clear, I called it last April: BIll Hemstock's answer to Did Trump \"promise\" to open up the country by Easter? ",
            "date": "Answered October 22, 2020",
            "views": "45",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Florian Neubauer",
                    "user_href": "/profile/Florian-Neubauer-3"
                },
                {
                    "user_id": "Duane Ylvisaker",
                    "user_href": "/profile/Duane-Ylvisaker"
                },
                {
                    "user_id": "John George",
                    "user_href": "/profile/John-George-251"
                },
                {
                    "user_id": "Julie Grenier",
                    "user_href": "/profile/Julie-Grenier-8"
                },
                {
                    "user_id": "Steven Petersson",
                    "user_href": "/profile/Steven-Petersson"
                },
                {
                    "user_id": "Steve Roberts",
                    "user_href": "/profile/Steve-Roberts-83"
                },
                {
                    "user_id": "Bob Whitcombe",
                    "user_href": "/profile/Bob-Whitcombe"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Greco",
                "href": "/profile/Richard-Greco-3"
            },
            "answer_text": "No, in fact they are probably more effective at preventing the virus from invading your system than any vaccine will prove to be. (masks 95% vaccine c. 65%). The failure has come from people resisting wearing them when they should wear them. They for some damn reason have decided that it is a political statement rather than something done as a health necessity. ",
            "date": "Answered October 22, 2020",
            "views": "98",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chatrajit Swargiary",
                    "user_href": "/profile/Chatrajit-Swargiary-2"
                },
                {
                    "user_id": "Julie Grenier",
                    "user_href": "/profile/Julie-Grenier-8"
                },
                {
                    "user_id": "Doris Goodenough",
                    "user_href": "/profile/Doris-Goodenough-1"
                },
                {
                    "user_id": "Steven Petersson",
                    "user_href": "/profile/Steven-Petersson"
                },
                {
                    "user_id": "Steve Roberts",
                    "user_href": "/profile/Steve-Roberts-83"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Rossney",
                "href": "/profile/Robert-Rossney"
            },
            "answer_text": "If you are out in the rain with an umbrella, and a truck drives through a puddle next to you and drenches you from head to toe, you don’t ask, “Have umbrellas failed?” Facemasks have done exactly what facemasks do during infectious disease outbreaks: slow the spread. They’ve only “failed” in that we haven’t taken any of the real steps to stop the spread of the disease that the countries who have COVID-19 under control have taken, and so the disease continues to spread. ",
            "date": "Answered October 22, 2020",
            "views": "125",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Steven Petersson",
                    "user_href": "/profile/Steven-Petersson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Oliver Walter",
                "href": "/profile/Oliver-Walter-16"
            },
            "answer_text": "Masks haven’t failed at all, because they were never touted as being a foolproof solution that would halt the spread of the virus. Marks are intended to reduce the spread, and tests have found them to be effective in that role. Citing the global increase in the infection rate as evidence that they don’t work doesn’t make sense, as there are multiple factors at play here, and if nobody wore masks we would expect see an even more rapid worsening of the situation. ",
            "date": "Answered October 22, 2020",
            "views": "30",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Judy Parker",
                    "user_href": "/profile/Judy-Parker-61"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Fudemberg",
                "href": "/profile/Mark-Fudemberg"
            },
            "answer_text": "Wearing A Mask Could Be Even More Important Than We Thought : Short Wave Bad News/Good News: Vaccine Access Months Away, But Masks Really Help : The NPR Politics Podcast U.S. Army To Soldiers As Training Resumes: 'Get Your Masks On' Widespread Use Of Face Masks Could Save Tens Of Thousands Of Lives, Models Project ",
            "date": "Answered October 23, 2020",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Edmund Squire",
                "href": "/profile/Edmund-Squire-1"
            },
            "answer_text": "I dont think they really work, as told by many enviorment and medical specialists. They give many people a sense of false security thinking they won’t get the virus by wearing those cotton mandated masks, many made in China. ",
            "date": "Answered October 22, 2020",
            "views": "20",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jeff Mellinger",
                "href": "/profile/Jeff-Mellinger-3"
            },
            "answer_text": "The N95 mask has not failed me or my wife. We use the N95 mask every time we go out anywhere and so far we are COVID-19 free. I know the science behind the masks and I trust them to work like they should. You just can't put on any mask and expect it to protect you, you need to wear the same masks as doctors do. If you wear an N95 mask and wear it correctly you will be protected from the virus. A mask is just half of the battle and you need to protect your eyes as well so I use a pair of non ventilated goggles along with the mask. ",
            "date": "Answered October 22, 2020",
            "views": "40",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Ralph Salotto",
                "href": "/profile/Ralph-Salotto"
            },
            "answer_text": "The majority of those suffering with the disease claimed to be ardent mask wearers. I guess they forgot to cover their eyes. This disease can only be avoided if you decide to live inside a sanitized bubble……………….F-O-R-E-V-E-R. ",
            "date": "Answered October 26, 2020",
            "views": "11",
            "upvotes": " Answer requested by T Michael Lutas"
        },
        {
            "author_info": {
                "name": "Jörg Sattler",
                "href": "/profile/Jörg-Sattler-1"
            },
            "answer_text": "It’s not the mask stupid, It’s the People that refuse to wear them . They are willing to infect you and not before they are in an ICU bed on a Ventilator is it remotely possible that they might possibly begin to understand. However I refuse to bet on that selfish theory that they keep advancing, whatever it is, It’s not scientific. ",
            "date": "Answered October 22, 2020",
            "views": "43",
            "upvotes": " Answer requested by T Michael Lutas"
        },
        {
            "author_info": {
                "name": "Gisa Jähnichen",
                "href": "/profile/Gisa-Jähnichen"
            },
            "answer_text": "No. First, all should wear, if that does not change the problem, then we can discuss this again. It is not a battle or a war. It is a challenge to get out of everyone’s comfort zone and to develop a feeling of solidarity. ",
            "date": "Answered October 23, 2020",
            "views": "23",
            "upvotes": " Answer requested by T Michael Lutas"
        },
        {
            "author_info": {
                "name": "Marc Browning",
                "href": "/profile/Marc-Browning-3"
            },
            "answer_text": "They were never going to work, so they could not really fail. At best they are prolonging the pandemic, nothing more. ",
            "date": "Answered October 22, 2020",
            "views": "28",
            "upvotes": " Answer requested by T Michael Lutas"
        },
        {
            "author_info": {
                "name": "Alexander Shevelevich",
                "href": "/profile/Alexander-Shevelevich"
            },
            "answer_text": "I don’t think so. Not wearing masks is a failure but the people’s negligence in following the security rules. ",
            "date": "Answered October 22, 2020",
            "views": "8",
            "upvotes": " Answer requested by T Michael Lutas"
        }
    ]
}