{
    "title": "How to as a person benefit from philosophizing - Quora",
    "tags": [
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Karl Jenkins",
                "href": "/profile/Karl-Jenkins-10"
            },
            "answer_text": "It gives you a sense of perspective. For example, if you are in the middle class and yet also feel depressed, then you can conduct a simple thought experiment: What would make you feel better? Would cash help? What about a vacation? What about some new clothes, or some retail therapy? If the answer is financial, then you can consider the last time that you did the same. Did that help? Did it yield the long term result that you are after. If the answer is no, then you can rule that off as an ineffective option. You can go back and try to determine why it is that you think that say, retail therapy would make you feel better when it failed to do that the last time you did that. To get back to the other options. Say you determine that more income would help. You could then say, well, what about the additional income would benefit you? What would you do with it. How would it help. Once you determine your answer to that, you can understand what exactly it is that you are after. This process can carry on for a while. It will help you understand the difference between pointless emotions as well as logically driven needs. These are not the same thing. Understanding the relationship between things helps you know which are transient and which are part of a long term underlying problem. Comparing yourself to others is also useful. Are say, all people who are poorer than you unhappy? If they are not, then why are you unhappy while also believing that money will make you happier? Something is wrong with that belief system. Being able to decipher and untangle the web of contradictory and superfluous thoughts in your mind and value system is hugely empowering. It allows you to move forward in life. To avoid pitfalls of conventional thinking or false beliefs. It makes you a better person. A person that is also more able to help not just yourself, but those around you. ",
            "date": "Answered January 8, 2019",
            "views": "173",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Geluz 18",
                    "user_href": "/profile/Geluz-18"
                },
                {
                    "user_id": "Genzel Avila",
                    "user_href": "/profile/Genzel-Avila-1"
                },
                {
                    "user_id": "Renerose Barile",
                    "user_href": "/profile/Renerose-Barile"
                },
                {
                    "user_id": "Bernadette Simata",
                    "user_href": "/profile/Bernadette-Simata"
                },
                {
                    "user_id": "Shickss Soy",
                    "user_href": "/profile/Shickss-Soy"
                },
                {
                    "user_id": "Gypsy Banuelos",
                    "user_href": "/profile/Gypsy-Banuelos"
                },
                {
                    "user_id": "Dolar Abegail",
                    "user_href": "/profile/Dolar-Abegail"
                },
                {
                    "user_id": "Mariam Mamontawan",
                    "user_href": "/profile/Mariam-Mamontawan"
                },
                {
                    "user_id": "Franco Perlado",
                    "user_href": "/profile/Franco-Perlado"
                },
                {
                    "user_id": "Harshit Gupta",
                    "user_href": "/profile/Harshit-Gupta-844"
                },
                {
                    "user_id": "Edith Ibrahim-Uy",
                    "user_href": "/profile/Edith-Ibrahim-Uy"
                },
                {
                    "user_id": "Lynette",
                    "user_href": "/profile/Lynette-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Wuest",
                "href": "/profile/Bob-Wuest"
            },
            "answer_text": "One way is viewing events and circumstances with curiosity, for the best possibilities. For example, realizing that a failure contains more information than a success. If I discern the cause of the failure, I'm less likely to repeat it. Another is realizing that feelings are transitory in nature, and often point to something within me that's asking for my attention. Transitory means that the feeling will pass, and I need not get stuck there. This requires a level of presence and self-awareness. When I give my attention to the feeling, I may just discover something about myself that I didn't know before. Realizing that my mind is about 1,000 times more complex than a fighter jet cockpit. If I train myself to develop the faculties of my mind in a similar manner to the study and practice a fighter jet pilot endures before he ever enters the cockpit, my developed mind will allow me to accomplish great things. Becoming aware of my thoughts as they occur allows me to know when my attention is scattered, and redirect it to better focus and concentrate on the topic at hand. Knowing that I am a manifestation of the divine sets me up for self-love. And, since I can't love another any more than I love myself, every relationship holds greater potential. Knowing that within my male body exists both masculine and feminine energies allows me to engage the most appropriate energy for the circumstances that present to me. Knowing that karma is simply cause and effect, I can give freely of my time, talents and money armed with the knowledge that I'm making karmic deposits that will return to me later. These are just the few that jumped out at me while responding to your question. I could probably write a book about it that no one would read. (Smile) But writing the book would serve me, by bringing to my conscious mind much of the wisdom that I possess. So, thank you for your question. Namaste! ",
            "date": "Answered June 20, 2018",
            "views": "199",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Apple Jane Tordos",
                    "user_href": "/profile/Apple-Jane-Tordos"
                },
                {
                    "user_id": "JOVITO DALONG",
                    "user_href": "/profile/JOVITO-DALONG"
                },
                {
                    "user_id": "Elvie Jane Villegas",
                    "user_href": "/profile/Elvie-Jane-Villegas"
                },
                {
                    "user_id": "Aesther Surban",
                    "user_href": "/profile/Aesther-Surban"
                },
                {
                    "user_id": "Jhamila Bonal",
                    "user_href": "/profile/Jhamila-Bonal"
                },
                {
                    "user_id": "JAM VILLAMOR",
                    "user_href": "/profile/JAM-VILLAMOR-1"
                },
                {
                    "user_id": "Hershey Enano",
                    "user_href": "/profile/Hershey-Enano"
                },
                {
                    "user_id": "Adrian Anuada",
                    "user_href": "/profile/Adrian-Anuada"
                },
                {
                    "user_id": "Janice D. Montejo",
                    "user_href": "/profile/Janice-D-Montejo"
                },
                {
                    "user_id": "Gypsy Banuelos",
                    "user_href": "/profile/Gypsy-Banuelos"
                },
                {
                    "user_id": "Shane Mae Basing-At",
                    "user_href": "/profile/Shane-Mae-Basing-At"
                },
                {
                    "user_id": "Arvin Glenne Sun",
                    "user_href": "/profile/Arvin-Glenne-Sun"
                },
                {
                    "user_id": "Guiawan Kingkong",
                    "user_href": "/profile/Guiawan-Kingkong"
                },
                {
                    "user_id": "Necko Vinson",
                    "user_href": "/profile/Necko-Vinson"
                },
                {
                    "user_id": "Chrizamae Pasignasigna",
                    "user_href": "/profile/Chrizamae-Pasignasigna"
                },
                {
                    "user_id": "Harshit Gupta",
                    "user_href": "/profile/Harshit-Gupta-844"
                },
                {
                    "user_id": "Gabriel Revilla",
                    "user_href": "/profile/Gabriel-Revilla-1"
                },
                {
                    "user_id": "Elif Aslan",
                    "user_href": "/profile/Elif-Aslan-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ruel Mannette",
                "href": "/profile/Ruel-Mannette"
            },
            "answer_text": "To think deeply about something is to philosophize which could have numerous pragmatic benefits dependant on the situation. However, the issue here is also the assumption that something must be ‘beneficial’ to be worthwhile. Appealing to billionaires like Soros or the guy who donated to Johns Hopkins don't accurately give a good picture of philosophy. Philosophy should be an end within itself. If you want to know something for the sake of knowing or know if you can know it then it will most definitely be beneficial. Skills you aquire while processing the various philosophical schools will make learning other things seem much easier. You will become better at formulating ideas and arguing because you will always provide counter examples and that will strengthen your position. Ultimately, these are side effects. Philosophy is like art. It is led by passion and curiosity. You don't do it because it will give you something you do it for ‘thing’ that you are trying to capture whether it is an elegant drawing or an ineffable idea. But while art gives you great design skills philosophy let's you argue around the lawyers and psychoanalyse the psychologists, while simultaneously questioning the validity or law and Fruedian hullabaloo. ",
            "date": "Answered February 6, 2018",
            "views": "406",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jia Flores",
                    "user_href": "/profile/Jia-Flores-1"
                },
                {
                    "user_id": "Pia Therese Labayos",
                    "user_href": "/profile/Pia-Therese-Labayos"
                },
                {
                    "user_id": "Erica Joy Sunio",
                    "user_href": "/profile/Erica-Joy-Sunio"
                },
                {
                    "user_id": "Ayen Christyl Langreo",
                    "user_href": "/profile/Ayen-Christyl-Langreo"
                },
                {
                    "user_id": "Jazz Tan",
                    "user_href": "/profile/Jazz-Tan-15"
                },
                {
                    "user_id": "Abby Tan",
                    "user_href": "/profile/Abby-Tan-49"
                },
                {
                    "user_id": "Sierra Gonzales",
                    "user_href": "/profile/Sierra-Gonzales-15"
                },
                {
                    "user_id": "Mary Joy Regalado",
                    "user_href": "/profile/Mary-Joy-Regalado"
                },
                {
                    "user_id": "Mario Caves",
                    "user_href": "/profile/Mario-Caves"
                },
                {
                    "user_id": "Anna Crun",
                    "user_href": "/profile/Anna-Crun"
                },
                {
                    "user_id": "Jesse Salinas",
                    "user_href": "/profile/Jesse-Salinas-27"
                },
                {
                    "user_id": "Cheick A. Touré",
                    "user_href": "/profile/C-A-Touré"
                },
                {
                    "user_id": "Steve Speidel",
                    "user_href": "/profile/Steve-Speidel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Cattermoul",
                "href": "/profile/Richard-Cattermoul"
            },
            "answer_text": "David Barron gets to the nub of what philosophy is for, though beneficial philosophical thought relies on more on just inward introspection, though it can also land you in deep water. The philosophical method can be used to connect otherwise disparate events to draw conclusions that are not immediately obvious, and nowhere is this more difficult than trying to make sense of global politics. In the news yesterday, Russian president Vladimir Putin makes a triumphant visit to Syria airbase. President Assad tells him that the Syrian people will never forget Russia’s help in driving Islamic State ISIS from the country. See: Vladimir Putin makes triumphant visit to Syria airbase Earlier this month, the head of the Russian army said Syria had been entirely liberated from Isis forces. Putin said a significant part of Russian forces would be withdrawn from Syria, though scepticism was warranted given that two previous announcements have been met with little noticeable scaling down. But let’s pause for a moment and figure out what this might mean. A few years ago, renowned journalist Pepe Escobar informed his readers that the conflict in Syria was primarily driven by Saudi Arabia’s determination to reclaim oil fields stolen from it as a consequence of the secret Sykes-Picot treaty between Britain and France in 1916 which effectively carved up the middle east. A line was drawn between Acre in Israel and Kirkuk in Iraq, all territory to the north – Syria – under French control, while all to the south – Iraq, under British jurisdiction. Fast forward to 2003. In January, Fox news reported that Iraq had 350,000 armed personnel. The first thing that Paul Bremer did when taking up office in Iraq’s Green Zone a few months later was to disband the entire Iraqi armed services and police making 400,000 people redundant who were not at all happy with the destruction of their country by Messrs Bush and Blair, Thus, this led to the creation of ISIS, and we can all remember those columns of gleaming white SUV’s trundling down the Syrian highway collecting all the weapons that the US had left behind, and the subsequent carnage that they have meted out. ISIS were the strong arm boys of those oil companies who wished to drill, refine and market the oil, so who funded them – Saudi Arabia, and MI6’s proxy CIA. In case you’re not aware, MI5/6 stands for UK Military Intelligence. It would thus appear that the Syrian war is now over, but who has won and who has lost. And we are of course talking countless trillions in oil profits etc. Some experts have called the Syrian the endgame, the final resting place of the petrodollar. Putin also met up with Egypt’s Sisi (ISIS backwards) to discuss the resumption of flights between Cairo and Moscow, a move that will surely not be welcomed by the US. In addition, Putin met up with Turkey’s President Erdogan to warn of further tensions over Trump’s announcement that the whole of Jerusalem is now the capital of Israel, and which, not unsurprisingly, has outraged the Palestinians. In the meantime, the foreign ministers of Russia, China and India met to discuss the tensions arising from the military drills of South Korea and US, and the reaction of Kim Jong-Un and Trump’s personal insults of the man. But then we get yesterday’s terrorist attack in New York. Widely publicised as a lone terrorist who was inspired by ISIS but not controlled by them, this comes hot on the heels of Friday’s agreement between UK and EU that in effect leaves the EU’s four freedoms intact on Brexit Day, namely no hard Irish border and retention of some ECJ jurisdiction, whilst simultaneously giving the UK government leave to adapt the 12,000 pieces of legislation as it sees fit, and which can only lead to a massive deterioration in the living standards of the poorer working class and those on universal credit, plus massive cutbacks to public services. In the meantime, EU is threatening to forcibly relocate euro denominated clearing houses to the EU mainland, thus depriving the City of London of one of its primary money making mechanisms, which are the fortunes to be made every time the exchange rate between currencies changes, which can be a huge number on any particular day. This move presumably prevents CoL from capitalising on exchange rate fluctuations between sterling and the euro. As an aside, in 2010 and 2012, articles appeared on the Internet indicating that currency speculation due to exchange rate fluctuations is now risk free because neutrinos can travel in straight lines through the earth, and this is exploited to convey information between stock exchanges ahead of the information getting there over the earth’s surface which is a longer distance. If you know which way an exchange rate is going to move milliseconds before it does, then the money boys can use this to their advantage. It all comes down to physics. You can read these articles at: Relativistic trading: The speed of light isn't fast enough for some market transactions and https://www.forbes.com/forbes/welcome/?toURL=https://www.forbes.com/sites/brucedorminey/2012/04/30/neutrinos-to-give-high-frequency-traders-the-millisecond-edge/&refURL=&referrer=#48f252c7590c So when Theresa May says Brexit means Brexit, we may be leaving the EU, but we are not leaving Europe, there may be more than a grain of truth to this, The stakes could not be higher, for all this goes to the heart of what UK sovereignty means. The facts are unpalatable in the extreme. The goal of the EU by 2025 is complete economic and monetary union when all member states must have adopted the euro. See: Five Presidents' Report sets out plan for strengthening Europe's Economic and Monetary Union as of 1 July 2015 I interpret the word ‘complete’ to be taken literally. https://ec.europa.eu/commission/sites/beta-political/files/roadmap-soteu-factsheet_en.pdf May 2018: Convergence Reports by the Commission and the European Central Bank on the progress made by the Member States in meeting the conditions for adopting the single currency of the European Union A look at the graphs over the past 10 years shows that sterling is a benchmark currency that the euro and the US dollar are now measured against, and if the US got it in its head that sterling might have to be replaced by the euro, this would be sufficient to force the UK to leave the EU. Thus, the loss of the pound would be catastrophic for the global financial system as a whole. Friday’s announcements says the UK is not actually leaving the EU, hence yesterday’s terrorist attack. I’m only saying this because last Thursday I did actually forecast that a terrorist attack would occur in the next few days to make it plain to the powers-that-be of BIG dissatisfaction, but it is also possible that none of the above is related. This week, EU leaders meet to reassess progress in the Brexit talks, so my forecast is that they will overturn most it not all that May and Tusk agreed upon. To leave the EU, a hard border must be erected in order to preserve the integrity of the four freedoms of trade, people, services and finance, plus UK must sever all ties with ECJ. Failure to do so means UK wont have left the EU, which means the threat to the pound remains real and horrendous. This might be the endgame of the war in Syria, but as with everything in global politics, it’s just a guess, just my personal opinion, and something to write about at 4.30 in the morning. We do live in a world that is connected. The EU does not support Trump’s announcement that Jersusalem is the capital of Israel. Indeed, Macron tells Netanyahu that US recognition of Jerusalem is threat to peace Macron tells Netanyahu that US recognition of Jerusalem is threat to peace, which is another snub to US foreign policy. Slightly more disturbing is today’s news at: Hundreds of sex offenders released from prison despite posing risk to public, finds report Hundreds of sex offenders released from prison despite posing risk to public, finds report. HMP Dartmoor failing to protect public from risk due to 'unplanned, rushed and poor' release of sex offenders, prison watchdog warns. This might provide a clue to how one might answer a recent question posed on Quora: ‘does God exist?’ Finally, this week, the UK is in the grip of unseasonably high snow storms. I can’t remember the last time this happened with such ferocity and before Xmas. How I love conspiracy theories. The world is poised for driverless cars and AI robots, testament to the extraordinary leaps in technological innovation, and nowhere is this more evident that the 2015 article US Air Force Admits They Can Control the Weather US Air Force Admits They Can Control the Weather. The US Air Force and DARPA would like us to believe that they have stopped using HAARP in Alaska for research and experiment. Even then, we all know that there are other HAARP systems out there in the form of radar communication and surveillance systems that are rigged on top of mobile platforms that are deployable in any international waters around the world. All they need to do is twist a button to change the frequency to microwave range and increase the frequency modulated [FM] transmission power enough to reach and heat up the atmosphere above the target <Ends> California is currently in the grip of some of the most devasting fires it’s ever had to face, and now UK is suffering from unprecentended snow storms. I look at those images and I ask myself – from technical and geographical standpoints, the Californian fires could be North Korean ICBMs filled with napalm, so perhaps the world is at war with itself, only no one is actually telling us. Is the above any more far fetched than Nick Bostrum’s ‘Are you living in a computer simulation?’ See Are You Living in a Computer Simulation? ",
            "date": "Answered December 11, 2017",
            "views": "297",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abbey Ballera",
                    "user_href": "/profile/Abbey-Ballera"
                },
                {
                    "user_id": "Zien Yan",
                    "user_href": "/profile/Zien-Yan"
                },
                {
                    "user_id": "Gerepe Amper",
                    "user_href": "/profile/Gerepe-Amper"
                },
                {
                    "user_id": "Nervie Sususco",
                    "user_href": "/profile/Nervie-Sususco"
                },
                {
                    "user_id": "Jenny Cariño",
                    "user_href": "/profile/Jenny-Cariño-1"
                },
                {
                    "user_id": "Aryan Talledo",
                    "user_href": "/profile/Aryan-Talledo"
                },
                {
                    "user_id": "Ruth Forsyth",
                    "user_href": "/profile/Ruth-Forsyth"
                },
                {
                    "user_id": "David Barron",
                    "user_href": "/profile/David-Barron-49"
                },
                {
                    "user_id": "Aidan Kelly",
                    "user_href": "/profile/Aidan-Kelly-44"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gerald Crawford",
                "href": "/profile/Gerald-Crawford-12"
            },
            "answer_text": "How can you as a person benefit from philosophizing? Philosophizing primarily focuses on the human condition - the intricacies of romance, politics, personal goals and desires, and typically goes nowhere. The gist of philosophized conversations are forgotten in the morning. The benefit of philosophy. Again and again people ask: “What is the benefit of philosophy?” Because they would not do it, if it had not benefit. Or because they only do things which do have a benefit. I have already asked myself about the personal benefit a person gets from philosophizing. Then things like “You learn to think in a structured, analytical manner” or “You learn how to express your thoughts in clear language” come to my mind. These and some other possible answers to the question of the benefit of philosophy are true, but, in reality structured thinking can be learned in some other field of interest, too, and the same is valid for clear language. But what is more, such secondary benefits do not constitute the reason why one philosopizes. So, if somebody asks me what I consider to be the benefit of philosophy, I now tend to return the question: “How can you live without philosophizing?” “If I tried to live without philosophizing,” I would add, “within three weeks my head would be stuffed with so many confusing and contradictory contents that I would not know my own name anymore. My head would echoe from what other people have told me and from what I have heard or read in the media or in books like from the soap-opera oratories from politicians of different parties. It would all be a terrible havoc inside me, and I would not know anymore what to believe and what I think about things.” To be clear about that: My concept of philosophy is philosophizing; it is not studying philosophical books or papers. Studying the works of professionals of the discipline of philosophy does not help you to bring order into your head. Of course, it might provide one or the other useful hint you were looking for. But in general, when studying Kant or Hegel or Thomas Nagel you are not busy with your own problems but with someone else’s business. Now somebody could object: “But after all you are telling us, the benefit of philosophy for you is to bring order into your head!” Theoretically or literally taken, this statement is somehow true. But what is wrong about it, is that it does not give a true account of my motivation for philosophizing. My motivation is not to philosophize in order to make order in my mind, but the growing disorder in my mind seems so threatening that I feel the urge to run away from it into philosophizing. Would you say that somebody who is gasping for air because he is drowning, is doing that because the air has some kind of benefit for him? Theoretically you could say that, but practically somebody who is gasping for air does not ask for the benefit of air. The real question, in my opinion, therefore is not: “What is the benefit of philosophy?” – but: “How do people manage to live without philosophy?” I do accept the fact that there are people who are not philosophizing, because I know people who say that they do not consider themselves to be philosophers, that they would not want to consider themselves to be philosophers or one of their activities to be philosophizing. People also often say, that they do not understand philosophy, and that, after all they have seen of it until now, they do not like it. I think that those people should be taken seriously in considering themselves as not philosophizing. But the question remains: How do they do it. How do they manage to live without philosophy? Do they do it, but just call it by a different name? That could be true in some cases. Or do they run away from reflecting about their situation? That does not sound implausible either. In total, if I take into regard my existential equilibrium, I need philosophy for my sheer survival. But I would not wonder if other people emotionally function different in a manner, so that they do not need to philosophize or that philosophy even constitutes a threat to their existential equilibrium. The only thing I can say is that I am not able to understand their way of functioning. And this is the reason why I do not really understand the question about the benefit of philosophy. ",
            "date": "Answered June 18, 2018",
            "views": "137",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Angie Vallangca",
                    "user_href": "/profile/Angie-Vallangca"
                },
                {
                    "user_id": "Harshit Gupta",
                    "user_href": "/profile/Harshit-Gupta-844"
                },
                {
                    "user_id": "Lablab Desay",
                    "user_href": "/profile/Lablab-Desay"
                },
                {
                    "user_id": "Sheryl Siclot",
                    "user_href": "/profile/Sheryl-Siclot"
                },
                {
                    "user_id": "Minerva Rhem",
                    "user_href": "/profile/Minerva-Rhem"
                },
                {
                    "user_id": "Aldrin Driza",
                    "user_href": "/profile/Aldrin-Driza"
                },
                {
                    "user_id": "Pedro Larios",
                    "user_href": "/profile/Pedro-Larios-2"
                },
                {
                    "user_id": "AakashR",
                    "user_href": "/profile/AakashR"
                }
            ]
        },
        {
            "author_info": {
                "name": "Magdalena W",
                "href": "/profile/Magdalena-W-2"
            },
            "answer_text": "At first, when I was about to begin my studies at the university, I thought that philosophy will be a path for my personal development and very likely I will find questions for some answers and also find even more interesting questions. Well. Now I would rather say that pholosophizing is not about being fed in those matters. The deeper you go with the myriad of thoughts, streams, views, ect., the more you realise that you really know nothing and it’s difficult to defend any stance you get. Personally, the biggest benefit I earned from philosophy is openness. Many people close themselves in a stream or mindset they find the most “correct”, but I must say that variety of views made me more tolerant for everything which is different from my position. It’s not about becoming transparent and without your own personal opinions, but about a skill of capturing a wider perspective. Much, much wider than before. Life is much brighter with such openess, it’s easier to discuss very varied issues with different people from different environments. Another benefit from philosophizing was pretty funny for me. As you philosophize, you need to read philosophical works. That’s inevitable. But because the language is so complex and the concepts are so deep, you read a little amount of that by one time. And you have to repeat it, too. So thanks to those “exercises” on very difficult texts I find it much easier to read other difficult texts which are not about philosophy. ",
            "date": "Answered June 18, 2018",
            "views": "101",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lito Gabriel",
                    "user_href": "/profile/Lito-Gabriel-1"
                },
                {
                    "user_id": "Jekjek Paquibulan",
                    "user_href": "/profile/Jekjek-Paquibulan"
                },
                {
                    "user_id": "Sierra Gonzales",
                    "user_href": "/profile/Sierra-Gonzales-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Me Dev",
                "href": "/profile/Me-Dev-1"
            },
            "answer_text": "Number of ways. We need to understand the very nature of philosophy. We are alive human beings inherited with immense urge to know and curiosity. Philosophy alone can fulfill that human need. The exertion between questions about life and our own reasoning to answer those questions , sharpens our critical thinking. When answered , it deepens as human beings and completes our hearts. Philosophy is many times the remedy for the soul , being able to anticipate the pain and emptiness from the loss that occurs in our lives. And finally, philosophy makes you appreciate life itself and the moments your are blessed with. As Descrates said ‘Cogito ergo sum’ , I think threrefore I am . p.s. Philosophy benefits us , as long as it doesn’t convert you to a theoretical human , not taking actions , and while we avoid pitfalls that distract us from living the life we want.",
            "date": "Answered June 18, 2018",
            "views": "47",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gabriel Revilla",
                    "user_href": "/profile/Gabriel-Revilla-1"
                },
                {
                    "user_id": "Russell Cruz",
                    "user_href": "/profile/Russell-Cruz-8"
                },
                {
                    "user_id": "Elif Aslan",
                    "user_href": "/profile/Elif-Aslan-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Barron",
                "href": "/profile/David-Barron-49"
            },
            "answer_text": "At the center of philosophy is ethics, which asks the question, what should I do? This is obviously beneficial because without a definite aim in life, we would live at the level of animals, pursuing the most immediate pleasure and avoiding the most immediate pain. Thinking about how we should be in the world leads us to discoveries about the nature of the world and of human life. Everyone does philosophy on some level. We all have a basic metaphysics and ethics which guides us in our day to day life. Consciously examining our fundamental beliefs is beneficial to growing and improving as people. If our beliefs are true and good, we will naturally become better as people, along with the habits we develop and foster. ",
            "date": "Answered December 11, 2017",
            "views": "39",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Froilan Calimlim",
                    "user_href": "/profile/Froilan-Calimlim"
                },
                {
                    "user_id": "Gísli Magnússon",
                    "user_href": "/profile/Gísli-Magnússon-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stefan Milicevic",
                "href": "/profile/Stefan-Milicevic-3"
            },
            "answer_text": "Many People benefit differently from philosophizing. I benefit from philosophizing by looking at the ideas of the past philosophers and creating my own philosophy of Life. The past Philosophers are like a guide to me. They teach me their ideas and let me decide if i should take their stance or create my own sort of philosophy for myself. Looking back at Aristoteles, Spinoza, Locke, Kant, Hobbes, Marx and many more have made me look at Life in diffrent perspectives and have made me appreciate life more. So, coming back to your Qustion. \"How can you as a person benefit from philosophizing ?\" By looking back at the past Philosophers and their ideas, i can create my own Philosophy of Life or take their stances. And it gives me different perspectives of Life. ",
            "date": "Answered January 12, 2019",
            "views": "39",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Angelica Tampol",
                    "user_href": "/profile/Angelica-Tampol"
                },
                {
                    "user_id": "Ghing Hibay",
                    "user_href": "/profile/Ghing-Hibay"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ron Ellis",
                "href": "/profile/Ron-Ellis-26"
            },
            "answer_text": "A good question! If you are thinking about ‘the bottom line’ i.e. money, then you could benefit from Diogenes’ philosophy of Cynicism . He made a virtue of living very simply and in accord with nature. If you do this you avoid being up-sold, you don’t buy what you see in advertisements, you don’t have a TV etc etc. It’s a lot cheaper to live this way, you feel good about yourself, you benefit the ecosystem, you can save money or work less.Also, depending on what social class you think you are you could study capitalism or Marxism and then work politically to further the well-being of people like you.If you mean ‘in a job’, you could do worse than study Machiavelli for practical advice on how to dominate and manipulate people.Reading the right philosopher will help you to understand, improve or accept whatever situation you are in. ",
            "date": "Answered June 18, 2018",
            "views": "33",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aeris FalenExo",
                    "user_href": "/profile/Aeris-FalenExo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bryan McBride",
                "href": "/profile/Bryan-McBride-2"
            },
            "answer_text": "One of the greatest benefits is that it stimulates your mind. Thinking about complex subjects and developing or expressing your ideas is very fulfilling. Especially when there are so many topics that are gray because we never discuss them with the average society member. For example, one of the all time favorite subjects to discuss is the realm of morals. A plethora of philosophers have tried to come up with the best system by which to live by. That's just one but there are so many. It also helps you feel more comfortable arranging your logical strategies to develop arguments. In general, I recommend philosophy to everyone since it makes you a more rational person. I wish they taught philosophy for all students 1st-12th grade. I hope this sort of helps. ",
            "date": "Answered June 21, 2018",
            "views": "34",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sierra Gonzales",
                    "user_href": "/profile/Sierra-Gonzales-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aeni",
                "href": "/profile/Aeni-1"
            },
            "answer_text": "As the evolutionary person in need to reproduce, I won’t. I know everything needed to get along somehow. As a happiness-striving person, I benefit because philosophising about anything makes me happy. And it might help me to survive in the long run because based on philosophy I’m able to create complex societies with complex technology as an outcome. This technology might destroy us but also bear the solution to get beyond sun supernova. ",
            "date": "Answered June 18, 2018",
            "views": "2",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jeff Taylor",
                "href": "/profile/Jeff-Taylor-597"
            },
            "answer_text": "Hi Mark, Yes as in all things there's good and bad,I think philosophizing is a way to start looking for the truth,but I'll tell you a true story,a friend and I were in Oregon,many years ago fishing,a gentleman near us said why don't you two come over later and have a glass of wine.Well of course I turned it into a philosophical discussion,every question I asked he said Meher Baba says this and Meher Baba says that,we got back to our campsite and I said to my friend Billy I don't like that guy Baba,and he says you know why ,and I said yes cause he knows a lot more than me,whic later on I realized nothing and he realized everything. I Had read many people but they were mostly guessing but Baba made me realize he wasn't guessing ,there are no coincidences ,for some reason I think that means something to you or it will shortly. (The entire fabric of the universe serves but one purpose….’the realization of God)Meher Baba. Mark thank you for making me feel so good may it return to you 100 fold ,be well my friend ",
            "date": "Answered October 12, 2020",
            "views": "618",
            "upvotes": " Answer requested by Mark Joseph Andayop",
            "upvoters": [
                {
                    "user_id": "Analyn",
                    "user_href": "/profile/Analyn-15"
                },
                {
                    "user_id": "Muslimaira Gerio",
                    "user_href": "/profile/Muslimaira-Gerio"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Secreve",
                "href": "/profile/Michael-Secreve"
            },
            "answer_text": "Seeing things from a different perspective, I love to write science fiction, horror and about the fantasy surrounding myths. You bring about elements of science and fantasy that is not as yet corroberated by facts and play with it in your mind… with the tangible and intangable. The result of fiction that might amuse or give insight might inspire some kid somewhere to do really amazing things with his or her life. The benifit to me by utilizing philosophy in this regard is to inspire and vicariously receiving the compassion I might instill. ",
            "date": "Answered June 18, 2018",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brendon Hunt",
                "href": "/profile/Brendon-Hunt-1"
            },
            "answer_text": "An ability to see life in similar patterns. Everything and everyone on this Earth has a shadow; except for two things, light and wind. If a blackberry bush is moving and the wind isn't blowing, there's something in that bush. I don't care how juicy those blackberries are: If you stick your hand in that bush you might be bitten by a snake. ",
            "date": "Answered November 16, 2018",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elif Aslan",
                    "user_href": "/profile/Elif-Aslan-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Divya Shree",
                "href": "/profile/Divya-Shree-105"
            },
            "answer_text": "Philosophy involves a lot of things good, bad etc. I would say if you are able to convey something to another and the other person whom you conveyed to feels satisfied and happy which improves his living is something great infact amazing. So you definitely are better may be best, because you are analyzing things and able to find a solution to it. You are a leader, a helper, a better person and someone whom one can trust. Philosophising is something that means a person knows lots of things about a topic or various topics, so you know wat it is and how it may be better. So overall it's makes you a person helping others and oneself. ",
            "date": "Answered June 18, 2018",
            "views": "17",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Princess Bea",
                    "user_href": "/profile/Princess-Bea-5"
                },
                {
                    "user_id": "Paul Xavier Tejerero",
                    "user_href": "/profile/Paul-Xavier-Tejerero"
                },
                {
                    "user_id": "Mae Yago",
                    "user_href": "/profile/Mae-Yago"
                },
                {
                    "user_id": "Vince Ellas Joseph Dotillos",
                    "user_href": "/profile/Vince-Ellas-Joseph-Dotillos"
                },
                {
                    "user_id": "Aeris FalenExo",
                    "user_href": "/profile/Aeris-FalenExo"
                },
                {
                    "user_id": "Jocelyn Vandeberg",
                    "user_href": "/profile/Jocelyn-Vandeberg"
                },
                {
                    "user_id": "Jeff Godwin",
                    "user_href": "/profile/Jeff-Godwin-2"
                },
                {
                    "user_id": "Veronica Cook",
                    "user_href": "/profile/Veronica-Cook-10"
                },
                {
                    "user_id": "T. B.N.",
                    "user_href": "/profile/T-B-N"
                },
                {
                    "user_id": "Tim Karlsson",
                    "user_href": "/profile/Tim-Karlsson-3"
                },
                {
                    "user_id": "Andrew Estepp",
                    "user_href": "/profile/Andrew-Estepp"
                },
                {
                    "user_id": "Marouane Chaouch",
                    "user_href": "/profile/Marouane-Chaouch"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ray Lancaster",
                "href": "/profile/Ray-Lancaster-2"
            },
            "answer_text": "Philosophy is about asking better questions and treating doubt with respect. ",
            "date": "Answered June 15, 2018",
            "views": "18",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sierra Gonzales",
                    "user_href": "/profile/Sierra-Gonzales-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Helena Drajovich",
                "href": "/profile/Helena-Drajovich-1"
            },
            "answer_text": "The dictionary defines philosophizing as: noun- the exposition (often superficially) of a particular philosophy. I define philosophizing as the interpretation of true material light, rationalizing profound intellectual wisdom and spiritual principles with the intent of living a super-excellent life. As inhabitants of earth, the sun doesn’t always shine bright or warm the souls of the wanderers. Nor does the moon illuminate on the eyes and the hearts of the conquerors. Philosophizing is sourcing intellectual and spiritual light as guidance to think rationally to discover spiritual sustenance which will charge their hearts with supreme wisdom and elevation. ",
            "date": "Answered June 13, 2018",
            "views": "16",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Celso Pereira Neto",
                    "user_href": "/profile/Celso-Pereira-Neto"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard O. Colestock",
                "href": "/profile/Richard-O-Dick-Colestock"
            },
            "answer_text": "Philosophizing, at worst, keeps your brain active and teaches you how to think seriously about ‘Bis Issues’. At best, you may occasionally hit a philosophical jackpot - an insight into something that has been bothering you for a long time but suddenly becomes clear as crystal. It’s rare but Oh-so-good when it happens. ",
            "date": "Answered June 18, 2018",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jelou O. Baguio",
                    "user_href": "/profile/Jelou-O-Baguio"
                },
                {
                    "user_id": "Bianca Muncada",
                    "user_href": "/profile/Bianca-Muncada"
                },
                {
                    "user_id": "Veronica Love",
                    "user_href": "/profile/Veronica-Love-41"
                },
                {
                    "user_id": "Yvonne Grin Santos",
                    "user_href": "/profile/Yvonne-Grin-Santos"
                },
                {
                    "user_id": "Tomasio A. Rubinshtein",
                    "user_href": "/profile/Tomasio-A-Rubinshtein"
                }
            ]
        },
        {
            "author_info": {
                "name": "Samuel Price",
                "href": "/profile/Samuel-Price-29"
            },
            "answer_text": "Philosophy is primarily used in an attempt to understand, so applying a philosophical mindset to how you view and think about life can lead to becoming a more well rounded individual. ",
            "date": "Answered June 18, 2018",
            "views": "3",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Apjune Fidelos",
                    "user_href": "/profile/Apjune-Fidelos"
                }
            ]
        },
        {
            "author_info": {
                "name": "Diane Thompson",
                "href": "/profile/Diane-Thompson-78"
            },
            "answer_text": "Do you mean internal philosophizing? Or, participating in a group session? Or, philosophizing at others? For the first, I am constantly internally philosophizing. I can’t stop it and it seems to help me understand the world and my place in it at that moment. It occasionally changes my world view. For the second, group bull-shitting sessions are great fun and open up your mind to other possible ways of thinking. Sometimes it becomes a problem in that you learn things about your associates that you would rather not know. For the third thing, don’t bother. They don’t want to hear it. Answer Quora questions instead. ",
            "date": "Answered January 8, 2019",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Michelle Bourg",
                    "user_href": "/profile/Michelle-Bourg"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ivan Ceko",
                "href": "/profile/Ivan-Ceko"
            },
            "answer_text": "Not everyone can benefit from philosophizing. Open people tend to profit more than conservative people or doers. But if you actually are openminded, then philosophizing helps keeping an open mind. ",
            "date": "Answered June 18, 2018",
            "views": "980",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mario Caves",
                    "user_href": "/profile/Mario-Caves"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jan Rock",
                "href": "/profile/Jan-Rock-5"
            },
            "answer_text": "It’s the greatest subject to take. You learn all about the way other really smart people think. You learn about their lives, what might have influenced them, how they came to their beliefs. It is fascinating and, if anything, it helps a person keep an open mind. ",
            "date": "Answered February 4, 2018",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mario Caves",
                    "user_href": "/profile/Mario-Caves"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shameem Ali",
                "href": "/profile/Shameem-Ali-12"
            },
            "answer_text": "Philosophising is a process of sorting out your ideas. This can be achieved in a number of ways, such as formulating your ideas from what you read, what you see, what you hear and what you speak. Philosophising is a “wondering” of ideas, what ever their source. There are , however, some preconditions. Firstly, it must be in search of “truth”, whatever that may represent. Secondly, it must be in pursuit of “good”, whatever that may represent. Furthermore, it must focus on explanation and not justification, it must be about others and not oneself, it must not be linear nor systematic, lest we confuse it with theorising. ",
            "date": "Answered December 26, 2017",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Cristine Pecante",
                    "user_href": "/profile/Cristine-Pecante"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard A. Smith",
                "href": "/profile/Richard-A-Smith-7"
            },
            "answer_text": "I believe it creates a nice balance between proof and belief. Also being open minded makes you understand the importance of change and diversity of “new age” ",
            "date": "Answered June 18, 2018",
            "views": "917",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Ayesha Zulfi",
                "href": "/profile/Ayesha-Zulfi-2"
            },
            "answer_text": "Philosophy is nothing but words coming out some one's mouth who have felt something really deep as compared to others. When those words are heard by others who have never felt things as deep, they call it philosophy. Try recalling some great philosphers, they were always considered incomprehensible because of the words they used but in reality it was just that they felt more and described things with more depth ",
            "date": "Answered June 18, 2018",
            "views": "48",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stephen Erbe",
                "href": "/profile/Stephen-Erbe"
            },
            "answer_text": "As long as you have a good moral understanding of truth then philosophizing can open up questions from wondering minds and answer them correctly. ",
            "date": "Answered October 16, 2020",
            "views": "124",
            "upvotes": " Answer requested by Mark Joseph Andayop"
        },
        {
            "author_info": {
                "name": "John Stowell",
                "href": "/profile/John-Stowell-3"
            },
            "answer_text": "Philosophy teaches you a certain principles to live a more productive life. Most people do not have principles so they drift and usually find no meaning in life. ",
            "date": "Answered January 8, 2019",
            "views": "722",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Cliff Isaacs",
                "href": "/profile/Cliff-Isaacs"
            },
            "answer_text": "Your philosophy of life informs every choice you make. You already have one; better find out what it is! ",
            "date": "Answered June 18, 2018",
            "views": "709",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lucius Annaeus Seneca",
                "href": "/profile/Lucius-Annaeus-Seneca-3"
            },
            "answer_text": "I recommend starting with the stoic Philosophers. This will open doors to guide you in daily life. Branch out from there, but do not be in any hurries. ",
            "date": "Answered June 15, 2018",
            "views": "772",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mc Garrett",
                "href": "/profile/Mc-Garrett-2"
            },
            "answer_text": "Brain storming opens you up to others’ philosophies. What an opportunity ",
            "date": "Answered June 27, 2018",
            "views": "647",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aubrey P",
                "href": "/profile/Aubrey-P-5"
            },
            "answer_text": "depending on what they get out of philosophizing, their personal life could benefit ",
            "date": "Answered June 18, 2018",
            "views": "629",
            "upvotes": "0"
        }
    ]
}