{
    "title": "How does insight contribute to our understanding of what philosophy is? - Quora",
    "tags": [
        "Analytic Philosophy",
        "Insights",
        "Philosophy of Life",
        "Philosophers",
        "Understanding and Comprehension",
        "Knowledge",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bruce Clark",
                "href": "/profile/Bruce-Clark-202"
            },
            "answer_text": "Our insight completely defines our understanding of what philosophy is ,although it doesn't define what philosophy is . Philosophy is essentially an expression of insight into the nature of knowledge . It is a quest to know by applying the creative process within a symbolic drama in which one defines meaning in more astute terms .Those meanings in schemes insightfully arranged lead to predictive capacity . The result …accurate prediction measures the accuracy of the inputs in the scheme .As the inputs become more subjective one is drawn into understanding nature ,mind and beings with systems arranged by the philosopher . . ",
            "date": "Answered July 20, 2020",
            "views": "275",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lisa Hart",
                "href": "/profile/Lisa-Hart-52"
            },
            "answer_text": "“Understanding“ the past experiences of others or ourselves “Contributes” greatly to being able to understand a reasoning behind any given “philosophy.” People act and react. Causes and effects are evident always. Most always people have reasons for their actions and their “philosophies.” ",
            "date": "Answered June 30, 2020",
            "views": "177",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Eli Sockey",
                "href": "/profile/Eli-Sockey"
            },
            "answer_text": "Discussing how we think and come to know things, Aristotle refers to our insight into our own experience of thinking and knowing. Experience provides insights that help us understand even difficult concepts, ",
            "date": "Answered June 30, 2020",
            "views": "116",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Carol Willis",
                    "user_href": "/profile/Carol-Willis-35"
                }
            ]
        }
    ]
}