{
    "title": "How to know if you are straight or gay - Quora",
    "tags": [
        "LGBTQ Issues",
        "Homosexuality",
        "LGBTQ"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Alexander",
                "href": "/profile/Steve-Alexander-62"
            },
            "answer_text": "I’m going to take this as a sincere question and try to give a sincere answer. When I was five, I was caught playing “doctor” in the nude with the kid from across the street. We were in the dog house, figuratively in the dog house once caught, literally in it when caught. We took off our clothes and crawled into a dog house. In our favor, it was a big dog house. We instinctively knew there was something wrong with what we were doing, but were intent on doing it nonetheless. We had been fervently examining each other’s every part for perhaps half an hour when my grandmother reached in and dragged me out. She knew we were in there because we had neatly and conscientiously folded our clothes and placed them just outside the structure. Not in our favor. I remember this not because we were having sex or behaving sexually toward each other. I was five; he was six. We had no idea what sex was. Sexuality was a concept entirely beyond our ken. What I remember was the aching need in my gut for a ‘special’ friend, a male friend, and we would have great intimacy. Other than that description, I didn’t really know what I needed. I didn’t know how to express it. I wouldn’t figure it out until I was thirteen. I went through puberty at eleven, fifth grade. My mother sat me down with an anatomy reference book and explained ‘the facts’ to me: hormones, pubic hair, penile growth, erections, sex, sexuality. I didn’t really understand sexuality, but I understood sexual attraction — to another guy. It arose in me daily. And, that aching need was there with a vengeance. I began to associate the two with each other. I still hadn’t a name or external reference for it. I thought I was the only one. By thirteen, seventh grade, I had a name and a reference. The name was homosexual. The reference was from Leviticus. It was abomination, perversion, and evil. I knew I was one. I had no doubt. I hadn’t the slightest interest in girls, not just sexually but also emotionally and intellectually. I was sexually attracted to guys. I had the erections and day-dreaming fantasies to prove it. I routinely jerked off to the men’s underwear ads in the Sears & Roebuck catalog. I discovered the version of gay porn at the time, men’s athletic posing magazines. And there was that familiar aching need. Only now, it wasn’t content just to occupy my gut. It moved to a point behind my sternum and took up residence. It left a yawning gap where blood and tissue should have been. It smarted and gnawed at my serenity. Now you too have an internal reference for homosexuality. You have me as an example. For an external reference, Wikiwand has an article on homosexuality. Homosexuality is romantic attraction, sexual attraction or sexual behavior between members of the same sex or gender. As a sexual orientation, homosexuality is \"an enduring pattern of emotional, romantic, and/or sexual attractions\" to people of the same sex. If you have experienced not just occasional homosexual conduct, but instead a continuing emotional investment, you’re gay. You may have had no homosexual contact but nonetheless, have that gnawing ache that won’t go away. That is an enduring pattern of emotional/romantic same-sex attraction. That is same-sex sexual orientation. That is gay. If instead you have none of that but have had a couple of homosexual encounters without the ache feasting behind your sternum, your straight and just experimenting. If you’ve had several homosexual and heterosexual encounters, and if you’ve enjoyed them both and want to continue with them, you’re bisexual. It doesn’t much matter whether you’re sexually inexperienced. It doesn’t much matter whether you’re five, thirteen, twenty, or thirty-five. What matters is whether you have that enduring pattern of same-sex emotional/romantic attraction, the ache that won’t be satisfied unless you find a man to empathize with and intimately relate to. If yes, you’re gay. If not, not at all, you’re straight. If something else, you’re bisexual. If you’re worrying about it, stop. Just let things play out as they will. Explore, experiment, and don’t worry about putting a name to it. With time and with the knowledge that comes from experience, you will know for sure whether you’re gay.  Q: How do you know for sure if you are gay? ",
            "date": "Answered January 20, 2019",
            "views": "68",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mike Hunt",
                    "user_href": "/profile/Mike-Hunt-1644"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Swapnil-430"
                },
                {
                    "user_id": "Madhumitha",
                    "user_href": "/profile/Madhumitha-107"
                },
                {
                    "user_id": "Meverick Dean",
                    "user_href": "/profile/Meverick-Dean"
                },
                {
                    "user_id": "Otis Saroke",
                    "user_href": "/profile/Otis-Saroke"
                },
                {
                    "user_id": "Suhani Patel",
                    "user_href": "/profile/Suhani-Patel-82"
                },
                {
                    "user_id": "Kunal",
                    "user_href": "/profile/Kunal-662"
                },
                {
                    "user_id": "Bengt Lindvall",
                    "user_href": "/profile/Bengt-Lindvall"
                },
                {
                    "user_id": "COll I",
                    "user_href": "/profile/COll-I"
                },
                {
                    "user_id": "Steve Reed",
                    "user_href": "/profile/Steve-Reed-11"
                },
                {
                    "user_id": "Inuashion Sasuma",
                    "user_href": "/profile/Inuashion-Sasuma-1"
                },
                {
                    "user_id": "Shery Fathy",
                    "user_href": "/profile/Shery-Fathy"
                },
                {
                    "user_id": "Michelle Benning",
                    "user_href": "/profile/Michelle-Benning-6"
                },
                {
                    "user_id": "Efe Berkan",
                    "user_href": "/profile/Efe-Berkan"
                },
                {
                    "user_id": "Cecily Gifford",
                    "user_href": "/profile/Cecily-Gifford"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joe Hancock",
                "href": "/profile/Joe-Hancock-3"
            },
            "answer_text": "I’ve answered this question numerous times already, but I suppose there’s still some confusion out there. The only true, 100% foolproof, undeniable factor determining if you are gay or not is if the balls touch. It’s that simple. Have your balls touched another man’s balls? If you answered no, then you are most likely not gay. But if you answered yes, even in the context of “just one time” or “as a joke” or “by mistake”, then i’m afraid you are gayer than cum on a cowboy’s mustache. There’s no grey area. It’s gay science. Exhibit A: Man-Bro really loves to suck him some dick, but is only ‘curious’, and in fact when asked about his sexuality is more likely to state firmly that he is straight. The verdict here is that he is not gay, despite the vigor he displays while sucking said cocks, and also despite the number of cocks sucked. He could be giving five (5) blowjobs a day for the better half of a decade and even go as far as installing a home gloryhole, but he’s still “totally straight you guys”, due to the lack of his scrotum not colliding with another set. Exhibit B: Dude-Guy gets invited into the sexual escapades of a recently married couple looking to spice things up a bit. He’s not gay, but the wife in said equation is too sexy to pass up. He joins the pair mid-coitus as he removes his clothing post haste. She is on top of her husband, riding him with seasoned precision while he lays back and grins. She turns back for a moment, inviting their new playmate to join. Dude-Guy jumps behind the vixen, but in his carelessness slips down, missing his mark. The look on the husbands face says everything needing to be said, mouth wide in horror as he feels his testicles squarely bounce off Dude-Guy’s. It’s only for a moment, but it’s impossible to ignore. The wife cries out, running still naked from the bedroom as her husband (soon to be ex), has now become gayballs. The divorce will be quick and neat, at least there were no kids involved in the proceedings. Dude-Guy gets dressed without a word spoken and leaves, silent the whole drive home as his brain tries to grapple with the severity of what just occurred. How is he supposed to tell his parents that now he too, is gayballs? So yeah, want to know for certain if you’r gay or not? Just count how many times your balls have knocked up against another pair. Easy peasy, wonder no more. ",
            "date": "Answered June 12, 2019",
            "views": "42",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Camden Mason",
                    "user_href": "/profile/Camden-Mason-1"
                },
                {
                    "user_id": "Jewelle Escalona",
                    "user_href": "/profile/Jewelle-Escalona-1"
                },
                {
                    "user_id": "Barry Smith",
                    "user_href": "/profile/Barry-Smith-144"
                },
                {
                    "user_id": "Bengt Lindvall",
                    "user_href": "/profile/Bengt-Lindvall"
                }
            ]
        },
        {
            "author_info": {
                "name": "Warren Huber",
                "href": "/profile/Warren-Huber"
            },
            "answer_text": "Yes. I am a good example - I’m as gay as they come, but I am what the queer community often calls “straight acting” - my most comfortable modes of appearance and behaviors are pretty heteronormative. I am a big guy, I grow my beard out, I’m physically strong, I dress masculine, etc. etc.. This doesn’t make any statements about my being better or worse, of course, than a more effeminate gay man! It’s just who I am. Being gay and being effeminate are two different things that, ultimately, have little to do with one another other than subcultural norms. Check out this infographic for a little helpful context:  What a person’s outward appearance and behaviors that you’re asking about when you say “straight-looking” are what we call “Gender Expression”: how a person chooses to and is comfortable dressing and acting with regards to traditionally masculine and feminine modes. This can be any degree along either concept, or a combination of the two, OR vary from day to day or moment to moment. While these might signal different things socially as a form of non-verbal communication, they are not actually tied to sexual or romantic orientation (attraction). So, a biological male might have a feminine gender, be sexually attracted to males but romantically attracted to neither gender (aka, wants sex, but not a relationship), and oscillate between masculine dress and behaviors and feminine ones from day to day. Or any other combination thereof. Wibbly-wobbly humany-wumany: There’s lots of ways of being human. ",
            "date": "Answered January 12, 2018",
            "views": "25",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Robert Delbert Ives",
                    "user_href": "/profile/Robert-Delbert-Ives"
                },
                {
                    "user_id": "Bob Ross",
                    "user_href": "/profile/Bob-Ross-718"
                },
                {
                    "user_id": "Joshua Mondejar",
                    "user_href": "/profile/Joshua-Mondejar-2"
                },
                {
                    "user_id": "Leah Brown",
                    "user_href": "/profile/Leah-Brown-42"
                },
                {
                    "user_id": "Daniel Brown",
                    "user_href": "/profile/Daniel-Brown-570"
                },
                {
                    "user_id": "Manuel Xavier",
                    "user_href": "/profile/Manuel-Xavier-4"
                },
                {
                    "user_id": "Bob Morgan",
                    "user_href": "/profile/Bob-Morgan-45"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Williams",
                "href": "/profile/Andrew-Williams-92"
            },
            "answer_text": "Sometimes it takes a while. When I was eighteen, I went to university. This was the first time I’d been away from home and in an environment where other young people were actively interested in sex. In my first year, I was in a hall of residence - and I never found the right girl. (Found out several years later that at least one had been dropping pretty big hints, and I had been utterly oblivious…) I did, however, get rather distracted by surfer dude Brian and by Paul, who was quite happy after his shower to hang around the kitchen in just a towel. Second year, I moved off campus. I was very lonely. The urge to find a girlfriend grew stronger but I still couldn’t find “the one”. And then that summer, aged twenty, I did something I’d never done before. I got some prescription sunglasses. No more squinting in the sunlight. One of the hidden bonuses of sunglasses is that you can check out everyone that walks by without worrying that they’ll notice. I was young, horny and desperate, so I took advantage of this. And I suddenly realised that I wasn’t looking at the girls. I was drawn to the guys, showing off those muscular legs in their short shorts and often going entirely topless. Oh dear. My life had turned complicated. But not so much. I joined the university LGBT group, largely on the grounds that they could maybe tell me for sure. They introduced me to various bars, a gay youth group… and eventually I came to terms with it all. Still took me a while to find a boyfriend, but that was largely due to social clumsiness. How do you know? Put on some sunglasses, walk down the street, and watch what your eyes are doing. ",
            "date": "Answered March 27, 2019",
            "views": "66",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dave Clarke",
                    "user_href": "/profile/Dave-Clarke-152"
                },
                {
                    "user_id": "Otis Saroke",
                    "user_href": "/profile/Otis-Saroke"
                },
                {
                    "user_id": "Rizki H",
                    "user_href": "/profile/Rizki-H-1"
                },
                {
                    "user_id": "Jewelle Escalona",
                    "user_href": "/profile/Jewelle-Escalona-1"
                },
                {
                    "user_id": "Jena H",
                    "user_href": "/profile/Jena-H-8"
                },
                {
                    "user_id": "Suhani Patel",
                    "user_href": "/profile/Suhani-Patel-82"
                },
                {
                    "user_id": "Bengt Lindvall",
                    "user_href": "/profile/Bengt-Lindvall"
                },
                {
                    "user_id": "Elmeri Kivioja",
                    "user_href": "/profile/Elmeri-Kivioja"
                },
                {
                    "user_id": "Yubin Choi",
                    "user_href": "/profile/Yubin-Choi-5"
                },
                {
                    "user_id": "Atolagbe Boluwaji",
                    "user_href": "/profile/Atolagbe-Boluwaji"
                },
                {
                    "user_id": "William Fausz",
                    "user_href": "/profile/William-Fausz"
                },
                {
                    "user_id": "Benjamin Lovett",
                    "user_href": "/profile/Benjamin-Lovett-5"
                },
                {
                    "user_id": "Ali",
                    "user_href": "/profile/Ali-1211"
                },
                {
                    "user_id": "Kieran Chetter",
                    "user_href": "/profile/Kieran-Chetter"
                },
                {
                    "user_id": "Gustavo Suarez",
                    "user_href": "/profile/Gustavo-Suarez-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jonathan Kretchmer",
                "href": "/profile/Jonathan-Kretchmer"
            },
            "answer_text": "Let's say you're a man. Imagine yourself making out with a hot girl. Imagine getting down on one knee, asking this woman to marry you. Imagine yourself at the hospital, holding your first child for the first time. Imagine sitting next to this woman on the porch, both near the end of your life, contemplating your marriage. Can you see yourself doing this? Yes? You probably like women. You may be straight. You may not be. Can you not see yourself doing this? You probably don't like women. You may not be straight. Now, imagine you're making out with a hot guy. Imagine getting on one knee, asking him to marry you. Imagine going through the struggles to get a marriage certificate, to make your love for one another valid. Imagine trying to adopt a child, because you know that together, you'll parent the shit out of your kids. Imagine sitting next to your husband, with the same love you have the day you met him. Can you see yourself doing this, and the same with a woman? You're probably bisexual. Or maybe you aren't. Can you see yourself only doing this? You probably like men. You might be gay. You might not be. Finding out you're gay or straight isn't a test you can take. It isn't something anyone else can figure out for you. It is a realization you need to make yourself. (Notice that I said realization and not choice because sexuality is not a choice.) ",
            "date": "Answered June 29, 2017",
            "views": "83",
            "upvotes": " View 20 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Swapnil-430"
                },
                {
                    "user_id": "Otis Saroke",
                    "user_href": "/profile/Otis-Saroke"
                },
                {
                    "user_id": "Robert Wolfgang",
                    "user_href": "/profile/Robert-Wolfgang-2"
                },
                {
                    "user_id": "Xuman Dutt",
                    "user_href": "/profile/Xuman-Dutt-1"
                },
                {
                    "user_id": "Suneel Rathod",
                    "user_href": "/profile/Suneel-Rathod-2"
                },
                {
                    "user_id": "Brandy Wolfe",
                    "user_href": "/profile/Brandy-Wolfe-1"
                },
                {
                    "user_id": "Ronald Russell",
                    "user_href": "/profile/Ronald-Russell-27"
                },
                {
                    "user_id": "Good Account",
                    "user_href": "/profile/Good-Account-1"
                },
                {
                    "user_id": "Matthieu Picard",
                    "user_href": "/profile/Matthieu-Picard-3"
                },
                {
                    "user_id": "Mario Jacobs",
                    "user_href": "/profile/Mario-Jacobs"
                },
                {
                    "user_id": "The Unknown",
                    "user_href": "/profile/The-Unknown-454"
                },
                {
                    "user_id": "Scarlet Grant",
                    "user_href": "/profile/Scarlet-Grant-1"
                },
                {
                    "user_id": "Tinder Tinder",
                    "user_href": "/profile/Tinder-Tinder-2"
                },
                {
                    "user_id": "Tim Lach",
                    "user_href": "/profile/Tim-Lach"
                },
                {
                    "user_id": "William Fausz",
                    "user_href": "/profile/William-Fausz"
                },
                {
                    "user_id": "Carly W",
                    "user_href": "/profile/Carly-W-12"
                },
                {
                    "user_id": "Benjamin Lovett",
                    "user_href": "/profile/Benjamin-Lovett-5"
                },
                {
                    "user_id": "Jake Regenwetter",
                    "user_href": "/profile/Jake-Regenwetter"
                },
                {
                    "user_id": "Usha Kotval",
                    "user_href": "/profile/Usha-Kotval"
                },
                {
                    "user_id": "Pat Hatch",
                    "user_href": "/profile/Pat-Hatch-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jonathan Rider",
                "href": "/profile/Jonathan-Rider-2"
            },
            "answer_text": "Yes. Appearance has no impact on sexuality whatsoever. Earlier this year I went to my first pride parade, together with a straight friend of mine.Take a look at my profile picture. I’m a short guy with long hair, a goatee, wear black clothing, and generally dress in a way that makes people immediately place me as ‘metalhead’ (which is indeed true). Now that day, I went to some lengths to make sure I looked attractive, putting on a shirt that shows off what I pretend is an attractive, muscular body, paying extra attention to my shave and hair, etc. My friend habitually has a very clean shave, spends significant amounts of time styling his hair for those occasions, and generally likes to dress to look good. During the parade he was flirted with by several guys, and constantly had to decline with the words “Sorry, I’m straight. He’s bisexual though.” (referring to me). It was generally met with variations of “What, really?”. People kept pinning him as the gay one, and me as the straight friend who came along, when it was actually the other way round. He is apparently often thought of as gay; both another friend of his and his current girlfriend at first thought he was gay. People don’t “look gay” or “look straight”. The only reliable method of finding out someone’s sexuality is by asking them politely. ",
            "date": "Answered December 15, 2017",
            "views": "15",
            "upvotes": " View 34 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bob Ross",
                    "user_href": "/profile/Bob-Ross-718"
                },
                {
                    "user_id": "Nathan mendes",
                    "user_href": "/profile/Nathan-mendes-6"
                },
                {
                    "user_id": "Samuel Boynton",
                    "user_href": "/profile/Samuel-Boynton-1"
                },
                {
                    "user_id": "Alison Crutchfield",
                    "user_href": "/profile/Alison-Crutchfield-1"
                },
                {
                    "user_id": "Alana Campanha.",
                    "user_href": "/profile/Alana-Campanha"
                },
                {
                    "user_id": "Sam George",
                    "user_href": "/profile/Sam-George-103"
                },
                {
                    "user_id": "Misaki Amasawa",
                    "user_href": "/profile/Misaki-Amasawa"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/C-L-P"
                },
                {
                    "user_id": "Mike Miller",
                    "user_href": "/profile/Mike-Miller-168"
                },
                {
                    "user_id": "Isa Nation",
                    "user_href": "/profile/Isa-Nation"
                },
                {
                    "user_id": "Daniel",
                    "user_href": "/profile/Daniel-898"
                },
                {
                    "user_id": "Trinity Soto",
                    "user_href": "/profile/Trinity-Soto"
                },
                {
                    "user_id": "Patrick Burns",
                    "user_href": "/profile/Patrick-Burns-23"
                },
                {
                    "user_id": "Alice Luke",
                    "user_href": "/profile/Alice-Luke-2"
                },
                {
                    "user_id": "Yanga Kandeni",
                    "user_href": "/profile/Yanga-Kandeni"
                },
                {
                    "user_id": "Olena Sakhno",
                    "user_href": "/profile/Olena-Sakhno"
                },
                {
                    "user_id": "Joe Tannoury",
                    "user_href": "/profile/Joe-Tannoury"
                },
                {
                    "user_id": "Peter Larsen",
                    "user_href": "/profile/Peter-Larsen-20"
                },
                {
                    "user_id": "Vaughn Beghetti",
                    "user_href": "/profile/Vaughn-Beghetti"
                },
                {
                    "user_id": "Sasha Mishkin",
                    "user_href": "/profile/Sasha-Mishkin"
                },
                {
                    "user_id": "Ignatius Jasper",
                    "user_href": "/profile/Ignatius-Jasper"
                },
                {
                    "user_id": "Daniel Brown",
                    "user_href": "/profile/Daniel-Brown-570"
                },
                {
                    "user_id": "Lee Block",
                    "user_href": "/profile/Lee-Block-2"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Random-Browny"
                },
                {
                    "user_id": "Irene Hill",
                    "user_href": "/profile/Irene-Hill-3"
                },
                {
                    "user_id": "Thomas Perozo",
                    "user_href": "/profile/Thomas-Perozo"
                },
                {
                    "user_id": "Israel Jiménez",
                    "user_href": "/profile/Israel-Jiménez"
                },
                {
                    "user_id": "Paul Michael",
                    "user_href": "/profile/Paul-Michael-78"
                },
                {
                    "user_id": "Ky Putnam",
                    "user_href": "/profile/Ky-Putnam"
                },
                {
                    "user_id": "Pierre Julien",
                    "user_href": "/profile/Pierre-Julien-2"
                },
                {
                    "user_id": "Simon Morton",
                    "user_href": "/profile/Simon-Morton-13"
                },
                {
                    "user_id": "Natalie Hunter",
                    "user_href": "/profile/Natalie-Hunter-25"
                },
                {
                    "user_id": "Lora Alexander",
                    "user_href": "/profile/Lora-Alexander-3"
                },
                {
                    "user_id": "Henry Sears",
                    "user_href": "/profile/Henry-Sears"
                }
            ]
        },
        {
            "author_info": {
                "name": "Toby Wilson",
                "href": "/profile/Toby-Wilson-10"
            },
            "answer_text": "Is it possible for a fully straight-looking person to be gay? Define “straight looking”. In my experience, gay people don't grow extra limbs, or glow funny colours. I know a bloke who's over six and a half feet tall, covered in tattoos, keen on skulls, mohawk, built like a brick privy, winner of a prize for belicose, drunken vomiting at a Pagan camp. I was stunned when he came out, but glad that he felt able to express himself, even though he lost some “friends” as a result. I also know a teacher, speaking as a heterosexual man, she was a joy to behold, still is, she came out and I felt an idiotic pang of disappointment, as if a woman like that would be interested in a face-ache like me! In both cases, there were no outward signs of their sexual orientation. Conversely, I've been told that I'm gay, had people demand that I admit it, because I hate sport and, until recently, had long hair. I find other men physically repulsive, especially in a sexual way, so it's hardly surprising that my response was initially hilarity, graduating to anger and leaving the conversation before I resorted to violence, which apparently proved the idiot’s point. You can't tell a person's sexuality from their appearance. ",
            "date": "Answered December 17, 2017",
            "views": "331",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jed E. Herman",
                    "user_href": "/profile/Jed-E-Herman"
                },
                {
                    "user_id": "Johan Olsson",
                    "user_href": "/profile/Johan-Olsson-31"
                },
                {
                    "user_id": "Jess O'Neill",
                    "user_href": "/profile/Jess-ONeill-3"
                },
                {
                    "user_id": "John Knight",
                    "user_href": "/profile/John-Knight-19"
                }
            ]
        },
        {
            "author_info": {
                "name": "Trey McIntyre",
                "href": "/profile/Trey-McIntyre"
            },
            "answer_text": "Those aren’t the only options and that can make answering this question for yourself pretty difficult. Most people think of sexuality as a spectrum ranging (at least) from gay to straight. So, you can be mostly straight and a little gay. Or one could be perfectly bisexual where you’re equally “gay” and “straight.” I knew I was gay because I am a man who is primarily interested in other men for sex and romance. This doesn’t mean I never find women attractive nor that I’ve never considered having sex with women. But, really, I am mostly and most consistently attracted to men. So, I’m gay. If I’m being perfectly frank with you, though, I don’t think it’s absolutely necessary to answer this question for one’s self. It’s handy and convenient to have a label that tells you what’s expected of you, but if you find yourself in a situation where your emotions contradict that label, it can create some difficulties. For example, if you’re convinced you’re gay, but then you meet someone of the other gender who pushes your buttons, you’re forced to ask yourself what that means for your personal identity. I think that’s actually one of the reasons why it can be difficult to come out of the closet. If I were to imagine an ideal society for people, I wouldn’t make this an issue at all. People would just accept the fact that they’re attracted to other people without feeling a need to build their whole identity around that attraction. They could be with men or women based on who they and their partners are. But we don’t live in an imaginary world and I know that people want to be able to figure out which boxes they fit in. ",
            "date": "Answered March 25, 2018",
            "views": "23",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lucas De Mello Mantey Domingues Caetano",
                    "user_href": "/profile/Lucas-De-Mello-Mantey-Domingues-Caetano"
                },
                {
                    "user_id": "Emily Linh La",
                    "user_href": "/profile/Emily-Linh-La"
                },
                {
                    "user_id": "Stephen M Hatcher",
                    "user_href": "/profile/Stephen-M-Hatcher"
                },
                {
                    "user_id": "Emily Holman",
                    "user_href": "/profile/Emily-Holman-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Melina Julia",
                "href": "/profile/Melina-Julia"
            },
            "answer_text": "Okay so.. Talking from own experience here. I identified as bisexual when i got a crush on my female best friend. It happened, i made us 'close close' best friends by copying the stuff american best friends do. (I'm dutch) so.. Kisses on the cheek and hugs! (Ca-ching!) Then she moved to her father's house and i never saw her again. (After we had a huge fight.) And then i continued to have 'heterosexual' relationships simply because i was lonely. That is for another story. So, in 2018, in March. I had just stopped 'dating' a guy and fell into the LGBTQ+ community. I started to follow LGBTQ+ instagrams and everything. So in May/June i was surrounded by it.. And the confusion hit. I was completely confused surrounding my sexuality for 6+ months! I did get about 3 rainbow shirts 2 pair rainbow socks and other rainbow things. (Ssh. This was kinda a hint.) Then at around december i started going to a LGBTQ+ Hangout. Mostly for teens, but everyone is welcome. It was great. And this is gonna sound really stupid for most people who are weirded out by this; but they recommended me to watch porn. NO not the bad kind you find under 15+ virusses. Not the kind that is just terrible. But the kind from Leren, amuseren en fantaseren over sex (Lottelust) (it's dutch. Sorry) They contain women-friendly porn. Might sound full of *** too most, but it also includes 'sexy stories' including gay ones. And i can tell you, owh my.. I'm gay. And demisexual. But also very gay. Until some weeks ago i was still doubting about it, but i honestly get nauscious when i think about dating a male. Even though i do find people who identify as non-binary incredibly interesting and at times attractive, i prefer to call my self gay. Even though i'm still getting used to it, i know it's the right thing to do. *do note that there are MANY sexualities, you can also be queer.. Meaning you belong to the lgbtq+ community but just don't want a specific label. You can also be biromantic and homosexual. It's all okay. Have a nice day! ",
            "date": "Answered March 11, 2019",
            "views": "53",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Otis Saroke",
                    "user_href": "/profile/Otis-Saroke"
                },
                {
                    "user_id": "Naylo Peters",
                    "user_href": "/profile/Naylo-Peters"
                },
                {
                    "user_id": "Carl Fredrickson",
                    "user_href": "/profile/Carl-Fredrickson-4"
                },
                {
                    "user_id": "Bengt Lindvall",
                    "user_href": "/profile/Bengt-Lindvall"
                },
                {
                    "user_id": "Peter Bateman",
                    "user_href": "/profile/Peter-Bateman-9"
                },
                {
                    "user_id": "Mario Jacobs",
                    "user_href": "/profile/Mario-Jacobs"
                },
                {
                    "user_id": "Julio Lopez",
                    "user_href": "/profile/Julio-Lopez-49"
                },
                {
                    "user_id": "Ruthann Jerome",
                    "user_href": "/profile/Ruthann-Jerome"
                },
                {
                    "user_id": "Janiyah",
                    "user_href": "/profile/Janiyah-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Eigel",
                "href": "/profile/Andrew-Eigel-1"
            },
            "answer_text": "Ok, let me make something very clear. That flamboyant guy who is so tooootally gay you see on the TV all the time, or the butch lesbian you see fixing cars and watching football whilst drinking a cold one with the boys. Yeah, those are stereotypes. Sexuality in itself has absolutely no effect on such behavior whatsoever. Of course, most people assume these stereotypes as the majority, as these are usually very extroverted personalities, thus, they are the most visible, and when it’s associated with homosexuality, that tends to be the only part of the community that’s seen. So there is some truth to the stereotype, but that’s far from all gay people, if even most, if even a significant percentage. A good amount of gay people, you probably wouldn’t be able to deduct their sexuality as easily as the stereotyped personality - in other words, a good amount of gay people, if not most gay people, act mostly like straight people, you just don’t know it, because they’re not making a huge show if effeminacy or masculinity that isn’t typical for their gender identity. ( Which isn’t to say there’s anything wrong with acting that way, the problem simply lies in the fact that it’s a stereotype, and not a very healthy one for people outside of the LGBTQ+ community to be grouping all gay people in ) I myself am gay, and I’ve been told that I’m mostly straight-passing. While I’m certainly not the most masculine macho-man on the face of the Earth, and do have a few minor feminine-oriented tendencies, I don’t really outwardly do much that adheres to the stereotypes of my sexuality, nor is the fact that I’m gay terribly obvious to most people in general. Most of my other gay friends are the same way, though some others are closer to the stereotype. Regardless, the point is just like straight people, gay people are diverse in personality, their sexuality has no direct effect on that, period. ",
            "date": "Answered December 17, 2017",
            "views": "983",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Farid Arceo",
                    "user_href": "/profile/Farid-Arceo"
                },
                {
                    "user_id": "Grant Leed",
                    "user_href": "/profile/Grant-Leed"
                },
                {
                    "user_id": "Nur Nugrahani",
                    "user_href": "/profile/Nur-Nugrahani"
                },
                {
                    "user_id": "Han Rijckswert",
                    "user_href": "/profile/Han-Rijckswert"
                },
                {
                    "user_id": "Boris Hawthorgh",
                    "user_href": "/profile/Boris-Hawthorgh"
                },
                {
                    "user_id": "Mike Miller",
                    "user_href": "/profile/Mike-Miller-168"
                },
                {
                    "user_id": "Zachary Clark",
                    "user_href": "/profile/Zachary-Clark-9"
                },
                {
                    "user_id": "Jeremy Lewis",
                    "user_href": "/profile/Jeremy-Lewis-34"
                },
                {
                    "user_id": "Micheal Loisele",
                    "user_href": "/profile/Micheal-Loisele"
                },
                {
                    "user_id": "Kai Hyakuya",
                    "user_href": "/profile/Kai-Hyakuya"
                },
                {
                    "user_id": "Kai Spangenberg",
                    "user_href": "/profile/Kai-Spangenberg"
                },
                {
                    "user_id": "Andrea Georgina Rodríguez Prenza",
                    "user_href": "/profile/Andrea-Georgina-Rodríguez-Prenza"
                },
                {
                    "user_id": "Luna Siikavaara-Wester",
                    "user_href": "/profile/Luna-Siikavaara-Wester"
                },
                {
                    "user_id": "Sam George",
                    "user_href": "/profile/Sam-George-103"
                },
                {
                    "user_id": "Zac Davis",
                    "user_href": "/profile/Zac-Davis-16"
                },
                {
                    "user_id": "Sophie Banks",
                    "user_href": "/profile/Sophie-Banks-6"
                },
                {
                    "user_id": "Alex Soofari",
                    "user_href": "/profile/Alex-Soofari"
                },
                {
                    "user_id": "Alec Connell",
                    "user_href": "/profile/Alec-Connell"
                },
                {
                    "user_id": "Elena Kovacevic",
                    "user_href": "/profile/Elena-Kovacevic-1"
                },
                {
                    "user_id": "Sam Murray",
                    "user_href": "/profile/Sam-Murray-2"
                },
                {
                    "user_id": "Trinity Soto",
                    "user_href": "/profile/Trinity-Soto"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gayy Upreti",
                "href": "/profile/Gayy-Upreti"
            },
            "answer_text": "If you go by the stereotypes then you might be able to tell but not 100% of the time but in vast majority of cases it is really hard to tell. For example at my workplace there was a guy who has now left the company and he is gay. And by looking at him you won’t think even in your wildest of imagination that he is gay because he doesn't tick any of the typical gay stereotypes in the gay checklist. I mean there are certain gay stereotypes and being flamboyant is one of the major ones among them. But the guy I’m writing about is at the opposite end of flamboyancy. He is a perfectly straight acting gay guy. Masculine and a ladies man. He pretends good to be straight and many slutty type women were also secretly wished him to be their boyfriend. In fact one girl was totally infatuated by his looks and typical male characteristics. They were seen so much together that people thought they were going to marry. But ah the unlucky girl got infatuated after a guy who is gay. The girl was totally infatuated with the good looking gay guy and the gay guy was totally head over heels for another guy. Yes the gay guy totally and madly fell in love with another guy at the work place. But my point here is its very hard to tell if someone is gay by the way they look. You can be sometimes right sometimes not. ",
            "date": "Answered June 11, 2019",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rajasekar Manikandan",
                    "user_href": "/profile/Rajasekar-Manikandan"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Geare",
                "href": "/profile/John-Geare"
            },
            "answer_text": "I can’t. But someone who IS gay (or lesbian) might be able to classify strangers in a social setting, such as a bar or club. Or church. Or where you work. Or a train. I say so because my gay friends and I would hang out together in various settings, and these guys (or gals) would call ’em out to me. “How do you know?” I would ask. And they always had an answer; maybe the way someone walked, a hair style, something about wardrobe, or something about the way the target looked at others. Its a science, I yell ya! And while their internal radars made me a more keen observer of those around me, I never was able to achieve the same “vibe” my friends seemed to have. But I can tell you what it ain’t. The limp wrist, effeminate mannerisms, etc.? Not reliable measures. Possible indicators, yes. But not a positive ID. My suspicion is that people who prefer others of their gender will tend to back me up, on this. How do they do it? I dunno. Hope that helps. ",
            "date": "Answered November 28, 2017",
            "views": "11",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Iskandar Zulkarlnain",
                    "user_href": "/profile/Iskandar-Zulkarlnain"
                },
                {
                    "user_id": "Landon Bray",
                    "user_href": "/profile/Landon-Bray-2"
                },
                {
                    "user_id": "Chris Fuhes",
                    "user_href": "/profile/Chris-Fuhes"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kira Clark",
                "href": "/profile/Kira-Clark-2"
            },
            "answer_text": "Thanks for the A2A! I don't like to assume things, but since the word ‘gay' was used, I'm going to assume that you are talking about a guy. Imagine scenario #1 You were approached by another guy that was interested in taking you out on a date. You say that you'd like that. You two hit it off, go on a few more dates, then you go with him back to his house one night. Now imagine scenario #2 You were approached by a woman that was interested in going out to dinner with you tomorrow night. You say that you'd pick her up at 7 to take her out. You two hit it off, go on a few more dates, then she invites you in for a drink when you take her home. It is now time for you to think about which scenario you could see yourself acting out. If scenario #1 is the most likely, you are probably gay. If scenario #2 is the most likely, you are probably straight. ",
            "date": "Answered June 30, 2017",
            "views": "3",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Madison Bowling",
                    "user_href": "/profile/Madison-Bowling-3"
                },
                {
                    "user_id": "Medindie Victoria",
                    "user_href": "/profile/Medindie-Victoria"
                },
                {
                    "user_id": "Alex Moral-Ortega",
                    "user_href": "/profile/Alex-Moral-Ortega"
                },
                {
                    "user_id": "Pat Hatch",
                    "user_href": "/profile/Pat-Hatch-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Daniels",
                "href": "/profile/Michael-Daniels-312"
            },
            "answer_text": "You just know, are you a guy? Do other guys get you horny, your gay. Do Girls get you horny youre straight. Me im gay 100%, how do i know. When i think about a sexual partner its a man. If look at porn it gay porn. If i think about a pefect date im with a man. I guess if you think about who would you want to be with sexually, and who do you think would give you the most pleasure and just as important who do you think you want to give that pleasure to. If its a guy your gay. Imagine being with some one, you have had a nice date when you get back to wherever, you start making out, your hands are exploring each other the kissing is becoming more passionet , you start taking off clothes your moving towards the bed. Still kissig touching , your on the naked holding your partner kissing grinding each other. Your both to hot to stop your going to have sex you pause to grab a comdom. Ok are you with a man or a women? ",
            "date": "Answered October 19, 2019",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aviraj Parab",
                    "user_href": "/profile/Aviraj-Parab"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lucienne LeBeau",
                "href": "/profile/Lucienne-LeBeau"
            },
            "answer_text": "The general consensus is if you are attracted to men exclusively and are a man, then you are gay. If you are a man who is attracted exclusively to women, you are straight. Plot twist: if you are attracted to either men or women within the binary (and this includes trans people because trans men are men and trans women are women), you are bisexual. If you are attracted to a person regardless of gender including intersex, etc. (i.e., you don’t give a shit what gender they identify as), then you’re pansexual. The reality is that pansexual and bisexual often intersect and overlap. The individual is allowed to define it as they see fit. Epilogue: Only you can answer this question for yourself. No one has the right to dictate your sexuality to you. ",
            "date": "Updated March 17, 2019",
            "views": "22",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Colston Sinatra Lipford, Jr.",
                    "user_href": "/profile/Colston-Lipford"
                },
                {
                    "user_id": "Hope Jenner",
                    "user_href": "/profile/Hope-Jenner"
                },
                {
                    "user_id": "Michael Strong",
                    "user_href": "/profile/Michael-Strong-36"
                },
                {
                    "user_id": "Jason Trent",
                    "user_href": "/profile/Jason-Trent-8"
                },
                {
                    "user_id": "Quinton Finn MacDonald",
                    "user_href": "/profile/Quinton-Finn-MacDonald"
                }
            ]
        },
        {
            "author_info": {
                "name": "Melody Villa",
                "href": "/profile/Melody-Villa"
            },
            "answer_text": "Thanks for the A2A. It's really simple, but first I should point out how those aren't the only two sexual orientations. It's not one or the other. But since you narrowed it down to those two, we’ll deal with them. You're going to need two decent people, one of the same sex and one of the opposite. Date each of them for three months. Take note of how you feel about them sexually, emotionally, and physically. Especially make sure to focus more on how their gender affects your attraction. Break up with them after the time period. Think of who you really felt into. Think if you were extremely reluctant or even repulsed from doing with them. There are a lot of factors that impact your attraction. Their personality might skewer the results, however you might notice that you prefer one personality over the other. If you don't want to do that, then you take the very simple way: going through life. Usually in your 20’s you have a good idea of who you're into. Sexual orientation isn't something you should test. It's very fluid and you can be a variety of things you thought you never were. ",
            "date": "Answered June 30, 2017",
            "views": "51",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Abhishek Singh",
                    "user_href": "/profile/Abhishek-Singh-7445"
                },
                {
                    "user_id": "William Fausz",
                    "user_href": "/profile/William-Fausz"
                },
                {
                    "user_id": "Benjamin Collins",
                    "user_href": "/profile/Benjamin-Collins-16"
                },
                {
                    "user_id": "Geoffrey Walker",
                    "user_href": "/profile/Geoffrey-Walker-5"
                },
                {
                    "user_id": "Michael Herrington",
                    "user_href": "/profile/Michael-Herrington-7"
                },
                {
                    "user_id": "Pat Hatch",
                    "user_href": "/profile/Pat-Hatch-3"
                },
                {
                    "user_id": "Megan Ee",
                    "user_href": "/profile/Megan-Ee"
                },
                {
                    "user_id": "PJ Clarke",
                    "user_href": "/profile/PJ-Clarke-2"
                },
                {
                    "user_id": "Zach Maysonet",
                    "user_href": "/profile/Zach-Maysonet"
                }
            ]
        },
        {
            "author_info": {
                "name": "Guy Birkbeck",
                "href": "/profile/Guy-Birkbeck"
            },
            "answer_text": "The best answer to this question came from Carol Burnette. Sexually: ‘You are what turns you on\" Note that there is no external verification defined in this definition. YOU react to what turns YOU on. No parrents/teachers/’friends' or relations have a vote. Only you. If when you are with a member of the same sex and you are sexually attracted, some part of you is gay. If you also get aroused by a person of the opposite sex, perhaps you are bi. Doesnt matter what the world ‘labels' you as, its what turns u on. Accepting it is another hurtle that may take you a while to come to acceptance (or denial, there are many of these folk… unfortunately). In the end, you have to live with YOU. Be kind to yourself and your loves It is ok You are NOT alone ",
            "date": "Answered July 5, 2019",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Smithen",
                "href": "/profile/John-Smithen-3"
            },
            "answer_text": "Put it in context - remember it’s a sexual preference, then ask another question: Do you think that you can often tell if someone prefers brunettes?Do you think that you can often tell if someone is into thighs or breasts? Unless they are being very obvious about it, none of these are easily answered with quick interactions. The amount of time required would correlate very well with the amount of effort a person is putting into not putting out signals. For example, it would be easier to determine if someone is indeed into you sexually at a bar than at a board meeting; the signals are more obvious (and acceptable) in one location over the other. Similarly, some folk are better at picking up signals, or are just simply more observant - a guy might not realise he’s being blatantly scoped out by another guy because that simply doesn’t enter his mind-space that another guy would do that, whereas a woman might be used to constantly getting attention, even the most subtle of cues, from men, that when she doesn’t, it’s completely obvious to her. And vice versa, too. ",
            "date": "Answered May 2, 2019",
            "views": "953",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chris Dobro",
                "href": "/profile/Chris-Dobro"
            },
            "answer_text": "Do you consistently, over several years (3–4 years) find yourself being attracted to, thinking about, creating relationships with, considering having sex with a person of the same sex as yourself? If yes, you are likely gay. Does same-sex porn turn you on, disgust you, do you have strong feelings for it, do you seek it out, secretly or openly? If yes, you are likely gay. Do you seek out and desire romantic and emotional connection, attachment, fun, activity with a person of the same sex? If yes, you are likely gay. Do you read erotic stories featuring same-sex relationships, connections, sex? If yes, you are likely gay. ",
            "date": "Answered January 25, 2019",
            "views": "12",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Swapnil-430"
                },
                {
                    "user_id": "Javier Rodetigez",
                    "user_href": "/profile/Javier-Rodetigez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Austin Bungard",
                "href": "/profile/Austin-Bungard-1"
            },
            "answer_text": "Honestly, it’s a rough journey for a lot of people. Me, I figured out I was gay early on through many interactions. It’s all about the experience, all about how you feel. If a woman sparks something within you, you probably have an attraction to females, same goes for men. The most important thing is to never, let anyone influence who you are. No matter what people around you say, its all about YOUR feelings. Throughout experimentation, sexual and not, you will eventually come to a conclusion whether you are straight, gay, or fall “in-between.” Sexuality is very tough, because not everybody understands, because not everybody has gone through the struggle of finding their identity. ",
            "date": "Answered October 29, 2019",
            "views": "1",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Swapnil-430"
                },
                {
                    "user_id": "Joe Roberts",
                    "user_href": "/profile/Joe-Roberts-41"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pomonodo Yeo",
                "href": "/profile/Pomonodo-Yeo"
            },
            "answer_text": "Firstly see your dating history and your emotions.If they were not sastifying or felt weird when you were in a straight relation than you might not be fully heterosexual.However you must also think of whether you have ever felt sexual or emotional attraction to the same sex.I would recommend watching youtube coming out videos or related lgbtq vids cause they tend to cover how they discovered their real sexuality and like sofia said you may not to actually identify yourself right now but you should just reflect and speak to lgbt friends or chats if you can to reach out and ask their experience.That way you can slowly find out if you can relate.However there is no sure way to find out cause sometime sexuality is fluid so yeah. ",
            "date": "Answered November 15, 2018",
            "views": "14",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Mac",
                    "user_href": "/profile/John-Mac-255"
                },
                {
                    "user_id": "Stephen Muriira",
                    "user_href": "/profile/Stephen-Muriira-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Renee Wilton",
                "href": "/profile/Renee-Wilton"
            },
            "answer_text": "Do you feel sexual or romantic attraction towards the same gender? If yes, you may be gay. If no, you are straight. Do you feel sexual or romantic attraction towards the opposite gender? If yes, you may be straight. If no, you are gay.  If you answered yes once, you are the corresponding sexuality. If you answered yes twice, you are bisexual If you answered no, you are asexual or aromantic  This is overly simplified, as there are other genders, and bisexual is attraction to the same as you and others (your gender and all other genders), but you asked specifically about straight or gay. Which has gender correspondance. ",
            "date": "Answered June 29, 2017",
            "views": "18",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Swapnil-430"
                },
                {
                    "user_id": "Michael Belisle",
                    "user_href": "/profile/Michael-Belisle-2"
                },
                {
                    "user_id": "Pat Hatch",
                    "user_href": "/profile/Pat-Hatch-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carlin Sherman Shannon",
                "href": "/profile/Carlin-Sherman-Shannon"
            },
            "answer_text": "As others have said, appearance has NO impact on a person’s sexuality whatsoever. Everyone, and I mean everyone, thinks I’m straight. When they learn otherwise, they’re all pretty surprised. So apparently, I don’t “look gay”. I play softball, which is stereotypically a lesbian sport. Last year, my best friend said “I bet you’re the only straight one on your team.” I had only come out to one other person at that point, and I took my chance and ran with it. “Well, actually…” - and that’s how I came out to my best friend. Appearance doesn’t matter. A person can dress feminine, masculine, androgynous, colorful, monochromatic, bright, dull, patterned or plain, have long hair or short, wear makeup or not… it doesn’t matter. Their orientation(s) are unaffected by their choice of appearance (though sometimes the opposite can be true - orientation can affect choice of appearance). Basically, anyone can be gay, straight, bi, pan, poly, ace, aro. Looks have nothing to do with it. ",
            "date": "Answered December 16, 2017",
            "views": "239",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jonathan Rider",
                    "user_href": "/profile/Jonathan-Rider-2"
                },
                {
                    "user_id": "Daniel",
                    "user_href": "/profile/Daniel-898"
                }
            ]
        },
        {
            "author_info": {
                "name": "Qamar Santiago",
                "href": "/profile/Qamar-Santiago"
            },
            "answer_text": "Straight: When you’re straight, you are sexually attracted to members of genders other than your own, but not for those of the same gender as you. Gay: When you’re gay, you’re only sexually attracted to members of the same sex and you don't have sexual or romantic feelings for the opposite sex. Only you can determine who you feel sexual attraction to. Think about: Do you imagine yourself kissing a boy or kissing a girl? What feels more comfortable to you? Who do you find more attractive?  Sources: How Do I Know If I Am Gay? Signs You Are Gay - Gay - Gender | HealthyPlace How to Know if You Are Gay ",
            "date": "Answered June 19, 2017",
            "views": "17",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pushkar Parmar",
                    "user_href": "/profile/Pushkar-Parmar"
                },
                {
                    "user_id": "Musaf Syed",
                    "user_href": "/profile/Musaf-Syed"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Theriault",
                "href": "/profile/Paul-Theriault-1"
            },
            "answer_text": "Simple. Inspect your fingernails. Take a good long hard look at them. Then see below for whether or not you are a homosexual male (this test only works on males). . . . . . . . . . . . . . . .. . . . . . . . . . . . .. . .. Ok, so if your palm was facing you with your fingers curled over the palm(s), congratulations, you are straight. If your palm was pointed down or away from you with the fingers straight out so you are looking at the back of your hand, you are likely gay. No applause. ",
            "date": "Updated June 25, 2019",
            "views": "17",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Edmund Hambridge",
                    "user_href": "/profile/Edmund-Hambridge"
                },
                {
                    "user_id": "Max Baldassarre",
                    "user_href": "/profile/Max-Baldassarre-1"
                },
                {
                    "user_id": "Quinn Davis",
                    "user_href": "/profile/Quinn-Davis-49"
                },
                {
                    "user_id": "Dakota Long",
                    "user_href": "/profile/Dakota-Long-9"
                },
                {
                    "user_id": "Steve Cowan",
                    "user_href": "/profile/Steve-Cowan-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Justin Hinkley",
                "href": "/profile/Justin-Hinkley"
            },
            "answer_text": "Step 1. Watch a lot of different kinds of pornography, once. Step 1.5 If a minor, don’t get caught by parents. Step 1.75. Don’t watch kiddie porn, it’s like super duper illegal. Step 2. What do you find yourself watching again now that’ you’re not watching it just this once? You have now discovered whether you are gay or straight, and probably a whole lot more detail than that. I take no responsibility for the other things you have now discovered about yourself. ",
            "date": "Answered June 20, 2017",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Steve Alexander",
                    "user_href": "/profile/Steve-Alexander-62"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gaurav",
                "href": "/profile/Gaurav-933"
            },
            "answer_text": "Yes , though your question does not make sense to me still I am going to answer it. The term straight looking is pretty vague. Ok let’s assume you mean people who are not like the ones you have seen in Bollywood movies those clumsy hand movements and all. And my entire answer will be based on this assumption though masculinity and femininity is a very deep subject on it s own if you wish I would recommend you to read some gender text. Any ways coming back to your question. I am an example of the person what you will call a straight looking gay man. I am masculine, independent and strong. The first time I told my friend that I am gaY. His reaction was like no way may be you just needed an easy hole or something on that terms.People in my office and College assumed that I am kind of a player as i am always on my phone. Little did they know I am struggling with my life. In my batch I was famous or infamous as a stud.I am not very good looking or something on that terms but I get hit on regularly by girls may be because of sense of humour or the way I carry myself. Unfortunately I gay guys don’t hit that much on me.4. last in community, there are all spectrum people from masculine to effeminate . So get your head out of the Bollywood shit and think. But lastly I would say being a masculine gay is easy than the effeminate in our society but both of them are sides of the same coin. thanks for the patience. ",
            "date": "Answered March 25, 2018",
            "views": "153",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jim Grossmann",
                "href": "/profile/Jim-Grossmann"
            },
            "answer_text": "Can you tell if someone is gay by the way they look? Only if the gay person in question is interested in advertising his sexual orientation—or can’t help it. If a man is swishing his overtly effeminate way through a gay pride celebration, then chances are that he’s homosexual. However, most homosexual men act like most heterosexual men. In fact, prejudice against effeminate gay men is unfortunately common in the gay male community. Bottom line: You usually can’t tell whether someone is gay just by looking at them. ",
            "date": "Answered November 28, 2017",
            "views": "629",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lance Hansen",
                "href": "/profile/Lance-Hansen-23"
            },
            "answer_text": "There is no one answer(trust me if there was I would scream it from the roof tops),but when I wa questioning my sexual orientation I asked myself how I saw myself on my wedding day. I imagined my self standing there with a man infount of me then a woman. I felt happier when I was standing with the woman than the man. I also started to notice I would glimpse at girls buts so that was a pretty clear indicator too that lead to the conclusion me being gay. This may or may not work for you but I hope it helps ",
            "date": "Answered June 19, 2017",
            "views": "796",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sadicha Padhy",
                "href": "/profile/Sadicha-Padhy"
            },
            "answer_text": "I don't understand this question. Not from the point of feigned ignorance but from the point of lack of perspective. I mean how is a fully straight person supposed to look like? I am very gay and I don't think I find myself different( appearance wise) from any of my peers. So simply put, there's no difference. And thus it's possible for a straight looking person( whatever that is) to be gay. ",
            "date": "Updated January 1, 2018",
            "views": "251",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bhargav",
                    "user_href": "/profile/Bhargav-88"
                },
                {
                    "user_id": "Srinivas Rao Gujjar",
                    "user_href": "/profile/Srinivas-Rao-Gujjar-1"
                },
                {
                    "user_id": "Rhea Sanjan",
                    "user_href": "/profile/Rhea-Sanjan"
                },
                {
                    "user_id": "Tanvi Bharadwaj",
                    "user_href": "/profile/Tanvi-Bharadwaj"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alan Marble",
                "href": "/profile/Alan-Marble"
            },
            "answer_text": "Look yourself in a mirror, and ask yourself: “Am I gay?” If the answer is not yes, then you are not gay. Ask yourself: “Am I straight?” If the answer is not yes, then you are not straight. If you are neither, then you are something else. But here’s the thing: it is a question only you can answer. No one can tell you if you are gay, straight, or something else entirely. No online quiz will tell you. No litmus test exists. Really. Your orientation is contingent entirely upon how you self-identify, and that is it. ",
            "date": "Answered June 19, 2017",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jewelle Escalona",
                    "user_href": "/profile/Jewelle-Escalona-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kurt Gandenberger",
                "href": "/profile/Kurt-Gandenberger"
            },
            "answer_text": "i believe you will know your sexuality by the content of your dreams and how you interact with others. i think you can tell if someone is gay by how they act if someone attractive walks by. if a beautiful woman walks by, the heterosexual males all crane their necks to get a better view. if a beautiful man walks by the gay guys act in a similar fashion. after a while, your best friend can probably tell you your sexuality by how you act and react. ",
            "date": "Answered June 20, 2019",
            "views": "641",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lewis Little",
                "href": "/profile/Lewis-Little-1"
            },
            "answer_text": "At it’s simplest, it’s like this:  Count “Sometimes” as “Yes.” If any of your answers are “Maybe” or “I’m not sure”, then you’re not experienced enough to understand your own sexuality yet, so go outside and get a bit more life-experience, and keep doing that until your “Maybe”s and “Not Sure”s turn into “Yes” or “No”. ",
            "date": "Answered December 9, 2018",
            "views": "39",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bob Ross",
                    "user_href": "/profile/Bob-Ross-718"
                },
                {
                    "user_id": "Adelisa Bašović",
                    "user_href": "/profile/Adelisa-Bašović"
                },
                {
                    "user_id": "William Joseph",
                    "user_href": "/profile/William-Joseph-78"
                },
                {
                    "user_id": "Kenan Asceric",
                    "user_href": "/profile/Kenan-Asceric"
                },
                {
                    "user_id": "Marier Villarreal",
                    "user_href": "/profile/Marier-Villarreal"
                },
                {
                    "user_id": "Joseph Salkeld",
                    "user_href": "/profile/Joseph-Salkeld-2"
                },
                {
                    "user_id": "Mark Whorlow",
                    "user_href": "/profile/Mark-Whorlow-1"
                },
                {
                    "user_id": "Pasant Elsaid",
                    "user_href": "/profile/Pasant-Elsaid"
                },
                {
                    "user_id": "Elizabeth Rue",
                    "user_href": "/profile/Elizabeth-Rue-2"
                },
                {
                    "user_id": "Henry Sears",
                    "user_href": "/profile/Henry-Sears"
                },
                {
                    "user_id": "Danielle Kullman",
                    "user_href": "/profile/Danielle-Kullman"
                },
                {
                    "user_id": "Rowan Pollard",
                    "user_href": "/profile/Rowan-Pollard-1"
                },
                {
                    "user_id": "George Smith",
                    "user_href": "/profile/George-Smith-1085"
                },
                {
                    "user_id": "Maya Smith",
                    "user_href": "/profile/Maya-Smith-51"
                },
                {
                    "user_id": "Henry Brice",
                    "user_href": "/profile/Henry-Brice"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ishan Shrivastava",
                "href": "/profile/Ishan-Shrivastava-19"
            },
            "answer_text": "A person does not look straight or gay. You ask him/her whether they are straight or gay. If a person gets turned on sexually by watching other people of the same sex then only they are gay otherwise they are straight or bisexual. So, at the end don’t assume people to be straight or gay just by their looks or habits. ",
            "date": "Answered December 15, 2017",
            "views": "367",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chigozie Jc",
                    "user_href": "/profile/Chigozie-Jc"
                },
                {
                    "user_id": "Bhargav",
                    "user_href": "/profile/Bhargav-88"
                },
                {
                    "user_id": "Raj Acharya",
                    "user_href": "/profile/Raj-Acharya-34"
                },
                {
                    "user_id": "Gautam Gehlot",
                    "user_href": "/profile/Gautam-Gehlot"
                },
                {
                    "user_id": "Fawad AkramTm",
                    "user_href": "/profile/Fawad-AkramTm"
                },
                {
                    "user_id": "Daniel",
                    "user_href": "/profile/Daniel-898"
                },
                {
                    "user_id": "Vishal Singh",
                    "user_href": "/profile/Vishal-Singh-2268"
                }
            ]
        },
        {
            "author_info": {
                "name": "Austin McKenna",
                "href": "/profile/Austin-McKenna-1"
            },
            "answer_text": "If they kiss someone of the same gender on the lips that’s usually a good indicator. There’s also if they tell you they’re gay. Also most guys have the “voice.” I’m sure you know what I’m talking about but listen to Tyler Oakley for an example if you don’t. They are also often flamboyant or have good fashion sense. Another thing is women who wear flannel or have extremely short hair like short even for a guy. Also colored hair that is a color hair wouldn’t normally be. So bright red but not maroon for example. However the only definite sign is them telling you that they’re gay. I recently learned from an experience of a friend that the voice isn’t 100%. ",
            "date": "Answered October 10, 2020",
            "views": "54",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jo Marsh",
                    "user_href": "/profile/Jo-Marsh-11"
                },
                {
                    "user_id": "Janki Singh",
                    "user_href": "/profile/Janki-Singh-2"
                },
                {
                    "user_id": "Devin Ryan",
                    "user_href": "/profile/Devin-Ryan-52"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shelly Warmuth",
                "href": "/profile/Shelly-Warmuth"
            },
            "answer_text": "You don’t decide. It’s not a decision. If you don’t know—if you’re not attracted to one sex or the other, then it’s not an issue for you yet. When you become attracted to someone and you want to have sex, you’ll know. It really is that simple—you will feel it when you want to give yourself to another person and want to feel them in your arms. ",
            "date": "Answered January 24, 2019",
            "views": "548",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard Werkhoven",
                "href": "/profile/Richard-Werkhoven"
            },
            "answer_text": "Do you need to know? When you have gone through life and not experienced any attraction to someone of the same gender - then you will know. Technically if you experience attraction to someone of the opposite gender then you rule out being 100% gay. But that leaves being Bi or whatever. The labels are unhelpful - why are you trying to label yourself? And why are you asking? ",
            "date": "Answered November 19, 2018",
            "views": "872",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Cassandra Armondale",
                    "user_href": "/profile/Cassandra-Armondale"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Alford",
                "href": "/profile/Tom-Alford-2"
            },
            "answer_text": "You can usually tell a zebra from a horse by the way they look. You can also tell a squirrel from a skunk by sight. You should be able to tell a dalmatian from a bulldog. The list goes on and on, but if you can tell someone is gay from the way they look please tell me so I can be sure not to hit on any straight guys! Thanks! ",
            "date": "Updated July 17, 2018",
            "views": "424",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marcus Crow",
                "href": "/profile/Marcus-Crow-1"
            },
            "answer_text": "hello you gay son of a nigga! Well, to start with, when you watch porn, what gender do you look at? If you look at the man’s willy, you are gay. If you look at the woman’s juicy puss puss, they you are straight. If you can’t wank, your probably too young to know. Just hope for the best and hope that your not gae. ",
            "date": "Answered June 6, 2019",
            "views": "117",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alex Duval",
                "href": "/profile/Alex-Duval-8"
            },
            "answer_text": "If you see a man having sex with another man, they might be gay. Other than something that obvious, no. I'm straight as an arrow, but wear glittery nail polish on my toes during the summer. It doesn't make me gay, it just means I like having sparkly toes. ",
            "date": "Answered December 5, 2017",
            "views": "200",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Joe Anslevich",
                    "user_href": "/profile/Joe-Anslevich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anubhav Sharma",
                "href": "/profile/Anubhav-Sharma-108"
            },
            "answer_text": "Let’s get one thing clear: one’s sexuality has nothing to do with how they behave. Whenever I used to say that I am a gay, many people would start questioning if I am effeminate. Sometimes, people have also given me a look that ‘you don’t look gay’. It’s an absolutely obsolete thought that gay equals to effeminate behaviour. Gay is about feeling and emotions and not about if you’re straight acting or not. Let’s not connect these two things and focus on what’s important. So, coming back to your question, yet, a straight acting and straight looking person can be gay, and an effeminate guy can be straight. I hope I answer your question. ",
            "date": "Answered December 18, 2017",
            "views": "215",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Daniel Brown",
                    "user_href": "/profile/Daniel-Brown-570"
                },
                {
                    "user_id": "Tanvi Bharadwaj",
                    "user_href": "/profile/Tanvi-Bharadwaj"
                },
                {
                    "user_id": "Ishan Shrivastava",
                    "user_href": "/profile/Ishan-Shrivastava-19"
                }
            ]
        },
        {
            "author_info": {
                "name": "Philippa Alderton",
                "href": "/profile/Philippa-Alderton"
            },
            "answer_text": "Are you sexually attracted to your own gender? Then you’re either gay or bi. If you’re attracted to both genders, you’re likely bi- if ONLY (or sometimes, primarily) to your own gender, you’re probably gay. Either way, you’re probably a good person, if, perhaps, a bit naive. ",
            "date": "Answered January 21, 2018",
            "views": "123",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kenneth Terry",
                    "user_href": "/profile/Kenneth-Terry-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Trevor Geng",
                "href": "/profile/Trevor-Geng-2"
            },
            "answer_text": "By paying attention to who you are attracted to. Do you get that funny feeling in your stomach when you look at someone cute? What gender does that to you? The same gender? The opposite? Both? Or maybe something in-between? Pay attention to who catches your eye. Notice who you are unconsciously drawn to, who to catch yourself staring at. ",
            "date": "Answered November 17, 2018",
            "views": "192",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alexus Vallejos",
                "href": "/profile/Alexus-Vallejos"
            },
            "answer_text": "It may take a while to figure out your interest as you grow up and go on with life because a person is finding there true self around the age of 20 but you would have to think deep down which sex arousels you most or that you most interested in or it could be the possibility that you are into both sex’s meaning that you may be bisexual. ",
            "date": "Answered March 19, 2018",
            "views": "129",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lisa Smeraldi",
                "href": "/profile/Lisa-Smeraldi"
            },
            "answer_text": "What turns you on? What makes you “horny?” Who do you find yourself attracted to? Do you have any gay friends you can talk to? What kind of questions do you ask yourself and do you trust yourself to be honest? In this day and age, I don’t know if that’s the most important question to ask. How about “how do I want to live my life?” Good luck and enjoy the journey to yourself ",
            "date": "Answered November 16, 2018",
            "views": "569",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sumner Callahan",
                    "user_href": "/profile/Sumner-Callahan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karen Kessler",
                "href": "/profile/Karen-Kessler-10"
            },
            "answer_text": "You will know when you know. It will reveal itself to you in your fantasies, in your physical response to stimulation, in your emotional attachments. And you might not be gay and/or straight. There are other variations of sexuality. But you will know what gets you excited, when it does. Just go with it. ",
            "date": "Answered March 19, 2018",
            "views": "410",
            "upvotes": " Answer requested by Jason Trent",
            "upvoters": [
                {
                    "user_id": "Daniel",
                    "user_href": "/profile/Daniel-898"
                },
                {
                    "user_id": "Daniel Brown",
                    "user_href": "/profile/Daniel-Brown-570"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joe Roberts",
                "href": "/profile/Joe-Roberts-41"
            },
            "answer_text": "It's pretty simple. When you are alone, when you know with absolute certainty that nobody else is going to know what you did, and you are masturbaring to orgasm, about which gender are you fantasizing? Anecdotally, my understanding is that the great majority of post-adolescent straight people never have to ask themselves this question. ",
            "date": "Answered June 19, 2017",
            "views": "541",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Cameron Morse",
                "href": "/profile/Cameron-Morse-12"
            },
            "answer_text": "Uh, a person’s looks don’t always correlate with their sexuality. If we could tell who was gay and who wasn’t just by looking at them, then there’d be no point in being in the closet or coming out. ",
            "date": "Answered December 15, 2017",
            "views": "92",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kevin Pan",
                    "user_href": "/profile/Kevin-Pan-11"
                },
                {
                    "user_id": "Oisini Poddar",
                    "user_href": "/profile/Oisini-Poddar"
                },
                {
                    "user_id": "Abhishekh Kumar",
                    "user_href": "/profile/Abhishekh-Kumar-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kunal Aggarwal",
                "href": "/profile/Kunal-Aggarwal-57"
            },
            "answer_text": "In short, yes it is. Looks can be deceiving. Nobody can surely tell about a person’s sexual orientation by just looking at them. ",
            "date": "Answered January 23, 2018",
            "views": "273",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sumner Callahan",
                    "user_href": "/profile/Sumner-Callahan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kaeleigh Bo",
                "href": "/profile/Kaeleigh-Bo"
            },
            "answer_text": "Ask yourself these questions… Do men turn you on (a.k.a. make you horny)?Do you only find men attractive?If you answered yes to any of these questions, then yes, you could be, ESPECIALLY if you answered yes to the 2nd question. I personally am a polysexual, look it up, it is one of those unknown but slightly common sexualities. ",
            "date": "Answered November 16, 2018",
            "views": "562",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Zachary Coltrane",
                    "user_href": "/profile/Zachary-Coltrane"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gord Campbell",
                "href": "/profile/Gord-Campbell-6"
            },
            "answer_text": "Not likely. Attraction to the hot sex, or the sex that tilts your pinball machine usually forms early in the teens, if not earlier. In theory, you could try a gay relationship. Nothing in the world preventing it. But will you get the same fulfillment post fooling around. ",
            "date": "Answered January 30, 2018",
            "views": "84",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alejandro van Rooy",
                    "user_href": "/profile/Alejandro-van-Rooy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zenon Kogut",
                "href": "/profile/Zenon-Kogut"
            },
            "answer_text": "If you’re sexually aroused by the opposite sex - you’re heterosexual/straight. If you’re sexually aroused by the same sex- you’re homosexual/gay. If you’re sexually aroused by both sexes - you’re bisexual. ",
            "date": "Answered March 19, 2018",
            "views": "853",
            "upvotes": " Answer requested by Jason Trent"
        },
        {
            "author_info": {
                "name": "Nasya Smith",
                "href": "/profile/Nasya-Smith-1"
            },
            "answer_text": "If you are sexually and/or romantically attracted to the same sex, you are gay. If you are sexually and/or attracted to the opposite gender, you are straight. If you are sexually and/or romantically attracted to both, you are Bisexual and the list goes on and on. ",
            "date": "Answered July 3, 2017",
            "views": "234",
            "upvotes": " Answer requested by Pat Hatch"
        },
        {
            "author_info": {
                "name": "Nick Lilavois",
                "href": "/profile/Nick-Lilavois-1"
            },
            "answer_text": "How do you know for certain if you’re gay? Look at these photos. Which one do you like more?     ",
            "date": "Answered June 12, 2019",
            "views": "1",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Peter Hendriks",
                "href": "/profile/Peter-Hendriks-7"
            },
            "answer_text": "Some guys come across as totally straight in the way the look, behave and talk, but they are still gay and open about it. So there is no hard hitting rule. ",
            "date": "Answered November 28, 2017",
            "views": "176",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sergio Jara",
                "href": "/profile/Sergio-Jara-2"
            },
            "answer_text": "No gay people come in all diffrent colors race and personailtys but there are he stero types that can be spoted ",
            "date": "Answered November 30, 2017",
            "views": "112",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stevens Romero",
                "href": "/profile/Stevens-Romero"
            },
            "answer_text": "If you like men not girls at all. Unless your a girl so mean no guys at all. Lesbians and gays rock! ",
            "date": "Answered November 16, 2018",
            "views": "158",
            "upvotes": "0"
        }
    ]
}