{
    "title": "How can it be explained that the mind is physical? - Quora",
    "tags": [
        "The Mind"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sunil Dutt",
                "href": "/profile/Sunil-Dutt-211"
            },
            "answer_text": "The answer is an attempt , for that which is the cause of all explanations in the world or an effect of all reflections of the world we live in in essence is to merge in objective subjective union i.e that which is termed as observer and observed is to become one. In absolute basic language , the pristine form in which one is born with where no knwoledge of the world exists , but the physical form of body is to be touched, the reason being all knwoledge of what ever kind one lives in later on is due to the reflections of the mind in or of that form. How? or what and why ? etc , these questions have been there for human form of intellect since day one of its coming on earth and that has been the reason for all the explanations of the objective world we live in. That which is manifested or tangible in this world including us is physical , this physics has been self explained by human intellect in a scientific manner and at the end of it all , i.e in and through all diverse qualities in the physical world , that which is at hand is at core is a touch , just a semblance of a touch that is there connected with the bodies or forms in the world including our own form and is termed as quantum mechanics. All manifested forms are related to in objectivity through and though with their diverse qualities which are being lived ,interacted with in day to day life irrespective of their negative and positive effects on life at their own end or in their own end are connected to the form by the same touch. This subatomic touch , this wave particle touch is what is to be first found in self, it sounds absurd, for in our mundane and objective relativity of the world , this touch is impossible to be enlivened. What all has been taught in mediation by different gurus of different eras in what ever way is nothing but a conveyance of the self seeking of this touch of the same conscious unity found by science in all diversity. If and when this meditation gets a break through , the first physical touch of that consciousness or first reflection of that touch is that mindfulness, here fullness is to be understood as the literal touch around the head , which hitherto was involved in summing up or reckoning the objective forms of the world. The first physical touch of the mysterious mind therefrom not only reflects its own self fully , but reflects all that which is there in and through the touch of consciousness in being . ",
            "date": "Answered March 4, 2020",
            "views": "42",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "T. Stephen Cornelius",
                "href": "/profile/T-Stephen-Cornelius"
            },
            "answer_text": "It's chemical. BTW…You did think to physically type and post symbols we call letters. What we can do is recognize when the brain is damaged… so, too, our mindful state. What might that suggest? We do not fully as yet have come to know just what is the embodiment we call mind or awareness. But, the dead are not mindful of being so, I know this. I've asked several of them this question contending with those I knew who died I had to identify. They didn't seem to mind being dead or maybe just content not to have to talk to me … I don't blame them for that, as at times I find talking to the living seems as if they are mindlessly dead🙄😊 or maybe it's me? ",
            "date": "Answered March 4, 2020",
            "views": "28",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ben Smith",
                "href": "/profile/Ben-Smith-1539"
            },
            "answer_text": "What else can it be? I suppose it depends on the definition of physical. Quantum physics is physical (at least according to its name). Common everyday meaning of physical and what QPs means don’t tally. So really it’s just a question of word meaning: what do you mean by physical? My personal feeling is that everything is physical, everything. If physics doesn’t cover something then that’s a shortfall of physics not that the something falls outside physics IMO. Just to add to this, IMO QPs and psychology/thought/mind are the same thing. ",
            "date": "Answered March 4, 2020",
            "views": "43",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bev Anne",
                    "user_href": "/profile/Bev-Anne-1"
                },
                {
                    "user_id": "Bruce Johnson",
                    "user_href": "/profile/Bruce-Johnson-51"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thomas Mattison",
                "href": "/profile/Thomas-Mattison-1"
            },
            "answer_text": "Mind definitely appears to launch from known physical activities, however it additionally has properties that to date are unmeasurable and therefore unknown. Because of that it is invalid to presume that mind is “only” physical using the current definition of that term, or that it is not accessible via other physical means besides an organic bio-neurological network. ",
            "date": "Answered March 4, 2020",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stathis Papaioannou",
                "href": "/profile/Stathis-Papaioannou"
            },
            "answer_text": "The mind is not itself physical, but it supervenes on a physical process, in the same way that a computer program supervenes on a physical process but is not itself physical. ",
            "date": "Answered March 9, 2020",
            "views": "9",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pertti Ruismäki",
                "href": "/profile/Pertti-Ruismäki"
            },
            "answer_text": "No way. The mind is not physical. Thoughts have no measurable physical properties. ",
            "date": "Answered March 4, 2020",
            "views": "25",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Deepak Chughani",
                    "user_href": "/profile/Deepak-Chughani"
                }
            ]
        }
    ]
}