{
    "title": "How does wisdom deal with suffering? - Quora",
    "tags": [
        "Wisdom"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sabri Shahin",
                "href": "/profile/Sabri-Shahin"
            },
            "answer_text": "Sometimes we ask, “why does God allow suffering, cruelty, or birth defects?”. Some people blame God for that. People should avoid making conclusions without knowing all the facts and without seeing the full picture. This stage of life is not the end of it; If the person who was born blind is rewarded better rewards in the hereafter and becomes happy and satisfied; then we do not have to feel sad for him. If the parents of the dead child and the dead child are rewarded better rewards in the hereafter; then we do not have to feel sad for them. Since our life on earth is not the end of it; and since we do not know the full details, it is wrong to make inaccurate conclusions. Although God knows what’s in our hearts and what each of us might do, he tests us and wants us to witness our own test results in order to admit that we have been fairly rewarded according to our achievements as recorded in the test results Before the wealthy father distributes his wealth, he may want to record which son is obedient, the records are not for the father who knows, but as a testimony for people who might question the justice of their father Although the wise teacher knows the hard-working student and the lazy student, he prepares regular exams as testimonies so that the students would not say that the teacher had favored some students over the others. Exams also urge students to get prepared in order to succeed Students should not wonder about the intention of the teacher; they are supposed to focus on what the teacher asked them to do If there are no sickness or birth defects, people would say that the healthy children are results of the normal work of nature Our life on earth is a very short period compared to the universe time scale; It could be a temporary test period. The obedient son who takes care of others should be rewarded better than the disobedient son who persecutes others. Testing missions are not supposed to be easy and comfortable. The test questions are not supposed to be known in advance. There are hundreds of verses and teachings about that test as mentioned in the following answer: https://www.quora.com/How-do-we-... We have been asked to believe in God and Heaven but we have not seen God or heaven. Our fate will be determined based on that belief and on our good deeds. Why did God make it a difficult test for us? If God wants to set up the testing environment to test people, then we are not supposed to advise God on how to set up the terms and conditions of the testing. The students are not supposed to advise the teacher on how to prepare the exams. God has created us, and he knows how to test us. The testing questions and answers are not supposed to be disclosed before the exam; testing environment necessitates some doubts and enables different choices and different decisions. The test does not depend on the level of education, a child may say ‘I do not see the plane any more, it is going far away, it is still there but my sight does not reach it; God must be there but my sight does not reach him’, but a scientist might conclude that, ‘I do not see God, then there is no God’. The test does not depend on wealth, race, or culture, we may find two persons from the same family with the same level of education and experience, one of them is atheist and one is a religious person. The test does not depend on the level of religion education, maybe someone who never heard of the religion teachings could pass the test based on the natural original gifts of conscience and reason ‘What I do not want done to myself, I will not do to others’. We may find some scholars who know the religion teachings but they accept to persecute and torture others, those are the bad trees which the prophets have warned us of them and of their bad fruits. The wise teacher sets different evaluation criteria for different grades; the students in the first grade are not evaluated as the students in the advanced degrees. We expect that the fair and wise God would evaluate people according to what they have been provided. The person who never heard of Prophets would have an easier test based on the gift of intelligence and conscience; he might get rewards for his good works and he might not be punished if not wicked. God does not predetermine plans for us. God has delegated that task to us, it is up to us to be blessed or to be cursed. The message that God has revealed to all prophets is: ‘Blessings for obedience and curses for disobedience’ All prophets taught that we can earn salvation by obedience, repentance, and good deeds to help others. “In obedience and repentance is your salvation” Isaiah 30:15 Based on the above, the obedient believer should be blessed in this life and should be saved in the afterlife. That is the truth which should set you free ",
            "date": "Answered February 18, 2019",
            "views": "59",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bill Sliedrecht",
                    "user_href": "/profile/Bill-Sliedrecht"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Davies",
                "href": "/profile/John-Davies-120"
            },
            "answer_text": "It learns that it is intrinsic to life, it is part of existence and in that sense is unavoidable and can be thought of as a hugely important part of life. Suffering can be made into an art form, if you think people avoid it they don't, they actively move towards it in some cases. If pain is part of your role, if you love to bleed or feel deep emotions that are personally acceptable to you it can even be addictive. Wisdom teaches you why, who and where your suffering comes from and where it begins and ends for others. You can see that your avoidable suffering is based in trauma and is a role, a very well practised role, but a role nonetheless. You can typecast yourself or find who you are and your own meaning and stop the rot. This is hugely difficult and entails huge change internally, you will question you, your life, your decisions, your thinking, who thought you were alongside seeing life and others through a different lens. You now have a choice. ",
            "date": "Answered February 18, 2019",
            "views": "93",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Melissa Plettell",
                    "user_href": "/profile/Melissa-Plettell"
                },
                {
                    "user_id": "Bill Sliedrecht",
                    "user_href": "/profile/Bill-Sliedrecht"
                },
                {
                    "user_id": "Laura Steene",
                    "user_href": "/profile/Laura-Steene"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Follows",
                "href": "/profile/Paul-Follows"
            },
            "answer_text": "Focus right in the centre of the pain. Then look right into the centre of the centre. You’ll find the pain vanishes for as long as you can sustain the concentration on that centre of the centre. When you experience this you have just experienced a glimpse of your Enlightened mind that has always been here but is covered by pain and craving even in your dreams. The deluded ordinary mind can be pierced like this at any time. It is the easiest way to glimpse the absolute like an expert Buddhist monk. Wisdom doesn’t deal with suffering. Suffering ceases to appear to when wisdom is manifest. ",
            "date": "Answered February 18, 2019",
            "views": "107",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bill Sliedrecht",
                    "user_href": "/profile/Bill-Sliedrecht"
                },
                {
                    "user_id": "Shay Posey",
                    "user_href": "/profile/Shay-Posey"
                },
                {
                    "user_id": "Kūdo Shinichi",
                    "user_href": "/profile/Kūdo-Shinichi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike David",
                "href": "/profile/Mike-David-1"
            },
            "answer_text": "Perspective. Knowing that I am not the only one. Knowing a great many people have it much much worse. Being able to focus on those aspects of circumstance that are not miserable. Finding the best in every situation. Being able to focus on other people and helping them ease their miseries. Providing patience when everything is dark knowing it will get better. Understanding even misery is transient. Eventually we all die and being alive, even while suffering, is better than being dead, for the most part. Having a choice on how to live with misery and how to live with other people and help make their day and mine better or more miserable. ",
            "date": "Answered February 18, 2019",
            "views": "33",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bill Sliedrecht",
                    "user_href": "/profile/Bill-Sliedrecht"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jake Stone",
                "href": "/profile/Jake-Stone-92"
            },
            "answer_text": "Wisdom has taught me that desire is the root of all suffering. I try to the best of my ability, to be a minimalist in a capitolist society, plagued by consumerism. I always spend time in deliberation when I think I desire something. Asking myself what the consequence will be to my “want”. ",
            "date": "Answered February 18, 2019",
            "views": "21",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bill Sliedrecht",
                    "user_href": "/profile/Bill-Sliedrecht"
                }
            ]
        }
    ]
}