{
    "title": "How are Physics and free will related? - Quora",
    "tags": [
        "Relativity (physics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cory Rockwell",
                "href": "/profile/Cory-Rockwell"
            },
            "answer_text": "Quantum physics! Determinism! Double slit experiment! Compatibilism! How to make sense of all this? If you already have a general understanding of these scientific and philosophical topics you may be disappointed in my alternative answer: semantics. In my opinion the most accurate answer to the question “how are physics and free will related?” is entirely dependent on how we define free will. Yes, the nature of causality is important don't get me wrong! But have you ever noticed how every other attempt at an answer carries the assumption that we all agree what free will entails? If you define free will as having the capacity to take any action you want at any time, it's time to rethink that assumption. There are some things you can't choose to do, even if you are able. Thankfully most people adopt a less extreme approach: that we have at least some range of choice between possible actions. Not as hard to accept right? On the other hand, maybe you are a compatibilist and you believe that deterministic physics is true, but that it is inherently compatible with free will. Or your definition could be something else entirely. It doesn't matter. Ultimately it all depends on how you define free will. This is because physics is an objective phenemenon independent of our experience of it, whereas free will is a concept invented by humans. It is subjective. We decide what it means. It's apples to oranges. Well... maybe a better comparison would be like π to cake. One is a mathematical constant, the other is a term for something whose meaning depends on how we define it. Just like physics and free will. ",
            "date": "Answered December 12, 2018",
            "views": "86",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Matt Rockwell",
                    "user_href": "/profile/Matt-Rockwell-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karthikeyan Thangaraj",
                "href": "/profile/Karthikeyan-Thangaraj-3"
            },
            "answer_text": "It all relates between what is called quantum entanglement. Which Einstein was said to refer as spooky action at a distance. So, according to general relativity, nothing (including information) can travel faster than light. This was very well tested and established by various experiments in large scales. But quantum theory almost always has conflicts with general relativity. One such quantum experiment is called double slit experiment. It was a standard experiment in which you send particles from the source through two parallel slits and let them fall on the screen ahead which shows a interference pattern like this  The experimenters had a crazy idea to find how this interference occurs. So they introduced a filter between one of the slits and the screen and hence they can find which particles come from which slit. But when they did it, something unexpected happened. They saw this  And they were like, “hey particles, are you kidding us???” And repeated the test with various filters and other kinds of testing methods. But whenever they used a method to differentiate, they got the second result. Otherwise they got the first one. It was like someone is giving them information. So they used quantum entanglement method. They send a particle through a quantum mirror and it produces two entangled particles as it's output. The beauty with quantum entangled particles is that they always have spins opposite to each other and by measuring one particle, you can find the state of other. Knowing this, the physicists told, “Checkmate particles. Now i am going to send one particle to the slit and it's twin to a mirror where it will bounce off till its twin hits the screen and then i will decide whether to observe or not observe. Then we can find whether it causes interference or just hit the screen straight”. When they did the experiment, they were shell shocked. Because, whenever they didn't observed, the pattern emerged and whenever they did observe, the corresponding particles had hit the screen straight as if they already knew which particles the scientists would choose to observe… This had a few common interpretations… The most common one is the copenheigen interpretation. In this, the particles have a wavefunction which when observed, collapses to their positions. Which can be associated with the common thought experiment called shrodinger’s cat. Which states that both are equally possible but only when we observe, we get the correct answer.The interpretation that is referred in the question is deterministic theory in which everything is pre planned and are just cause and effect and there are no chaces that the future will be different because no one can change it. The particles are there because the future is fixed and we will observe only those particles.As I said, this is not the widely accepted interpretation and the existence of quantum mechanics shows that free will might exist. But we can't know for sure. ",
            "date": "Answered October 8, 2016",
            "views": "30",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tom Slijkerman",
                "href": "/profile/Tom-Slijkerman"
            },
            "answer_text": "When a brick flies towards your face, you will probably duck as a result of a very quick imagination of what was about to happen if you didn’t. So the conclusion might be that the brick hitting your face was not inevitable. You clearly avoided it. So you might come to conclude our physical world can’t be deterministic, since you changed the course of physics. But the thing is that this is following a very particular mental perspective: the imagination of a brick hitting your face. The virtual reality of this thought isn’t real at all. But we have a common blind spot for thinking itself being part of the flow of physics. Like the thought was not directed by influences. Were you ever not going to duck? It all boils down to this: Is it physically possible to change anything about this present moment? Can you change the current momentum of any object, including that of your own body?Can you change your current mental intentions about what you are about to do?This moment is completely out of your reach, right? … All we’ll ever have is moments precisely like that… … So the real question is how are these unchangeable moments connected to each other? How did the content of this current moment evolve from the previous one, if we were completely powerless over that previous one? Is there any influence of “free will” between all these unchangeable “nows”? According to quantum physics the relation between moments is of a probabilistic nature. So, not entirely predictable, even if we’d know all the previous states that have influence, yet not entirely random either. ",
            "date": "Answered March 8, 2019",
            "views": "104",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Narayanan Palani",
                    "user_href": "/profile/Narayanan-Palani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Atharva Musale",
                "href": "/profile/Atharva-Musale-2"
            },
            "answer_text": "This is a great question, do we really have something like free will or we are destined to lead lives as we do…!!! It was my 12th standard , our physics teacher was teaching us gravitation. At the end of the class we ended up discussing about the same topic . Now, consider a planet about 100 light years away with an alien civilization. They are looking at earth and what they see is the earth of 1917. Maybe they see Albert Einstein waiting to get recognized, or the freedom struggle in India , they are seeing our past ( which is present for them ) but we are living in 2017. So , Einstein or Gandhi make the exact same choices as they did , they don’t know it yet , but all that has already happened…!!! This is known as pre-deterministic universe. Early scientific thought often portrayed the universe as deterministic – for example in the thought of Democritus and some thinkers claimed that the simple process of gathering sufficient information would allow them to predict future events with perfect accuracy. This all changed when Modern Science came into picture. Quantum Mechanics predicts events only in terms of probabilities, casting doubt on whether the universe is deterministic at all, although evolution of the universal state vector is completely deterministic. Current physical theories cannot resolve the question of whether determinism is true of the world, being very far from a potential Theory of Everything, and open to many different interpretations. Assuming that an indeterministic interpretation of quantum mechanics is correct, one may still object that such indeterminism is for all practical purposes confined to microscopic phenomena.This is not always the case, many macroscopic phenomena are based on quantum effects.A more significant question is whether the indeterminism of quantum mechanics allows for the traditional idea of free will (based on a perception of free will). If a person's action is, however, only result of complete quantum randomness, and mental processes as experienced have no influence on the probabilistic outcomes (such as volition), this in itself would mean that such traditional free will does not exist (because the action was not controllable by the physical being who claims to possess the free will).So to summarize : It’s controversial and has no specific answer…!!! Check this out for more information : Free will - Wikipedia Hope it helped…!!! ",
            "date": "Answered November 14, 2017",
            "views": "419",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "AKSHAY PATEL",
                    "user_href": "/profile/AKSHAY-PATEL-539"
                },
                {
                    "user_id": "Aravind Soman",
                    "user_href": "/profile/Aravind-Soman-4"
                },
                {
                    "user_id": "Athang Ghag",
                    "user_href": "/profile/Athang-Ghag"
                },
                {
                    "user_id": "Sagar Gowda",
                    "user_href": "/profile/Sagar-Gowda-17"
                },
                {
                    "user_id": "Abhishek Kumbhar",
                    "user_href": "/profile/Abhishek-Kumbhar-14"
                },
                {
                    "user_id": "Vaibhav Chid",
                    "user_href": "/profile/Vaibhav-Chid"
                },
                {
                    "user_id": "Atharva Musale",
                    "user_href": "/profile/Atharva-Musale-1"
                },
                {
                    "user_id": "Nivedita Tiwari",
                    "user_href": "/profile/Nivedita-Tiwari-25"
                },
                {
                    "user_id": "Aarav Jha (आरव झा)",
                    "user_href": "/profile/Aarav-Jha-आरव-झा"
                },
                {
                    "user_id": "Saumitra Joshi",
                    "user_href": "/profile/Saumitra-Joshi-10"
                },
                {
                    "user_id": "Minal Bhosale",
                    "user_href": "/profile/Minal-Bhosale-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dinesh Ramakrishnan",
                "href": "/profile/Dinesh-Ramakrishnan-5"
            },
            "answer_text": "As perfect and as precisely as how you understand, ‘PROBABILITY’!!! Do you really think you understand that completely? Edit: Free will is very much related to this concept at the core of physics! I don't mean to rudely shout out in uppercase letters. But why? I can't understand or atleast imagine this. Human mind is much far from this concept and is very ‘entangled’ with the surroundings(for the sake of using fancy words!). So you and I can't really understand that! Probability itself says that something only ‘may' happen! So it's not the most reliable mathematical tool but we still can't help it. ",
            "date": "Updated October 3, 2016",
            "views": "40",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sabri Shahin",
                "href": "/profile/Sabri-Shahin"
            },
            "answer_text": "All people practice free well everyday Every action we do many times each day like self-constraints or resisting temptations proves the free well The following links include more detailed answers: https://www.quora.com/How-do-we-know-our-purpose-of-existence-in-this-world/answer/Sabri-Shahin https://www.quora.com/What-makes-us-happy-in-our-lives/answer/Sabri-Shahin https://www.quora.com/Is-eternal-hell-fire-true/answer/Sabri-Shahin https://www.quora.com/What-are-Gods-greatest-teachings/answer/Sabri-Shahin https://www.quora.com/Will-religions-ever-stop-competing-against-each-other-Do-you-think-there-ever-be-a-time-of-cooperation/answer/Sabri-Shahin https://www.quora.com/How-do-we-reconcile-science-and-the-existence-of-a-god/answer/Sabri-Shahin https://www.quora.com/What-is-worse-than-dying/answer/Sabri-Shahin https://www.quora.com/What-are-the-foundations-of-happiness/answer/Sabri-Shahin ",
            "date": "Answered December 12, 2018",
            "views": "26",
            "upvotes": " Answer requested by Gary Chan"
        },
        {
            "author_info": {
                "name": "Stathis Papaioannou",
                "href": "/profile/Stathis-Papaioannou"
            },
            "answer_text": "Some people think that if the world is deterministic, we do not have free will. Whether the world is deterministic or random is a question for physics. However, the philosophical question of free will is hardly ever about whether the world is deterministic or random, but rather about whether in fact we can be free if our brain processes are determined, whether randomness provides freedom, whether morola responsibility is compatible with determinism, and so on. These are all philosophical questions and have nothing to do with physics or any other empirical science. ",
            "date": "Answered December 13, 2018",
            "views": "12",
            "upvotes": " Answer requested by Gary Chan"
        },
        {
            "author_info": {
                "name": "Jeff Berkowitz",
                "href": "/profile/Jeff-Berkowitz-1"
            },
            "answer_text": "Dr. Sabine Hossenfelder has thought very deeply about this subject and written about it many times. These are links to her blog. Some posts include links to her other publications on the arxiv and also an FQXi essay contest award winner. Note that her views have changed over time, so it’s important to read through all her writings before stating that she does or does not support a particular viewpoint. Backreaction blog free will ",
            "date": "Answered December 12, 2018",
            "views": "20",
            "upvotes": " Answer requested by Gary Chan"
        },
        {
            "author_info": {
                "name": "Ragesh Nair",
                "href": "/profile/Ragesh-Nair-10"
            },
            "answer_text": "Physics is outcome of lack of freewill. Because things are away from our will that is why we are trying to study them as physical reality. Imagine if we could create things at will then we already know everything about that thing. But it is not happening so we are trying to convert things For suitability. ",
            "date": "Answered December 13, 2018",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Peter Lewicke",
                "href": "/profile/Peter-Lewicke"
            },
            "answer_text": "Physics and Logic state that everything is caused by prior causes, and that means that free will is an illusions. Even though we have the impression that we are making decisions, the decisions were results of causes that we are not consciously aware of. ",
            "date": "Answered December 12, 2018",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Avun Jahei",
                "href": "/profile/Avun-Jahei"
            },
            "answer_text": "It contradicts classical physics, because every event was seen as unambiguously determined by previous events. Obviously there can’t be free will. In quantum physics that is different, because you can only assign a certain probability to an event. Modern physics therefore has nothing to say about the existence of a free will. ",
            "date": "Answered December 12, 2018",
            "views": "8",
            "upvotes": "0"
        }
    ]
}