{
    "title": "How does consciousness change with awareness? - Quora",
    "tags": [
        "Self-Awareness",
        "Consciousness",
        "Neuroscience"
    ],
    "response": [
        {
            "author_info": {
                "name": "Terry Vestal",
                "href": "/profile/Terry-Vestal"
            },
            "answer_text": "How does consciousness change with awareness? Conscious — aware of and responding to one's surroundings; awake; having knowledge of something; aware. Consciousness [is] awareness so the question is not sensible. The better question is how do you make your conscious/awareness more complete or how do you achieve the awareness the human mind was ordered by the force to achieve. The answer is you become aware of the superior conscious of the system thinkers and read them at the expense of the non system thinkers. The best way to break into system thinking is to read the system of Adam Smith. Once you understand you are reading a system and not a disconnected set of principles, read David Hume’s system of human nature. Hume’s system of human nature is the foundation of Smith’s system of social science as well as an important proof or corroboration of Darwin’s system of evolution and vice versa. And the same can be said with the system of Adam Smith; Smith’s invisible hand powered by self-interest in the environment of perfect competition and perfect liberty is an evolution of critical understanding (think “in the cards”) on top of Darwin’s across-the-board evolution; even though it, with Hume’s system of human nature as support, was an offshoot of evolution, the awareness was necessary for evolution itself to come into the human mind. It was the human mind that unraveled this out of site phenomenon that only presented aspects of itself — each environment of the earth supported different animals and the human animal progressed differently depending upon its environment. Smith’s system worked to destroy ancient misunderstanding; there was a faulty awareness that preached passions are to be corrected or even destroyed. By presenting them in a natural setting where they played an important role that evolved and explaining that they were “original existences” that couldn't be destroyed only worked with, an awareness Smith was not the first to be aware of only guilty of a more complete or heightened awareness of critical connections, ancient misunderstanding that was a barrier to allowing the mind to follow natural probable reason was corrected. Thus an important path of think was cleared for Darwin. The story of the critical importance of the Mediterranean Sea to evolution of human cultureIt is a clear antecedent to the story of evolution itself. Because it is a true story (gleaned by probable reason) of what happened after the animal had evolved and opened the door to the bigger story of evolution (gleaned by the same talent — the art of probable reason), it is a clear antecedent awareness. It is a case where a lessor awareness whereas misunderstanding and superstition was bumped from the mind, paved the way for the bigger or all-inclusive awareness that is evolution. ",
            "date": "Answered October 10, 2020",
            "views": "71",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Hartig",
                "href": "/profile/Michael-Hartig-2"
            },
            "answer_text": "Disclaimer: i have a common Knowledge on things, because of my demanding job and education, but it simply is not my focus, because I am interested in new ways to see things, please be aware when reading my comments. This is tricky to answer, what is conciesness, it can also be the opposite of what one see as conciesness and then via detours lead to a final cociesness. awareness is attention to things around one, Consciousness is realizing the awareness. i say Baruch Spinoza did alot of thinking here ",
            "date": "Answered October 10, 2020",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Karl Jansson",
                "href": "/profile/Karl-Jansson-4"
            },
            "answer_text": "According to Attention Schema Theory consciousness is the brains model of attention. So when you change your awareness (attention) to something else you also become conscious about that something else. ",
            "date": "Answered October 11, 2020",
            "views": "26",
            "upvotes": "0"
        }
    ]
}