{
    "title": "How does one succeed in life? - Quora",
    "tags": [
        "How to Succeed",
        "Becoming Successful",
        "Important Life Lessons",
        "Life and Living",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Altucher",
                "href": "/profile/James-Altucher"
            },
            "answer_text": "I had millions of dollars from selling a business and then I lost it all. I lost home. I had the IRS all over me. Then I lost my family. Then all my relationships fell apart. My friends and family from the year 2000 no longer talk to me. I take that back. One friend from the year 2000. I built back up. Built another business. Sold it. Bought another house. Then lost the money and lost the house. Lost my friends. I changed my definition of success. This is my new definition: CONNECTION: Being with people I love who love me. NO TOXIC PEOPLE. For better or worse, I have a “one strike and you’re out” policy. We wear this bag of skin for only so long.COMPETENCE: Find the things I love, get good at them, even a little bit, every day.FREEDOM: When I do something I don’t want to do, I feel resentment, I don’t do a good job, people get upset, and I lose track of who I am. If you don’t make the choices in your own life then someone else will and the results won’t be as good for you.This is hard to do. It’s not about “ building good habits”. I put that in quotes because so many bullshit self-help writers think it’s about habits. A “habit” is “make the bed” or “brush your teeth every day.” And it’s not about goals. Again, many self-help gurus say “have big goals”. “Think big or die small”. Blah blah. This is BS also. If all you have is a big goal you’re guaranteed to not make it. When I was going to shoot myself in the head I started to figure out what was important to me. And ever since then I’ve had success. In the past few years I’ve written many bestselling books. I’ve built an almost $100 million in revs. business that’s still growing. I have great friends that I love. My family is better than ever. I have a podcast that’s had over 70,000,000 downloads. And, my biggest achievement: I’m a Top Quora Writer for five years in a row. I’m in control of most of the decisions of my life. And I’m ok with the decisions I have no control over (it’s raining today, for instance, so I have a raincoat). I have a cough today but I’m carrying cough drops. I hope it gets better. But I don’t care. I’m looking forward to going to the hex game cafe later and playing board games.  I’m sick of interviewing billionaires and world champions. So boring. They all say the same things. But they speak the language of success. I’ve learned so much by interviewing them. None of what they say is a surprise. But actually putting it to work and seeing the results right in front of me is proof that these ideas, these processes they put in place, have worked for them. They’ve worked for me also. But I think I’m a little lazy. I like to bingewatch TV also.  A) VALUES: What do you stand for? I ask this to people and they say stupid shit like, “I want to help entrepeneurs succeed”. Or, “I want to help people communicate better.” I don’t mean to be harsh. But really check yourself to see if anyone gives a shit about what you say. For me: I want to be honest with the people around me. I want to do the things in life that I love (and that changes almost every day). And when I say I will do something: I overpromise and then deliver. That beats out the people who think they are smart by “underpromising”. That’s the strategy of a loser. I want to be healthy and creative. I want to entertain. I want to raise children to be good adults. I want desperately to not care what people think about me. I want to treat people with grace and respect and not care about the consequences. If I help myself, share how I do it in an entertaining way, then I can hope for the best. Oh, and whatever I am interested in: I want to be a threat.  B) PERSISTENCE If you improve 1% a day at the things you love, then very quickly you find obstacles. 1% a day equals 3800% in a year when compounding. How do you improve? “Plus, Minus, Equal”. This was told to me by the greatest ultimate fighting champion ever: Frank Shamrock. Find your Plus: a mentor or group of mentors, even if they are virtual (an author, someone on Youtube, etc). Find your Equals: people who are moving up the chain with you that you can compare notes with. Find your Minus: people who you can teach to. If you can’t teach, then you don’t understand what you’re supposed to be teaching.  (with former MMA world champion Frank Shamrock) Business is a great example. Some people are great at building a one million dollar business. But at ten million in revenues, there are a different set of problems. And at $100,000,000 there is a greater set of problems. Success means viewing problems as opportunities for solutions. In business, relationships, family, friendships, writing, art, etc. If you don’t have problems to persist through then you’ve stopped getting better and life will get worse.  C) PATIENCE I’ve asked 400 of the most successful people in the world what they did when they were at their worst. How did you survive? Almost always the answer is: WAIT. Keep being healthy. Keep writing down ideas. Keep being honest and helping friends and doing good. But don’t force anything in your career or life. Henry Winkler (the actor who played “The Fonz” on Happy Days in the 70s), told me during his NINE dark years of no acting that the worst thing he could have done was force it. Instead, he kept his network alive. He learned how to produce and direct. And gradually he got back into acting. Last season, on “Barry”, he helped that show get 13 Emmies. When you thrash, you crash. Just be quiet. Don’t move too much. Be calm. Be patient. Life rewards the patient.  (me and “The Fonz” at the comedy club, Standup NY, I am part-owner of). D) READY. FIRE. AIM Sara Blakely, the wealthiest self made woman in the world (she created Spanx) got her first big order and had only a few weeks to deliver. The problem: she didn’t have a manufacturer. So she found one. She was lit on fire and had to put that fire out. So many people plan plan plan. Analysis paralysis. Have the idea. Get the order. Then figure it out. Want to swim. Get thrown in the water. Don’t drown. Have a story. Write it down. Then edit the grammar and make a second, third, fourth draft of the story. Richard Branson didn’t buy 10 airplanes and then start Virgin Air. He called Boeing, convinced them to LEND him a plane for a year. Then got a route from the US to England. THEN started Virgin Air, which he sold for billions.  (Sara built Spanx (example in the image) into a multi-billion business without any fashion experience. She just wanted to help women feel better) E) OBSESSION When you love something, you’ll WANT to do it in every spare moment. You’ll read about it. You’ll watch videos. Get mentors. Talk about it with friends. Study the nuances. Start trying it for yourself. And on and on. The one who is obsessed will beat out the person who is not obsessed. Why? Simple: the person who is not obsessed will NEVER know the nuance and subtleties. I once started a business that combined my interests in writing, investing, and programming. All my prior obsessions. Three months into developing my idea I realized I had a ton of competition. But I could tell they weren’t obsessed. They weren’t a threat. I got millions of users with a month. I sold my company for $10,000,000. They all went out of business. Nobody can beat an obsessive.  (Sasha Cohen told me only obsession is what got her a medal in the 2006 Olympics) F) TALENT SEX Scott Adams, the creator of Dilbert, told me, “I’m pretty good at drawing, but not the best. I’m pretty good at writing, but not the best. I’m pretty funny, but not the best, and I’m pretty good at business, but not the best. But I’m probably the best at the combination.” Which is why Dilbert is the top selling syndicated cartoon strip and Scott is probably worth over $100,000,000. When you get pretty good at a lot of things and then combine them: you’ll be among the best in the world at the intersection. List your talents. Start figuring out how to combine them.  (Dilbert) G) VISION Don’t read the news. Read a lot of books by smart people. Here are some starting points: Sapiens by Yuval Harari The Evolution of Everything by Matt Ridley Antifragile by Nassim Taleb Zero to One by Peter Thiel Tiny Beautiful Things by Cheryl Strayed Thinking in Bets by Annie Duke Look around the world. Don’t listen to the people who are screaming and yelling and hating and fighting. Think realistically about what you love doing: where will it be five years from now? For instance, is the 2 party system in America going to last? Will TV shows still be 30 minutes or 60 minutes? Will bookstores exist? Will Uber still exist? Will AI be doing surgeries? Have a vision for where the world is going. Or wait for one (see above). Vision is the mother of invention. H) PERSUASION Every successful person I know, knows how to persuade. Robert Cialdini’s book “Influence” is the Bible of persuasion techniques. BUT, Vision + Obsession + Health makes it easy to persuade others. I) EMPATHY Rule #3 of improvisation is: “Make your scene partner look good.” Nobody gives a shit about you. Stop caring so much about what people think you. Focus on how to make the people around you look good. Then the world around you will look good. Then the center of the world around you will look good. I mean..you.  J) PROBLEM SOLVING get a waiter’s padevery day write down ten ideasWithin six months you will be an idea machine. People will throw problems at you and you will be able to solve them trivially. This is a super power. And with great power becomes great responsibility.  On the TV show “Crashin”, Pete Holmes asks the famous comedian Whitney Cummings, “Can you give me advice? What does it take to succeed?” I love her response. First she said, “I can’t tell you. There’s no answer.” And he begged. “Please just tell me one thing “ She said, “The star is the person everyone else wants to be friends with.” ",
            "date": "Answered August 11, 2018",
            "views": "159",
            "upvotes": " View 2.3K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vijay Ragavan",
                    "user_href": "/profile/Vijay-Ragavan-23"
                },
                {
                    "user_id": "Aftab Alam",
                    "user_href": "/profile/Aftab-Alam-2136"
                },
                {
                    "user_id": "Florian Röske",
                    "user_href": "/profile/Florian-Röske"
                },
                {
                    "user_id": "Melvin Dsouza",
                    "user_href": "/profile/Melvin-Dsouza-14"
                },
                {
                    "user_id": "Sachin Surendar",
                    "user_href": "/profile/Sachin-Surendar-1"
                },
                {
                    "user_id": "Vankatesh Malik",
                    "user_href": "/profile/Vankatesh-Malik"
                },
                {
                    "user_id": "Rajesh Rai",
                    "user_href": "/profile/Rajesh-Rai-616"
                },
                {
                    "user_id": "Peter Shoukry",
                    "user_href": "/profile/Peter-Shoukry"
                },
                {
                    "user_id": "Hari narayana",
                    "user_href": "/profile/Hari-narayana-85"
                },
                {
                    "user_id": "Luka Henigman",
                    "user_href": "/profile/Luka-Henigman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Josh Steinke",
                "href": "/profile/Josh-Steinke-6"
            },
            "answer_text": "How does one succeed in life? Most people think the truth to success are like this Is this the answers you were looking for? I’d hope not. You must work hard or work smartPerseveranceA flare of knowledge or giftedness leading to successYou must be proactive, social, have “confidence” or create effort“Learn from mistakes and failures”You see none of what is listed is true in fact far from it. So how does one succeed in life? The truth is we actually: Don’t know. Most people think they know the answers or truth to how someone succeeds but it’s quite rare to live a life successfully, if it’s even possible. How does one succeed in life? Sacrifices, failures and not so much learning from them but refining, developing and implementing a plan to do better the next time around. This may or may not in reality guarantee success, the hours or efforts you put in don’t matter either. In reality here’s what it actually takes to be successful in life.  It could look something like this, and most people assume in linear progression, but that’s far from true if not true at all. Real success and real improvement in life takes a combination of many things, there will be times you don’t always improve, there will be times of struggle, obstacles, failures and difficulties that come your way. In real life, there’s no set age that you need to have something accomplished by, even if you start business or you plan to do social marketing or have effective strategies to work on your website or your physical business, it could also look something like this as well. Think of how many businesses out there that eventually run out of business or they once were successful but ended up losing business over time? I will also show the realities that “success” isn’t really success at all, but it’s learned through trial and error, mistakes made in your efforts and failed plans that are effective but just didn’t go through with you.  Now you might be thinking, how could the most successful people in the world be wrong about success? And it’s because the truth is not everyone will have the same results the next person had on their experiences or journeys in life. A good example is you could be like JK Rowling, and write a novel, but you will never have exactly her life and have the same exact results she had with Harry Potter Novels. What Bill Gates went through is his own story and nobody else’s. You can’t copy exactly somebody else’s life, you could have the same talents or skills as them, work just as hard but due to the support, fans and loyalty they have, it may not work for you in the same ways it worked for them. You’re not always going to get results no matter how hard you try because it isn’t your fault at all, it’s the reality of implementing that plan or strategy into your game-plan and thinking it’s always going to lead to results. You will experience ups and downs, twist and turns, as well as a longer time to get the results that you want. You see you and so many people have been lied to by the internet. If it were true that you could also reap the results you want every time you put effort or hard work into something, everybody would be out of poverty and the economy would improve in no time but that’s just not the case. You will deal with pain, emotional stress or overload before you’re given just some results due to working smart or hard. You will need to fight your way through life in order to get what you want. If you think i’m wrong take a look at this musician below. Playing the guitar until your hands are bleeding and that also is painful. Think of what they go through before you vision some illusionary view of success which doesn’t exist in reality.  Now it’s true we all must learn from mistakes and failures, but this also doesn’t guarantee results either, it can either work for you or it won’t but even if the plan is just slight improvement than before, you can get there but time and patience is the only thing that will get you to your next goal. If the truth was so simple, we’d all be successful entrepreneurs and businessmen making millions per year just by hard work alone. If it’s sports for example and you want to be faster, stronger and better than before, that’s going to take a long time before you start seeing even the smallest improvements in yourself. The truth isn’t always the truth for everyone as well, few people make it to the top and you can have equal talent, measures and efforts to people’s favorites in life, but for most people it isn’t going to get them anywhere. For every actor, musician or talk-show host you see on TV, there’s also the majority who have failed to get a spot. You also need to realize how rare it actually is to be talented, skilled or a top performer in society. This could be dreams of getting into a great college, great career or in athletics.  Why you shouldn’t care if someone is successful or not? The people we look up to as idols or those who are in respectable careers (scientists, lawyers, politicians, engineers), are in the few and far in between. Not everybody is meant for college or worldwide success. If it were true that success was that easy to accomplish by working hard or putting in the effort, we’re also missing many other counterparts to being successful as well. To do well in school you’d need to study but to perform at a very high, top tier competitive level takes more than just a flare or a knack for studying. People seem to think they know all the reasons for success but will realize that in due part to having a successful internet business, Youtube/business channel, or physical business, while earning enough money to make it into a career, takes being in the high performers which is in the top 0.1%, 2% or 14%. The real answer comes down to one thing which is do you have what it takes to be successful? I also think it ties down not to hard work, or talent or some mutant gene that makes someone better than the rest of the population, but the questions instead. Do you have what it takes to accept risks, failures, plateaus and a huge learning curve to avoid such mistakes in order to learn, grow and go from plan A to plan B? Do you have what it takes? Businesses take risks and huge steps toward improvement (investments and creativity). Are you willing to not be the “average” and do things that are uncomfortable to your well-being? Are you willing to study, learn or do things that not everyone else is doing? The real truth to success The more money you want to make the harder it’s going to be plain and simple. All the social marketing, squeezing the bar or weights until your veins pop out, or implementing social media marketing/having the best editing, social groups and marketing plans aren’t going to do you jack if you don’t realize the reality of it all. If it was true that we all had the answers, all of us would be reaping the rewards of success, we’d all be top athletes, scholars, top scientists or doctors from around the world or world known actors, social-media entertainers, exc. Take it from someone who serves a huge example in the world, one of the best NBA players of all time.  But… after all that’s why you shouldn’t give up. Accept failure/mistakes with an open mind. The next time you are criticized or even reminded by those who don’t like you or think negatively about you, just know that you’re not alone in failing, in fact some of the best people in the world who have reached worldwide success, have had to learn from failures and mistakes so much it’s their career. What people should think instead.. Not every adult or young adult 20–30 years old has got their “life together or in order” according to you or what other people think. In fact you’re not alone in failing or not getting the results that you’d like despite all of your efforts, that’s why life is very real and not something to not be taken seriously. That’s why you need to cherish the small results or even accept the position you’re in now and people will also respect that about you. If it means being median your whole life, that’s a good start to be in, taking small steps toward victory is better than missing a whole bunch of steps (setting your goals too high), and tripping over yourself. What do you have to lose when becoming successful? Everything. You put your life on the line, including yourself, your finances, your failures/struggles, your own investments, the only way is to combat with your talents and to continue no matter what. Can you succeed in life? You could just be aware of all factors and obstacles that come your way. Don’t assume this response is from pessimism or negative thinking it’s not but showing you what anyone could go through during their journeys to success in life. ",
            "date": "Updated January 13, 2020",
            "views": "104",
            "upvotes": " View 78 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Patrick Tay",
                    "user_href": "/profile/Patrick-Tay-7"
                },
                {
                    "user_id": "Michael Ashley Cloyd",
                    "user_href": "/profile/Michael-Ashley-Cloyd"
                },
                {
                    "user_id": "Ashutosh Kumar Upadhyay",
                    "user_href": "/profile/Ashutosh-Kumar-Upadhyay"
                },
                {
                    "user_id": "Will Strahan",
                    "user_href": "/profile/Will-Strahan"
                },
                {
                    "user_id": "Rahul Yaji",
                    "user_href": "/profile/Rahul-Yaji"
                },
                {
                    "user_id": "Gouri Shanker",
                    "user_href": "/profile/Gouri-Shanker-12"
                },
                {
                    "user_id": "Ian Anstine",
                    "user_href": "/profile/Ian-Anstine-1"
                },
                {
                    "user_id": "Mita Patnaik (ମିତା ପଟ୍ଟନାୟକ)",
                    "user_href": "/profile/Mita-Patnaik-ମିତା-ପଟ୍ଟନାୟକ"
                },
                {
                    "user_id": "Nathan Gurr",
                    "user_href": "/profile/Nathan-Gurr-4"
                },
                {
                    "user_id": "Nguyen Ngoc",
                    "user_href": "/profile/Nguyen-Ngoc-4-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karan Meghna",
                "href": "/profile/Karan-Meghna"
            },
            "answer_text": "The miracle of success is that the smallest step towards success attracts more success! Here is a very brief outline of key points for achieving highest level of success. Look into the nearest mirror- The person staring back at you is the only person responsible for your success.Smile back at your reflection- Successful people are cheerful, optimistic and forward thinking. Smile! Positive thinking drives out negative thoughts. Its hard to have a negative thought while smiling.Have positive self esteem- Feel good about yourself and your abilities, achievements and potential. Remind and praise yourself with your past accomplishments.Believe in yourself- God doesn't make extras just to fill the scenery. You are here for a purpose. Find your mission and begin working on it.Desire to be successful- Desire to be success and commit to be success.Associate with successful people- When faced with choices, do what a successful person will do.Avoid negative people- Negative people are toxic, they destroy and don't build. The odds are greater that they will pull you down faster than you can lift them up. Avoid all the whiners, complainers, blamers and thumb suckers.Do what you are best at- Do not stay stuck doing things that are frustrating, boring, unhealthy, unproductive, demeaning or unfulfilling.Write down a vision- Everyday visualize yourself as you would like to be and then act that way!Write down your biggest goal- Success is the result of a personal decision, so start your goal with “I”. Read your goal aloud everyday.Study the science of success- read books, listen to tapes, watch videos and positive TV programmes.Everyday do something that brings you closer to your goal- Never give up. You can only fail if you quit trying. Achieving success requires following a system .Put these key points into practice and see yourself succeed. ",
            "date": "Updated July 2, 2018",
            "views": "853",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ravindra Ghadge",
                    "user_href": "/profile/Ravindra-Ghadge-13"
                },
                {
                    "user_id": "Trey Hallmark",
                    "user_href": "/profile/Trey-Hallmark"
                },
                {
                    "user_id": "Meghna Karan",
                    "user_href": "/profile/Meghna-Karan-1"
                },
                {
                    "user_id": "Mahira Khan",
                    "user_href": "/profile/Mahira-Khan-198"
                },
                {
                    "user_id": "Kumar Rahul",
                    "user_href": "/profile/Kumar-Rahul-376"
                },
                {
                    "user_id": "Anaya Pandya",
                    "user_href": "/profile/Anaya-Pandya"
                },
                {
                    "user_id": "Nysha Ranjan",
                    "user_href": "/profile/Nysha-Ranjan"
                },
                {
                    "user_id": "Sunil Baisoya",
                    "user_href": "/profile/Sunil-Baisoya"
                },
                {
                    "user_id": "Biren Patel",
                    "user_href": "/profile/Biren-Patel-7"
                },
                {
                    "user_id": "Shatrughna Prasad",
                    "user_href": "/profile/Shatrughna-Prasad-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ernie Bray",
                "href": "/profile/Ernie-Bray"
            },
            "answer_text": "Most people don’t realize the difference between success and failure is often very small. If you were headed to the moon and were off just 1 degree, you'd miss your target by 4,169 miles. Simply by changing one’s attitude, working smart, and giving a solid effort, you can achieve amazing results that, otherwise, would seem impossible. Just think, by simply adjusting your course in a positive manner, you can set the odds in your favor to achieve your goals. Here are seven key tips that can tilt the balance in your favor. Focus on continuous improvement. Winners are always looking to find ways to improve their skills and knowledge. The opportunity to keep growing and learning is a lifelong process. You can always get better!Never be satisfied with temporary accomplishments. The moment you think you’ve made it is the moment you’ve failed. Why? Complacency sets in, and you lose the fire inside. Success is only temporary, and you can never take it for granted.Look to lift up those around you. Winners know that teamwork helps achieve big goals. Success happens when you elevate everyone around you. You can’t do it alone.Don’t blame others. Those who focus on making excuses create negativity. Instead of thinking that everyone else is holding you back, focus on what you can do to move ahead and better yourself.Don’t waste time. Winners don’t waste valuable time doing frivolous things that take focus away from their goals. While others party, watch TV, and play video games, winners are pushing ahead on their mission to succeed.Love the process. You have to enjoy the process of achieving the small victories and working to become successful. It will often take more time than you realize, but you have to relish the hard work and the climb. The victory is in the journey.Don’t quit. Many people have amazing talents and skills they don’t even realize exist. They fail because they never even try or they quit too soon. Learning to overcome challenges and perseverence is often the difference between reaching your goals or falling short.",
            "date": "Answered December 31, 2018",
            "views": "676",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Trey Hallmark",
                    "user_href": "/profile/Trey-Hallmark"
                },
                {
                    "user_id": "Glenn Moulton",
                    "user_href": "/profile/Glenn-Moulton"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Prem-Sekar-G-R-प्रेम-शेखर-जी-आर"
                },
                {
                    "user_id": "Ruetima Thamrongsan",
                    "user_href": "/profile/Ruetima-Thamrongsan"
                },
                {
                    "user_id": "Sherif Makkawy",
                    "user_href": "/profile/Sherif-Makkawy"
                },
                {
                    "user_id": "Aallap Sheth",
                    "user_href": "/profile/Aallap-Sheth"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Farkas",
                "href": "/profile/Mike-Farkas"
            },
            "answer_text": "Find yourself. With all of the noise put out there, we are buried in rubble.  For example, money is one thing. Most of us follow the money until we figure out it is a trap. It is necessary, but are we really happy? For now, I am giving you two options.  1. Figure yourself out. Find out who you are. I know you said you have no idea about your strengths or your passions, but that's your problem. You don't know who you are. You need to know yourself to market yourself and feel confident. Note the things that make you tick. You mentioned finance and investing. That's a start. But really dig down deep into who you are. Don't start classifying yourself. I don't believe in that BS. Extrovert or introvert. Hell, sometimes I'm an introvert and sometimes I'm an extrovert. Classifying yourself is not only a waste of time, but I find it stressful. There is no category, only your individual self. Volunteer. Yes, I said it. I know you are struggling at your work, but believe me, you can really find a peace in volunteering. It really blows off some steam. You meet new people and discover things about yourself you never knew about yourself. I never have done taxes before in my life and I volunteered at VITA (Volunteer Income Tax Association) and even though I didn't enjoy it, it helped me with a tax class I'm taking now. I volunteered to teach old people to type. I thought it was going to be dry, but I enjoyed helping. And better yet, it felt good helping other people. Get a part time job on the weekend to help you pocket some extra cash for future uses, or additional investing. It's probably nothing compared to what you are making now, but it is better than wasting time reading about things you can only hope for. You will definitely enjoy your free time more. Work at a McDonalds, Dunkin Donuts, or be a waiter. Anything you do, do not sit still and do nothing.  I know this is a generalization, but hey, there is no step by step guide to life. I'm happy there isn't. Imagine how dull life would be if you had a step by step guide (I bet you're thinking \"Fuck you, you have no idea...\" but come on. The point of life is for times like these. I know you must have seen the Matrix.    Your second option is starting fresh. If you have yourself figured out, start taking online classes. Make sure that the online university is credible, but more importantly, make sure you know what you are doing is what you are interested in. It sounds like you are not interested in what you do. Whatever new thing you start to study, it must be better than what you are currently doing because it sounds like you are pretty miserable (I can definitely relate even though I am not done with school yet). If you can't afford it, start a new chapter in your life. Join the military. When you're done serving, get another education (you would deserve it by then). Don't completely scrap what you already know as knowledge can only help you down the road. Or leave everything behind, and join the peace corps or whatever. Whatever you do, it is your decision based on your judgment. So don't blame anything on me. I don't mean to put any pressure on you, but there really is no pressure. Who cares about mistakes? Learn from your mistakes and your mistakes won't be wasted. Life is not about a job. Life is not about any of this rat race BS. If you believe it is, hey, I'm not stopping you (I'm most likely going to be a part of the rat race one day too). But don't be stressed from the material things in life. It's interesting what a couple of people you love can do. If you have friends, chill with them some more. If you don't, start making friends (another word for networking). Don't worry. Be happy.It's a big world bud. Think larger than a cubicle.(You sound like an entrepreneur with nothing to lose but hope still holding on)Don't let the little things in life get you down. The other parts of your question: There's no secret to gaining a competitive advantage. Find out what separates you from the better performers. If they are smarter, here's your chance to read something useful (the monotone of the internet text makes this sound mean but in no way am I trying to be mean).  Ambition? Simple, always try your hardest. I have always tried hard hard in my life, and never have I regretted it. Statistics or general math? No idea. It's not my field to decide. Recap: Never stop trying your hardest. Never stop discovering yourself. Never stop moving. I know you can do it man. There are 7 freekin billion people in this world, and we are still surviving. ",
            "date": "Answered July 9, 2013",
            "views": "780",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Trey Hallmark",
                    "user_href": "/profile/Trey-Hallmark"
                },
                {
                    "user_id": "Ella Cole",
                    "user_href": "/profile/Ella-Cole-6"
                },
                {
                    "user_id": "Joshua Nantroup",
                    "user_href": "/profile/Joshua-Nantroup"
                },
                {
                    "user_id": "Panji Gentura",
                    "user_href": "/profile/Panji-Gentura"
                },
                {
                    "user_id": "Suraj Sood",
                    "user_href": "/profile/Suraj-Sood-4"
                },
                {
                    "user_id": "Vanshaj Jain",
                    "user_href": "/profile/Vanshaj-Jain-5"
                },
                {
                    "user_id": "Reddi Ganesh Ganji",
                    "user_href": "/profile/Reddi-Ganesh-Ganji"
                },
                {
                    "user_id": "Gaurav Bisht",
                    "user_href": "/profile/Gaurav-Bisht-72"
                },
                {
                    "user_id": "Glenn Moulton",
                    "user_href": "/profile/Glenn-Moulton"
                },
                {
                    "user_id": "Awa Melvine",
                    "user_href": "/profile/Awa-Melvine"
                },
                {
                    "user_id": "Geralt Qu",
                    "user_href": "/profile/Geralt-Qu"
                },
                {
                    "user_id": "Shobelyn Dayrit",
                    "user_href": "/profile/Shobelyn-Dayrit"
                },
                {
                    "user_id": "Kunal Suri",
                    "user_href": "/profile/Kunal-Suri-8"
                },
                {
                    "user_id": "Sachin Modi",
                    "user_href": "/profile/Sachin-Modi-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Bosman",
                "href": "/profile/Michael-Bosman-3"
            },
            "answer_text": "How does one succeed in life? Do the opposite of what most people do  The world is full of AVERAGE. Average people. Average service. Average products. Average relationships. Average businesses. Average attitudes. Average lives. If you were to simply do the opposite of what the average person, business, or product does, you could become outrageously successful. What does this look like in practical terms? Let`s dive in. Don`t get a university education or degree  Read this carefully: YOU DO NOT NEED A UNIVERSITY DEGREE OR QUALIFICATION TO SUCCEED IN LIFE! Unfortunately, we have been indoctrinated into the belief that the more successful amongst us are those that are `properly` educated. We are taught that to get a `good` job we need to slog our way through textbooks and exams for 3–4 years, on top of the 12 years we have already had at the primary and secondary level, to get a piece of paper that says we are worth something. Not to mention that. on top of all that, we must saddle ourselves with enormous financial debt in the form of student loans to get through a basic degree, which we then spend years paying off! And yet, if we look at some of the most successful people that ever lived, an interesting pattern emerges amongst a lot of them. A vast number of them neither have a university degree, nor even finished university! Some never even went!! Both Steve Jobs and Bill Gates were college dropouts! Even other outrageously successful entrepreneurs like Richard Branson, Michael Dell, Henry Ford, and Mary Kay Ash don`t have degrees. For some professions, medicine and being classic examples, a tertiary education is a must have. Beyond that, university degrees don`t guarantee you success, much less a job! I have THREE degrees in Education, History, and Politics. Not ONE of them has led to a guaranteed job. In fact, I have had to move countries in order to get some meaningful employment!! Save your money and, more importantly, your time. Go out and get some real life experiences and explore your world while you are still young Don`t get a J.O.B. (Just Over Broke)  Hear me out. This does go against conventional wisdom. But, if you want an extraordinary life, you have to what is NOT conventional. The vast majority of people in the workforce HATE what they do. They work simply for the money. Their existence revolves around their job and they spend what little time they have away from their desks and cubicles drowning their sorrows in alcohol, drugs, television, the Internet, and meaningless conversation. Is this how you want to spend your life??? If your answer is `Hell no!`, and I hope it is, then you need to ditch the idea of getting a job for the money and living just to make a paycheck and scrape by. Instead you could do one of two very important and vaulable things: 1.Start a business that fulfills a need Got a problem that needs solving? Can you find a way to tackle a dilemma that a lot of people are having right now? Create a service or product that can solve that and monetize it. Can`t think of anything? Write out some problems you have in life that have not been solved by big business or anyone else. Get creative and find solutions to the worlds problems. 2. Turn your passion into a side hustle or full-time business Are you so passionate about something that you just can`t live without it? Or, do you have something that lights you up when you talk about it? Why not make some money from it? Find a way to make that passion profitable. You only have one life. You might as well do something that you are interested in or that you love. I am NOT saying that these paths will be easy! They involve a lot of risk and a lot of faith in yourself and your abilities. Think of it this way: If you were to die tomorrow, would you rather die doing what you love, or what someone else wants you to do? Don`t spend your free time buried in screens, TV, drugs, and alcohol  It is important to have some down time. You DO need a break from the everyday grind. But, most people spend FAR TOO MUCH time sedating themselves. Most people are far too comfortable picking up a beer than a book. Most people are more inclined to listen to the TV than a teacher. In short, most people pick the EASY ROUTE. But, as Les Brown said, `Do what is easy and your life will be hard. Do what is hard and your life will be easy!` Spend as much of your private and free time as possible working on developing yourself: Get to the gym.Read a book.Start a personal passion project.Start a new business on the side.Learn a new skill.Read a newspaper.Clean your house and get your workspace tidied up.Use the time you have wisely. One day you will run out of that time. I hope when that time comes that you can look back and be proud of what you did. Don`t choose to be UNHAPPY  So many of us make ourselves unhappy on purpose. We always feel like we don`t deserve anything or that everything that happens to us is everybody else`s fault. We don`t even realise the damage that we do to ourselves every day. Instead, we seek to live out someone else`s narrative. We want to live another person`s life because ours are simply not good enough. Why does it have to be this way? It doesn`t !!!! You can choose to be happy right now. You can take responsibility for your life right now. It is YOUR life!!! Sure, bad things happen to us. They happen to ALL of us! Life isn`t fair and it gives us a crappy hand sometimes. SO WHAT??? Are you just going to sit there and wallow in your sorry state like everybody else??? Get up!! Get moving! Start building a life that you want. Ignore what others are doing. Find the magic in your own existence and work on yourself constantly, moving toward the best version of yourself. Taking this simple step alone will separate you from 90% of the population immediately. Don`t wake up late, or 10 minutes before you have to do something  Most successful people have a morning routine. They have gotten more done in the early hours of the morning than most people get done all day. This is achieved by committing to waking up early, usually around dawn, or even before it, and having a system in place for getting a number of tasks done during the quietest and most peaceful times of the day. The average person lumbers out of bed with their alarms, all groggy from the lack of sleep from the night before, eats an unhealthy breakfast and just makes it in time for the daily commute to a job they can`t stand. What would your day be like if you got up an hour or two earlier and practiced a few new skills or did some exercise? You would be way more successful. You would be more energetic, more focused, and ready to take the day on Don`t sleepwalk through your mornings like the average human. Dedicate yourself to a solid morning routine and get moving.  Remember, if you want an extraordinary life, you need to do extraordinary things. That means doing the opposite of average people. Take the leap. Start living an above average life and reap all the benefits such a life has to offer. If you need any advice or help with living an above average life, feel free to reach out to me. I would be more than happy to help.  ",
            "date": "Answered August 10, 2018",
            "views": "45",
            "upvotes": " View 28 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vicky Styles",
                    "user_href": "/profile/Vicky-Styles-9"
                },
                {
                    "user_id": "Trey Hallmark",
                    "user_href": "/profile/Trey-Hallmark"
                },
                {
                    "user_id": "Charles Kelveh",
                    "user_href": "/profile/Charles-Kelveh-1"
                },
                {
                    "user_id": "Sultan Kiogora",
                    "user_href": "/profile/Sultan-Kiogora"
                },
                {
                    "user_id": "Ella Cole",
                    "user_href": "/profile/Ella-Cole-6"
                },
                {
                    "user_id": "Akash Kendre",
                    "user_href": "/profile/Akash-Kendre-5"
                },
                {
                    "user_id": "Raj Kumar Sah",
                    "user_href": "/profile/Raj-Kumar-Sah-28"
                },
                {
                    "user_id": "Rudy Trevino",
                    "user_href": "/profile/Rudy-Trevino-32"
                },
                {
                    "user_id": "Dimitrij Maslov",
                    "user_href": "/profile/Dimitrij-Maslov"
                },
                {
                    "user_id": "Glenn Moulton",
                    "user_href": "/profile/Glenn-Moulton"
                },
                {
                    "user_id": "Martine Moore",
                    "user_href": "/profile/Martine-Moore-8"
                },
                {
                    "user_id": "Tina Jadhav",
                    "user_href": "/profile/Tina-Jadhav-3"
                },
                {
                    "user_id": "Mary Brown",
                    "user_href": "/profile/Mary-Brown-1208"
                },
                {
                    "user_id": "Yugenthar Yugi",
                    "user_href": "/profile/Yugenthar-Yugi"
                },
                {
                    "user_id": "Kerestel Leonard",
                    "user_href": "/profile/Kerestel-Leonard"
                },
                {
                    "user_id": "Sucipto Cipto",
                    "user_href": "/profile/Sucipto-Cipto"
                },
                {
                    "user_id": "Ruban Kumar",
                    "user_href": "/profile/Ruban-Kumar-8"
                },
                {
                    "user_id": "Zamanguni Gumede",
                    "user_href": "/profile/Zamanguni-Gumede"
                },
                {
                    "user_id": "Rafael Eliassen",
                    "user_href": "/profile/Rafael-Eliassen"
                },
                {
                    "user_id": "Serena Kong",
                    "user_href": "/profile/Serena-Kong-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sachin Singh",
                "href": "/profile/Sachin-Singh-947"
            },
            "answer_text": "Thanks for A2A… 1.Identify your passions:- Before you can achieve success, you will have to define what success means to you. While it may take years to realize what you want to do with your life, identifying your passions, interests, and values will help you set goals and give your life a sense of meaning. If you have trouble identifying these things, then ask a friend or family member to help you. Ask yourself the following questions: What do you want your legacy to be? How would you like to be remembered by others? How do you want to make your community a better place? What are some favorite subjects of interest in your life? For example, think of subjects you enjoyed studying in school. Ask why you liked them.[1] For instance, you may have loved musical theater. Think: was it because you loved the music, or was it because you loved working with a big group towards a common goal? 2.Make a list of your goals, and what you might do to achieve them:- Be sure to address both short-term and long-term goals; try to think beyond financial and career goals, such as relationship goals, personal goals for bettering yourself, things you would like to experience, or things you want to learn. Draw up a timeline that says when you want to achieve each part.[2] Set SMART goals; goals that are specific, measurable, achievable, relevant, and time-bound. Break big goals down. For instance, if your goal is to see the world, you can set the goal of saving money and visiting certain countries. 3.Live purposefully:- In order to achieve your dreams and be the person you want to be, you will have to start paying attention to your actions. Ask yourself, \"Is what I'm doing going to lead me to where I want to be in life?\"[3] If you find yourself constantly bored, daydreaming about the future or past or counting down the minutes until the day ends, it is probably because you feel disconnected from what you're doing. Cherish your time. Try to spend your free time doing things that you enjoy doing, rather than wasting time. For example, rather than spending your weekends watching television, spend them partaking in your hobbies or spending time with loved ones and new friends. Measure your productivity by engagement, not achievement. Not everything you do has to be productive in the conventional sense, but activities should be engaging and enjoyable. Keep in mind that it is perfectly fine to spend some time doing nothing and just being lazy each day. This can actually help with your imagination and self-awareness. Strive for a balance between doing things you want to do and allowing yourself to just “be.” 4.Stick to your commitments:- Planning is not sufficient; keeping your word is also important. If you tell someone you will do something, do it. Similarly, don't tell someone you will do something if you're not sure you can. Be honest about your limits.[4] Avoid canceling plans, and try not to cancel twice on the same person. Make commitments to yourself, and stick to them. Write down your commitments and hang them in places you can see. Make sure that your commitments are gradually moving you towards your goals. Review your goals now and then to make sure you are moving in the right direction. 5.Be educated:- Education gives you the knowledge, skills, and credibility to achieve your maximum potential. In terms of financial success, statistics have shown that the more education you have (i.e. the higher degree you achieve), the more money you are likely to make.[5] In 2011, the median weekly earnings for high school graduates was $638 while those with bachelor's degrees made $1053. That same year, those with masters or doctoral degrees made $1263 and $1551 respectively. Not all education has to be formal. Apprenticeships and long-term training programs are also positively correlated with higher incomes. Obtaining a Certificate in your field can help to increase your salary. Educate yourself for pleasure as well. The more you know about the world you live in, the more questions you will have and the more interested you will be. 6.Manage your finances:- Learning how to manage your money will help ensure your financial stability over time, regardless of your income.[6] Keep track of your expenses. Subtract your monthly expenses from your monthly income to determine how much spending money you have available each month. Also, review your bank statements often and notice where you spend your money. This will help you prevent over-spending and ensure that your bank statements are correct. Understand your income. When calculating your income, be sure to take into account the federal, state, and social security taxes that will be deducted from your gross pay. Don't overlook miscellaneous deductions, such as health insurance premiums, savings bonds and loan payments. The resulting number is your net pay, which is what you end up taking home with you. Cut back. If you are not earning enough money to cover your net expenses, then look into your expenses to see where you might be able to cut back. Save money. Every month, you should deposit some of your money into a savings account. Consider asking your employer to directly deposit a portion of your income into your savings account. Invest cautiously. If your workplace offers a retirement savings plan, put your excess incomes in that. 7.Manage your time:- Putting off important tasks until the last minute can cause you unnecessary stress, and increase the likelihood of errors and negligence. Manage your time so that you have enough time to complete tasks effectively. Use a planner to help keep you organized throughout the day, week, and month. Set reminders on your smart phone and make use of its electronic timer for better time management. Make a list of all the things you need to do in a given day, and check off each task as you complete it. This will help you stay organized and motivated. 9.Enjoy the present moment:- If you are constantly dwelling on the past or daydreaming about the future, you are missing out on the present moment. Remember that the past and the future are simply illusions, and that real life takes place here and now. Start paying attention to negative thoughts so that you can move on from them and enjoy the present moment. If a negative thought arises in your head, then acknowledge it, label it a negative thought, and then let it fade away.[7] Regular meditation or mindfulness exercises can help to make this feel more natural for you. Get in the habit of paying attention to small details around you. Appreciate the feeling of the sun on your skin, the sensation of your feet walking on the ground, or the artwork in the restaurant you are eating in. Noticing things like these will help you silence a rambling mind and appreciate every moment.f you are constantly dwelling on the past or daydreaming about the future, you are missing out on the present moment. Remember that the past and the future are simply illusions, and that real life takes place here and now. Start paying attention to negative thoughts so that you can move on from them and enjoy the present moment. If a negative thought arises in your head, then acknowledge it, label it a negative thought, and then let it fade away.[7] Regular meditation or mindfulness exercises can help to make this feel more natural for you. Get in the habit of paying attention to small details around you. Appreciate the feeling of the sun on your skin, the sensation of your feet walking on the ground, or the artwork in the restaurant you are eating in. Noticing things like these will help you silence a rambling mind and appreciate every moment. 10.Don't compare your own life to other peoples' lives:- Unfortunately, many people measure their own success by comparing it to the success of those around them. If you want to feel accomplished and happy, you will have to value your life for its own sake. Many people have the tendency to compare the low points of their own lives with the high points of other peoples' lives. Remember that no matter how perfect somebody's life may seem, behind closed doors everybody deals with tragedy, insecurity, and other difficulties.[8] Pay attention to and limit your use of social media to help you remember this. Rather than comparing yourself with people who are \"better off\" than you, think about all of the people who are homeless, chronically ill, or living in poverty. This will help you appreciate what you have rather than feeling sorry for yourself. Try engaging in volunteer work to help make this more apparent. This can help to boost your happiness and confidence as well. 11.Count your blessings:- No matter how much you achieve in life, you will always feel unhappy if you constantly focus on what you don't have. Instead, devote time every day to appreciating the things you do have. Think beyond material items; appreciate your loved ones, and cherish happy memories. 12.Look after your health:- A healthy body supports a healthy mind. Eat a balanced diet and ensure that you aren't lacking in any necessary nutrients. Establish the cause of any problems you may experience, such as a lack of energy or a lack of concentration and deal with them by discussing with a doctor, nutritionist and related health professionals. Get plenty of exercise too but make your fitness choices according to what you enjoy. 13.Follow up on opportunities:- If you have a chance to shine, take it. If you are worried you won't have time and energy for a good opportunity, ask yourself: would this contribute to my end goals? If it would, then get rid of other commitments in order to pursue this opportunity. Remember, some chances only come around once. You can't bank them. This doesn't mean you should throw away all your savings or get rid of your safety net. It just means you should say yes when you are given an offer to move ahead. 14.Surround yourself with positive people:- Make friends with people you admire for various reasons: because they are happy, kind, generous, successful at work, or successful in other ways. Join forces with those who have achieved things you want to achieve, or who are on their way to a common goal. Don't let jealousy get in your way: nobody's success is a threat to yours.[10] When making friends with someone, ask yourself if the person makes you feel motivated, positive, and confident, or if they make you feel tired, overwhelmed, or incompetent. Choose to spend time with the positive people, not the ones sucking your energy. If you have friends or family members who always make you feel bad about yourself, limit the time you spend with them. Also, make sure to identify relationships that are not helping you to move towards your goals, that stress you out, or that require too much of your time and energy without being reciprocal. Look for mentors among the people you admire. If you think you could learn from someone, ask for their advice. 15.Set boundaries with others:- Advocate for your own needs. Be caring towards others, but don't accept abuse from anyone. Remember, being a good person does not mean you have to take violent or disrespectful language or actions from anyone. Respect the boundaries others set for you, too. Listen to your loved ones when they tell you they need space, or want to do something alone. Thanks for reading.. for more help follow me on qoura… keep reading,keep learning.. ",
            "date": "Answered August 16, 2018",
            "views": "719",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Afia Konadu Agyeman",
                    "user_href": "/profile/Afia-Konadu-Agyeman"
                },
                {
                    "user_id": "Grace Whitene",
                    "user_href": "/profile/Grace-Whitene"
                },
                {
                    "user_id": "Mohammed Mushtaq",
                    "user_href": "/profile/Mohammed-Mushtaq-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shraddha Singh",
                "href": "/profile/Shraddha-Singh-125"
            },
            "answer_text": "Each person has different priorities in life. For some of us family is in the first place, for others it’s successful business, for someone it is traveling, and so on. Regardless of the goals and desires, we are often faced with the inability to implement all of this, at least at this moment.We find it difficult to understand and accept the fact that something just doesn’t work for us because there are a couple of people in our neighborhood who live exactly like you want to live. If you follow some scientific tips, success will surely be on your way. These are- Think positive. No matter what.Wake up early. Stop being lazy.Act. Perform. Don’t put off making decisions until later, even the simplest tasks, try to do everything right away.Adapt. Modern life is much more intense and has faster rhythm, and it’s important to keep up with the world. Adapting appearance to who you want to become is crucial as well. If you want to be a successful man, observe people who you consider us successful and try to look like them. Look at their clothes, posture, the way they interact with other people. Confidence, your secure body language and good sense of style can help you to open more doors than you would have expected! Try to be aware of new changes in rules, trends and standards of the world and societyCherish relations. This applies to relationships both with family or friends, as well as with superiors or partners.Take part in social life.Set specific tasks & goals.Be positive. You must know that you can do it.“You can do anything if you have enthusiasm. Enthusiasm is the yeast that makes your hopes rise to the stars. Enthusiasm is the sparkle in your eyes, the swing in your gait, the grip of your hand, the irresistible surge of will and energy to execute your ideas. Enthusiasts are fighters. They have fortitude. They have staying qualities. Enthusiasm is at the bottom of all progress. With it, there is an accomplishment. Without it, there are only alibis.” – Henry Ford. Good Luck! ",
            "date": "Answered June 10, 2017",
            "views": "522",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ginny Sahni",
                    "user_href": "/profile/Ginny-Sahni"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cristina Iordache",
                "href": "/profile/Cristina-Iordache-7"
            },
            "answer_text": "Success might be relative to some people, but success is definitely defined by your personal value. And success is achieving your personal goals. But success begins with oneself, all the time. Success doesn’t begin with how rich are the parents or how much influence they have in your life. It’s important to have a successful mind, otherwise, all the kingdom will crumble. If your mind is ready to be successful, you will be able to succeed again and again, no matter how many obstacles you meet. After studying the lives of successful people I compiled a list of actions these millionaire and happy people do. Actions of the successful person Stop the mind drama – Every time you catch yourself blaming, justifying or complaining about yourself, place your hand in the form of a pistol and point your finger to the head. This might seem weird and cruel, but it will remind you that you are killing your perspectives and your financial life. The fact that your mind is set on the negative road is stopping all the opportunities to join you. This gesture will help you overcome all these negative mind behaviors.Unload your mind – At the end of the day, write a good thing and a bad thing that happened. After that, answer yourself this: “What did I do to create each one of these situations?”. If you are not the only person who was involved ask yourself: “What was my contribution for these situations to happen?”. This exercise will be extremely useful and you will learn how to be successful faster. You will feel more responsible for your own life and you will spot the good or bad strategies.Set your goal – Note down the financial objectives that prove yourself your intentions to be successful. Focus on creating wealth, not mediocrity or poverty. Write down two of your goals: annual income and net value. Set these goals to a value you can achieve in a certain period of time. Remember in all this time, you are “shooting for the stars”. Be reasonable in setting your goals, but don’t underestimate your powers.Live like a millionaire – Once a month, go to a fancy restaurant and order something without looking at its price. Order something you never tried before and that it’s not on the budget menu. Split the bill if your funds are limited, but don’t order chicken.I wrote more actions in a longer article here - How to be Successful in life - Actions of a millionaire mind Hope this helps!Thank you ",
            "date": "Answered December 18, 2018",
            "views": "307",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ruetima Thamrongsan",
                    "user_href": "/profile/Ruetima-Thamrongsan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Manoj Memana Jayakumar",
                "href": "/profile/Manoj-Memana-Jayakumar-1"
            },
            "answer_text": "Becoming better at life is an incremental process. It takes your conscious effort. You cannot expect that if you wake up every morning and do the steps mentioned below, your life will suddenly become better. Even if you do one thing mentioned in any of these answers, do it whole-heartedly, and you can see the difference. That being said, here are some things I have observed and done personally, and it has brought a lot of positive change in my life. Learn something new everydayNothing beats learning. Don't be satisfied with what you know already. Learn, read, observe. Develop healthier habits - Instead of going through your Facebook feed when you are bored, watch TED Talks or Documentaries. Set goals for mastery - not to make money or show off, but to actually learn. Do not settle for mediocrity. Don't worry too much about what people think about youDo me a favour. Go read this. Now. Taming the Mammoth: Why You Should Stop Caring What Other People Think - Wait But Why Please. Go ahead. I'll wait. Done? Great. Now you probably regret about all the time you wasted thinking about how the least significant people in your life thought about you. Don't do it. We are all humans. We all judge and form opinions. Don't let it stop you from doing anything you love. In fact, they will judge even if you don't do anything. Better to do it anyway, right? Take care of your mind - Read!Read. Read anything you can lay your hands on. I can totally understand you aren't into novels. But hey, there are a lot of amazing blogs out there! Install Pocket. Fill it with all the good articles you find, read it on your way to work.Go signup for Medium, be awed by the amazing content it has. Read Wait But Why.  Get a kindle! When you read, your mind expands in ways you wouldn't have even imagined. Write!Pen down everything! On your mobile, on a piece of paper, anywhere - A problem, a solution, an idea, a story, a poem - anything. If you are writing it down, you are creating something valuable. All the revolutions in this world came from the written word. There is nothing more mightier than a pen. Be good to peoplePlease. Don't be a jerk. Even jerks don't like jerks. Be nice to people. Help them. Remember important dates. Make them feel special. Smile. Respect them. People will never forget how you made them feel. Surround yourself with good peopleRun away from the negativity. Run away from rumour mongers, gossipers and people who constantly pull you down.Always remember - You are the average of 5 people you constantly mingle with. Take care your financesDon't be a spendthrift. Don't be a miser. Spend wisely. Spend on things that matter. Spend on experiences, it has a better ROI than the costly watch you are going to buy. Make yourself financially educated. When you know even a little of bit of economics, your financial situation improves drastically. Learn about taxes. Do your own taxes. Keep track of where you spend your money. There are hundreds of apps out there. Install one and use it regularly. Start saving money. \"The money that earns money, creates more money\". It's not Income - Expenses = Saving. It's Expenses = Income - Saving. Compound interest is the key. Start saving early in your life and you can retire a millionaire. Don't believe me? See this.  Einstein once said - \"“The most powerful force in the universe is compound interest\". Smart fellow, huh? Learn this little fact about human psychologyI'm gonna tell you a powerful secret. This might probably change your life. \"What is obvious to you is amazing to others\" How many times have you been reluctant to share that great idea with your boss because you thought it's stupid? How many times have you been afraid to share your experience in front of a crowd because you probably thought it is obvious to them? Just understand that what is obvious to you is amazing to others. Just present that idea. Worst case, it gets rejected. Share your experience. It might benefit some poor soul sitting at the back of the stage. I am writing this post because of the same reason. All this is obvious to me, but it might benefit someone reading this, right?  Watch a lot of movies - and learn from it!Don't watch movies just for the sake of it. Every movie has something to teach you. I'm a huge movie buff and I have learnt a lot of things from movies. Movies aren't just for entertainment. They can teach you valuable lessons too. Kung Fu Panda taught us that \"there is no secret ingredient\". Iron Man taught us that heroes aren't born. They are made. Shawshank Redemption taught us that \"Hope is a good thing, maybe the best of things\". Every movie has something to teach you. Look for it, learn from it. Be different.You might be thinking how you can be different when everyone around you probably has the same set of resources and skills. Well, let's look at the example of airlines. There are dozens of airlines out there, but still you will have a favourite right? Why is that so? When you look at it, all the airlines have similar resources. All the companies does service at the same airport. They can't build their own. All of them obey the same ground rules. So what makes any one airline your favourite? The difference is in service. The airline you like created value for you in something which is not so obvious - the service part. The air-hostess was very pleasant. The flight took off and landed on time. The customer service executive responded quickly to your query. The reason can be any. But the point is, they made you feel comfortable and they became your favourite. Get what I am trying to say? All the airlines enjoy similar privileges but some airlines do stand out. Same is the case with life. Provide something of value to others, and it will certainly bring value to your life. Do emotional labour.Being good at what you do is not enough. You should do some emotional labour as well. Again, the example of airlines. Would you like an air-hostess who is smiling and helpful or someone who reads out safety instructions from the paper and treats you like shit? I'm sure your answer is the former. Technically, an air-hostess job description doesn't need her to be extra nice to people or be always smiling.But when she does that, we do notice, don't we? Emotional labour is always rewarded. Precisely because it is hard to do. When you get a job, if you do emotional labour over and above your job, you will become irreplaceable. People around you will benefit from you. And when your colleagues benefit from you, you benefit from them. Give that little extra in whatever you do. You can do better. Put that little extra effort in anything you are doing and see how your life changes. People will remember you, people will respect you. You will be someone worth remembering. There is this story about Marrissa Meyer when she had just begun to work at Google.  She counted the number of words in the Google homepage! A non-sensical task, you might say. But not for Google. She noticed that the homepage was getting too cluttered with each update and this was against the Google philosophy of keeping things simple. She instantly took action and decluttered the page removing the unnecessary words. Ever since, the number of words in the homepage hasn't been allowed to cross 28. Why did she do this? It was certainly not in her job description and who cares if one more word actually comes in the homepage? People won't even notice anyway. But she put in that extra effort. She cared about the company she worked for. And today, she is the CEO of Yahoo and one of the most respected women in Silicon Valley. See, this is life. It only takes little steps to make it better. But you have to take it. Slowly, but surely. :) I'll keep updating this answer. PS: If anyone decides to install Pocket and is looking for good articles to read, follow me on Pocket. I constantly add great articles to my profile. https://getpocket.com/@manojmj92 ",
            "date": "Updated June 6, 2016",
            "views": "149",
            "upvotes": " View 254 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Giridhar C L",
                    "user_href": "/profile/Giridhar-C-L"
                },
                {
                    "user_id": "Sachin Sharma",
                    "user_href": "/profile/Sachin-Sharma-139"
                },
                {
                    "user_id": "Ella Cole",
                    "user_href": "/profile/Ella-Cole-6"
                },
                {
                    "user_id": "Sahana Nidige",
                    "user_href": "/profile/Sahana-Nidige"
                },
                {
                    "user_id": "Thanh Cao",
                    "user_href": "/profile/Thanh-Cao-13"
                },
                {
                    "user_id": "Sagar Bhalodia",
                    "user_href": "/profile/Sagar-Bhalodia"
                },
                {
                    "user_id": "Aaron Le",
                    "user_href": "/profile/Aaron-Le-14"
                },
                {
                    "user_id": "Youssef Benizza",
                    "user_href": "/profile/Youssef-Benizza"
                },
                {
                    "user_id": "Adebisi Yusuff Adebayo",
                    "user_href": "/profile/Adebisi-Yusuff-Adebayo"
                },
                {
                    "user_id": "Iqra Noor",
                    "user_href": "/profile/Iqra-Noor-67"
                }
            ]
        },
        {
            "author_info": {
                "name": "Madhumitha",
                "href": "/profile/Madhumitha-24"
            },
            "answer_text": "I don't think I am successful enough to answer this question . Now your question raised me to two more questions You want to be successful in your career life ??You want to be successful in you family life .Now let's first take you family life . Spend quality of time with your family . It does not mean you need spend a lot . Have dinner together . Speak on general issues what's happening over the world and what's their point of view over the issue .Ask for their input , if you don't like their input put down the cons of their choice . By this they will learn and they will have no communication gap with you.Small things do matter . Make sure you appreciate their hard workNever speak ill about your family or scold them Infront of others .Now as for career life Never ever stop learning . In this fast growing world you must be up to date with knowledge in order to survive the competition.Don't concentrate on only your department and work . See what's happening with others and what they are doing .Be friendly with your co-workers. Smile at them . Be polite with people . But If you want to get some work done be hard so that they will know you really mean itI think this will lead you to have a successful life . But if you really want enjoy life just have some me time . Me time is the time dedicated for yourself . It does not include your family and career . It includes only you and what you like do alone . Every month have this time . Want to go for ride ?? Go for it without any care . Want to go to swimming .. then go . There are certain things that will say this is you . You need to have that . Because without that you will lose your identity and by losing your identity you lose your happiness .Remember one thing a happy life is a successful life . In order to have a happy life you need to have the above 3 . If even one is missing ",
            "date": "Answered September 16, 2016",
            "views": "378",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Raghuram Prabhu",
                    "user_href": "/profile/Raghuram-Prabhu-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nimra Shahid Khan",
                "href": "/profile/Nimra-Shahid-Khan-1"
            },
            "answer_text": "10 main steps to become a successful person 1. concentrate on commitment, not motivation. simply but committed unit you to your goal? but important is it for you, and what unit you willing to sacrifice thus on understand it? If you discover yourself entirely committed, motivation will follow. Here’s the thanks to concentrating on commitment. 2. get data, not results. If you concentrate on the enjoyment of discovery, improving, exploring and experimenting, your motivation will invariably be oxyacetylene. If you focus entirely on results, your motivation square measure planning to be like whether—it will die the minute you hit a storm. so the secret's to concentrate on the journey, not the destination. Keep pondering what you are learning on the approach and what you may improve. Here’s the thanks to get information. 3. Build the journey fun. It’s associate amazing game! The minute you produce it seriously, there’s an enormous likelihood it's going to begin carrying a crucial emotional weight and you may lose perspective and become stuck all over again. Here’s the thanks to build the journey fun. 4. Get obviate stagnating thoughts. Thoughts influence feelings and feelings ensure but you scan your work. you've got got a lot of thoughts in your head, and you always have a range of that of them to focus on: those which is able to cause you to emotionally stuck (fears, doubts) or those which is able to move you forward (excitement, experimenting, creating a trial new things, stepping out of your comfort zone). Here’s the thanks to get obviate stagnating thoughts. 5. Use your imagination. Next step once getting obviate negative thoughts is to use your imagination. once things go well, you are packed with positive energy, and when your unit experiencing difficulties, you'd prefer to be even extra energetic. so rename your state of affairs. If you keep continuance I hate my work, guess that feelings those words will evoke? It’s a matter of imagination! you may invariably notice one factor to be told even from the worst boss inside the globe at the foremost boring job. I even have a superb exercise for you: just for three days, suppose and say positive things entirely. See what happens. Here’s the thanks to use your imagination. to see more visit :10 main steps how to become a successful person (2020) ",
            "date": "Answered May 30, 2020",
            "views": "166",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tamal Saha",
                "href": "/profile/Tamal-Saha-9"
            },
            "answer_text": "In the race of life; everybody wants to win.   Good.  But who wins this, actually?  I want to tell you a story. Stay tuned; till the end.  There are, only three types of people—as participants to this race. (Yes; you can actually stereotype people here; regarding this race. Only exceptions are—the geniuses. As geniuses are not governed by certain set of rules for life, they can’t be stereotyped alongside anyone either.)   Okay. For the race; three types have gathered up. 4 typically idealistic persons (the saints, who always form a group of their own, and they are always high in numbers everywhere); 1 realistic person; (they are always rare in numbers); 1 idealistic-dreamer (they always roam alone); and 1 Machiavellian person, as in—the typical shark. (they always hunt alone, as well.)  So; everybody is ready, steady, and set for a healthy race; (called the ‘healthy competition’ in modern era).They have all leaned forward, stooped down at the starting point; the starter is ready to blow the whistle; and their eyes are set for the finishing point like a hawk; suddenly; OMG, a Bear; literally a bear is found—come running towards them! What are they gonna do now? Well; forget about the finishing line; forget about the starter —as soon as they saw the bear; all the participants and even the race-starter—Just sprinted out! Except one. And he was an idealistic; but blind racer. As he couldn’t see the bear; and nobody told him a bear was coming; all he could hear was the hullabaloo around him. So; he waited and waited; amidst the noise, for the whistle to go off—until, the bear reached him; and got him. (Nonetheless; believe me, he was a good runner usuall—despite the fact, he can’t see. All he had done in other previous races: as soon as he heard the whistle; he just ran straight, down the well-made smooth track; as fast as possible. And sometimes—he did end up, as winner. Thanks to his blind speed.)   So; now one person has got eliminated; even before the race starts properly.  Now; the bear is still chasing them; as he is still hungry and angry; and the racers are rushing away usually; just not on the well-prepared smooth race-track now; but over the naked stony thorny path; through the hedges; meadows; and marshlands. Quite a scene!  Amongst the racers; the Machiavellian thought—let’s just foul another racer; conveniently—the dreamer. So violent a foul (preferably a sidekick); that he couldn’t even get up; and the bear will get him easily—and will spare the others (including him) in the process.   And also; another competitor will be eliminated out too.   He did. And the naïve dreamer fall victim of the Machiavellian’s wickedness; of his false warmth—and got fallen in the hands (paws) of the bear.  The Shark excused—he had done this to save the others; for the Team.  The idealists runners; who are probably the best runners on the usual tracks—didn’t agree with him totally; but whatever—they were too busy in fleeing away for their own.  But, the realist smelled something fishy. He thought; what if—the bear is still hungry, and comes towards us? Then the Shark can beat down one of us too; to save himself again—and since he is not the best runner in this race; it’s probably him whose number is going to be the next. He needs to pre-empt the attack from the shark.   So; he persuaded the idealists in paying attention to the shark, to his intention, to what he did, and what he’s able to do next, etc—and, sensing the reality of the shark; the 3 idealists ganged up with the realist—to kick out the Machiavellian out of the race.   They did; and the bear got the Machiavellian(the shark) too.  But the bear is still hungry, and chasing them!  So; the last battle is between 3 idealistic people; and the realist; 4 people remaining.—Who’s gonna be the next?  3 idealist people; imagining the gravity of the situation—Ran as fast as possible. They all tried to be in the first of all; to stay safe;—and they ran like hell!   While; the realist ran fast too; but, he always ran only one step ahead of the last man; with not so much an exhaustive effort; and he preserved his energy. Thus; the last position changed and changed alternatively, again and again; between the idealist people; but the realist always kept hold on this 3rd position; intact.   Finally; one idealist people; who was in the last at that time, and utterly exhausted—fall to the bear.   And; despite all these tragedy; thankfully; after getting 4 people down (1 blind idealist; 1dreamer, 1Machiavellian; and 1 skilful idealist)—the bear became content; and went back to have a feast on them.  And; ehe remaining two idealists; and the realist; came back. To that previous, smooth and slick track for the ‘healthy competition’ again. However, this time; the competitor is only 3; with two highly skilful idealist runner; and one averagely skilful realist. No matter what have happened just few hours ago; they have to fight the ‘healthy race’ of life; on this smooth-track again; to prove themselves.   In this condition; they have fight the race of life again. You can easily predict; who’s gonna to be winner in that healthy race of life now.  No. Not any of the idealists.  The Realist.   The idealists have already exhausted themselves so much; in the competition to be the first; (when the bear was chasing them) to stay safe; that they don’t even have any energy left, to run another race with full spirit. Despite having all the necessary and best skills to run this.  The Realist won: despite being slightly low on skill sets; as a runner. Just with the help of proper strategy; in every steps of life.  ***  Okay; so what did the realist do then, after winning it on the track?  Even after winning the race; he didn’t dance to have the limelight. Rather; he let the idealists to flourish; to be his ally. He allows the idealists to preach their ideas; and expand them; he allowed them in forming new groups of idealist people. He allows them to stand on the stage; despite being the winner himself—and remained behind the scene himself.   He never preached his strategy, tactics, and philosophies to anyone; and never tried to teach people about the necessity of this—since he knows people won’t accept his notion; as the world is full of idealists around.   Only thing he did; no matter wherever; and whatever he is racing in—he keeps an eye always in the horizon. If the bear is coming; as soon as he sees the bear—he starts to run; and in the process of running—he uses again those bunch of sappy idealist; to be the food for the bear; sparing him.   In this way; he wins in the unpredicted races of life; and preserves his energy; and then wins automatically—in the predicated races of life too.   After then; instead of demolishing the losers; he shows them kindness—befriend them; enjoy their loyalty and services—as they are already losers and scared enough to lose again.   Then he waits for the next-bear race again; silently; with a wicked smirk.   And once the bear comes; History repeats itself.   And that’s how; he always wins; everywhere; in any condition—in life.  Doesn’t this pattern sound familiar to you? By examples from History; or you might even have seen any ‘true winner of life’ around you as well. You can see, this same pattern is always spinning everywhere.   If you set aside the judgement about whether it’s right of wrong; good or bad; for a moment—you can easily notice: That’s how people ‘win in life’. By being the radical realist; and supreme strategist for it.   Winning in life means, having a certain amount of power; control, and authority over your own life; over your very surroundings.  And History and Human Evolution points out—that comes to you; by only this way.  Now; many people will be asking me—oh boy; isn’t it so horrible? Isn’t it so bad? Isn’t it too bad a thing; when you need to use other people as sacrifices to save yourself? Isn’t this—Immoral?   To them; I will answer: Reverse your perspective, if you can.  The people you are pleading for; out of sympathy and ‘saviour complex’, is up to no good for anything practical. They live in their own world, in the realm of their own fantasies; and they try to win their battle for life, sitting in a library. Not by staying on the bitter ground of life itself. They create more problems on the earth; by preaching useless philosophies and bizarre ideas than anyone else. They might be good at running few races; but they know how to run only on a swiftly made; well-polished track—not on the thorny path of reality. You can’t bank on them in saving you in the face of a bear. And this alone makes them a burden over the already existing problems of the earth.   Now; another question arises: What will happen; when all the racers on this track were damn realist?!  That’s the best scenario for any condition you can ever imagine—They will shift into the simplest solution ever: Form a coalition and kill the bear itself.   That’s how realists think. That’s how realists work. To them; reality is more important; to them—fighting the bear out first; is more important; than some stupid slick-track race for life. They look for a SOLUTION first; everywhere—they don’t look for ‘MAINTAINING’ an idea.  Understand: You can’t afford to be the blind person here; because you need to see the bear (the unknown unexpected dangers of life) in the horizon. If you are a dreamer; you get killed; if you are a Machiavellian Shark; you will get ahead to some extent; but people will eliminate out eventually. And If you run and compete like those non-strategical but skillful idealists; you can’t win till the end. Because; there is not only one race in life; and the bear can return again. Also—not all races of the life are run over the smooth and slick, well-prepared tracks forever. Sometimes; you have to run over shits too. And that’s where; the radical realists and supreme strategists of life—are always one step ahead; of you and me.  To be honest; true paradise comes over the earth; not when everybody follows the ideal aspects of everything; rather—when everybody accepts the reality, as it is; and work with it, instead of against it—towards a proper and practical solution.  That’s why; The realist-strategist doesn’t even ‘need’ to try to win in life. Rather, Life itself lets them, to win over it.  Image: Athena, Greek Goddess. The goddess of wisdom, handicraft, and war. The epitome of radical realist; supreme strategist and seductive charm. You can’t even imagine the level of refined intelligence and reasonable ruthlessness, underneath this serene face. This is Athena. The Greek Goddess of wisdom and war strat... by Lindsey Staskus ",
            "date": "Updated March 25, 2018",
            "views": "62",
            "upvotes": " View 35 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Grace Whitene",
                    "user_href": "/profile/Grace-Whitene"
                },
                {
                    "user_id": "Srija Ghosh",
                    "user_href": "/profile/Srija-Ghosh-25"
                },
                {
                    "user_id": "Sai Aishwarya Vedula",
                    "user_href": "/profile/Sai-Aishwarya-Vedula-1"
                },
                {
                    "user_id": "Daniel Zhang",
                    "user_href": "/profile/Daniel-Zhang-404"
                },
                {
                    "user_id": "BA Lawrence",
                    "user_href": "/profile/BA-Lawrence-1"
                },
                {
                    "user_id": "Sandeep",
                    "user_href": "/profile/Sandeep-1238"
                },
                {
                    "user_id": "Joanne Ducharme",
                    "user_href": "/profile/Joanne-Ducharme-3"
                },
                {
                    "user_id": "Fat Cat",
                    "user_href": "/profile/Fat-Cat-46"
                },
                {
                    "user_id": "Dasari Krishna Vardhan",
                    "user_href": "/profile/Dasari-Krishna-Vardhan"
                },
                {
                    "user_id": "Kayla V",
                    "user_href": "/profile/Kayla-V-3"
                },
                {
                    "user_id": "Ritu Raj",
                    "user_href": "/profile/Ritu-Raj-83"
                },
                {
                    "user_id": "Shubham Pandey",
                    "user_href": "/profile/Shubham-Pandey-1167"
                },
                {
                    "user_id": "Pakhrin",
                    "user_href": "/profile/Pakhrin"
                },
                {
                    "user_id": "Suave Cito",
                    "user_href": "/profile/Suave-Cito"
                },
                {
                    "user_id": "Sirius",
                    "user_href": "/profile/Sirius-40"
                },
                {
                    "user_id": "J P Chaudhary",
                    "user_href": "/profile/जय-प्रकाश-चौधरी-J-P-Chaudhary"
                },
                {
                    "user_id": "Kalkiniks",
                    "user_href": "/profile/Kalkiniks"
                },
                {
                    "user_id": "Sourya Ranjan Das",
                    "user_href": "/profile/Sourya-Ranjan-Das"
                },
                {
                    "user_id": "Shameek Pathak",
                    "user_href": "/profile/Shameek-Pathak"
                },
                {
                    "user_id": "Tamal Saha",
                    "user_href": "/profile/Tamal-Saha-37"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emerlin Benedick",
                "href": "/profile/Emerlin-Benedick"
            },
            "answer_text": "You Can Be Success With These Top 3 Personal Skills There are certain skills that are necessary when you want to succeed in life and there are some that you need to religiously avoid. It's not really all that black and white but opinions on the matter, no matter how divided they may be, agree that there are certain personal skills necessary that anyone must have to be a success. You can be a success too, all you need to do is master these personal skills and you will be well on your way to improving your position in life. Today, the discussion is on the top 3 personal skills and why they matter so much when you are thinking about fast forwarding yourself to a successful position. When Richard Branson was on air for an interview, one of the many things he mentioned was people skills. He is a billionaire and sometimes you wonder why he needs people skills at all. Treating everyone around you with respect means most of the time, it will get reciprocated back onto you. \"Do to others what you would have them do to you.\" It might not be one of the Ten Commandments, but it makes a lot of sense to follow. Likeable people normally do better then that guy in the office that everyone wants to do over with a stapler. People skills are the most important thing when it comes to a personal skill that will guarantee you success. Why? What if one day you meet someone and your people skills basically let you down? What you might not know is that he might be your potential employer, who might offer you a much higher pay, better opportunities and a world to conquer. Even when it comes to colleagues or bosses, opportunities will come by faster and things will be easier for you if you have the right people skills. You must also have absolute faith in yourself, the kind of faith discussed in sermons. By having faith and belief in yourself, anything is possible because a positive attitude is half the battle one when finding your way to success. Don't let yourself down with scathing remarks or excuses, find your potential by relying on the one person that can never and should never let you down - yourself. Only then will you be set free from the doldrums of life and move on to greener pastures, grazing on the fruits of your hard earned labor. I think the last personal skill that is important is the ability to look fear in the eye and shrug it off. Whether it may be taking a risk, going to another country to work, quitting your job, learning a new talent or just letting loose and giving your 2 cents, fear is the one trait that is holding people back in the world today. We are ruled by fear - don't be one of them. Laugh at its face, drop ice cubes down its shirt and you will conquer all. With these personal skills, you can be a success too if you want. Personality is the key denominator; use it to your advantage. If you want to know more , here is The Most Honest Advice To Succeed In Life. Click on the link to watch the video  ",
            "date": "Answered August 30, 2020",
            "views": "41",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Xavier Perez-Pons",
                "href": "/profile/Xavier-Perez-Pons"
            },
            "answer_text": "Yesterday I saw by chance on TV the last part of a movie that serves as a metaphor for triumph and failure in life. Two of the best martial arts fighters happen to meet in the Chinatown of San Francisco: Bruce Lee and a Buddhist monk who has just arrived from China, exiled, and who works as a dishwasher in a restaurant. In Chinatown a triad of gangsters kidnaps the fiancée of a promoter of combats to force this one to organize a combat between those two cracks. The promoter manages to convince the monk and Lee. Among the shady deals of the triad are the bets, and a fight like that will bring them great economic benefits, hence their interest. The combat is celebrated. Lee is not yet the world-famous Bruce Lee. He has an aggressive spirit. While the monk is eminently a teacher who wants to teach Lee the philosophy of martial arts, which is not about attacking but defending. The concept of victory and defeat does not exist for the monk, or has a very different meaning. Lee learns that from the monk in the course of the combat, which ends in a draw: no winner, no loser. This result is a bad business for the triad that demands to know who has been the winner. Then Lee learns that the life of the girlfriend of the combat promoter is at stake, and goes to the restaurant where the monk works. Both face the triad and demand the boss to free the girl. The boss in turn demands that one of them declare himself the winner and the other accept his defeat: a lot of money is at stake in bets. However, for the monk and for Lee (who has learned that from the monk), the notion of winning or losing does not make sense, it is not important. The monk declares winner to Lee. But Lee does not accept his victory: he demands the liberation not only of the kidnapped girl but of all the other girls that the triad has kidnapped. The boss agrees, and only then Lee agrees to declare himself the winner. The \"moral\" of this story seems to me as follows: Mostly, in our society, to succeed is to have a prosperous and happy life (win the combat). While, for the true sage, to succeed in life has a very different meaning: it is doing good, helping people in need (rescuing kidnapped girls).  ",
            "date": "Answered June 22, 2019",
            "views": "780",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nadine.",
                    "user_href": "/profile/Nadine-270"
                },
                {
                    "user_id": "Jenny San",
                    "user_href": "/profile/Jenny-San-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sharat Sharma",
                "href": "/profile/Sharat-Sharma-13"
            },
            "answer_text": "I think much before we talk about “how does one succeed in life, we must first define what success is? I have always been fascinated by the word success, and various definitions that people shared often confused me. I then found a straightforward definition that helped me gain a lot of clarity around the word SUCCESS. Success in simple is to bridge the gap between your potential and your current reality. Success = Your Potential - Your Current Reality. Example: Financially: You think you have the potential to make 1L per day, but then your current reality is that you only make 10K. Fitness: You think your potential is that you can run a marathon under 6hours, but then your current reality is you are not unable to finish a marathon under 6hours. Career: You think your potential is to be a leader leading a team of 10, but then your current reality is you are still an individual contributor. NOTE - It’s what you think your potential is and what you think your current reality is. So, now the question is, how does one bridge the gap? Since the equation has two variables, “Your Potential” & “Your Current Reality,” your job is easy. Recipe of disaster - lower your potential to match your current reality Recipe of Success - alter your current reality to match your potential How does one alter the current reality? Work on building a powerful mindset:Results = Mindset + Skillset + Toolset. We heard of this equation. But in reality, the equation is: Results = Mindset * (Skillset + Toolset) It means the mindset does not just participate in the results equation; it multiplies the results. 2. Hire a coach: A lot of times, we get blindsided by the results we get and do not know what to do. Coaches ensure that they help us see the right thing and eliminate those blindspots. 3. Build Great Relationships: People you spend time with have a lot of impact on how you think and how you see your current reality. Have a group that holds your back and kick your ass, so that you grow. 4. Invest in your personal/ professional development Learning always defines your earning. So, invest in developing your skills. Finally, Recipe of Super Success is to continually raise your potential & continue to challenge your current reality. Cheers! ~Sharat Sharma ",
            "date": "Answered December 2, 2019",
            "views": "384",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kathleen Godfrey",
                "href": "/profile/Kathleen-Godfrey-4"
            },
            "answer_text": "Thank you for the A2A, but I am probably not the right person to answer this question. It depends on your definition of success. By social norms, I am almost the antithesis of success, and yet I am envied by many of my friends and acquaintances. I answer a lot of questions regarding happiness, because I enjoy my life, and it’s been a hard life. I have failed at a lot of things. I failed at 2 marriages, to keep custody of my first born, to build a career, to progressively increase my economic value, to integrate into a singular community, (AKA stay put), to stay in optimal health, to save for retirement, or to become a self sustaining artist or small business owner. Most of my experience and wisdom comes from learning what doesn’t work, by doing what doesn’t work. So it would be hypocritical of me to speak to what creates success when I am still on the path of learning that for myself. I have narrow bands of experience in what I truly feel was successful in my life. I was a grade 9 drop out who believed I would still get a university education some day, and I finally did at the age of 40 and graduated with a BA, with Honours four years later. I wanted to raise my children to be whole, healthy and a great contribution to society. I wanted to have close and loving relationships with them. I succeed at that. What was my definition of success to them? That you enjoy your own life, and that you are kind to others. That was it. I didn’t care if they dug ditches or were a top researcher in leading edge science. Just as long as they were, Good people and critical thinkers. That was my only expectation of them. I think success, (because my life focus is on spiritual, not the physical), is getting to the end of your life and feeling good about yourself, or maybe that’s what I tell myself to not feel too badly about my failures. ",
            "date": "Answered March 5, 2018",
            "views": "131",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Venkatasubramanian Meenakshisundaram",
                    "user_href": "/profile/Venkatasubramanian-Meenakshisundaram"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashutosh Naudiyal",
                "href": "/profile/Ashutosh-Naudiyal"
            },
            "answer_text": "The answer to this question lies within you only.. It depends on what success means to you.. whether earning loads and loads of money is success.. whether having a perfect family is success.. whether you're happy and satisfied are success for you.. it all depends on you and not on anyone else.. so according to this only you can answer your question and this will require some self introspection and some “me\" time.. others can only advice you to do something that will help you to get to your goal.. And that advice from me to you would be.. Never ever leave your passion.. don't think once about society.. don't think that you're not going to make it.. just follow you passion and sooner or later.. you will achieve your goal or even if you don't you'll be satisfied that you atleast tried..Never put your careers at a side for your lover/girl-friend or boy-friend, if they really love you and want to be with you.. they will support you and be with you rather than constantly asking for attention or your time when you're working.Always be full of hope, enthusiasm, positivity and be broad minded.. never let negativity of others pull you down becuase once you're on the way to your success, a lot of people will start hating you (sometimes may be your close friends).Never give up.. never let failure get to your head.. you can always try again and again and again to achieve what you've been dreaming of for so long.As you don't have to let failure to get to your head.. you also don't have to get success to your head.. always be humble, kind, gentle to others.. their blessings will make you more and more successful.So these are the ingredients of what we call success.. just add them together and impletment them and BOOM..!! you'll be successful.. All the best with you life..!! ",
            "date": "Answered August 15, 2018",
            "views": "174",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shawn Mathias",
                "href": "/profile/Shawn-Mathias-2"
            },
            "answer_text": "You should have a Dream.. Yes! A dream so big which won't let you sleep in peace. I'll like to tell a story of a boy who wanted to be successful badly, dispite having everything on the other side of the coin. There was a middle class average boy in a village, he didn't have any special talents and was average teenager like everyone else in the world. Let's name him as “A” But, he had a dream. To become one of the youngest stock market investor of his district. Now everyone started making fun of A, how can a middle class boy come youngest stock market investor where his family had no proper house for themselves. But this A didnt lose hope he went to electrical helper jobs and earned some cash from it. When he reached 18 he got his own pancard and opened a adult bank account and started investing in stock markets. Everyone started telling why is he putting his hard earned money in stocks. To his utter shock he lost all the little money he had in stocks by incurring losses. Attended college at day and sat until 1pm thinking and clearly identifying the flaws in his investing techniques and studied about stocks extensively along with his board exams. A was determined, he completed his 2 PUC exams and started working as helper again..he collected some cash from going that job in his holidays. A invested in stocks again. This time it was other way he was amongst the highest profit makers amongst other investors for 3 months. Purchased a good phone and laptop helped his parents in anything and everything. Yes he had only invested 10000 rupees in stocks.  His name is Shawn Mathias and he is happily doing his engineering along with stock market investing and has started his own investment company. All at the age of 19 years and 6 months. There is nothing known as good or bad luck its we ourselves who need to look into what we like find out work on it and become successful Determination is everything. You don't see successful people mingling around people having no proper goals and aspirations in life. Hope it helped thanks :) PS:Don't consider this example as bragging in anyway and this is no fabricated story this is what happened to me when I was 18. ",
            "date": "Answered October 4, 2016",
            "views": "12",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Khwrwmdao Brahma",
                    "user_href": "/profile/Khwrwmdao-Brahma-4"
                },
                {
                    "user_id": "Lucas López Santibáñez",
                    "user_href": "/profile/Lucas-López-Santibáñez"
                },
                {
                    "user_id": "Sakhile Mogale",
                    "user_href": "/profile/Sakhile-Mogale"
                },
                {
                    "user_id": "Nikola Kolchakov",
                    "user_href": "/profile/Nikola-Kolchakov"
                },
                {
                    "user_id": "Pranav Joshi",
                    "user_href": "/profile/Pranav-Joshi-13"
                },
                {
                    "user_id": "Gagana Marrikuppala",
                    "user_href": "/profile/Gagana-Marrikuppala"
                },
                {
                    "user_id": "Zubair Noori",
                    "user_href": "/profile/Zubair-Noori"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Beyer",
                "href": "/profile/Michael-Beyer-4"
            },
            "answer_text": "How does one succeed at life? I once thought to succeed at life, I should make my first million dollars, have a house of my own that didn't have a 20 year mortgage, a new car, a family of my own and have the time as well as money to travel anywhere at the drop of a dime. At that time, I was 24, 7 years later, I am 31 and my perception of success has changed drastically. Not because I no longer aim for those goals in life, more of, I don't base success at life on those goals. I work hard on them, surely. If actual life were a game and there were a specific algorithm for success then we would all pretty much play the same. With little difference between us and little difference in the end result. Life is a beautiful and ugly thing. Let's call it a game though. So, this game of Life we play, with no specific set of rules, just personal goals and ambitions gives you absolutely no guarantees. No gaurantee you will ever reach one of your goals, no guarantee that you can have kids, no guarantee that that girl or guy will like you or even notice you and no guarantee that you will even be here to play tomorrow. The only guarantee that you do have in life is that eventually, tomorrow, the next day, the day after maybe, or even 80 years from now… you will die. Sounds depressing right. So, onto how to succeed at life. Of course, it is my personal oppinion of success as everyone determines success differently. Wake up in the morning and take a deep breath because you are alive today. Enjoy it.Appreciate the little or the lot that you have today.Say “Hello” and smile with a geniune smile to those you see.Appreciate those closest to you.Try your hardest to be happy and content even when the game gives you the worst choices or no choice at all.Share with others and help those you can help.Remember, when you have problems many people have problems 100x worse.If you can do these things everyday, you can be a happy person. This may not be success to everyone. Being happy in life may not be success to anyone but me. I guess what I am trying to say is… have goals and work toward them, just remember life is very short and unpredictable. Be happy. ",
            "date": "Answered July 27, 2018",
            "views": "450",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elijah John Gadbury",
                    "user_href": "/profile/Elijah-John-Gadbury"
                },
                {
                    "user_id": "Derek Baker",
                    "user_href": "/profile/Derek-Baker-48"
                },
                {
                    "user_id": "Al Husain",
                    "user_href": "/profile/Al-Husain-1"
                },
                {
                    "user_id": "Rahul Thomas",
                    "user_href": "/profile/Rahul-Thomas-59"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eva Gutierrez",
                "href": "/profile/Eva-Gutierrez-2"
            },
            "answer_text": "It all starts with saying, “I am going to make a million dollars next year.” If you pull it off, do you think you are going to say, “I am going to make another million dollars next year!” or are you more likely to take it up a notch and say, “I am going to make two million dollars next year!”. Let’s say you pull it off and make that two million dollars your second year-Does that mean that you weren’t successful when you made one million dollars? No. You were just at a different phase of your life, where the definition of success was one million dollars. Because you are always growing and transitioning into higher levels of life, your definition of success moves with you. Here’s what I need you to do: Realize that you already are successful. You don’t need money to be successful. You don’t need your soul mate to be successful. You don’t need your dream job to be successful. You are already successful because you’re thinking about how to become successful. This means that you: Understand where change needs to take place in your lifeAre purposely seeking advice and opinionsAre ready to intake this information, mold it to your needs and take action on itYou have hit the point in your life where this is your current definition of success. Here is what you do need to do during this “success seeking” chapter of your life: Embrace change. If you want to make your life “successful” you have to move yourself in the direction of success. What action do you take today to get yourself closer to where you want to be?Find your passion. What makes you tick will give you those five, ten or hours of happiness everyday?Become your own best friend. You have to be your number one fan, the person that always has your back and the one that pushes you towards your goals. You must be this person to yourself.Here’s a few more insights that can help you: What Guarantees Success In Life? Failure + Lesson = Pure Success  Picture via Instagram: I am currently traveling the world while trying to find the career of my dreams. There are days where I feel like I’m living in pure chaos and others where I can see my vision in HD. This is what I remind myself of daily to keep me sane and motivated. ",
            "date": "Updated September 16, 2017",
            "views": "581",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cristiano Silva",
                    "user_href": "/profile/Cristiano-Silva-8"
                },
                {
                    "user_id": "Adnan Lisatrik",
                    "user_href": "/profile/Adnan-Lisatrik"
                },
                {
                    "user_id": "Newland Archer",
                    "user_href": "/profile/Newland-Archer-3"
                },
                {
                    "user_id": "Alyssa Satara",
                    "user_href": "/profile/Alyssa-Satara"
                },
                {
                    "user_id": "David Parks",
                    "user_href": "/profile/David-Parks-32"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mayank Srivastava",
                "href": "/profile/Mayank-Srivastava-40"
            },
            "answer_text": "How to define success in life? The only person that can answer the question above is you. I am neither able nor willing to prescribe the ultimate definition of success, as this is not possible. Every person is thinking differently about being prosperous in life and is defining success in another way, so there can’t exist a definition that is suitable for all. It is very important that you know exactly how to define success in life! Make yourself aware what accomplishment, success, and prosperity in general means to you in your life. Some might define success as having luxurious cars and a huge mansion, whereas others consider a life full of joy and happiness with their family as the true meaning of success. Once you have figured out what is important for you personally you are able to focus on your visions and goals. The meaning of success One of the most important key steps to achieving success in life is to know the meaning of success for your personal life. The true meaning of success goes far beyond the common definitions of success, such as having a lot of money, being wealthy, having a lot of tangibles and earned degrees. Quite the opposite: true success in life cannot be measured with the above-named factors, but instead with the amount of people that are able to live a better and more advanced life because of what you created. This is the meaning of success. Not the trophies people are collecting in their lives. Media and society let us often conclude that living a successful life means to be extraordinarily wealthy and have a lot of tangibles. But the meaning of success is to live a happy life and to make this world a better place for everyone. Definition of failure The opposite of success is failure as it means to fail while trying to achieve aims or objectives. Besides this regular definition of failure, it also can be said that even wealthy and successful persons fail in their lives. Just think about the rich and famous and all their scandals, addictions and suicides. All of them were extraordinary persons but a lot of them were also extremely unhappy with their lives and were not able to see the meaning of success. Wealth cannot be defined with money, but instead with values in your life that make you a happy person, such as friendship, relationships, and your family. The difference between accomplishment and success: Accomplishment is often associated with success, but it is not the same. Accomplishment refers to the results we desire when we attempt to reach specific goals. Basically it is the results that we plan or expect to occur. Success is the positive consequence or outcome of an achieved accomplishment.The definition of accomplishment Accomplishment can be seen as the process to become successful and with every accomplished goal you take a step towards prosperity and a life full of success.How to achieve success in life? The process of becoming successful starts with elaborated goal settingDefine a strategy and a plan how you intend to reach your goals, aims, and visionsKeep in mind that success is the consequence of having earned a series of accomplishments, so make sure to divide your goals into easier to reach subgoalsSuccess quotes: In the following, I have found some very inspiring and motivating quotes that shall accompany you on your journey to achieve happiness. Action is the foundational key to all success. ~ Pablo Picasso Always bear in mind that your own resolution to succeed is more important than any other. ~ Abraham Lincoln Defeat is not the worst of failures. Not to have tried is the true failure. ~ George Edward Woodberry Discipline is the bridge between goals and accomplishment. ~ Jim Rohn Keep in mind the meaning of success and always try to remember how to define success in life, so that you will be able to live a life full of happiness and joy. ",
            "date": "Answered January 8, 2018",
            "views": "524",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shrinath Diwate",
                    "user_href": "/profile/Shrinath-Diwate"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Goodall",
                "href": "/profile/Steve-Goodall-5"
            },
            "answer_text": "To succeed in its most basic form is to have choices! I can choose to eat at this restaurant and not think about moneyI can choose if I want to buy this car, visit this place, buy that watchI can choose if I want to hang out with this person or notThat is a true success, I also believe this is the formula for happiness, creating choices for yourself. We live in a society that uses money as the great facilitator, sure there are plenty of people who will tell you, you don't need to be rich to succeed in life, but make no mistake you will need money for anything, even the most basic of existence. So if choices are the key to success, then what gives you choices, 90% will be money, 10% is what you do with it. Success is defined differently for each person and each person definition of success will change over time. When I was 11 years old, owning a Jaguar was the definition o success to me. When I was 18 years old, my definition was owning my own house and going skiing once a year. 5 year ago, it was being able to travel the world full time. Now currently, it's building a real estate portfolio to provide long term generational wealth for my kids and their kids. For me, all of those things required money. I had to do this at scale, meaning I couldn’t connect my time with how much I can earn. Example, If I was a salesman, I am limited to 24 hours per day of being able to sell, If the product I sold was $1000, my limit was $24,000 per day, which of course is unsustainable. The key is leverage. I can employ an unlimited number of salespeople to sell for me and thus increase my wealth, which in turns increases my options, which in turn gives me more choices. In order to succeed you need to be able to leverage your time against wealth creation. Success is having choices, the more you have the more success you have! I talk about my journey and the challenges of businesses and growing wealth on my YouTube channel here. ",
            "date": "Answered July 23, 2019",
            "views": "34",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Grace Ann",
                    "user_href": "/profile/Grace-Ann-102"
                },
                {
                    "user_id": "Destiny Barnes",
                    "user_href": "/profile/Destiny-Barnes-3"
                },
                {
                    "user_id": "Natasha Moore",
                    "user_href": "/profile/Natasha-Moore-52"
                },
                {
                    "user_id": "Stephen Sywak",
                    "user_href": "/profile/Stephen-Sywak"
                },
                {
                    "user_id": "Nahmed Nissar",
                    "user_href": "/profile/Nahmed-Nissar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Perry Liao",
                "href": "/profile/Perry-Liao"
            },
            "answer_text": "“When you want to succeed as bad as you want to breathe, then you'll be successful.” ― Eric Thomas Practice Relentless Commitment The single reason that has allowed me to stay on the journey of lifelong personal development is having a powerful, intentional, and selfless purpose - to become my best so I can help others become theirs. But despite that strong motive to grow, I sometimes hit roadblocks which hinder my progress. To counter that, I switch my focus to honing in on a single area. It may include the following: Growing my businessDeepening my relationshipsExpanding my overall knowledgeLearnContinue Reading",
            "date": "Answered August 10, 2019",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shashank Singh",
                "href": "/profile/Shashank-Singh-1966"
            },
            "answer_text": "Do you want to be successful? Do you also wonder what is the difference between successful people and unsuccessful people? Today I will talk about '7 habits of highly effective people'. 1. Be proactive: Proactive people prepare for the situation beforehand. Are you prepared for things that are about to happen? Do you save for retirement? Do you take care of health? Do you eat the right food? If no is your answer, then you have to be proactive. There are some things that I think everyone should think beforehand .1. Health 2. Happiness 3. Money 4. Daily, weekly, and yearly goals. 5. Relationship 2. Begin w Continue Reading",
            "date": "Answered July 12, 2019",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dayakar Mamidi",
                "href": "/profile/Dayakar-Mamidi"
            },
            "answer_text": "Is it true that there is a formula that shows how to lead successful life? Success cannot be enforced to come by satisfying an exact formula. Each person can lead successful life in his own way, by uniting and adding talents that only they own – talents that make these persons exclusive. The message is clear: Success does not grow out of thin air. Remember that no one became successful when being lazy or while being asleep. The mainstreams of people have to work hard and devote time for being successful. Sometimes they work very harder and longer than other. 10 Formulas For Successful Life Followin Continue Reading",
            "date": "Answered November 25, 2017",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Drishti",
                "href": "/profile/Drishti-128"
            },
            "answer_text": "  these two images actually sets the answer. Success is nether money or the fame, it’s making the lives of other people better and earning respect. “The qualities you require to be successful are just within you. The all you need is to get started.” Let’s be honest, success is hard. Not complicated, just hard. It’s hard because we’re wired to look for quick fixes, easy outs and ways to keep from failing. And it’s not our fault. Our brain wants to use the path of least resistance. If we really want to be successful, we have to go against our nature and challenge it First of all as Michael Fitzjohn sai Continue Reading",
            "date": "Answered June 15, 2016",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Daniel Bourke",
                "href": "/profile/Daniel-Bourke-2"
            },
            "answer_text": "A swordsman discovered a rat in his home and wanted to get rid of it. So he recruited the help of some local cats. The cats cornered the rat. But when they began their approach the rat attacked. The cats were terrified and ran away. The swordsman decided to take matters into his own hands. He grabbed his wooden sword and took to the rat. But the rat was too fast. Dodging every swing like a bird flying through the trees. As a last resort, the swordsman sent for the neighbourhood cat known for her ability as a rat-catcher. This neighbourhood cat didn't look much different to the other cats but her pr Continue Reading",
            "date": "Answered September 16, 2018",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lukasz Laniecki",
                "href": "/profile/Lukasz-Laniecki"
            },
            "answer_text": "It depends on your definition of a ‘successful life’. It can be as simple as Trust yourself, trust that you are competent to make your own life choices, don’t listen to people who believe that they mastered life and want to tell you how you should live your life. Simple formula but it requires you to reject the conventional meaning of ‘success’ and that’s not easy. To me a person who can do that is a successful human being. But that’s because my definition of success in life has nothing to do with the conventional meaning of ‘success’ in life. Most people equate success in life with having money Continue Reading",
            "date": "Answered January 29, 2019",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Saurabh Gupta",
                "href": "/profile/Saurabh-Gupta-985"
            },
            "answer_text": "Success is no accident. If you Commit to do things Successful people do, you will lead a life of SUCCESS & HAPPINESS - A GREAT LIFE!!!!  Success, the word itself defines it’s meaning — See your goals Understand the obstacles Create a positive mental picture Clear your mind of self doubt Embrace the challenge Stay on track Show the world you can do it.  Word of just 7 Letters but have a powerful meaning. If the person is, ON TARGET to Achieve his/her GOALS & DESIRE than No one else can stop him/her from having Anything or Being Anyone he/she decides to be. Success can be achieved in any Field - in studies, Continue Reading",
            "date": "Answered March 2, 2019",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Murali Krishna",
                "href": "/profile/Murali-Krishna-11"
            },
            "answer_text": "Every one of us might have asked this question to ourselves at some of time in our lives and after 7 years of research and 500 interviews with successful people, Richard St. John, come up with this 8 secrets of success. Have passion: Do it for love, not for money. As simple as that.Because it doesn’t matter how much money you earn. You will always need more. Most of the people who changed the way we live, have done it because of the passion they had towards what they were doing. Steve Woz, who designed the first Apple computer; Einstein, who changed the way we perceive space and time, has dContinue Reading",
            "date": "Answered October 11, 2016",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Abhishek Pastore",
                "href": "/profile/Abhishek-Pastore-1"
            },
            "answer_text": "The truth is success isn’t a goal or destination, it’s a Mindset you take on to achieve your goals. It’s your mindset, determination to put all your efforts into the kind of work you do. And I’ll be honest: Success isn’t an easy feat to accomplish. It’s not something you achieve in a fraction of second. It takes time and efforts. Even if you are putting your 95% efforts into a piece of work, you won’t succeed because it takes your whole efforts. The definition of success might be different for everyone. For me, I would like to call myself a successful man. I am at a position where I am happy and Continue Reading",
            "date": "Answered August 29, 2020",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Flavian Mwasi",
                "href": "/profile/Flavian-Mwasi"
            },
            "answer_text": "Everybody wants to succeed in life. Ask a drunkard or drug addict and they’ll both tell you that the reason they took to drinking or drugs was perhaps because they failed at something. Why does everyone desire success? Because we are afraid to be left behind. We’re afraid to be laughed at. We’re afraid of dying poor. That’s why. But what is success, really? Success means different things to different people. However, for most people, success only means one thing—having lots of money. The reason for this is simple. With money, you can get almost anything you want in life. Without money you’re nobody Continue Reading",
            "date": "Answered December 17, 2019",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Eric Serpa",
                "href": "/profile/Eric-Serpa-1"
            },
            "answer_text": "Regardless of how old you are, where you live, or what your career goals are, it's likely your ultimate goals in life are to be happy and successful. To be successful means more than just having money and making your mark. It means following your passions, living purposefully, and enjoying the present moment. Identify your passions. Before you can achieve success, you will have to define what success means to you. While it may take years to realize what you want to do with your life, identifying your passions, interests, and values will help you set goals and give your life a sense of meaning.  Continue Reading",
            "date": "Answered January 16, 2018",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William Beteet III",
                "href": "/profile/William-Beteet-III"
            },
            "answer_text": "BRAINWASH Yourself - As often as you can remember listen to motivational videos. YouTube has millions of hours of motivational videos, all with the same banal message but it doesn’t matter because the right answer isn’t complex, it’s just difficult to keep in mind everyday. This process of brainwashing yourself is easy but will make it easier for you to do difficult things. When I wake up I put one on, then on my run to the gym, during my workout, while walking to my meetings, and finally but most importantly right before bed. Anxiety and laziness are the default messages from our subconscContinue Reading",
            "date": "Updated February 3, 2020",
            "views": "0",
            "upvotes": "0"
        }
    ]
}