{
    "title": "How does self relate to soul and spirit? - Quora",
    "tags": [
        "Spirits (ethereal)",
        "Spirit",
        "Spirituality of Everyday Life",
        "Soul (metaphysical entity)"
    ],
    "response": [
        {
            "author_info": {
                "name": "B. Woods Mattingley",
                "href": "/profile/B-Woods-Mattingley"
            },
            "answer_text": "The ego relates to the self (lower letters), which is generally interested in self-pursuits and desires. The spirit relates to the Higher Self, which is the embodi- ment of God or the Divine or Universal Mind within each of Its creations. The Higher Self eschews personality and its desires, and always inspires us to the higher levels of consciousness, which are Love, Forgiveness, and a willingness to serve the Creator. The ego says, “Me, first.” The Higher Self says, “ I serve the Higher Self or God within.” A great battle goes on between the ego and the Higher Self. The ego must be subdued or overcome by the Higher Self. When Jesus became the vehicle through which the Lord Christ could express Himself on the earth, The Christ acted to redeem humanity. The Christ offered grace to mankind, and transmuted much of the negative karma which mankind had generated for itself. His Blood was not shed for no reason. Christ is here now. We shall see in the time to come, more manifestations of His Love for the earth and mankind, as He reveals more and more of Himself to all. Look to the times of 2023–2029 for demonstrations of His grace. There will be great changes in the earth and in humanity. Consciousness is changing world wide. Those who lie and cheat and steal will fall by the wayside. Many who choose darkness will find themselves residing on other worlds, having been removed from planet earth, as it accelerates into its New Golden Age. The 26,00 year Zodiacal cycle is closing, as is the 2,000 year cycle of the Piscean Age (Age of the Fish). The Cosmic-Solar Event is at hand. All shall experience this. Keep your thoughts high. If my words are true, the Lord will reveal them for their reality. I serve The Christ. ",
            "date": "Answered February 2, 2019",
            "views": "171",
            "upvotes": " Answer requested by Susan Min",
            "upvoters": [
                {
                    "user_id": "Rodrigo Machado Martins",
                    "user_href": "/profile/Rodrigo-Machado-Martins"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Macready",
                "href": "/profile/Stephen-Macready-1"
            },
            "answer_text": "Simple. Self is the soul. You are the soul. Spirit is your life force that keeps you alive not anything more than that. The Bible is clear about that. The teachings that the soul or spirit is separate from the self or body is not from the bible. They are from Satan and his worldwide network of religions and governments and philosophy and theology that mislead the entire inhabited earth. Humans do not and never had a soul. God never intended for mankind to continue living after death because death is a punishment not a cycle of life. ",
            "date": "Answered February 1, 2019",
            "views": "59",
            "upvotes": " Answer requested by Susan Min"
        },
        {
            "author_info": {
                "name": "Sheilan",
                "href": "/profile/Sheilan"
            },
            "answer_text": "Soul and spirit or higher self are our true self. This is who we are when we are not incarnated into these physical bodies. We dream and sleep in order to connect more deeply with this part of ourselves. If we are unable to connect deeply and regularly we will eventually get sick and die. The physical body is the dream self and not the other way around and realizing this is what the spiritual path is all about. When we experience awakenings or levels of enlightenment we have removed layers of the dream. Eventually there becomes very little separation between the physical self and the soul/higher self. We consciously become one self. ",
            "date": "Updated February 5, 2019",
            "views": "68",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Larry Walden",
                "href": "/profile/Larry-Walden-3"
            },
            "answer_text": "Psychologically speaking the self is the “I” the ego in which consciousness exists. The self is the soul/spirit which consists of the mind, will, emotions and memory. The soul is eternal and lives forever. ",
            "date": "Answered February 1, 2019",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "João Ferreira",
                "href": "/profile/João-Ferreira-39"
            },
            "answer_text": "About consciousness, soul and God (spirit) take a look at João Ferreira's post in Life Philosophy-Abstracts ",
            "date": "Answered February 2, 2019",
            "views": "23",
            "upvotes": "0"
        }
    ]
}