{
    "title": "How to find value in my existence - Quora",
    "tags": [
        "Existence"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anant Vijay Joshi",
                "href": "/profile/Anant-Vijay-Joshi-2"
            },
            "answer_text": "know that the three main things in your question, My, Value and Existence, are absolutely arbitrary and fleeting. Let us take up ‘My’ first. Your existence that you talk about is not ‘yours’ because you do not exist independently and in complete sovereignty. Every atom of your body may have been borrowed from a different galaxy and the water that forms 75% of your body may actually predate the planet Earth on which you live. None of it is ‘yours’ and as natural law, all of it will be recycled endlessly for eons to come. Your ‘Existence’, the fact that you exist, is incumbent on an idea that there is ‘you’ made up of your body, mind, and some say soul. And it is funny because you cannot recognize your own photo from day 1 of your existence, your birth date, if shown to you for the very first time when you are say 50 years old. So who really are ‘you’? Since ‘you’ are always changing beyond recognition there is no real consistent ‘you’ although we of course give ourselves names to make life more practical. In reality there is no starting point and ending point to ‘our’ lives. We just say the words birth and death and define the time in between as life, existence, but it is a false (although convenient) notion because all the ingredients of ‘us’ were already there before birth and will remain after death, and will keep reformulating throughout our lives and continue to be recycled eternally after our lives just as they have been doing for ever even before our birth. In a nutshell, in reality, Existence is universal and cannot be boxed into ‘yours’ and ‘mine’ categories although we do it to ‘make life easier’ (and end up making life more miserable). The third word in your question, that of Value is very good. Value is usually determined when there is A) a giver and a taker, B) multiple things to compare. In this whole infinite Universe, there is no real giver and taker. When the whole of whatever there was, is or will be is interconnected, interdependent and is really One, the question of value of its any part howsoever infinitesimally small does not arise. It is important to remember that just as a watch won't work without its smallest part, so also the Universe won’t work without the smallest part it has. It is easily understood by the fact thst the Universe does not allow even one of its atoms to be eliminated, to become zero. The atom could change into wave form or energy, but it will for ever stay in the universe. The universe cannot let go of even its minutest part. It won't work. In essence, the value of any thing or any being is that the infinite Universe will be incomplete without that thing or being. In that sense every atom of the Universe is valuable. And since ‘you’ are made up of Trillions of atoms, you are extremely valuable. Add to that your mind, soul and memory: now you are so valuable that you are precious. And so is the whole Universe: very valuable. Valuable to itself. ",
            "date": "Answered January 14, 2017",
            "views": "683",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "GAME BOMB",
                    "user_href": "/profile/GAME-BOMB"
                }
            ]
        },
        {
            "author_info": {
                "name": "Min Khin Kyaw",
                "href": "/profile/Min-Khin-Kyaw"
            },
            "answer_text": "What do you need it for? We have values has intelligence, good will, justness, etc. Moral, ethic, conscience, commonsense, courage to face hardship and injustice, selflessness, self-sacrifice, heroism, leadership, being easy to deal with, friendly, not-proud (not arrogant), supportive to the needy, knowledge of truths, wise, truthful, honest, ability to find solutions… these are human values, but some animals can have them too. If one doesn’t have all of them, but has some of them, then one does have some values - not possible to be perfect and have all the values. Not need to greedy and jealous but let others have some of these values too. If all or the majority humans have some of these values and not the bad attributes, the world would be just beautiful. Paradise could be found here. It wouldn’t be material paradise but mental one - a happy one, not a luxurious, not the one for lust. We can’t build a paradise for lust or with lust but truthfulness, the sense of justice and being standing for fairness. Why do we have full of conflicts?  Russia, Trump & Flawed Intelligence ",
            "date": "Answered January 14, 2017",
            "views": "329",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Scott Richards",
                    "user_href": "/profile/Scott-Richards-52"
                }
            ]
        }
    ]
}