{
    "title": "How to feel your existence - Quora",
    "tags": [
        "Existence",
        "Emotions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nagarajan Ramachandran",
                "href": "/profile/Nagarajan-Ramachandran-3"
            },
            "answer_text": "Your existence or aliveness or consciousness or intelligence (all synonymous) is self luminous and self evident. Just like your eye cannot see itself there is no way your aliveness can feel itself. You can only feel an object. The feeler is you. The object is something other than you, that you perceive or feel. Just being you is also knowing you. Your aliveness is a knowing being that can never be known, but it is unmistakable. Your aliveness does not have a dimension or location and hence your aliveness can intuit and infer that IT is infinite and eternal. Your aliveness does not really belong to you but is actually shared by all living creatures including every single cell in the universe. Just like we all share oxygen and sun light, we also share aliveness which is all pervasive and all inclusive. This aliveness contains this entire universe. This is the declaration of the Upanishads. ",
            "date": "Answered January 7, 2019",
            "views": "574",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "SauRabh Pimpalkar",
                    "user_href": "/profile/SauRabh-Pimpalkar"
                },
                {
                    "user_id": "Sahil Mubarak",
                    "user_href": "/profile/Sahil-Mubarak"
                },
                {
                    "user_id": "Nada Mahmoud",
                    "user_href": "/profile/Nada-Mahmoud-54"
                }
            ]
        },
        {
            "author_info": {
                "name": "Utkarsh Bhardwaj",
                "href": "/profile/Utkarsh-Bhardwaj-16"
            },
            "answer_text": "What your heart really wants to do something and you just done without any care and then you come to know that was not easy and then you realise Your existence. My answer doesn't sound well but just think after asssfuck hardwork you completes your goal and the journey begins of your life and you will say “I” done it. ",
            "date": "Answered March 6, 2017",
            "views": "415",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Abhishek Singh",
                    "user_href": "/profile/Abhishek-Singh-1720"
                }
            ]
        }
    ]
}