{
    "title": "How can we go beyond our mind to reach the true self using the same mind? - Quora",
    "tags": [
        "Self-Awareness",
        "Consciousness",
        "The Mind"
    ],
    "response": [
        {
            "author_info": {
                "name": "Piotr Nowak",
                "href": "/profile/Piotr-Nowak-83"
            },
            "answer_text": "There are techniques to trick the mind, you use mind to go beyond mind, soudns silly, but it works. You can use everything to skip beyond mind, senses, thoughts also, just need to reverse awareness in right direction. Mind is our tool, we must use tool, not become slaved by it. Noizy mind is like full cloudy sky. When it’s still and silent, sky is clean and our nature can be revealed. When you look at something, you look through your eyes, be aware who is looking through eyes. When you hear sound, you hear through ears, (senses are medium our being use to experience this reality) be aware who listen through your ears. When you think, thought appears…be aware to whom thought appeared. Below is my favourite technique, but you need to be able to keep mind still and silent, otherwise it won’t work. Here you use imagination, for me it works, if you don’t afraid supportless space try this one. Antarakasha dharana:  If one concentrate on the body as a void, even for a moment, with mind free from thought, then one attains thoughtlessness and verily becomes that form of void.  Commentary: The limitations of consciousness trapped in physical body are difficult to transcend. What holds you back from experience of that supreme state is your identification with the body and with the thoughts, which assail you throughout the day, concerning the experiences of the body. If you can concentrate on your body as void or space and transcend all thoughts, even for a moment, your mind will be liberated and will take on the form of that void. It is important to note that you don’t have to concentrate for hours and hours in order to experience this state. Even if you focus the mind for just a moment, it is enough to give you experience of heightened state of awareness.  This sloka describes the practice of antarakasha dharana, concentration on the inner space, in which every part of the body is concieved of as void. At first it may be difficult to percieve the body as space due to our material identifications and associations. However, in time it becomes natural experience, and by developing this form of concentration the mind also takes on that form of void, because the mind and the body are not separate. When we concentrate on anything, the mind take that form, even for a moment. So, if we concentrate on the body, the mind becomes that form of the body. In this way, when we see the body as space, the mind also becomes a space, and thus the vikalpas, or thought constructs are immediately transcended. ",
            "date": "Answered January 19, 2020",
            "views": "94",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aurimas Navys",
                    "user_href": "/profile/Aurimas-Navys-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bernard Klein",
                "href": "/profile/Bernard-Klein-6"
            },
            "answer_text": "This is the key question of all spirituality. The mind is considered to be the great provider of illusion, the great destroyer of Reality. So much so that many books and spiritual masters say \"you must destroy the destroyer\", or \"you must destroy the mind\". Of course, each doctrine, each sentence, each word of spiritual discourse must be understood both relatively and deeply, and not interpreted superficially. Obviously, if you objectively destroy your mind, you will no longer know your name, where you live, or how to speak. \"Destroying the mind\" therefore cannot mean that. Some spiritual seekers interpret this \"destruction\" as a kind of \"shut up\". According to them, speeches, verbal teachings, books, concepts and words are useless, and even harmful. This interpretation is unfortunately as frequent as it is inappropriate. It’s true: in the silence of meditative state there is no room for words and concepts... but outside of this state, words and concepts return, and it’s crucial to know how to manage them . Anyway, the famous \"shut up\", itself, is nothing but a concept. You should also be aware that the word \"mind\", in books, is often a reductive translation of Vedic or Vedantist concepts which mean \"incessant flow of thoughts\" (and it’s not exactly the same). Anyway, the question is: “How can we go beyond our mind to reach the true self using the same mind?”. Navnath sampradaya’s Masters, like Nisargadatta, Ranjit, Siddharameswar or Ramakand teach a beautiful formula which answers this question so well: \"the problem comes from the mind, the solution must come from the mind\". And for that, they offer, firstly, a perfect mastery of meditation, and secondly a deep personal reflection about \"what is illusion\". Once the illusion is recognized for what it is, you can no longer remain attached to it, so you let go and it is awakening. From another close perspective, you can see the existence of two mental options: gullible thinking and skeptical thinking. This is what Vedanta calls \"Neti, neti\" (neither this, nor that). According to Vedanta, it’s enough to reject everything that appears, including in meditation, to accept nothing as true. When you have rejected everything, what remains is Reality. I would put it in a more western way to speak, saying that all you have to do is see how much your thought believes in itself. Thought that believes in thought is gullible thought. It’s the source of all our illusions: we believe that our thoughts are reality. We confuse the map and the territory. In order to unmask this gullible thought, a skeptical thought must be cultivated. It’s a work of every second. And it’s an extremely effective way to use the mind to go beyond the mind, because it generates a step back, a witness which will become more and more refined until it disappears itself in favor of true Self. ",
            "date": "Answered January 19, 2020",
            "views": "154",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Triet Tran",
                    "user_href": "/profile/Triet-Tran-7"
                },
                {
                    "user_id": "Matthew Boteler",
                    "user_href": "/profile/Matthew-Boteler"
                },
                {
                    "user_id": "Manju Natha",
                    "user_href": "/profile/Manju-Natha-9"
                },
                {
                    "user_id": "Aurimas Navys",
                    "user_href": "/profile/Aurimas-Navys-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alix G Jardine",
                "href": "/profile/Alix-G-Jardine"
            },
            "answer_text": "Very good question. We only have the human mind with which to understand the human mind. Everything we are and experience is attached to that process. In terms of Psychosynthesis or Transpersonal Psychology we must link into the higher or metaphysical/spiritual aspects of why we are here and why we wish to investigate our own minds and how the mind brain communication works. (Ken Wilbur takes this into an Integral Level.) We have a higher abstract mind and a lower cognitive one. It is communication with the higher mind via the process of meditation, contemplation and observation which leads to higher transcendental states and alters perception of the way we think and or feel over time. It happens naturally as a child evolves into puberty and adulthood, development unfolds.i was informed by my human spiritual mentor that my brain was not good enough for the higher mind to communicate with the lower. Yet I had always considered that I had some type of working relationship between the two and was already constructing the Rainbow Bridge or developing the right type of spine necessary for the endocrine system to increase its function for service. The Delphic Oracle’s most famous maxim is “Know Thyself”. Pythagoras, Plato, Socrates, along with many others have used this to create images in language which stimulate the human mind into consideration of what it means to be human, and a God. (Two interconnecting circles symbolically represent the higher divine and lower human aspects: remember the brain is in the body but the mind is the whole of the existence and the mind is connected to other minds whether or not the concrete psychologists want to embrace that fact or not.) Humanists may consider that there is no extraneous influence beyond the human mind and that any inspirational communication or connection stems from that which is in the human “ring past not” of their existence. We know that observing experiments changes the outcome of the experiment. I suspect that if we become detached observers of our own responses to inner and outer stimulus and keep our minds open then we will will reach the true self and when the process is mature enough that true self or Soul lighted intelligence will take us beyond the human to the centre of the Source which creates all existence including Alien minds in the Oneness of the Universe, nay Multiverse. Look at the diagram of the Constitution of Man in any of the Bailey books, Look up the twisted string theory of quantum physics, also. Then think about it, or as we say in spiritual speak, ponder on this. ",
            "date": "Answered January 19, 2020",
            "views": "159",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ravi Venkatesan",
                    "user_href": "/profile/Ravi-Venkatesan-11"
                },
                {
                    "user_id": "Aurimas Navys",
                    "user_href": "/profile/Aurimas-Navys-1"
                },
                {
                    "user_id": "Manju Natha",
                    "user_href": "/profile/Manju-Natha-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Hlavaty",
                "href": "/profile/Mark-Hlavaty-2"
            },
            "answer_text": "You are your true soul. The soul that has chosen to come down here once again to use free will to move closer to Spirit (Creator, Source, etc). Your true soul loves you and wants you to move towards “enlightenment” or closer to Spirit. To do this you must overcome your mind/ego. Spirit wants you to evolve to learn acceptance/love/etc. To become a better human thus being a better Soul. No one here is fully “enlightened”. If you were you wouldn’t be here. Your journey on your path would be over. For now, when your mind/ego races with thoughts, say to yourself… Listen… the thoughts will stop … and you will have access to your true Soul. In that stillness, in that peace, we begin. We begin the path of self-actualization. Your true soul is meant to help you be a better human, a better Soul… your free will must choose the right path. Meditation can help you to see your true self. But you can find your true self in everyday moments. When you choose the right path of action. When you break patterns that stop the evolution of the soul. When you choose love or kindness. It really isn’t hard … although most fail and that’s okay. We must remember we were once them. Accept the world as it is and not how you want it to be. Listen and you will hear your true self whisper the answers you seek on your path. ",
            "date": "Answered January 19, 2020",
            "views": "95",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mubi Esmail",
                "href": "/profile/Mubi-Esmail"
            },
            "answer_text": "Knowledge of oneself (self- knowledge) is the most beneficial knowledge of all. In the following quran verse, 21 of Surah al-Dhariyat, the Lord says: وَفِي أَنْفُسِكُمْ ۚ أَفَلَا تُبْصِرُونَ “And in your own souls (too); will you not then see?”(51:21) This verse calls to our attention to the need to look for these signs within ourselves. We are clearly and unambiguously told that there are signs in the external world as well, and these are sources of guidance for us. From these verses it becomes clear to us that Muslims are urged not to focus on their souls to the exclusion of the physical, material world; and conversely, not to think that material affairs are all that matter. In India for instance, there are people who try to strengthen the power of their souls in order to enable themselves to perform certain deeds not ordinarily possible. But in so doing, they loose touch with the everyday life of the planet. That is not what faithful Muslims are commanded to do. Muslims are told the two go hand in hand and are complimentary to each other. When a scientist is working on a project in the laboratory, or a person is performing the most menial of tasks to earn an honourable living, he or she is carrying out one of God's commandments. It is again, one of the most distinct characteristics of Islam that two worlds are never separated. In today's world, in Western societies in particular, we see countless examples of people who are totally alienated from themselves, seeking all in the material life. In more extreme cases, the alienation from the self has progressed to such a degree that being alone becomes painful and undesirable. Why? Because when such a person is alone, in a way he has lost contact with the eternal world, which is all he has. So being alone with his soul and spirit, he has to face a world which has no meaning to him, and matters not to him. In trying to escape the inevitable loneliness, many resort to mind-altering drugs, such as alcohol and narcotics. A person with a healthy spirit can be alone yet not lonely. One who has forsaken a part of himself, his spirit, his consciousness, when alone, seeks to destroy it, rather than facing that which is excruciatingly painful; thus resorting to drugs becomes an easy escape route. This is one reason why some societies use solitary confinement as a method of punishment for hardened criminals who already are serving life sentences and have nothing to lose by further acts of violence. But when a faithful Muslim is alone by himself, he is not lonely. As a matter of fact being alone is prized by faithful Muslims. There is a Hadith from Imam Sajjad (a.s.) in which the Imam is quoted as saying: “If all between the East and West were to die, I would not feel lonely as long as the Qur'an was with me. Once again we shall turn to the Hadiths to further explore this topic. This invaluable heritage has been left to us by the scholars who instinctively knew the eternal value of observing the speech and deeds of the Noble Prophet and Imams, and recording for posterity this living example of the perfect Muslim and human being. Earlier we discussed a famous Tradition, which has reached us in two similar versions: There is however, no difference in meaning: “However knows himself (his soul or spirit) knows [or has known] his Lord “(1) Imam ‘Ali (a.s.) is also quoted on the subject, stressing the importance of knowledge: “Knowledge of oneself (self- knowledge) is the most beneficial knowledge of all “(2) This again tells us that knowing oneself leads to knowing one's Lord and all that it entails. The second Hadith on the topic from ‘Ali (a.s.) reads: “I wonder at the person who urgently searches for that which he has lost, but he has lost his soul and is not searching for it “ The third Hadith from Imam ‘Ali (a.s.) on Self-knowledge is: 'I wonder how a person who ignores himself can know his Lord. ' The fourth Hadith from Imam ‘Ali (a.s.) is: “Whenever the knowledge of a man increases, his attention to his soul also increases and he tries his best to train, and purify' it” Here is yet another Tradition on the subject from Imam ‘Ali (a.s.): “The ultimate knowledge of a man is to know himself” Url The Importance of Self-Knowledge ",
            "date": "Answered January 19, 2020",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Phillip Ross",
                "href": "/profile/Phillip-Ross-16"
            },
            "answer_text": "How can we go beyond our mind to reach the true self using the same mind? You can’t and it does not even make sense that you could However, deceiving spirits are able to make you think you are using your mind to enter the supernatural. Rather, they are using your mind to gain access to your will and know how to entice and press all your buttons so you believe them Test the spirits, prove the truth, do not rely on experiences regardless of how strong or wondrous. Whores can give you great experiences too, but their intent is not in your favor ",
            "date": "Answered January 19, 2020",
            "views": "35",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sankarshan Das",
                "href": "/profile/Sankarshan-Das-1"
            },
            "answer_text": "My Dear Aurimas, Please accept my blessings.Just as we can use a thorn to remove a thorn we can also use our minds to transcend our minds. This is described by Lord Sri Krishna in the Bhagavad-gita, Chapter 9, Text 34: man-manā bhava mad-bhaktomad-yājī māṁ namaskurumām evaiṣyasi yuktvaivamātmānaṁ mat-parāyaṇaḥ “Engage your mind always in thinking of Me, become My devotee, offer obeisances to Me and worship Me. Being completely absorbed in Me, surely you will come to Me.” Our true spiritual selves are situated beyond our body and mind. By engaging our minds in thoughts of God we transcend our minds and become eternally liberated souls in the spiritual world. I give free precise training exactly how one can do this in my free e-course. One can sign up here to join it: Ultimate Self Realization Hoping this meets you well.Your ever well-wisher, Sankarshan Das Adhikari P.S. I’ll be coming to teach this ultimate science in Lithuania in September this year and hope to meet with you personally to guide you further. I will be mostly lecturing in Kaunas. ",
            "date": "Updated January 21, 2020",
            "views": "167",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amol Lad",
                    "user_href": "/profile/Amol-Lad-1"
                },
                {
                    "user_id": "Sacinandana Das",
                    "user_href": "/profile/Sacinandana-Das-3"
                },
                {
                    "user_id": "Sanjeev Dwivedi",
                    "user_href": "/profile/Sanjeev-Dwivedi"
                },
                {
                    "user_id": "Murari Das",
                    "user_href": "/profile/Murari-Das-1"
                },
                {
                    "user_id": "Miodrag Milosavljević",
                    "user_href": "/profile/Miodrag-Milosavljević"
                },
                {
                    "user_id": "Nicola Sanchez",
                    "user_href": "/profile/Nicola-Sanchez-2"
                },
                {
                    "user_id": "Vinay Mehta",
                    "user_href": "/profile/Vinay-Mehta-139"
                },
                {
                    "user_id": "Aurimas Navys",
                    "user_href": "/profile/Aurimas-Navys-1"
                },
                {
                    "user_id": "Preet Singh",
                    "user_href": "/profile/Preet-Singh-768"
                }
            ]
        },
        {
            "author_info": {
                "name": "Laurence Mather",
                "href": "/profile/Laurence-Mather"
            },
            "answer_text": "The question implies there's a somebody who needs to go beyond their mind to reach a true-self. You have identified three entities in the question - you, a mind and, something/someone else beyond. Do you have three-selves, you, your mental identity and, a true-self that is yet to be found? When did you lose your true-self? Do you remember having one that somehow, went missing? Where did you hear about this? Who or, what, is asking the question? What is something people refer to as self-improvement but really isn't? I think therefore I am.\" Is this a true statement or is there more to existence other than our thoughts? ",
            "date": "Answered January 19, 2020",
            "views": "56",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aurimas Navys",
                    "user_href": "/profile/Aurimas-Navys-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Voris",
                "href": "/profile/John-Voris-4"
            },
            "answer_text": "You need a catalyst. For 20 years I was able to isolate someone’s primary life motivation by “reading” the objects around them. This is a European technique that I taught my daughter when she was 14 years old. We all express our identities through objects around us. Our identity does the collecting making the collection unique to us. Study what they have in common on an archetypal level. ",
            "date": "Answered January 19, 2020",
            "views": "47",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aurimas Navys",
                    "user_href": "/profile/Aurimas-Navys-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Whitaker",
                "href": "/profile/David-Whitaker-19"
            },
            "answer_text": "One of the most fascinating enigmas of life is the mind. and ability to adapt and expand. Our brains begin as smooth and relatively featureless as infants, as we grow with experiential stimulation or brains grow with adding neurological pathway by adding folds and crevasses. Yes our minds have the definite ability to go “beyond” what we think is “the same old mind” ",
            "date": "Answered January 31, 2020",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Richards",
                "href": "/profile/John-Richards-218"
            },
            "answer_text": "You are prior to mind. You are able to witness mind. You are prior to every experience, there must be you for any experience to be registered. The more you observe this mind, the deeper this truth will impress. Naturally by this observation of mind you will see it as nothing more than the appearance and disappearance of thoughts. Remain in this position, can this witness be found? Who is that? You are prior to every experience. ",
            "date": "Answered January 19, 2020",
            "views": "139",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rami Reddy",
                    "user_href": "/profile/Rami-Reddy-72"
                },
                {
                    "user_id": "Alan Fernández",
                    "user_href": "/profile/Alan-Fernández-1"
                },
                {
                    "user_id": "Saraswathi Ab",
                    "user_href": "/profile/Saraswathi-Ab"
                },
                {
                    "user_id": "Aurimas Navys",
                    "user_href": "/profile/Aurimas-Navys-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cia Parker",
                "href": "/profile/Cia-Parker"
            },
            "answer_text": "Our mind is the one and only master. From time to time it may allow you to believe that you can actually reside beyond its capabilities, but its short lived. A demonstration of this is when something dosnt hold the same passion or relief for us and this is where the mind sayes “Enough of this, im in charge” and thats why certain beliefs, relationships and even certain medications cease to work. ",
            "date": "Answered January 19, 2020",
            "views": "42",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "T. Stephen Cornelius",
                "href": "/profile/T-Stephen-Cornelius"
            },
            "answer_text": "There is no true or false self… just self relative to other stuff itself. There is no beyond… beyond just rumours we LIKE to tell about ourselves and sell movie scripts and books entertain our imaginative nature and fears of life and death or anything else not to be bored with our presence. It's fun! Comedic irony of it makes us laugh at our pretension…eh? ",
            "date": "Answered January 19, 2020",
            "views": "29",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Matthew Boteler",
                    "user_href": "/profile/Matthew-Boteler"
                },
                {
                    "user_id": "Helen Katon",
                    "user_href": "/profile/Helen-Katon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Srividya",
                "href": "/profile/Srividya-51"
            },
            "answer_text": "Mind can operate in the domain of objects. Objective knowledge is possible for mind. However mind cannot know consciousness which is pure subjectivity. When the mind seeks the subject mind disslolves into pure consciousness into a star of no mind - enlightenment. ",
            "date": "Answered March 8, 2020",
            "views": "72",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Manish Gupta",
                    "user_href": "/profile/Manish-Gupta-3523"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Mudd",
                "href": "/profile/John-Mudd-9"
            },
            "answer_text": "Simply because the true self is fundamental, we were born with it and it has never gone away. So awakening to that true self is just a matter of letting the mud settle from the clear pure water, so to speak. ",
            "date": "Answered January 19, 2020",
            "views": "22",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aurimas Navys",
                    "user_href": "/profile/Aurimas-Navys-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ragesh Nair",
                "href": "/profile/Ragesh-Nair-10"
            },
            "answer_text": "Mind is the seed and world is the tree. To Understand seed, first Understand the tree. When you understand both you will have the clarity within which both seed and tree appears. ",
            "date": "Answered January 19, 2020",
            "views": "34",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Eta Mahara",
                    "user_href": "/profile/Eta-Mahara"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Haines",
                "href": "/profile/Michael-Haines-10"
            },
            "answer_text": "‘You’ can’t. Fortunately, there is no need to do anything. It’s impossible to be what you are not :) ",
            "date": "Answered January 19, 2020",
            "views": "70",
            "upvotes": "0"
        }
    ]
}