{
    "title": "How important is the ego in the path towards awareness and enlightenment? - Quora",
    "tags": [
        "Spiritual Awakening",
        "Ego",
        "Enlightenment (spiritual)",
        "Self-Awareness",
        "Consciousness",
        "Meditation"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Emig",
                "href": "/profile/Steve-Emig"
            },
            "answer_text": "Ego is the “pathless” path…home…to our true nature. Without the ego there would be no need to change because we would have never left home (enlightenment) to begin with. Ego needs to be seen for what it is: an artificial version of us that thought itself into being believing it was us and we (as ego) believed it to be us…until we don’t. Ego relies on our belief in it’s creation. Without our belief ego doesn’t exist. Live Now makes use of the intuition of our true nature to be who we really are and observe the ego each time it “lives us” to see that we no longer believe it to be us. Live Now was discovered by Al Mejia in the early 70′s when Al walked away from his last DUI car wreck that should have killed him. At that point he felt something was keeping him around for a reason so decided to “work” on himself. He went to AA which took care of the alcoholism, but he had trouble just getting to work everyday. His “brain” just was nuts. He made a lot of mistakes. He couldn’t focus. Thoughts were racing telling him to do crazy things and then they would obsess about one thing so he couldn’t move. Al eventually discovered that something inside of him just “knew” what to do no matter what the thoughts said. He found if he followed that inner knowing rather than the thoughts he would not make mistakes. He started asking himself OUT LOUD “what do I need to do now?” and waited for the inner knowing to answer or know what to do and he would just do that one thing and it would be fine. When he finished doing that thing he asked again OUT LOUD “what do I need to do now?” and again would listen for the inner knowing to answer and he would do that next thing and it would be fine. Al discovered that he could successfully get through each day this way and things would fall into place without relying on thought at all. This didn’t mean that the thoughts stopped raging though. Soon, Al discovered that if he talked OUT LOUD to them and they would be shocked and would stop and listen. He would tell them : “you’re not me”, “you don’t go to work, I do”, “you’re the one having difficulty, not me”. Al found it even more effective to give the thoughts a name. He called them “brain” and talked to them like: “I’m sorry you’re having such a difficult life “brain”, but that’s not my problem; it’s yours.” Talking OUT LOUD to the thoughts came from the inner knowing and prevented the thoughts from doing it. Al began to see that the thoughts that he thought were him; weren’t. The knowing that “always knew” was more him than the thoughts were. He kept observing as he did what he needed to do every day and kept talking OUT LOUD to the thoughts and his life began to change dramatically. Life seemed to start “living him” clearly and effortlessly. Living became magnificent so he started telling others about his experience. They were able to have the same experience that he did. What started as a broken life of the ego lead to a wonderful life as the “real” Al. We are always “real” beings at our essence. The ego moves the “focus” to itself and away from essence. Seeing the truth leads to complete disbelief in the imaginary ego and all it’s thoughts and it falls away because it never “was” real in the first place. ",
            "date": "Answered July 18, 2019",
            "views": "106",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Joe Blake",
                    "user_href": "/profile/Joe-Blake-59"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kane Mantyla",
                "href": "/profile/Kane-Mantyla"
            },
            "answer_text": "The ego is a magnificent no-thing. Some call it the enemy, some say it doesn’t exist, some say it needs to be extinguished…all of these have truth, but without understanding what the ego is, they will likely confuse. The ego does not exist of its own accord, but rather as an artifice, a function of something else. It is similar to a whirlpool. A whirlpool exits only due to the draining of water. Without the water draining, there is no whirlpool. The ego exists where we create separation. It is a mechanism of individualized consciousness. When I say “I,” I separate me from all else (and my potential). My ego maintains the separation of me from all else so that I can experience myself separate. The more separations I create, the more ego is required to maintain that separation and the more removed I become from my potential. This is why ego and identity are so closely related. As children, we naturally develop a self separate from our potential. We say, “I am this,” and, “I like that.” Each of these defines an identity that the ego then begins to filter our reality to create the experience of that individualized reality. Also, the more egoic I become, the more resources are occupied by it because I am furthering the separation of my perception of reality from reality itself or my identity from my potential. These resources now are now not available to my consciousness. I become more fragmented and less whole. This can become so pronounced in some people that they make a psychotic break with reality. Cognitive dissonance is a softer form of this break. When masters speak of, “being in the present moment” it is because in the present moment, there is no division. No past, no future, no self, no projection, and therefore, no ego. There is nothing to separate reality in the present moment. This allows consciousness to align with reality and in doing so, is the ego not present. We experience reality directly for what it is and not our filtered perception of what it is. So, if you want to stop a whirlpool, the only sense in saying it is the enemy, that it doesn’t exist, or that that it needs to be extinguished is so that you can act. So how do you stop a whirlpool? Plug the drain. And if you want to stop the ego, be present. Accept all things as they are and the ego will naturally dissolve and you will experience profound liberation as you regain all the resources that were being occupied. ",
            "date": "Updated July 16, 2020",
            "views": "27",
            "upvotes": " View 74 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rajashree Saha",
                    "user_href": "/profile/Rajashree-Saha-4"
                },
                {
                    "user_id": "Nitika Shrivastava",
                    "user_href": "/profile/Nitika-Shrivastava-2"
                },
                {
                    "user_id": "Sabrina Sandhu",
                    "user_href": "/profile/Sabrina-Sandhu-6"
                },
                {
                    "user_id": "Leyla Lampi",
                    "user_href": "/profile/Leyla-Lampi"
                },
                {
                    "user_id": "Kratu Nandan",
                    "user_href": "/profile/Kratu-Nandan"
                },
                {
                    "user_id": "A. I. Marshel",
                    "user_href": "/profile/A-I-Marshel-2"
                },
                {
                    "user_id": "Pamela Iyiegbu",
                    "user_href": "/profile/Pamela-Iyiegbu"
                },
                {
                    "user_id": "Zach Klebaner",
                    "user_href": "/profile/Zach-Klebaner"
                },
                {
                    "user_id": "Kencheeri Alaasap",
                    "user_href": "/profile/Kencheeri-Alaasap"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Sanātana"
                },
                {
                    "user_id": "Cheryl Orr",
                    "user_href": "/profile/Cheryl-Orr-4"
                },
                {
                    "user_id": "Shantharam Kalipatnapu",
                    "user_href": "/profile/Shantharam-Kalipatnapu"
                },
                {
                    "user_id": "Yashasvi Acharya",
                    "user_href": "/profile/Yashasvi-Acharya"
                },
                {
                    "user_id": "Sachin Gadkar",
                    "user_href": "/profile/Sachin-Gadkar"
                },
                {
                    "user_id": "Joel Postma",
                    "user_href": "/profile/Joel-Postma"
                },
                {
                    "user_id": "John Celeste",
                    "user_href": "/profile/John-Celeste"
                },
                {
                    "user_id": "Sushant Singh",
                    "user_href": "/profile/Sushant-Singh-852"
                },
                {
                    "user_id": "Saravana kumar",
                    "user_href": "/profile/Saravana-kumar-2540"
                },
                {
                    "user_id": "Marion Yaokpli",
                    "user_href": "/profile/Marion-Yaokpli-1"
                },
                {
                    "user_id": "Barry Croker",
                    "user_href": "/profile/Barry-Croker"
                }
            ]
        },
        {
            "author_info": {
                "name": "Parijat Srivastava",
                "href": "/profile/Parijat-Srivastava-5"
            },
            "answer_text": "A story from Yoga Vasishta - A demon called Sambara was causing a lot of misery to the Gods of Swarga (heaven) and the latter also equally reciprocated it. Ultimately, Sambara created three robots-like demons programmed to go fearlessly and demolish the army of the gods. As these robots were not afraid of death, the gods became panicky and approached Brahma, the creator. Brahma told them - “These robots, newly created, have no conditioning of fear. They have no ego of their own and simply follow the programme. For some time, you fight with them and run away. By going on doing like this, this experience will begin to leave impressions and when they see that they are able to strike terror among you and make you flee, slowly their ego will begin to grow and impressions of fear will be built up. Then, when once the ego and fear are built up, even a child can knock them down”. The gods followed this advice and became victorious. The ego is the “I” sense which identifies itself with the body-mind complex. This impostor of an “I” is sustained solely because we always consider ourselves as the doers of various actions and as the ones who experience the fruits of such good or bad actions resulting in joy or sorrow. Righteousness and sin, pleasure and pain are all imaginations of the mind and are not real. Actually, there is no individual personality at all as all actions including breathing, thinking, eating, talking, walking, etc. are done by the Totality (i.e. the all-pervasive cosmic Consciousness using each human body as an instrument). So we are not the doers at all. The Consciousness, after assuming a body, has forgotten its integral link with the Totality and instead identifies itself with the body with all its limitations. So a false “I” is created which thinks I am breathing, I think, I eat, I talk, I walk, etc. The moment you cease to consider yourself to be the doer or enjoyer, you will recognise yourself to be ever liberated. - (धर्म अधर्मौ सुखं दुःखं, मानसानि न ते विभो । न कर्तासि न भोक्ताः असि, मुक्त एवासि सर्वदा ।। Ashtavakra Gita I - 6) ",
            "date": "Answered July 15, 2019",
            "views": "180",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joe Blake",
                    "user_href": "/profile/Joe-Blake-59"
                },
                {
                    "user_id": "Kane Mantyla",
                    "user_href": "/profile/Kane-Mantyla"
                },
                {
                    "user_id": "Mainat Kamat",
                    "user_href": "/profile/Mainat-Kamat"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Nielsen",
                "href": "/profile/Eric-Nielsen-73"
            },
            "answer_text": "Ego is the most important thing in your way. We become egotistical, because of desires, which bring stimulus searched out for us by our five senses, from the world in which we live. They are then brought to the mind and contemplated on by us, as to whether we like or dislike how it fits the personality we see ourselves as being or becoming. This is based on our world or environment. Desire must be fought by willpower. Will power is built within each of us by reviewing or contemplating our daily actions. By contemplating what took place during our day, you will have a inner conversation to work out the the right and wrong of our actions. Their you will find that those actions are guided by ego or selfish decisions. This must be done honestly within your own mind, as your ego will be right there to jump in and try to keep you from making the right changes. Don’t worry, your inner self knows right from wrong. It is just, that it is up to your own honesty to own your actions and change them for the good. Then you are on the path to awareness that leads to enlightenment. NOTE; This contemplation must include forgiveness, by leaving doors open for people that you feel did you wrong — just encase those people come to their own sense of right and want forgiveness. Also doing for others helps this process too. In doing things like volunteering, you must not do the service to others while holding the concept of reward for yourself in your heart. Doing so voids the full benefit of your work. Instead always do good for the sake of doing good alone — take nothing for yourself. Why is this the case? This is true because all you have and get in life comes down from above for your benefit. Whether it be for enjoyment or learning, nothing is of your doing. This is a perfect system we live in. That being creation itself. This is why we don’t need to force our lives. Finally… Enlightenment is an endless journey as enlightenment is knowledge/ wisdom — which is infinite, because it is God Consciousness you are filling yourself with. ",
            "date": "Answered July 15, 2019",
            "views": "129",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Talib Bah",
                "href": "/profile/Talib-Bah-1"
            },
            "answer_text": "The ego is the number one enemy of the mystic. On the mystical path, the ego must be completely deleted and annihilated. Burned with fire (arabic tarbiyah) until there is no sense of self left. When there is no self left (la ilaha), only God is what’s left (illa Allah). The Buddhist call the ego a “wrong view”, and that’s true because there is no ego. The Hindus call it maya (“illusion”) and that’s also true because the ego is a false reality. The Sufis have endless teachings on the ego, some Sufis say “when I am here, God is absent, when I am gone, God is present”. Other Sufis say “the ego is the worst creation in the universe”. Ego-consciousness is the ultimate form of idol worship (arabic shirk). Ego-consciousness is a false deity (ilah) that we identify with, we think we are it. But you are not your ego. Your true self is the spirit (arabic ruh) which is the spirit of God. You cannot experience yourself as the spirit of God, which is the end goal of all mystical traditions, as long as you have a sense of self (“ego”, I, me, my, mine). There are many levels to ego-annihilation. One of the most ancient ways to annihilate the ego, is to pray to God by bowing your forehead to the ground (arabic sajda). The ego does not like to bow down to God, so when you bow down, you are putting your ego on fire. The muslim prayer still has retained the sajda (bowing down), one of the great miracles of Prophet Muhammad [saw] if you ask me. ",
            "date": "Answered July 19, 2019",
            "views": "813",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lynn Farmer",
                    "user_href": "/profile/Lynn-Farmer-14"
                },
                {
                    "user_id": "J Houser",
                    "user_href": "/profile/J-Houser-2"
                },
                {
                    "user_id": "Majid Syed",
                    "user_href": "/profile/Majid-Syed-10"
                },
                {
                    "user_id": "Leena Jatta",
                    "user_href": "/profile/Leena-Jatta"
                },
                {
                    "user_id": "Ali Raza Chattha",
                    "user_href": "/profile/Ali-Raza-Chattha"
                },
                {
                    "user_id": "Aashish Malhotra",
                    "user_href": "/profile/Aashish-Malhotra-1"
                },
                {
                    "user_id": "Recsò Alen",
                    "user_href": "/profile/Recsò-Alen"
                },
                {
                    "user_id": "David King",
                    "user_href": "/profile/David-King-1311"
                },
                {
                    "user_id": "Arif Adamji",
                    "user_href": "/profile/Arif-Adamji"
                },
                {
                    "user_id": "Eduardo Marqués Collado",
                    "user_href": "/profile/Eduardo-Marqués-Collado"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edg Duveyoung",
                "href": "/profile/Edg-Duveyoung"
            },
            "answer_text": "Ego ain’t aware.Ego has no sentience.Ego no mojo. Saw the ego then.And see it in the future.But never be it. Ego is a twit.Silly from start to finish.’Tain’t a proper you. Ego is so vague.Seems it’s there, but no it ain’t.Identity’s blur. Ego has some friends.Jackalopes, unicorns! See!Vapors, fumes and ghosts! Scapegoat ego blamedFor every bad and good.But it’s error free. It’s invisible.Not even God has seen one.Never no never. So see the good news?All charges can be dismissed!Ego innocence! That witness of allIs your true identity.It’s the only me. “Haiku, haiku very much.” — Japanese Elvis ",
            "date": "Answered July 16, 2019",
            "views": "18",
            "upvotes": " View 24 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andrew Dyrda",
                    "user_href": "/profile/Andrew-Dyrda"
                },
                {
                    "user_id": "Barbara Nims",
                    "user_href": "/profile/Barbara-Nims-1"
                },
                {
                    "user_id": "Maxime Boissel",
                    "user_href": "/profile/Maxime-Boissel"
                },
                {
                    "user_id": "Nicola Sanchez",
                    "user_href": "/profile/Nicola-Sanchez-2"
                },
                {
                    "user_id": "Noah Hoke",
                    "user_href": "/profile/Noah-Hoke"
                },
                {
                    "user_id": "Charley Hepfinger",
                    "user_href": "/profile/Charley-Hepfinger"
                },
                {
                    "user_id": "Philip Sleeman",
                    "user_href": "/profile/Philip-Sleeman-1"
                },
                {
                    "user_id": "Sarah Looney",
                    "user_href": "/profile/Sarah-Looney-8"
                },
                {
                    "user_id": "Athea Kong",
                    "user_href": "/profile/Athea-Kong"
                },
                {
                    "user_id": "Tony Crook",
                    "user_href": "/profile/Tony-Crook-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bryan Duffy",
                "href": "/profile/Bryan-Duffy-12"
            },
            "answer_text": "Your ego is all yours, every human has one, including ever guru and enlightened master, from Jesus, Buddha, the Dalai Lama, and everyone here on quora. They all had or if alive now have a very active ego. If you hear them say different you are free to call bullshit. You can’t actually get rid of your ego, but you can know it well for what it really is. Just a small part of the picture, a very limited part of the consciousness you really are. And it can be fun at times, i kind of think of mine like a child that constantly wants my attention, sometimes i enjoy playing with it, but i’m always aware it’s just a game, all make-believe, nothing real about it. Sometimes it’s like a troublesome teenager that tries to get me into trouble with the neighbours, or wants to borrow the keys to the car, but i never let it in the drivers seat anymore. ",
            "date": "Answered August 8, 2019",
            "views": "187",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lily Grant",
                    "user_href": "/profile/Lily-Grant-23"
                },
                {
                    "user_id": "Arun",
                    "user_href": "/profile/Arun-1739"
                },
                {
                    "user_id": "James Melton",
                    "user_href": "/profile/James-Melton-8"
                },
                {
                    "user_id": "Natalie Williams",
                    "user_href": "/profile/Natalie-Williams-535"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Gali-P-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Erim Guloglu Yolmaz",
                "href": "/profile/Erim-Guloglu-Yolmaz"
            },
            "answer_text": "i don’t see the ego as an obstacle or something to be killed. on the other hand, i believe that the ego is closely linked with the mind. so once we contemplate on the ego and how it drives us, we understand the reasons behind some of our actions and our ways of thinking. this might also help us understand how the mind works as well. so to me the importance of the ego lies in the discovery of the mind, and understanding how the ego operates helps us see the way our mind works. i have no idea about the enlightenment part as i think i have a long way to go there, but i believe understanding the ways of the human mind helps us know our true self better, and it might even help us realize our authenticity and reach our full potential. ",
            "date": "Answered July 15, 2019",
            "views": "54",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lily Grant",
                    "user_href": "/profile/Lily-Grant-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prashanth Hirematada",
                "href": "/profile/Prashanth-Hirematada"
            },
            "answer_text": "Ego weighs in big time. There’s also a judge in our mind - not talked about much in spirituality but in psychology. The analytical one. Ego of course can influence the judge and over rule too at certain times. In extreme emotions. So keep those emotions in check - awareness of your emotions as they take hold - same awareness as with in anger as with in joy. Enlightenment, just a word. What emotions does that word invoke within you? What does ego say and where is the judge? ",
            "date": "Updated July 19, 2019",
            "views": "125",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amiriah Kaite Di Eros",
                    "user_href": "/profile/Amiriah-Kaite-Di-Eros"
                },
                {
                    "user_id": "Kevin Yohey",
                    "user_href": "/profile/Kevin-Yohey"
                },
                {
                    "user_id": "Galina Milkova-Bekiaris",
                    "user_href": "/profile/Galina-Milkova-Bekiaris"
                },
                {
                    "user_id": "Michael Dixon",
                    "user_href": "/profile/Michael-Dixon-29"
                },
                {
                    "user_id": "Kratu Nandan",
                    "user_href": "/profile/Kratu-Nandan"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Davis",
                "href": "/profile/James-Davis-119"
            },
            "answer_text": "Identification that is limited to the ego or personal self is a normal, natural, and necessary part of human experience and evolution. It is not important as a thing to be emphasized but it has a measure of importance in the scheme of things. See my related Quora answers: In Psychosynthesis, what is the difference between the ego on one hand, and the personal self (or 'I') on the other? How can I destroy my ego (self)? ",
            "date": "Answered July 15, 2019",
            "views": "81",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard Trigaux (Yichard Muni)",
                "href": "/profile/Richard-Trigaux-Yichard-Muni"
            },
            "answer_text": "Ego is the main obstacle. Often it opposes our spiritual activities. But worse of all, it can mimick awakening. The ego is often understood as our tendency to egocentricity. It goes much further: it is kinda the logical engine of our grain, which is creating the continuous flow of daydreams, intent, ideas, etc. It wants to manage everything, control others, and even want to manage our own spirituality. Which it cannot do, of course. The antidote to the ego is the practice of compassion, altruisic acts, but above all surrendenting to the higher spirit. ",
            "date": "Answered July 15, 2019",
            "views": "95",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alex Barad",
                    "user_href": "/profile/Alex-Barad"
                }
            ]
        },
        {
            "author_info": {
                "name": "Srividya",
                "href": "/profile/Srividya-51"
            },
            "answer_text": "You must have heard of the word 'Antahkarana'. The subtle body which constitutes the mind, ego, intellect and memory (Manas-Buddhi-Ahamkara-Chitta). Atahkarana is also called as Mind. Ego-intellect-memory are the functions of the instrument called mind. It's the mind with all these functions which is seeking Enlightenment. The Ego claims to be the body-mind and it creates the Duality. Now, through the process of Shravana-Manana-Nidhidhyasa (Listening from Enlightened Guru- Contemplatiion and staying established as Brahman), Ego understands it's true nature and dissolves. You become eternally blissful and peaceful. If you go to a slightly higher level, you will also understand that Ego is just an “I-Thought” which forms the basis for all other thoughts. Ego is the center point in the path of Enlightenment. ",
            "date": "Answered August 5, 2019",
            "views": "58",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Neel",
                    "user_href": "/profile/Neel-226"
                },
                {
                    "user_id": "Prashant Edassery",
                    "user_href": "/profile/Prashant-Edassery"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amit Nagpal",
                "href": "/profile/Amit-Nagpal-Spiritualcomforts-blogspot"
            },
            "answer_text": "Shunning ego is the most important in path toward awareness and enlightenment. Ego is the root cause of ill thoughts and considering one to be above everyone else makes one adamant not to learn about spirituality. To bring ego in control is the most important and must do task, if one has to gain enlightenment. ",
            "date": "Answered May 28, 2020",
            "views": "37",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Hague",
                "href": "/profile/David-Hague-16"
            },
            "answer_text": "The ego and everything it represents is the furthest landmark on the map to the human constitution! it may be full with arrogance and selfishness ? So this is a hindrance to pure awareness of the spirit and as for enlightenment? Well if you have ego you can forget it 👎 ",
            "date": "Answered January 23, 2020",
            "views": "53",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ragesh Nair",
                "href": "/profile/Ragesh-Nair-10"
            },
            "answer_text": "Because of ego one is there to look for enlightenment. If there was no ego then there was no need for suffering and enlightenment. Existence is the process to un-exist. Like a journey to return to your source in completeness . ",
            "date": "Answered July 15, 2019",
            "views": "54",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Melton",
                "href": "/profile/James-Melton-8"
            },
            "answer_text": "everybody, every-person in and on the planet is an ego. we wouldn’t know beauty, awe, wonder, even feelings, emotions, and so fourth if nobody had an ego cause nobody would say “ I like such and such”, no ego no differentiation . we wouldn’t know who we are without an ego. in my mind, the ego exists mostly in the mind, internal monologue. ",
            "date": "Answered September 18, 2019",
            "views": "22",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "João Ferreira",
                "href": "/profile/João-Ferreira-39"
            },
            "answer_text": "The ego is always presente. About what enlightenment is philosophically take a look at João Ferreira's post in Life Philosophy-Abstracts ",
            "date": "Answered July 16, 2019",
            "views": "36",
            "upvotes": "0"
        }
    ]
}