{
    "title": "How can we know that a scientific truth is a universal truth? - Quora",
    "tags": [
        "Universal Truth",
        "Truth",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Al Erudite",
                "href": "/profile/Al-Erudite"
            },
            "answer_text": "We can’t because there is no universal scientific truth. Only the entirety of life itself can be a universal truth (its existence in and of itself). Thus, all scientific findings independent of field remain but relative facts (relative to perception). Fact and truth are not the same. Fact is true for now, but may not be true permanently. While truth is truth forever—independent of time and space. Hence, facts are relative through sense and perception, whereas truth is not and exists per se. You see, all is but a sensory projection made up by our brain. This is demonstrated by all the neurological diseases that change the world for those affected i.e., Anosognosia, Korsakoff’s syndrome, Apaxia, etc (there are many, many more). If our brain experiences one tiny impairment, our entire reality would change. Now, imagine that we damaged parts of our brain that are associated with face recognition so no one could see a full face anymore—only half faces (i.e., Harlequin Syndrome). How would we know that full faces exist when all we would perceive is half of the face of people? We wouldn’t. In fact, we would deem it as natural to have half a face, whereas a full one would probably terrify us as that would be unnatural. Therefore, all that could be ever said to be the truth—must inherently be within us. Ultimately, we are the only reality we can or will ever experience in existence. Hence you can say— I am the only universal truth there is (because existence is being perceived by a subject none of us knows what is, despite our persistent belief of it being “me”). Because life can only perceive life through physical forms—it is therefore inherently locked into a biological robot we know as our body. This is how it can perceive the totality of itself (life living life). The sad part is that science is slowly replacing religion and becoming like religion when it is nothing but relative facts. Facts may perhaps apply within its current contextual moments, but never permanently like a universal truth would. Which is why truth exceeds facts. ",
            "date": "Updated August 31, 2020",
            "views": "12",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Carl-Magnus Arvhult",
                    "user_href": "/profile/Carl-Magnus-Arvhult"
                },
                {
                    "user_id": "Elias Ward",
                    "user_href": "/profile/Elias-Ward"
                },
                {
                    "user_id": "Rajan Subhedar",
                    "user_href": "/profile/Rajan-Subhedar"
                },
                {
                    "user_id": "João P. Spínola",
                    "user_href": "/profile/João-P-Spínola"
                },
                {
                    "user_id": "Dino Fluri",
                    "user_href": "/profile/Dino-Fluri"
                },
                {
                    "user_id": "Yemeen Ayub",
                    "user_href": "/profile/Yemeen-Ayub"
                },
                {
                    "user_id": "Prashant Shinde",
                    "user_href": "/profile/Prashant-Shinde-46"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rey Blanco",
                "href": "/profile/Rey-Blanco"
            },
            "answer_text": "The question begs us to accept the proposition that scientific truths are universal. But the ‘laws’ may differ. Scientists use reliable and trustworthy “clocks” to progress. That means that “change” is measurable and therefore can be duplicated, verified and predictable. This is a good thing, and there is good reason to continue on this path. - But scientists (as opposed to science) have dismissed “unmeasured” and “irrational” events. For example, let us take “dream logic.” If the universe included coordinates where the laws of physics were different, and one “image” morphs into another without “cause and effect” then scientists have been known to dismiss these possibilities as unscientific study. - So, we must discern between “science” and “scientists.” Scientist follow the rules of science, but that does not mean that “scientists,” nor “science” sanction what is truth. - For example, we have seen that the “invisible imagination” has many times in the past been subjected to scorn. But if we realize that many times what goes on in virtual reality works complimentary with physical reality, we should be able to consider that science fiction, and fantasy have seemed to foreshadow the future achievements that blossom in the scientific community. Space and medical marvels, for instance, started with what seemed to be superstition, magical thinking, wishes, and outlandish, even silly visions. - Scientists, we hope are not soulless automated zombies that merely operate like machines in a devoted drudgery. Yes, there are many thankless “spokes” in the wheel that fine tune the trial and error, experimental applications, and so on that finally produce something tangible. - From the dawn of history, “science” existed, but perhaps not yet were human kind able to “raise their consciousness” in a way to click and bridge the invisible and visible. - Perhaps, a good view of the limitations of scientists and a “universal time” is stated by a Professor of Higher Mathematics, Ferdinand Gonseth. >> “…have taken a further step, not only towards the objectivation of the measurement of time, but also towards the objectivation of time itself. When will this procedure of extension have reached its term? Principally never. In practice one must observe moderation. In a Situation of well-defined knowledge, it is useless to increase indefinitely the possibilities of control and of synchronicity. But what gives us the right, we might ask, to stop the process of extension at this point? If one does not admit the existence of an objective and universal time, is it not a fault of method to assume that the controls of synchronicity which have been erected would guarantee those which were not yet erected? Is it admissible to exclude as impossible the ease of an instrument still \"unpublished\" which could not be easily fitted into the group of clocks presently in use? We have already answered this question indirectly. It is not necessary to construct all possible clocks; it suffices to establish the temporal law of the phenomena. As long as this temporal law does not vary with regard to the moment when the phenomenon begins (this Variation certainly could not be attributed to any momentary influence or to any more or less concealed evolution of the system which is the seat of this phenomenon), we have no reason whatever to abandon the hypothesis of a universal time, and every phenomenon whose law does not vary in the course of time confirms this hypothesis. What more can we ask of a natural law?” (Time and Method p 216). Another example is how we think of “time-space.” For many, ‘past’ has vanished, the ‘future’ is a not yet existent distant event for a narrow ‘present.’ But perhaps we construct ‘time’ so that the “space” we envision has a coordinate system we can measure and work with? What if “SPACE” is not only faster than the velocity of light, but encompasses ‘past,’ ‘present’ and ‘future’? Can we exclude unmeasured time and dismiss it because scientists are not capable of working with ‘unmeasured’ time and must rely upon ‘measured’ time for “change”? ",
            "date": "Answered August 24, 2018",
            "views": "488",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Berj Manoushagian",
                "href": "/profile/Berj-Manoushagian"
            },
            "answer_text": "First of all, there is no such thing as \"scientific truth\". Truth is not the goal of science, since scientists admit that they do not know what truth is!! The method of science is called Induction. Induction is the making of universal claims based upon a necessarily limited number of observations. No matter how many white swans we observe, we are never justified in claiming that ALL swans are white. Since Induction is a logical fallacy, all claims of science not only are not true, but they are all erroneous. ",
            "date": "Answered August 25, 2018",
            "views": "237",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Crack Shot",
                    "user_href": "/profile/Crack-Shot-1"
                },
                {
                    "user_id": "Murari Das",
                    "user_href": "/profile/Murari-Das-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevill Davies",
                "href": "/profile/Kevill-Davies"
            },
            "answer_text": "Q. How can we know that a scientific truth is a universal truth? I suggest you can’t because of nature’s delicious paradox concerning the number one, unity, the foundation of mathematics, science and reasoning. When I ask the question of what is the square root of one, there are two valid answers thereby destroying the integrity of the number and ‘truth’. It is clear that the positive solution works in our part of the universe. If you have an apple and acquire another you have two apples but I suggest that this is not universal. ",
            "date": "Answered August 27, 2018",
            "views": "191",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ian Sullivan",
                "href": "/profile/Ian-Sullivan-22"
            },
            "answer_text": "We are only capable of knowing what we can in some measure perceive. We are not currently capable of perceiving all facets of the universe. As such, we are incapable of determining what is a universal truth. We can, however prove that a truth is valid for all known quantities through using one of several scientific research models. These models are used to isolate the research from the researcher, isolate variables to accurately measure effect, and isolate the research subject from unduly influencing the research. Wikipedia will provide a decent primer into effective research models. Many professional disciplines require some study in this subject. ",
            "date": "Answered September 9, 2018",
            "views": "139",
            "upvotes": " Answer requested by Yemeen Ayub",
            "upvoters": [
                {
                    "user_id": "Gavin Hurlimann",
                    "user_href": "/profile/Gavin-Hurlimann"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Wynne",
                "href": "/profile/Daniel-Wynne-12"
            },
            "answer_text": "That depends on what you mean by “scientific truth” and “universal truth.” I think the only really meaningful distinctions are objective truth and subjective truth. If a scientific claim matches the reality it describes, it is objectively true. If a claim about my favorite flavor of ice cream matches my preference for ice cream, it is subjectively true. Truth is the correspondence between a claim, idea, or proposition and that to which it refers. ",
            "date": "Answered September 8, 2018",
            "views": "72",
            "upvotes": " Answer requested by Yemeen Ayub",
            "upvoters": [
                {
                    "user_id": "Jerome Pollack",
                    "user_href": "/profile/Jerome-Pollack"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tim ODonnell",
                "href": "/profile/Tim-ODonnell-33"
            },
            "answer_text": "Absolute truths and absolute falsehoods derive their universal application from definitions, mathematical definitions, mathematical axioms, or from logical axioms. For example, there are no married bachelors because by definition a bachelor is unmarried. Likewise, it is impossible to exist and not exist at the same time because these are mutually exclusive conditions. Scientific truths are relative to a specific set of conditions. Thus, they are conditional or contingent truths. For example, the force of gravity is relative to the size of objects and the distance between them. Therefore, we can calculate the parabola of a projectile. However, if we forget to account for the wind, the object doesn't land where we anticipated. ",
            "date": "Answered October 9, 2018",
            "views": "217",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Elias Ward",
                    "user_href": "/profile/Elias-Ward"
                },
                {
                    "user_id": "Pranjal Jharkharia",
                    "user_href": "/profile/Pranjal-Jharkharia"
                },
                {
                    "user_id": "Jim Brown",
                    "user_href": "/profile/Jim-Brown-437"
                },
                {
                    "user_id": "Magnus Raagaard",
                    "user_href": "/profile/Magnus-Raagaard"
                },
                {
                    "user_id": "Helen Von Schrottky",
                    "user_href": "/profile/Helen-Von-Schrottky"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gregory Benson",
                "href": "/profile/Gregory-Benson-5"
            },
            "answer_text": "When a scientific discovery is validated over and over, it gains a reputation of being Truth. However, when new information fails to match the predictions made according to that Truth, scientists must refine, adapt, or replace it with a better Truth. As time goes on, we will get ever closer to the ultimate universal truths by using the Scientific Method. If we should ever decide we know everything and stop looking for exceptions, that’s when humanity will begin to stagnate. ",
            "date": "Answered August 24, 2018",
            "views": "100",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Leland R. Beaumont",
                "href": "/profile/Leland-R-Beaumont"
            },
            "answer_text": "Truth is correspondence with reality. Scientific methods are the most reliable epistemology—way of knowing—developed so far. Scientific methods rely on wonder, embracing reality, an evolving understanding, openness, humility, and objectivity to continuously improve our understanding and description of reality. If more reliable epistemologies are developed, scientific methods will be improved to incorporate those new methods. This metaphor comparing science to a living tree provides a good way to think about how scientific methods promote the evolution of knowledge. ",
            "date": "Answered August 25, 2018",
            "views": "203",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Berj Manoushagian",
                    "user_href": "/profile/Berj-Manoushagian"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Jermey",
                "href": "/profile/Jon-Jermey"
            },
            "answer_text": "There’s nothing necessarily interesting or important about a universal truth. Here’s one that’s neither important nor interesting: At 7.39 am Eastern Australian Standard Time on August 25 2018, Jon Jermey’s electric heater was on. That’s true. That will always be true, whenever and wherever it is said, and whoever by. It will still be true after the heat death of the universe. But it’s not important. Here’s a relative truth: My electric heater is on now. It’s relative because if someone else says it, or if I say it later, it may not be true. But it’s still not important. Whether the claims made by science are true and useful is far more important and interesting than whether they are universal. ",
            "date": "Answered August 24, 2018",
            "views": "18",
            "upvotes": " View 5 Upvoters "
        },
        {
            "author_info": {
                "name": "Tim Novice",
                "href": "/profile/Tim-Novice"
            },
            "answer_text": "The simple answer is you can't. The scientific method is a pragmatic method at its core and does not claim to be a “universal truth”. It works and that is all it claims to do. ",
            "date": "Answered August 24, 2018",
            "views": "70",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "David Chan",
                "href": "/profile/David-Chan-287"
            },
            "answer_text": "We cannot know universal truth through Science. Only Religious paradigms offer universal truths through the religion's core beliefs or credo. Science offers no such thing. Instead it implies all statements about reality are provisional and can be changed given sufficient compelling evidence. For more, read The Fundamental Difference between Religion and Science. ",
            "date": "Answered August 24, 2018",
            "views": "78",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anthony Matteo",
                "href": "/profile/Anthony-Matteo-2"
            },
            "answer_text": "Scientific truths are based on the current level of empirical evidence garnered by scientists around the world. However, such truths are, in principle, revisable based on newly acquired empirical evidence. For example, for centuries it was believed that the atom was the basic, indivisible building block of material reality. However, further research discovered the existence of sub-atomic particles. ",
            "date": "Answered August 25, 2018",
            "views": "91",
            "upvotes": "0"
        }
    ]
}