{
    "title": "How does one pursue excellence? - Quora",
    "tags": [
        "Excellence",
        "Integrity",
        "Ethics",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alexis Presbrey",
                "href": "/profile/Alexis-Presbrey"
            },
            "answer_text": "I asked my husband how he did so well in school (top ten and 5.2 GPA in high school). Varsity athlete, student worker, and entrepreneur. He kicked ass at everything in school and still had time to read personal development books and hang out with friends. His answer: “honestly the only thing that I did was care”. He cared so much that he would constantly be thinking about everything he had to get done. He would sleep only four or five hours a night. He would wake up at 5am so he could go to a cycling class with his mom before school. He would go from school to practice to work and then do homework for another five hours. He would care so much about his future that he would constantly stress himself out all of the time that he would never truly be happy, he would always need more. There is a balance to pursuing excellence. I think the best way is too build yourself up gradually. Start with one habit or trait and go from there. If you push yourself too hard you will never truly achieve excellence. He achieved excellence in a way that many people would have dreamed about. He pursued knowledge, wealth, education, physical abilities, and everything you can imagine. But he forgot one thing, how to truly be happy with yourself. How to love your life. Appreciating the climb, the journey it takes to get there this is how you achieve excellence. It’s when you start to realize that you are indeed excellent. The pursuit is excellence. ",
            "date": "Answered September 22, 2017",
            "views": "12",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stephanie Lee",
                    "user_href": "/profile/Stephanie-Lee-5"
                },
                {
                    "user_id": "Tran Ngu",
                    "user_href": "/profile/Tran-Ngu-1"
                },
                {
                    "user_id": "Hangnga Nguyen",
                    "user_href": "/profile/Hangnga-Nguyen"
                },
                {
                    "user_id": "Pratyush Srivastava",
                    "user_href": "/profile/Pratyush-Srivastava-83"
                },
                {
                    "user_id": "Alex Fortune",
                    "user_href": "/profile/Alex-Fortune"
                },
                {
                    "user_id": "Phemelo Khetho",
                    "user_href": "/profile/Phemelo-Khetho"
                },
                {
                    "user_id": "Devi Chandika",
                    "user_href": "/profile/Devi-Chandika"
                },
                {
                    "user_id": "Malvika Gupta",
                    "user_href": "/profile/Malvika-Gupta-15"
                },
                {
                    "user_id": "Rohan R",
                    "user_href": "/profile/Rohan-R-12"
                },
                {
                    "user_id": "Damon Stone",
                    "user_href": "/profile/Damon-Stone-2"
                },
                {
                    "user_id": "Jack Loer",
                    "user_href": "/profile/Jack-Loer"
                },
                {
                    "user_id": "Ksawery Glab",
                    "user_href": "/profile/Ksawery-Glab"
                },
                {
                    "user_id": "Walter Piscanc",
                    "user_href": "/profile/Walter-Piscanc"
                },
                {
                    "user_id": "Timothy Dela Pena",
                    "user_href": "/profile/Timothy-Dela-Pena"
                },
                {
                    "user_id": "Andrew Wallace",
                    "user_href": "/profile/Andrew-Wallace-78"
                },
                {
                    "user_id": "Jeremy Fahling",
                    "user_href": "/profile/Jeremy-Fahling"
                },
                {
                    "user_id": "SYAMA KURUP",
                    "user_href": "/profile/SYAMA-KURUP"
                },
                {
                    "user_id": "JB",
                    "user_href": "/profile/JB-226"
                },
                {
                    "user_id": "Vincent Pingard",
                    "user_href": "/profile/Vincent-Pingard"
                },
                {
                    "user_id": "Kobe Fan",
                    "user_href": "/profile/Kobe-Fan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Karan",
                "href": "/profile/Daniel-Karan"
            },
            "answer_text": "Definition: Excellence: the quality of being outstanding or extremely good. How would you like it if everyone that knew you, described you as outstanding? \"That guy? He is extremely good\" - Everyone That would be pretty cool right? And, not because what other people say about you matters. But, compliments (when sincere) are great reflections of how you are showing up in the world. That's our goal for you. To be a man of excellence. Someone with character & values. Just your mere presence is an example to all about what's capable. Enough of the fake humble shit. It's all about getting better. Being obsessed with improving in every area of your life, every single day. Let the feeling of growth be your obsession. Your fuel. It's time for you to pick your head up while the rest of the world is looking down. Most of the world is walking around with slumped shoulders, distant eyes, dead spirit, heart filled with fear and looking weak/fragile not worthy of anyone's respect. They don't understand the fundamental law of excellence (we'll break this law down in just a moment). Developing the Habit of Excellence  You've probably heard this quote before. What Aristotle is saying here, is that all your actions (over time) become habitual. This includes acting in a manner of excellence. So the next question is \"How do we act in a manner of excellence?\" Here is where the fundamental law we talked about earlier comes in. And let me say, if you truly get this. If this really lands and you apply it. Sheesh. Your entire life will transform. The Fundamental Law of Excellence: HYDA i HYDE.  HYDA i HYDE (my way of saying and remembering it). How you do anything is how you do everything. One of the most powerful laws in nature. Now, let's go deeper. Our natural way of thinking about life is similar to a TV show. The first scene happens, then we transition into a second scene in a different location. After that's done, the third scene is shown in a different area. Scene four has you in different clothes and it's a new day. Etc. Etc. That's not how life works. If you eat a triple stack cheeseburger, french fries and a milkshake right now, I guarantee for the following hour, you will feel shitty. There is no separation between every moment of your day. Everything is flowing together in one river. Everything you do in the NOW affects future you. All we have is the 'NOW' and when I write that, I don't mean for it to come off how those woo-woo spiritual people talk about it. We seriously only have right now. This moment. The past? The Future? They only exist in our minds. I repeat, all we have is right now. Everything you do in this moment affects the next moment. It's all one scene. This is where HYDA i HYDE comes to play. How you do something right now sets you up for success or failure in the next moment. In order to develop the habit of excellence, you must commit to doing whatever task is in front of you in a manner that brings you pride and pleasure. Follow this exercise for a minimum of 60 minutes and notice how you feel. Exercise: For the next 60 minutes (set a timer) and do every action with 100% effort, intention and in a manner that leaves you feeling pride and pleasure. Examples: If you are washing the dishes. Scrub it, use soap and clean it extremely well.If you are making your bed, do it so perfectly that it looks like the world's most elite 5 person housekeeping team came and did it themselves.If you are reading a book, check your posture, notice how focused you are while reading. Are you writing insights on a journal nearby? Are you highlighting? Are you devouring this book completely?If you are at work and doing some manual labor, do it perfectly. When I used to be a beach boy we would roll up the towels in a beautiful manner. Instead of rushing through the process, we would take our time and make each one perfect.When you brush your teeth, go after each tooth. Double check. Clean your tongue. Go over everything perfectly.Imagine that every action you do, there is a team of four people watching you. Judging you. Let's use the brushing your teeth example. If they deem your effort worthy of excellence, they will give you a billion dollars in cash. How would you brush your teeth then? That's excellence. That's how you want to do EVERYTHING. ESPECIALLY WHEN NO ONE IS LOOKING! Look - I know some of you might be thinking, brushing your teeth doesn't mean shit. Well, let me tell you. That mindset is the reason why you haven't achieved real results in the world. HYDA i HYDE is even more powerful when you do what you DISLIKE at a very high degree. I want your name to be synonymous with excellence. \"Daniel? That guy is just amazing. Everything he does is such high quality.\" - Everyone That's how a powerful man lives. And trust me - this affects your relationships, business, your body, your health and spirit. We also know due to how our subconscious works, that the greatest energies are transferred through the smallest actions. So start being outstanding moment to moment. HYDA i HYDE. How you do anything is how you do everything. Remember this. Apply this and begin to develop the habit of excellence in your life. -Daniel  PS. If you want strategies on how to be more powerful in life read my exclusive articles at my blog: Declare War Within. If you are interested in upgrading your mind through subliminal audio check out Powerful Subliminals. ",
            "date": "Answered April 12, 2020",
            "views": "579",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Stephanie Lee",
                    "user_href": "/profile/Stephanie-Lee-5"
                },
                {
                    "user_id": "Shivani Bhardwaj",
                    "user_href": "/profile/Shivani-Bhardwaj-161"
                },
                {
                    "user_id": "Marie Georgia",
                    "user_href": "/profile/Marie-Georgia-2"
                },
                {
                    "user_id": "Vuthy Reach",
                    "user_href": "/profile/Vuthy-Reach-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sandra Kpodar",
                "href": "/profile/Sandra-Kpodar"
            },
            "answer_text": "In my opinion, excellence is about placing the bar high whatever you do. It is something you strive for, that you can achieve after a certain period of time. There is a rule called the \"10,000 hour-rule\". According to the rule, you can attain expertise (or better said excellence) after 10,000 hours of purposeful practice*. In years, it equates to working on your skills in a given field for 10 years.  One can pursue excellence in a number of ways:  By trial and error followed by constructive evaluation. When you find that a goal was not achieved fully you should try and be reflective. Find out what you did wrong and how you could improve for the next attempt. Self-evaluation, detailed feedback from peers can be helpful as well.By learning from more experienced and established people in your field. Ask questions, they might be able to help you as they are very likely to have been in a similar situation.By maintaining the motivation to be the best you can be (as often as possible). Motivation can be hard to maintain, but with a positive attitude and working on remaining positive it can be sustained.By surrounding yourself with highly motivated people who care about providing work of high quality. I find that the environment you are in plays a great part in shaping you and it is always exciting to be part of a supportive environment where people have high standards for themselves and the community.I personally find that I have a long way to go until I become excellent in my field (education), but I am determined to live by the rules I cited above. I am aware that there is no such thing as perfection but it is  still good to strive for it (within reasonable measures) at least in your professional life. When it comes to life outside work, relationships, I think, you learn as you go and use a bit of common sense.  I will finish on the following quote:  Purposeful practice is about striving for what is just out of reach  and not quite making it; it is about grappling with tasks beyond current  limitations and falling short again and again. Excellence is about  stepping outside the comfort zone, training with a spirit of endeavour,  and accepting the inevitability of trials and tribulations. Progress is  built, in effect, upon the foundations of necessary failure. That is the  essential paradox of expert performance. in Bounce: The Myth of Talent and the Power of Practice by Matthew Syed ",
            "date": "Updated February 16, 2013",
            "views": "27",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Stephanie Lee",
                    "user_href": "/profile/Stephanie-Lee-5"
                },
                {
                    "user_id": "Dayanand Anilpoojari",
                    "user_href": "/profile/Dayanand-Anilpoojari"
                },
                {
                    "user_id": "Jepoy Meneses",
                    "user_href": "/profile/Jepoy-Meneses"
                },
                {
                    "user_id": "Mazen Elkhouly",
                    "user_href": "/profile/Mazen-Elkhouly"
                },
                {
                    "user_id": "Amit Kumar Agrawal",
                    "user_href": "/profile/Amit-Kumar-Agrawal-7"
                },
                {
                    "user_id": "Jay Singh",
                    "user_href": "/profile/Jay-Singh-41"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raghu Menon",
                "href": "/profile/Raghu-Menon-11"
            },
            "answer_text": "Excellence is, in my eyes, exceptional mastery of what you want to achieve! It is a hallmark of your character! A part of your identity! It’s part of your legacy to the Children of Tomorrow!!  It what you achieve when you chase your dreams!  And yes, it can be achieved! It takes patience (only as much as you believe it does), courage and strength to achieve excellence! Patience to look past obstacles, should they occur! Courage to look towards your dreams and goals even when the world tries to prevent you from doing so! Strength of heart and mind to make it all the way to the summit! And yeah, OPTIMISM!! Optimism to look up at the bright side even in the face of insurmountable odds! Each of us is strong and capable of attaining anything and everything, it’s only that we take others’ despairing words too seriously, we actually bother listening to them! :P Achieving excellence need not take time, contrary to what others may say. It can happen if you believe in it! This is quite an important and heavy word - BELIEF!! If you believe you can do it and stick to it no matter what and take whatever chance you see that takes you closer to you goal, then you’re the One! ",
            "date": "Answered September 18, 2016",
            "views": "22",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Stephanie Lee",
                    "user_href": "/profile/Stephanie-Lee-5"
                },
                {
                    "user_id": "Rahul Rajhans",
                    "user_href": "/profile/Rahul-Rajhans-1"
                },
                {
                    "user_id": "Rahul Darak",
                    "user_href": "/profile/Rahul-Darak-2"
                },
                {
                    "user_id": "Nitika Deshmukh",
                    "user_href": "/profile/Nitika-Deshmukh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Priya Gautam",
                "href": "/profile/Priya-Gautam-8"
            },
            "answer_text": "Thanks for A2A! Excellence according to me is the extreme at which you can go to do a work in such a manner that nothing still remains to do in order to improve your work. Excellence can never be pursued, you have to do any task in such a way that you extract everything from it and gives everything of yours to accomplish it. Like the movie dialogue : Bachcha kabil bano, kabil ... kamyabi toh saali jhak maarke peeche bhagegi! (Be capable my son, capable ... success will follow you no matter what!)  The same is applicable with excellence. Thank you. ",
            "date": "Answered August 27, 2016",
            "views": "970",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Praveen Chippada",
                    "user_href": "/profile/Praveen-Chippada"
                },
                {
                    "user_id": "Shrikant Dhende",
                    "user_href": "/profile/Shrikant-Dhende-1"
                },
                {
                    "user_id": "Malini Rajendra",
                    "user_href": "/profile/Malini-Rajendra"
                },
                {
                    "user_id": "Harshit Dhawan",
                    "user_href": "/profile/Harshit-Dhawan-6"
                },
                {
                    "user_id": "Pranjali Manjrekar",
                    "user_href": "/profile/Pranjali-Manjrekar"
                },
                {
                    "user_id": "Deep Kumar",
                    "user_href": "/profile/Deep-Kumar-54"
                },
                {
                    "user_id": "Santosh Daniel",
                    "user_href": "/profile/Santosh-Daniel"
                },
                {
                    "user_id": "Raghuram Prabhu",
                    "user_href": "/profile/Raghuram-Prabhu-2"
                }
            ]
        }
    ]
}