{
    "title": "How does one control one's desires? - Quora",
    "tags": [
        "Desires",
        "Control",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stephen Martin",
                "href": "/profile/Stephen-Martin-8"
            },
            "answer_text": "How does one control one's desires? Fighting desire doesn’t work. It only strengthens it. It’s like trying not to blush. You actually blush less if you accept it. Learn to accept your desires as a natural part of being human. We all have them. Acceptance helps you to relax. Relaxation is a more resourceful state than the tension of fighting desire. From this space of relaxation, you can begin to notice the thoughts and feelings that feed this desire. Practice observing these thoughts and feelings dispassionately. The more you do this, the more the mind will quiet down and the feelings will subside. The best way to do this is through mindfulness. Find a class in mindfulness and learn how to do it. It will take a while to be able to be with the thoughts and feeling without judging them. Be gentle with yourself. When you have a thought that feeds the desire, substitute an empowering thought for it. This can be anything that is meaningful to you. Notice how this changes your feelings. For example, if you are craving chocolate cake, replace that thought with how much better you will look and feel when you lose weight. If that seems too remote, alter the image in your head to make it more compelling. Make sure it is in color and in full size. See your new slimmer self in the future. Imagine how you will carry yourself. You may want to add some people in this image to talk about how good you look. If you are not conscious of an image, hear the voices of others admiring the slimmer you. It is your imagination, make it work for you. Dedicate yourself to this goal. Tell yourself that you are dedicated to achieving this goal. Notice how this makes you feel. Create a gesture to symbolize your dedication. This gets the tactile sense involved. The more senses you can involve the stronger will be your resolve. Each time the desire returns, do these practices. Be gentle with yourself. Over time you will develop mastery over desire.  Image labelled for non-commercial reuse. ",
            "date": "Updated June 21, 2016",
            "views": "64",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Codi De La Hardy",
                    "user_href": "/profile/Codi-De-La-Hardy"
                },
                {
                    "user_id": "Layla",
                    "user_href": "/profile/Layla-390"
                },
                {
                    "user_id": "PewPew Pie",
                    "user_href": "/profile/PewPew-Pie"
                },
                {
                    "user_id": "Tyler Lee",
                    "user_href": "/profile/Tyler-Lee-221"
                },
                {
                    "user_id": "Thearith Ly",
                    "user_href": "/profile/Thearith-Ly"
                },
                {
                    "user_id": "Zain Ul Abideen",
                    "user_href": "/profile/Zain-Ul-Abideen-334"
                },
                {
                    "user_id": "Bharath Bonala",
                    "user_href": "/profile/Bharath-Bonala"
                },
                {
                    "user_id": "Nasir Baloch",
                    "user_href": "/profile/Nasir-Baloch-12"
                },
                {
                    "user_id": "Inayath",
                    "user_href": "/profile/Inayath"
                },
                {
                    "user_id": "Anant Kumar Pandey",
                    "user_href": "/profile/Anant-Kumar-Pandey-8"
                },
                {
                    "user_id": "Sanjeep Verma",
                    "user_href": "/profile/Sanjeep-Verma-3"
                },
                {
                    "user_id": "Lewis Lau",
                    "user_href": "/profile/Lewis-Lau-15"
                },
                {
                    "user_id": "Marco Darian",
                    "user_href": "/profile/Marco-Darian"
                },
                {
                    "user_id": "Muhammad Abdulmoiz",
                    "user_href": "/profile/Muhammad-Abdulmoiz"
                },
                {
                    "user_id": "Wale Fajobi",
                    "user_href": "/profile/Wale-Fajobi"
                },
                {
                    "user_id": "Mayur Vaish",
                    "user_href": "/profile/Mayur-Vaish-1"
                },
                {
                    "user_id": "Sumit Sadhu",
                    "user_href": "/profile/Sumit-Sadhu-2"
                },
                {
                    "user_id": "Veenu Raj",
                    "user_href": "/profile/Veenu-Raj-2"
                },
                {
                    "user_id": "Alaa Abdein Eltahir",
                    "user_href": "/profile/Alaa-Abdein-Eltahir"
                },
                {
                    "user_id": "Gita Goudarzi Bahramipour",
                    "user_href": "/profile/Gita-Goudarzi-Bahramipour"
                },
                {
                    "user_id": "Janek Waza",
                    "user_href": "/profile/Janek-Waza"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Bruss",
                "href": "/profile/John-Bruss-2"
            },
            "answer_text": "Though I appreciate Buddhism and so much of its teachings, this “desire” issue is a dilemma in that philosophy, IMO. As you mention in your question: How can your desire be to: not desire? Of course that’s a conundrum…an oxymoron. It is as if Buddha’s philosophy path was like a train and he got off his train too soon, at the train station named Desire….or maybe like the movie….A Streetcar Named Desire (a woman’s flirtations toward her sister’s husband).  IMO, the answer is that perverse desires are unhealthy but virtuous desires are essential in a healthy life. Zoroaster realized this and monotheism promotes this philosophy…..Jesus actually died as a display of his desire for virtue/love. So you actually do want to keep away from perverse desires (unhealthy ones) but you actually want to deliberately increase your desire for virtue (in your beliefs, thoughts and behaviors). So desire is not the profound dilemma (like an evil) some think it is. The battle within yourself is actually between perverse desires (leading to inner chaos and division) and virtuous desires (leading to inner peace and unity).  Carl Jung stated there is a shadow/id inside of us which is the unknown animal instinctive and irrational “dark side” of our personality which is prone to psychological projection. Jung wrote that if these projections remain hidden to us, they have the power to manipulate us. These projections insulate and harm us by acting as a thickening curtain of illusion between us and the real world (like the Wizard behind the curtain in Oz). IMO, arrogance, dominance, rebellion, diversions, blaming, self-righteousness, meekness and submissiveness are all tactics (and outcomes) used by our shadow to control us: to keep us from becoming more completely human. But we can be internally set free from these tactics if we face our shadow. I use this process….  There is a struggle in each of us that involves three voices in of us: a loud, emotional and vocal DNA-driven survive, thrive and reproduce shadow (I, me, my, mine) that resists discipline…this is often a fear-mongering, defensive, arrogant and lying voice.a quiet seed of a beautiful, altruistic, self-disciplined, virtue-driven hero/heroine…this is an honest and truthful voice…love lives here and is waiting to give us the gift of transcendent love.an initially naive, curious, adventurous “child chooser” that can select either 1 or 2 (or a mix of both but care must be taken to choose wisely such as when physical death appears imminent).I believe the purpose in life is for #3 to increase in wisdom and virtue. With that increasing understanding, spend more time listening to and following #2 while paying less and less attention to (by disciplining) #1. I hope this helps. ",
            "date": "Answered August 30, 2020",
            "views": "288",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jayantilal Patel",
                    "user_href": "/profile/Jayantilal-Patel-72"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yash Bhurewal",
                "href": "/profile/Yash-Bhurewal-1"
            },
            "answer_text": "Greetings! In order to control one's desires, first you need to separate your desires from your needs and realise that only your needs are required to be fulfilled and your desires are just the longing of mind for certain physical objects which will temporary satisfy your want and will lead you to be restless and frustrated in the long run. You need to comprehend that when you will meet your physical desires, your emotional and other associated desires will also increase and will ruin your peace of mind and contentment. It has been observed that the desires of mind are unquenchable and they never gets over because it is a vicious loop in which one desire end and other begins. So, it is extremely necessary to curb this unfavourable tendency of mind in the beginning to be really happy and peaceful in life. Not all the desires are bad especially the ones which are intellectual and aimed towards self-improvement and development, actually this are the desires which should be replaced by physical and emotional ones as this desires are essential for us to prosper in life. Have the desire to be become better than others, more appreciated than others, more successful, powerful, wise, knowledgeable than others, initially this desires would seem to be superficial but they are very important for our social and psychological wellbeing because a healthy ego is what we need to adjust in our surrounding. So, the technique is to cultivate higher intellectual desires instead of lower physical ones and finally if you can sow the seed of highest form of desire that is spiritual desire, in the presence of spiritual desire all other desires extinguish and only one burning desire remains which is to become self-sufficient in all means and attain supreme peace of mind. If you still can't pacify the desires of the mind then you should follow the other way which is to satisfy your desires in moderation and learn to be contentended in life with what you have because contentment is the greatest wealth as it is written in scriptures of various religions which is indeed true as we see rich people never get satisfied and go on to acquire more on the cost of health, relationship, peace of mind and what they get nothing except more desires which are aimed at happiness and a comman man who is moderate in all his undertakings is happy without desires. So, the main concept is you can be happy without any desire as pursuit of happiness is the main reason to why we hold on to our desires. Hope you like the exposition! If you like let me know it by your upvote.  ",
            "date": "Answered February 19, 2019",
            "views": "4",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rehan Ahmed",
                    "user_href": "/profile/Rehan-Ahmed-646"
                },
                {
                    "user_id": "Leo Brown",
                    "user_href": "/profile/Leo-Brown-28"
                },
                {
                    "user_id": "Ajay Mg",
                    "user_href": "/profile/Ajay-Mg-2"
                },
                {
                    "user_id": "Pritishankar Pati",
                    "user_href": "/profile/Pritishankar-Pati"
                },
                {
                    "user_id": "Zain Ul Abideen",
                    "user_href": "/profile/Zain-Ul-Abideen-334"
                },
                {
                    "user_id": "Nagarjun",
                    "user_href": "/profile/Nagarjun-31"
                },
                {
                    "user_id": "Omar Pand",
                    "user_href": "/profile/Omar-Pand"
                },
                {
                    "user_id": "Zlatan Armandovic",
                    "user_href": "/profile/Zlatan-Armandovic-1"
                },
                {
                    "user_id": "Bharath Bonala",
                    "user_href": "/profile/Bharath-Bonala"
                },
                {
                    "user_id": "Behrouz Ehsani",
                    "user_href": "/profile/Behrouz-Ehsani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shimmer",
                "href": "/profile/Shimmer-25"
            },
            "answer_text": "Desiring, wishing, and willing are all things we humans regularly do. Each of these activities can be fun and rewarding when done to the right degree and in the right direction. They can also be damaging and destructive when undertaken too vigorously or pursued in wrong directions. They can veer into dangerous waters when we over- and under-estimate what is in our control. We can end up not just frustrated but profoundly disoriented and even alienated in our own lives. For help understanding these activities in order to avoid their more destructive forms. I defines that desire as wanting to feel, to have, or to do what presently is not felt, had, or done. Desires can be about anything. We desire material goods like cars, houses, a good meal, etc. We also desire immaterial goods such as relationships with others, acceptance, happiness, success, etc. The line between material and immaterial is not always hard and fast; one may physically desire another person in large part because of the love she has for him or her. Physical desire may also increase love. Desire can increase when we want more than we presently have and it can decrease when we no longer want what we have. My point about desire is there’s always a gap between the wanting and the having. While in many cases the gap between wanting and having is traversable, the gap can increase when one is not attentive enough to both the strength and direction of desires and how those desires fit with what one already has. Paying more attention to what one wants rather than what one has may lead to a dissatisfaction that may only continue to grow. we wish when what we desire is accompanied by a sense that it cannot be attained or achieved. Wishing is defined by the sense that one cannot realize her desires. There are all sorts of reasons why someone’s desires cannot be met and those reasons are not created equal. I wish I had won the $2 billion lottery drawing, but the odds were astronomically staked against me. Wishes like this are not bad or dangerous and in fact can provide a welcome flight of fancy. Who didn’t wish they’d have the opportunity to quit a job, pay off debt, help friends, etc? Problems begin when the reasons for something not being met or achieved have to do with me or what’s in my control. I can wish until the cows come home that I will get the promotion at work. I can wish that tomorrow I will stop drinking or using drugs. I can wish to the point of pining for the partner of my dreams. Great troubles may follow when my wishes become wrapped in expectation. When expectation takes over, my focus becomes less on what I am doing and more on what I deserve. Putting on the “I deserve” lenses entails we are unable to clearly see the relationship between our inactions and our desires not being met. There’s a good reason why many people in recovery define an expectation as a future resentment. That resentment is almost always directed at other people or more vaguely, “society.” We fail to recognize that our inactions in many cases play an important role in our desires not being met. We will when we believe we can achieve what we desire and we take action. Willing necessarily requires action. This is what distinguishes wishing from willing. When a person wills, she recognizes that she is in a position to actualize something that she desires. In most cases, willing is a necessary condition for us to realize our desires. If I want the promotion, then I better work hard and finish my projects by the specified deadlines. If I want to stop drinking or using, then I need to take some action such as driving home a different way to avoid the liquor store or place where I usually buy drugs.Willing is a necessary but not sufficient condition to realize desires. Each of us has plenty of examples of acting in ways to realize our desires that fall short, go haywire, or bring about the exact opposite of what we want. It simply is not a matter of my will alone that I will get a promotion. Too many other factors are at play that are beyond my control. There may be equally hard working people vying for the promotion or the job description is not a match for my experience. Stopping drinking and using is not fully a matter of my will; I may need medications to curb cravings. When I assume that realizing my desires is completely a matter of my will, frustration and overflowing resentment usually follow. If I am convinced that I am doing everything right and still I am not getting what I desire, then I might just keep pushing myself to do the same thing only harder every time. One definition of insanity is doing the same thing repeatedly but expecting different results. I may start to resent those same results and the people who seem to get different results from doing the same things I am. When we will too much and try to force the world to bend or we will in the wrong direction—say at controlling that which is so far beyond our control--we will be unhappy. The solution is not to stop willing since that throws us back to the unhappiness that comes from unrealized wishes. Rather, we need to recognize what is in our control and what is not and then calibrate our expectations and act accordingly. That’s simpler said than done. ",
            "date": "Answered June 24, 2020",
            "views": "245",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "AbdulMajid Jammal",
                "href": "/profile/AbdulMajid-Jammal"
            },
            "answer_text": "How can a person control desires and keep away all desires? As a Muslim who only really started practising after I was mature, I am no stranger to desire and its effects, as well as how difficult it is to battle it once it takes hold. Desires are only possible to prevent, by trying to remove what will initiate them from source. So don't associate with junkies, don't watch porn, don't go to parties, don't expose yourself freely and unnecessarily to that which may be a source of an unhealthy desire etc. Prevention is always better because once desires are aroused, it becomes much harder to get rid of them or channel them into healthy outlets, because they will keep reappearing, and if one actually acts on them, they will keep escalating into worse forms, and might eventually become addictions. They then progressively take over control of the person's reasoning and the person tries to find ways to justify his craving for indulging in that unhealthy desire and leaves off every pretence of ever abandoning it. Since outright prevention gets progressively more difficult in today's hedonistic society; where license to sin is considered a freedom and a human right; the best alternative way to prevent this is to remind yourself constantly of the consequences if such a desire overtakes you, and the subsequent end result of indulging in such a desire. To most reasoning people, this will totally eliminate the attraction that it may have for them. But it takes a lot of control over oneself, and hard work. ",
            "date": "Answered August 30, 2020",
            "views": "122",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Leo Brown",
                    "user_href": "/profile/Leo-Brown-28"
                },
                {
                    "user_id": "Jayantilal Patel",
                    "user_href": "/profile/Jayantilal-Patel-72"
                },
                {
                    "user_id": "Abdul Rahman Irfan Sheikh",
                    "user_href": "/profile/Abdul-Rahman-Irfan-Sheikh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Nielsen",
                "href": "/profile/Eric-Nielsen-73"
            },
            "answer_text": "Before you get into this materialistic non-sense. First contemplate all that you have now.Then contemplate the type of person you want to become if you manifest what you want. Caution comes into play at this point. Desires can be very dangerous, as they have everything to do with the five senses and the stimulus those results bring to you and how much you fall in love with them, once you have lived with them for a while. They are called the seven deadly sins in all religions for a reason. Sorry to be such a downer, but there are tons of people in hell, because of their failing to see the results of getting the things they love most in life. Life’s purpose is to grow spiritually. We all are only one step up from any animal that lives life by their instincts. As well as equally placed between the heavens and the hells. You are a person and the difference between you and an animal is that you have a intellectual mind to know the difference. Falling in love with worldly things without controlling one’s self, can easily have you turning away from the higher being you are meant to be. With that being said, ALWAYS, ALWAYS, ALWAYS keep the goodness within you, as your most important power. These things you want to manifest are all temporal. At least the worldly ones or physical ones. You won’t be taking them with you, except in your memory. It is the spiritual ones that are eternal, so concentrate on them. Love and Selflessness. Can you see how these two traits are eternal and have the highest value as they pertain to your spiritual path UPWARD????? ",
            "date": "Answered June 24, 2019",
            "views": "481",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Cleo Short",
                    "user_href": "/profile/Cleo-Short"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vinayak Jawalkar",
                "href": "/profile/Vinayak-Jawalkar"
            },
            "answer_text": "You fulfil your desires - You go ahead and fulfil all your desires (as long as it is moral, ethical and you have money). You limit your desires - You have a lot of desires but you introspect and reduce it. So, you’ll have a few desires that you can fulfil. After all, humans beings have to be happy. Choose what’s really important to you and you aim for it. You kill your desires - You stop your desires by controlling them. This means your desires exist but you forcefully stop yourself from doing it. People call this self-control. Not recommended. Read next. You overcome your desires - through knowledge, wisdom and self-awareness. Follow a mentor, read a book and know what life means to you. You don’t have to become a saint. Just be human. Thank You for reading! Regards, Vinayak Jawalkar ",
            "date": "Answered March 16, 2018",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Devansh Gupta",
                    "user_href": "/profile/Devansh-Gupta-277"
                },
                {
                    "user_id": "Malini Rajendra",
                    "user_href": "/profile/Malini-Rajendra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ganapati",
                "href": "/profile/Ganapati-11"
            },
            "answer_text": "Hi, Quoting Sai Satcharita- Our mental stability depends on fulfilling our desire. More the desire more difficult to fulfill this dissatisfaction. With repeated fulfillment of a desire, our dependency increases, but so our tolerance. We depend more and more upon its fulfillment while deriving less and less satisfaction from it. More unsettled and more dissatisfied. To enjoy the worldly pleasures one needs wealth. Therefore, intense efforts have to be made to acquire it. And the satisfaction of these desires only makes them multiply. It is impossible to destroy them. Money is a big snare! Even the very affluent are troubled by it. Have you ever come across a person truly satisfied and not hankering after money? “He who with complete faith engages himself in the service of his Guru, the Lord is indebted to him always. No one can view him with evil intentions. “He who does not waste even half a moment and who has a liking for the worship of the Lord and the Guru, will give him infinite or perpetual happiness and enable him to cross to the other shore.” Blessed are those devotees of Sai, who have this firm belief, and are without fear, that Sree Samartha is their protector and nothing can touch them Listening to this Satcharita or reciting it regularly will result in the feet of Sai Samartha removing all the difficulties without any delay. Sairam ",
            "date": "Answered June 24, 2020",
            "views": "145",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hira Ram",
                "href": "/profile/Hira-Ram-13"
            },
            "answer_text": "Desire are very good thing our life . So many hard work we do because of our desires . But lot more desires it's not good for us . It's some disadvantages .. like . Break concentration of important task . Slow down your productivity . And dividing various way . That why we need to control our desires . That time we face a question that's is it possible to control. I confidently say yes . You follow few steps and concentrate only important desire …. (1) set a goal which is very important for you . (2) create feeling on your goal . Means you question your self why you achieve this goal . What type of changes create in your life after achieving this goal . (3) believe your self . This few things just remember and doing a work . You feel single one unwanted desires can't distribute you . And you gain success in your life . ",
            "date": "Answered April 23, 2019",
            "views": "462",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mohan Krishnan",
                    "user_href": "/profile/Mohan-Krishnan-55"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anuj Chugh",
                "href": "/profile/Anuj-Chugh-13"
            },
            "answer_text": "People do not give themselves space. They have space for everything and everyone else but themselves. They have space for their friends, their jobs, their careers, their bosses, their relatives, their entertainment, their luxary needs, their trips abroad, their socializing but themselves. When people start giving space to themselves, They realize that most of the Desires that they have are superficial and self created. We need only little to survive and live happily. But jumping from one desire and one need to another gives little space for this realisation to dawn in … Sadly, it is the state of the modern world and lifestyle of many people. The way to limit desires enough is to realize whether they can keep running like this and be happy at the same time … ? If they can, then it is not even a problem. If they cannot, then they need to give themselves some space … ",
            "date": "Answered January 16, 2020",
            "views": "253",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Asimendrakumar Dhirendrakumar Dechaudhari",
                "href": "/profile/Asimendrakumar-Dhirendrakumar-Dechaudhari"
            },
            "answer_text": "There are good wishes and bad wishes. There is no need to control good wishes. We should develop good wishes. We should wish everybody well. We can wish everybody well if we love everybody. If we have hatred then we cannot wish well. If we already have love within ourselves, wishing well will be automatic. However, if we have hatred within us or if we do not have love, then we have to remove hatred and develop love for others. Development of love will lead to control all bad wishes. If we had no idea of love, we could not develop it and if we had no idea of hatred, we cannot try to remove it. All of us have some idea of love and hatred from our birth because we are born with parental or family love. All of us want love from others and all others want love from us. This is a reality of life. Life is not possible if we are alone. We must have a community to live. And to make the community life happy, there must be love within the members of the community. Hatred causes unhappiness and love causes happiness. When we understand this we will start cultivating love and removing hatred. It will lead to development of good wishes and control of bad wishes or hatred. ",
            "date": "Answered June 24, 2020",
            "views": "106",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Harsimar Singh",
                    "user_href": "/profile/Harsimar-Singh-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sneh Chakraburtty",
                "href": "/profile/Sneh-Chakraburtty"
            },
            "answer_text": "Desires or 'wants' are unending; they change in quantity and quality as one ages. When one reaches the desire to meet with \"I-Me-Myself\" there is a quantum leap towards changing one's lifestyle (sadhana.) Sadhana is a journey that accomplishes itself into ‘ego-transcendence’. It is a spiritual movement consciously systemized with a purpose and a place to arrive at. The purpose is to release life from the limits of desires of “I & Me & Mine” with which it is bound.  It is a lifelong process beginning with early nurturing, aimed at an inward and onward march. Obstacles along the path are many, but, so long as self-knowledge through continuous effort is secure, nothing can stop one taking such a journey.  ",
            "date": "Answered May 2, 2016",
            "views": "11",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jayantilal Patel",
                    "user_href": "/profile/Jayantilal-Patel-72"
                },
                {
                    "user_id": "Mahib Karim",
                    "user_href": "/profile/Mahib-Karim-1"
                },
                {
                    "user_id": "Shahzadi Noor",
                    "user_href": "/profile/Shahzadi-Noor-3"
                },
                {
                    "user_id": "Sam Wazir",
                    "user_href": "/profile/Sam-Wazir-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Darshana Pitale",
                "href": "/profile/Darshana-Pitale"
            },
            "answer_text": "If you want to get on a plane or go to a movie, then you have to buy a ticket. This ticket needs to be given at the door. If you hold onto the ticket, how will you go in? If you want to be admitted to a college, you must fill out an application form and then you must submit it; you cannot hold onto it.How to deal with desire? On the journey of life, you have to keep submitting your desires and not hold onto them. And as you keep submitting them, fewer desires come up. ",
            "date": "Answered January 28, 2020",
            "views": "224",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tareq Belal",
                "href": "/profile/Tareq-Belal"
            },
            "answer_text": "Assalamu alykum wa rahmatu Allahi wa barakatuh By satisfying your desires with Halal marriage because most of Lyars who claimed that they controlled their desires it ended with big scandals. Like this   No offense but it's from themselves and from their countries and their artists. Also Ghandi and other Gods like Buddha had a lot of mistresses and sexual affairs with thousands of women during their life.  Best regards Don't stop your desires but go with it in the right legal way. May Allah bless you with happiness success guidance and knowledge Ameen Ameen Ameen Assalamu alykum wa rahmatu Allahi wa barakatuh ",
            "date": "Answered August 30, 2020",
            "views": "101",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ankur Agrawal",
                    "user_href": "/profile/Ankur-Agrawal-164"
                },
                {
                    "user_id": "Junaid Khan",
                    "user_href": "/profile/Junaid-Khan-519"
                },
                {
                    "user_id": "Sushobhan ßanerjee",
                    "user_href": "/profile/Sushobhan-ßanerjee"
                },
                {
                    "user_id": "Prashant Mishra",
                    "user_href": "/profile/Prashant-Mishra-897"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shovaniam",
                "href": "/profile/Shovaniam"
            },
            "answer_text": "By understanding your desires Controlling something means You have full access to that what you want to control, but we don't have control of our emotions. we control something, to get a specific result. In case of controlling desires, that specific result is ‘peace’. You only should keep those desires which are logical and avoid those which aren't logical. Thinking every move in life logically; Going with reason make life simple and peaceful. ",
            "date": "Answered March 22, 2018",
            "views": "601",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mahendra Das",
                    "user_href": "/profile/Mahendra-Das-98"
                },
                {
                    "user_id": "Rohit Choudhary",
                    "user_href": "/profile/Rohit-Choudhary-993"
                },
                {
                    "user_id": "Fuad Caynabo Abusalahudeen",
                    "user_href": "/profile/Fuad-Caynabo-Abusalahudeen"
                },
                {
                    "user_id": "Snehil Tripathy",
                    "user_href": "/profile/Snehil-Tripathy"
                },
                {
                    "user_id": "Vinodbabu P",
                    "user_href": "/profile/Vinodbabu-P"
                },
                {
                    "user_id": "Lokesh",
                    "user_href": "/profile/Lokesh-55"
                },
                {
                    "user_id": "ANAND MOHAN",
                    "user_href": "/profile/ANAND-MOHAN-207"
                },
                {
                    "user_id": "Deepak Prakash",
                    "user_href": "/profile/Deepak-Prakash-83"
                },
                {
                    "user_id": "Shubham Singh",
                    "user_href": "/profile/Shubham-Singh-648"
                },
                {
                    "user_id": "Akshay Shah",
                    "user_href": "/profile/Akshay-Shah-168"
                },
                {
                    "user_id": "Ashish Attri",
                    "user_href": "/profile/Ashish-Attri"
                },
                {
                    "user_id": "Keshav Mehriya",
                    "user_href": "/profile/Keshav-Mehriya"
                },
                {
                    "user_id": "Prakhar Pandey",
                    "user_href": "/profile/Prakhar-Pandey-15"
                },
                {
                    "user_id": "Sai Manoj",
                    "user_href": "/profile/Sai-Manoj-80"
                }
            ]
        },
        {
            "author_info": {
                "name": "Priyanka Verma",
                "href": "/profile/Priyanka-Verma-137"
            },
            "answer_text": "We can control our desires by giving least attention to it,however it is best to have some fruitful desires which keeps you going in order live a happy and motivated life. If anybody wants to get rid of the unnecessary desires, stop thinking stop dreaming about it as if you don't care. Prioritize other things and believe me, life would be at its best!  Happy learning happy leading. ",
            "date": "Updated February 4, 2016",
            "views": "15",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ankur Agrawal",
                    "user_href": "/profile/Ankur-Agrawal-164"
                },
                {
                    "user_id": "Praveen Jain",
                    "user_href": "/profile/Praveen-Jain-115"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rajkumar Annamalai Rajkumar",
                "href": "/profile/Rajkumar-Annamalai-Rajkumar"
            },
            "answer_text": "Desire should be there … then only life will be interesting…but fix one limit.. be contented…fix some desires and achieve that … if it continues more keep your mind mute on those thoughts… don't develop that … start doing social service to people … seeing the plight of so many people your desires will be controlled..have unlimited desire in doing social service… that's good … but see that it's not affecting your family life … spend time with family.. that's also important ",
            "date": "Answered February 17, 2018",
            "views": "630",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Maged Eldsoky",
                    "user_href": "/profile/Maged-Eldsoky"
                }
            ]
        },
        {
            "author_info": {
                "name": "Blaike Tillman",
                "href": "/profile/Blaike-Tillman"
            },
            "answer_text": "Give in. Join the dark side. We don't judge desires. We just act. After all, what is truly the difference between eating ice cream and unconsciously walking? Desires are actions frozen in time and judged before acting on it. But really, what are you actually responsible for? Being responsible for genocide is like being responsible for your parents eloping. ",
            "date": "Answered February 11, 2020",
            "views": "203",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ian Schneider",
                    "user_href": "/profile/Ian-Schneider-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marc Lambert",
                "href": "/profile/Marc-Lambert-9"
            },
            "answer_text": "Most desire is anxiety based we use desire to relieve anxiety, I desire a new car thinking of the car relieves my anxiety make me feel good, if the desire becomes an OCD then we become obsessed with the thought and have compulsion to have more cars. We may own and drive many cars but the anxiety is still there and we will not be have inner happiness just short times of anxiety relief what we think we are happy, we could go through our whole life with car OCD this becomes a big part of our personality. This is nonclinical anxiety undiagnosed and untreated in many humans almost all humans, its only when we reduce anxiety to pre-childhood levels we realise we only even needed one good car. ",
            "date": "Answered July 24, 2017",
            "views": "148",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Peter Augros",
                "href": "/profile/Peter-Augros"
            },
            "answer_text": "First of all I love you. I propose that we cannot. These desires are there to be fulfilled. They are the only road map we have in life. Why would you want to change them? Don’t mess with the map brother! When we feel like we are not living life to the full, it is because we are not attending to our heart’s longings, but our base survival, or pleasure seeking, or ego building. Tick tock, brother. Your heart wants to live today! Blessings! ",
            "date": "Answered June 25, 2019",
            "views": "119",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gloria Ami Amewode",
                    "user_href": "/profile/Gloria-Ami-Amewode"
                },
                {
                    "user_id": "Fuad Caynabo Abusalahudeen",
                    "user_href": "/profile/Fuad-Caynabo-Abusalahudeen"
                },
                {
                    "user_id": "Nabin Jaiswal",
                    "user_href": "/profile/Nabin-Jaiswal-3"
                },
                {
                    "user_id": "Trent Schultz",
                    "user_href": "/profile/Trent-Schultz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Praveen Jain",
                "href": "/profile/Praveen-Jain-115"
            },
            "answer_text": "Desires would never cease to originate in a human being. And we wish to control those we feel may be harmful or unhealthy to us. These originate in accordance to our lifestyle, upbringing, education, knowledge and all those things which makes us, as we are. If we want to get rid of those undesirables one, we should chanalise our thinking and deed towards those, which we want. It's difficult to create a strong will power, still in my opinion, by focusing to maintain a good health by exercise, walk and healthy meals added with some medication on regular basis, one should be able to control his brain, thoughts and desires. ",
            "date": "Answered February 21, 2018",
            "views": "509",
            "upvotes": " Answer requested by Prashant Mishra",
            "upvoters": [
                {
                    "user_id": "Bibbi Ana",
                    "user_href": "/profile/Bibbi-Ana-1"
                },
                {
                    "user_id": "Cassandra Marcus",
                    "user_href": "/profile/Cassandra-Marcus-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lars Westberg",
                "href": "/profile/Lars-Westberg"
            },
            "answer_text": "You ask yourself.. How will giving in too this desire affect me tomorrow? In a week? A month? A year?How will it affect my family, friends and society?Are the answers not leading you too a happy, meaningful and productiv life you need too keep reminding yourself of the results. Keep training your mind too faster realize that the cost of giving in too the desire is too high for you and everyone around you. ",
            "date": "Answered March 16, 2018",
            "views": "540",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Real World",
                    "user_href": "/profile/Real-World-38"
                }
            ]
        },
        {
            "author_info": {
                "name": "Donna Elaine",
                "href": "/profile/Donna-Elaine-2"
            },
            "answer_text": "Your question is: Can desires be stopped? Yes. Desires can be stopped. If you want something and you do not or cannot foresee the consequences, all the consequences… at some point the collateral damage exceeds the tolerance of acceptability. At some point you can realize that what you thought you wanted, your desires, what you thought you couldn't live without... Isn't worth the collateral damage. When you get to this point, your desires can easily be checked and new desires that stop the damage can take their place. Desires, dreams, intentions, even addictions, at some point, can be deemed not worth what they are costing you emotionally. ",
            "date": "Answered June 2, 2018",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jayantilal Patel",
                    "user_href": "/profile/Jayantilal-Patel-72"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ragesh Nair",
                "href": "/profile/Ragesh-Nair-10"
            },
            "answer_text": "Desires are not from mind. It only appears in mind. The source of desires is our attachment to feelings of physical world. When we like something we desire for it, when we dislike something we desire not for it. It is a web of feelings which one has to break by understanding the relationship between senses and heart. That is the only way. ",
            "date": "Answered February 13, 2019",
            "views": "156",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ankur Agrawal",
                    "user_href": "/profile/Ankur-Agrawal-164"
                },
                {
                    "user_id": "Ghafoor Khan Kheshgi",
                    "user_href": "/profile/Ghafoor-Khan-Kheshgi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yon Gardner",
                "href": "/profile/Yon-Gardner"
            },
            "answer_text": "At one time I was a slave to desires, one advantage of ageing is I now recognize desire’s as an option to soothe the moment to satisfy the urge of: but now I think about how practical or if this desire is still needed or wanted and quite often its just an old habit circling round again till I make a firm commitment of NO - then it fades away. ",
            "date": "Answered October 13, 2020",
            "views": "58",
            "upvotes": " Answer requested by Camilo Ardiles",
            "upvoters": [
                {
                    "user_id": "Raunaq Lamba",
                    "user_href": "/profile/Raunaq-Lamba"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Hunt",
                "href": "/profile/Mike-Hunt-1532"
            },
            "answer_text": "Anyone can, it's called self restraint. Use logic, concentration and meditation. I am a naturalist, I do not wear clothes, when I and my family go on holiday, we go to nudist colonies. There is no sexual connotation, there are countless naked oiled bodies all tanning themselves and there is no sexual misconduct, because we are all in control of our desires. ",
            "date": "Answered July 27, 2020",
            "views": "115",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marcus Lester",
                "href": "/profile/Marcus-Lester-2"
            },
            "answer_text": "I would say that I cannot control my desires. What I can do is — I can look carefully and lovingly at myself, and I can watch the play of those desires in my life. If find that this simple process of looking carefully at myself shows me how important or unimportant my desires are. In time, they change in ways I would never have believed. ",
            "date": "Answered September 5, 2020",
            "views": "36",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Dayu Anandani",
                "href": "/profile/Dayu-Anandani"
            },
            "answer_text": "Anya's answer to While practising the Law of Attraction to manifest what one wants, how does one deal with the resistance that comes from one’s current reality being so different or from what one is trying to manifest? ",
            "date": "Answered June 24, 2019",
            "views": "64",
            "upvotes": " Answer requested by Cleo Short"
        },
        {
            "author_info": {
                "name": "Aadhyaa Rai",
                "href": "/profile/Aadhyaa-Rai"
            },
            "answer_text": "You have to train your mind for it. The day you possess control on your mind, even little bit if not a lot, you’ll see the difference. Its all anout how to convince your mind into thinking shat you want it to think, knce that is done, you can control everything. ",
            "date": "Answered April 2, 2018",
            "views": "845",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Vineet Kishore",
                "href": "/profile/Vineet-Kishore"
            },
            "answer_text": "Please read my answer about controlling desires on my blog and do give a thumbs up if you like it happybloggers3 ",
            "date": "Answered May 15, 2016",
            "views": "250",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Imraan",
                "href": "/profile/Imraan-4"
            },
            "answer_text": "READ QURAN AND HADITH. LOWER YOUR GAZE. MOST IMPORTANTLY. LASTLY, FAST, FAST AND FAST. LET HUNGER TEACH YOU LESSONS. ",
            "date": "Answered March 16, 2018",
            "views": "96",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Lewis",
                "href": "/profile/David-Lewis-655"
            },
            "answer_text": "Some can I suppose but sex drive cannot it’s just too fundamental to our being. We’re all wired to need that feeling, if we can’t get Partner sex we can masturbate to relieve it but we can’t make the need itself go away. ",
            "date": "Answered May 31, 2018",
            "views": "493",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sam Vinetz",
                "href": "/profile/Sam-Vinetz"
            },
            "answer_text": "Practice compassion ",
            "date": "Answered September 18, 2019",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ranjith Nawarathna",
                "href": "/profile/Ranjith-Nawarathna-1"
            },
            "answer_text": "A person without.",
            "date": "Answered March 16, 2018",
            "views": "187",
            "upvotes": "0"
        }
    ]
}