{
    "title": "How does one adapt a philosophical mindset? - Quora",
    "tags": [
        "Critical Thinking",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Javier Garcia-Julve",
                "href": "/profile/Javier-Garcia-Julve"
            },
            "answer_text": "I'm afraid you are born with it, like math or poetry. Nevertheless, you can always take a philosophical perspective by adopting a transcendent outlook, which means never regard our knowledge as final and complete. (Therefore, no Theory of Everything, no \"everything comes from evolution\" or \"it's all the workings of the brain\". Nor \"life is all about being yourself\", or \"all that matters is the rights of the individual\".) Actually, that is the origin of philosophy, for which there is no objective definition, no matter what textbooks say. In different cultures mankind realized that its experience was not a closed universe, but it was always open to an ulterior horizon, it was a never-ending quest with everything having an ever deeper significance and could be improved. The Greeks called it Love of Wisdom, others Enlightenment, or whatever but it's always the endeavor to fulfill our existence, to which we cannot put limits.  To be more concrete, don't reduce your own personal life to any given sphere of interests, be they professional, sentimental, social, you name it, the way so many only live to make money, be famous, excel as intellectuals, enjoy life or any of the status human are captive to as their ultimate goal. ",
            "date": "Answered May 6, 2015",
            "views": "389",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alberto Medici",
                    "user_href": "/profile/Alberto-Medici-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Tanega",
                "href": "/profile/Joseph-Tanega"
            },
            "answer_text": "1. If I take you literally then you are wondering about how to take a philosophical mindset and apply it to other matters.   2. So much depends on what you would accept as 'philosophical mindset'. 3. I hazard a guess that a philosophical mindset is one that asks questions about the meaning of presumptions, assumptions, premises, postulates, givens, fundamental principles, and anything else that might be held dearest and truest.  4. I met a consultant who adapted this mindset to truth consulting at the board level. She was paid five figures per day and all she would do is sit at board meetings and whenever a director failed to tell the truth, she would say so. The board members would sweat profusely and say very few words during these sessions. This woman did a TV documentary with members of the board of a financial institution and it looked like they were doing zazen. 5. You can adapt a philosophical mindset to any situation by simply turning it on--like flipping a switch that allows you to hear deeply and respond fully. ",
            "date": "Updated May 15, 2015",
            "views": "782",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Hu",
                "href": "/profile/James-Hu-2"
            },
            "answer_text": "Your question reminds me of a story when I was in college.  At the time, my major was economics and my friend's major was philosophy. Thus, I studies authors of economic books while my friend mainly studied philosophical authors.  One day as each of us were heading to class, we stopped by what looked like a circular building structure. Inside the building housed one of the nations first particle accelerators. Basically, it measures the speed of protons at fixed targets.   We were both standing there thinking about it for a few moments. And I remember that my thoughts were filled with questions based on economics. Guess what my friends thoughts were focused on.  The funny part was that we questioned each other from the point of reference based on our college majors. So, I said, \"I wonder how much that building/equipment cost to make?\" Wonder what the political impact was on campus?  And my friend with his deep face expression said, \"Imagine how the people were affected by this new type of physics and it's implication on science.\"    So feed your mind with philosophers - Plato, Socrates, Aristotle, Kant, Nietzsche, Marx, Confucius, etc... ",
            "date": "Answered May 7, 2015",
            "views": "361",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Insha Iyer",
                "href": "/profile/Insha-Iyer"
            },
            "answer_text": "Read everything u get, whether positive or negative. Open up your mind for all kinds of responses and the main part be an optimist practical thinker. ",
            "date": "Answered May 6, 2015",
            "views": "242",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harsh Shah",
                    "user_href": "/profile/Harsh-Shah-226"
                },
                {
                    "user_id": "Sibi S",
                    "user_href": "/profile/Sibi-S-31"
                }
            ]
        },
        {
            "author_info": {
                "name": "Damon Atherly",
                "href": "/profile/Damon-Atherly"
            },
            "answer_text": "First step, study philosophy.  Second step, understand that the different points of view are not necessarily things you must agree or disagree with. Understanding itself is more important. ",
            "date": "Answered May 6, 2015",
            "views": "171",
            "upvotes": "0"
        }
    ]
}