{
    "title": "How can it be claimed that consciousness creates the universe when consciousness is evidently and conspicuously absent from virtually all of the vast scope of the universe? - Quora",
    "tags": [
        "Philosophy of Mind",
        "Consciousness",
        "The Universe",
        "Cosmology",
        "Human Brain",
        "Philosophy",
        "Astrophysics",
        "Neuroscience",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Terry Bollinger",
                "href": "/profile/Terry-Bollinger"
            },
            "answer_text": "Simply ignoring for a moment the century of angst and argument that your question has engendered among both physicists and philosophers, by far the simplest answer to your question is that observation is something a lot simpler and enormously more common in the universe than is consciousness. In this perspective, both sentience and consciousness become nothing more than very sparse icing on a very large cake, a cake that is both self-observing and quite able to sustain itself, thank you. In this kind of simple but ubiquitous observation model, massive observation began at least as early as the big bang, and has been very deeply intertwined with matter and existence since. But what would ubiquitous simple observation be, if it is not consciousness? One way to go at that question is to look at experimental physics for what ubiquitous observation is not, that is, what is required to ensure that a system remains quantum. One nicely testable way to describe a quantum system is that it is capable of wave-like behavior, and even more specifically, of self-interference. Self-interference is what makes the two-hole electron experiment so mystifying, since it suggests that an electron in a quantum state can travel through two holes at once. So the question becomes this: What, in the most general terms possible, the is the event that occurs in experiments that destroys quantum states? If this can be identified, it provides an important and possibly critical clue to the nature of simple, consciousness-free observation in physics. Richard Feynman in his Lectures provides provides an excellent clue. In Vol. III Ch 3-4, Identical particles, near start of recorded version (it’s not in printed version!), Feynman say (emphasis his): “... if there is a physical situation in which it is impossible to tell which way it happened, it always interferes; it never fails.” Feynman was emphatic because he found this one-to-one relationship deeply intriguing (and ironically, his Lectures editors did not). As he discusses in the same section, saying that “it is impossible to tell which way it happened” means something far more specific and difficult to achieve than the experimenter simply being ignorant about how the experiment played out. It meant that to remain quantum, there had to be no information anywhere in the universe about the history of the system. Quantum mechanics becomes the physics of systems with undefined histories, systems whose past has not yet been fully determined. The inverse of this situations is that observation occurs when such historical information is created, regardless of where that information is created or whether any conscious entity ever sees it. Observation becomes nothing more than the creation of information. But what is information in that context? In another example Feynman describes how neutrons can reflect wave-like off of a mercury surface mirror. But some fraction of these neutrons are also occasionally captured by mercury nuclei in the surface. When that happens, all wave-like quantum behavior ceases, and the atom itself becomes a human-detectable “record” of how the quantum experiment played out. However, no human is needs to witness the formation of that recording nucleus when the time it occurs, anymore than a human must look at every bit of data collected by a particle collider as it happens. It is enough simply that the atom exists. The mercury nucleus has, in other words, become an observer. It has recorded data on the location of the neutron, and in doing so eliminated all other possible histories that the neutron might have taken. (The more formal term for this is the integral of all possible histories.) But that has to be wrong! After all, the endlessly quoted and discussed Schrödinger’s Cat thought experiment starts with a quantum atom giving off or not giving off a particle, with both options becoming superposed or quantum states. If emitting or absorbing a particle is not quantum, if it is instead a form of historical recording of information, it would mean the entire Schrödinger’s Cat thought experiment is simply incorrect. Surely that cannot be correct! Here’s where another important idea comes into play: Statistical irreversibility versus absolute irreversibility. Information is created not when some event becomes absolutely impossible to reverse, but only pragmatically impossible to reverse. There is a big difference, because it means that almost any kind of weird combination of outcomes can become quantum and uncertain if you work hard enough at it. In that sense, the Schrödinger’s Cat thought experiment expresses a valid point, a point that Schrödinger’s was trying to convey as humorously and facetiously as possible. Folks ever since have taken his bit of humor far more seriously than he ever intended it to be taken. However, the sad truth is that the details of the Schrödinger’s Cat experiment fail to recognize the astronomical statistical irreversibility that occurs as soon as the emitted particle strikes a thermodynamically complex target, the detector. Once that happens, its state becomes part of the astronomically complex and constantly evolving states of thermal matter, and so becomes pragmatically irreversible. Its emission has been observed by the very complexity of the target that it struck, long before it had any effect on the cat. If the same emitted particle had instead somehow been confined to a small region in which there was a very good chance of it being reflected back to the same nucleus that emitted it, with (and this is even harder) a very high probability that it would be reabsorbed by that nucleus, then a real, meaningful superposition of two states (emission and non-emission) would have been possible. This is flatly not what takes place in the Schrödinger’s Cat experiment as it is usually described, and for that reason the emission, far from being quantum, simply becomes a mundane historical event, a non-quantum recording of what transpired to the nucleus. The cat became doomed to real, ordinary, classical death as soon as the emitted particle grew statistically unlikely ever to rejoin the nucleus from which it had been emitted. So what, then, is an observer in a universe that is fully self-observing? The clue again is statistical irreversibility, and one of the best sources of that is matter, especially thermal matter. What is an observer? As with the detector in the real Schrödinger’s Cat experiment, it most often is nothing more complex than an ensemble of atoms whose states are complex enough to make anything that bumps into it statistically unlikely ever to emerge again. Thermal matter is like the sticky mud of the universe, just waiting for naive quantum events to stick their boots in that mud and then, slurp!, lose them forever. Another name this kind of symmetry-destroying, statistically-irreversible, quantum mud boot-stealing is observation. And thus the bottom line is this: The universe doesn’t need us. All it needs is enough complexity to make nominally reversible quantum events sticky and irreversible. For that far simpler goals, grains of dust, molecules, and even atoms can in the right situations record data irreversibly, and thus act as observers. Or, in more personal terms: It’s not your brain that collapses quantum photons from distant stars into points of light, it’s the rhodopsin in your retinas. That may not sound as poetic as ideas like, say, retroactive self-observing Omega Points at the End of the Universe (hmm, maybe next door to the Restaurant?), but it’s an approach to quantum observation that helps spread the workload of maintaining existence a lot more evenly. ",
            "date": "Answered January 18, 2020",
            "views": "159",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Zean Dopier",
                    "user_href": "/profile/Zean-Dopier"
                },
                {
                    "user_id": "David Minger",
                    "user_href": "/profile/David-Minger"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roy Smith",
                "href": "/profile/Roy-Smith-36"
            },
            "answer_text": "How can it be claimed that consciousness creates the universe when consciousness is evidently and conspicuously absent from virtually all of the vast scope of the universe? There is absolutely no evidence, scientific or otherwise that the vast scope of the universe is not contained within consciousness. How we can we say it is “conspicuously absent” when according to the science journal, Nature, we don’t even know what consciousness is and why we have subjective experience? How can we say with any confidence that the universe does not itself have subjective experience? It is natural for man to anthropologize whatever he does not understand. How do we know, for example, that stars and planets do not have a form of consciousness? Just because they do not walk and talk and move about bipedally and parrot humans in every way does not prove they are not conscious. Perhaps they are far more conscious than us. When we take the large expanse of the universe and run a simulation of all the known celestial bodies, including calculations of dark matter and energy, what we get in appearance is not an incoherent distribution of random and chaotic elements in the tradition of mechanistic Darwinian materialism. We get what appears to be an intelligently constructed neural network identical with the neural network of the human brain. To say that such a thing is not the result of an intelligent universe of some type is the hubris of a self-absorbed pseudo-skeptic who lacks any imagination whatsoever.   ",
            "date": "Updated February 2, 2020",
            "views": "286",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tosha Hector",
                    "user_href": "/profile/Tosha-Hector"
                },
                {
                    "user_id": "Mary Cris",
                    "user_href": "/profile/Mary-Cris-15"
                },
                {
                    "user_id": "Jane Doe",
                    "user_href": "/profile/Jane-Doe-299"
                }
            ]
        },
        {
            "author_info": {
                "name": "Reva Ayrubagh Christ",
                "href": "/profile/Reva-Ayrubagh-Christ"
            },
            "answer_text": "I’m not sure what you mean by the “vast scope of the universe” but I realize you are perceiving the vast scope of the universe as being “unconscious.” In any case, it is claimed that consciousness created the universe because consciousness is non-physical and the only thing science can prove thus far, is that all matter is finite. That is, all matter will die, decay, erode, dissolve and cease to exist. All things not made of matter, have not been successfully discovered by science, so there is no physical evidence to support any claim to them. At the same time, it is a known fact that consciousness exists. It is experienced by every sentient life form. So applying physical law (matter disintegrates according to its finite properties), what is non-matter exists without a timeline. Therefore, what is non-matter must have always existed. We already accept that energy was always here. And now we know consciousness must have always been here. More so, conscious energy was always present and preceded physical creation. ",
            "date": "Answered January 19, 2020",
            "views": "26",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Tosha Hector",
                    "user_href": "/profile/Tosha-Hector"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dev Theron",
                "href": "/profile/Dev-Theron"
            },
            "answer_text": "A black hole is a conscious collector. An eventhorizon/thought, extract consciousness from reality. Conscious waves travel to a position within the black hole where it feel comfort. These positions of comfort change as more Consciousness enter the collector and alter understanding. Sometimes the the shift within the black hole is so intense as understanding cause conscious waves to alter between particle and waves and these changes in understanding reduce space and create space causing the black holes to release conscious information that cannot find a position of comfort within this collector and is marooned into space as dark matter/energy. Your question kick in at this stage. The majority of the universe consist of dark matter/energy. The reason why we cannot see it is because it decay so little consciousness that our thoughts can't do anything with it. I believe that dark matter/energy is micro scopic black holes with very weak eventhorizons and that they are consciously locked within their own tiny situations waiting for the universe to gain a greater collective as to open their portals. It is these matter that form our souls as they open up during conception to feed and channel the consciousness our thoughts release. It's pretty much the way a game of solitaire work. You get to a stage when you need to evolve thought as to gain tiny possibilities that will kickstart a new understanding. Thus explanation might give the answer you looking for,or it can just confuse you more. It does make sense to me so this is the best I can describe this very difficult topic. ",
            "date": "Answered January 18, 2020",
            "views": "36",
            "upvotes": " Answer requested by David Minger",
            "upvoters": [
                {
                    "user_id": "Tosha Hector",
                    "user_href": "/profile/Tosha-Hector"
                }
            ]
        },
        {
            "author_info": {
                "name": "Holly Hunt",
                "href": "/profile/Holly-Hunt-80"
            },
            "answer_text": "There are a number of people who believe consciousness is fundamental. For certain, life arose from the elements that were formed from the elements that compose the universe so I think its very likely that there is life throughout the universe in some form or another. And most likely some of those forms are conscious and self aware as we are. It may happen more than we can possibly guess. No one can explain why life, why exist, why the desire to reproduce and continue. Did the consciousness we know as us create the universe we are aware of as human beings? Probably not but it could be that the consciousness we have is just a lower primitive level of the consciousness that triggered the fundamental forces that formed matter and the reality we know with our senses. Every sense we have is designed to be aware of the world. As long as no one can explain exactly what the point of that is, we can imagine consciousness being something very significant. I believe the universe is what we can perceive with our senses but our senses are limited to human senses and there could be much more to it. ",
            "date": "Answered January 18, 2020",
            "views": "38",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rex Styzens",
                "href": "/profile/Rex-Styzens"
            },
            "answer_text": "We are accustomed to things that come and go, that are born and die, that begin and end. So when we are faced with the prospect of a universe that has no beginning and ending, we have no comparison to offer. We struggle with the distinction between a universe and an “observable” universe, with the difference between a cosmos (where all things are arranged in an order) and a universe that is just a happening. To add to that the vagueness of “consciousness” just complicates it beyond our comprehension. However, until we have better answers to the history of the universe and the composition of human self-awareness, we can expect confusion. ",
            "date": "Answered January 18, 2020",
            "views": "31",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Minger",
                    "user_href": "/profile/David-Minger"
                }
            ]
        },
        {
            "author_info": {
                "name": "Victor F. Sarmiento",
                "href": "/profile/Victor-F-Sarmiento"
            },
            "answer_text": "You are talking about personal consciousness. There is a universal and absolute consciousness creator of our personal consciousness. Is this personal one which is absent from all of the vast universe. So, we have to be consciously united in order to return to our true origin. Sciences in all orders have to work in this sense. ",
            "date": "Answered January 20, 2020",
            "views": "29",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Tosha Hector",
                    "user_href": "/profile/Tosha-Hector"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lee Ballentine",
                "href": "/profile/Lee-Ballentine"
            },
            "answer_text": "That’s exactly why. If consciousness arose here as a natural phenomenon through an evolutionary process, we would expect to see it everywhere in the universe through the same process, given that there are an estimated 200 billion galaxies out there. On the other hand, if consciousness arose first and then brought the universe into being, we would not be surprised to see consciousness in one place, surrounded by a colossal universe devoid of other consciousness. How Many Galaxies Are There? ",
            "date": "Answered July 26, 2020",
            "views": "63",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tosha Hector",
                    "user_href": "/profile/Tosha-Hector"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andy Kay",
                "href": "/profile/Andy-Kay-50"
            },
            "answer_text": "How can it be claimed that consciousness creates the universe when consciousness is evidently and conspicuously absent from virtually all of the vast scope of the universe? “Consciousness creates the universe”? I’ve never come across this claim before. Where has it come from? ",
            "date": "Answered January 18, 2020",
            "views": "22",
            "upvotes": " Answer requested by David Minger",
            "upvoters": [
                {
                    "user_id": "Kasule Francis",
                    "user_href": "/profile/Kasule-Francis-1"
                },
                {
                    "user_id": "Gloria Cole",
                    "user_href": "/profile/Gloria-Cole-1"
                },
                {
                    "user_id": "John Stanley",
                    "user_href": "/profile/John-Stanley-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dominic Cote",
                "href": "/profile/Dominic-Cote"
            },
            "answer_text": "I get the impression that our brain is wired to create reality through our senses and that everything is in a state of probability and only becomes a partical when life senses it does it collapse. Buddhists are able to reach a level lower or below the senses or to a more primal consciousness to witness this illusion. Science has concluded the same thing for over a hundred years and over two hundred expiriments. ",
            "date": "Answered January 18, 2020",
            "views": "31",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Carlos Pronsato",
                    "user_href": "/profile/Carlos-Pronsato"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nelson Yu",
                "href": "/profile/Nelson-Yu-9"
            },
            "answer_text": "That is wrong. When a fish is in the water, it may thing the sand is not part of the water. But if you recognize the water, fish and sand, what makes you think conciousness is not available to allow you to know them? No such thing as absolute vacuum. A pocket of vacuum is possible in air, but consciousness permeates, penetrates, precipitates in all of consciousness. Even unconsciousness is consciousness. ",
            "date": "Answered January 18, 2020",
            "views": "44",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard O. Colestock",
                "href": "/profile/Richard-O-Dick-Colestock"
            },
            "answer_text": "The religious folks think they’ve been getting away with such nonsense for thousands of years. Even for religious folk, they are remarkably immune to facts. ",
            "date": "Answered January 18, 2020",
            "views": "58",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kong Thao",
                    "user_href": "/profile/Kong-Thao-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven Craig",
                "href": "/profile/Steven-Craig-20"
            },
            "answer_text": "You that believe in solidity of the universe, should by now have realized that there is nothing solid, and no-thing can be proved as such. As the whole of science has struggled with finding no such answer for hundreds of years. So enjoy your ideas and imagination, for what you have been experiencing is inside your mind. The little thing about this discovery for you is, you know this is true, and consciousness is truth. ",
            "date": "Answered January 18, 2020",
            "views": "25",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Tosha Hector",
                    "user_href": "/profile/Tosha-Hector"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Jermey",
                "href": "/profile/Jon-Jermey"
            },
            "answer_text": "Anything can be ‘claimed’, provided the person claiming it is prepared to dismiss or ignore evidence to the contrary. But that doesn’t mean we have to take them seriously. ",
            "date": "Answered January 18, 2020",
            "views": "28",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Tony Nguyen",
                "href": "/profile/Tony-Nguyen-11"
            },
            "answer_text": "Only beings with a circadian rhythm are sometimes conscious and other times unconscious. From what we know of asteroids, comets, and other objects which do not have such binary cycles, they are neither conscious nor unconscious. Stars do have a solar cycle, fluctuating in luminosity, but we don't know if simply having a cyclically binary behaviour is enough to either be conscious or unconscious. ",
            "date": "Updated October 15, 2020",
            "views": "46",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Zbigniew Dzwonkowski",
                "href": "/profile/Zbigniew-Dzwonkowski"
            },
            "answer_text": "OK… with Big Bang as the moment of Creation… in some sense, the Real creator is the full consciousness of Absolute… Vedic AUM, the Creation Point means Absolute-Universal-Mind, the one single point floating on ocean of eternity, but expanding sometimes into Creation….with quest for full consciousness to create more full consciousness… all the best. ",
            "date": "Answered January 19, 2020",
            "views": "25",
            "upvotes": " Answer requested by David Minger"
        },
        {
            "author_info": {
                "name": "Mars Sterling Turner",
                "href": "/profile/Mars-Sterling-Turner"
            },
            "answer_text": "energy is consciousness Draft:Universe Intelligence ",
            "date": "Answered January 18, 2020",
            "views": "11",
            "upvotes": " Answer requested by David Minger"
        }
    ]
}