{
    "title": "How to understand Plato's allegory of the cave - Quora",
    "tags": [
        "Allegory of the Cave (Plato)",
        "Allegory",
        "Plato"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ganesh Subramaniam",
                "href": "/profile/Ganesh-Subramaniam-6"
            },
            "answer_text": "An allegory is a narrative which delivers a much broader message to the reader. The reader may be moved by the way in which this allegory captures the virtue of philosophical thinking. At the same time he may feel disturbed by the implication that our life is just an illusion. Plato suggests in the allegory that what we believe we are seeing and experiencing in our daily life is no better than a play of shadows. The world in which we live is only a fantasy world, and that the life that we lead is as pathetic as those of the prisoners in the cave. We are so sure that whatever we see is the reality, if someone were to tell us otherwise, we will not believe it. The prisoners represent humanity as a whole, and the cave symbolizes the world we see and experience, while the reality is outside the cave. Something akin to the more modern “frog in a well” – a frog that was born in a well, would think that the well is the ‘whole world’. Long before Plato, Hindu philosophy asserted that the world is an illusion, a play of the supreme consciousness of the Almighty. We call it ‘Maya’. Those who are not familiar with the allegory, here is the link: Allegory of the Cave by Plato - Summary and Meaning ",
            "date": "Answered September 3, 2020",
            "views": "238",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ravinz Ray Tabar",
                    "user_href": "/profile/Ravinz-Ray-Tabar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Simon",
                "href": "/profile/Stephen-Simon-12"
            },
            "answer_text": "What do you trust most as a source of knowledge? Many people would say: what I trust is what I can see and touch. Science is based on empirical observation, and many people trust nothing more than they trust science. The gold standard is what you can perceive with your senses. The allegory of the cave, however, says that what you can see with the eyes of your body is not all there is. It’s not even the most important or highest form of reality. The allegory says that what most people today trust above all can never in itself provide real knowledge. You can only have real knowledge of things which are not material, not perceivable with your senses. Perceiving thing is easy, but understanding things is hard, and takes much more than sensory perception. How this is possible is the subject of much discussion in Plato’s works and in the Platonic tradition since Plato. ",
            "date": "Answered February 2, 2019",
            "views": "367",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Wyatt Wye",
                    "user_href": "/profile/Wyatt-Wye"
                },
                {
                    "user_id": "Chris Wells",
                    "user_href": "/profile/Chris-Wells-143"
                }
            ]
        }
    ]
}