{
    "title": "How famous is NieR: Automata? - Quora",
    "tags": [
        "NieR:Automata (2017 game)",
        "Console Gaming",
        "Console Games",
        "PC Gaming ",
        "Games"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brian Greenhow",
                "href": "/profile/Brian-Greenhow"
            },
            "answer_text": "I literally just finished playing this game, it's a’ight, it's pretty good to play, has a lot of variation, looks good and it was interesting. There's something that just didn't gel though and it's hard to put it into words. I'm going to try and avoid it but just in case I'm gonna throw out a potential Spoilers Ahead alert. There were a lot of things I liked about Nier Automata but they were also offset by things that I didn't like. Let's start with the gameplay, there's a lot of variations in the gameplay, sidescrolling action, twin stick shooter, arcade bullet hell flight combat, free roaming exploration and different characters with very different abilities. At first the controls are incredibly busy, you've got your melee light and heavy attack combos, jump, miscellaneous action (for opportunity attacks), long range light damage that you can manually aim or auto aim (took me a while to realise you could toggle the lock on so for a few hours I was holding the lock on button constantly), a powerful time charge attack and a dodge (you really need the dodge). Putting this all together you are constantly using all four shoulder/trigger buttons and all the face buttons simultaneously. You don't really ease into this, it's just a baptism of fire and honestly my first impression was “this is overwhelming” but you get used to it and it definitely makes the game exciting to control.Sorry, wasn't a fan of the music, I felt it really didn't compliment the gameplay at all, not that it was bad per se, it just didn't seem to match the action. I actually found it annoying in some areas.Didn't appreciate the random game overs, “I'll just check over here for a harvest point…” oops, game over. “Need to head back to the shop” oops, game over. Whatever you do, do NOT eat the damn fish, I didn't appreciate having to replay an hour of the game for doing what I thought was a side quest… not cool.Story is ridiculously depressing, depressing isn't really the word, there is no ray of hope, everything you're doing is completely meaningless and the revelations in the end game just make it worse. I came out the other side wondering what the point was, a futile mission against impossible odds based on a false premise. Even the happiest ending was sad and pointless.All that said, I played it for around 40 hours and even had enough interest to watch a few different endings. If nothing else it's fun to play once you get used to the controls. I did actually like the characters but the finale actually spoiled that a lot for me. Instead of finishing the game and feeling a sense of accomplishment I was just left with an overwhelming feeling why? Why did I play this, what did I accomplish? Is it trying to tell me that life is meaningless and that struggling against it is futile? ",
            "date": "Answered May 26, 2017",
            "views": "15",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Fathi Najdi",
                    "user_href": "/profile/Fathi-Najdi"
                },
                {
                    "user_id": "Keith Ferrer",
                    "user_href": "/profile/Keith-Ferrer-3"
                },
                {
                    "user_id": "Kevin Erwins",
                    "user_href": "/profile/Kevin-Erwins"
                },
                {
                    "user_id": "Kevin Wijaya Oey",
                    "user_href": "/profile/Kevin-Wijaya-Oey"
                },
                {
                    "user_id": "Andre Alamillo",
                    "user_href": "/profile/Andre-Alamillo"
                },
                {
                    "user_id": "Siddhant Kundu",
                    "user_href": "/profile/Siddhant-Kundu-1"
                },
                {
                    "user_id": "Arnab Chowdhury",
                    "user_href": "/profile/Arnab-Chowdhury-33"
                },
                {
                    "user_id": "Dang Thien Nguyen",
                    "user_href": "/profile/Dang-Thien-Nguyen-1"
                },
                {
                    "user_id": "Lyal Edghill",
                    "user_href": "/profile/Lyal-Edghill"
                },
                {
                    "user_id": "Tori Walker",
                    "user_href": "/profile/Tori-Walker-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aiba Asagi",
                "href": "/profile/Aiba-Asagi"
            },
            "answer_text": "In an effort to update (as of July 6, 2019), NieR: Automata has surpassed over four million sales world wide across PS4, Xbox One, and PC ( Nier: Automata has sold more than 4 million copies).  Across the two years since its initial release, NieR: Automata has risen to critical acclaim winning multiple game of the year awards and nominations especially for it’s story and soundtrack. See under “Reception” → “Accolades” Nier: Automata - Wikipedia. Gaming review sites rate NieR at an average of 8.9–9.5 scores. User reviews being generally in the same range with a couple negative scores offset by 10’s. That being, it’s been also criticized on all fronts i.e repetitive combat and a story that only appeals to certain people. It’s still viewed as a “niche” title. However, it has garnered a wide audience and a cult following. The main character 2B and co. have become somewhat popularized in relation to “lewd” and “obscene” material (the best I can describe it as haha). On the otherhand, the characters have generated a steady stream of fanart. As such, I’d wager that 2B, or at least her image and character, is highly recognizeable amongst the gaming community.  Art credit to: TheCecil NieR: Automata is still being played to this day and being discovered by many people; just look at the recent let’s plays and walkthroughs on YouTube.  (Yes, that title is pretty amusing isn’t it?) Perhaps more telling to it’s success is how it saved the gaming company, PlatinumGames, from going financially bankrupt. (Nier director Yoko Taro saved PlatinumGames, according to Hideki Kamiya) All in all, NieR: Automata is now quite famous in the gaming community for being either a masterpiece of game design, music, and storytelling or an overrated and melodramatic story of meaningless proportions. Personally, I love viewing this game from all angles; it’s faults, smooth edges and such. It’s a unique game quite like none other. It’s special and has definitely solidified itself within the gaming archives as a whole. ",
            "date": "Answered July 6, 2019",
            "views": "386",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Garvit Shivran",
                    "user_href": "/profile/Garvit-Shivran"
                },
                {
                    "user_id": "Arber Reka",
                    "user_href": "/profile/Arber-Reka-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rohit Thukral",
                "href": "/profile/Rohit-Thukral-5"
            },
            "answer_text": "Nier:Automata is actually pretty famous… at least more famous than any of the Yoko Taro games out there. But it deserves much more love than the mainstream games everyone talks about. It did get decent sales to the amount that we can expect another sequel. But it’s really disheartening to see that many people aren’t giving chance to this hidden gem. If you want a full review on this game then check out my blog Home | TheStupidGamer ",
            "date": "Answered May 26, 2017",
            "views": "467",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eren McKinley",
                    "user_href": "/profile/Eren-McKinley"
                },
                {
                    "user_id": "Adam Sivachev",
                    "user_href": "/profile/Adam-Sivachev"
                },
                {
                    "user_id": "Shantanu Narayan Sethi",
                    "user_href": "/profile/Shantanu-Narayan-Sethi"
                },
                {
                    "user_id": "Chu Kim",
                    "user_href": "/profile/Chu-Kim-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andy Lee Chaisiri",
                "href": "/profile/Andy-Lee-Chaisiri"
            },
            "answer_text": "Famous enough for Arby’s to tweet about Nier: Automata! \n Yoko Taro’s previous games were cult classics, devoted fanbase but not quite mainstream. Nier: Automata has broken this trend with over 2 million sales worldwide. ",
            "date": "Answered May 26, 2017",
            "views": "12",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Keith Ferrer",
                    "user_href": "/profile/Keith-Ferrer-3"
                },
                {
                    "user_id": "George Vasios",
                    "user_href": "/profile/George-Vasios"
                },
                {
                    "user_id": "Kris Chin",
                    "user_href": "/profile/Kris-Chin-5"
                },
                {
                    "user_id": "Anh Tuan Phan",
                    "user_href": "/profile/Anh-Tuan-Phan"
                },
                {
                    "user_id": "Adam Sivachev",
                    "user_href": "/profile/Adam-Sivachev"
                },
                {
                    "user_id": "Borris Knox",
                    "user_href": "/profile/Borris-Knox"
                },
                {
                    "user_id": "David Weinehall",
                    "user_href": "/profile/David-Weinehall"
                },
                {
                    "user_id": "Siddhant Kundu",
                    "user_href": "/profile/Siddhant-Kundu-1"
                },
                {
                    "user_id": "Manprith Singh",
                    "user_href": "/profile/Manprith-Singh-1"
                },
                {
                    "user_id": "Sarah Ferrans",
                    "user_href": "/profile/Sarah-Ferrans"
                }
            ]
        }
    ]
}