{
    "title": "How can we be sure that we actually exist and that life as we know it isn't merely a dream? How can we be sure that real existence is known? - Quora",
    "tags": [
        "Existence",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Shai",
                "href": "/profile/Daniel-Shai-1"
            },
            "answer_text": "The idea of existence is so simple, that the human thinking just overlooks it. Existence means to be. To be is not to think about being, but just to notice the very fact of being. Stop thinking for a millisecond and notice… existence. It’s literally self-evident. I’m not speaking of existence as this or that, but just that “something” is — there is isness. Existence is existing. Now. Never in the future. Always now. (Words can only do so well in this domain). Everything is a dream, in the sense that everything is an idea. The only way for existence to know itself is to “think”. Since it is completely alone, it has to reflect in order to extend itself. So, you could say that all of creation is imagination. A dream. Existence dreams infinite dreams, but it can only do so because it exists! The fact that everything is an idea or a dream doesn’t diminish it. Your experience will always be real to you. But that is all that is real, meaning the elements that make up the experience aren’t really real (like time and space), but the experience your consciousness is having is real to you in the moment you’re having it. That’s just the way the mechanism of consciousness works. If you think about it, it has to be that way, otherwise the game would really suck… ",
            "date": "Answered March 27, 2017",
            "views": "11",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Karthik Gangadhar",
                    "user_href": "/profile/Karthik-Gangadhar"
                },
                {
                    "user_id": "Matej Kozic",
                    "user_href": "/profile/Matej-Kozic-1"
                },
                {
                    "user_id": "Holly Van Gorden",
                    "user_href": "/profile/Holly-Van-Gorden"
                },
                {
                    "user_id": "Grant Patrick",
                    "user_href": "/profile/Grant-Patrick-4"
                },
                {
                    "user_id": "Pete Ashly",
                    "user_href": "/profile/Pete-Ashly"
                }
            ]
        },
        {
            "author_info": {
                "name": "Justin Schwartz",
                "href": "/profile/Justin-Schwartz-3"
            },
            "answer_text": "We can't be _sure_, but why are these questions important? They're just versions of Descartes’ evil demon problem, and the range of answers and the problems with them are well known. Thevquestions themselves depend on suppositions thatvare doubtful,and not very interesting, such as that we are somehow trapped inside our own minds and either cannot know the world as it is (Kant) or have to claw our way into it by superhuman episremological and metaphysical effort (Descartes, among others). And that absolute certainty is very important. Andvtgat thesecwuestions make a difference to anything we care about. There is a reason it's been 100 years since anyone bothered to treat these questions as anything more than historical artifices. ",
            "date": "Answered March 27, 2017",
            "views": "516",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Felipe Felix",
                    "user_href": "/profile/Felipe-Felix-5"
                },
                {
                    "user_id": "Lukas Eliasson",
                    "user_href": "/profile/Lukas-Eliasson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Moon. Eian",
                "href": "/profile/Moon-Eian"
            },
            "answer_text": "Rene Descartes pondered a very similar if not the same question . This dilemma concluded in the now famous quote “cogito ergo sum” which translates into “I think; therefore I am “ in expanded terms: if you have the capability to think you must be real as you have the possibility to ponder your own existence and expiernce the universe . Wether we exist in a fake reality or dream we in fact do exist . What ever state of existence or non existence we form part of is our reality as we perceive the universe and other around us as well as contemplate such questions . ",
            "date": "Answered March 24, 2017",
            "views": "279",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Tarnpoll",
                "href": "/profile/Michael-Tarnpoll"
            },
            "answer_text": "What about the world, or your life, would change if you discovered that existence is a dream? Would that not simply change your definition of existence. Would anything in your reality be different? of course it wouldn’t. This is a philosophical exercise, a mind game. It arises from no existential concern and its answer, if it can be found, has no value or effect. It is fun, but ultimately pointless. ",
            "date": "Answered March 26, 2017",
            "views": "251",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Antony Wolfson",
                    "user_href": "/profile/Antony-Wolfson"
                }
            ]
        }
    ]
}