{
    "title": "How to use psychedelic drugs with meditation - Quora",
    "tags": [
        "Psychedelic Experience",
        "Psychedelic Drugs",
        "Meditation",
        "Recreational Drugs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Johnny Gee",
                "href": "/profile/Johnny-Gee-16"
            },
            "answer_text": "An awful, and popular idea, that I strongly disagree with. This is a diabolically inspired idea. Mind altering drugs are the antithesis of a calm mind. Do not be a fool, LSD does very very serious damage to the astral nerves. I am so annoyed that even a brilliant mind like Jordan Peterson made a comment in favor of carefully administered LSD and it took away desire to smoke.. Absolute bull you know what. DO NOT LISTEN TO THIS LIE. LSD and related mind altering trips, are poison for the soul and will seriously delay your souls progress. I resisted the temptation to use, long ago when loony tune, Tim Leary was all the rage. He was mad. DO not be a fool, exercise extreme caution … drugs are mind manifesting, I repeat, drugs are mind manifesting. MIND MANIFESTING IS the polar opposite of the goal of meditation which is to completely quiet the mind while awake. PURE POISON ",
            "date": "Answered March 29, 2019",
            "views": "98",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Raj Supe (Kinkar Vishwashreyananda)",
                "href": "/profile/Raj-Supe-Kinkar-Vishwashreyananda"
            },
            "answer_text": "I am sorry, but don’t use them. Psychedelics take you to an artificial state, something that’s way too twisted even to be called an altered state or a mental simulation. If someone said best way to see stars is to be slapped hard, it seems offensive. But that’s exactly what the use of psychedelics is to meditation. Psychedelics take you to a”false reality”, meditation takes you to a “deeper reality.” There is no place for psychedelics in meditation. If someone tells you that, beware! you are being taken for a ride! ",
            "date": "Answered June 1, 2019",
            "views": "302",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jagruti Mody",
                    "user_href": "/profile/Jagruti-Mody"
                },
                {
                    "user_id": "Avinash Kumar",
                    "user_href": "/profile/Avinash-Kumar-254"
                },
                {
                    "user_id": "Jahnvi Mody",
                    "user_href": "/profile/Jahnvi-Mody-1"
                },
                {
                    "user_id": "Amit Gupta",
                    "user_href": "/profile/Amit-Gupta-4258"
                },
                {
                    "user_id": "Divya Ranglani",
                    "user_href": "/profile/Divya-Ranglani-2"
                },
                {
                    "user_id": "Tejaswini Waghulde",
                    "user_href": "/profile/Tejaswini-Waghulde"
                },
                {
                    "user_id": "Yadavendra Singh",
                    "user_href": "/profile/Yadavendra-Singh-4"
                },
                {
                    "user_id": "Meenakshi Roy",
                    "user_href": "/profile/Meenakshi-Roy-29"
                }
            ]
        },
        {
            "author_info": {
                "name": "Don Williams",
                "href": "/profile/Don-Williams-259"
            },
            "answer_text": "When I use shrooms, I like to be outside, at night with a fire going. I’m an avid meditator by the way. I will consume the fungus and start a nice fire. Once the fire is going good, I will start my meditation. I’m generally well into the meditation by the time the fungus hits. I will maintain the meditative state for as long as possible. The fungus will prevent things from getting too deep. It’s far to distracting once it gets rolling. ",
            "date": "Answered March 28, 2019",
            "views": "38",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Charles Clemens",
                    "user_href": "/profile/Charles-Clemens-3"
                }
            ]
        }
    ]
}