{
    "title": "How to relate yourself to the structure of your society - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Joe Andros",
                "href": "/profile/Joe-Andros-1"
            },
            "answer_text": "How do you relate yourself to the structure of your society? OooOOo. Cool question. Bear in mind, ordinarily I don’t. Not consciously. My focus is simply to interact one-to-one with whoever’s in front of me. I don’t pay much attention to broader tangles and radiation of structure. But they are there, enfolding us both! If I stand back a bit and analyze what I’ve observed, I can see my relation to those structures. How do I relate? I’m just some guy! That’s how I relate. No more or less important than others, really (sentimental value aside). At the individual level, that’s all of us - though we’re not much alike otherwise, beyond a powerful similarity of organism (same senses brought to bear on a shared reality, lending a strong overlap to our common sense of things). Still, we don’t notice similarities at that level - something common to all homo sapiens sapiens. We notice what sticks out, and we all have our peculiar combo of traits and ways. As a whole, society is made of free and equal beings (well, mine is). “Equal” in the sense that our personal judgment has no power over another. We don’t have to value what others value. No one can judge and punish us, only we all can - by means of the hired help, for one of the complete list of judgeable, punishable acts (CRIMES), via due process. Unless we run afoul of that - below the line of law, that is - we are free to attempt anything. It doesn’t really matter how anyone values us, unless we give their judgment worth. That’s the foundational unit. Each of us: a person. We each have different properties and characteristics. We can each excel or flounder in different ways with different people, based on innate capacities, acquired talents, and most of all interpersonal compatibility. I’m guessing here, but I suspect everyone deep down is imprisoned in a well of alienation, within which they know they can never be truly known, or know another. At best through cracks in the mortar, we can catch glimpses of another’s light as they drift by (these are weird wells, adrift, unmoored). Yet by these glimpses of what another gives of self, we can recognize kinship, like-mindedness. It lifts us up to where we’re sure we’re known and know. What they say moves us, and vice-versa. Most of us cultivate such connections and prize them. It keeps the abyss at bay. When we feel strong belonging, the abyss slips away. If we think about it at all, we feel like it was only an illusion. When connections fail and we are left utterly alone, the abyss closes in. We may feel all the rapport we ever had was the illusion, then. It’s kind of cool actually, how that flips. Anyhow! All around and above that basic, foundational unit (the individual), there are structures upon structures, overlapping in off-center circles. Fanning out, building up: Professional circlesCoworkersColleagues in the industry (including ex-coworkers)Official circlesgovernmentalreligiousvarious groups or clubs dedicated to some hobby or interest (political causes, too), or purely socialUnofficial circlesOur various personal circles of friends. Some have more than one, centered on different places or things (for example, one’s own friends and the friends of one’s current relationship partner).The regulars we encounter in places we go frequently, known to some extent and friendly to varying degrees, but we only associate within that one context. These may move up to 3(a) on an individual basis.In general, anyone in any of those circles and subcircles can move up to personal friend, if you each decide you want to expand and deepen the context of your acquaintanceship. If you decide who you are to each other has outgrown the coincidence of how you met. For the most part all this association is free (oh, a quibble on coworkers, but we can and do move jobs). Apart from such obligations we’ve freely taken on, no one is owed our attention or company - let alone any greater gifts of self. We aim ourselves where the encounter and exchange rewards us, with enjoyment of the other(s) and ourselves. All we give of ourselves is offer: the other is as free to decline as to accept. If we find ourselves in a social circle with an ASS HOLE, someone we can’t stand, we may try to simply limit our interaction with that person. Continue to enjoy the society of the others. It’s a key skill to develop, because if we can’t do it, chances are we cannot make the other leave. We may have to excuse ourselves, instead. That’s how I relate myself to the structures of my society. It is at best a gloss, but really it would be very hard to go comprehensive. There are so many structures people make, coming together for all kinds of purposes. We aim by our interests, and we get in where we fit in. Hopefully we cultivate ourselves with some productive alone time as well. If we don’t, we’ll have all the less to bring, and we’ll miss a lot of fit. ",
            "date": "Answered March 8, 2020",
            "views": "171",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Clarissa Paige",
                    "user_href": "/profile/Clarissa-Paige-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "John-Peter Gernaat",
                "href": "/profile/John-Peter-Gernaat"
            },
            "answer_text": "I am no longer young and I have found my own self-worth. I relate to my society on my own terms based on the value I place on myself. The society I live in is not highly structured and therefore it is not an aspect I need to concern myself with too much. Are you asking this question to get a range of responses or are you looking for advice for your own particular situation? ",
            "date": "Answered March 8, 2020",
            "views": "64",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "James Jones",
                    "user_href": "/profile/James-Jones-2821"
                }
            ]
        },
        {
            "author_info": {
                "name": "Felica Neal",
                "href": "/profile/Felica-Neal"
            },
            "answer_text": "I don’t. Honestly this society’s expectations are way to much, don’t get me wrong I am a very beautiful young lady, and it’s almost like I’m not good enough just the way I am no make up, and natural short hair. ",
            "date": "Answered March 9, 2020",
            "views": "68",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "DeAnna Elyse",
                    "user_href": "/profile/DeAnna-Elyse-1"
                }
            ]
        }
    ]
}