{
    "title": "How does chronemics influence communication? - Quora",
    "tags": [
        "Chronemics",
        "People Skills",
        "Influence"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dehua Liu",
                "href": "/profile/Dehua-Liu-9"
            },
            "answer_text": "As for chronemics, I would like to talk it by two methods or two perspectives. The first one is to divide the time into monochronic time and polychronic time. This method is classified by Edward T. Hall. People from M-time culture prefer to finish one task in a certain of time while there are no other issues bothering them. They have strict timeline for what they should do at what time. The overlapped timeline or task would get them frustrating. They may be also annoyed by lingering over one simple assignment for they would like to get things done at once without delaying for a long time. But for people from P-time culture, it’s impossible for them to engage in one problem at a period of time . On the contrary, they might embark on several task and are able to deal with many problems. The timeline is not very clear for they could work or enjoy something at a time. The second one is to divide culture into past-oriented culture, present-oriented culture and future-oriented culture. People in past-oriented culture, like people in China, values the history and emphasize the past memory, and the past developement or culture is much more significant. For people from present-oriented culture, they appreciate the time being and grasp present time to pursue something or do what attracts them. And people in futute-oriented culture adapt to some changes and get accustomed to flexible life. That’s what I view the chronemics influence intercultural communication, with some theories borrowing from some scholars. Hope these writings helpful for you. ",
            "date": "Answered March 29, 2018",
            "views": "928",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Marshal Nangati",
                    "user_href": "/profile/Marshal-Nangati"
                }
            ]
        }
    ]
}