{
    "title": "How has technology harmed politics? - Quora",
    "tags": [
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shaun Jacobs",
                "href": "/profile/Shaun-Jacobs-34"
            },
            "answer_text": "Yes, technology has harmed politics - especially the study of politics. A previous answer says that judging harm requires a moral ethic and that is true. Only living things can suffer, it is our purest emotion. However, politics has been hit hard by technology. This can be seen in the empirical nature of politics of the modern era and a shift away from a normative approach to politics. Politics has been caught in the whirlwind of numerical data and is now reliant upon it. Technology has made us depend on numerical data to draw conclusions and make predictions about politics and political systems. Politics has become reliant on technology to access numerical data and to produce numerical data. Furthermore, technology has made it possible to centralise decisions and the bureaucracy which is, from a cursory knowledge of history, detrimental to society. Centralised countries, businesses and organisations throughout history have never succeeded and if they have it has been a flash in the pan. Centralisation doesn’t work but technology allows politics to be centralised into the hands of a very powerful few which results in a plutocracy or aristocracy. Thus, technology has harmed politics in a myriad of ways and the points stated are not exhaustive in this regard. ",
            "date": "Answered August 1, 2019",
            "views": "91",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Farooq E Subhan",
                    "user_href": "/profile/Farooq-E-Subhan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Godek",
                "href": "/profile/Stephen-Godek"
            },
            "answer_text": "Judging harm requires a moral ethic. Technologies are morally neutral extensions of human capabilities. It’s what people use technology to do that causes harm—or benefits. The use of communications technology to manipulate rather than persuade others of particular political points of view should be considered harmful. The messages posted by internet trolls look like sincere communications and that’s how they can cause harm—by getting people to whom they are exposed to believe things that are not true—even though they are practically indistinguishable from messages that people should have a right to consider protected as freedom of speech. ",
            "date": "Answered July 31, 2019",
            "views": "48",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Farooq E Subhan",
                    "user_href": "/profile/Farooq-E-Subhan"
                }
            ]
        }
    ]
}