{
    "title": "How harmful is postmodernism? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Mack Moore",
                "href": "/profile/Mack-Moore-1"
            },
            "answer_text": "The introduction of the book states “postmodernism has begun”. That assessment is decades out of date. I listened to the first minute or two, but I’m sorry, I can’t accept a 38-minute listening assignment as a prerequisite to answering. (You might consider offering a synopsis if you wish to have a specific idea addressed.) It would be a more time-relevant statement to say that postmodernism is finally coming to an end. The Harm Caused by Postmodernism Postmodernism has destroyed the world. The world is on the brink of collapse culturally, economically, and politically; and family has already ceased to exist. Everyone is suffering. Poet Michael Meade calls this “the collapse of the mesocosm”. I’d say these are pretty significant forms of harm. Family was the most successful institution in the history of humanity, and has existed for at least thousands of years, if not tens of thousands; yet family has ceased to exist due to postmodernism, for it is now merely an association of convenience bearing no resemblance to the permanent institution of the past, upon which people relied for their basic needs, which now go unmet in many cases. Other human needs which were once satisfied by family are now partially addressed by the state, which beckons a more and more intrusive and omnipotent state. As a result of unmet social needs, children suffer from dramatically higher rates of social malaise of every sort, which indirectly affects everything, most especially missed human potential. What arena of human activity is unaffected by that? None. Embracing postmodernism includes having divorced oneself from the pursuit of truth in any form. The pursuit of truth is the pursuit of knowledge. In the absence of that pursuit, knowledge suffers. One of the outcomes of postmodernism, therefore, is the current “idiocracy”, a reign of ignorance and prejudice, which a majority of people in the western world feel no need to overcome; resulting in an escalation of social discord and political extremism. The most significant extremist movement in western civilization (by the number of adherents) is ultraliberalism, many aspects of which political moderates and conservatives consider to be bordering on insanity. Especially Political Harm In a state of ignorance, it is very easy for political manipulators to deceive and control the masses for private gain, which has gravely threatened the democratic process. Thus the subversion of democracy by the infamous 1% is also related to postmodernism, for without having first divorced themselves from the pursuit of knowledge and become ignorant and undisciplined in their thought process under the influence of postmodernism, the masses would never have become so vulnerable to political deception and control. So the post-9/11 trend of false flag events leading to gross impairments of civil liberties under the pretense of nebulous and interminable threats (permanent war) is a political condition that could not have occurred except in the context of postmodernism. I suspect that creating a vulnerable populace in order to get away with permanent war is the real reason why the ultra rich foisted postmodernism upon the world in the first place. Fortunately, some of us are waking up and fighting back. Future Prospects The question now is whether the world can recover. Recovery is often framed as an awakening of consciousness. Many people talk about a global awakening, which means recovery from postmodern thought, among other things, and there is some cause for hope. The survival of our civilization, I would say, depends upon that recovery. A few short years ago, that kind of statement might have been considered hyperbolic; but today, I think, it is quite realistic. The stakes have never been so high. May we begin to think and act more consciously. ",
            "date": "Answered January 23, 2017",
            "views": "11",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Miguel Romero",
                    "user_href": "/profile/Miguel-Romero-141"
                },
                {
                    "user_id": "Brad Miller",
                    "user_href": "/profile/Brad-Miller-223"
                },
                {
                    "user_id": "Walter Kiceleff",
                    "user_href": "/profile/Walter-Kiceleff"
                },
                {
                    "user_id": "Thomas Schaller",
                    "user_href": "/profile/Thomas-Schaller-4"
                },
                {
                    "user_id": "Jonathan Spencer",
                    "user_href": "/profile/Jonathan-Spencer-36"
                },
                {
                    "user_id": "Henry Resheto",
                    "user_href": "/profile/Henry-Resheto"
                },
                {
                    "user_id": "Elis Vasileiou",
                    "user_href": "/profile/Elis-Vasileiou"
                },
                {
                    "user_id": "Tom Ramsay",
                    "user_href": "/profile/Tom-Ramsay-3"
                }
            ]
        }
    ]
}