{
    "title": "How does politics affect your life? - Quora",
    "tags": [
        "Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Karam",
                "href": "/profile/Andrew-Karam-3"
            },
            "answer_text": "It’s easier to ask how politics does not affect my life. Consider: I’m approaching retirement age. I’ve been paying into Social Security for 40 years. Can I count on it to be there when I retire to help keep me out of poverty? That’s a political question.When I retire, can I count on Medicare to help take the place of my company’s health insurance plan when I am no longer employed and will have a sharp drop of income? That’s another political question.There was a gun fired on my street a few days ago. The police were called by one of my neighbors and appeared within a few minutes. They investigated, were told who fired the gun, and took him into custody. The number of police, the rules under which they operate, the emergency call (911) system, and the laws that this guy was violating are all the results of political processes. And no matter where you stand on gun laws, one would hope you’d agree that people should not be firing guns at random in a densely populated neighborhood that includes a lot of kids.I rely on mass transit to get around New York. I take the taxi or Uber to the airport. I fly a lot. All of these are regulated to help to ensure safety and security for me and for other passengers. People taking “gypsy cabs” are often taken advantage of. These regulations are the results of political processes.The food I buy at the grocery store, the food I eat at restaurants (or, this being NYC, the food I have delivered to me by the restaurants), the food carts I buy from on the street - all of these are subject to public health inspections and must comply with the city’s sanitary code. The water I drink is similarly inspected and sampled. This has reduced food poisonings and infections from unsafe water considerably. And these regulations are - you guessed it - the results of political processes.If I have to go to court - on either side of an issue - the laws, the judges, and even the prosecutors are all appointed and paid for by the government. This means that politics affects their very presence and has a lot to do with the way that they view many of the cases that come before them.I could keep going - I haven’t even mentioned the military that protects our national interests, taxes, education, the fire fighters who not only fight fires, but also perform fire safety inspections, the ambulances that might one day have to rush me to the hospital to save my life, the medications I take to help my life to be healthy and longer, and so many other things - these are all regulated by the government as well and those regulations (and the agencies that inspect to ensure regulatory compliance) are also the results of political processes. The bottom line is that politics affects huge aspects of my life - and the life of virtually all of us. Sometimes for better, sometimes for worse - it’s ubiquitous and inescapable. ",
            "date": "Answered June 21, 2018",
            "views": "23",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "LPL",
                    "user_href": "/profile/LPL-5"
                },
                {
                    "user_id": "Margie Ybanez",
                    "user_href": "/profile/Margie-Ybanez-2"
                },
                {
                    "user_id": "Charlie Weir",
                    "user_href": "/profile/Charlie-Weir-2"
                },
                {
                    "user_id": "Sumedh Khanolkar",
                    "user_href": "/profile/Sumedh-Khanolkar"
                },
                {
                    "user_id": "Ward Van Frost",
                    "user_href": "/profile/Ward-Van-Frost"
                },
                {
                    "user_id": "Rosemary E Williams",
                    "user_href": "/profile/Rosemary-E-Williams"
                },
                {
                    "user_id": "Jefferson Li",
                    "user_href": "/profile/Jefferson-Li"
                },
                {
                    "user_id": "Thomas Whitlock",
                    "user_href": "/profile/Thomas-Whitlock"
                },
                {
                    "user_id": "Venkatasubramanian Meenakshisundaram",
                    "user_href": "/profile/Venkatasubramanian-Meenakshisundaram"
                },
                {
                    "user_id": "Alexander Ribakoff",
                    "user_href": "/profile/Alexander-Ribakoff"
                },
                {
                    "user_id": "Brendan Waugh",
                    "user_href": "/profile/Brendan-Waugh"
                },
                {
                    "user_id": "Dragi Raos",
                    "user_href": "/profile/Dragi-Raos"
                },
                {
                    "user_id": "Ronak Chheda",
                    "user_href": "/profile/Ronak-Chheda-2"
                },
                {
                    "user_id": "Luis Lasch",
                    "user_href": "/profile/Luis-Lasch"
                },
                {
                    "user_id": "Dallas Herrmann",
                    "user_href": "/profile/Dallas-Herrmann"
                },
                {
                    "user_id": "Martin Olesh",
                    "user_href": "/profile/Martin-Olesh"
                },
                {
                    "user_id": "Gerald Pierson",
                    "user_href": "/profile/Gerald-Pierson"
                },
                {
                    "user_id": "Nancy Jacobsen",
                    "user_href": "/profile/Nancy-Jacobsen"
                },
                {
                    "user_id": "Jim Davis",
                    "user_href": "/profile/Jim-Davis-210"
                },
                {
                    "user_id": "Tim Cole",
                    "user_href": "/profile/Tim-Cole-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dhairy Boghani",
                "href": "/profile/Dhairy-Boghani"
            },
            "answer_text": "Politics is about government policies and laws which we all have to follow in terms of spending peaceful and honourable life. So it confines you to certain extent. It puts limits on your unbounded thoughts you do in your dreams. I am Medical student from Gujarat, India. When I completed my school, I was rank 565 in Gujarat state. In Gujarat, we had 1100 government medical college seats at that time. But how many was available for us to take? 427/1100 was available. My friend with rank 626 is studying in private college spending ₹12,00,000. But I have a classmate with 6260 rank with 62% (general cut off was 90.15%) just because he belongs to some particular cast. Government policy does affect our life. Like as a doctor, we can't refuse a patient in case of emergency. In terms of being available at duty all the time, doctor can't drink. Nit reporting a case of communicable disease to government is an offense. Many more rules, which affects me but I can accept it as they are made in good faith. Now, Some state government made a rule tjat doctor can't charge more than 200 Rs from patient. Now think of a super specialist doctor. Who has been studying hardest from 11th standard, sacrificed minimum 14 years of his life after studying and being doctor will earn only 70 to 80k by this rule. How does a illiterate politician will understand value of doctor! Politics affects this way! Think of a resident who hasn't sleep till 48 whole hours working in a ward saving lives, suddenly beaten by group of people over a death of person, who was despite doctor's warning not to fed, was fed and which became the reason of his death. Goverment can't provide protection to doctors. Honourable court is saying that if you're feeling, be at home. Goverment policy, if made or not made, does affect our life. Government made a rule of writing generic medicines. Doctor started writing them. Obviously it gave inferior results. (Can you compare cellphone from VIVO to APPLE?? Same way here.) Doctors were beaten again for that. Doctors were beaten by some pharma companies too. Then government has changed a rule that doctor can write name of specific company drug in bracket. So again policy affects… Goverment policy of starting 108 has changed outcome in terms of mortality and morbidity by far. Again policy does affect… Government has now provided enough funds for Medical research. ICMR has started new PhD syllabuses after MBBS. It is affecting all MBBS student now who are interested in research activities. And it will have sure effect on outcome of health care in coming years all throughout India. I have explained with example of it's effect on & related to Medical field. But it affects all everyday life activities whatever is your profession. So every bad or good dicision took by government which is part of their politics, will affect life of each person of the country. ",
            "date": "Answered June 21, 2018",
            "views": "31",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sam Smith",
                    "user_href": "/profile/Sam-Smith-1138"
                },
                {
                    "user_id": "Inbarasi Anbarasan",
                    "user_href": "/profile/Inbarasi-Anbarasan"
                },
                {
                    "user_id": "Dharmin Trivedi",
                    "user_href": "/profile/Dharmin-Trivedi"
                },
                {
                    "user_id": "Vaishnavy Dixit",
                    "user_href": "/profile/Vaishnavy-Dixit"
                },
                {
                    "user_id": "Rinkal Paghdar",
                    "user_href": "/profile/Rinkal-Paghdar"
                },
                {
                    "user_id": "Priyanka Vigraman",
                    "user_href": "/profile/Priyanka-Vigraman"
                },
                {
                    "user_id": "Rohini Vijayakumar",
                    "user_href": "/profile/Rohini-Vijayakumar-3"
                },
                {
                    "user_id": "Ritoban Biswas",
                    "user_href": "/profile/Ritoban-Biswas"
                },
                {
                    "user_id": "Mehak Kulshrestha",
                    "user_href": "/profile/Mehak-Kulshrestha"
                },
                {
                    "user_id": "Shreoshi Dutta",
                    "user_href": "/profile/Shreoshi-Dutta-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Soumili Das",
                "href": "/profile/Soumili-Das-36"
            },
            "answer_text": "Disclaimer : This is a sarcastic take. Please read it accordingly. Thank you. Politics and life are two distinct, but parallel lines. Politics affects our lives in various ways. Some of them are given below : A 20 - year old nibba tries to propose a nibbi of his age. He says, “(a + b) ^2 mein jaise extra 2ab aa jaataa hai, waise hi tumhare aur mere milne par extra 2ab aa jaataa hai!” (Translation : Just like the way, in the (a + b) ^2 formula, the extra 2ab comes, when me and you meet, this 2ab also comes! I love you!). A friend of yours is dull - witted. You have a special nickname for him, “Pappu”! You don't throw food packets on the road. Your friend address you as, “Modi Ki Poti” (Translation : The granddaughter of Modiji).A friend of yours tries an April's Fool prank on you that turns out to be stupid. And then, you tell him, “Hum gadhe hain?!” (Translation : Am I a donkey?). You are caught playing games during your study - time. You utter the line, “Darr ka mahaul hai!” (Translation : The time is really frightening!). A friend of yours cracks a stupid joke. You say, “Kucch bhi! Kucch bhi!” (Translation : Anything! Anything!) Your dad's friend complains about his son who plays games frequently, to your dad. Your dad, before elucidating the solution, simply asks, “Ye PUB-G - wala hai kya?” (Translation : Does he play PUB-G?) You study mathematics just before your exam day. You say to yourself, “My exam is in God's hand, now!”. -miliSou 🙏🏻🙏🏻 ",
            "date": "Answered September 6, 2020",
            "views": "38",
            "upvotes": " View 99 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kesava Nittala",
                    "user_href": "/profile/Kesava-Nittala"
                },
                {
                    "user_id": "Gagandeep Singh (ਗਗਨਦੀਪ ਸਿੰਘ)",
                    "user_href": "/profile/Gagandeep-Singh-ਗਗਨਦੀਪ-ਸਿੰਘ-1"
                },
                {
                    "user_id": "Arun K Shukla",
                    "user_href": "/profile/Arun-K-Shukla"
                },
                {
                    "user_id": "Naazmul Khan",
                    "user_href": "/profile/Naazmul-Khan-1"
                },
                {
                    "user_id": "Manoj Kumar",
                    "user_href": "/profile/Manoj-Kumar-1375"
                },
                {
                    "user_id": "Naveen Lakhara",
                    "user_href": "/profile/Naveen-Lakhara"
                },
                {
                    "user_id": "Rounak Singh",
                    "user_href": "/profile/Rounak-Singh-174"
                },
                {
                    "user_id": "Nikhil Chouhan",
                    "user_href": "/profile/Nikhil-Chouhan-17"
                },
                {
                    "user_id": "Aditya",
                    "user_href": "/profile/आदित्या-Aditya"
                },
                {
                    "user_id": "Natal Kumar",
                    "user_href": "/profile/Natal-Kumar"
                },
                {
                    "user_id": "M S Vamsi",
                    "user_href": "/profile/M-S-Vamsi"
                },
                {
                    "user_id": "Ayush Lohani",
                    "user_href": "/profile/Ayush-Lohani-5"
                },
                {
                    "user_id": "Kannan Iyer",
                    "user_href": "/profile/Kannan-Iyer-45"
                },
                {
                    "user_id": "Piyush",
                    "user_href": "/profile/Piyush-747"
                },
                {
                    "user_id": "Prajat Kumar",
                    "user_href": "/profile/Prajat-Kumar-2"
                },
                {
                    "user_id": "Zakiah Moin",
                    "user_href": "/profile/Zakiah-Moin"
                },
                {
                    "user_id": "Harsh Jain",
                    "user_href": "/profile/Harsh-Jain-281"
                },
                {
                    "user_id": "Pravasi Meet",
                    "user_href": "/profile/Pravasi-Meet"
                },
                {
                    "user_id": "Sujata Agarwal",
                    "user_href": "/profile/Sujata-Agarwal-18"
                },
                {
                    "user_id": "Prem Singh Rajput",
                    "user_href": "/profile/Prem-Singh-Rajput-35"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Fortuna",
                "href": "/profile/Steve-Fortuna"
            },
            "answer_text": "Trade barriers and tariffs effect the products I buy, what I can afford and how much I work to pay for them. Tax policy and social safety net programs determine what occupations I may pursue to achieve my goals. Environmental policy determines where I may safely choose to live and travel. Civil Rights law determines whether I speak or remain silent, or if I stay a US citizen or emigrate to another nation Economic policy, citizen engagement, foreign policy and criminal law influence whether or not I risk bringing children into the world. just a few off the top of head. In actuality, every human interaction we have is colored in some way by political and economic systems we often take for granted. If we lived under a monarchy and were forced to bow daily to our liege, would we be hanging out at Starbucks so long? ",
            "date": "Answered September 21, 2018",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sam Alayev",
                "href": "/profile/Sam-Alayev"
            },
            "answer_text": " At the moment, I am living in Austria and have been a citizen of Germany since 2016 (German nationality law allows the German diaspora from foreign countries to return to the homeland and be automatically granted citizenship upon arrival). However, before my immigration to Germany and later to Austria, I was living in Central Asia, in Kazakhstan. You've probably learned in your geography class that Kazakhstan, along with many other central Asian countries was part of the former USSR. During the Stalinist regime, northern Kazakhstan and Siberia were known for their gulags (labor camps). The general population of Kazakhstan isn't only compromised of Russians and Kazakhs, but many other nationalities, such as Turks, Koreans, Germans, Poles, Ukrainians, etc. Nevertheless, the country is politically and economically unstable. When I immigrated in 2014, the dollar exchange rate in relationship to the national currency changed 3-4 times since 2003. Currently, 400 Tenge (national currency) is 1 Euro. In 2008, 1 Euro was equal to 150 Tenge. The average monthly salary in the capital city is 200,000 Tenge, which is 500 Euros. To rent a 1 bedroom flat outside of the city, it would cost at least 150-200 euros. You get the point. Furthermore, after the fall of the Soviet Union, the Russian (European) population was largely reduced because many of them were literally forced out of the country, but to this day there are still 3 million Russians comprising the general population. Overall, the reason my parents decided to leave is because of racism and corruption (you can bribe almost anyone here). If you're non-Kazakh / non-Muslim, it's harder to acquire a decent paying job, building a business or getting into university. Undoubtedly, Kazakhstan is developing faster than any other country in Central Asia, but it still has a long way to go. I want to have a future that's more stable. I don't want to live in a country where I have to fear for my financial and physical wellbeing. Cheers, SD ",
            "date": "Updated August 29, 2018",
            "views": "14",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Janice Mae Uy",
                    "user_href": "/profile/Janice-Mae-Uy"
                },
                {
                    "user_id": "Sam Smith",
                    "user_href": "/profile/Sam-Smith-1138"
                }
            ]
        },
        {
            "author_info": {
                "name": "Will Wagner",
                "href": "/profile/Will-Wagner-11"
            },
            "answer_text": "IMHO politics is having a psychological effect on millions and millions of people just here in the states. It is a cliche that politics is like a drug. The most disturbing thing to me is the anger and hatred. It is disturbing because it is tearing the country apart. Since the presidential election with the loss by Ms. Clinton there is serious mental health issues of millions. The hate of President Trump has set loose an inability to think rationally among liberals. Hate of this type freezes the mind so that it can't process. ",
            "date": "Answered April 1, 2018",
            "views": "901",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Santhosh R N",
                "href": "/profile/Santhosh-R-N"
            },
            "answer_text": "I told my son, “You will marry the girl I choose.” He said, “NO!” I told him, “She is Bill Gates’ daughter.” He said, “OK.” I called Bill Gates and said, “I want your daughter to marry my son.” Bill Gates said, “NO.” I told Bill Gates, My son is the CEO of World Bank.” Bill Gates said, “OK.” I called the President of World Bank and asked him to make my son the CEO. He said, “NO.” I told him, “My son is Bill Gates’ son-in-law.” He said, “OK.” This is exactly how politics works . . . ",
            "date": "Answered August 3, 2016",
            "views": "36",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "N. Dileep",
                    "user_href": "/profile/N-Dileep-3"
                },
                {
                    "user_id": "Aswathi Ashok",
                    "user_href": "/profile/Aswathi-Ashok-4"
                },
                {
                    "user_id": "Avi Kumar",
                    "user_href": "/profile/Avi-Kumar-21"
                },
                {
                    "user_id": "Vipul Kaushal",
                    "user_href": "/profile/Vipul-Kaushal-13"
                },
                {
                    "user_id": "Win Moe",
                    "user_href": "/profile/Win-Moe-6"
                },
                {
                    "user_id": "Mohammed Usama",
                    "user_href": "/profile/Mohammed-Usama-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zee Hamid",
                "href": "/profile/Zee-Hamid-2"
            },
            "answer_text": "People feel comfortable making statements about politicians they’d never make about anyone. In our culture, politicians are dehumanized. That can be hard for a politician’s loved ones (or for politicians themselves). On the other hand, if you hold an office you have the power to make a difference in someone’s life. That can be incredibly rewarding. ",
            "date": "Answered June 21, 2018",
            "views": "14",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ashley Garcia",
                    "user_href": "/profile/Ashley-Garcia-409"
                },
                {
                    "user_id": "Sam Smith",
                    "user_href": "/profile/Sam-Smith-1138"
                },
                {
                    "user_id": "Prabhjot Kaur",
                    "user_href": "/profile/Prabhjot-Kaur-180"
                },
                {
                    "user_id": "Nasser Nasser",
                    "user_href": "/profile/Nasser-Nasser-35"
                },
                {
                    "user_id": "Wade Spencer",
                    "user_href": "/profile/Wade-Spencer"
                },
                {
                    "user_id": "Athena Walker",
                    "user_href": "/profile/Athena-Walker"
                },
                {
                    "user_id": "Luke Lyle",
                    "user_href": "/profile/Luke-Lyle-2"
                },
                {
                    "user_id": "Keevan Martanto",
                    "user_href": "/profile/Keevan-Martanto"
                },
                {
                    "user_id": "Sarah Seton",
                    "user_href": "/profile/Sarah-Seton"
                },
                {
                    "user_id": "Colin Mcdermott",
                    "user_href": "/profile/Colin-Mcdermott-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Miz Mizi",
                "href": "/profile/Miz-Mizi"
            },
            "answer_text": "It is an common view that politics is unrelated to everyday life. It is related to politicians, legal and official business that the average person knows nothing about, and should not bother with. It’s an unfortunate view because politics is about life. Governments make decisions that affect our everyday life.  Politics effect our everyday life no doubt. ",
            "date": "Answered June 19, 2015",
            "views": "679",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Pedram Moallemian",
                    "user_href": "/profile/Pedram-Moallemian"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sarah Irene Lambrecht",
                "href": "/profile/Sarah-Irene-Lambrecht"
            },
            "answer_text": "I can’t add more to what has already been said. I will say that it is unfortunate that there is so much rancor and mud slinging over politics in daily life. This did not used to be the case. Citizens should accept that others have different beliefs on governance and allow our processes to work as intended. ",
            "date": "Answered September 25, 2018",
            "views": "306",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sam Smith",
                    "user_href": "/profile/Sam-Smith-1138"
                }
            ]
        },
        {
            "author_info": {
                "name": "Solomon Wang",
                "href": "/profile/Solomon-Wang"
            },
            "answer_text": "Dictates the laws of the country, the external reality you live in. Properties of Reality ",
            "date": "Answered March 21, 2014",
            "views": "12",
            "upvotes": "0"
        }
    ]
}