{
    "title": "How can we determine property lines? - Quora",
    "tags": [
        "Property Lines",
        "Property Management"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Rex",
                "href": "/profile/Robert-Rex-7"
            },
            "answer_text": "The property lines of your property will be shown on a survey that was done on your property. The survey will show items such a exactly where your house is located on the property, how far away from the street it sits, fences that have been permanently installed, any out buildings, etc. The surveyor’s description of the property will include a fixed point (such as a piece of pipe) that’s been placed to act as a reference point on your property. From that reference point, you’ll measure the distances shown on the survey. The survey will also show any easements to the property. Easements occur when an owner allows others to access his property, such as when an owner allows a utility company to install power lines, either overhead or underground. Although it’s still your property, they get a unique “pass” to get on the property to maintain the lines, etc. You have special rules to follow if you’re going to place a fence on the property, so you can’t block their access—but it’s still your property (at least here in Louisiana. A survey was most likely done when you purchased the property, so check in your closing documents. If you can’t locate it there, you can also check in the county records department. A survey was mostly likely done when the property was built or when a previous owner bought the house or when a modification (such as adding a carport or driveway) was done. ",
            "date": "Answered January 12, 2019",
            "views": "937",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Geoff Parsons",
                "href": "/profile/Geoff-Parsons-3"
            },
            "answer_text": "The law of England gives several ways of ascertaining the boundary line of land. In a real situation you would probably best be advised to obtain a) the professional opinion of a lawyer or surveyor who specialises in the subject.or B) a Land Registry determination Briefly the following may give some of the sources and clues Boundary markers On the ground, walls, fences, and other boundary markers may give evidence of the likely position of the legal boundary. Documentary evidence Historic evidence may be given land grants, Wills, conveyance deeds, tithe maps, enclosure statute schemes, compulsory purchase documents, etc. Some of this material may go back hundreds of years. Legal presumptions A judge will use established legal presumptions to determine the position in the event of a legal dispute. These are “rules” established in case law. Official determination A Land Registry team offer (or may have already made) a plan for the purpose. See Practice guide 40: HM Land Registry plans, supplement 4, boundary agreements and determined boundaries Edit Party Walls (30/12/19 If your property is a building attached to another or is a flat etc, in England you need to consider the property line within or at the “party wall”. That is, at the join of two or more buildings. This is a matter of statute and too complex to elucidate here! ",
            "date": "Answered November 30, 2019",
            "views": "152",
            "upvotes": " View Sharers ",
            "upvoters": [
                {
                    "user_id": "Debora Norz",
                    "user_href": "/profile/Debora-Norz"
                },
                {
                    "user_id": "Mohammed Saiful Alam Siddiquee",
                    "user_href": "/profile/Mohammed-Saiful-Alam-Siddiquee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Mcmurray",
                "href": "/profile/Dave-Mcmurray-6"
            },
            "answer_text": "Hire a surveyor: That’s exactly what they do, and they are well paid for it as well. —-When a property is surveyed, the corners are marked with steel pins, usually well buried, and the information filed with a local “registry” office. When the property is “resurveyed”, the surveyor first tries to locate these pins (or the pins of an adjacent property) but they frequently don’t survive, so the location must be re-established—which the surveyor does, in relationship to other properties and geographical features. Once these subterrainian pins are located, it is easy to re-establish the property lines using either stakes and strings, or paint on the ground. When you purchased your property, you probably were given a paper copy of the survey, which will show you where the property corners were, in relationship to other features—such as neighbouring houses, or buildings already on the property. These points should be taken with “a grain of salt”, as buildings have often been modifed, so needless conflicts ofte occur between neighbours. It is worth noting that NOTHING agreed between neighbours is legally binding, as it is the “official” survey, filed in the registry office, is the only thing that counts—-and you need a surveyor (and probably two lawyers as well) to have that “officially” changed. ",
            "date": "Answered November 25, 2019",
            "views": "227",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Logan Higinbotham",
                    "user_href": "/profile/Logan-Higinbotham"
                }
            ]
        },
        {
            "author_info": {
                "name": "Judith Sharp",
                "href": "/profile/Judith-Sharp-1"
            },
            "answer_text": "For purposes of this answer, I’m going to assume you already own the property and there has been a dispute with a property owner next to you over the property lines. When you bought your property, you likely had an attorney prepare documents for you and handle the closing (or a title insurance agency who handles settlements). My first thought would be to contact the attorney or the settlement company and ask if the title to the property contained a recent plat which shows the property lines. Most lenders (if you borrowed funds to finance your purchase) also require a recent survey if there is none in the chain of title. If the lender required one, there should be iron or wood posts at the corners of the property to indicate the property lines. If there was no recent survey (plat) made, or no recent ones in the chain of title, your next move would be to contact a surveyor to have one prepared. The surveyor will first look in his own records to see if he has ever surveyed your property before or any adjacent property. Following that, he will visit the courthouse and look through the chain of title to ascertain the property description as well as looking for any plats ever made. When he comes to your property, he will then mark the corners of the property and afterward prepare a paper copy of the plat for you. You can also visit the courthouse where deeds and plats are recorded to look for any recent plat/survey. The employees at the courthouse will help you get started on your search. However, keep in mind that the property owners adjacent to your property may have had surveys prepared without reference to any on your property. If you do not review all of the records of yours and your neighbors, you may not get a full picture of the real situation. Although you can visit your county/city’s real estate office to see if they have marked the property lines, you should not rely on their markings unless they note it was taken from a recorded plat. Even if they reference a recorded plat, many things can happen after a plat is recorded that would affect property lines and the county/city may not have updated their records. I would only use the government’s information as a starting place, not the final authority on the lines. Good luck! ",
            "date": "Answered January 26, 2017",
            "views": "400",
            "upvotes": " Answer requested by Anicole Resendez",
            "upvoters": [
                {
                    "user_id": "Andrea Morrow",
                    "user_href": "/profile/Andrea-Morrow-2"
                },
                {
                    "user_id": "Judith Sharp",
                    "user_href": "/profile/Judith-Sharp-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joe Folsom",
                "href": "/profile/Joe-Folsom"
            },
            "answer_text": "If you want indisputable and absolute legal accuracy, you need to order a survey. They will mark the corners and or the line depending on what you ask them to do. If you want to find the lines and be close but not perfect there are GPS’s and even apps for your phone that will give you a pretty good idea where the lines are. As a Broker/Realtor, I use a Garmin DriveTrack to show my clients were the lines are on a tract of land. It also identifies the owner of the parcel. Here is a link with more info: Garmin DriveTrack™ 71 | GPS Dog Tracker | Garmin . Alternatively, a few apps that will work on your phone include OnX Hunt or LandGlide (both cost $99/year vs. a one time cost for the Garmin DriveTrack of $400 for the device and $120/per state for the GIS Mapping for the state/s of choice. ",
            "date": "Answered December 15, 2019",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dave Sutton",
                "href": "/profile/Dave-Sutton-31"
            },
            "answer_text": "You should be able to get a map from your local taxing authority (probably your county in the U.S.) as a starting point. Also, in the deed you got when you bought the home, there is a legal description. Typically they start from a point (hopefully a survey marker) and describe the distance and direction to the next corner, and from there to the next, eventually having covered all the property lines (typically four) of your lot. In an ordinary city lot, you’ll be able to see that the dimensions are 50 x 100 feet, for example and that will help you both finding the survey marker and visualizing the property lines. One difficulty is finding that first survey marker. If it’s still there, it’s probably buried under of few inches of dirt. Some have a top that describes (usually in latitude & longitude) their location. Others are just simple metal bars (think something like rebar) driven into the ground. The description from the deed will make more sense if you know where that marker is and can trace the imaginary property line(s) from there. Ultimately, if it’s important enough, you may have to hire a professional surveyor ($500 and up). ",
            "date": "Answered November 30, 2019",
            "views": "94",
            "upvotes": " Answer requested by Anicole Resendez",
            "upvoters": [
                {
                    "user_id": "Mohammed Saiful Alam Siddiquee",
                    "user_href": "/profile/Mohammed-Saiful-Alam-Siddiquee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Ciarrocchi",
                "href": "/profile/Peter-Ciarrocchi"
            },
            "answer_text": "First, you can walk the boundary as described within your deed documents. If this is too confusing, then you must hire a surveyor to find the markers, or in some cases, lay down replacement markers. New England is notorious for metes and bounds description for property lines. Unfortunately, the old oak tree that marks the end point at three hundred paces SE of the rock wall that runs along Shady lane for four hundred and twenty-one paces North . . . has died, the road is now a two lane paved highway, which entailed removing the rock wall . . . The United States government eventually converted to the far saner Public Land Survey System, which with todays global positioning technologies can be very accurate establishing actual boundaries. Anyone tech savvy may be able to get a good idea where their property lines are physically, but, if you are having a neighbor dispute, you will need an actual licensed surveyor’s report as verifiable evidence to mutually settle/litigate your differences. ",
            "date": "Answered November 30, 2019",
            "views": "241",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Rick",
                    "user_href": "/profile/Rick-684"
                },
                {
                    "user_id": "Maura Rudd",
                    "user_href": "/profile/Maura-Rudd"
                }
            ]
        },
        {
            "author_info": {
                "name": "Darlene Humphreys",
                "href": "/profile/Darlene-Humphreys"
            },
            "answer_text": "In most areas of the US, you can get access to a plat map. A plat map will show you the property lines and if survey pins are in place. If you can find a survey pin on your property, or on a nearby property, you can use the plat map dimensions to determine property lines. If you are doing this for the purposes of building a house or other structures, you are going to want to employ a surveyor to mark the boundaries and any other areas of concern. I have been involved in situations where a well meaning home owner put a building in an easement or too close to a property line and the resolutions to these situations are VERY limited. This is not a place to rely on a “do it yourself” approach. ",
            "date": "Answered January 21, 2017",
            "views": "151",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sandy Paonessa",
                    "user_href": "/profile/Sandy-Paonessa"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frank R. Chappell",
                "href": "/profile/Frank-R-Chappell"
            },
            "answer_text": "You can do the following: Look for natural boundary markers. A lot of property owners plant tree lines or shrubbery in the past where known property lines exist. Fence lines also can denote this.Look for axles or poles. Many properties I've come across have buried axles, metal poles, or drive shafts at the corners of their boundaries. Buried axles are strange tradition, but I've seen it many times.Go to your local courthouse. You can look up the deeds for properties there and find your exact property lines. However, many older deeds may list properties using a metes and bounds system that can be confusing. Originating in England, this system uses large geographical features on the site to describe the property boundaries. Typically, there is a point of origin followed by directions around the property lines that end once again at the same primus point. It may to something like, “Beginning at the large Oak stump and moving Southeast 200 feet to the curvature of the lane and turning then turning West and walking 100 yards adjacent to the tree line…”If all else fails, just ask your neighbor… ",
            "date": "Answered February 5, 2017",
            "views": "398",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bill Milner",
                "href": "/profile/Bill-Milner"
            },
            "answer_text": "Can you find the pins? How about a survey? You stand on a pin, a friend on another. Mark it with little flags from the hardware. Repeat. No docs? no pins? Go down to the county Planning and Zoning Department. See what they can provide. Look at old buy/sell documents. Look for the Assessor Number. Title companies can help. If you are selling the property, they will build a Listing Package with whatever is recorded at the county. No Charge. However, you should use them for your closing. Selling Title Insurance is how they get paid. Closing fees are very small but it’s something. If you can find the name of a previous surveyor, they are a good source of info. Ask them to mark the pins. You probably don’t need a new survey. All surveyors will provide assistance for a reasonable price. The due diligence is the burden of the buyer but sellers want to sell. Ask them what help can they offer. ",
            "date": "Answered February 3, 2017",
            "views": "189",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Edward T Harris",
                "href": "/profile/Edward-T-Harris-1"
            },
            "answer_text": "Depending on how large the property is… Find a survey company and ask them to put wood or metal stakes at the corners, boundaries. This in the USA will cost you about, $500.00 - $700.00 for a standard size lot, ie, 80 X 180. If you have acreage and they are surveying one side of two 40 square acres… about $2,000.00. It will go up from there. Needless to say, they will come out and make sure they understand exactly what you want them to do, (don’t discount the fact they may charge you a service call). Once they completely understand you will need to pay them upfront unless you have an account with them. I have had many residential lots done without stakes, they are rare today, but commercial, off and on. Back 20++ years ago a typical mortgage survey was $79–$90.00, no stakes. Picture of the property a sketch, print. Typically 3 copies. The last commercial office, about 5,000 sf, one story and a parking lot of about 3 acres. Then 3 sets of blueprints, no stakes, $2,650.00. If you want it just to have it, they will be glad to take your money. Unless you are in dispute over a property line, save your money. ",
            "date": "Answered November 24, 2019",
            "views": "50",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Timothy Collier",
                    "user_href": "/profile/Timothy-Collier-20"
                }
            ]
        },
        {
            "author_info": {
                "name": "Weldon Dunlap",
                "href": "/profile/Weldon-Dunlap"
            },
            "answer_text": "Find your deed record or plat record. The deed will identify the property in meets and bounfs Go to a surveyers office and have them read the plat. Usually it will say somethimg like this begining at fence post located on the nortwest corner and continuing in an easterly direction to a permant survey referece post herein identified as reference post 123 of the survey of record bieng the martin stance survey as recoded in book 9 page 23 of the survey records of tom dumb dumb county and continuing thence in an eastwardy diction 126 feet thence to a marker identified as survey pin 107 thence ……okay in lamans terms its 126 feet between 2 idntified survey marks.or the posts in your backyard Generally county records are referenced. ",
            "date": "Answered January 26, 2017",
            "views": "83",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Kotsch",
                "href": "/profile/John-Kotsch"
            },
            "answer_text": "Only a licensed surveyor can determine legal property lines.  Our family was lucky.  When we moved to PA we purchased a new home and the property stacks were still in the ground which quickly ended a shot but angry exchange with our new next door neighbor.  You can find out the physical size of your property by reading your deed but locating the pins may be another story. ",
            "date": "Answered January 31, 2017",
            "views": "71",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paul A Michaels",
                "href": "/profile/Paul-A-Michaels"
            },
            "answer_text": "I had a house located on a curve in the road. My neighbor and I had a dispute about exactly where the property line was (there was dead tree that needed to be removed and we had to figure out who was responsible for the cost of cutting it down.) So we called in a surveyor, It turned out that the tree was on my property but the entrance to his driveway was also on my property. So we made a deal. I deeded to him a small triangle of land that included both the tree and the entrance to his driveway. The deed was recorded and the property lines adjusted on the official county map and he paid for the tree removal. ",
            "date": "Answered May 28, 2019",
            "views": "85",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vincent Trupia",
                    "user_href": "/profile/Vincent-Trupia"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Archambault",
                "href": "/profile/John-Archambault-3"
            },
            "answer_text": "If you are a party to the last transaction involving the house, you might have paperwork that includes a survey map. if not, these days a lot of Property Appraiser offices put property information online, some with a map of each parcel. If not you may be able to get a map at the office, or if worst comes to worst, pay for a survey. Del, M.S.,J.D., Lic. Real Estate Broker…NO legal advice is intended. ",
            "date": "Answered March 24, 2018",
            "views": "69",
            "upvotes": " Answer requested by Bonnie Kelpe",
            "upvoters": [
                {
                    "user_id": "Rick",
                    "user_href": "/profile/Rick-684"
                },
                {
                    "user_id": "Linda Hlynka",
                    "user_href": "/profile/Linda-Hlynka-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim McFarlane",
                "href": "/profile/Jim-McFarlane-8"
            },
            "answer_text": "In a neighborhood with small lots, old fences are generally a good indicator (plus/minus a foot) of property lines. Also utility poles and utility boxes on the ground tend to be near the property line. Your deed will show the length and width of your lot, but finding a corner (anyone’s corner) to start measuring from is often tricky. Or $500 for a survey. ",
            "date": "Answered May 30, 2019",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stevie Wilson",
                "href": "/profile/Stevie-Wilson"
            },
            "answer_text": "You find a local surveyor. If your city or county has a building permits department ask them to recommend a couple of good surveyors. They are not inexpensive but it’s much better and faster than having a lawsuit over property lines. ",
            "date": "Answered November 18, 2019",
            "views": "16",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vincent Trupia",
                    "user_href": "/profile/Vincent-Trupia"
                },
                {
                    "user_id": "Ashley Avallone",
                    "user_href": "/profile/Ashley-Avallone-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kimberly Hildreth",
                "href": "/profile/Kimberly-Hildreth-1"
            },
            "answer_text": "Best way to determine property lines is through the city. Usually there is a parcel map search available on-line which would should you your property lines. Also when you close on your home title company should provide this map to you as well. ",
            "date": "Answered January 26, 2017",
            "views": "64",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert J Jordan",
                "href": "/profile/Robert-J-Jordan"
            },
            "answer_text": "The only way to see the location of your property lines is to hire a survey firm to retrace the boundaries and mark them with wood stakes. You may also want them to locate all the structures (dwelling, garage, sheds, fences, driveway etc.) on your property and produce a plan illustrating the ptoperty line setback distances. ",
            "date": "Answered May 21, 2018",
            "views": "84",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Linda Hlynka",
                "href": "/profile/Linda-Hlynka-1"
            },
            "answer_text": "There are usually spikes driven into the ground at the corners of your property. If there is doubt, either ask for the real property report on file at your municipality or county or hire a surveyor. ",
            "date": "Answered May 27, 2019",
            "views": "17",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vincent Trupia",
                    "user_href": "/profile/Vincent-Trupia"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Babiak",
                "href": "/profile/Steve-Babiak"
            },
            "answer_text": "The deed to your property should specify the boundaries of the property. In the USA, a licensed surveyor can identify the exact property perimeter and place markers at various points on the perimeter to let the owners on each side of the boundary know where their property ends. ",
            "date": "Answered September 8, 2019",
            "views": "20",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Christopher Ludwig",
                    "user_href": "/profile/Christopher-Ludwig-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Glenn Still",
                "href": "/profile/Glenn-Still"
            },
            "answer_text": "anytime you want to be exact you will need a survey company to mark the corners with flags. For a very rough guide- you probably got a paper survey plat when you bought the house and you can look at that. With that and various landmarks you or a friend can guess at the corners. ",
            "date": "Answered May 26, 2019",
            "views": "34",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rick",
                    "user_href": "/profile/Rick-684"
                }
            ]
        },
        {
            "author_info": {
                "name": "Devon James-Muhammad",
                "href": "/profile/Devon-James-Muhammad"
            },
            "answer_text": "get a survey of the property go get the original survey and give it to the survea and let them put stakes out and mark your property. fences make good neighbors. ",
            "date": "Answered September 8, 2019",
            "views": "8",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Christopher Ludwig",
                    "user_href": "/profile/Christopher-Ludwig-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joaquin Roibal",
                "href": "/profile/Joaquin-Roibal"
            },
            "answer_text": "Check your property’s boundaries using a parcel map at the County Assessor where your property is located. Also you were provided a plat when you purchased your home / property. You can pay for a professional surveyor to find / mark your property bounds. ",
            "date": "Answered September 7, 2019",
            "views": "37",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Amelia Gray",
                "href": "/profile/Amelia-Gray-30"
            },
            "answer_text": "By looking up your house online and seeing where the lines are or ask the brooker who sold you the house for the blurprints… They should have them but might charge you for them. ",
            "date": "Answered April 28, 2019",
            "views": "17",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Julie Smith",
                "href": "/profile/Julie-Smith-94"
            },
            "answer_text": "Although I haven’t used it yet, you might want to try a phone application called Homesnap.  If that doesn’t work. Try using these directions. https://propertylinemaps.com/p/pdf-cell-phone-find-property-lines.pdf ",
            "date": "Answered November 24, 2019",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Desiree Hamilton",
                "href": "/profile/Desiree-Hamilton-13"
            },
            "answer_text": "A very easy way is to check with your city's records. Afterwards you may want to get a surveyor out to officially mark out the property lines for you. ",
            "date": "Answered May 26, 2019",
            "views": "19",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Lex Rajah",
                "href": "/profile/Lex-Rajah-1"
            },
            "answer_text": "You may check with your city or town for your property info. Most of the cities in North America (excluding Mexico) have this information available on their site. ",
            "date": "Answered January 21, 2017",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mike Lalji",
                "href": "/profile/Mike-Lalji-1"
            },
            "answer_text": "You look for a company that is in the business of surveying of land. You then instruct them to prepare a Real Property Report (RPR) with a compliance certificate. That document will have all the information in it. Hope that I've answered your ",
            "date": "Answered November 30, 2019",
            "views": "35",
            "upvotes": " Answer requested by Anicole Resendez"
        },
        {
            "author_info": {
                "name": "Ian Nisbet",
                "href": "/profile/Ian-Nisbet-6"
            },
            "answer_text": "Log on to the Land Registry and get a copy. Your property boundaries ",
            "date": "Answered April 28, 2019",
            "views": "30",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Stephen Leader",
                "href": "/profile/Stephen-Leader-4"
            },
            "answer_text": "Erect a fence. If your neighbour sues you then you know that's not the boundary. I am sure your neighbour will then tell you where the boundary is. ",
            "date": "Answered December 15, 2019",
            "views": "12",
            "upvotes": "0"
        }
    ]
}