{
    "title": "How can schools teach students 'how' to think for themselves & not 'what' to think? - Quora",
    "tags": [
        "Teaching",
        "Students",
        "Schools"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ilona Juhanson",
                "href": "/profile/Ilona-Juhanson-1"
            },
            "answer_text": "Nobody holds the monopoly on truth. Everyone’s truth is up to them, and you don’t get to tell anyone what to think. What you can do is teach them facts. Give them as much information as you can in order for them to be able to decide for themselves. Was Hitler bad? Sure. But why? It’s no use knowing something if you can’t elaborate on it. If you only learn the rules and not why those rules were created or what purpose they serve, you’ll be in a difficult place in a non-standard situation. A lot of life is non-standard. You can’t have a rule for every single thing - too much to remember. It’s easier to give people tools to help them think for themselves in the right direction. So, I can tell my brother that doing A to others is wrong, or don’t do B, and eventually the list will pile up until he can’t even remember what A was or when it isn’t allowed. Instead, I tell him - if you do A, A will be done to you. He is now motivated to think for himself in any situation: “do I want this done to me what I’m about to do?”. By letting people think for themselves, you relinquish control over what others think. This is scary for people who are authoritarian or prefer dogmatic practices. Tough titties. Anyone intelligent enough will eventually come to the conclusion that it’s less effort and more reliable to give people tools and show them how to use them. You can now leave them alone and be fairly certain they won’t burn the house down. When I’m teaching a new thing in chemistry to my students, I like to explain why it is important to know, what you can use it for and, if I remember, how people came to such a conclusion. I don’t care about them memorizing shit. I care that they think. No country has a use for an ignorant populus, and a country that does isn’t likely to be a democracy - by definition, if you’re going to be governed by the people, the people ought to know their shit. ",
            "date": "Answered June 28, 2018",
            "views": "600",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gasi Emmanuel",
                    "user_href": "/profile/Gasi-Emmanuel-1"
                },
                {
                    "user_id": "Dave Petway",
                    "user_href": "/profile/Dave-Petway-1"
                },
                {
                    "user_id": "Téa Caragao",
                    "user_href": "/profile/Téa-Caragao"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathaniel Brown",
                "href": "/profile/Nathaniel-Brown-6"
            },
            "answer_text": "I teach Computer Science and I've been struggling with how to teach students to “problem solve”. I've read lots of research, tried lots of things and as far as I can tell, I cannot teach “problem solving”. I can only help students to figure it out by themselves. Here is what I can do: I can show students how to solve a lot of common problems.I can give students problems that slowly get harder.I would say the same is true of most “how” things. I can teach “what”. I can only facilitate and encourage students to learn “how”. If students don't want to learn then I can force them to learn “what” but for “how” there is nothing I can do. ",
            "date": "Updated May 7, 2020",
            "views": "127",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Gasi Emmanuel",
                    "user_href": "/profile/Gasi-Emmanuel-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lynn Bryant",
                "href": "/profile/Lynn-Bryant-20"
            },
            "answer_text": "The brain thinks for us as babes (crawl before walk; walk before run; cry for help; coo for attention). It is trained further through positive or negative re-inforcement. A baby crawling may chew on a roach. If the baby thinks it’s nasty; he won’t eat it again. He may eat ice-cream, like it if he thinks it tastes good. Touch a hot surface, not like the pain. If he receives love, learns to love. If he receives kindness, learn to be kind. Reading to a child, even when it is in the womb is great preparation. It is crucial for a child to play. Later on do chores and receive rewards. To strengthen thinking skills- technology has become crucial with the utilization of interactive reading, math, science, math, etc., and brain game exercises, which drives their thinking. Scaffolding of questions, highly engaging group discussions, brain storming and use of the “scientific method” helps with this monumental task. When babes and kids do not receive adequate nutrition, or feel neglected, they cannot focus on learning. The basic need for survival (food, love, shelter) will undermine the child’s maximum potential. ",
            "date": "Answered June 28, 2018",
            "views": "296",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Téa Caragao",
                    "user_href": "/profile/Téa-Caragao"
                },
                {
                    "user_id": "Chris Trumbel",
                    "user_href": "/profile/Chris-Trumbel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ilango Sivaraman",
                "href": "/profile/Ilango-Sivaraman"
            },
            "answer_text": "In my experience, the school teachers and the education system supports mainly the right conventional answers and not innovative answers. In Fact, if the answer sounds different, it is perhaps ignored. The teachers are to be trained to appreciate and to highlight unique and different points of views. If such examples are often read out for the diverseness and dissimilarity of the new perspectives, the children would also realize the importance of thinking for oneself instead of following the beaten path. ",
            "date": "Answered July 3, 2018",
            "views": "147",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Barath Surendran",
                    "user_href": "/profile/Barath-Surendran"
                }
            ]
        },
        {
            "author_info": {
                "name": "Louis Villa",
                "href": "/profile/Louis-Villa-4"
            },
            "answer_text": "Experiential learning. Let them learn by feel sight and sounds and make decisions for themselves based on their inferential learning. This maybe expensive since it might require a lot of field trips. Ask probing questions that require critical thinking. This is important in science and mathematics. Encourage student centered learning where the focus of instruction shifts from educator to student. ",
            "date": "Answered June 14, 2019",
            "views": "66",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Gasi Emmanuel",
                    "user_href": "/profile/Gasi-Emmanuel-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Louisa Jetta",
                "href": "/profile/Louisa-Jetta"
            },
            "answer_text": "Schools? Who is raising these kids? Kids are at school about 6–7 hours a day (out of 24 hours.) Children do not attend school on the weekends or in the summer. A better question would be… “How can parents teach their children to think for themselves.” Children are most influenced by parents. Parents spend more time with their parents. Parents are the real role models for kids. ",
            "date": "Answered June 27, 2018",
            "views": "91",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gurudutt Mallapur",
                    "user_href": "/profile/Gurudutt-Mallapur"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gurudutt Mallapur",
                "href": "/profile/Gurudutt-Mallapur"
            },
            "answer_text": "Gurudutt Mallapur's answer to If you are taught only \"What to think\" will you be able to learn \"How to think\"? I've already answered this question here and in linked answers in below answer : Gurudutt Mallapur's answer to How can I teach myself to learn anything? See also : Gurudutt Mallapur's post in Learning to Learn (L²L) (Work in progress to collect all my learning/teaching answers in one place) Learning to Learn (L²L) ",
            "date": "Updated September 23, 2018",
            "views": "79",
            "upvotes": " Answer requested by Téa Caragao",
            "upvoters": [
                {
                    "user_id": "Jonathan Sullivan",
                    "user_href": "/profile/Jonathan-Sullivan-10"
                },
                {
                    "user_id": "Téa Caragao",
                    "user_href": "/profile/Téa-Caragao"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Pattison",
                "href": "/profile/Robert-Pattison-13"
            },
            "answer_text": "This is of even more importance in the digital age. There is so much rubbish out there it is essential that people think. We need to ask “why do 'they' say that? “ What is their motivation? However it is a painful process because all of us are products of our culture and upbringing. We don't see that our own outlook colours our view. As a twenty five year old I was told one evening by students in Mumbai that we British are like the camel, our nose is so high in the air we don't see what we put our feet on. Not the view I was brought up with, but we are so indoctrinated by our own culture that we don't stop to evaluate others. ",
            "date": "Answered June 28, 2018",
            "views": "193",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Kyle League",
                "href": "/profile/Kyle-League-2"
            },
            "answer_text": "They could learn from periods of history when teaching was done like that. It won’t really take place until the school system is changed to rate quality of thinking improvement instead of test scores. ",
            "date": "Answered June 26, 2019",
            "views": "22",
            "upvotes": " Answer requested by Téa Caragao"
        },
        {
            "author_info": {
                "name": "Fran Jaime Rivera",
                "href": "/profile/Fran-Jaime-Rivera"
            },
            "answer_text": "Teach the child to find the answer for themselves and discuss it in groups. This means that the child is allowed to find his/her own path to the correct answer. It works beautifully. The problem is it takes time. It’s easier to go the route of the teacher telling the students the correct answers. ",
            "date": "Answered June 26, 2019",
            "views": "50",
            "upvotes": " Answer requested by Téa Caragao"
        },
        {
            "author_info": {
                "name": "Jon T. Landerman",
                "href": "/profile/Jon-T-Landerman"
            },
            "answer_text": "You really think you are going to get an answer here on Quora that will distill down two years of education and training and graduate work in Education Theory in one simple micro essay? Really? ",
            "date": "Answered June 27, 2018",
            "views": "45",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Scott Bauer",
                "href": "/profile/Scott-Bauer-41"
            },
            "answer_text": "Schools don’t teach. Teachers teach. Thinking for yourself is most likely a product of your upbringing. ",
            "date": "Answered June 14, 2019",
            "views": "18",
            "upvotes": " Answer requested by Téa Caragao"
        }
    ]
}