{
    "title": "How to explain that the mind is the self - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Kevin Bar",
                "href": "/profile/Kevin-Bar"
            },
            "answer_text": "Personality and self are this lifetimes expression of our selves that have developed into a higher sixth density social memory complex. Our future self. This is a paradox of our mind that we cannot solve in third density consciousness. I think it will be solvable in the fourth density of consciousness' that many or some of us are now shifting to. I know nothing except that the shift is taking place and I sense the need of unconditional love, self-respect and respect of all others. Mind is a luminous, reflective, illuminating, all pervasive force that is in a state of flux. It develops consciousness so that it has infinite potential. Man is endowed and endows himself with a conscious mind to direct the nature, shape and form of his creations. Woman has a different aspect of mind where she has access to the infinite sea of the unconscious through her wisdom. Man and woman work nicely together when they work nicely together. Man and man can either work nicely together from a perspective of unconditional love, self-respect and respect of others or they clash and work towards controlling. We all live many lives and experience many deaths so that we can make a choice of which path we desire following as we develop into fourth density consciousness or remain in third density. The choice that we make is based on who we “think” that we are and what we desire to create. We make a conscious choice within our mind and either follow it with integrity towards “service to others” and unconditional love or “service to self” with the protection of greed, selfishness and control of others. There is no need of love on the service to self path. ",
            "date": "Answered October 17, 2020",
            "views": "24",
            "upvotes": " Answer requested by Kristenz Galasinao",
            "upvoters": [
                {
                    "user_id": "Kristenz Galasinao",
                    "user_href": "/profile/Kristenz-Galasinao-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Jermey",
                "href": "/profile/Jon-Jermey"
            },
            "answer_text": "The mind is not the self. Your ‘self’ is a physical body which requires food to eat, water to drink, and a safe place to sleep. Your mind is a process going on inside the brain of that physical self. Saying the mind is the self is like saying that combustion is the firepit. ",
            "date": "Answered October 17, 2020",
            "views": "43",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Don J. VanEvery",
                    "user_href": "/profile/Don-J-VanEvery"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Nielsen",
                "href": "/profile/Eric-Nielsen-73"
            },
            "answer_text": "There is the mind associated with the brain. This is very different than the clear light mind of the Buddhist or what the Hindus call Turiya, or the Christians call Nous. These are the highest you. The mind that is called the Soul or Atman. The mind uncluttered by our non-sense which we pile high of our own greatness. This is what is the Veil of Unknowing which keeps us in a false daydream of whom we think we are. Meditate and find the soul and your question will be crystal clear. QUOTE OF THE DAY \"How foolish we are! We often think that we never do all the foolishness and perversities that we see others do; this is why we arrive at the conclusion that we are magnificent persons. Unfortunately, we do not see the foolishness and wretched things we do.\" Samael Aun Weor, Treatise of Revolutionary Psychology ",
            "date": "Answered October 17, 2020",
            "views": "27",
            "upvotes": " Answer requested by Kristenz Galasinao",
            "upvoters": [
                {
                    "user_id": "Kristenz Galasinao",
                    "user_href": "/profile/Kristenz-Galasinao-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jayasree Padmanabhan",
                "href": "/profile/Jayasree-Padmanabhan-2"
            },
            "answer_text": "Mind is not the Self. Mind is just a tool fitted to you, the person to understand the 'total You'- the Self! So, treat it as a tool it is. Something like your phone. Your phone is very important. But it is not your life. Same way, mind is extremely important. It is needed to live a good life and above that understand the total, greater You- the Self! Only through your mind and later through your heart/ intuition, you can totally capture the full You! No, other way. Tough inner work. People are not ready to do that. So, many sit within the mind, thinking they are their mind. For me it took 45 years of education and around 5 years of inner work, deep analysis and contemplation. Now, at 50, I am writing about it. So, again, you are Not your mind! All the very best! Regards, Swaroopa. ",
            "date": "Answered October 17, 2020",
            "views": "44",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Rey Blanco",
                "href": "/profile/Rey-Blanco"
            },
            "answer_text": "If we think of “mind” as “mindful” than the self would be “self ish” whether it is a local individual “I” and/or a non local collective “I.” Being “mindful” may not have anything to do with “intellect” and “intelligence.” CONSCIOUSNESS = AWARENESS OF ‘IT,’ Whatever ‘IT’ is. To be “aware” may also be appetitive, an instinctual “recognition” that prey, for example will satisfy a need for the predator. I don’t even believe that it is necessary to have a definite “mind” because NATURE may operate on its own accord and more or less appears as having a mind of its own when the conditions fall together, even if haphazard. And yet, even with nature, we can understand the existence of it’s self because we actually see it operating according to its own kind that has more to do with it’s own self, not ours. ",
            "date": "Answered October 17, 2020",
            "views": "24",
            "upvotes": " Answer requested by Kristenz Galasinao"
        },
        {
            "author_info": {
                "name": "Jeffrey Werbock",
                "href": "/profile/Jeffrey-Werbock"
            },
            "answer_text": "Words only have useful meanings when many people agree on that meaning. I doubt you will muster a consensus on the meanings of the words “mind” and “self” that they are interchangeable and mean exactly the same thing. My understanding of the common parlance meaning of the word “mind” is the arena of perceptions: thoughts, feelings and sensations, whereas the self is this feeling we have that we exist independently of the environment we are in. The self is based on an illusion, that we are separate entities. In reality we are not separate; there is no border between what we regard as the body and what we regard as the rest of existence. Energy / matter in, energy / matter out. It is one contiguous event. But without that illusion of being a separate entity - the basis for the concept of a self - we (our bodies) cannot navigate our surrounding conditions. The feeling of “I” and the concept of the self are two different things but the general meaning of self is the feeling of “I” rather than some philosophical concept of a self as a separate entity. ",
            "date": "Answered October 17, 2020",
            "views": "25",
            "upvotes": " Answer requested by Kristenz Galasinao"
        },
        {
            "author_info": {
                "name": "Trevor Mommsen",
                "href": "/profile/Trevor-Mommsen"
            },
            "answer_text": "author of MEMOIRES of a SATSANGI ( google kindle ) Kristenz Mind and SELF are two totally seperate entities. Mind is not self, self is not mind. Mind is the receptacle of data gathered by way of the Activity Log ( karma). Mind is not sentient ( not alive ), SELF on the other hand is sentient with a major problem, it falsely identifies with its encasement of the body and mind. Permit me to introduce you to in-depth answers from the book above. Get your copy and learn, read as many times it takes to unlock the casket of knowledge within you, remembering that some books are swallowed, others are tasted, few are chewed and digested. If your attention ( eye ? ) were steady your body would be light. Read, see how its done. ",
            "date": "Answered October 17, 2020",
            "views": "38",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Yon Gardner",
                "href": "/profile/Yon-Gardner"
            },
            "answer_text": "I can explain that the mind is-not the Self. The Self is the un-known energy we term “life” and is all matter, the Earth, planets, water, air, you and your dog. the mind is just part of these bodys we drive round on earth. ",
            "date": "Answered October 17, 2020",
            "views": "13",
            "upvotes": " Answer requested by Kristenz Galasinao"
        },
        {
            "author_info": {
                "name": "Allan Emery",
                "href": "/profile/Allan-Emery-2"
            },
            "answer_text": "If you have a dream in which you take some action, which is the self? The one taking the action or the one dreaming the action is taking place? If it is the first, then the ego is the self. If it is the second, then the unconscious is the self. If it is both, then the mind is the self. ",
            "date": "Answered October 17, 2020",
            "views": "19",
            "upvotes": " Answer requested by Kristenz Galasinao"
        },
        {
            "author_info": {
                "name": "Steven Craig",
                "href": "/profile/Steven-Craig-20"
            },
            "answer_text": "The One collective hive, IS One self. There is no separation as singular thoughts would condition any part of the One to believe. ",
            "date": "Answered October 17, 2020",
            "views": "22",
            "upvotes": " Answer requested by Kristenz Galasinao"
        }
    ]
}