{
    "title": "How to give support to someone who's having a mental breakdown - Quora",
    "tags": [
        "Breakdowns (emotional)",
        "Understanding and Improving Mental Health",
        "Mental Illness",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stacie Marie Carrel",
                "href": "/profile/Stacie-Marie-Carrel"
            },
            "answer_text": "EDIT: If my following assumption is wrong and the person is experiencing a severe episode of a mental health disorder OR is having a psychotic break that may indicate an undiagnosed mental-health disorder, then follow the advice of Barbara Welsh Martin given in her answer. I’m assuming this mental breakdown is a reaction to an overwhelming amount of stress from several directions and/or legitimate fear of something enormously unfortunate, and that the person is neurotypical with no mental health disorders. So with that caveat in mind: Relieve/eliminate as many stressors as possible, at least for the short term. Things like have them take time off from work, send the kid’s to a nearby relative’s house for awhile, find someone to take over hospice care for the elderly parent, etc.Get them into counseling therapy. If the stressed out person is the primary caregiver for someone (or several someones) that are incapable of reliably taking care of themselves, then at least part of the problem can be caretaker-fatigue. SAHM’s have this in spades, but for some reason it’s only acknowledged when the person is caring for someone that’s infirm either physically or mentally. In any case, it’s emotionally and physically draining. There’s a whole branch of therapy that allows the person to vent, discuss conflicting feelings and thoughts, find a support network, and learn coping strategies.Even if the person isn’t a caretaker, the overwhelming stress that caused the breakdown is a very real thing and will benefit with the help of a therapist of some kind.During the time off, take over as many responsibilities as you can: household chores, yard work, shopping, etc. Leave as much room for leisure time as possible for the stressed out person. And encourage them to relax and do things they enjoy, don’t allow them to spend all day in a depressive wallow.If there’s an activity or place that has a calming effect, take a trip there (if the trip won’t incur more stress than the destination will relieve) or make it a point to do the calming activity.Talk about anything and everything. Talking about the issues that caused the mental breakdown and how to fix them long-term is good, BUT don’t let them wallow. If it turns into a pity party or takes a self-defeatist turn, get them to talk about something they enjoy and look forward to. Something that will get them excited and get their mind off their current predicament, then later when they’re in a better frame of mind, the conversation can wander back to solving their problems.",
            "date": "Answered May 10, 2017",
            "views": "48",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ayomide Alasi",
                    "user_href": "/profile/Ayomide-Alasi"
                },
                {
                    "user_id": "Lilly Bordewich",
                    "user_href": "/profile/Lilly-Bordewich"
                },
                {
                    "user_id": "Melissa Latham",
                    "user_href": "/profile/Melissa-Latham-10"
                },
                {
                    "user_id": "Bella Silberstien",
                    "user_href": "/profile/Bella-Silberstien"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Maryjesse-Johnston"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kelly Alan",
                "href": "/profile/Kelly-Alan"
            },
            "answer_text": " First of all, we would like to commend you for trying to support someone in his or her time of need. It demands patience and effort to be able to help someone. As a first step towards it, you should try to understand what a mental breakdown actually is – it is a specific acute time-limited reactive disorder, involving symptoms such as anxiety or depression, usually precipitated by external stressors. The mental illness can be anything — depression, anxiety, bipolar disorder, schizophrenia or something else. For more helpful tips visit: Hooked_Sober The first thing that you need to do is to try and identify the reason behind the concerned individual’s mental breakdown. Is it because of a recent setback or a past trauma? It is important to know the trigger so that you are able to assess the gravity of the situation as well as offer appropriate suggestion/ advice. Remember to be non-judgmental or preachy and be a patient listener. In addition to this, try and create a safe and comfortable environment where the person can open up easily and reassure him/ her that you are going to be there no matter what. However, if you perceive that the condition is only getting worse, encourage them to visit a mental health professional so that if he/she needs medical treatment, one can get the same and recover fast. This is important because, often, the breakdown could be indicative of an underlying mental health condition that needs attention. We wish you luck for your endeavor and hope that now you know what you can do for your loved one. If you have further queries, feel free to post them here or leave your contact details so that our team of experts can connect with you. Hi , Victoria Caroline I hope the answer for your question is helpful to you. Follow below links for more help: 1. Facebook: #AskHookedSober 2. Twitter: #AskHookedSober ",
            "date": "Answered June 12, 2017",
            "views": "22",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ananya Kashyap",
                    "user_href": "/profile/Ananya-Kashyap-2"
                },
                {
                    "user_id": "Karen Brown",
                    "user_href": "/profile/Karen-Brown-253"
                },
                {
                    "user_id": "Chaminda Lal",
                    "user_href": "/profile/Chaminda-Lal-1"
                },
                {
                    "user_id": "Tonmoy Sharma",
                    "user_href": "/profile/Tonmoy-Sharma-1"
                },
                {
                    "user_id": "Khoj Colleges",
                    "user_href": "/profile/Khoj-Colleges"
                }
            ]
        },
        {
            "author_info": {
                "name": "Renee Bream",
                "href": "/profile/Renee-Bream"
            },
            "answer_text": "Bless you! If she has children, help her with child care responsibilities. Help keep her environment clean, uncluttered and attractive (perhaps with fresh flowers, if its a woman). Make sure she has prepared food in the fridge or freezer. Tell her you are so happy to have her as a friend. Hug her and stroke her hair spontaneously. Maybe bring some inspirational books (if she is into those). Ask you if she would like for you to read to her from a book. If a male friend, pat him on the back and be friendly. He could be grouchy. Some men are grouchy when depressed. Ignore it. Bring him food; but don’t overstay your welcome with a guy. Maybe bring some cards, though, in case he feels like playing next time you come by… When your friend seems ready to move beyond home (and after you have found the therapist you feel might be able to help— and is covered by insurance), present that information to your friend and let her know that you would like for her to get more help to feel better from that counselor on such and such a date, at —o’clock. This is how you get your friend to go to therapy. It is all set up for her. You have already helped her greatly. She trusts you. And now she is ready for the next step. If the therapist is right for her, then it will be helpful. If not, you can help her find another. ",
            "date": "Answered May 30, 2017",
            "views": "16",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ayomide Alasi",
                    "user_href": "/profile/Ayomide-Alasi"
                },
                {
                    "user_id": "Lilly Bordewich",
                    "user_href": "/profile/Lilly-Bordewich"
                },
                {
                    "user_id": "Melissa Latham",
                    "user_href": "/profile/Melissa-Latham-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barbara Welsh Martin",
                "href": "/profile/Barbara-Welsh-Martin"
            },
            "answer_text": "Honestly if you are truly aware this person is breaking down then get them to an emergency room immediately..Hospitals have what is called a PESS UNIT..it basically is emergency Psychiatric evil but there is a danger to this situation..and being aware of a breakdown you can only do so much…This person needs professional help to come back to a normality and you do not need to be pulled into a crisis.. ",
            "date": "Answered May 10, 2017",
            "views": "11",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ismaeel Ali",
                    "user_href": "/profile/Ismaeel-Ali-3"
                }
            ]
        }
    ]
}