{
    "title": "How to find a question I have asked - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Tracey Bryan",
                "href": "/profile/Tracey-Bryan"
            },
            "answer_text": "To find your questions, go to the top right of any Quora page, and click on your name. On that page, look at the menu down the left, and click on \"Questions\". Adding relevant topics to your question is one of the best ways to increase the likelihood of getting an answer, so that's a great idea. And it saves the Quora Topic Gnomes some work. :) On the page for your question, you can see on the right hand side that there is a list of topics, and next to \"Topics\" there is an \"edit\" button. When you hit edit, you get a text box in which you can type some words that are relevant to your question, and see topic suggestions. Click on the one you want to add, and repeat. The best topics are broad enough to reach people who can answer the question, but not so broad that the question goes to thousands of irrelevant people, most of whom are likely to ignore it. If you have a question that's really only relevant to the state of Virginia, for example, such as state-specific law, then add \"Virginia\" as a topic, but there's little point in also adding USA, because that simply dilutes you question in the search pool. The Quora algorithm also knows that Virginia is in the USA and adds a USA \"flavour\" to your question to help determine whether it should be given to all followers of that topic. It's pretty smart! Similarly, if your question is specifically about the law surrounding divorce in Virginia, it's more likely that you'll find the right people if you tag it with the specific \"family law\", rather than just \"law\". ",
            "date": "Answered December 13, 2011",
            "views": "32",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Baron Von Gott",
                "href": "/profile/Baron-Von-Gott"
            },
            "answer_text": "Click on your profile picture and you'll see a little toolbar with all your various content.  It's underneath your credentials. Just click on questions. ",
            "date": "Answered February 21, 2020",
            "views": "33",
            "upvotes": "0"
        }
    ]
}