{
    "title": "How does learning philosophy help our lives? - Quora",
    "tags": [
        "Learning About Philosophy",
        "Philosophy of Life",
        "Philosophy",
        "Learning",
        "Important Life Lessons",
        "Philosophy of Everyday Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Wieser",
                "href": "/profile/Daniel-Wieser"
            },
            "answer_text": "Learning something new helps to sharpen our mind (intellect). Learning philosophy is helpful in particular to help you to answer life‘s biggest questions, like: Why are we here? Philosophy itself does not give you the answer to this question, but it might lead you to it (or to a different question like: Why does it matter?) This is helpful for understanding complex concepts and dealing with (everyday) challenges. It also gives you the ability to think further, combining a variety of different topics and finding solutions to problems that may or may not exist today. Our ability to solve problems is not specifically measured by our ability to use existing technology, but the ability to invent something new or to look at it from a different perspective. And most of all: Learning philosophy helps you to overcome ignorance. ",
            "date": "Answered July 12, 2019",
            "views": "40",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ying Wu",
                    "user_href": "/profile/Ying-Wu-51"
                },
                {
                    "user_id": "Françoise Morvan",
                    "user_href": "/profile/Françoise-Morvan"
                }
            ]
        },
        {
            "author_info": {
                "name": "George Backstrom",
                "href": "/profile/George-Backstrom"
            },
            "answer_text": "It is harder for a field such as metaphysics to be useful to our lives than a field of philosophy such as ethics. That is why Socrates, if he existed, gave up metaphysics to pursue ethics. He began on a philosophical pursuit on how to live a good life and what makes a good life through a process of questioning known as the Socratic Method. When you begin to examine life and how it works, you soon become able to harness the mechanisms of life and instead of operating with those mechanisms blindly, therefore often giving rise to unintended results, you give rise to the results you want. This is not to say metaphysics is a useless discipline, because there comes a point when metaphysics start to unravel the mechanics of how life works. This does not usually happen with the metaphysics of philosophy. But it starts to happen with more esoteric philosophy, like the lesson of choosing love over fear. God is perfect love and we are to become more and more God-like. What this means is shedding more and more fear and becoming more and more loving until we come to embody the perfect love of God. ",
            "date": "Answered July 11, 2019",
            "views": "155",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paul Trejo",
                "href": "/profile/Paul-Trejo-1"
            },
            "answer_text": "Aristotle observed that all people naturally desire to Know. The goal of Philosophy was always to increase knowledge, not only of human Ethics, motivations and strategies, but also the Laws of Nature in all its forms. Philosophy in the West was the origin of Western Science. Aristotle wrote the first Western textbooks on Logic, Physics, Astronomy, Botany, Biology, Zoology, Anatomy and Psychology, 2,400 years ago. We are far past Aristotle today, but he was the first, and all our Sciences began with his work. In addition to the Sciences, Aristotle also wrote textbooks on the Liberal Arts, for example, on Metaphysics, Ethics, Rhetoric, Politics, Poetry, Drama and Art Criticism. The problem as I see it, is that the beginning student is overwhelmed by 2,400 years of technical writing. The best option for most students, then, is an overview; a broad survey, in other words, take a course in the long History of Philosophy. That is far easier to handle for the beginner. That will tell you quickly what it's all about, and who the famous writers were, in which century, and their main ideas. Best wishes. ",
            "date": "Updated July 12, 2019",
            "views": "239",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Pramodya Thilakarathna",
                    "user_href": "/profile/Pramodya-Thilakarathna"
                },
                {
                    "user_id": "Harry Holmes",
                    "user_href": "/profile/Harry-Holmes-66"
                },
                {
                    "user_id": "David Hilt",
                    "user_href": "/profile/David-Hilt-4"
                },
                {
                    "user_id": "Yan Cao",
                    "user_href": "/profile/Yan-Cao-35"
                },
                {
                    "user_id": "Michael Criswell",
                    "user_href": "/profile/Michael-Criswell-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Muncy",
                "href": "/profile/Jim-Muncy-3"
            },
            "answer_text": "After magic and superstition and ignorance came religion, which is organized fantasy peppered with moral stories. Then came philosophy, an objective, rational search for truth. It did well, providing many helpful ideas, suggestions, and logical conclusions; it gave birth, in fact, to all the sciences, which specializes in various areas and looks for truth empirically, using theory, evidence, experimentation, and verification. Philosophy stayed on the ground floor, using logic, reason, and argumentation to find or explain big topics like truth, justice, love, beauty, temperance, wisdom, friendship, piety, etc. It’s on the ground floor for a reason: It’s the foundation of all intellectual progress. It makes you think hard, doubt your conclusions, and search for better answers; it’s an endless process, but very rewarding and helpful. Nothing is more fulfilling than knowledge about people, nature, life, existence, death, and god. Total ignorance is not bliss; philosophy shows a way out of the cave of ignorance and into the light. ",
            "date": "Answered July 11, 2019",
            "views": "80",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Richard Martin",
                    "user_href": "/profile/Richard-Martin-421"
                },
                {
                    "user_id": "Cia Parker",
                    "user_href": "/profile/Cia-Parker"
                },
                {
                    "user_id": "Vinicio Hernandez",
                    "user_href": "/profile/Vinicio-Hernandez-5"
                },
                {
                    "user_id": "Yan Cao",
                    "user_href": "/profile/Yan-Cao-35"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marcus Lester",
                "href": "/profile/Marcus-Lester-2"
            },
            "answer_text": "Philosophy is the study of the fundamental nature of knowledge, reality, and existence. I think this study sheds light on many aspects of my life and helps me understand. Of course, some people may find this a boring waste of time. Each to one’s own taste. ",
            "date": "Answered July 11, 2019",
            "views": "63",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Danijar Dreger",
                    "user_href": "/profile/Danijar-Dreger"
                },
                {
                    "user_id": "Yan Cao",
                    "user_href": "/profile/Yan-Cao-35"
                },
                {
                    "user_id": "Bill Hazelton",
                    "user_href": "/profile/Bill-Hazelton-1"
                }
            ]
        }
    ]
}