{
    "title": "How important is it that we are certain about what we claim as knowledge? - Quora",
    "tags": [
        "Knowledge"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Vitols",
                "href": "/profile/Paul-Vitols"
            },
            "answer_text": "For the most part, it’s not very important. Relatively little of what we know counts as certain knowledge, and this is mostly restricted to the realms of mathematics and logic. Also, certainty is a word that has shades of meaning, applying to a feeling of emotional conviction as well as to the objective truth status of a particular proposition. We can feel certain about things that may not be true at all. In living life, the most important attribute of knowledge is not certainty but effectiveness: what helps us to achieve our aims? Knowledge proves itself by helping us do what we want to do. As we live we learn how the world works, and build up a personal knowledge base on the basis of our experience. We learn that water always runs downhill, that the presence of smoke means that something is burning, that cats like to hunt, and thousands of other things that form a personal encyclopedia that we use when planning our actions. None of these things would count as certain knowledge, but they are reliable enough that we are usually willing to base our actions on them. If some piece of “knowledge” plays us false, then we discard it and look for something better. This often happens and is a normal part of living and learning. But in general, the more important an action is to us, the more solid and reliable we want the knowledge to be on which it is based. But knowledge that is solid and reliable is still not the same thing as certainty. Usually our actions, large and small, are based on probabilities, and the process of learning is a matter of discovering the most probable, that is, the most reliable, items of knowledge. Things that are certain are most welcome and we will gladly add those to our knowledge base, knowing that they are going to be keepers forever. But most knowledge is more or less provisional and pragmatic. Knowledge is what works. ",
            "date": "Answered March 10, 2018",
            "views": "378",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nathan Coppedge",
                "href": "/profile/Nathan-Coppedge"
            },
            "answer_text": "Certainty comes in various degrees or ‘types’ depending on what type of claim you are trying to make. I will try to illustrate based on the ‘secret of philosophy’. The secret of philosophy, which I may have been the first to notice, is that philosophy often falls into four categories: 1. Religion, 2. Skeptical philosophy, 3. Empiricism, and 4. Pro-knowledge. If you know of any other major categories, please inform me (oh, there are also a lot of ambiguous people, culminating in someone like Kant or Derek Parfitt, but that is not what I need to talk about, as on an individual topic they might fall into one of the areas, or express a confusing opinion. From a pro-knowledge standpoint, the categories make sense). So, here are the types of certainty: Religion: opinion, good and evil, transformation, infinity.Philosophical skeptics: confusion, irony, sophistication, Socratic.Empiricists: observation, Analytic, philosopher of science, cultured person.Pro-Knowledge: basic examples, logical knowledge, exceptional cases, practical wisdom.I’m sorry this is the best I can do right now—really annoying people are talking in my left ear. ",
            "date": "Answered September 7, 2017",
            "views": "314",
            "upvotes": "0"
        }
    ]
}