{
    "title": "How to find my passion - Quora",
    "tags": [
        "Motivation",
        "Success",
        "Passion",
        "Self-Improvement",
        "Philosophy of Everyday Life",
        "Life and Living",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Animesh Gupta",
                "href": "/profile/Animesh-Gupta-88"
            },
            "answer_text": "Ever say to yourself, \"If I could just figure out what I'm really passionate about, everything else will take off\"? If so, you're not alone. One of the most common stumbling blocks to launching a passion-based life is figuring out what you're passionate about in the first place. Sadly, many of us go about finding our passion in the wrong way. How? By thinking about it. We're habituated to use our minds to analyze, rationalize and figure things out. It's natural yet oooooh so torturesome. Common techniques to find passion include: Taking expensive psychological testsRecalling childhood interestsSitting at Starbucks watching your friend's eyes glaze over after asking questions like \"I don't know...what do you think I should do?\"Here's the problem: Passion can't be found in your head because it lives in your heart. And the flames of passion are fanned by engagement, not thought. Juicy, right? Here's what I mean: No matter how hard you try, you cannot figure out your passion by thinking about it. You need to take action and feel your way to your truth, from the inside out. For example, for years, before I stepped foot in a dance studio, I often wondered about dancing hip-hop. But most of my thoughts sounded like this: \"Wow...dancing professionally would be awesome, but you're too old to get started. Most pros start training when they're 5. You've had zero professional training, and you're already in your 20s. Get real.\" Or, \"It sounds exciting, but dance as a career is crazy and irresponsible. There's no money in that. You studied business finance, so you should do something more stable and related to what you know.\" The endless and debilitating chatter in our minds often tries to talk us out of what our hearts are yearning to explore. The first time I took a class in a professional dance setting, I started to cry (happy tears, of course) because actually doing it felt right. No matter how much I wondered about it before, it wasn't until I physically took action that my real passion (and gift) for dance fully emerged. And from taking action rather than staying in my head, I was able to carve out a little niche for myself in the hybrid world of dance and fitness. Rather than following traditional hip-hop dancer goals (like going on tour with major recording artists or auditioning for music videos), I was asked to become one of the world's first Nike Elite Dance Athletes—a category Nike created after I got started. Not to get too woo-woo on you, but magic really does start to happen when you follow your heart. Embrace this key idea and it will change your life: Clarity comes from engagement, not thought. But taking action on something you suspect to be your passion is just part of the story. There's another important (and rarely discussed) piece to the passion puzzle. And this, my friend, is the fastest, most powerful way to turn what you love into a business or career that can sustain you. Ready? Proactively bring passion to everything you touch, to everything you do. No matter what task is in front of you, bring as much enthusiasm and energy to it as you possibly can. Bring your full attention, your full presence, the Godlike quality that each of us has within, to every task in your day. Whether you're brushing your teeth, making love or cleaning the kitty litter—do it like you want to do it. When you make this shift, you'll ignite business ideas and creative insights far beyond what your thinking mind alone is capable of. And let's face it. Passion is contagious. When you're fully present and passionately engaged with your life, people around you take notice and want in on whatever you're doing. Want more? Another side benefit to proactive passion is kicking life-sucking habits like procrastination, resistance and complaining straight to the curb. Now that you're armed with an understanding of passion, do the following four steps to unleash yours. 4 Steps to Find Your Passion 1. Love everything you do. From this moment forward, if you don't like something, you've got two choices: stop doing it (quit, delegate it, hire it out) OR love it with all your heart. Anything else is madness. When you commit to love everything you do, you strengthen your \"passion muscles\" from the inside out and open up a divine channel so that what you're meant to do can be revealed. Remember, we human beings are creatures of habit. You can't be whiny, complainy and miserable for 80 percent of your day and expect to be enthusiastic and passionate in the last 20 percent. And if you're feeling really stuck on this whole \"finding your passion\" thing, this is the fastest way to get your motor running. Know this: Truly successful people are never the victim of their circumstances. They realize they have ultimate power in any situation and take responsibility for their experience. Don't forget: In any given moment, if you can't change what you're doing, you can always change how you're doing it. 2. Look at your book collection, magazines, DVDs, CDs and credit card statements. Notice any themes? What subjects are you constantly gravitating toward? What are you already spending your time, money and energy on? What thread(s) have been recurring in your life again and again? As best as you can, check in with your heart and physical body, not your head. Anything \"light you up\" so to speak? Do you feel a sense of expansion in your body? Do you feel excitement (or perhaps even a little fear) when you imagine a certain topic or possibility? Those are all good signs. Remember, our passions are often irrational and war with logic and reason. That's why it's important to shift your attention into your heart and your physical body when exploring these questions. Your heart and physical body contain wisdom far beyond the capacity of your mind. 3. What do you love to talk about, learn about and/or teach others about? This is a really useful question. Don't edit yourself here. With nearly 7 billion people on the planet, chances are that there's a market out there hungry for information, products or resources on your topic. Or there's a company looking for someone with your unique set of gifts and interests to join their team. If you're having trouble coming up with ideas, ask close friends and family (the honest ones) what you never seem to shut up about. Also, don't underestimate the power of incorporating your passion into your already existing career or business. You may not need a total overhaul in what you're doing. Maybe you simply need to inject more of what you LOVE into your life right now. For example, Nathalie, a raw-food expert, recently rediscovered her passion for growing trees. Now she's giving a portion of her revenue to not-for-profit tree organizations and is building this component into her existing brand. With that tiny tweak, she just gave herself a competitive advantage over other raw-food experts who aren't passionate about any cause (or brave enough to share it), and she is way more motivated to market and sell her products and services because they're tied to making a bigger difference in the world. 4. Quit talking and start doing. Now that you've gotten this far, the next step is to begin taking consistent passion-based action each day. That could mean writing, making videos, recording audios, taking a class or somehow engaging in an activity you love. And here's the best part. Taking action on your passion often requires little to no cash outlay. Articles, videos and writing take no money. Only time, effort and focus. And beginner classes can often be inexpensive or, sometimes, even free. Building your life around what you love is something you'll never regret. It's your passion for what you do that will give you the drive, commitment and energy necessary to create any amount of success and fulfillment you desire, and you'll have an extraordinary time while you do it. That’s everything you need to know about finding your passion and probably a little more because I just can’t help myself, I’m passionate about sharing this work with you. Now go ahead and get started and don’t forget to let me know how it goes! Good luck :) ",
            "date": "Answered May 6, 2017",
            "views": "38",
            "upvotes": " View 52 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Uma Bondla",
                    "user_href": "/profile/Uma-Bondla"
                },
                {
                    "user_id": "Cora Dickerson",
                    "user_href": "/profile/Cora-Dickerson-3"
                },
                {
                    "user_id": "Haley",
                    "user_href": "/profile/Haley-658"
                },
                {
                    "user_id": "Rathna. Puneeth",
                    "user_href": "/profile/Rathna-Puneeth"
                },
                {
                    "user_id": "Sasha Collingridge",
                    "user_href": "/profile/Sasha-Collingridge"
                },
                {
                    "user_id": "Rishika Sharma",
                    "user_href": "/profile/Rishika-Sharma-204"
                },
                {
                    "user_id": "Hazim Ismail",
                    "user_href": "/profile/Hazim-Ismail-8"
                },
                {
                    "user_id": "Bart Cleveland",
                    "user_href": "/profile/Bart-Cleveland-1"
                },
                {
                    "user_id": "Yuqi Zhang",
                    "user_href": "/profile/Yuqi-Zhang-90"
                },
                {
                    "user_id": "Upasna Dakshina",
                    "user_href": "/profile/Upasna-Dakshina"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sumi Houston",
                "href": "/profile/Sumi-Houston"
            },
            "answer_text": "You actually don’t find a passion for your life, as much as you discover what your passions are. When you know your passions, as well as knowing who you are, you create a life filled with passion. You allow your truth to guide you in the decisions you make, and ultimately, the life you create for yourself. Many people have the feeling that life drags them around or determines their happiness, or even their life circumstances. What they don’t realize, is that you have the power to create your own life and therefore, you level of happiness or joy. It sound simplistic, and in actuality it is. But there’s definitely effort, as well as courage involved. The easy thing is to just follow the status quo - to do what everyone else says you should do, or what everyone else is doing. That leads to a life-humbling experience, and in many cases even depression because when you do that, you’re so far out of alignment with what makes you feel alive, that it creates an inner turmoil. So how do you go about doing this? Start by looking at what you either like, or love. If you can’t get to the place just yet or what really excites you, or what you love, then go with what interests you or what you like. This is just a directional indication. When you give yourself permission to explore what you like (or love), you find yourself led in new directions - trying new things. You start to open up to possibilities - exposing yourself to new experiences, people, or opportunities. One of the best things you can do is to learn to tune into your inner wisdom. Your gut instinct. What “feels” right? What feels “off”? When you being to get a feel for that, your decisions become more authentic for what’s right for you. This is the important part - what’s right for you! Not for me, not for your neighbored, best friend, or colleague. Because what’s right for you is exactly what will lead you to be a better person, expand your horizon, and even make a much bigger difference in the world. The process of discovering your passion and then allowing yourself to do it is a multi-layered process. The more you work on it, the better for you - the better results you’ll find you have. There are several steps, but mostly they’re: Give yourself permission to dream, to imagine and to look at what pulls you - what excites you and gets your heart beating faster? This isn’t a small step for most people. You have to be willing to examine all of the messages or examples other people gave you that told you to “Play it safe”, “fit in”, or “Don’t stand out”. You have to go against what you’ve learned - which is to be careful and ignore what you’re passionate about, if it goes against the norm.Once you discover what it is that creates life and excitement within you, or what just feels right on, then you need the courage to do something about it. This is the next step. This means you have to possibly dismantle old beliefs or even old patterns of doing.Then take action steps to put it in place.And then refine all of this. Pursue your passion. Find a way to fit it into your life. And live it courageously, with no apologies to anyone.I’ve written several articles on passion, doing what you love, and removing blocks to passion. Below are some links if you’d want to read further on how to discover and implement your passions. What Makes You Come Alive? Find It and Live It. Removing the Blocks to Passion and Purpose How can I find my passion? Pursuing What You Love to Find Real Happiness In terms of implementing the steps, this is a great book on taking small, manageable steps to accomplish your goals. In this case, creating your life filled with passion and purpose. The Slight Edge: Turning Simple Disciplines into Massive Success And Happiness, by Jeff Olson. It’s a very simple read on how to start making changes now. I hope you do pursue what drives you and what you’re passionate about. It’s the absolute best thing you can do in life - for yourself, as well as the people around you. All the best, -Sumi Connecting individuals to passion & purpose ",
            "date": "Answered April 26, 2019",
            "views": "52",
            "upvotes": " View 18 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kyint SanLoon",
                    "user_href": "/profile/Kyint-SanLoon"
                },
                {
                    "user_id": "Hesham Abdel Wahab Elbaz",
                    "user_href": "/profile/Hesham-Abdel-Wahab-Elbaz"
                },
                {
                    "user_id": "Ipsita Chatteejee",
                    "user_href": "/profile/Ipsita-Chatteejee"
                },
                {
                    "user_id": "Hazim Ismail",
                    "user_href": "/profile/Hazim-Ismail-8"
                },
                {
                    "user_id": "Awalleh Bear",
                    "user_href": "/profile/Awalleh-Bear"
                },
                {
                    "user_id": "Emma Mehrabani",
                    "user_href": "/profile/Emma-Mehrabani-1"
                },
                {
                    "user_id": "Satya Prasad",
                    "user_href": "/profile/Satya-Prasad-381"
                },
                {
                    "user_id": "Chetan Kumar",
                    "user_href": "/profile/Chetan-Kumar-645"
                },
                {
                    "user_id": "Eddie McLain",
                    "user_href": "/profile/Eddie-McLain-1"
                },
                {
                    "user_id": "Georgina Charles",
                    "user_href": "/profile/Georgina-Charles-3"
                }
            ]
        }
    ]
}