{
    "title": "How to prove soul never dies - Quora",
    "tags": [
        "Soul (metaphysical entity)",
        "Spirituality",
        "Death and Dying"
    ],
    "response": [
        {
            "author_info": {
                "name": "Perry Gruber",
                "href": "/profile/Perry-Gruber"
            },
            "answer_text": "This question leads to a kind of Unified Theory of Human Eternal Life. It’s a great question to consider. That’s because this is one of the most important things being offered to everyone all the time. In other words, your “soul”, All That Is and the Universe want you to know that you’re eternal. It also wants you to know that you are creating your reality as you live your life. Only then can you live your life the way you intended. It’s important to know when looking for proof that you’re not going to find any objective evidence that the soul never dies. That’s because life experience (even “after-life” experience) is 100 percent subjective. The only way to “prove” it is to prove it to yourself, in your own life experience. It is literally impossible to prove it definitively to others with any kind of objective evidence because all the evidence is first-person experiential. Physical life experience…particularly the external seeming, objective aspects.. are the soul’s projections of itself onto itself. So the being experiencing physical life is really experiencing an experience of itself that it is projecting into the awareness of itself. Why? So that it can experience “more” of itself as well as fulfill “intentions” making up the core of who and what the self is. So if you’re wanting to see proof that the soul never dies, knowing what you read is a start. Because that is the context within which your proof is going to be realized by you. You also have to be willing to be patient. The answer to your question hardly ever happens in a flash. And when it does, it is often lost. Like a dream you can barely remember in the morning. But if you’re willing to be patient, the gradual, unhurried nature of All That Is will reveal everything (anything really) you’re wanting to know. The next thing to realize is the proof is already always all around you. You just can’t see it right now. Seeing the proof requires orienting your perception so you can start seeing the evidence instead of seeing the absence of the evidence. “Orienting” your perception so you can see what you’re wanting has little to do with “doing something” and everything to do with “allowing yourself to realize” what it is you’re wanting to know. This is a very important distinction. We know we’re throwing a lot of words at you, but all this is really important to understand in realizing the answer to your question. So bear with us…. It’s easier if the person seeking this answer doesn’t use words or have beliefs that make realizing what they want harder. The word “soul” for example, leads people on a journey usually ending in belief constellations which make it hard (and often impossible) to realize what your question is reaching for. We wrote about that before here. Language is one way beliefs are communicated. You’ll notice you talk to yourself almost constantly. Much of that internal dialogue is confirming and reconfirming beliefs, many of which work against your question’s intent. So realizing how your language usually works against you and then cleaning up the language so you can begin realizing what you’re wanting is the next step. For example, look at the following two statements: I want to see evidence that the soul never diesI want to be the realizer of my eternal natureNotice statement one is very action oriented. It also presumes the evidence is not being seen (it is absent) and that the speaker wants to see it. But what this statement is doing is affirming the absence of the evidence in the way it is expressed. The perceiver wants to see something she currently does not, the “does not” component being emphasized. Notice statement two is passive. The speaker is not trying to do anything. She is expressing a desire to become something. It also affirms the existence of what it is she is wanting to realize. The perceiver understands her eternal nature is a thing and she is eager to have that realized by her. This subtle distinction is crucial to realizing the “proof” you’re asking about. Actually the word “proof” is problematic. “Proof” is adversarial. It is demanding. It is confrontational. It begs the statement that what you’re asking proof about doesn’t exist. “PROVE IT” is the energy of the word “proof”. See the subtlety? Ok, so now you have a sense of four important premises: The evidence you want will be 100 percent subjective. It will only be convincing to you. No one else.The evidence you’re wanting is all around you. You’re not trying to create the evidence or discover it. You’re wanting to realize the already-existing evidence. Or better stated: you’re wanting to realize your eternal nature, which already always has/is existed/existing.The language used in both asking and answering the question will either support your intent or defeat it.Your beliefs will hinder or help you become the realizer of the answer to your question.So now, the process is simple: you simply ask for the answer to your question in a way which supports you realizing the answer…then hold the intention that the answer is being revealed to you. What happens next is you’ll begin experiencing events confirming your intent. Things will begin happening in your life experience demonstrating that you’re eternal. But you have to keep the four points in mind and constantly question thoughts and reactions you have which will stop the evidence flow dead in its tracks. For example, one day you might be at a bus stop. Someone you know may join you at the bus stop. You’ll strike up a conversation with this person and this person may say something…mention a newspaper or magazine article, or a website, or a book, or tv show that will cause within you an “a-ha!” moment. What they say will sound so perfectly timed and so perfectly related to your intent to realize what you’re wanting. Perhaps they will mention the show God Friended Me, for example. And your mind will then do one of many different things: It may cause you to totally miss the opportunity that is the Universe and All That Is giving you a bread crumb along the path leading to your fulfilled realization. Your beliefs will prevent you from picking up on this TV show’s relevance to your question. And so you’ll just say something like “huh, interesting” and let the mention pass.Your mind may go “hmm, I remember this Quora answer I read about this and here is my friend, who I happen to meet at a bus stop telling me about some kind of TV show about god.” And your mind then might go: “this is a coincidence” and ignore the opportunity.You may feel goose pimples or a shiver down your spine and think “this is not a coincidence. This is a clue to the answer I’m wanting….” Then you’ll get excited….You then might go home later and watch the show, enjoy its premise and then, be inspired to casually research online the word serendipity….If you do something number three, then you’re on your way. What you may not realize in reading all this is, the seeming chance bus stop encounter is the beginning of the realizing of the evidence. That’s how subtle it works. Keep this up and you’ll come to experiencing all kinds of realizations. You may be invited to partake in an Ayahuasca event or a meditation sessionYou may be invited to hear someone speak about eternal naturesYou may have a dream where you experience something which adds to your realizationYou’ll begin having more and more events in your life demonstrating the reality of things science calls “pseudoscience”And then, at some point, you’ll notice your beliefs have gradually changed and you’ll begin living your life differently. As you shift your way of believing and your way of being, even more evidence will start happening: Your dreams will become more and more lucid and clearYou’ll start to want to know what your dreams are aboutYou’ll start playing with this whole idea that “you create your reality” and you’ll start getting evidence of that showing up all over your lifeThen, really amazing things will start happening that in the past you would have said “that’s coincidence” or “that’s impossible” or “random” or “confirmation bias” or some other nonsense. Only now you won’t say those things now because they happen so often there’s just too much evidence to the contrary.By then you’re on your way. The rest of the path is up to your realization. We promise, if you keep it up, you will eventually come to where every sincere person winds up: realizing, knowing they are eternal and that death is not the end. ",
            "date": "Answered October 27, 2018",
            "views": "17",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "William Pride",
                    "user_href": "/profile/William-Pride-2"
                },
                {
                    "user_id": "Benjamin Bradford",
                    "user_href": "/profile/Benjamin-Bradford-11"
                },
                {
                    "user_id": "Navaneet Pandurangan",
                    "user_href": "/profile/Navaneet-Pandurangan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Vanderhoof",
                "href": "/profile/Peter-Vanderhoof"
            },
            "answer_text": "Let’s reverse this, to PROVE a soul dies. FIRST PROVE YOU ARE GREATER THAN THE SPIRITUAL REALM & all of those gods that exist. Next prove that Human science is WRONG and energy can be destroyed, not converted to another form of energy. YOU must destroy it entirely. Otherwise to PROVE A SOUL NEVER DIES, just walk the Spiritual Realm. Till you walk the Spiritual Realm, you have only ONE PLANET, & only Human perspective of Existence, therefore you have not PROVEN THAT SOULS DIE OR DO NOT EXIST! You are simply someone that has a limited understanding of reality. You are a person sitting in a CLOSED UP ROOM, with all the windows, doors & outside views are closed to you. You can NOT PROVE THE OUTSIDE DOES NOT EXIST, because you are not WILLING to look outside your room. The fact that a wall exists between you and whatever is outside, is PROOF of something ELSE EXISTING! Hence, there is more THAN ONE UNIVERSE!  This is why I classify science as a religion, it CLAIMS TO KNOW EVERYTHING, but starts by saying “If we don’t have a machine to test it, IT CAN NOT EXIST.” Whoops, just like any religion saying ONLY OUR GOD EXISTS… the religion claims to be GREATER THAN GODS THEMSELVES.  ",
            "date": "Answered July 21, 2018",
            "views": "369",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Robbie Jena",
                    "user_href": "/profile/Robbie-Jena"
                }
            ]
        },
        {
            "author_info": {
                "name": "Veerasamy Natarajan",
                "href": "/profile/Veerasamy-Natarajan"
            },
            "answer_text": "Everyone believes there is a soul in his body but no one knows what it is and where it is. This is the reason that there is no definite definition on soul. It is not possible to prove soul never dies because soul is not a physical matter that will obey scientific laws or there is no instrument to put soul under investigation to demonstrate as a proof. I am of the opinion that soul is the energy our body receives at the time of conception prior to birth which manifests through our each and every body cells and this energy diffuse with the cosmic energy after the body dies. We can call it as a particle like photon of light and the particles are present in the entire body. Energy is neither created nor destroyed, so, if we consider soul is the energy, it never dies. This way we can explain to understand but proving is not at all possible. ",
            "date": "Answered July 19, 2018",
            "views": "192",
            "upvotes": " Answer requested by Navaneet Pandurangan",
            "upvoters": [
                {
                    "user_id": "Dominika Adamczyk",
                    "user_href": "/profile/Dominika-Adamczyk-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mauro Bernardini",
                "href": "/profile/Mauro-Bernardini"
            },
            "answer_text": "TTR theory can “prove” this, but… unfortunately orthodox science does not contemplate any transcendent theory or any theory that can not be subjected to the rules of experimentability, falsifiability. Since Science cannot and absolutely do not want to understand transcendent facts it is necessary to mature a new way of learning transcendent so that scientific principles can also be applied to the real and immanent effects due to transcendent hypotheses, a sort of metaphysical-science. The TTR is just an attempt in this sense. TTR, for instance, proposes a logical and rational scheme of interpretation of the transcendent world that has generated, still generates and will generate even our apparent existences (human beings, animals, plants, E5, E6 and particles of matter). This metaphysical theory is therefore completely different from the religious ones based only on irrational and illogical ideas without any correspondence with the physical effects that we can find in our 3D world, considerated as part of the great 11d world in which all (including our under-dimensional souls) really exist . ",
            "date": "Answered July 12, 2018",
            "views": "234",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "William Harold Hinkson II",
                    "user_href": "/profile/William-Harold-Hinkson-II"
                },
                {
                    "user_id": "Sophia Dora Weiler",
                    "user_href": "/profile/Sophia-Dora-Weiler"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sarah Sun",
                "href": "/profile/Sarah-Sun-31"
            },
            "answer_text": "According to Master Lu, after just several years, most people with practice in either this life nor in past life will also have a chance to see the soul that had separate from the dead body in reality-camera. AT that time, resolution/pixies… will be high enough to catch the spirit, God, Bodhisattva who exist in spiritual world. We have been many of them and they might have been us long ago. It is the fact that scientist has not found but already been public in religions. At this moment, people without practice can also try to understand/imagine, when we see people, feel terrified, been attacked/chased in dreams, we just thought they are symbols and strangers but they are actually our karmic creditors or spirit, soul… asking us to pay the karmic debts. and our soul is actively communicate with them during sleeping time. when a good person that accumulate lots of good deeds(helping others all the time, never scold, being kind to all, not eating too much animals’ bodies…) then their soul will go to heavenly realm during night time with bright background, and vise versa. All from Master Lu’s free metaphysics Q&A hotline and spiritual diagnosing in public. Guan Yin Citta 心靈法門 Sarah Charlina almost all the problems/illnesses people have are due to those souls collecting debts。 Master Lu’s live diagnosing could be located on youtube by searching “anydywin08” and Master Lu’s been teaching for free to all the effective way to pay back karmic debts-recitation of Little Houses(combined Mantras/sutras) and have help tons of people free from sufferings mentally and physically. All the info is free not for profit hoping to educate people of the truth and an option in daily life. ",
            "date": "Answered July 12, 2018",
            "views": "369",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Evan Howard",
                "href": "/profile/Robert-Evan-Howard"
            },
            "answer_text": "Souls along with gods are “ FAIRY TALES “. GOD'S, GANGS, GHOSTS, and GOBLINS HOW TO MAKE SOMEONE - ( BELIEVE / UN-BELIEVE ) People running religious, political, social, ideological or criminal activities look for people they can control. Such people are manipulated into \" IMPRINTING \" the idea of a god, cause or enterprise as being real or just. Some people are more easily manipulated into such indoctrinations than others. Once those running the activity have successfully manipulated someone into \" imprinting \" with the ideology, they can get their money, property, and time. These people can even be easily manipulated into committing crimes such as suicide bombings. It is not easy to break the \" imprint \". First the subject must understand how and why they were \" manipulated \". Then they must understand their own physical, financial, and / or mental state that caused them to be \" susceptible \" to the \" manipulation \" and eventual \" imprinting \". A good way to start the \" un-imprinting \" process is to get the subject to help \" un-imprint \" someone else from a different kind of indoctrination. Many people \" UNKNOWINGLY \" imprint themselves and others. Evil is something people do for greed, carelessness, for survival, self indulgence, boredom, love, hate, pain, and an action taken as a result of mental illness, but not from a soul which does not exist by Robert Evan Howard http://www.aclepd.com/gods.html http://www.aslodge.com/reh-profile - Robert Evan Howard ",
            "date": "Answered January 15, 2019",
            "views": "520",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bob Elton",
                    "user_href": "/profile/Bob-Elton"
                },
                {
                    "user_id": "Michael Jones",
                    "user_href": "/profile/Michael-Jones-136"
                },
                {
                    "user_id": "Sue Adams",
                    "user_href": "/profile/Sue-Adams-65"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Macready",
                "href": "/profile/Stephen-Macready-1"
            },
            "answer_text": "In contrast to all the philosophy and theological as well as personal opinions offered is answer to your question, I offer you the truth found in the Bible. The “soul” defined as a separate entity being part of your existence, is not supported by the scriptures. God did not create humans with a soul that leaves the body when you die because death is a punishment not a cycle of life. Humans were never supposed to die. Because Adam and Eve disobeyed, all humans suffer sickness and death. The Bible defines the soul from the Hebrew and Greek words as the person itself. You are the soul. The expressions still used today as in “the poor soul” or “may his soul Rest In Peace” are about the person not a sprit. Peter spoke about “the eight souls that entered the ark. The Bible states that God blew into Adams nostrils and he became a living soul. Also Jesus compared Death as sleeping, supporting what the Bible teaches that the dead are conscious of nothing at all. So using the Bible as the only source of truth, the teachings of an immortal soul are false. The Bible states… the soul that is sinning dies. ",
            "date": "Answered January 9, 2019",
            "views": "584",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dominic Novielli",
                    "user_href": "/profile/Dominic-Novielli"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kath Durand",
                "href": "/profile/Kath-Durand"
            },
            "answer_text": "You do not. It is not a ‘physical’ thing, so cannot be proven physically. It is a realization your whole consciousness has to ‘get’. Like believing in Divine Source, higher power or God. Faith is a part of that and just inner knowing. I also believe what most folks call your soul is what I would call your spirit, Your True Self. I would call the structure that holds your spirit in your body, your chakras, meridians, aura, etc, that is your soul. That is not necessarily a forever thing. A special gift from Divine Source to allow you to function and be aware in a human or other form of ‘body’. The soul also keeps you connected to Source and makes agreements about the life you choose. ",
            "date": "Answered July 13, 2018",
            "views": "249",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Miguel Malfabon",
                    "user_href": "/profile/Miguel-Malfabon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suzy McKee Charnas",
                "href": "/profile/Suzy-McKee-Charnas"
            },
            "answer_text": "You don’t; not while you’re incarnate here on the physical plane. We can *believe* anything, project any wish on our post-death future, construct any theory or set of rituals, get our heads frozen for presumed later revival, etc., but in a way this is a Schoedinger’s Cat situation seen from the inside: until Death opens the “box” that was our body, we can’t know ourselves whether there’s a soul inside or whether it’s “alive” without a living body, or not. ",
            "date": "Answered July 12, 2018",
            "views": "112",
            "upvotes": " Answer requested by Navaneet Pandurangan",
            "upvoters": [
                {
                    "user_id": "Navaneet Pandurangan",
                    "user_href": "/profile/Navaneet-Pandurangan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Khrys Tapang",
                "href": "/profile/Khrys-Tapang-1"
            },
            "answer_text": "There are cases of documented reincarnation phenomena and some of which are from children who experience episodes of recurring memories from the past. The stories were investigated and most what being said by the children were actually true events happened from the past. I believe soul never dies and instead are being re-cycled or re-born to continue or fullfil the unfinished business. I also read that souls consist of light and energy, and thus cannot be destroyed. The reason why we cannot access the other dimension is because we are living in a 3rd dimension world and our physical (biological body) is a hindrance for us to transmute and communicate with other entities. We have glympse of the other world during lucid dreaming. Our subsconscious is the portal to other realms. ",
            "date": "Answered July 21, 2018",
            "views": "102",
            "upvotes": " Answer requested by Navaneet Pandurangan",
            "upvoters": [
                {
                    "user_id": "Ankita Parab",
                    "user_href": "/profile/Ankita-Parab-16"
                },
                {
                    "user_id": "Navaneet Pandurangan",
                    "user_href": "/profile/Navaneet-Pandurangan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Larry Walden",
                "href": "/profile/Larry-Walden-3"
            },
            "answer_text": "The soul which is the mind, will, emotions and memory never dies. It survives physical death because the Bible says so and Jesus proved it by being resurrected from the dead. Google in Near Death Experiences (NDE’s) for loads of testimonies about people dying and returning to life to tell their experiences. ",
            "date": "Answered July 12, 2018",
            "views": "129",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sunny S",
                    "user_href": "/profile/Sunny-S-241"
                },
                {
                    "user_id": "Tim Mensch",
                    "user_href": "/profile/Tim-Mensch"
                },
                {
                    "user_id": "Navaneet Pandurangan",
                    "user_href": "/profile/Navaneet-Pandurangan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Benner",
                "href": "/profile/Michael-Benner-17"
            },
            "answer_text": "Though all physical objects are impermanent, energy cannot be created nor destroyed. This principle is called the Law of Conservation of Energy, the first law of thermodynamics. So, if there is such a thing as a personal soul, it obviously is not physical matter, but some sort of energy matrix, and therefore, cannot cease to exist. Not sure you can call that proof, but it is an empirically logical deduction. # # # ",
            "date": "Answered July 14, 2018",
            "views": "199",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Miguel Malfabon",
                    "user_href": "/profile/Miguel-Malfabon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Meacham",
                "href": "/profile/Bill-Meacham"
            },
            "answer_text": "It depends on what you mean by \"prove.” After my daughter died I had communication with her. Things were said that could only have come from her, and others heard them as well. So I am convinced that there is an afterlife, at least for one person, my daughter. Read the whole story, which I call “an impeccable death,” here: Philosophy for Real Life (Philosophy for Real Life) And please read it. Don’t just assume that it must be wishful thinking or delusion without at least considering my story. ",
            "date": "Answered July 8, 2020",
            "views": "116",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kevin McLauchlan",
                "href": "/profile/Kevin-McLauchlan"
            },
            "answer_text": "QUESTION: How do you prove soul never dies? ANSWER: You “prove” it in your imagination, which is the only place that souls exist. Since they are entirely imaginary, you can imagine them ‘living’ as long as you wish. Of course, when you die, your imagination dies, so there’s that. ",
            "date": "Answered July 17, 2018",
            "views": "181",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Miguel Malfabon",
                    "user_href": "/profile/Miguel-Malfabon"
                },
                {
                    "user_id": "Navaneet Pandurangan",
                    "user_href": "/profile/Navaneet-Pandurangan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex Bunardzic",
                "href": "/profile/Alex-Bunardzic"
            },
            "answer_text": "Easy. Something that doesn’t exist never dies. It’s the same as asking “how do you prove that childless woman’s daughter never dies?” She was never born, to begin with, and so she never dies. Next question… ",
            "date": "Answered July 14, 2018",
            "views": "239",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Navaneet Pandurangan",
                    "user_href": "/profile/Navaneet-Pandurangan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gishan Maddumasooriya",
                "href": "/profile/Gishan-Maddumasooriya"
            },
            "answer_text": "As per Buddhism there is no unchanging soul as such. The consciousness changes with the effects of karmas committed, and travels from one life to the other. The closest thing to the soul in Buddhism is consciousness. Consciousness perishes at the death of an enlightened person, and this contradicts with your concept of never dieying soul ",
            "date": "Answered November 8, 2019",
            "views": "151",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "V. V. Raman",
                "href": "/profile/V-V-Raman-1"
            },
            "answer_text": "How do you prove soul never dies? The best proof I have seen: It says so in practically all the Religions of the world. Peace with the immortal soul! 12 July 2018 ",
            "date": "Answered July 12, 2018",
            "views": "58",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nicholas Peterman",
                    "user_href": "/profile/Nicholas-Peterman-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robbie Jena",
                "href": "/profile/Robbie-Jena"
            },
            "answer_text": "How do you prove soul never dies? I can NOT…for about 5 Billion years…since enemies are out there and the soul could be a Baby in the greater scheme of things. Thank you Navaneet Pandurangan ",
            "date": "Answered October 28, 2018",
            "views": "97",
            "upvotes": " Answer requested by Navaneet Pandurangan",
            "upvoters": [
                {
                    "user_id": "Miguel Malfabon",
                    "user_href": "/profile/Miguel-Malfabon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ahsan Nabi Khan",
                "href": "/profile/Ahsan-Nabi-Khan"
            },
            "answer_text": "Recently doctors uncovered blood on the Shroud of Turin: Jesus Christ’s Holy shroud covered him and got his blood imprints. Doctors realized this little blood sample was moving even after 2000 years, proven all under a microscope. Thanks for your soul. Amen. ",
            "date": "Answered July 11, 2018",
            "views": "184",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Frank Villa",
                "href": "/profile/Frank-Villa-2"
            },
            "answer_text": "Easy. Die. (Don't rush it for me, though. Make the most of your life first, just in case you were wrong about the whole soul thing).Go (now in the shape of your immortal soul) somewhere public and say “Hi, I am the immortal soul of xxx, ask me any question for which you know only xxx could have the answer”Then answer any question people might have",
            "date": "Answered July 12, 2018",
            "views": "120",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stephen Comer",
                "href": "/profile/Stephen-Comer-4"
            },
            "answer_text": "You don’t because since there is no evidence for a soul, therefore there is no soul. ",
            "date": "Answered January 4, 2019",
            "views": "60",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Glenn Lee",
                "href": "/profile/Glenn-Lee-22"
            },
            "answer_text": "When something does not exist, can that something die? ",
            "date": "Answered July 12, 2018",
            "views": "68",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Michelle de Kwiatkowski",
                "href": "/profile/Michelle-de-Kwiatkowski"
            },
            "answer_text": "Souls are energy. Energy never dies. ",
            "date": "Answered July 14, 2018",
            "views": "91",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Paul Moore",
                "href": "/profile/Paul-Moore-55"
            },
            "answer_text": "There is no such thing as a “soul.” If you are a grownup someone should have told you this by now. You are wasting your life believing in such childish nonsense. It’s time to grow up and join the adult world of reality. Good luck. ",
            "date": "Answered October 28, 2018",
            "views": "36",
            "upvotes": " Answer requested by Navaneet Pandurangan"
        },
        {
            "author_info": {
                "name": "Lương Mai Hưng Gia",
                "href": "/profile/Lương-Mai-Hưng-Gia"
            },
            "answer_text": " It seens like people are trying to find evidences to support their conclusion again instead of the other way around. When will this ever end? ",
            "date": "Answered December 30, 2019",
            "views": "115",
            "upvotes": "0"
        }
    ]
}