{
    "title": "How does one discover their true self? - Quora",
    "tags": [
        "Self-Awareness Advice",
        "Psychology of Self-Improvement",
        "Identities",
        "Self-Awareness",
        "Self-Improvement Advice",
        "Truth",
        "How-to Question",
        "Self-Improvement",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Leary",
                "href": "/profile/Mike-Leary"
            },
            "answer_text": "This seems to be a constant theme I have heard over the years, though the way it is presented has changed a bit. How does one find, themselves? In other cultures, there was a way to help young people transition to adulthood by going through some kind of ‘Coming of age ceremony.’ American culture has seemingly lost most of that, other than the age related rituals to drive and drink. Jewish culture has managed to hang on to bat and bar mitzvahs and Hispanic culture still has remnants of Quinceañeras along with the Catholics confirmation but for the most part, it is gone. So how does one become an adult or find who you are supposed to be when the traditional methods are lost or been corrupted so badly they are meaningless? Ironically, I see a needed jolt in the person’s reality to get them to question what life is about and where do they fit in it. As Captain Jean-Luc Picard of Star Trek said — We need a kick in our complacency.” That used to take place at an altar of some sort. It has to be able to snap people out of their everyday existence and get them to question the point of it. I think it still is happening nowadays but the altar is different. The blood sacrifice that is made most often in American is at the altar of the automobile. Either your own blood or someone’s you love dearly. That has the tendency to cut through all the rhetoric and make one inquire as to the meaning of life. That isn't the only way people are brought-up-short but a dramatic one. Death of a marriage, job, lifestyle or health are but a few that can do that. The problem with the violence method is —people can get more lost. Without a good mentor, one is susceptible to the manipulations and ideas of those around them while they are vulnerable. They then can be deceived (taken away) from themselves to fit the ideas and beliefs of the corrupter, giving them secure “Right” answers when one is confused and lost. Still external answers than internal ones. There are some spiritual traditions that help guide people to access that soul link but all of them require an inward journey through some kind of ritualized or realization process. Sometimes it is accelerated with the use of drugs, fasting, dancing, chanting, music, or physical endurance, but the object is to get you to obtain an altered state and become aware of more than your egos’ take on things. As some said earlier; Get outside yourself and give to others. There is something to be said for difficulties. It is the mother of inventions or at least motivation. People that avoid hardship or have been indulged not to have any, are unable to mature and grow. I had a patient (whose wife suddenly left him) go to Haiti to help with the relief after the devistating hurricane. It changed him so much for the better. He’s now happily married to whom he considers the love of his life and has two children. I see finding yourself as a phenomena that is popular here in the USA, but there is that traditional —having to get away — to do it. I must go out there, and get away from here, which is keeping me lost. So I have to travel to Europe, or India, or Australia, and go on an adventure where I will hopefully find myself. Like you were hiding under some rock in Africa. “Am I in here? No…Am I in this cave? NO… So where could I be hiding? Oh there I am… ‘Up a tree’, no wonder I couldn't find myself.” But people come back from such adventures and have said just that. “I found myself.” How did they do it? I think they MUST put themselves into a situation where they've cut off all their resources and only can rely on themselves. It forces them to reach inside and access the courage to persevere. They discover they’re resiliant. Then they can connect with pride as in, “I did it myself!” So now they know who they are, because they have been tested. It was inside all along. They just didn't know where or how to look. ",
            "date": "Updated March 8, 2018",
            "views": "102",
            "upvotes": " View 98 Upvoters",
            "upvoters": [
                {
                    "user_id": "DOMINIC MICHAEL SURRÃO",
                    "user_href": "/profile/DOMINIC-MICHAEL-SURRÃO"
                },
                {
                    "user_id": "Debarati Banerjee",
                    "user_href": "/profile/Debarati-Banerjee-53"
                },
                {
                    "user_id": "Sohan Mishra",
                    "user_href": "/profile/Sohan-Mishra-1"
                },
                {
                    "user_id": "Komal Bansode",
                    "user_href": "/profile/Komal-Bansode-9"
                },
                {
                    "user_id": "Cj Gumarao",
                    "user_href": "/profile/Cj-Gumarao"
                },
                {
                    "user_id": "Melanie Gutierrez",
                    "user_href": "/profile/Melanie-Gutierrez-42"
                },
                {
                    "user_id": "Riley Smith",
                    "user_href": "/profile/Riley-Smith-163"
                },
                {
                    "user_id": "Himangshu Bhuyan",
                    "user_href": "/profile/Himangshu-Bhuyan-7"
                },
                {
                    "user_id": "Mallika Basundhara",
                    "user_href": "/profile/Mallika-Basundhara"
                },
                {
                    "user_id": "Chie Hayakawa (早川 知恵)",
                    "user_href": "/profile/Chie-Hayakawa-早川-知恵"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Hu",
                "href": "/profile/James-Hu-2"
            },
            "answer_text": "Over a period of time, your sense of self are the total thoughts and actions taken on a daily basis. After a week or so, you can look back, examine thyself, and experience the personal growth. Lack of personal growth will tend to make you find yourself in the past. Personal growth is a feeling of forward momentum, forward achievement, and some resemblance of all the small and big accomplishments. Accomplishments can be anything; making the bed every morning, finding another way of doing things, learning something new, tasting something different, hearing a new song, etc…anything related to creation will more likely provide a sense of accomplishment. Many people mentally and emotionally lock themselves into a certain condition to feel safe. Don’t do this to yourself if you truly desire the wealthy and abundant mindset. Who you really are is the person you become through the challenges, the obstacles, the hardships, the struggles, and all kinds of “bumps in the road” that make you who you are. Find out fast who you truly are by clearly understanding the difference between who you think you are and who you think others believe you are. ",
            "date": "Answered May 9, 2019",
            "views": "868",
            "upvotes": " Answer requested by Sierra Charlie",
            "upvoters": [
                {
                    "user_id": "Keisha Flowers",
                    "user_href": "/profile/Keisha-Flowers-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mario T. Lanza",
                "href": "/profile/Mario-T-Lanza"
            },
            "answer_text": "That’s nearly an impossible question to answer. I still haven’t figured myself out. Yes, I know myself better almost anyone else does, but figuring out yourself won’t necessarily crystalize your path in life. The thing about finding your calling, if that’s what you after, is that you are a complex human being capable of enjoying and finding purpose in many possible lives. It’s no different than finding a partner. There’s no such thing as a soul mate. There are people who are good for you and people who aren’t. And there are many people with whom you could make a good life. Likewise, there are many ways for you to make a good life. Should you get to know yourself? Sure. There’s value in knowing what you like and don’t like and where you’re strong and weak, but don’t believe that there is a superior path that you must identify. You’ll just waste time and energy. Don’t put too much effort into optimizing the details of your life. When you believes that you’re missing out on something better, you’ll miss making the most of who and what’s in front you: your family, friends, and current opportunities. You’re always be guessing if doing something else wouldn’t make life a little better. The Art of Work and So Good They Can’t Ignore You offer wisdom and will add greater nuance to my answer. Be open to exploring opportunities and go all in on them for a season. Make the most of them. Make the most of yourself in each of them. So Good teaches that you learn to love the work that fully invest yourself in. It juxtaposes the idea of following your passion with investing yourself to gain the skill and that with it comes passion. Art of Work teaches that your history and current path reveals your destiny, that your calling is often the work in front of you or a step just ahead. It also clued me into the fact that you needn’t have a life-long calling, that you could live several callings over several seasons. ",
            "date": "Answered February 25, 2018",
            "views": "515",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alfred Kwint",
                    "user_href": "/profile/Alfred-Kwint"
                },
                {
                    "user_id": "SIR",
                    "user_href": "/profile/SIR-45"
                },
                {
                    "user_id": "Nawrin Tabassum",
                    "user_href": "/profile/Nawrin-Tabassum-2"
                },
                {
                    "user_id": "Lav Ramloghun",
                    "user_href": "/profile/Lav-Ramloghun"
                },
                {
                    "user_id": "Abby Tomanová",
                    "user_href": "/profile/Abby-Tomanová"
                },
                {
                    "user_id": "Vanessa Reyneke",
                    "user_href": "/profile/Vanessa-Reyneke-1"
                },
                {
                    "user_id": "Lilies",
                    "user_href": "/profile/Lilies-8"
                },
                {
                    "user_id": "Michele Meiborg",
                    "user_href": "/profile/Michele-Meiborg"
                },
                {
                    "user_id": "Anna Ntov",
                    "user_href": "/profile/Anna-Ntov"
                },
                {
                    "user_id": "Tan Van",
                    "user_href": "/profile/Tan-Van-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Allen Walker",
                "href": "/profile/Allen-Walker-357"
            },
            "answer_text": "Our self identity is made up of 3 things: 1.) How we see ourselves. 2.) How other sees us. 3.) Who we really are. Most people are heavily concentrated on the first two. But if you really want to know yourself, concentrate on number 3. How do you find who you really are? By basing your knowledge on the facts and not on your opinion and bias. People are very good at fooling themselves in denying who they are. They fool themselves into believing that they’re all kinds of things that they’re not. And they’re very good at fooling themselves into believing that they’re not all kinds of things when they are. Like being open minded or being understanding, etc. etc. and not being stubborn or narrow minded etc. etc. Fact, the first sign of knowing that you’re wrong is when you can’t prove or explain why something is right and only feel that it is right. If you want to know who you are instead of knowing what you think you are, you can’t just explain things with your feelings. You have to have proof. And only by accepting the proof and facts are you able to see who you truly are. If you find yourself procrastinating rather doing your work all the time, you are in fact lazy. Don’t try to deny it or make excuse that it’s because of something else. Accept the proof. Accept who you are. If you find yourself always judging people for the way they look and dress, you are in fact, shallow. Accept who you are. Only by accepting who you are are you able to change or remain the same with your choosing. By accepting that you are shallow, you can learn to recognizing your shallow tendency and change you habits thus changing yourself. If you don’t want to change, you can just simply stay the same. But since you know for a fact that you’re shallow and that you choose to be shallow, when someone calls you shallow, it wouldn’t hurt you at all because that is what you choose to be. You’ve already accept yourself as a shallow person so it wouldn’t offend you. Being truly self aware is a wonderful thing. But I warned you, it can also be a curse. Cause you’ll notice how stupid most people are. Fooling themselves and denying their feelings. Honestly, I sometimes wish I was stupid like them. Life would be so much simpler. ",
            "date": "Updated June 28, 2019",
            "views": "23",
            "upvotes": " View 24 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Angela Collet",
                    "user_href": "/profile/Angela-Collet-3"
                },
                {
                    "user_id": "Ella Rees",
                    "user_href": "/profile/Ella-Rees-20"
                },
                {
                    "user_id": "No Name",
                    "user_href": "/profile/No-Name-6084"
                },
                {
                    "user_id": "Maria Alexandra",
                    "user_href": "/profile/Maria-Alexandra-100"
                },
                {
                    "user_id": "Samy Cachon",
                    "user_href": "/profile/Samy-Cachon"
                },
                {
                    "user_id": "Ketsia Lefranc",
                    "user_href": "/profile/Ketsia-Lefranc-2"
                },
                {
                    "user_id": "Kendra Ginnever",
                    "user_href": "/profile/Kendra-Ginnever"
                },
                {
                    "user_id": "Christine CJ Owens",
                    "user_href": "/profile/Christine-CJ-Owens-1"
                },
                {
                    "user_id": "Sheena Sunanda",
                    "user_href": "/profile/Sheena-Sunanda-1"
                },
                {
                    "user_id": "Susana Moncayo",
                    "user_href": "/profile/Susana-Moncayo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Jones",
                "href": "/profile/Matthew-Jones-217"
            },
            "answer_text": "People everywhere want to become their true selves, but have no idea where to start.  They feel overwhelmed, overworked, and exhausted from living in the modern world. After spending all day in a mind-numbing and enthusiastic void at work, they come home only to sit, idling while they occupy their minds with thoughts about House of Cards and Donald Trump.  Most people have no idea how to become their true selves, because they’re stuck in society, brainwashed by the technology that simultaneously liberates and imprisons their minds—Steve Jobs only spoke to the public about the positive possibilities and creative potentials of his technology, but you have to wonder how much he contemplated the dark side of having the world in the palm of your hand.  A small percentage of individuals withdraw from this superficial card game.  They seek out gurus and live their lives in seclusion abroad or in sacred ashrams, where they’re left to focus on what really matters. But for the vast majority of individuals who don’t want to leave the beautiful possibilities of modern living, the options are scarce. Either pick and choose from various religious teachings or engage in spiritual practices often devoid of their original context. This is why so many people love yoga. Millions of people flock to their yoga mats each year.  A 2012 survey found that 20.4 million Americans practice yoga, which is a 29 percent increase from the 15.8 million yoga practitioners found in the same survey in 2008. Most of these yoga classes have nothing to do with the original goal of Moksha, or liberation of most traditional types of yoga. None of them spend time discussing the process of Shakti, or energy, in the body during yoga—they merely move people through yogic postures as a form of exercise. These popularized forms of yoga lack depth and have only limited mental benefits, and yet, people find themselves drawn to the practice. Why? Some people love the image of being a yogi.  Yoga practitioners now spend $10.3 billion per year on yoga products. Clearly the branding, clothing, beads, and mats make you look spiritual, but do they lead to discovering your true and authentic self? Maybe, maybe not. Instead of wasting money to fit into a stereotypical image that may or may not help you discover who you really are, follow these guidelines to answer your deepest questions.  Five Ways to Become Your True Self: 1. Drop the mascaraed.  Stop trying to fit in! There’s no reason to hide your uniqueness from others. We all have special talents and gifts that need to be shared with all of humanity. Rather than trying to fit into an image your sold on television, embrace who you are. Stop lying—you don’t have to pretend to love sports, or that terrible TV show that your coworkers love—be more authentic. Others will gravitate towards your genuineness and you’ll become more comfortable in your own skin.  2. Embrace your imperfections.  Instead of cowering in a corner, amplify your strengths and love your limitations. We all have little things that we suck at. I’m terrible with math due to lack of effort and can’t for the life of me remember names of restaurants or people. What’s more important than hiding your weaknesses is owning them and not feeling the need to constantly apologize. I tell people up front that I’m bad with names, and my girlfriend is well aware of my restaurant challenges. When you embrace your imperfections, it takes off the pressure to be something your not and gives others the permission to be compassionate towards their flaws.  3. Explore your depths.  Take time to ponder the deep thoughts of life—what does it all mean? Is life worth living? What’s the purpose of life? Who am I? What is it that is aware of this experience? Stop wasting your time thinking about the misogynistic racist clown running for the President of the US, the more attention you give him, the more he benefits and the more intelligent people have to repress their desire to hurt bigots. Exploring your depths, even without answers, will help create space for the answers to be felt and experienced.  4. Expand your mind.  Read books that challenge and change your worldview. Whether it’s perusing through gurus or philosophers, reading about self-improvement or mindfulness, it’s important to challenge your mind each and every day. This means cutting down on the mindless scrolling through Facebook and Instagram while the iPhone screen is four inches from your face and disrupts your sleep pattern. Read deep thoughts and then reflect, continued learning is invaluable.  5. Meditate.  Being alone in silence is something that each person needs. With all of the noise of modern life, we all can benefit from turning down the volume. The number of meditators in the US is constantly raising. Right now well over 18 million adults meditate, and it’s not just for the mental health benefits. There’s something soothing about sitting in silence. If you want to discover who you really are, you need to be present and comfortable with silence.  Each person is on a continuum. There’s no one-size fits all to becoming your true and authentic self. This list is great for a large range of people, but may not be enough for individuals who are further in their search. If that’s you, then reach out to knowledgeable life coaches, therapists, or other professionals. We're here to help you find self-development in the modern world.  Find the best of both worlds. Discover practical spirituality that can add value to your daily life and improve your mood. If you want to become your authentic self, connect to your depths, stop trying to fit in, embrace your imperfections, and sit in silence each day. There’s no need to abandon your modern life and live on an ashram, just as there’s no need to stop going to your corporate yoga, it’s all about your awareness and intention.  ",
            "date": "Updated March 12, 2016",
            "views": "19",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Keisha Flowers",
                    "user_href": "/profile/Keisha-Flowers-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hielke de Boer",
                "href": "/profile/Hielke-de-Boer"
            },
            "answer_text": "We tend to have fixed ideas due to this very material world we live in. Thus, when we look inside with a question like 'who am I?’ we have to be cautious not to project this habit of fixed ideas on the 'I'. Why, because we're organisms, our body is breathing and moving and so is the inner being; just look at your thoughts, they're in a state of seemingless eternal movement. We live in the West and especially here we're infected with this idea of Descartes 'I think, therefore I am'. But if you look at it (looking, not thinking about it) then you'll see that our thinking is an important function of our being, but nonetheless a function; it's not the whole being. There's this other idea in the West, which comes from the ancient Greek philosophers: know thyself. But again, this also can become easily such a fixed idea: I know myself, I stand for this, I will never do that etc. With it you block yourself from extending your boundaries during your lifetime. If someone really líves and becomes 50 he/she isn't the same person as at the age of 20. So we're talking about a moving, changing and hopefully growing subject here. The 'I' cannot be defined with some fixed idea which we carry with us for the rest of our lives. Some say we're defined by our childhood and other circumstances which will make us who we are. It means your identity is allready laid out for you, your background was taken care of by others and there's nothing you can do about that base. There's a lot in it, but then there's a flaw in that approach: how about a person with a very very traumatic childhood who still manages to succeed as a human being? Such people carry an important secret within them: they struggled through life and formed their own character. They have been fighting their way to the future. And know who they are and what they stand for. And it's not because they thought 'know thyself’ but rather 'forget yourself'. They had nothing to identify themselves with except for the will to make it from here to there and recognizing the capabilities and talents within them. They didn't think 'I think, therefore I am', because solely thinking wouldn't have helped them. It was more the right way of thinking, the right amount of thinking and the adequate action that brought them where they eventually came, as a human being. So it's more like you find yourself in defining your life, using your talents, using your thinking in a balanced way etc. The more you feel certain in what you do, how you do it and trust the inner voice to communicate with, the more you will feel at ease with yourself, opening up from within. The self is not to be defined, but to be experienced. ",
            "date": "Answered February 25, 2018",
            "views": "343",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Keisha Flowers",
                    "user_href": "/profile/Keisha-Flowers-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emily Claire",
                "href": "/profile/Emily-Claire-82"
            },
            "answer_text": "I can relate to this feeling and so can a lot of other people. You’re not alone and I am sorry you’re feeling this way. It’s not a good feeling. I think the first thing to know is that there is a difference between looking for identity in long lasting and grounded ways versus temporary artificial ways. When we focus a lot of attention and energy on the latter, ie: things that are fleeting like social media, TV, clothings, things, substances, celebrities, etc. we may get a good feeling but it’s only temporary and can leave us feeling empty afterwards. Rather, it’s more fulfilling to devote time and energy into things that give us sustenance, depth and purpose. Think of yourself as a tree that needs to be given good sun, nutrients and water so that you can grow strong roots. Those roots will make you feel belonging and purpose. And they take time, focus and dedication to grow. It doesn’t happen overnight. Start by thinking of how you can give back to people around you to make your community a better place. How can you volunteer once a week and devote yourself to being present where you are now with the people you are with now? Ie. get those roots into your people and community. Humans are made to be in community and with others. We have to develop meaningful relationships! Also, as a religious person I find that grounding my identity in my relationship with God is deeply meaningful as well, and believing that I am here for a purpose and that life has meaning. We have to believe and keep the faith that we are here in earth for a reason. For example, for me I believe that it is not important that I find myself, but rather that I allow myself be found and known by the creator and that my identity and roots are wrapped around his strength, truth and peace. It’s not about me. Finally, I find that having something to work toward is very important. For me I devote myself to creative projects but for others it can be family, friendships, volunteering, or something as small as learning, starting healthy daily habits, exercise and eating right. Much love ",
            "date": "Answered August 13, 2020",
            "views": "153",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Princess Junsay",
                    "user_href": "/profile/Princess-Junsay"
                },
                {
                    "user_id": "Sheena Sunanda",
                    "user_href": "/profile/Sheena-Sunanda-1"
                },
                {
                    "user_id": "Meghan Horton",
                    "user_href": "/profile/Meghan-Horton-3"
                },
                {
                    "user_id": "Tina K",
                    "user_href": "/profile/Tina-K-120"
                },
                {
                    "user_id": "Jeremy Alexander",
                    "user_href": "/profile/Jeremy-Alexander-20"
                },
                {
                    "user_id": "Orlando Dantas",
                    "user_href": "/profile/Orlando-Dantas"
                },
                {
                    "user_id": "Jerry Arguello",
                    "user_href": "/profile/Jerry-Arguello"
                }
            ]
        },
        {
            "author_info": {
                "name": "Todd Brison",
                "href": "/profile/Todd-Brison"
            },
            "answer_text": " Okay, here’s how I’ve tried to be a little more authentic. But first, this: You are and always will be a combination of the things you take in. The idea you can be one authentic, unchanging being forever is ludicrous. As a matter of fact, if you try to do that, you will then become inauthentic, a character of your actual self. Who would you define as “authentic?” Bob Dylan? The guy had tons of influences and might have been the most cultivated artist of all time. Tim Ferris? He’s talked about running the title of 4-Hour Work Week through multiple focus groups. Does that sound “authentic” to you? I copy people all the time. It's actually kind of embarrassing. When I like how James Altucher sets up an idea, I try to do the same. When I read a vivid scene by John Green, I pull that imagery into my non fiction. There is nothing new under the sun. Except for you. Your unique combination of biology is the only thing that has never existed on this planet before. You can never hope to be completely “authentic.” You can only hope to say: “Here is the world as well as I understand it. Now do you understand?” With that in mind, try these strategies: ~~ 1) STOP TALKING ~~ Every time you open your mouth to respond, close it instead. Think “why was I about to say that?” Deconstructing your thoughts can help you understand where your influences are coming from. Odds are when you pause before you speak, you'll hate 50% of the things you were going to say. When you decide to speak again, you can do so with power, feeling the weight of each word you release. ~~ 2) WRITE DOWN YOUR MEMORIES ~~ The only truly authentic thing we have on this planet is our own story. You were the only person in the world born at the exact time, with the exact parents, and in the exact location you came into being. From the second you emerged, you have seen the world in an entirely different way as everyone else on the planet. As you write, you'll start to recognize patterns. You'll strong attachment to where you came from and maybe, just maybe, where you are going. ~~ 3) SURROUND YOURSELF WITH PEOPLE LIKE YOU ~~ Most everyone has heard the quote by Jim Rohn: “You are a combination of the 5 people you spend the most time with.” Fewer people act this out. That's because people are hard to deal with. What if one of the people we hate spending time with is your mom? What if it's your spouse? What if we can’t find anyone we like?* Selecting your people is not always fun. It’s actually a lot of work. But the more you intentionally select your crowd, the easier it is to construct your own authenticity. *By the way there’s no excuse for not finding people you like. The Internet has eliminated geography as a reason for that* ~~ 4) SPEND AT LEAST 20% OF YOUR TIME ON YOUR INTERESTS ~~ I am sure you’ve had this experience before. At the start of a new job, you are eager to please your new manager. (Very eager, as the paycheck is likely going to keep you from eating Mac & Cheese for breakfast). You consume every task that’s thrown at you. “There is no job too big for this new guy!” they say. 3 months later, when the shine has worn off and you’re settling in, you’ll realize: You don’t care about anything you’ve been doing. In a world where many people just drift around allowing others to guide them, your cultivation of self is critical. If you don’t know your interests, ask these questions: What would I do if nobody paid me?What did I like to do as a kid?What things make me lose track of time?How can I directly improve the lives of those around me?Whose life would I like to mimic?Once you figure out these interests, make them a non-negotiable part of your schedule. Anyone can do a job. Your quirks make you who you are. ~~ 5) SURROUND YOURSELF WITH YOUR OPPOSITES ~~ Two words to support this point: Abraham Lincoln. After a hard-fought (and kind of insane) election, old Abe took office and immediately filled his cabinet with members of the opposite political party. Can you imagine if that happened today? Picture this. Instead of yes men, you are surround by folks who are almost diametrically opposed to you in every facet. With every decision your motives are questioned. With every opinion you are forced to clarify why you hold it. Do you think you might have a strong sense of self after you came out of that?  Stay focused. Stay balanced. Learn, and most importantly: Do. ",
            "date": "Answered August 18, 2016",
            "views": "468",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Santosh Marandi",
                    "user_href": "/profile/Santosh-Marandi-18"
                },
                {
                    "user_id": "Shaz Trotman",
                    "user_href": "/profile/Shaz-Trotman"
                },
                {
                    "user_id": "Sowjanya R",
                    "user_href": "/profile/Sowjanya-R-3"
                },
                {
                    "user_id": "Yana Kambites",
                    "user_href": "/profile/Yana-Kambites"
                },
                {
                    "user_id": "Namma Huduga",
                    "user_href": "/profile/Namma-Huduga"
                },
                {
                    "user_id": "Filo Sohvi",
                    "user_href": "/profile/Filo-Sohvi"
                },
                {
                    "user_id": "Marcel Pereira Machado",
                    "user_href": "/profile/Marcel-Pereira-Machado-2"
                },
                {
                    "user_id": "Antoine Stos",
                    "user_href": "/profile/Antoine-Stos"
                },
                {
                    "user_id": "Rakesh Nanda",
                    "user_href": "/profile/Rakesh-Nanda"
                },
                {
                    "user_id": "Igor Zuev",
                    "user_href": "/profile/Igor-Zuev-2"
                },
                {
                    "user_id": "Harvey Daly",
                    "user_href": "/profile/Harvey-Daly"
                },
                {
                    "user_id": "Christiano Ronaldigo",
                    "user_href": "/profile/Christiano-Ronaldigo"
                },
                {
                    "user_id": "Chaitanya Gaur",
                    "user_href": "/profile/Chaitanya-Gaur"
                },
                {
                    "user_id": "Bentley Mayes",
                    "user_href": "/profile/Bentley-Mayes"
                },
                {
                    "user_id": "Lindsey Rod",
                    "user_href": "/profile/Lindsey-Rod-1"
                },
                {
                    "user_id": "Joseph Malo",
                    "user_href": "/profile/Joseph-Malo-2"
                },
                {
                    "user_id": "Michael Dixon",
                    "user_href": "/profile/Michael-Dixon-29"
                },
                {
                    "user_id": "Jane Botten",
                    "user_href": "/profile/Jane-Botten"
                },
                {
                    "user_id": "Iliass Ke",
                    "user_href": "/profile/Iliass-Ke"
                },
                {
                    "user_id": "Daniel Shai",
                    "user_href": "/profile/Daniel-Shai-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Les Matheson",
                "href": "/profile/Les-Matheson-1"
            },
            "answer_text": "I like the phrasing of the question: “become authentic self” is, I think, a meaningful idea. I mention that because often the topic is presented in terms of “finding your true self”, which I think is confused… for reasons explained below. To “become yourself” sounds sort of circular, right? Aren’t you already yourself? How can you become what you already are? It’s confusing. A lot of the confusion comes from simple ambiguity about the word “self”. Lacking a really solid definition, we thrash around with ideas about finding ourselves or becoming ourselves, but it’s hard to say what we’re seeking or becoming. First I want to argue with “finding yourself” — the argument is that this is a poor idea. Self-inquiry is a good idea: self-awareness is about turning on the lights in your mind and life so you can see what’s going on: noticing patterns, understanding subtle or hidden motivations, recognizing presumptions and beliefs which have gone unrecongized, etc. Self-awareness is very important, it’s the nutrition on the road to true self. But “finding yourself” implies that there is some thing which is your self, which is already present but obscured inside of you, yes? This means that a search is called for, and you have to discriminate between things which “are myself” and things which “are not myself” in order to conduct that search. How would you recognize your self if you saw it? If it already exists and has a form, you would need some kind of description or definition, and then you would compare everything to that definition to look for a match, right? That’s how we search for stuff. But true self is an odd kind of animal: there is no correct or complete definition of true self. It’s worse than that, even — it isn’t even possible to form a correct definition of self, because doing so involves “dualisms” — the splitting of a whole into parts… that’s how we manufacture ideas and language. True self is “non-dual”, which is a fancy way to say “you cannot render it as a definition in ideas or language”. So if you can’t have a definition of true self, the notion that you’re going to go searching for this thing kind of dies out, right? You have nothing you can use to compare stuff against. No valid concept of self to use as a reference in your search. That’s why I reject “finding yourself” as a meaningful idea. There’s a lot that you can learn about yourself with self-inquiry and self-awareness, but those things that you learn are not your self, they’re tendencies, preferences, attitudes, beliefs, narratives, skills, and so forth. They’re “stuff”. They’re the content of your mind and life, but they don’t define you. They’re not your “self”. With that one argument, we lose about 90% of the population in this conversation, because people are mostly convinced that they are indeed defined by the content of their mind and life. It’s so comforting to have a solid and well-defined identity, it provides an anesthetizing but false certainty that is good enough for many. But not good enough for someone who really wants the truth. But the question at the top isn’t about “finding yourself”, it’s about “becoming yourself”, and that’s different. To become myself does not require comparing a concept with an experience. I don’t have to go around with a photo of my self in mind, comparing it with things that I feel or think, etc. There’s not a search involved. You can be yourself, even without finding yourself. That’s the paradox to be unraveled. To use a metaphor, it’s similar to saying “I can walk, even though I don’t understand walking”. That is, I don’t know how to explain the details of how I manage to balance and not fall over when walking. If someone can’t walk, my explanation of balance and muscle movements isn’t going to help them. They can’t “find walking” within themselves somewhere. And yet, it is possible for a human to develop walking as part of their repertoire. Similarly, it is possible to be yourself, even without a fixed concept of what your self is. One way to think of that is that its sort of like being in the woods and smelling bacon — if you want breakfast, you walk toward the smell, and you try to sense when its getting stronger or weaker to help guide yourself. Somebody’s got a fire and a skillet, and your nose is your compass. In the domain of true self, the smell of bacon is “my sense of authenticity” — what rings true, what goes “click” and integrates with my experience of living? That’s like smelling bacon. For example, I’m in a meeting, and they’re talking about some work that I did. I feel a bit edgy, yes? This is a situation where I might be uncomfortable and disagree with someone’s viewpoint about my work. In that situation, I can focus on trying to defend my public image, or I can focus on “what would add the most value in terms of my own growth and my contribution to the team?” Which of these smells like bacon? To me, it seems obvious that defending my public image isn’t going to produce much breakfast. It doesn’t “ring true” with the totality of my experience of being alive — in the long run, in the big picture, if I can get my efforts aligned with my own growth and my contribution to the team, that’s a better, more authentic choice, than being defensive. If one keeps walking toward the scent of authenticity, transformation occurs. It’s not an all-at-once state change, it’s an unending process in which the old understanding sloughs off, and a new, more-complete one moves in and takes over… only to become the next old skin eventually. Along the way, one finds bacon over and over again, in different forms. It’s the commitment to authenticity which steers that journey, rather than the belief that there’s some fixed “final” true form to being myself. The word “commitment” has a lot more appeal for me than it used to. That’s one of the bacon breakfasts I had along the way — commitment is true self emitting light and making its own fuel. Within that larger topic about the value of commitment as a motor that makes life move, “commitment to authenticity” could be treated as a critical navigation tool. This is why I don’t talk much about “how to be happy” or “how to get what I want” or “how to get more self-confidence”, etc. To me, those goals are not good compasses. The much better compass is “which direction is the authenticity?” Where’s the bacon? ",
            "date": "Answered August 17, 2016",
            "views": "22",
            "upvotes": " View 30 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Smita Gaikwad",
                    "user_href": "/profile/Smita-Gaikwad-67"
                }
            ]
        },
        {
            "author_info": {
                "name": "Else Byskov",
                "href": "/profile/Else-Byskov"
            },
            "answer_text": "This is a post from my blog: newspiritualscience dot com Who am I? Most people identify with their physical body and firmly believe that they ARE their body. Consequently, they believe that they cease to exist when the physical body dies. Also, they do not think that they have a spirit or soul in addition to their physical body. They think that only that which can be seen and weighed exists. They do not acknowledge that matter of a non-physical nature exists. Non-physical matter Nevertheless, they make use of non-physical matter every day, when they speak on their cell phones, watch television, listen to radio or roam on the Internet from their cordless tablet. They use these things without realizing that they are making use of a type of matter that is invisible: electromagnetic radiation. Electromagnetic radiation is a type of energy and it has the specific quality that it can hold information. We all know that when we google something, then the information about the thing we wanted to know about comes flying through the air at light speed to our device. We find this completely ´normal´ and we do not realize that we are making use of an invisible type of matter. When then, minutes later, somebody says to us that invisible matter exists, we may deny this vehemently and get quite upset about this claim. However, in this day and age, it is not up for debate whether invisible matter exists or not. We all know that it does, as we make use of it every day. For that reason, it should not be hard to convince anybody that our spirit can and does consist of the same type of matter. Electromagnetic radiation exists in a huge range of frequencies and wavelengths, so it is not just one ´thing´. It has so many different ways to express itself and so many frequencies that we do not know them all. From our use of electromagnetic radiation, we know that this type of ray-formed matter can contain information. It has the double characteristic that it contains energy and information at the same time. Consciousness The same is valid for our consciousness. It also consists of a type of electromagnetic radiation. It also contains energy and information. We cannot see our consciousness and we cannot weigh and measure it, but we know we have a consciousness, because without it we would not be able to think, reason and make decisions. Our consciousness holds all the information about who we are. Our consciousness sits like a bubble around our physical body and it can also be visualized as our aura. The consciousness enters the body via the brain, but it does not dwell in the brain and it does not originate there. It is the consciousness that keeps the body alive because it is a field of energy, and it is the same as our spirit. Our consciousness holds all the information about who we are. We can also say that we ARE our consciousness. It holds our ´I´ or sense of self and everything that defines who we are, such as the totality of our thoughts, our memories, our intelligence, our character traits, and personality, our likes and dislikes, our emotions and patterns of reaction, our morals, the basis for our behavior, and all the knowledge that we have accumulated. These traits are a very important part of who we are, indeed the most important part, and yet none of these are physical. None of the ´ingredients´, that define who we are, are physical. Yet it is obvious that we have them. Without them we wouldn’t be who we are. Our consciousness accompanies us from life to life We ARE our consciousness and it is something that we build up over our many lives on the physical plane. All our experiences and talents are stored in our fate element, which forms part of our supra consciousness, and it accompanies us from life to life. All the tings we have become good at through practice in former lives, are stored in the fate element, and this means that we take our talents with us into each new physical life we live. Isn´t that great? All the abilities we have worked hard to achieve are not lost, but we take them with us. This explains why so many child prodigies have huge talents for singing, playing a musical instrument, for painting, reading and writing at a very early age. On YouTube there are many examples of this and it is awe inspiring to watch how good the children are at performing their practiced talent. See for instance these clips: removed by Quora So, we are the result of our many lives on Earth, we are the accumulation of all the things we have practiced, all the experiences we had in former lives and all the things we have learned. If we have suffered a lot, we will be compassionate and humane, and we will want to help others who suffer. Not everybody has come equally far on their journey, but that is of no consequence. We are all on our way to becoming perfect human beings. When the spirit or consciousness leaves the physical body, during the process we call death, this body becomes a corpse, because it was the consciousness that supplied energy to the body. Our field of energy does not cease to exist when the body dies What we need to understand is that we are our consciousness and that it is a field of energy. This field of energy does not cease to exist when the body dies. It then moves on to the spiritual plane, where it stays for some time until it is again ready to reincarnate. We always have our spiritual body, but it is only occasionally that we also have a physical body. When we reincarnate into a physical body it is because we have something more to learn on the physical plane. We then go ´back to school´ and we stay ´in school´ as longs as our physical instrument serves us. When it is worn by old age or injury, we discard it and go back to the spiritual plane. We are spiritual beings who have a physical experience from time to time. We always have our spiritual body, but we do not always have a physical body. We are NOT our physical body, but our spiritual body with our consciousness and sense of self. We are eternal beings on an everlasting journey through spiritual and physical realms in a universe where the basic tone is love. ",
            "date": "Answered February 7, 2020",
            "views": "344",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Grimshaw",
                "href": "/profile/Mark-Grimshaw"
            },
            "answer_text": "Before getting down what you should be doing it may be useful to consider knowing you are your true self. After all it is either your false self or some other self that is determining if you are your true self or not. It doesn’t seem that useful to put effort into doing things, addressing how, without being sure you know if efforts have been rewarded or not. In this case, having a means to be sure you are your true self or not will show you clearly if your efforts have been successful or not. You need to be clear how you will be sure you are your true self of yourself before doing things to become your true self. Otherwise, you will be destined to put effort into changing but not know if you are moving toward or away from your true self. Or coming at it another way, if you have no basis to be sure which is your true self, every self is your true self. Perhaps it might be interesting to ask why you would do things towards becoming your true self if you have no way of knowing for sure when you are your true self. Perhaps we can learn from others. There are many people who encourage others to be their true self and the like. We would expect those encouraging others to make efforts be your true self to articulate how they know they really are their true self. Otherwise, they are prompting others to do things towards something they themselves don’t know they have achieved. It can be interesting to ask advocates of becoming your true self of yourself how they know they are their true self. Are you able to pick up practical ways and means to which clearly indicate they in actuality have become or found their true self? Being your true self of yourself is a worthy aim and an important step is to be clear what being your true self means and how you know you are your true self before putting effort into it. If you find a clear and practical means to determine if you are your true self or not, great - I’d be interested to know what this is. However, if you are finding it difficult to gain clarity on how this is achieved it can be useful to consider if the ‘true self’ is something that is useful in practice and why other people might promote the need to be your true self when it appears they have no clear means to know if they are actually their true self or not. ",
            "date": "Answered September 24, 2019",
            "views": "74",
            "upvotes": " Answer requested by Paul Madden",
            "upvoters": [
                {
                    "user_id": "Santosh Marandi",
                    "user_href": "/profile/Santosh-Marandi-18"
                },
                {
                    "user_id": "Vinay Rajupalepu",
                    "user_href": "/profile/Vinay-Rajupalepu"
                },
                {
                    "user_id": "Laura Skalošová",
                    "user_href": "/profile/Laura-Skalošová"
                },
                {
                    "user_id": "Anupam Kumar",
                    "user_href": "/profile/Anupam-Kumar-346"
                },
                {
                    "user_id": "Kusum Basnet",
                    "user_href": "/profile/Kusum-Basnet-2"
                },
                {
                    "user_id": "Paras Oza",
                    "user_href": "/profile/Paras-Oza-1"
                },
                {
                    "user_id": "Johnny Ricks",
                    "user_href": "/profile/Johnny-Ricks-4"
                },
                {
                    "user_id": "Adittya Singh",
                    "user_href": "/profile/Adittya-Singh"
                },
                {
                    "user_id": "Kushal Ghosh",
                    "user_href": "/profile/Kushal-Ghosh-22"
                },
                {
                    "user_id": "Sadhna Kant Shukla",
                    "user_href": "/profile/Sadhna-Kant-Shukla"
                },
                {
                    "user_id": "Rohit Meachu",
                    "user_href": "/profile/रोहित-मेंचू-Rohit-Meachu"
                },
                {
                    "user_id": "Pranav A",
                    "user_href": "/profile/Pranav-A-5"
                },
                {
                    "user_id": "Hiten Chandika",
                    "user_href": "/profile/Hiten-Chandika"
                },
                {
                    "user_id": "Aman Mishra",
                    "user_href": "/profile/Aman-Mishra-246"
                },
                {
                    "user_id": "Deepak Thakur",
                    "user_href": "/profile/Deepak-Thakur-249"
                },
                {
                    "user_id": "Krishan Chaudhary",
                    "user_href": "/profile/Krishan-Chaudhary-25"
                },
                {
                    "user_id": "Archana Negi",
                    "user_href": "/profile/Archana-Negi"
                },
                {
                    "user_id": "Debolina Chakraborty",
                    "user_href": "/profile/Debolina-Chakraborty-3"
                },
                {
                    "user_id": "Thiwin (तिविन इम)",
                    "user_href": "/profile/Thiwin-तिविन-इम"
                },
                {
                    "user_id": "Piyush Kumar Prajapati",
                    "user_href": "/profile/Piyush-Kumar-Prajapati"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeffrey Werbock",
                "href": "/profile/Jeffrey-Werbock"
            },
            "answer_text": "You need to learn the skill of impartial self observation, then you will see yourself not as others see you but as you actually are, moment to moment, day to day. No one is born with this skill, it has to be learned and it cannot be learned via words alone so all the books and lectures can do is to spark some curiosity, a bit of encouragement like a pep talk, but the skill can only be learned by example of someone who knows how. They are very rare these days so good luck finding a teacher. Impartial self observation means paying careful attention to what it feels like to be alive, which means paying attention to the body and how it moves, how it speaks, how tense it is, etc. Paying attention to the body while it is in action is very difficult because normally our attention is completely immersed in and engulfed by the contents of the thought stream - a continuous murmur of words and associated images - and not free to notice the physical, except when something hurts. To focus the attention on the body, first the grip of the contents of the thought stream must be reduced enough to let go. That begins with noticing how enmeshed the attention is in that stream of thoughts. To begin, we look at ourselves in a moment, take a snapshot, so to speak. We do this often enough and gradually the snapshots run together to make short video clips of ourselves in action. Then you get to see a lot more. This is hard work and it entails being even more uncomfortable than we already are from just coping with the normal challenges of life. Not a lot of people would volunteer to increase their discomfort, just for the sake of having a few impressions of themselves in action. One more thing to bear in mind; once you start the path of impartial self observation, you can’t go back and it tends to spoil some of the fun as the foolish dreams we sustain in our minds that give us pleasure begin to weaken under the glare of attention. Another thing to bear in mind; the sense of self (that which you say you wish to know) is based on a kind of illusion; in order for a body to be able to navigate its surrounds, it must first generate the feeling of being separate from those surrounds. This feeling of being separate is the basis of what we call “I”. However, in reality, we are not separate; there is no border between what we regard as the body and what we regard as the rest of nature. Energy / matter in, energy / matter out. The current of energies and materials pouring into us and pouring out of us makes us contiguous with the rest of nature, but it is not possible to navigate when we are conscious of that contiguous flow. So the “I” is established and then as experiences accumulate and memories begin to form, all the interactions with others begin to make us form a whole bunch of mini-selves. We have a self for each and every social situation; it’s like a merry-go-round of “me”s. This is what needs to be impartially observed. There are many selves; there is only one attention. ",
            "date": "Answered July 9, 2020",
            "views": "388",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Keisha Flowers",
                    "user_href": "/profile/Keisha-Flowers-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kit Yee Cheng",
                "href": "/profile/Kit-Yee-Cheng"
            },
            "answer_text": "Great question!  I only recently learned what being my true authentic self means. My boyfriend had years of therapy as he was so damaged from his dysfunctional family set up. He taught me that I also came from a very dysfunctional family and that caused so may of my issues during my life and why I attracted the people and circumstances into my life. He also taught me that he loved me for who and what I was and what I am, because I was crazy as in a good sense of crazy by being myself ( the person who I was born to be ). I felt safe being myself in the presence of my boyfriend,  yet because I was shamed by my dad since I was a child, I felt shamed everything I was being myself in dad's presence whenever I was being myself. My dad even shamed me in the presence of my boyfriend the first time he met my boyfriend. I was merely being myself.  So to answer your question, it takes a lot of hard work, time, effort and money to work on ourselves as we have all been damaged to some shape or form in our past, especially during our childhood. So being our true authentic self requires healing from our past emotional pain and until we do the work with a professional to heal, we are very unlikely to become our true authentic self.  For me, Being our true authentic self is:  about having the courage to be open and honest about who and what we are. To drop the mask that we wear so that we are accepted by society, by our friends and family, by our colleagues and associates. To drop the need to fit in, to drop the need to feel accepted, approved and please others. To focus on ourselves and drop the need to be concerned about what others shall say or think about what we say or do. To feel our emotions and acknowledge our weaknesses, flaws, vulnerabilities and fears without ignoring them, no matter what others say.  To totally accept ourselves with all the negative emotions, flaws, imperfections, vulnerabilities and fears. To be open and honest with ourselves and others. To live our lives for ourselves and never for the need to keep others happy. To be confident enough the stand out from the crowd instead of being a follower. To express our own thoughts, feelings and opinions to others without the fear of being judged, labelled, ridiculed, critisized etc etc. To be free to live a life of who and what we were born to be without fear.  ",
            "date": "Answered January 22, 2016",
            "views": "125",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mani Mohan Nehru",
                "href": "/profile/Mani-Mohan-Nehru"
            },
            "answer_text": " Who am I? Who am I? This is a very difficult question to answer for most of humanity! We do not know ourselves well enough- our self- concept is hazy! Our self- concept is often a summation of consistent views expressed by others about us. The views are often something like this: Mother: “You can never get up in time!” “You are totally irresponsible!” “You can never keep your things properly!” “You stay in bad company- your friends will spoil you!” “You are only fond of playing; see your neighbor, how much he studies! I don’t know if you will be able to do any work!” “You are too simple! The World is too bad! I don’t know how you will manage?” Teacher: “You talk too much!” “You never finish your homework in time!” “You don’t pay attention in class!” “The way you are going, you will find it difficult to get admission in any good college!” Friend: “You are very straightforward; you should be more diplomatic!” “X has said that he will beat you in the race! He is practicing very hard!” Should we form a self- concept on the basis of above views, which are all well-meaning, but reflect the insecurities of the Mother, Teacher & Friend? Is there another way to form a self- concept? Introspection is another method. You assess yourself based on self- analysis & ignore the views of others. This method has only limited reliability. We may overrate/ underrate our positive/ negative traits. Our assessment is subjective and ignores the value of demonstrated behavior. Let us learn about a very important research- “Self- fulfilling Prophecy”. (Pygmalion Research-1968) Self- Fulfilling Prophecy The original research of Rosenthal and Jacobson focused on an experiment at an elementary school where students took intelligence pre-tests. Rosenthal and Jacobson then informed the teachers of the names of twenty percent of the students in the school who were showing “unusual potential for intellectual growth” and would bloom academically within the year. Unknown to the teachers, these students were selected randomly with no relation to the initial test. When Rosenthal and Jacobson tested the students eight months later, they discovered that the randomly selected students who teachers thought would bloom scored significantly higher. Higher expectations of teachers induced higher performance. This showed the immense power of the ‘self- fulfilling prophecy’. The logic of ‘self- fulfilling prophecy’ applies almost universally. High expectations induce high performance, while low expectations induce low performance. How the above knowledge helps us to answer the question who am I? Self-Discovery Let us note some facts. Fact1-It is very difficult to form an accurate clear self- concept. Fact 2-Human capacity for growth is unlimited. Fact 3-By being proactive we can unlearn poor habits & learn good habits & thus change our personalities for the better. Keeping the above knowledge in mind, can we now formulate the answer to the question-“Who am I?” Forming a Clearer Self- Concept We are able to develop a hazy self- concept through opinion of others and by introspection. We can live with it, or make it more accurate by assessing ourselves:- ‘FORM A SELF- CONCEPT ON THE BASIS OF CONSISTENT, DEMONSTRATED BEHAVIOR, RATHER THAN ON THE BASIS OF OUR THOUGHTS & PERCEPTIONS’. It is not an easy exercise, but feasible to form a more accurate self- concept. Create your Personality Now visualize as to what type of person you would like to be- ideal self- image. There would be differences in the ideal self- image & the self- concept. Some habits will have to be given up, which are unworthy of you, but form part of your personality because of various environmental influences and your choices. It will take time & effort. Similarly some new habits will have to be formed. Thus you will always remain on a journey of self- improvement, because as you mature your ideas will also evolve & so your ideal self- image will also keep changing. All this improvement will take place in incremental small steps. A reactive person will accept himself/herself as evolved due to the impact of genes and environment. The person believes that the negative aspects of the personality are to be lived with. For a reactive person the answer to the question ‘who am I?’ is that the basic nature cannot be changed and he is how God made him and the environment shaped him. Proactive Person’s Answer to Question- Who am I? The answer to the question, ‘who am I?’ by a proactive person will be- “ I AM AN EVOLVING PERSON, WHO HAS A FAIRLY ACCURATE IDEA OF WHO I WOULD LIKE TO BE & AM SLOWLY MOVING IN THAT DIRECTION” Be a proactive person and create your personality as desired! ",
            "date": "Answered July 23, 2017",
            "views": "4",
            "upvotes": " View 54 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kerrie Wong",
                    "user_href": "/profile/Kerrie-Wong-3"
                },
                {
                    "user_id": "Bharti",
                    "user_href": "/profile/Bharti-148"
                },
                {
                    "user_id": "Liam Gabray",
                    "user_href": "/profile/Liam-Gabray"
                },
                {
                    "user_id": "Wong Cheng",
                    "user_href": "/profile/Wong-Cheng-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Parr",
                "href": "/profile/John-Parr-49"
            },
            "answer_text": "How do I find myself? I’ve never felt so lost. I don’t know who I am or where I belong. Check out Jordan B Peterson on YouTube. Practicing clinical psychologist and professor, his channel there is a vast library of encouragement, with over 400 videos to consider.Thankfully many people post short clips of his work which can be useful for momentarily delving a topic further.For the few times you will need it, bring your dictionary because words matter. Depending on where you are at in life, perhaps the younger should start with his ‘Personality’ series and his ‘Maps of Meaning’ series, while someone older may prefer to watch his ’12 Rules Tour Iceland (1&2)’ first. Jordan got his PhD through books, but his words present something more meaningful than can be typically be found in books, because his is a voice of experience, a voice of one who has grappled personally with many of the demons of which he speaks. In short - the voice of experience. He has been to Hell, and now offer us his maps of the way out of Hell, and ways for us to not be making Hell any worse than it already is. Is it possible to find yourself? Yes, but you need to do the work and make the decisions. Of course the man has his nay sayers.But if you study Jordan’s work first, before checking out what the critics have to say, you will first find that Jordan actually openly invites reasoned criticism of his work so that what emerges is stronger, and you will subsequently find the criticism unreasoned, and often based on seemingly intentional misinterpretations. Invest some serious time in these videos and get better.Best for you to stick with his own YouTube channel to begin with, in order to avoid these deliberate misinterpretations, which are potentially harmful.If you wish to join the critics afterwards - more power to you.You will be a rarity in that you will have at least have watched more than a 10 minute edited version of his work before joining the nay sayers who profit handsomely from their professional blather through advertising dollars. Where ever you go, people always try to ride on the tail of the great,Many are those who make themselves taller by cutting off the heads of others.While checking out the critics, ask yourself if they are trying to tear something downOr, are they trying to build something better?Then you decide which is which and who is who while you keep getting better and better. ",
            "date": "Answered August 14, 2020",
            "views": "63",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lori Kat",
                    "user_href": "/profile/Lori-Kat"
                },
                {
                    "user_id": "Shaukat Mulla",
                    "user_href": "/profile/Shaukat-Mulla-1"
                },
                {
                    "user_id": "Pradnesh Patil",
                    "user_href": "/profile/Pradnesh-Patil-2"
                },
                {
                    "user_id": "Max Ravi",
                    "user_href": "/profile/Max-Ravi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tracey Hey",
                "href": "/profile/Tracey-Hey"
            },
            "answer_text": "The first step I would take is to figure out why you don’t know yourself well. There are many reasons this can happen to someone: Have you allowed devotion to something – your career, an ideology – to completely overwhelm paying attention to other important things? Have you been too busy trying to fulfill expectations of your family or yourself or society? Then you may lack the energy or time to be yourself and make your own choices. Do you put on a social face - like that of a manager or someone that you want people to like - and struggle to take it off? Or is there something that is making you avoid facing yourself? Is there something painful or negative you are trying to escape, like difficult experiences or stress? Or is there something you don’t like about yourself -- such as a personality trait or dark thoughts or something that makes you feel different from other people? When you try escape yourself –by engaging in compulsive behavior like overwork or fantasizing or lying to yourself or a million other means, then you may stop recognizing yourself. Do you struggle to feel or identify your own emotions or thoughts? For example, do you may often find yourself smiling and thinking content thoughts but not feeling the emotion of happy. Or do you become anxious but not realize your heart is pounding. Do you have too many thoughts that go too fast or are too intangible?  Many things can cut people off from their thoughts or emotions. This can include stress from life events, a difficulty fully perceiving or connecting to your body, drugs and alcohol (including prescription drugs), mental illness or a personality that feels emotions too little – or, on the other hand, too intensely to handle.   Have the things you do, think and feel changed so much or so often or that you struggle to see a stable self across time? With frequent pronounced mood changes, your entire perception of yourself and the world may keep shifting. Feel extremely low, and you may think the world is terrible and you are terrible. Feel very well, and you feel the opposite. If you experienced a profoundly life changing event (good or bad), who you are may have changed so much that you are struggling to catch up. Then your solutions should be based on what your problems are. For example, if you have trouble keeping track of thoughts, feelings and beliefs,writing in a journal and methods of self-expression like art and music may help. If you are overwhelmed by what other people want, teach yourself to say no and accept that being oneself may mean that you can’t please everyone.   It may be hard, you might be dealing with several of these issues and you might have to try many tactics. But every step you take can enrich your life. I wish you well. ",
            "date": "Answered June 22, 2018",
            "views": "535",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Heather Althouse",
                    "user_href": "/profile/Heather-Althouse"
                },
                {
                    "user_id": "Joachim Joseph",
                    "user_href": "/profile/Joachim-Joseph-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bernadette Balla",
                "href": "/profile/Bernadette-Balla"
            },
            "answer_text": " Here are some of the questions I used to ask myself throughout the years, they have helped me a lot. What makes you come alive? Nurturing the side of you that makes you come alive will infuse you with passion for the years to come. It’s important to know this – it’s also what will keep you going when times get hard. It can be anything from the people around you to the job you do or your hobby. Once you find what you enjoy the most, hold onto it tightly! Who do you admire the most? Taking a look at the person you admire the most can show you the values you have. Most of the time, we idolize people because they share the same set of core values with us. My idols are Princess Diana, Albert Einstein & Oprah Winfrey. I admire their endurance and persistence in life and reading their life stories has taught me not to give up on my hopes and dreams. What are your strengths & weaknesses? How can you utilize your strengths the most to get the life you want? You cannot work on finding your true self if you’re not aware of your own strengths and weaknesses. Now, I’m not saying this to criticize you – everyone is flawed! But being aware of your flaws gives you a whole different power. You know who your inner demons are and you don’t let them take over in times of doubt. As far as your strengths go, that’s where your natural talent is hiding. EVERYONE is talented for something, trust me! Use your strengths well and you’ll increase the sense of content & security in life. Nothing keeps me as grounded as knowing that I can handle whatever life throws at me. Finding my true self has been one of the best actions I’ve ever invested my time in. Intuition is Your Superpower: Learn how to follow your gut! - Kindle edition by BERNADETTE BALLA. Religion & Spirituality Kindle eBooks @ Amazon.com. ",
            "date": "Answered January 31, 2020",
            "views": "132",
            "upvotes": " Answer requested by Zayyad Amoto"
        },
        {
            "author_info": {
                "name": "Sabri Shahin",
                "href": "/profile/Sabri-Shahin"
            },
            "answer_text": "It is o.k. to ask questions like who am I?, why am I here? Where is the destination?; that is a wise thing to do. Regardless of how successful we are with our personal objectives, we may not feel good without addressing the high-level objective; the purpose of our existence. It is wrong to say ‘let us enjoy the journey and forget about the destination’ If you find yourself in a train, you should not enjoy the beautiful scenes before first ask: why am I here? Where is the destination? We should first ask ‘what is the purpose of life?’ What is the value of life if we do not know the purpose of that life? It is the greatest good for an individual to discuss virtue every day...for the un-examined life is not worth living – Socrates Our life on earth is a very short period compared to the universe time scale; It could be a temporary test period. God is testing us in our short life on earth; the wealthy father has the right to test his children before distributing the wealth. Testing missions are not supposed to be easy and comfortable. The test questions are not supposed to be known in advance. Our life on earth is a very short period compared to the universe time scale; It could be a temporary test period. There are hundreds of verses and teachings about that as mentioned in the following answer: https://www.quora.com/How-do-we-know-our-purpose-of-existence-in-this-world/answer/Sabri-Shahin We have been asked to believe in God and Heaven but we have not seen God or heaven. Our fate will be determined based on that belief and on our good deeds. Why did God make it a difficult test for us? Although God knows what’s in our hearts and what each of us might do, he tests us and wants us to witness our own test results in order to admit that we have been fairly rewarded according to our achievements as recorded in the test results Before the wealthy father distributes his wealth, he may want to record which son is obedient, the records are not for the father who knows, but as a testimony for people who might question the justice of their father Although the wise teacher knows the hard-working student and the lazy student, he prepares regular exams as testimonies so that the students would not say that the teacher had favored some students over the others. Exams also urge students to get prepared in order to succeed We have not created the gifts of sight, intelligence, conscience, and many other gifts. Those who can see the miracles in everything around them and in their own creation then deny the existence of God, those must be mistaken. There are many verses in Judaism, Christianity, and Islam to teach that God has created everything in heavens and earth. There are many other verses to teach that we are here for testing and there is an afterlife. God has sent prophets to notify people that he has created and fine-tuned everything for them like the father who prepares good environment for his children to live. God has empowered each of us to be happy and blessed. God has enabled people to choose their own destinations. God does not predetermine plans for us. God has delegated that task to us, it is up to us to be blessed or to be cursed. The message that God has revealed to all prophets is: ‘Blessings for obedience and curses for disobedience’ All prophets taught that we can earn salvation by obedience, repentance, and good deeds to help others. “In obedience and repentance is your salvation” Isaiah 30:15 Based on the above, the obedient believer should be blessed in this life and should be saved in the afterlife. That is the truth which should set you free. The following answers include more details; the contents are copied from my Amazon book 'towards a better life' https://www.quora.com/How-do-we-know-our-purpose-of-existence-in-this-world/answer/Sabri-Shahin https://www.quora.com/What-makes-us-happy-in-our-lives/answer/Sabri-Shahin https://www.quora.com/Is-eternal-hell-fire-true/answer/Sabri-Shahin https://www.quora.com/What-are-Gods-greatest-teachings/answer/Sabri-Shahin Sabri Shahin's answer to When did you realize that there is (a) God ? https://www.quora.com/What-is-your-meaning-in-a-meaningless-existence/answer/Sabri-Shahin Sabri Shahin's answer to What's your favorite Bible verse? Sabri Shahin's answer to What if God offers you a job, will you accept it? https://www.quora.com/Will-religions-ever-stop-competing-against-each-other-Do-you-think-there-ever-be-a-time-of-cooperation/answer/Sabri-Shahin https://www.quora.com/How-do-we-reconcile-science-and-the-existence-of-a-god/answer/Sabri-Shahin https://www.quora.com/What-is-worse-than-dying/answer/Sabri-Shahin https://www.quora.com/What-are-the-foundations-of-happiness/answer/Sabri-Shahin ",
            "date": "Answered December 26, 2018",
            "views": "600",
            "upvotes": " Answer requested by Rajan Thapaliya"
        },
        {
            "author_info": {
                "name": "Kaye A. Peters",
                "href": "/profile/Kaye-A-Peters"
            },
            "answer_text": "When I became more serious about Me, and began to ask more introspective questions of myself…Who am I? What do I want to accomplish? Am I happy? Who/what is responsible for my happiness? Are there things I want to change about myself? Funny thing, when one begins to ask questions, answers appear from all kinds of different sources: I meet new people who exemplify things I’d like to emulate; a book will come to my attention. I began to meditate; I began to trust my own intuition. I began to know my true self. We are more than a body and personality. I’ve always had Faith in a power greater than myself. I am a spiritual being living in a human condition inextricably connected to and loved and supported unconditionally by God, Source, Universe, Creator since I became. I began my personal transformation at age 78, when I started up my blog, Liferays.net. Little did I know this innocent inquiry would ultimately lead me to an excavation of myself to my authenticity to this very minute and life has taken on very different meaning and fulfillment too. I think I ignited ‘ready-to-come-to-service’ sparks from within. I wrote three books! Self-fulfillment has become more important to me than material things and human status. Understanding became more important than being right. How I feel about something means more to me than if others agree or disagree. The list goes on. ",
            "date": "Answered December 29, 2019",
            "views": "118",
            "upvotes": " Answer requested by Jennifer Ghresh and Zayyad Amoto"
        },
        {
            "author_info": {
                "name": "Dominic Cote",
                "href": "/profile/Dominic-Cote"
            },
            "answer_text": "What is your true self? We are products of the societies we live among. How do we work to become better? Better for all beings is easily said but undeniably difficult under any circumstance as we look at the world today. If you are asking who is it behind the facade of ego or consciousness then this is simple. By asking ourselves what we are not is the first goal. We are not our bodies or our senses, we are not that constant voice or those images within our mind. With an honest attempt to find yourself through meditation you will find that we are spiritual beings having a human experience and to find this as truth we must go back to the source. Something in us knows, deep in the gut or the heart, perhaps at an unconscious level, that we are made of more than just the sum total of our body, thoughts, feelings, and life situation that we are living at the moment. One must ultimately turn consciousness away from all known objects, from all external phenomena, conditioned thoughts and sensations, on the other side of consciousness itself. Toward the inner source, the heart or essence of one's being and ethics, discipline and meditation is the key. Ask yourself “Who am I” because no-one can convince you otherwise. The highest level of meditation which has been named Nirvikalpa Samadhi there's a cessation of self activity, of all seeking and doing. We can only speak about what falls away as we approach it and what reappears when we return from it. There is neither perception nor non-perception, neither \"thing\" nor \"no thing\", neither consciousness nor unconsciousness. It is absolute, unfathomable, and inscrutable to the mind. When the self returns to activity there's a not knowing; a kind of rebirth, and everything becomes new again. We are left with the perfume of the divine, which lingers longer as one evolves on the path. ",
            "date": "Answered July 26, 2020",
            "views": "41",
            "upvotes": " Answer requested by Paul Madden"
        },
        {
            "author_info": {
                "name": "Vibhav Shirke",
                "href": "/profile/Vibhav-Shirke"
            },
            "answer_text": "The entirety of the human race seeks this answer. I think it is a mistake to ask this question. The question one should ask instead is; who can I become? The problem with this question is that it places you in a box. So, if someone asks you who you are you say stuff like, “ I am a common man”. Once you define yourself as a common man, you are destined to become one. I also think it is lazy to seek this answer, because it robs you of your potential. I think human beings are a treasure trove of infinite potential. We have so much potential, we have been to the moon. For me the answer to this question is more like a quest, I go through life everyday, I do things, I get good at a few and no so good at others. The things I do help me reveal a new side of myself, that I wasn't aware of. I don't mean quit your job, travel , become a yogi etc. But a simple things like solving a Rubik's cube, talking to a beautiful girl, a walk in the park with a 2year old. I learn a lot of things, I pay attention to things I like, rather the things that catch my attention and ask myself why do I like this ? Then I write about it, or google it. If you want to know more about human nature, then read. All I wanted to say was that , you are a treasure trove of potential, and you can be who you want to be if you use that potential properly. ",
            "date": "Answered July 11, 2017",
            "views": "523",
            "upvotes": " View 4 Upvoters"
        },
        {
            "author_info": {
                "name": "Kim Dawg",
                "href": "/profile/Kim-Dawg-1"
            },
            "answer_text": "The best thing to do is do self observance. Observe your actions and analyze them. Analyze what you do and increase self-awareness. Whether it be mindfulness or meditation which is helpful when it comes to confusion, lack of direction etc. A short cut. Take the personality test online that’s used universally. It’s called the Meyers Briggs personality types. Take the test to see which personality type you are. This is credible. I had to to take the test through out high school. The personality test is extremely useful and used universally through out the world. You’d be surprised how many students, adults and people know about Meyers Briggs personality types. There are 16 I believe. I am an ENFP. Along with finding out what type you are you learn a lot about the personality type. Including careers, skills, reasoning, weaknesses, relationships, family, motives, behavior, etc. once you find the personality type you resonate with personally, you can do more research on it and Basically your personality will be summed up. You will learn a lot. ",
            "date": "Answered September 7, 2020",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sabrina Merrit",
                "href": "/profile/Sabrina-Merrit-1"
            },
            "answer_text": "For me, it’s through astrology. By learning to put into words my emotions, thoughts and tenancy’s its been very therapeutic to me. I am able to see what it is that makes me happy. I know it might sound far fetched but please give this a try; Find out where you were born (which hospital or location), then type into google and find the co-ordinates of the building you were born in and keep noteFind out what time you were born, now this is just as important as finding the correct longitude and latitude of where you were bornFind out what the ‘time zone’ your city is in. So for example; mine is in Coventry so my time zone would be ‘Greenwich Mean Time’ ‘GMT’ or ‘UT’. Not going to lie I did struggle to find this out myself so just type in your city and the time zone and it should come up with an answer that is available in the scroll down bar on THIS WEBSITE:https://astrocrystals.com/portal/free-birthchart-interpretation.php (I am not sponsored by this website I just feel it is incredibly helpful and the upmost accuracy. Astrology wont make sense if those three things mentioned above are not specifically correct. The time can give or take a minute or two so don’t worry so much.But yes once gathered the information and short description (or long if your not into detail) you can use this as a platform to know your strengths know your weaknesses on who you are and what you need to do to succeed and be happy as your individual self. I want to say that I myself am a christian, and have discussed this topic with other religious backgrounds and just know it does not go against religion of any kind as it merely shows your tendency as a person, as a result of the planets moving around you and what affect this has on you. Who MADE the solar system is merely up to you to decide. But think about this, Just like the full moon it has an affect on the waves in the sea and I myself have witnessed behavioral changes in people when this occur in care homes, hospitals and mental health hospital ect. and even family members. Lol ;) but yeah essentially speaking Who made the solar system is up to you. Sorry to ramble had to say it, as I myself am religious. But yes definitely do that for yourself, it can help us all become better people and achieve happiness and success. By knowing your flaws, became a great journey of acceptance and you can change the things you don’t like about yourself or at least understand. ",
            "date": "Answered April 7, 2020",
            "views": "121",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Laurence Mather",
                "href": "/profile/Laurence-Mather"
            },
            "answer_text": "We can get information about Buddhism by reading or hearing about the ‘4 Noble Truths’ but, to understand them in a way that leads to liberation requires deep committed inquiry. We all know that Buddhist practice involves a hands-on approach. Academic study is important and we are grateful for it. However, to realise the ‘Dharma’ (that which sustains and liberates) we immerse ourselves in it and, let go. Our body, speech and, mind will need to be fully engaged if we are to wake up and live the Dharma in its fullness. The word ‘truth’ has more than one meaning. The philosopher ‘Ludwig Wittgenstein’ Continue Reading",
            "date": "Answered April 7, 2020",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nagarajan Ramachandran",
                "href": "/profile/Nagarajan-Ramachandran-3"
            },
            "answer_text": "You intuit your true self and it could be done NOW. It is that simple. Here is my answer to nature of consciousness.  Consciousness is a concept and not a “thing”. Consciousness arises simultaneously with perceptions and subside with them as well. Perceptions = Seeing, hearing, smelling, tasting, feeling and thinking. Consciousness cannot be separated from perceptions. Consciousness is not a “thing”, it is a concept. From where does perceptions which is inseparable from consciousness arise? Let us study deep sleep. In deep sleep there is no time, no space, no creation and nobody but just silence and sti Continue Reading",
            "date": "Answered November 29, 2019",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Min Khin Kyaw",
                "href": "/profile/Min-Khin-Kyaw"
            },
            "answer_text": "You can discover what exists. You can’t discover what doesn’t exist. You’re looking for ‘real me’. Who told you it exists? Had that person found his/her ‘real me’ when he/she told you about it? Or is it just your imagination? Did the thought occur to you there might be ‘real me’? If not, have you ever seen people who found their ‘real me’? If not, you should search for them. Or you would like to make a survey so many people can answer in a short time. You began with the first cell, the only cell, that divided itself and caused billions of cells to develop into organs, body parts, skin, nerves… as t Continue Reading",
            "date": "Answered July 23, 2017",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mike Rommel",
                "href": "/profile/Mike-Rommel"
            },
            "answer_text": "A2A How does one discover their true self? Great question Maddison. We do that by looking into God’s word. God alone knows each of us inside out. We like to think of ourselves as being pretty nice, but God searches our hearts and knows better. I am not saying that no one seeks God, that is not true. When people do that they become new creations. But in our natural state, this is what God has to say about us. Jeremiah 17:9 ESV The heart is deceitful above all things, and desperately sick; who can understand it? Romans 3:23 ESV For all have sinned and fall short of the glory of God, 1 Corinthians 2:14 Continue Reading",
            "date": "Answered April 7, 2020",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lionel Loquias",
                "href": "/profile/Lionel-Loquias"
            },
            "answer_text": "This is a path that is unique to each person. The first steps are dependent on many factors such as age, social class, physical strengths/limitations, educational level etc. What is common about all the paths is conflict. The conflict usually begins with a question. The individual senses something wrong with what entails their daily lives. Their relationships, the perceived necessity of hardships that are endured, being wronged by a trusted belief, and what they believe what are their personal limitations are just a few common initial conflicts. People who do not actively choose to take the pat Continue Reading",
            "date": "Answered March 3, 2016",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sue Dhillon",
                "href": "/profile/Sue-Dhillon"
            },
            "answer_text": "You find your inner self by spending time with yourself. Quieting the noise. Learning to sit in silence and drop in. This is where you’ll discover your inner self. All of the external stimuli in life can be a lot. We are always on the go. We need to learn to slow down. Meditation is one of the most powerful things at our disposal. When you begin to sit in silence you begin to receive the world in a whole new way. You elevate your level of consciousness when you’re in a meditative state. The more you do this the more in acceptance you are of all that is. Thoughts come. And you let them go. They co Continue Reading",
            "date": "Answered January 29, 2020",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jesse Silva",
                "href": "/profile/Jesse-Silva-16"
            },
            "answer_text": "A great and common question. But it may be the wrong question. It may be too broad, in that you are a vast array of descriptions. While I agree with others that much of who we are are perceptions we have of how others think of us, how we interpret those perceptions and create more perceptions of ourselves with that information, at any point we can stop and get mindful of this perceptual chaos. We can start with our beliefs. In any moment, what belief is driving your emotional state and behavior? Being curious like this might allow you to discover pathways back to stories that you tell yourself w Continue Reading",
            "date": "Answered August 30, 2019",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ron Whitaker",
                "href": "/profile/Ron-Whitaker-1"
            },
            "answer_text": "A2A I'm not going through all the other answers.  First off - You are already your true and authentic self. Your definitely not someone else's authentic self. Ok so your an asshole that puts people down and belittles them. Hey that's your authentic self.  What you want to be someone else? First off accept who and what you are. That's it, like it or not.  Now from that position you don't have to fight anything. Just be yourself.  But watch.  Very closely observe.  Don't analyze or judge - watch and observe. All the minute details of your own behaviour.  Meditation twice daily can help.  There you go - th Continue Reading",
            "date": "Answered April 20, 2016",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Roy Fuentes",
                "href": "/profile/Roy-Fuentes"
            },
            "answer_text": "As someone who's spent years seeking my own answer to this answer, I find it starts with a simple fact: to find yourself, you must first know yourself. Who are you? What do you want to do? Where do you want to go? These are among the many questions that one needs to ask to make the first step in the 1000 mile journey towards becoming more complete as a person, and if you keep at it, you'll find that not only will this make your life more fulfilling and interesting, but more importantly, it'll make things a lot more fun for you and the people closest to you.  Interact with the world outside, mak Continue Reading",
            "date": "Answered March 25, 2012",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Keinosuke Johan Miyanaga / 宮永 ヨハン 計之介",
                "href": "/profile/Keinosuke-Johan-Miyanaga-宮永-ヨハン-計之介"
            },
            "answer_text": "This phrase is clearly open to many interpretations, and each to their own, but generally for those looking for something to go on: ﻿We have found ourselves when we a) have a sense that the world we perceive matches the world we experience, b) are where we want to be, and c) feel we have met our expectations as a person, usually in that order.  With it comes a sense of comfort and satisfaction, and the ability to know out of all the things that used to bother us, what doesn't really matter, which can be most of it. With it comes confidence. This is not to be confused with achieving our goals. A g Continue Reading",
            "date": "Answered March 1, 2012",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Abisekh Balakrishnan",
                "href": "/profile/Abisekh-Balakrishnan"
            },
            "answer_text": "Your distinctiveness is your personality so you already have one. But you can shape it well to make better version of yourself. Look through- assess- analyse- formulate- change- continue Self assessment. Think of your good and bad memories and try to anlyze your behavior at those moments.You can ask your close ones to share about your pros and cons ensuring that they are given enough space to tell the truth.Try to relate those things with your memories to confirm.If yes, then try to value those behavior of yours. If not skip to next one.If you get a inner feeling to change something about yourseContinue Reading",
            "date": "Answered July 21, 2019",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jenny Bardoville",
                "href": "/profile/Jenny-Bardoville-1"
            },
            "answer_text": "Hello Paul It does feel like work at first, perhaps even a duty among the friends I have had. At the moment I am spending time in a grateful mood. This implies to me that I am in receipt of some wonderful gifts from that true self, whose has, among others, a genuine desire to delight me. On occasion, I swap places during quiet times, or when consciously creating through imagination the things I want to give Jenny. Then, my mood is delight to be able to gift her exactly what she wants or needs. Since this is not a 24/7 modus operandi, right now, I become Jenny again, in the receptive mode. Keeping  Continue Reading",
            "date": "Answered August 26, 2020",
            "views": "0",
            "upvotes": "0"
        }
    ]
}