{
    "title": "How does one define transcendental subjectivity exactly with regards to Husserl's phenomenology? - Quora",
    "tags": [
        "Phenomenology (philosophy)",
        "Subjectivity",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kelly Head",
                "href": "/profile/Kelly-Head-1"
            },
            "answer_text": "Transcendental subjectivity refers to consciousness as it is in itself. Kant wrote in his Critique of Pure Reason, which initiated his Copernican Revolution in philosophy, “I call all knowledge transcendental if it is occupied, not with objects, but with the way that we can possibly know objects even before we experience them.” So, consciousness is considered as a stand-alone item that may or may not be connected to an external world, other minds, etc. It is the realm of study for the way things appear to a subject. ",
            "date": "Answered June 13, 2016",
            "views": "29",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Md Mafizul Islam Rashed",
                    "user_href": "/profile/Md-Mafizul-Islam-Rashed"
                },
                {
                    "user_id": "Natasa Jankovic",
                    "user_href": "/profile/Natasa-Jankovic"
                },
                {
                    "user_id": "Adam Gerow",
                    "user_href": "/profile/Adam-Gerow"
                },
                {
                    "user_id": "Goran Slekovec",
                    "user_href": "/profile/Goran-Slekovec"
                },
                {
                    "user_id": "Dylan Lee",
                    "user_href": "/profile/Dylan-Lee-96"
                },
                {
                    "user_id": "Tanmay Tamia",
                    "user_href": "/profile/Tanmay-Tamia-1"
                },
                {
                    "user_id": "Brian Wood",
                    "user_href": "/profile/Brian-Wood-74"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Kirby",
                "href": "/profile/Stephen-Kirby-8"
            },
            "answer_text": "Anything in Husserl’s phenomenology is subjective truth, including transcendental subjectivity, which will only get an individual into the 99th percentile of certainty. Anything less than the whole truth is an also-ran in your journey up the mountain of truth which is your life. The responsibility for that last ‘increment’ belongs to you and you alone, without the guidance of another entity or individual. Husserl’s stuff was and is an empiricist’s dream, but it is not the whole truth. Seek truth. Seek, your truth, (without the guidance of another). In consequence, all truth becomes accessible to you. ",
            "date": "Answered June 15, 2016",
            "views": "16",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ajay Kapoor",
                    "user_href": "/profile/Ajay-Kapoor-106"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathan Coppedge",
                "href": "/profile/Nathan-Coppedge"
            },
            "answer_text": "Belief proves understanding is his ultimate claim in the Cartesian Meditations (by Husserl). Following his reasoning however is very difficult. The following writing makes it easier to follow along: Nathan Coppedge's answer to Did Husserl genuinely make a valuable contribution to philosophy or not really? ",
            "date": "Answered October 6, 2017",
            "views": "557",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Moore",
                    "user_href": "/profile/David-Moore-408"
                }
            ]
        }
    ]
}