{
    "title": "How can something be 'about' something else? - Quora",
    "tags": [
        "Philosophy",
        "English (language)",
        "Understanding Human Behavior",
        "Psychology of Everyday Life",
        "Philosophy of Everyday Life",
        "Dating and Relationships",
        "Interpersonal Interaction",
        "Human Behavior",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yon Gardner",
                "href": "/profile/Yon-Gardner"
            },
            "answer_text": "The devious recess’s of the mind, or according to some questionable psychologist’s the ‘drama’ goes on an on an O well, in nature if a tree is coming up on the your right while driving you can’t be driving in England, that is confusing. An approaching tree it is indeed a ‘tree’ and not a carnation or a platipus, why? because it is in fact a “tree”. The human phyche loves to make things about something else and in this doing we smile at our creativity as having made a 3000 year old Douglas about sailling the Caribbean - some how - “Drama” is the makings of somethings of life in really something else’s ? And this happens in our own little brain, dramatizing our life to add color excitment and a reason to be. ",
            "date": "Answered June 23, 2020",
            "views": "28",
            "upvotes": " Answer requested by Drake Lai and Jamel Odison"
        },
        {
            "author_info": {
                "name": "Richard Quenneville",
                "href": "/profile/Richard-Quenneville"
            },
            "answer_text": "If everything living is nothing but a form of matter, writing ‘about’ any given subject would be impossible. Since when did anyone produce a material object about something else? Only the non-material concept could accomplish that! Matter possesses an indeterminacy that only something non-material can overcome! In fact, this difference points the way to the realization that both matter and the non-material exist. Matter is subject to the senses; the non-material isn’t. So something non-material is not subject to the senses, but is only discerned by reason! And only reason can produce anything about something else. ",
            "date": "Answered June 22, 2020",
            "views": "26",
            "upvotes": " Answer requested by Jamel Odison"
        },
        {
            "author_info": {
                "name": "Richard Gibson",
                "href": "/profile/Richard-Gibson-6"
            },
            "answer_text": "Everything is about something else, in the following ways: Buddhists, ecologists, evolutionary biologists, many philosophers, and many physicists believe that everything is connected to everythingLanguage is analogy and metaphor, such that a particular sound and a particular set of scribbles both represent a mental concept, such as “bird,” or “yellow.”And the words “yellow bird\" might be referring to that guy on the branch over there, or every yellow bird in the world",
            "date": "Answered June 16, 2020",
            "views": "55",
            "upvotes": " Answer requested by Drake Lai"
        },
        {
            "author_info": {
                "name": "Brian Fletcher",
                "href": "/profile/Brian-Fletcher-9"
            },
            "answer_text": "If your spouse becomes very angry because the trash was not removed, this was about something else. When ever anybody becomes distressed by circumstances, it is NEVER about those circumstances but ALWAYS about how you respond. In other words all events are about something else…the development of your consciousness…the “soul” reason. ",
            "date": "Answered June 21, 2020",
            "views": "33",
            "upvotes": " Answer requested by Drake Lai"
        },
        {
            "author_info": {
                "name": "David Lipschitz",
                "href": "/profile/David-Lipschitz-2"
            },
            "answer_text": "A pen is about writing. A book is about reading. The sun coming up in the morning is about the earth rotating towards the sun so that the sun appears to come up, but actually the sun doesn’t come up. An “about” describes something else in an easy way. Like an analogy or a parable. ",
            "date": "Answered June 24, 2020",
            "views": "20",
            "upvotes": " Answer requested by Jamel Odison"
        },
        {
            "author_info": {
                "name": "Patrick Bouchaud",
                "href": "/profile/Patrick-Bouchaud"
            },
            "answer_text": "Your question is a good example. Despite your emphasis on the word ‘about’, it’s not about ‘about’. So what is it about? Maybe something ‘else’. Leibniz defines entelechies as souls with appetites. something like that.. ",
            "date": "Answered June 16, 2020",
            "views": "35",
            "upvotes": " Answer requested by Drake Lai"
        },
        {
            "author_info": {
                "name": "Marcus Lester",
                "href": "/profile/Marcus-Lester-2"
            },
            "answer_text": "The cookie is all about making the boy smile. The horse is all about growing the little girl’s confidence, skill, and knowledge. The mask is all about not infecting the old person over there. All of them are all about love. ",
            "date": "Answered June 16, 2020",
            "views": "19",
            "upvotes": " Answer requested by Drake Lai"
        },
        {
            "author_info": {
                "name": "Carol Willis",
                "href": "/profile/Carol-Willis-35"
            },
            "answer_text": "Meta-analysis in science is a statistical analysis of multiple scientific studies. It’s a study about studies, or data about data. Meta-analysis - Wikipedia . Why Perform a Meta-Analysis. “Meta (from the Greek μετά-, meta-, meaning \"after\" or \"beyond\") is a prefix meaning more comprehensive or transcending.” Meta - Wikipedia. Meta-___________ is a higher level or bird’s eye view, whether beyond the multiplicity of various scientific studies; an abstract view of something more concrete (e.g. the view of Earth from space); a view beyond the physical; or concerning what is beyond the physical (metaphysics). ",
            "date": "Answered June 21, 2020",
            "views": "49",
            "upvotes": " Answer requested by Drake Lai"
        },
        {
            "author_info": {
                "name": "David Lindmeier",
                "href": "/profile/David-Lindmeier-2"
            },
            "answer_text": "It’s a metaphor. ",
            "date": "Answered July 3, 2020",
            "views": "16",
            "upvotes": " Answer requested by Drake Lai and Jamel Odison"
        }
    ]
}